{
  "sid": "68eu35",
  "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/",
  "title:": "Professors, what is your best professor hack?",
  "text": "What tip or process do you use that makes your life as a professor easier in terms of grading, time management,  classroom management, research/publishing, etc? \n\n",
  "author": "thoughtsandthefeels",
  "created": 1493548210,
  "updated": 1634081997,
  "over_18": false,
  "upvotes": 95,
  "upvote_ratio": 0.95,
  "comments": {
    "dgy6f1n": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy6f1n/",
      "text": "Grading:\n\n* Challenge every assignment: is it really needed? What purpose does it serve? Would a shorter / easier to grade assignment serve this purpose better?\n* Challenge the number of assignments: can you remove one? Don't create busywork.\n* Taking feedback is hard, so there's no point in critiquing more than one point at a time. If aspect A needs to be improved the most, don't even comment on aspect B for a while.\n* Students don't understand complicated rubrics, so don't use complicated rubrics.\n\nTeaching:\n\n* Sometimes you don't need to prepare for classes in-depth, as most important confusions lie on the surface, and improvising with the blackboard, in dialogue with the students, may actually be more useful for them.\n* But if you need to prepare, prepare well so that you could reuse it fully next year.\n* If something didn't work, or you have an idea, write it down *now*; your future you (in a year) will be very grateful.\n* Use your own work / things you think about in your research at least once a semester; it makes it easier for you, and more fun for them.\n* Don't be afraid to teach fun topics instead of \"useful topics\"; \"standard courses\" are overrated. Your goal is not to bring them from point A to point B, but to encourage them to get there themselves. Emotion is more important than content or skill-drills.\n\nClassroom:\n\n* Push as much work as you can to the students. Use things like reflective writing, discussions, pair-share, peer-review. Make them submit questions before class instead of generating all questions for them. Bounce their questions back to them. It so happens that most techniques that are proven to be more effective in teaching are also *easier* for the teacher, even if they feel risky and weird. Learn the best practices from good books, and use them to your advantage.\n\nResearch (from a SLAC perspective):\n\n* Integrate research with teaching in all ways possible.\n* Use labs for pilot experiments, to troubleshoot your methods.\n* Use honors theses for pilot experiments, to generate some data.\n* Bend upper college courses towards your current interests, to give you an excuse to read a few more reviews / primary papers.\n\nTime management:\n\n* Schedule in chunks of few hours; don't break chunks. Don't give in to temptation to use these chunks for urgent matters. If it's research time, do research.\n* Do only things that are either important (even if they are unpleasant), or that you like to do (even if it feels that you're indulging yourself). Don't do kind-of-useful things that you don't like. Nobody cares about them anyway, and they drain your willpower stamina. Only critical strikes + fun stuff. That's what makes the difference.\n* I'm now using gmail + google keep, but I plan to try google inbox next semester. Some kind of GTD-inspired personalized approach is definitely critical in our trade.",
      "author": "ampanmdagaba",
      "created": 1493568404,
      "upvotes": 88,
      "replies": {
        "dgyx5vb": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyx5vb/",
          "text": "> Challenge every assignment:\n\nI really do not like lecturing longer than 25 mins so I try to have some activity of sorts for classes. But find if I don't make it a graded assignment, the students do not take it seriously. \n\nAny advice on how to have a more hands-on activity that doesn't result in work to grade but incentivizes students to participate and attend?",
          "author": null,
          "created": 1493604030,
          "upvotes": 6,
          "replies": {
            "dgyxljk": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyxljk/",
              "text": "I guess it varies greatly by class size, school type, and reasons students take the class (required, intro, weed-out, core, premed, remedial etc.)\n\nBut in most classes I think it's possible to make assignments fun. Use pointed case studies. Provocative questions. Make students pre-write, then discuss, then argue. Make them take a stand. Link it to something they care about. Make them realize they have a stake in the game.\n\nIt may take lots of time to develop a good assignment like that, but sometimes they lie on the surface. Link it to recent news, or make students submit their \"confusions\" after they read a chapter, and pick the most frequent confusion. Find something they care about (or are able to care about, after some prodding, hooking, and anchoring).\n\nIn hopeless cases you can grade based on \"honest effort\" (basically 0 for absent, 1 for present, 2 for active). Make them submit an \"exit ticket\", and then grade on a 0/1 scale. But this sounds a bit like trickery, so while it's OK, and may be even necessary early one, as you develop the classroom culture, hopefully at some point intrinsic motivation would emerge. Just make sure to pick fun topics, if you have control over it, or link to important case studies if you don't.",
              "author": "ampanmdagaba",
              "created": 1493604647,
              "upvotes": 5,
              "replies": {}
            },
            "dgyyrlp": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyyrlp/",
              "text": "Like the other person who replied to you said, using an exit ticket is an easy way to force attendance. In addition, I found that my most engaging classes used something like an iclicker to grade not only attendance, but participation. It was a good way to incentivize attendance, with the added bonus on clearing up what material your students struggle with. I found those mini quizzes very helpful in focusing what I devoted my study efforts towards. Additionally, it allowed the professor to see in real time what proportion of students got the question right, and adjust how much time she devoted to explaining the answer. So if 95% got it right, she'd briefly go over why it was correct, whereas if it was split evenly among more than 1 answer, she would spend more time going into the specifics. \n\nThe professor I had that used this best taught a medical microbiology class, and she would have 3-4 questions per lecture, with ~ 5 minutes after each question to answer student questions and clear up misconceptions. Additionally, the way the class was set up was that it met Tuesday/Thursday for 1.5 hours. Each week's Tuesday would be lecture based from the textbook, while Thursday was devoted to going over/analyzing a research paper about the bacterial/viral class covered that week. It gave us a good opportunity to ask questions about the material, while learning how to analyze a research paper and engaging the class with current research methods.",
              "author": "imanoctothorpe",
              "created": 1493606292,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "dh0aqm9": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dh0aqm9/",
          "text": "> Classroom:\n> Push as much work as you can to the students. Use things like reflective writing, discussions, pair-share, peer-review. Make them submit questions before class instead of generating all questions for them. Bounce their questions back to them. It so happens that most techniques that are proven to be more effective in teaching are also easier for the teacher, even if they feel risky and weird. Learn the best practices from good books, and use them to your advantage.\n\nIncluding undergrad and masters, I'm in my 8th year of coursework, and I've never had a teacher do this in a way that was particularly effective or enjoyable. I know it can be done, but it seems difficult to pull off. Usually it just comes off like my profs are looking for ways to get out from being in front of the class, lecturing.",
          "author": "80lbsdown",
          "created": 1493683219,
          "upvotes": 2,
          "replies": {
            "dh0hs38": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dh0hs38/",
              "text": "> Usually it just comes off like my profs are looking for ways to get out from being in front of the class, lecturing.\n\n1) It's possible, but it does require preparation, and some sort of.. tact? I won't claim that I always do it right; I'm sure in many cases it looks awkward. But it gets better as students get into the rhythm.\n\n2) These methods are proven to be effective in terms of actual learning. They are NOT most fun. Studies show that lectures are always rated by students higher than active learning, even though students learn consistently less. A good lecture, like a good talk, gives you an illusion of effortless understanding. You fly, carried by the rhetoric and the charisma of the speaker. And for a few seconds it feels like you understand. But then you step out of the auditorium, and realize that you cannot retell the talk to your friend.\n\nIt's great for academic talks and commencement speeches, but it is not great for education. Most effective classes are not effortless; they may feel hard, even tedious. That's why emotions are so important: a good teacher needs to overcompensate, making their course so exciting that students would be _even agree to actually learn in it_.",
              "author": "ampanmdagaba",
              "created": 1493691660,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "dgyhm0p": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyhm0p/",
      "text": "Before each class, I look at the class registration list with photos and memorize the names of 5-6 students. Then I look at them and call them by their name--not so much as in quizzing them but just in casual conversation \"So, Mike when this problem looks like this, we do this...etc.\". Even in a very large class, this will leave the impression that you take personal care (well, I do).",
      "author": "unreplicate",
      "created": 1493583088,
      "upvotes": 23,
      "replies": {
        "dgyidzy": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyidzy/",
          "text": "I love this idea. I still remember a professor I had in undergrad who took all of our pictures in the first day and memorized our names before the next class period. I only had one class with her, but on graduation day (two years later!) She congratulated me by name. That meant so much to me.",
          "author": "thoughtsandthefeels",
          "created": 1493584120,
          "upvotes": 7,
          "replies": {}
        },
        "diqglef": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/diqglef/",
          "text": "I wrote some code to take the auto-generated photo roster pages and turn them into a little quiz.  I used to spend about an hour per class to physically cut and paste the pictures and names into index cards.  Now I spend about 15 minutes per class total and I can greet most of the students by name on the first day as they walk in the door.",
          "author": "paithanq",
          "created": 1497136126,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "dgy7hhb": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy7hhb/",
      "text": "Try to avoid unpleasant people when choosing collaborators for research, teaching, etc. Even if they're good in other ways, it's rarely worth it: managing them can take a lot of time and energy. Of course, this isn't always possible, but at least keep it in mind. ",
      "author": "omearabrian",
      "created": 1493569886,
      "upvotes": 21,
      "replies": {}
    },
    "dgy6wtk": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy6wtk/",
      "text": "For tenure-track professors at an R1:  Put *ALL* your effort into research in your first 3 years, accept crappy teaching evaluations (phone it in in your classes).  Starting in your 4th year, switch to focusing on teaching.  Any research projects will be on a trajectory to bear fruit if they're going to (so you get the research output up to tenure) and you'll show an improvement in your teaching that tells the committee that you're capable of developing as a teacher and will over time.  It isn't the end of the world if your research productivity has a bit of a dip after you get tenure...",
      "author": "TADodger",
      "created": 1493569102,
      "upvotes": 51,
      "replies": {
        "dgynsmt": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgynsmt/",
          "text": "[deleted]",
          "author": null,
          "created": 1493591105,
          "upvotes": 14,
          "replies": {
            "dgyqy64": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyqy64/",
              "text": "At researched-focused institutions, the culture is such that you need to bring in money for the university or you are useless to them. Research takes precedence over everything. I hate that mindset, but it is what it is. I imagine most professors going into those types of schools know what they are getting themselves into.\n\nStudents get the short end of the stick, but the upside is the name of the school on your degree.",
              "author": "ilessthan3math",
              "created": 1493595543,
              "upvotes": 16,
              "replies": {
                "dgz4r4y": {
                  "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgz4r4y/",
                  "text": "The culture you write about is why I steered away from academia. I love to teach. It's bizarre that teachers' top priority is sometimes not teaching. ",
                  "author": "2four",
                  "created": 1493616799,
                  "upvotes": 1,
                  "replies": {
                    "dhjef3q": {
                      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dhjef3q/",
                      "text": "> It's bizarre that teachers' top priority is sometimes not teaching. \n\nWell there's the problem: they're not necessarily teachers.  They're professors, and many think of themselves as researchers who have been told they have to teach in order to keep their research job.",
                      "author": "polyphonal",
                      "created": 1494755249,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "dgy91ct": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy91ct/",
          "text": "[deleted]",
          "author": null,
          "created": 1493571987,
          "upvotes": 3,
          "replies": {
            "dgy9niu": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy9niu/",
              "text": "Do the service you have to, in as little time as possible and don't pick fights by being an asshole.",
              "author": "TADodger",
              "created": 1493572800,
              "upvotes": 19,
              "replies": {
                "dgythcq": {
                  "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgythcq/",
                  "text": "\"...and don't pick fights by being an asshole.\"\n\nNo can do, but thanks. ",
                  "author": "Tatta_Tatta",
                  "created": 1493599103,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "dgyhgwh": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyhgwh/",
              "text": "Service =/= points\n\nNot service = hate.\n\nDoing a lot of service won't get you tenure, but if you refuse to do service or you are an a$$ about it, don't expect anybody to rescue you if your case isn't water tight.",
              "author": "unreplicate",
              "created": 1493582898,
              "upvotes": 13,
              "replies": {}
            },
            "dgysz2t": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgysz2t/",
              "text": "At my school (R2) they want you to check off the boxes- basically at last one significant department thing every year except your first, at least one college-level activity and one university-level activity before tenure. Professional level stuff makes you look good and was mentioned in my tenure documents, but is not required.  But it's good for networking professionally and can be kinda fun in my experience (I've done a couple of professional committees and conference organizing stuff and it's fun getting to know other people in my profession and getting to read all the research that is cutting edge looong before it's published..).\n\nWe have a junior person now who has turned down a couple of grad students in terms of being on their committees and did not do anything major for the department this year and people are starting to grumble that he is only out for his own career and isn't pulling his weight .  ",
              "author": "abandoningeden",
              "created": 1493598393,
              "upvotes": 3,
              "replies": {
                "dgyu016": {
                  "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyu016/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1493599843,
                  "upvotes": 1,
                  "replies": {
                    "dgyxa4o": {
                      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyxa4o/",
                      "text": "We only have around 20-30 people total in an MA program and 12 faculty who each cover different areas...you are pretty much expected to serve on the committees of people who ask if they fall within your area unless you have a really good reason not to.  Being on more than 2-3 committees in a given year would be a good reason if you were not tenured, but there are some untenured people in high demand areas who are on like 6-8 committees right now. ",
                      "author": "abandoningeden",
                      "created": 1493604197,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "dgy3ynh": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy3ynh/",
      "text": "ZipGrade.  It's 6 bucks a year, lets you grade multiple choice tests by photographing them with your phone. Students like getting immediate grades. I like not wasting time on something that should be automated. It's more convenient than using scantron sheets - at my school you have to submit them to an office to be scanned. Besides, students like getting their scores right away.",
      "author": "nezumipi",
      "created": 1493564821,
      "upvotes": 27,
      "replies": {
        "dgyavo9": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyavo9/",
          "text": "6 Bucks a year? How do they come up with 50c a month, that's awesome.",
          "author": null,
          "created": 1493574354,
          "upvotes": 4,
          "replies": {
            "dgyczch": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyczch/",
              "text": "They're probably operating at a loss for now, in order to grow their userbase. They can make money after they're popular--similar business model to Uber/Lyft/Spotify/etc. But instead of raising prices once they have a sufficient market share, in this case they are probably gunning for contracts with universities.",
              "author": null,
              "created": 1493577076,
              "upvotes": 4,
              "replies": {
                "dgyd3as": {
                  "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyd3as/",
                  "text": "I think dropbox more famously did this aswell",
                  "author": null,
                  "created": 1493577221,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "dgxzeay": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgxzeay/",
      "text": "Google Inbox instead of gmail. Every email is a to-do item that I can delete, check as done, or snooze until I have time to deal with it. I don't ever feel like I have an unwieldy email backlog anymore. ",
      "author": "respeckKnuckles",
      "created": 1493556872,
      "upvotes": 25,
      "replies": {
        "dgyabnr": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyabnr/",
          "text": "I tried this and it drove me nuts to have Google order things for me. Is it worth giving it another try?",
          "author": "AerosolHubris",
          "created": 1493573631,
          "upvotes": 5,
          "replies": {}
        },
        "dgya2sn": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgya2sn/",
          "text": "Second this! I use Google Inbox to organize my emails, so each project (that tends to just be on one email thread) is a pinned item. It makes it much easier to see who I need to get back to, etc.",
          "author": "Theutates",
          "created": 1493573324,
          "upvotes": 3,
          "replies": {}
        },
        "dgy8g3z": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy8g3z/",
          "text": "Waaaaiiiit, what? Does it port automatically from your standard email?",
          "author": "Prof_Acorn",
          "created": 1493571204,
          "upvotes": 5,
          "replies": {
            "dgymdzm": {
              "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgymdzm/",
              "text": "Yeah, it's connected to gmail.",
              "author": "respeckKnuckles",
              "created": 1493589240,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "dgy11ie": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy11ie/",
      "text": "I realized I forgot to add mine! Mine is, whenever I'm working on research, instead of trying to block out huge, uninterrupted blocks of time (which are hard to come by), I break it up into very small tasks and do 1-2 tasks a day over a really long period. That keeps it from being overwhelming for me. For instance, If I'm gathering sources, I will collect and annotate no more than 1 or 2 per day, that's it. The only thing is when I use this method, I must work every day, no exceptions! But it's not a pain because the task is so small.",
      "author": "thoughtsandthefeels",
      "created": 1493560035,
      "upvotes": 20,
      "replies": {
        "dgy46qb": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgy46qb/",
          "text": "This is my process with research and with grading. Of course I work 7 days a week at this point in the semester.",
          "author": "mylifeisprettyplain",
          "created": 1493565158,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "dgyshob": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgyshob/",
      "text": "google images search to find graphs, charts and all sorts of visuals for powerpoints in class.  Encyclopedia entries are great for copying and pasting into lesson plans when you are trying to explain basic concepts.  A lot of textbooks have powerpoints that profs can download from their website. \n\nFor research- finding a weekly writing group /buddy means I am guaranteed to write for at least a coupe of hours a week because I have a standing appointment and can't cancel on my friend.  We meet in a coffee shop where I don't know the internet password and avoid learning it. \n\nClassroom management- in some classes (Specifically stats) I've started doing a \"text break\" in the middle of class and tell them I will take it away if I see them texting outside the break. It's good to have a break in the middle of stats anyway because it's hard to stay focused that long.\n\nAlso, get out from behind the podium and walk up and down the aisles. I make it a point to walk all the way to the back of the classroom in my 60 person class at last once a week. Students are much more engaged and pay attention more/text less.  ",
      "author": "abandoningeden",
      "created": 1493597730,
      "upvotes": 8,
      "replies": {}
    },
    "dgzjev2": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgzjev2/",
      "text": "For grading, I do \"opt-in\" feedback. \n\nIt takes hours and hours to write out thoughtful feedback on written assignments, and a lot of students never even look at it. When they do, it's often a casual glance. I post grades for assignments and the following class period make it very, very clear I'm happy to give feedback during office hours, it's my job, and that it's no problem at all. \n\nIn two years of this approach I've had probably 2 people ask for feedback, and saved countless hours grading. As a new TT assistant, I just don't have the time to work on something that doesn't create benefit for them or me. I think the time is better spent on prepping my in-class teaching or working on research.",
      "author": "buspsych",
      "created": 1493650756,
      "upvotes": 3,
      "replies": {
        "dgznxra": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgznxra/",
          "text": "I'm intrigued. Do you think your department head would care if you were doing this?\n",
          "author": "nc_bound",
          "created": 1493656270,
          "upvotes": 3,
          "replies": {}
        },
        "dgzjgm0": {
          "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgzjgm0/",
          "text": "This is brilliant!",
          "author": "thoughtsandthefeels",
          "created": 1493650820,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "dgzohpq": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dgzohpq/",
      "text": "I teach topics that I find interesting, and ditch the ones I don't. Probably not possible for some classes. Doing so energizes my prep, and my delivery. More fun for everyone.\n\nrelated: \"the tyranny of content\":\n\nhttp://cluttermuseum.blogspot.com/2008/05/slap-in-face-tyranny-of-content-and.html",
      "author": "nc_bound",
      "created": 1493656918,
      "upvotes": 2,
      "replies": {}
    },
    "diqg9t7": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/diqg9t7/",
      "text": "If you're comfortable creating documents in LaTeX, I've been working on a package to support a Socratic teaching style.  I set it up so you can hide the answers to questions and create a version of the notes for students.  [Package homepage](http://turing.plymouth.edu/~kgb1013/lectureNotesLatexStyle.php)\n\nSorry I'm late posting this.  I've been cleaning up the code recently.",
      "author": "paithanq",
      "created": 1497135643,
      "upvotes": 2,
      "replies": {}
    },
    "dh0qmf0": {
      "link": "/r/AskAcademia/comments/68eu35/professors_what_is_your_best_professor_hack/dh0qmf0/",
      "text": "politics ... i've talked my way into a huge amount of funding and got admin dumped on my colleagues.\n\nthis comes from spending 8 years in non-english-speaking countries where i learned to operate on non-verbal queues while i learned the languages. now, operating in an english-speaking country is a piece of cake.\n\nsave yourself a shitload of work by making friends with the HoS/Dean/VC",
      "author": "af_7",
      "created": 1493706099,
      "upvotes": 0,
      "replies": {}
    }
  }
}