{
  "sid": "q4plsb",
  "link": "/r/AskAcademia/comments/q4plsb/cv_advice_listing_paper_w_team_authorship/",
  "title:": "CV advice? Listing paper w/ team authorship",
  "text": "Hi all, I'm working on my CV for grad school and have a question for seasoned academics. I work at a company where some of my colleagues and I occasionally publish white papers about our work (they are social science papers). I have previously publicly listed my name on one; naturally, that paper is listed on my CV.\n\nHowever, sometimes in our white papers, we are calling out specific powerful entities for bad behavior. In these cases, we often choose not to list our names (we just list our team name) due to security concerns.\n\nThat said, I don't mind listing the paper on a CV that will only go to a grad admissions committee rather than the general public. Is there an appropriate way to list something like this on a resume? Or should I avoid listing it at all, even though I wrote it?",
  "author": "Educational-Bison-67",
  "created": 1633799735,
  "updated": 1634078401,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hg0de11": {
      "link": "/r/AskAcademia/comments/q4plsb/cv_advice_listing_paper_w_team_authorship/hg0de11/",
      "text": "A few considerations:\n\n1. Do not list the co-authors who published white papers anonymously.\n\n2. If you do list the white papers, do make clear that you were one of several authors (you might note the total number of authors).\n\n3. I think it's fine to have a section titled \"White Papers\" or \"Additional Works\" or something like that, and list any anonymous white papers disseminated to the public on your CV, noting that they were published anonymously and that you were one of X number of authors. Going into grad programs, I definitely get the desire to list any and all research/scholarship you've contributed to, including making sure that something like this counts.",
      "author": "jogam",
      "created": 1633804363,
      "upvotes": 6,
      "replies": {}
    }
  }
}