{
  "sid": "p0qeaz",
  "link": "/r/AskAcademia/comments/p0qeaz/i_may_have_submitted_an_abstract_to_a_fake/",
  "title:": "I may have submitted an abstract to a fake conference",
  "text": "Hi, I was after a bit of help please.\n\nI submitted an abstract for a poster to what is likely a fake conference. In hindsight I'm pretty stupid for not looking at the website properly, and now realise I'm not nearly as street smart as I once thought. Website linked below.\n\nI have no idea what will happen next as I've never submitted an abstract to anywhere before. Presumably I will get an email saying that it has been accepted, and then ask me to pay registration fees to attend. I obviously won't be paying or attending. My main question is whether or not this affects my research in any way. Can the same abstract still be submitted elsewhere? I did not click any boxes for transfer of copyrights etc. and as far as I can see there's nothing to imply rights on any part of the website (WASET has this on theirs). I could always go through the contact us portal and ask to revoke my submission, but my feeling is that they just won't respond. I don't know what the outcome of this will be or how to proceed, so any advice would be greatly appreciated as I'd prefer not to lose my research.\n\n&#x200B;\n\nWebsite: [https://www.pagesconferences.com/publichealth/index.php](https://www.pagesconferences.com/publichealth/index.php)",
  "author": "Throwawayplz95",
  "created": 1628468610,
  "updated": 1634079963,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.71,
  "comments": {
    "h88d2pn": {
      "link": "/r/AskAcademia/comments/p0qeaz/i_may_have_submitted_an_abstract_to_a_fake/h88d2pn/",
      "text": "Withdrawing your work from a conference shouldn’t affect anything.",
      "author": "ProfAbroad",
      "created": 1628469685,
      "upvotes": 13,
      "replies": {
        "h88dfbz": {
          "link": "/r/AskAcademia/comments/p0qeaz/i_may_have_submitted_an_abstract_to_a_fake/h88dfbz/",
          "text": "Thanks. I suppose my question is moreso if I do request withdrawal, do I have to wait for the conference to confirm that the withdrawal has been received before I can submit elsewhere? My concern is that they may just not respond, and the last thing I'd want is for them to end up publishing it in some shady way and I've submitted the work elsewhere to somewhere more reputable in the meantime.\n\nWould I be correct in saying that if I contact them and ask for withdrawal, then the onus is on them to actually withdraw it? And I'm then able to submit wherever else I want?",
          "author": "Throwawayplz95",
          "created": 1628469868,
          "upvotes": 2,
          "replies": {
            "h88e4tg": {
              "link": "/r/AskAcademia/comments/p0qeaz/i_may_have_submitted_an_abstract_to_a_fake/h88e4tg/",
              "text": "You can probably just ignore them and everything will be fine. If you don’t register and pay they aren’t going to put it in a program or publish it. In any case you are allowed to present basically the same paper at multiple conferences in general. This depends a bit on whether they publish the actual paper or not but if you only sent them the abstract you are fine.",
              "author": "ProfAbroad",
              "created": 1628470238,
              "upvotes": 11,
              "replies": {
                "h88ewjv": {
                  "link": "/r/AskAcademia/comments/p0qeaz/i_may_have_submitted_an_abstract_to_a_fake/h88ewjv/",
                  "text": "Thank you very much for your help, you've put my mind at ease.",
                  "author": "Throwawayplz95",
                  "created": 1628470640,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h88zn8e": {
      "link": "/r/AskAcademia/comments/p0qeaz/i_may_have_submitted_an_abstract_to_a_fake/h88zn8e/",
      "text": "It’s your proposal / abstract. So you technically fit even need to withdraw. I went waste time on that & just submit it elsewhere — esp since it’s not a real conference anyway.",
      "author": "is0120",
      "created": 1628482070,
      "upvotes": 3,
      "replies": {}
    }
  }
}