{
  "sid": "p9as10",
  "link": "/r/AskAcademia/comments/p9as10/reference_letters_for_history_jobs/",
  "title:": "Reference Letters for History Jobs",
  "text": "Hello Reddit!\n\nMy friend is applying to a prestigious postdoc that asks for only two letters of reference. He is torn between two potential historians who often write for him: 1. a full professor who is a leading scholar in her field and an alumna of the university or 2. an assistant professor, of less scholarly renown, who currently teaches at the university. Are there any hidden advantages, or downsides, to either one? \n\nAny advice would be most appreciated.",
  "author": "AfricanusCole",
  "created": 1629631395,
  "updated": 1634079526,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.7,
  "comments": {
    "h9we026": {
      "link": "/r/AskAcademia/comments/p9as10/reference_letters_for_history_jobs/h9we026/",
      "text": "You haven't given any context as to why this is a dilemma. Of course, all things being equal, the more established professor is the better reference. But the real test isn't who has the better credentials, but rather, who knows your friend better, and is willing to write the strongest reference.",
      "author": "phonograhy",
      "created": 1629632713,
      "upvotes": 10,
      "replies": {
        "h9x02ww": {
          "link": "/r/AskAcademia/comments/p9as10/reference_letters_for_history_jobs/h9x02ww/",
          "text": "And if it is really, truly a toss-up, then just send them an extra letter. They'll either read it or they won't, but they won't disqualify you because there is one extra letter. Letters are the easiest (and often most pleasant) part of an application to read.",
          "author": "restricteddata",
          "created": 1629644764,
          "upvotes": 2,
          "replies": {}
        },
        "h9xl155": {
          "link": "/r/AskAcademia/comments/p9as10/reference_letters_for_history_jobs/h9xl155/",
          "text": "Thanks for this advice. Reading my original post over, I realize that I wasn't clear -- when I said \"alumna of/currently teaches at the university,\" I meant the university that offers the postdoc to which he is applying, not the one from which he received his PhD.\n\nSlightly more information (don't want to disclose too much):\n\nFull professor - knows him as a student, was on the diss committee\n\nAssistant professor - knows him as a colleague, from when he completed a prior fellowship.",
          "author": "AfricanusCole",
          "created": 1629653780,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}