{
  "sid": "arvoej",
  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/",
  "title:": "Quitting after 8 years",
  "text": "It has been a horrible experiance full of stress and misery. I didn't managed to publish anything (unusual in my field). Even though I do have publishable research, however I feel it's too late. I'm burnt out and tired and just want to quit..i don't see it happening, I just don't see it happening..\n\nP.s. I'm in an American school where avg PhD takes around 5.5 years\n",
  "author": "Zalatan654",
  "created": 1550483674,
  "updated": 1634081829,
  "over_18": false,
  "upvotes": 115,
  "upvote_ratio": 0.95,
  "comments": {
    "egq2qak": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq2qak/",
      "text": "My suggestions would be.\n\n1. take some time off, maybe a few weeks, just relax and forget everything and switch your brain off. \n2. come back and have a meeting with your supervisor about what is the absolute minimum amount of work needed to produce a passable PhD thesis. Not a good thesis, one which will pass a viva. Make a plan for how you're going to land the plane with the least amount of effort from this point. \n\nYou should have a lot of leverage in this discussion because it's not good for your supervisor to have a student quit after such a long time. There clearly has been some mismanagement here. If they try to push you into doing extra work or whatever just say no. Do the absolute minimum from here on out.\n\nMy guess would be that even if you don't have 1 word of a Thesis with the material you have you can write one and submit within 6 months. \n\nHopefully it will be easier if you can see the light at the end of the tunnel. Good luck :)",
      "author": "parkway_parkway",
      "created": 1550490905,
      "upvotes": 143,
      "replies": {
        "egq6onw": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq6onw/",
          "text": "This. Write the thesis with the data you have. Defend and graduate. Get a job in industry. ",
          "author": "holidaySocks2018",
          "created": 1550496184,
          "upvotes": 66,
          "replies": {
            "egrvphs": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egrvphs/",
              "text": "> Defend and graduate. Get a job in industry. \n\nAnd just be happy. Academia is a ponzi scheme, we're all just hoping we get to be at the top of the pyramid.",
              "author": "stjep",
              "created": 1550543670,
              "upvotes": 5,
              "replies": {
                "egs0tfz": {
                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egs0tfz/",
                  "text": "This saddens me :(\n\nAre there industry jobs that have research environments/schedule similar to academia? I interned at labs and I really like the work, but talking to the postdocs it seems hard and sometimes soul-draining as hell...\n\nI'm trying to decide, while I still have the luxury to, between doubling down on academia or industry job. How likely is someone in the industry, applying for a Masters/PhD and coming back?",
                  "author": "YoroSwaggin",
                  "created": 1550547875,
                  "upvotes": 2,
                  "replies": {
                    "egs4w03": {
                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egs4w03/",
                      "text": "It's just the nature of the position. There is one professor who is going to train how many dozen students in the same thing. Only way any of those students can be a professor in that same thing is for their mentor to retire, or for a position to appear elsewhere.\n\nYou get that slimming as you go along the entire academic track, it just gets worse as you go from PhD to Postdoc and from Postdoc further along the chain.\n\n----\n\nAs for industry jobs, I have no idea. I'm a postdoc, so my industry experience is seeing all my friends leave and get their weekends/weeknights back ;-)",
                      "author": "stjep",
                      "created": 1550551602,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "egrlnvg": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egrlnvg/",
          "text": "> because it's not good for your supervisor to have a student quit after such a long time\n\nJust out of curiosity, because I'm in a similar boat to OP, why? How would it affect a tenured professor?",
          "author": "capellablue",
          "created": 1550535401,
          "upvotes": 3,
          "replies": {
            "egsiana": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egsiana/",
              "text": "I'm in the UK and the way they allocate funding for PhD students is dependent on the outcomes of the previous ones. So if you reported someone had been there for 8 years and not passed they would probably be less keen to give you money in the future, if it's just one person in a large department nothing would probably happen, if it was a pattern you might find it hard to get funding in the future. \n\nNot sure how it works in the US.",
              "author": "parkway_parkway",
              "created": 1550568920,
              "upvotes": 3,
              "replies": {
                "egsxkdm": {
                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egsxkdm/",
                  "text": "Thanks for the response. I’ve been going back and forth for a while now about withdrawing, and if I do, I want to understand how that would affect everyone involved. I am in the US, so it is a little different, but I think it will not affect either of my advisors. One has full tenure and is nearing retirement, while the other has a dual appointment at a national lab and is at the associate professor level (tenured, but not fully). When I’ve discussed leaving with the department head and associate dean, they both said that it would be bad for me and the university. I get why it would not be good for me, I would be walking away after seven years with only my master’s to show for it, but no one seemed to be willing to explain why it would be bad for the department or university.\n\nI don’t think it would hurt either of them.",
                  "author": "capellablue",
                  "created": 1550587341,
                  "upvotes": 2,
                  "replies": {
                    "egsz90i": {
                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egsz90i/",
                      "text": "If you've been there so long what barriers remain to getting a thesis submitted?",
                      "author": "parkway_parkway",
                      "created": 1550588649,
                      "upvotes": 3,
                      "replies": {
                        "egz6l3i": {
                          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egz6l3i/",
                          "text": "Honestly, I am burned out. I submitted my thesis back in September, but neither of my advisors read it until it was too late to make corrections by the semester drop date. So now I'm spinning my wheels until May. I will finish, but I don't want to do this anymore, and I need paying work.",
                          "author": "capellablue",
                          "created": 1550779175,
                          "upvotes": 1,
                          "replies": {
                            "egzdho1": {
                              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egzdho1/",
                              "text": "That sucks. I'm glad you're so close though, that's pretty nice. The last bit is the hardest but from here it's def worth it. A PhD is a cool thing which lasts for life. It will boost your lifetime earnings a lot too so in the long run finishing is the best financial choice.\n\nGood luck.",
                              "author": "parkway_parkway",
                              "created": 1550783765,
                              "upvotes": 2,
                              "replies": {
                                "eh10qum": {
                                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/eh10qum/",
                                  "text": "Thanks. Ninety-nine days left at the latest, I guess.",
                                  "author": "capellablue",
                                  "created": 1550842311,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "egpzpn8": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egpzpn8/",
      "text": "8 years ? that's just bad supervision at this point. I'm sorry for you (I'm 3rd year phd and can only imagine what you've been through as I'm considering quitting too).  \n\n\nHave you tried to talk to someone ? psychologist, counselor, your supervisors (although I'm assuming they don't really care anymore). This is very likely to help you going through that difficult phase, which is, considering your message, a much bigger priority than thinking about your publication or your diploma. Protect your mental health, think about yourself, take a 1 week break (if that's possible).  \n\n\nHang in there man (woman ?), the way I see it, succeeding in Academia is not really about skills or abilities (if you didn't have those, you wouldn't have been accepted anyway), but rather determination and good partnership with your colleagues / supervisors. But sometimes it's not enough to satisfy expectations (yours & Academia's), and so sometimes you just need to leave (which is OKAY, really).  \n\n\nNo matter what you do in the end, there is no rush. Take a deep breath, talk to someone, let it go, and then after a few days of **not working** and not thinking about work, go back to your supervisors and talk to them about your situation (both your phd and the way it affects you). Make a decision together, it will help you not to put too much pressure on yourself.  \n\n\nWhatever you do, remember : those 8 years were not made in vain. You developed many skills and you also learned a lot about yourself and how you need to work, it's a valuable.",
      "author": "ScepticalFrench",
      "created": 1550485793,
      "upvotes": 51,
      "replies": {
        "egq0xqj": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq0xqj/",
          "text": "Thanks for the reply, I contemplated quitting 3 years ago but family talked me out of it. \nI discussed my progress with my committee and what they said basically is that you have to finish x and y and you're good to go. But I'm totally depressed and can't seem to be able to do any work at this stage, it's like a mental shutdown...\n\nI feel I may just pack and disappear, I won't even bother giving a notice my supervisors or the department ...let that bridge burn, I don't really care anymore",
          "author": "Zalatan654",
          "created": 1550487900,
          "upvotes": 25,
          "replies": {
            "egq14pn": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq14pn/",
              "text": "I suffered from depression during my PhD. I was offered help by the research dean which then didn't materialise. I ended up dragging myself out of the depression with the help of my wife and best friend (now a Professor) and finished in 5 years rather than 3 (officially 6 due to corrections/delayed graduation). \n\n&#x200B;\n\nYou'll have to do it yourself, a PhD is a lonely venture, so reach out to your direct network if you have it. In the end I am proud of achieving my doctorate, but for a year after finishing I didn't acknowledge it as anything special, just 'that project'. I didn't publish from my work (I had/have two very publishable pieces of work). and don't intend to. I was awarded the PhD and that was the end of that project for me.\n\n&#x200B;\n\nTake your depression serious, it is an illness that can be treated.",
              "author": "Klumber",
              "created": 1550488246,
              "upvotes": 32,
              "replies": {
                "egq18qt": {
                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq18qt/",
                  "text": "how did you manage to motivate yourself?  if i ever go to a phd defense i would feel like a kamikaze who's going to lose his soul in the process...",
                  "author": "Zalatan654",
                  "created": 1550488438,
                  "upvotes": 12,
                  "replies": {
                    "egq1jr3": {
                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq1jr3/",
                      "text": "Three key realisations: \n\n&#x200B;\n\n* People care about me and want me to succeed (including supervisors!)\n* The PhD journey is just that, a journey. PhD students put themselves under enormous pressure to 'save the world' with their work, that is not what a PhD is about, it is about demonstrating ability to conduct research independently and then defend it. The actual outcome of the work isn't the be-all and end-all. \n* When my depression hit I'd already finished 80% of the work, minus the write-up. With the coaching of my wife and friend I managed to break it all down into manageable chunks and create a plan that would work for me. I ended up doing 2 hours of real work a day as a minimum and still managed to finish it in a year after I got out of my depression. \n\nJust as a final note - it is worth getting the PhD, not necessarily to break into academia, but as a badge of competence. Those who have PhDs know how fucking hard it is to get to the endline.\n\n&#x200B;",
                      "author": "Klumber",
                      "created": 1550488961,
                      "upvotes": 48,
                      "replies": {
                        "egq6u8j": {
                          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq6u8j/",
                          "text": "Friend, I’m going to print this out and pin it to my office wall. ",
                          "author": "ygnomecookies",
                          "created": 1550496357,
                          "upvotes": 16,
                          "replies": {}
                        }
                      }
                    },
                    "egq6t5h": {
                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq6t5h/",
                      "text": "If they let you do a defense, it is because they expect to let you graduate. The worst case is a few more months of corrections.",
                      "author": "holidaySocks2018",
                      "created": 1550496323,
                      "upvotes": 9,
                      "replies": {
                        "egq7atg": {
                          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq7atg/",
                          "text": "Yes, I have supervised 5 PhD students to completion. I didn't let them defend until they were going to pass. I was on the line at that point too. If a PhD student fails a defense, the professor failed too. ",
                          "author": "janemfraser",
                          "created": 1550496852,
                          "upvotes": 8,
                          "replies": {
                            "egqcfez": {
                              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqcfez/",
                              "text": "Correct - and this is indeed an important realisation for all of those doing a PhD. Mainly for those going into the viva voce.",
                              "author": "Klumber",
                              "created": 1550501807,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "egq1pr8": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq1pr8/",
              "text": "I know that feeling (to a lesser extend since I didn't feel that way for that long). But you might regret leaving this way, as it may drastically alter your relationship with your supervisors and you may need them for recommendation letter or sthg like that (even for a job that is not in academia).  \n\n\nThey may not be aware of your situation as well, don't underestimate the ability of supervisors to forget about the progress of their project (and thus their students). Advice from your family should be taken carefully, as they're not familiar with the field, for them it's just 'a bit more effort' but we know it's more complicated sometimes.  \n\n\nDiscussing this kind of issue is also very hard in front of an entire committee. During the last one I cried in front of them and I think it would have been better to discuss my feeling the supervisor I get along with the most. I suggest you do that. And if you don't get along with any of them, talk to a psychologist (specialized in working problems), it helps a lot.  \n\n\nAt this point what you need to focus on is : talk to someone you get along with and works in academia, anyone. As your situation is rather 'extreme' (8 years after all), everyone will become aware of how seriously your problem should be taken. Then, your supervisors. Believe me they want to know what's going on in your head, and if you quit, everyone (including yourself) needs to anticipate that decision.  \n\n\nWho knows maybe you just need a new teammate to finish everything, sometimes all we need is a little push (and confort) :)  \n\n\nbut don't expect it from strangers in the internet though...",
              "author": "ScepticalFrench",
              "created": 1550489242,
              "upvotes": 5,
              "replies": {
                "egq26ly": {
                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq26ly/",
                  "text": "thanks for your comments. \nregarding teammates, three other students tried to engaged my research and found it hard and ran away from it screaming. \n\nthe thing is it is a project that my supervisors thought only a very competent student can accomplish, and for some reason they thought i could do it. \nhowever, it turned into a nightmare eventually. to add salt to injury non of them has an expertise in the area, and i had to build my knowledge in the field by myself, which caused a lot of time to be wasted and my supervisors weren't helpful from the get-go ",
                  "author": "Zalatan654",
                  "created": 1550490012,
                  "upvotes": 1,
                  "replies": {
                    "egq3u7m": {
                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq3u7m/",
                      "text": "Well I wouldn't call it 'wasted time', just more tedious than if you had someone around to help you. I does sound like bad decision making from your supervisors, and also the fact that your committee didn't try to adjust you topic in order to make your project more realistic makes me question the qualification of everyone to conduct a phd project in your department.  \n\n\nYet, it's probably no one's fault directly (like always), just a combination of unintended factors resulting in a durable mess. It seems you are the only one being aware of how much of a mess it is, comforting my impression that you need to talk to one of them.  \n\n\nThere are always periods where we believe there is nothing we can do to continue our phd (so called [valley of shit](https://thesiswhisperer.com/2012/05/08/the-valley-of-shit/)), the question is : were you deep in the valley for all this time or is it an issue that can't be solved on its own ? To answer that I think you need to brainstorm with your bosses.  \n\n\nThing is, after 8 years it's too late to adjust your topic, and so if your project is too hard to be finished (which is yet to be decided with other members of the project) then yes it may be time to quit. But 1) quitting doesn't mean slamming the door 2) you shouldn't feel guilty or responsible for all that and 3) you did build a lot of experience and skills during this phd, focus on that when you move on to sthg else (with or without your phd).",
                      "author": "ScepticalFrench",
                      "created": 1550492590,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "egq4gyy": {
                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq4gyy/",
                      "text": "One more thing : there are few very good comments here, and we're all suggesting basically the same things.  \n\n\nConcerning the importance of getting your phd in the end, I may not be the one you should listen because 1) I didn't get it (yet) and 2) I'm in a similar state than yours.  \n\n\nMy feeling is that we'll both get our diploma in the end, and we shouldn't give 2 f\\*cks about what our supervisors planned for our projects, because it's ours now, we have our say in this story. Plus no one knows how a phd will turn out because no one is medium. As Klumber says, just write a thesis with what you got, and publish a not-so-terrible paper in a mediocre journal.   \nWe won't pursue in Academia (I know I won't) so we don't care about our impact factor. We simply want to get all the requirements to defend, and then defend. Period. Move on, and have a simple and happy life =) That's my plan anyway.  \n",
                      "author": "ScepticalFrench",
                      "created": 1550493466,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "egq6qy5": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq6qy5/",
              "text": "When you let them know how close you are to quitting, their standards may be much lower. Get treatment for depression and take a few weeks off. ",
              "author": "holidaySocks2018",
              "created": 1550496256,
              "upvotes": 3,
              "replies": {}
            },
            "egrz65q": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egrz65q/",
              "text": "As an undergrad I can’t specifically speak to the PhD experience, but I unfortunately have gone through enough troubles academically and otherwise because of my depression. With academics in particular it seems like the world is closing in on you when you shut down because of depression. In the past and some even now I wouldn’t tell anyone if I had an issue and no one would know until it has snowballed. Follow the great advice others have given down here in the comments and in regards to the depression sit down with some close friends and talk with them and then have fun for a bit to distance yourself mentally. If you need to do so then sit down with a friend and talk it out with them while you construct it so that you don’t fall into depression and in order to stay on task. I wish you the best",
              "author": "darwinianissue",
              "created": 1550546488,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "egq6dfi": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq6dfi/",
          "text": "> 8 years ? that's just bad supervision\n\nMost people I know who took that long either took a few years essentially off because they were dealing with mental illness or something went drastically wrong with their (usually experimental) research and they had to start over. For the most part they're all appreciative that their programs footed the bill for those extra years.",
          "author": "thegreenaquarium",
          "created": 1550495828,
          "upvotes": 5,
          "replies": {
            "egqjekl": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqjekl/",
              "text": "[deleted]",
              "author": null,
              "created": 1550507382,
              "upvotes": 6,
              "replies": {
                "egqpv8a": {
                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqpv8a/",
                  "text": "Well, that too",
                  "author": "thegreenaquarium",
                  "created": 1550512055,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "egq6va9": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq6va9/",
              "text": "Or they are in certain longer fields like physics.",
              "author": "holidaySocks2018",
              "created": 1550496388,
              "upvotes": 1,
              "replies": {
                "egq6x4h": {
                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq6x4h/",
                  "text": "that was not the field I expected to epitomize longer fields, I'm not gonna lie.",
                  "author": "thegreenaquarium",
                  "created": 1550496441,
                  "upvotes": 6,
                  "replies": {
                    "egqb34o": {
                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqb34o/",
                      "text": "yeah even within natural sciences (not even talking about social sciences... poor phd students), physics is among the most 'efficient' ones from my personal experience.\n\n>poor phd students\n\nfiguratively and literally by the way",
                      "author": "ScepticalFrench",
                      "created": 1550500606,
                      "upvotes": 7,
                      "replies": {
                        "egqctof": {
                          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqctof/",
                          "text": "Not sure why the shade on social sciences... do you perhaps mean humanities? Insofar as we are comparing field research to lab research, lab research is much more uncertain and prone to failure and takes far more time. ",
                          "author": "thegreenaquarium",
                          "created": 1550502154,
                          "upvotes": 1,
                          "replies": {
                            "egqdh3f": {
                              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqdh3f/",
                              "text": "I'm sorry it may be a translating issue : in France 'Sciences sociales' refers to fields like History, Psychology, Epistemology, etc. PhD students in these fields typically don't have much funding to carry out their project, by opposition to 'Sciences naturelles' (Physics, Biology, Geology) where a phd student *gets paid* to work on their project.  \n\n\nThis results in a very unbalanced situation where a phd student in History has to have a part-time job in order to survive and finish his/her phd (5 to 7 years) and a phd student in physics gets 1400 € per month and defends usually after 3.5 years.  \n\n\nJust because the economical impact for the former is indirect (and so not visible) while the one for the latter is direct (industry, fossil fuel prospection, etc). I'm in forest ecology and I find it deeply unfair and unjustifiable.",
                              "author": "ScepticalFrench",
                              "created": 1550502712,
                              "upvotes": 4,
                              "replies": {
                                "egqq546": {
                                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqq546/",
                                  "text": "I'm pretty sure there is lab-based psychology research in France, so those grad students must get paid. The natural/social distinction imo creates more confusion than clarification, but I see what you mean. Interesting.",
                                  "author": "thegreenaquarium",
                                  "created": 1550512253,
                                  "upvotes": 1,
                                  "replies": {
                                    "egqx2h6": {
                                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqx2h6/",
                                      "text": "Psychology is kind of the \"hardest\" of the social sciences, it's a bit of a grey area.",
                                      "author": "ThePhysicistIsIn",
                                      "created": 1550517197,
                                      "upvotes": 1,
                                      "replies": {
                                        "egr9bzk": {
                                          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egr9bzk/",
                                          "text": "I didn't say the words 'hard' and 'soft' were relevant in any way, just that they were used in common conversation. Wrongly. ",
                                          "author": "ScepticalFrench",
                                          "created": 1550525821,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "egr35rb": {
                                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egr35rb/",
                                      "text": "In French some people refer them as 'soft' (social) and 'hard' (natural) sciences but 'soft' is pretty bad",
                                      "author": "ScepticalFrench",
                                      "created": 1550521501,
                                      "upvotes": 1,
                                      "replies": {
                                        "egr5yi3": {
                                          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egr5yi3/",
                                          "text": "I mean you just referred to them in English as soft and hard sciences.",
                                          "author": "thegreenaquarium",
                                          "created": 1550523463,
                                          "upvotes": 1,
                                          "replies": {
                                            "egrdjrx": {
                                              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egrdjrx/",
                                              "text": "That was just the literal translation from French sciences dures & sciences molles. ",
                                              "author": "ScepticalFrench",
                                              "created": 1550528906,
                                              "upvotes": 1,
                                              "replies": {
                                                "egsukkr": {
                                                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egsukkr/",
                                                  "text": "I don't understand the point of this conversation",
                                                  "author": "thegreenaquarium",
                                                  "created": 1550584821,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "egsvbp8": {
                                                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egsvbp8/",
                                                      "text": "To be honest me neither. It's just semantic anyway so I'm pretty confident in saying that we can stop it without missing anything.  \n\n\nHave a good day !",
                                                      "author": "ScepticalFrench",
                                                      "created": 1550585478,
                                                      "upvotes": 1,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "egqdupu": {
                              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqdupu/",
                              "text": "And so reading through the thread again I realize I didn't quite catch the meaning of your conversation haha  \n\n\nSo he said phd in physics were more likely to last longer. And you were saying that physics was not the field you expected to be taken as an example.  \n\n\nI agree with your statement and back it up then.",
                              "author": "ScepticalFrench",
                              "created": 1550503033,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "egq1w93": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq1w93/",
          "text": "the problem is that i'm usually stubborn, and i seemingly can't shutdown, not only from my research by from almost everything i do. it's the feel of guilt that doesn't go away",
          "author": "Zalatan654",
          "created": 1550489537,
          "upvotes": 2,
          "replies": {
            "egqds8j": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqds8j/",
              "text": "Long response, sorry, but I don't mind spending some time trying to help you, I'm at home with a cold and bored stiff! (Never had that when I did my PhD! ;) ) \n\nAgain, drawing on my own experience, **EVERYBODY** struggles whilst doing a PhD. I have had the benefit of working in two of the top departments in my field, I worked alongside dozens of PhD students both as an RA, as a PhD student myself, as a lecturer and now in academic support services. \n\nI am yet to find any PhD student who enjoys the process. All of us have the same problem: It is lonesome work, it is an enormous amount of information to work with and you are constantly challenging yourself to cope with it. As soon as something in your support network changes, it can trigger an avalanche of negative self-reflection. \n\nA few real life examples of mental health issues without going into personal detail: \n\n*A close friend had two supervisor changes, she managed the first one well as it was a recognised professor at the top of the field she studied, but then he got promoted and had to assign her to a junior staff member who A: didn't understand the research topic, B: didn't have a clue about the methodology. She qualified, but only because she decided to ignore the final supervisor completely, the number of times she dragged herself up from the bottom fighting and screaming is incredible, it took her five years.*\n\n*A young, extremely bright, PhD student in my cohort was doing great, on the surface. Then he had a sports injury, or at least that is what he told everybody. Stayed away for a year, he returned just before my Viva and we had a long night in a pub - he had suffered a mental breakdown because his mother was diagnosed with cancer and he felt he couldn't support her and do his PhD. I spoke to him recently and four years later he has a viva date.*\n\n*A friend who is now an internationally renowned professor suffered from impostor syndrome, unable to make decisions without validation from more senior staff, one of his ideas was straight-up stolen by one of them. He reached out to wellbeing and ended up receiving counselling, best thing that could have happened to him.*\n\n*Recently I coached (as part of my role) a very senior member of staff with my current employer. She was told she had to do a PhD by publication to retain her senior leadership role. Two years in and she is under such pressure that it is bordering on insane. After the session she immediately told her line manager that she had two options: Give her two days a week to get her PhD or drop the demand to get one. She now has two days a week to get her PhD.*\n\nFinal piece of advice (ad verbatim from my supervisor, received *after* I finished my viva voce, the plonker): **A PhD is awarded as a commendation of you managing to get through this experience.** So I will add to that: Treat it as such and look after yourself.",
              "author": "Klumber",
              "created": 1550502975,
              "upvotes": 9,
              "replies": {}
            },
            "egq3zka": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq3zka/",
              "text": "And it'll stick to you until you share your feelings with 1) a professional or 2) a colleague who knows what you're talking about. When was the last time you took vacation ? If it's > 6 months, take it.  \n\n\nWhen was the last time you shared your feeling with someone in the field ? ",
              "author": "ScepticalFrench",
              "created": 1550492797,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "egq0ggr": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq0ggr/",
          "text": "“There is no rush”? After eight years?",
          "author": "nc_bound",
          "created": 1550487072,
          "upvotes": 1,
          "replies": {
            "egq0rmw": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq0rmw/",
              "text": "After 8 years, 1 or 2 weeks seem... not significant really. And apparently (s)he **needs** these days off right now.",
              "author": "ScepticalFrench",
              "created": 1550487603,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "egqndol": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqndol/",
      "text": "While you are still a student, get yourself to your university's health and counselling services immediately. ",
      "author": "spinningcolours",
      "created": 1550510267,
      "upvotes": 9,
      "replies": {
        "egr0f4a": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egr0f4a/",
          "text": "i'm too ashamed to do it, every time i coward and turn back.",
          "author": "Zalatan654",
          "created": 1550519601,
          "upvotes": 2,
          "replies": {
            "egriet6": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egriet6/",
              "text": "Feeling that way is completely valid but please know there is no shame in going. I strongly second the recommendation to access these services while you’re still a student. ",
              "author": "amberJL_S",
              "created": 1550532718,
              "upvotes": 6,
              "replies": {}
            },
            "egrtjrn": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egrtjrn/",
              "text": "That is a totally normal feeling. But of all the mental health professionals out there, the university ones are best equipped to understand what you are going through because they have seen it before.\n\nAnd it should be free to you.",
              "author": "spinningcolours",
              "created": 1550541917,
              "upvotes": 3,
              "replies": {}
            },
            "egt724z": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egt724z/",
              "text": "Are you ashamed when you get the flu, or chickenpox? Or when you have an old injury that re-surfaces and stops you doing stuff? \n\nMental health issues  are real  **diseases** . Except the symptoms of the disease are lying to you.\n\n Your feelings are valid, but in this case they are ganging up on you and lying to you to stop you getting help.\n\nWe are all rooting for you! From a lot of people who know stuff and have struggled, please, please go to the counseling center!\n",
              "author": "lalochezia1",
              "created": 1550594075,
              "upvotes": 3,
              "replies": {}
            },
            "egrtlic": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egrtlic/",
              "text": "It can also help you if you decide to request a leave instead of a departure.",
              "author": "spinningcolours",
              "created": 1550541957,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "egq2ffe": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq2ffe/",
      "text": "I quit after 10 and sometimes wish I’d quit after 8 instead ;) Weigh your options carefully but if you do decide to quit, there’s no shame in that.",
      "author": "dowcet",
      "created": 1550490417,
      "upvotes": 17,
      "replies": {
        "egq2hmy": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq2hmy/",
          "text": "did you ever regret quitting, how was your life after quitting? ",
          "author": "Zalatan654",
          "created": 1550490516,
          "upvotes": 10,
          "replies": {
            "egq70qf": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq70qf/",
              "text": "I quit after 4.5 years and have regretted it many times since then. My family is now living in a smallish city with a major govt research lab. If I had the PhD, I could potentially get employed there. (I have a great job elsewhere, though!) ",
              "author": "holidaySocks2018",
              "created": 1550496548,
              "upvotes": 17,
              "replies": {}
            },
            "egq4oyf": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq4oyf/",
              "text": "No regrets. Disappointed that it didn’t work out I guess, but confident I made the right decision in the end. \n\nIt wasn’t a decision I made lightly. I probably spent weeks if not months discussing and thinking it through before I said anything to my advisors and colleagues. \n\nPerhaps most importantly, I had a plan for my new career (in IT) already in motion by the time I officially withdrew. It’s been a struggle starting over from scratch in my late 30s but all in all, it’s working out. I miss reading books and all that, but I don’t miss the stress and the poverty.\n\nGood luck in whatever you decide :)",
              "author": "dowcet",
              "created": 1550493763,
              "upvotes": 11,
              "replies": {}
            },
            "egr8dnx": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egr8dnx/",
              "text": "I quit after three years (mastered out of a PhD program). Things got better quickly and now my life is way better than if I tried to stay.",
              "author": null,
              "created": 1550525167,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "egq7vn8": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq7vn8/",
      "text": "I find it very weird where I see a post like this, and 80% of the messages are telling OP to hold on or advising strategies where OP can stay in academia.  Why do we do this?  There is no great moral prize for staying in a field where it gets harder and harder to find jobs and have any quality of life every year.  Twenty percent of people with Ph.Ds in my field get jobs-- you aren't a better person for \"sticking with it.\"  I think this is one of the great failings of academic culture-- continually implying that holding on even though things aren't going well is going to result in living the dream of a tenure track job.  Or that if you even got one, you would be happy.  That leaving academia is some sort of cardinal sin. There is absolutely nothing wrong with leaving and it many cases, it's the very smartest thing to do.",
      "author": "DocGlabella",
      "created": 1550497461,
      "upvotes": 31,
      "replies": {
        "egq9xe2": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq9xe2/",
          "text": "I agree completely that the goal should not be \"Stay at all costs\", it should be \"Find the path that's best for you.\"\n\nBut isn't there something to be said for finishing the project you started? There are some career reasons to do so (looks better on the resume) but also isn't there some personal incentive as well? This isn't academia specific - it's just nice to finish projects you started, especially if they took up most of a decade of your life.\n\nFor context, my PhD took 8 years. I was convinced I was leaving academia as soon as I finished it, but finished it for exactly the reasons above.",
          "author": "autopoetic",
          "created": 1550499525,
          "upvotes": 13,
          "replies": {
            "egqhe98": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqhe98/",
              "text": "I don't actually think there is anything wrong with finishing what you started... although to me, it would depend on how compromised your mental state is at the time (i.e. is it going to kill you to actually finish, because the home stretch of a Ph.D. can be awful) and how much more debt you will accrue to finish.\n\nIn the case you are talking about, I guess the preferred advice I would give is \"finish and use the remaining time in grad school to develop a Plan B.\"",
              "author": "DocGlabella",
              "created": 1550505876,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "egqnd5s": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqnd5s/",
      "text": "While you are still a student, get yourself to your university's health and counselling services immediately. ",
      "author": "spinningcolours",
      "created": 1550510257,
      "upvotes": 7,
      "replies": {}
    },
    "egq2kaf": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq2kaf/",
      "text": "I'm in the same place you are, only 3 years behind you (in my 5th out of 7 maximum possible). I haven't published anything (it's mandatory for title), I haven't even touched my research at this point, for a while. It's in humanities (art history), so there's a lot of reading involved, and I do that, but... there should also be a lot of fieldwork involved, and lots of hands-on work on stuff (inscriptions, iconographies, etc.), and I haven't done that in a while. I still love my subject, I just haven't felt able to treat it properly for a long time. I'm at a standstill, right now.   \n\n\nMy point is, take a break from it, if you can. Completely. Take a break from the guilt, too. Just disconnect. Then, or before you do that, talk to someone in charge in your program (supervisor, committee, whatever) - see if there's a chance you could take a sabbatical at this point, or if not, if you can stretch it out a little bit longer, so you have time to try and regain your balance.  You might find that you are not alone, that colleagues might want to help - if not with the hard parts of research, maybe with the time-consuming work.   \n\n\nBut whatever happens, take care of yourself, first. If you do get it, it will be a wonderful thing you will have done. If not, it will not be the end of you.",
      "author": "petronia1",
      "created": 1550490636,
      "upvotes": 6,
      "replies": {}
    },
    "egqhiqn": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqhiqn/",
      "text": "Does your department have a process to achieve Candidacy and have you passed? Usually a PhD candidate will have discussed with their committee what their dissertation scope and objectives are. If you have results you can publish you should write them into your dissertation. It is typical to have some work as manuscripts that are published after you graduate. Speak with your advisor and committee regarding your intention to graduate. Also, do you have an assistantship that pays tuition and a stipend? Many places have limits on how long a student can be supported without graduating.\nMy advice is to find a way to salvage your PhD. You might have to find work outside graduate school to do this. It is challenging but I know plenty that have done this.\nGood luck.",
      "author": "TexAgIllini",
      "created": 1550505972,
      "upvotes": 2,
      "replies": {}
    },
    "egqitli": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqitli/",
      "text": "Are you me? I'm in the exact same fucking boat. 8 years and still going on  I have to publish 2 first author papers to get my degree. I have put in a lot of effort but I'm just tired now :( ",
      "author": "crazyMadBOFA",
      "created": 1550506956,
      "upvotes": 2,
      "replies": {
        "egr00jp": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egr00jp/",
          "text": "really, how are you doing it? thinking of quitting too?",
          "author": "Zalatan654",
          "created": 1550519313,
          "upvotes": 3,
          "replies": {
            "egrnj6v": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egrnj6v/",
              "text": "Yeah. I think about it on a daily basis. But I don't want to let go of the work I've already done. It's a daily struggle. All my friends who started out with me are working on their post docs, getting jobs etc. It's quite embarassing when someone asks me how many years it has been and why it's taken me so long. Even though there have been external factors that have contributed to this delay, I can't help but feel that people view it as my personal failure to achieve something. That feeling is just too much for me. On the other hand, I'm a stubborn individual and I really want to see this work through. I know exactly how you feel. There are days when I just don't want to get up. I avoid talking to people at work as much as I can. I know it's not healthy, I'm depressed and I know it. ",
              "author": "crazyMadBOFA",
              "created": 1550536950,
              "upvotes": 2,
              "replies": {
                "egryy4h": {
                  "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egryy4h/",
                  "text": "man it's like talking to myself \n",
                  "author": "Zalatan654",
                  "created": 1550546300,
                  "upvotes": 3,
                  "replies": {
                    "egrzsjo": {
                      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egrzsjo/",
                      "text": "Internet hugs from me! I hope we make through this mess",
                      "author": "crazyMadBOFA",
                      "created": 1550547007,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "egqjdex": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqjdex/",
      "text": "You're quitting your PhD, or you're quitting academia after already having graduated? Either way there's no shame in walking. \n\nA few points of reflection - why did you want it in the first place? Can you have the life you want without it? If not, maybe take a leave of absence for a bit.\n\nHere's a really tough question. Are you getting in the way of your own success? ",
      "author": "catasticvoyage",
      "created": 1550507358,
      "upvotes": 1,
      "replies": {}
    },
    "egqq0oe": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egqq0oe/",
      "text": "Sounds like you should do something else.",
      "author": "TakeOffYourMask",
      "created": 1550512164,
      "upvotes": 1,
      "replies": {}
    },
    "egq3fjz": {
      "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egq3fjz/",
      "text": "Quitting academic life is the best move of your life! I am 80% determined to do the same thing!",
      "author": "cubetic",
      "created": 1550491997,
      "upvotes": -1,
      "replies": {
        "egr03pr": {
          "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egr03pr/",
          "text": "how far you are in the process?",
          "author": "Zalatan654",
          "created": 1550519375,
          "upvotes": 1,
          "replies": {
            "egr6ksb": {
              "link": "/r/AskAcademia/comments/arvoej/quitting_after_8_years/egr6ksb/",
              "text": "You can quit academic life before or after getting a PhD.\n\nPlease read the above advice before just dropping eveything!",
              "author": "lalochezia1",
              "created": 1550523904,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}