{
  "sid": "emffav",
  "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/",
  "title:": "Super passionate about teaching and advising, absolutely hate research.",
  "text": "For background, I'm in engineering.\n\nI'm looking for advice because I really want to be a professor at a smaller teaching university (with less emphasis on research), but I have 2.5 years left in my PhD program and I hate doing research.  \n\nI have had teaching and advising roles (teaching assistant, recitation instructor, tutor, academic mentor, grader, graduate student instructor) for 5 years and I've enjoyed all of it.  Teaching and advising are definitely what I'm passionate about.  And I'm pretty good at it, too.\n\nIt's not that I don't like my research topic, I just don't like being a researcher.  I have tried to motivate myself with the mindset of \"suffering for 5 years so I can have my dream job for the next 40\" but it's been getting harder and harder to motivate myself to do the work and I've gotten to the point that I'm behind where I should be in terms of my progress.\n\nHas anyone else experienced this?  What did you do?",
  "author": "mamacass24",
  "created": 1578601765,
  "updated": 1634081411,
  "over_18": false,
  "upvotes": 125,
  "upvote_ratio": 0.98,
  "comments": {
    "fdom65v": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdom65v/",
      "text": "Community college is for you my friend",
      "author": "IIIIllllllIIIll",
      "created": 1578607963,
      "upvotes": 144,
      "replies": {
        "fdpovdw": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpovdw/",
          "text": "I have to agree here. If you can sustain a research program despite your disdain maybe liberals arts teaching college would work, but if you *hate* research, I think you should focus on the community colleges. Tenure at most 4 year public and private institutions requires something close to \"excellence\" in research, as well as teaching and service.",
          "author": "cduston44",
          "created": 1578635030,
          "upvotes": 13,
          "replies": {
            "fdqn0uq": {
              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdqn0uq/",
              "text": "What counts as excellence in research in your field?",
              "author": "ThePhysicistIsIn",
              "created": 1578670521,
              "upvotes": 2,
              "replies": {
                "fdrkrp6": {
                  "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdrkrp6/",
                  "text": "\"My field\" is physics, presumably the same as yours from your handle. Defining \"excellence\" in the context of tenure is basically the whole game - it's a peer review system of peers from your institution. It's sometimes very carefully clarified (\"Two publications a year in a peer reviewed journal\"), or sometimes there is a list of \"acceptable forms of evidence\". Sometimes it includes grant writing, or advising students, or conference attendance. Basically, other members of the faculty have a sense of what \"excellence\" is, and they should be communicating that to you, either informally (conversations at the bar) or formally (annual reviews).",
                  "author": "cduston44",
                  "created": 1578685868,
                  "upvotes": 2,
                  "replies": {
                    "fdrl16q": {
                      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdrl16q/",
                      "text": "Everyone is always so vague and tells me “it varies”, but it’s hard to tell by how much it varies by when people won’t be specific about their own department, etc...\n\nYes I know what applies to your department doesnt apply elsewhere, but that’s not really the point of my asking you what it was for you",
                      "author": "ThePhysicistIsIn",
                      "created": 1578686029,
                      "upvotes": 1,
                      "replies": {
                        "fdsze28": {
                          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdsze28/",
                          "text": "Honestly, I don't want to say in public. I don't have tenure yet, and although I don't think anyone is tracking me down or watching me, but on the off chance that someone can identify me by this thread, I don't want to taint the process.",
                          "author": "cduston44",
                          "created": 1578709925,
                          "upvotes": 2,
                          "replies": {
                            "fdtxsdn": {
                              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdtxsdn/",
                              "text": "That's too bad, I'm really curious as to how it varies university to university (ofc I know expectations where I am), but anyone's hardly ever specific. But I get that.\n\nBest of luck!",
                              "author": "ThePhysicistIsIn",
                              "created": 1578723978,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fdpl0ip": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpl0ip/",
          "text": "What types of engineering courses do community colleges typically offer?",
          "author": "mamacass24",
          "created": 1578631554,
          "upvotes": 8,
          "replies": {
            "fdqgm5e": {
              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdqgm5e/",
              "text": "Introductory ones. Best way to look is find a community college and then locate the course catalog. Find the word \"engineering\". It won't be upper division stuff, but excellence begins with the basics and we need good teachers laying solid foundations for tomorrow's world changers.",
              "author": "codeonatypewriter",
              "created": 1578666163,
              "upvotes": 3,
              "replies": {}
            },
            "fdqhqc2": {
              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdqhqc2/",
              "text": "2 year ET degrees and math/physics classes",
              "author": "k0np",
              "created": 1578666963,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fdomnqp": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdomnqp/",
      "text": "Hey, I had the same feelings as you, and got a tenure-track job at a teaching-focused university this year! I was surprised by how many faculty jobs are out there that are primarily teaching, but it makes sense if you think about it -- most universities (at least in the US) are not PhD-granting institutions, and thus by definition are going to be more focused toward undergraduate teaching. I'm not in engineering, but many disciplines have job post aggregator websites -- definitely ask your advisors if your field has something similar and start scouring job ads! Any ad that mentions higher course loads (3+ courses per semester) is likely going to be a teaching-focused job with lower research expectations.\n\nStrangely, most of the internet advice for applying for teaching jobs is focused on the humanities, but I found that it was general enough to be pretty applicable to my situation (I'm in the social sciences though, so still quite different from engineering). For example, Karen Kelsky's blog The Professor Is In has tons of great advice about applying for these kinds of jobs ([here's an example post about teaching statements](https://theprofessorisin.com/2016/09/12/thedreadedteachingstatement/)).\n\nFeel free to PM me if you want to talk more!",
      "author": "spec_of_cp",
      "created": 1578608257,
      "upvotes": 54,
      "replies": {
        "fdq4n4x": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdq4n4x/",
          "text": "Try Germany, you've the provision to teach in a Hochschule where you don't have to publish articles.",
          "author": "highderrr",
          "created": 1578654638,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fdoruxa": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdoruxa/",
      "text": "Something that could help is turning your research into more of what you enjoy. Recruit some undergrads to work with you on your research. More of your time will be spent advising and teaching, but the same research will get done. If possible, have your research get incorporated into a class (e.g. some classes have 5-week end-of-semester independent projects, get students to work on your research in there, bonus if any of them join the lab with you later on). Anything else you can do to take on more of an advisor/teacher role will help you enjoy the research that has to get done",
      "author": "blaze99960",
      "created": 1578611489,
      "upvotes": 40,
      "replies": {
        "fdpl2jc": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpl2jc/",
          "text": "This is a really good idea.  Thanks!!",
          "author": "mamacass24",
          "created": 1578631602,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fdowny2": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdowny2/",
      "text": "Since you're an engineering student have you ever thought about teaching at a STEM high school?\n\nThere are elite *public* boarding schools in about half the states now. NCSSM, SCGSSM, MSSM, and IMSA are the ones I'm most familiar with, but there was 27 the late time I heard the stat. I went to one and all teachers had to have at least a masters degree in their discipline or a bachelors in their discipline and a masters in education, but half of our faculty had PhDs. Engineering was a required course; there's a robotics lab (and team) and a fabrication lab; and there was massive latitude for academic creativity with labs, assignments, and tests, especially outside of the AP courses.\n\nThe one I went to was truly a magical place and most people who got jobs there stay until they retire because your classes are filled with super smart kids who are thirsty for knowledge because they were plucked from high schools that they had academically outgrown. And it's a boarding school, so if there are discipline problems (very rare in classes), you can ground them as punishment!!!",
      "author": "MidnightSlinks",
      "created": 1578614578,
      "upvotes": 30,
      "replies": {
        "fdp4h31": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdp4h31/",
          "text": "I went to one of those as well, and I can confirm that the classes I got were (for the most part) above and beyond. The only thing for OP is depending on the state there may be many things to get through in order to become a teacher at secondary school (credentialing, etc).",
          "author": "kermathefrog",
          "created": 1578619780,
          "upvotes": 9,
          "replies": {
            "fdpwrrq": {
              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpwrrq/",
              "text": "The point about additional credentials is good. I did also attend one of these schools, and the teachers there weren't actually required to have licenses. I have no idea how prevalent this is with these types of schools, but it's possible that it's not needed.",
              "author": "Waytfm",
              "created": 1578643753,
              "upvotes": 3,
              "replies": {
                "fdtslvy": {
                  "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdtslvy/",
                  "text": "Mine was like that too. I think that's pretty common. They're typically regulated by the state either like a charter school or a public university.",
                  "author": "MidnightSlinks",
                  "created": 1578721553,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fdoqof3": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdoqof3/",
      "text": "I was you 25 years ago. Pushed through and landed a TT position at a community college that I absolutely love. Small class sizes; emphasis on teaching and mentoring; teach both lectures & labs (no TAs); great work-life balance. The last couple years of grad school sucked hard, but it all paid off!\n\n(Having said that, please realize that TT positions are extremely scarce and challenging to land. I’m now the department chair and have served on numerous hiring committees. We have adjunct faculty who have been trying for years to land a full-time position and every time we advertise one we get dozens upon dozens of applicants. So be prepared to possibly have to adjunct for several years or have a good back-up plan.)",
      "author": "PhD4Hire",
      "created": 1578610753,
      "upvotes": 17,
      "replies": {
        "fdp9adj": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdp9adj/",
          "text": "> Pushed through and landed a TT position at a community college that I absolutely love. Small class sizes; emphasis on teaching and mentoring; teach both lectures & labs (no TAs); great work-life balance.\n\nCorrect me if I'm wrong, but isn't it also the case that you never teach any upper-division courses in a CC setting? I've spent my career in an SLAC and 2/3 of my load (sometimes 100%) are upper-division courses in my specialty or research seminars, which I really love teaching. But I don't particularly like teaching the 100-level intro classes, so have always assumed I wouldn't have liked a CC position.  I've developed and taught over two dozen different courses over the last \\~20 years as well, while most of my friends at CCs teach the same four courses each semester.  Do you have much variation?\n\nNot a critique, just wondering about the differences and if OP is aware of them.",
          "author": "SnowblindAlbino",
          "created": 1578623005,
          "upvotes": 7,
          "replies": {
            "fdpnuap": {
              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpnuap/",
              "text": "It’s true that we don’t teach upper division courses, but there is still variety amongst the 100- and 200-level courses. In my STEM discipline, for example, there are at least 11 different courses, including a new one I created just last year. There are also honors versions of several that allow for a change of pace through additional readings, scholarly research, presentations, etc. I’ve also created online versions of existing courses, which are their own challenge and involve significant, novel work. On top of this, I have a second new course in the works, with plans to also develop a certificate program for a career that doesn’t require a 4-year degree. So the course offerings can be quite dynamic, *if you want them to be*. There are also faculty who do, indeed, teach the same courses over and over because it’s easy and they’d rather do other things with their time than create courses and such. But I’m sure that’s the same at all institutions.",
              "author": "PhD4Hire",
              "created": 1578634055,
              "upvotes": 2,
              "replies": {
                "fdrvb6x": {
                  "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdrvb6x/",
                  "text": "> So the course offerings can be quite dynamic, if you want them to be. There are also faculty who do, indeed, teach the same courses over and over because it’s easy and they’d rather do other things with their time than create courses and such. But I’m sure that’s the same at all institutions.\n\nI didn't realize you had the option of variety like that-- sounds good. I like creating new courses and while I have a few (two, really) that I've taught almost every year of the last 25, I've done many one-offs and others that have been connected to a short-term collaboration, or grant, or honors, or learning community, or whatever and I've really enjoyed that.  We do, as you suggest, also have people who literally teach the same courses every semester forever...all in STEM and really a mix of burnouts and people who are simply really good at teaching pre-med courses (in particular).\n\nWhat I think I'd miss at a CC though would be teaching senior research courses. Every year I supervise a range of thesis projects and it's such a delight (usually, with most of them) to see students I've worked with for four years turn out series scholarship that will springboard them into graduate school or an entry-level professional position. But of course my friends at CCs have similar stories about their students, so I'm sure see progress is always welcome at whatever level.",
                  "author": "SnowblindAlbino",
                  "created": 1578690320,
                  "upvotes": 1,
                  "replies": {
                    "fdrwxoq": {
                      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdrwxoq/",
                      "text": "We are definitely limited on research aspects at the CC. In my honors courses, it’s almost entirely scholarly research, where the students basically do a literature review on a topic, narrow their focus, and then put together a poster or oral presentation for a conference. But even that is an amazing experience because it is almost always these students first time ever even reading scholarly publications, let among assembling the data and crafting a presentation. They are so intimidated at first, but by the end of the semester their sense of accomplishment is huge and they realize that  perhaps scientific research really is something they can do (and should consider)! (I’ve had numerous students win awards for their presentations at local and regional conferences, which is also pretty cool!)\n\nAnd while I don’t get to work with seniors just before heading off to graduate school, professional school, or a career, I do get to work with them on transferring, often to extremely competitive schools. I’m in California and every year I have former students who are accepted to top-notch schools such as UC Berkeley, UCLA, UC San Diego, Stanford, etc. It’s definitely a feel-good moment for all concerned!\n\nAs you said, it’s not the same type of progress as you get to see you, but it is progress nonetheless.\n\nHave a great semester!",
                      "author": "PhD4Hire",
                      "created": 1578690923,
                      "upvotes": 1,
                      "replies": {
                        "fds1a95": {
                          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fds1a95/",
                          "text": "> In my honors courses, it’s almost entirely scholarly research, where the students basically do a literature review on a topic, narrow their focus, and then put together a poster or oral presentation for a conference.\n\nThat sounds great-- exactly what I do with our junior research seminar in fact. They would have done posters at least once as sophomores, but those were group projects so this is usually the first time they've done a full lit review and a poster on their own. It's fun to see for sure. \n\nI also teach our freshman seminar quite often, so get the first years in the fall gen ed program. They grow so much by the send year it's often like they are different people. My oldest kid is now a freshman in college (2,000 miles away though) so for the first time in the 25+ years I've been teaching college students it's begun to parallel my own offspring, which has also been interesting.\n\nI'm working on my syllabi today as classes resume Monday. Spring is always harder than fall for some reason, probably due to the shorter break beforehand. Good luck to you as well!",
                          "author": "SnowblindAlbino",
                          "created": 1578692780,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "fdrxs7s": {
                      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdrxs7s/",
                      "text": "Just to give another perspective, there are currently three courses left in the catalog that I can teach in my department. I also happen to have enough interdisciplinary hours to teach in other departments, but they usually don't need me, or I'm already teaching an 8/7 (standard load is 5/5) due to various factors. So I teach basically the same two things (third class is a non-majors mashup of the other two) over and over. Fortunately, I love these subject, but I am dying to teach upper-level.",
                      "author": "SnittingNexttoBorpo",
                      "created": 1578691328,
                      "upvotes": 1,
                      "replies": {
                        "fds0xrs": {
                          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fds0xrs/",
                          "text": "> I'm already teaching an 8/7\n\n15 courses a year? My god. How many students? our load is 3/3 and if anyone has more than 100 students in a semester they get bonus pay, though that basically never happens. Most of my classes are <20.\n\nI actually enjoy re-teaching some courses so the mix of old/new is good for me. But I can't imagine teaching 15 in a year...",
                          "author": "SnowblindAlbino",
                          "created": 1578692564,
                          "upvotes": 1,
                          "replies": {
                            "fds2tdp": {
                              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fds2tdp/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1578693515,
                              "upvotes": 1,
                              "replies": {
                                "fe2kf6b": {
                                  "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fe2kf6b/",
                                  "text": "> My courses have no college-level Reading or Writing pre-req., although they are real college credits, yet they are state-assessed for writing and critical thinking. A class of up to 37 students, any number of whom may not be able to read or write [English -- don't forget the high population of international students!] at a high school level, with required writing assignments and no TA, is some bullshit.\n\nYeah, that sounds incredibly challenging. I've been fortunate (or so it seems in retrospect) to spend my career at selective liberal arts colleges, so with a few exceptions (mostly Chinese international students) I've always had students with strong ACT/SAT scores who were college ready. We aren't equipped for remedial education at all in fact, so can't admit students who need it...they wouldn't make it through the first semester. I had different experiences adjuncting/VAP in the 1990s at big public institutions though, where the range of abilities/preparation was much wider. Also taught a few classes of 150+ entirely on my own, which I would never want to do again as that much grading is overwhelming. That said, the other end of the class size spectrum can also be a burden...I had a class last fall with only 15 students but they each wrote 20 page papers (three drafts to read) and there were ~15 other graded assignments, so the net volume was fairly high page-wise.\n\nThe many different models for higher ed in the US are interesting. I have colleagues/friends at pretty much every type and am always interested in hearing about people's experiences. A few years ago I spent the summer in an NEH workshop that brought in faculty from all over the US, from CCs and public comprehensives and SLACs and Ivy R1s alike. We lived in dorms together so had a lot of free time in the evenings to compare workloads...lots of inspiring tales from every kind of school, but most of us agreed we'd rather not switch institutions with anyone else!",
                                  "author": "SnowblindAlbino",
                                  "created": 1578839478,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fdowsaf": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdowsaf/",
      "text": "I was in the same boat as you when I graduated in 2016. Everybody I talked to where I got my PhD said I needed a post-doc to get a tenure track position. However, I attended a SLAC for my undergrad and saw them hire tenure track fresh out of grad school. The trick is that you have to be very selective about where you apply. \n\nWhen I went through the job postings I ignored any school that asked for a research statement. Honestly that narrowed the search a ton but it showed where their priorities were. I applied to a handful of tenure track postings but didn't land any. I then opened my search to visiting in the hope of just having something. I applied to a few visiting positions late in the hiring season and got an offer pretty quickly with them promising that it would open for tenure track the next year. It did and I got the position because I fit in well and knew how to teach. There is no expectation that I will publish for tenure though it is expected for full professor. I love being able to focus on teaching at the college level.\n\nHonestly the type of position you want is limited to a small number to institutions and many of that type of institutions are facing a shortage of students. Pay attention to the places you are applying to make sure they focus on teaching and if possible see if you can find anything about their financial position. There is hope but it is good to have realistic expectations. Good luck!",
      "author": "CHEIVIIST",
      "created": 1578614658,
      "upvotes": 10,
      "replies": {
        "fdp9mmu": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdp9mmu/",
          "text": ">There is no expectation that I will publish for tenure though it is expected for full professor. \n\nThat's actually uncommon for SLACs in my experience, and becoming more so as the market gets ever more competitive. I'm not in chemistry, but generally speaking my SLAC requires a book or 3-4 papers for tenure, and that again for promotion to full. On top of \"excellence\" in teaching and a heavy service load. That is about the same for all of our peers with which I'm familiar, so basically schools ranked between about 50-125 in the US News liberal arts college category. Research expectations are higher for top 50 schools but teaching loads are often lower than the 3/3 we have so it's more doable. \n\nI'm really surprised to hear *any* SLAC will give tenure with zero publications actually...our junior faculty won't even make it through third year review without a publication record.",
          "author": "SnowblindAlbino",
          "created": 1578623226,
          "upvotes": 3,
          "replies": {
            "fdpe19m": {
              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpe19m/",
              "text": "I think we are more of a regional college and maybe not top 125 though I think we do pretty well. It was founded primarily on a degree in education and the culture has always been teaching focused. All full time faculty are teaching 4/4 with a heavy load of service too. I'm doing an independent research project with a senior this semester and I'll get a couple hundred bucks extra for the course by appointment so the system doesn't give much incentive for research. I tend to think SLAC type schools are either the type you describe or the type I'm describing.",
              "author": "CHEIVIIST",
              "created": 1578626240,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fdp0zzr": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdp0zzr/",
      "text": "I was not passionate about my topic.  Having trouble getting motivated.  I turned the objective from “do this research” to “finish the damn degree” and that worked a treat.\n\n  I’m now teaching at a teaching university and there is no time for research and I love it.",
      "author": "VeblenWasRight",
      "created": 1578617429,
      "upvotes": 3,
      "replies": {}
    },
    "fdp8ap4": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdp8ap4/",
      "text": "Different field but similar feelings.  The PhD process has turned me off research but I love teaching.  I'm ABD but Ialready got a job at a small liberal arts university where teaching is #1 and scholarship is a far second.  It's a great fit for me.  I will finish up the PhD because it will afford me the best opportunities in academia but I don't have to sell my soul to research where I am now.",
      "author": "ukjenn231",
      "created": 1578622343,
      "upvotes": 4,
      "replies": {}
    },
    "fdpcuhb": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpcuhb/",
      "text": "I dont know what country you're in, but here in canada, a growing trend for the past 20 years is the separation of teaching faculty and research faculty, to a degree. We have full-time tenured teaching faculty (many at my research intensive university) who mainly teach, and who do some research on the side for fun. They're basically people like you, who love teaching more than they care about research. It sounds like you might find something like this if you know to look for it. You could always come to Canada, if that's an option for you.",
      "author": "MillennialScientist",
      "created": 1578625412,
      "upvotes": 4,
      "replies": {
        "fdplaym": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdplaym/",
          "text": "I'm in the US but this makes me want to move to Canada",
          "author": "mamacass24",
          "created": 1578631795,
          "upvotes": 1,
          "replies": {
            "fdplzhw": {
              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdplzhw/",
              "text": "I like it here, but I'm from here. I hope you find something that's right for you.",
              "author": "MillennialScientist",
              "created": 1578632382,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fdohv51": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdohv51/",
      "text": "I haven't experienced it per se, but I know that there are universities (even R1s) that place a lot of value on teaching and mentoring undergraduates. Perhaps applying to teaching professorships or lectureships at R1 universities or professorships at smaller colleges could be a good option. You can DM me and I'll give you the contact information for some people who have gone down a similar path.",
      "author": "ProfessorGoldfella",
      "created": 1578605458,
      "upvotes": 3,
      "replies": {}
    },
    "fdp7bsb": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdp7bsb/",
      "text": "A teaching-oriented college could be a good fit (often a 4 course per semester load). Working to ensure your teaching credentials set you apart could help you on the job market, since PhD students tend to focus more strictly on research.",
      "author": null,
      "created": 1578621690,
      "upvotes": 2,
      "replies": {}
    },
    "fdpea03": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpea03/",
      "text": "Teaching at a SLAC might be for you. I actually enjoy research, but at my SLAC I'm not really allowed to do more than an hour or two a week during the semesters. Many SLAC schools have requirements for \"scholarly activity\" that do not have to be pure research. You also might end up liking research more when you aren't working for someone else. (This is all field specific of course.)",
      "author": "WaylonWillie",
      "created": 1578626409,
      "upvotes": 2,
      "replies": {}
    },
    "fdoskfy": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdoskfy/",
      "text": "Lecturer positions are starting to become more common, even at R1s.  Try searching the term \"lecturer\" on higheredjobs.com.",
      "author": "MaizeGator",
      "created": 1578611930,
      "upvotes": 3,
      "replies": {}
    },
    "fdpk25y": {
      "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpk25y/",
      "text": "Well, if you hate research and are not going to do research...I don't think you should be (or would be able to be) an advisor (assuming you mean an advisor of a student for a research degree).\n\nTeaching in the classroom on the otherhand, absolutely...go for it!",
      "author": "ObamazSemenAnts",
      "created": 1578630769,
      "upvotes": 1,
      "replies": {
        "fdpk8ge": {
          "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpk8ge/",
          "text": "Thank for you comment, for clarification I meant more academic advising (degree planning, career planning, etc.)",
          "author": "mamacass24",
          "created": 1578630913,
          "upvotes": 2,
          "replies": {
            "fdpkqg4": {
              "link": "/r/AskAcademia/comments/emffav/super_passionate_about_teaching_and_advising/fdpkqg4/",
              "text": "Well, then yes...go for it. PhDs do NOT HAVE to be academics! \n\nNot sure your location...but in biology/ecology in can be very difficult to land your first lecture position...as your first lecture position will require lecture experience (ugh). TA, tutor, instructor, etc jobs will not really count towards this...as they will want someone who has experience in planning and developing courses. Regardless, get as much teaching experience as you can while you finish your PhD. Guest lecture for courses. See if you can help co-coordinate a course with a prof you are friendly with. But it's pretty normal for PhD researchers to not go into research...dont stress about that. Good luck",
              "author": "ObamazSemenAnts",
              "created": 1578631321,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}