{
  "sid": "elh4s1",
  "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/",
  "title:": "Is there an unspoken rule that you're not actually supposed to \"email ChairOfTheSearchCommittee@institution.edu for additional information about this position\" when applying for faculty jobs?",
  "text": "I'm hoping someone can shed some light on my experience today, because I'm thoroughly confused.\n\nI found a position I was interested in, but the advertisement and institution website didn't offer course descriptions publicly, and had little information about the curriculum and enrollment numbers.\n\nI was hoping to learn a little more about the program before applying, so I emailed the chair about the position asking if he would have a minute to answer a couple of questions. Now, the advertisement explicitly says **\"Additional information about this position may be obtained by contacting chair[at]institution.edu\"**\n\nI received an email back a couple of hours later saying (paraphrasing) \"Thank you for your interest. I can't answer any of your questions at this time, and all of the information you need to apply is in the job post.\"\n\nThough it wasn't those exact words, it was equally short and dismissive.\n\nSo, my question is: Did I make a mistake by emailing the chair? Are you not actually supposed to inquire for additional info, and if not, then why would that clause be in the job description?",
  "author": "BostonDrivingIsWorse",
  "created": 1578428653,
  "updated": 1634081395,
  "over_18": false,
  "upvotes": 126,
  "upvote_ratio": 0.97,
  "comments": {
    "fdi07vf": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi07vf/",
      "text": "Asking for a few minutes to answer some questions may sound like you are trying to get a \"backdoor interview,\" where you get to meet and present yourself to the chair without actually being invited to the next round of the search. If you have questions about the job post, just ask the questions, don't ask them for time to answer questions.",
      "author": "mazzar",
      "created": 1578433392,
      "upvotes": 206,
      "replies": {
        "fdjy099": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdjy099/",
          "text": "Thanks!\n\nAs others have stated, my handling of this email was clumsy, and I should've just asked the questions, rather than asking permission.\n\nThough it wasn't my intention to get a \"backdoor interview\", do you think the perception of my trying to get one would affect my candidacy? Perhaps hard to say without specifics...",
          "author": "BostonDrivingIsWorse",
          "created": 1578491033,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fdi1bhy": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi1bhy/",
      "text": "Your mistake was in asking permission to ask questions. \n\n\"Dear. Dr. Chair:\n\nI saw with interest the job posting for (position), however I have several questions that I cannot find answers to in the posting or the department website.\n\nFirst, how big will my office be?\" etc. \n\nThat way you've indicated that you did the leg work of reading the listing and website, she has the questions you asks and can answer at her leisure, and you've reduced what would be four email conversation (Can I ask a question? Yes. Question? Answer.) to two (Question? Answers).",
      "author": "fleemfleemfleemfleem",
      "created": 1578433984,
      "upvotes": 125,
      "replies": {
        "fdi4p56": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi4p56/",
          "text": "> First, how big will my office be?\" etc.\n\nThough, I would clarify to OP, this is not really the kind of question you should send to a search chair (I know you meant it as a joke, but OP seems genuinely unclear on this, so it's worth clarifying). You should be asking about the search itself (e.g., \"who is on the committee?\" is fair game, as would \"your position advertises for someone with X degree, is there any possibility you might hire someone with Y degree, or is it not worth my time to apply?\"). You should not be asking questions about the job itself (those you should reserve if you get a call-back).",
          "author": "restricteddata",
          "created": 1578435687,
          "upvotes": 102,
          "replies": {
            "fdi4thr": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi4thr/",
              "text": "Yeah, I'm just being silly with an example of a question that you obviously shouldn't ask.",
              "author": "fleemfleemfleemfleem",
              "created": 1578435747,
              "upvotes": 39,
              "replies": {}
            },
            "fdjxt54": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdjxt54/",
              "text": "Ha! I maybe clueless, but I'm not *that* clueless. Thanks!",
              "author": "BostonDrivingIsWorse",
              "created": 1578490874,
              "upvotes": 9,
              "replies": {
                "fdk5jmy": {
                  "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdk5jmy/",
                  "text": "Having been on a few searches now, I no longer take for granted that anyone has common sense about anything relating to jobs... ;-)",
                  "author": "restricteddata",
                  "created": 1578496554,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        },
        "fdi3qt2": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi3qt2/",
          "text": "Thanks!",
          "author": "BostonDrivingIsWorse",
          "created": 1578435204,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "fdid5uy": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdid5uy/",
      "text": "[deleted]",
      "author": null,
      "created": 1578440213,
      "upvotes": 58,
      "replies": {
        "fdj0o44": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdj0o44/",
          "text": "Hear, hear. This is spot on. If you have dealbreaker questions then ask them succinctly. If they’re more curiosities or something you could potentially ask during the time typically allotted at the end of an interview (should you get one), then skip them. Hiring protocol are much more formalized now than in years past due to concerns over inequity so be aware that there are strict limits on what the chair can even respond to. Also be aware that you don’t want to come across as pushy, needy, smarmy, etc., as this will be remembered when it comes time to select candidates to interview or during the interview itself.\n\nAnd this is probably a no-brainer, u/BostonDrivingIsWorse, but as a department chair myself, and one who has chaired numerous hiring committees, avoid any questions better answered by HR, such as those relating to salary, benefits, vacation, term dates, offices, etc. Even during an interview, avoid them. You don’t want the hiring committee to associate you with these types of questions instead of the aspects they’re focused on (teaching, research, publishing, grants, collegial service, etc.). Those types of questions seem to always leave a bad taste in committee members’ mouths, as it makes the candidate come across as more concerned about what they can get rather than what they can contribute to the institution and the department. I’m not saying those questions aren’t important ones, I am just saying to not ask them of committee members, at least not until you’ve got the job! Go directly to HR instead.",
          "author": "PhD4Hire",
          "created": 1578455453,
          "upvotes": 18,
          "replies": {
            "fdjyrli": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdjyrli/",
              "text": "Thank you!",
              "author": "BostonDrivingIsWorse",
              "created": 1578491644,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fdjyqcu": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdjyqcu/",
          "text": "Thank you for your response!\n\nAnother question if I may- do applications for full-time, non-TT faculty fall into the \"questions about course descriptions and enrollment are reasonable\" group, or the \"can probably be left for the formal interview stage\" group?\n\nLargely the answers to those questions *would* have an impact on whether or not it would be a waste of the search committees time to review my application, and thus whether I would apply.",
          "author": "BostonDrivingIsWorse",
          "created": 1578491616,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fdhtdjs": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdhtdjs/",
      "text": "If you asked a question answered in the job post, yes. \n\nOtherwise: at many places the constraints HR place on search committees are great; there isn't much they can say other than how to get a packet in and to check the job posting for \"what they're looking for\".\n\nOTOH, if the posting link is broken, the search chair is the one to contact.",
      "author": "ph0rk",
      "created": 1578429813,
      "upvotes": 44,
      "replies": {
        "fdigj9t": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdigj9t/",
          "text": "Just gotta say it, HR is such a pain in the ass.",
          "author": "Prof_Acorn",
          "created": 1578442400,
          "upvotes": 5,
          "replies": {
            "fdigqm6": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdigqm6/",
              "text": "They can be - but at state schools (like mine) everything related to a job search is subject to a FOIA request, so I can sort of understand some of the madness.",
              "author": "ph0rk",
              "created": 1578442534,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "fdhvad1": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdhvad1/",
          "text": "Thanks for the response!\n\nI didn't include any of the questions I wanted to ask in my email, to keep it short and introductory. I just asked if he could spare a minute to answer a couple of questions about the program.\n\nI understand including contact info in case there is a technical issue, but it seems silly and rude to say \"contact this guy for additional info, specifically regarding this position\", and then have that guy decline to provide additional info about the position.",
          "author": "BostonDrivingIsWorse",
          "created": 1578430780,
          "upvotes": 9,
          "replies": {
            "fdhzjqg": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdhzjqg/",
              "text": "He may not have been as willing to set up some sort of appointment so as to avoid seeming inappropriate. If you just email him what questions you have, he will probably give you a straightforward answer or direct you to who can give you answers.",
              "author": "boringhistoryfan",
              "created": 1578433034,
              "upvotes": 30,
              "replies": {}
            },
            "fdi0sxc": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi0sxc/",
              "text": "You are assuming that university HR practices make sense.  Let go of that assumption.  It is incorrect.\n\nYou should have included your questions in your original email.  Asking if you can ask questions is a waste of the search chair's time and I probably would have responded the same way.  All of the information you need \\*should\\* be in the job ad and in general I cannot give you inside information that is not available to other applicants.",
              "author": "bigrottentuna",
              "created": 1578433706,
              "upvotes": 49,
              "replies": {
                "fdi6huh": {
                  "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi6huh/",
                  "text": "Thanks so much for your response, and pardon my naiveté.\n\nWhat I'm failing to understand is why there would be a \"contact for additional info\" line in the ad, when it would be inappropriate for the chair to give me additional info? Is this part of my incorrect assumption that HR practices make sense?",
                  "author": "BostonDrivingIsWorse",
                  "created": 1578436595,
                  "upvotes": 5,
                  "replies": {
                    "fdi8vjf": {
                      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi8vjf/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1578437831,
                      "upvotes": 19,
                      "replies": {
                        "fdigrjy": {
                          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdigrjy/",
                          "text": "Such HR policies complicate these searches so much. I love the places that just let applicants email a letter and CV to the search chair and leave aside the pointless applications and checkboxes and procedure. Then when we're hired we can go over to HR to fill out the stack of papers post hoc.",
                          "author": "Prof_Acorn",
                          "created": 1578442551,
                          "upvotes": 10,
                          "replies": {
                            "fdiiql6": {
                              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdiiql6/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1578443823,
                              "upvotes": 3,
                              "replies": {
                                "fdip3fc": {
                                  "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdip3fc/",
                                  "text": ">Understanding that academic positions may have fewer applicants,\n\n150-250+ is the norm for most searches at my liberal arts college. Three times that for business positions. So I don't think it's that so much as HR just being HR, i.e. \"We know best and one size will fit all because we said so.\"",
                                  "author": "SnowblindAlbino",
                                  "created": 1578447868,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fdidww8": {
                      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdidww8/",
                      "text": "Well, I think you're missing the point of his response. You didn't ask a relevant question (which I bet he would have answered), and instead asked him to to commit to an unspecified meeting to answer unspecified questions.\n\nI would also decline, and save myself an hour of back-and-forth emails to schedule a meeting time, put it on my calendar, and in the worst case scenario, end up stuck on the phone with someone who starts reading their CV to me and asks whether they are qualified for this position.",
                      "author": "idleprof",
                      "created": 1578440701,
                      "upvotes": 27,
                      "replies": {
                        "fdmcil9": {
                          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdmcil9/",
                          "text": "Exactly",
                          "author": "bigrottentuna",
                          "created": 1578545560,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "fdia83l": {
                      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdia83l/",
                      "text": "u/blackcoffeeredwine nailed it.  Universities are bureaucracies and lots of people are involved in posting a job ad.  Not all of them know what the others want and many parts of the ads are from templates.  Result: a mish-mash of things from different sources which, when put together, may or may not make sense and may or may not reflect any specific individual's intentions.",
                      "author": "bigrottentuna",
                      "created": 1578438536,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fdhx1ex": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdhx1ex/",
              "text": ">  I just asked if he could spare a minute to answer a couple of questions about the program.\n\nWhether or not this information is easy to glean via the department website - the expectation is that you will glean it that way.",
              "author": "ph0rk",
              "created": 1578431700,
              "upvotes": 11,
              "replies": {
                "fdhyf93": {
                  "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdhyf93/",
                  "text": "Of course, of course. I wouldn't expect him to spoonfeed me information that is readily available. The point is that he declined to answer, prior to knowing what questions I would ask.\n\nPerhaps I caught him at a busy time, or perhaps I simply annoyed him. To my original question: Is this behavior common, or did I unknowingly make a faux pas with my inquiry?\n\nThe application period is extremely short, so it's also crossed my mind that the post is a formality for an internal hire.",
                  "author": "BostonDrivingIsWorse",
                  "created": 1578432436,
                  "upvotes": 2,
                  "replies": {
                    "fdi5rtg": {
                      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi5rtg/",
                      "text": "I’d decline conversations like that, too, because I cannot have them with everyone interested - something our HR tracks.",
                      "author": "ph0rk",
                      "created": 1578436228,
                      "upvotes": 17,
                      "replies": {}
                    },
                    "fdj8g8v": {
                      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdj8g8v/",
                      "text": ">The point is that he declined to answer, prior to knowing what questions I would ask.\n\n>Perhaps I caught him at a busy time, or perhaps I simply annoyed him. To my original question: Is this behavior common, or did I unknowingly make a faux pas with my inquiry?\n\nAs numerous people have already said, YES!!! \nYour faux pas was that you didn't just ask the questions (briefly) in your first email. You didn't give any indication that you'd already checked the website and couldn't find the info you were looking for. You didn't even give info about what your questions were about",
                      "author": "pigglywiggins",
                      "created": 1578461442,
                      "upvotes": 9,
                      "replies": {
                        "fdjz5ai": {
                          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdjz5ai/",
                          "text": "I see now that it was a mistake not to ask the questions up front. It wasn't in my original post, but I did mention that I had questions about \"curriculum practices, and enrollment\".",
                          "author": "BostonDrivingIsWorse",
                          "created": 1578491944,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fdi9ucl": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi9ucl/",
      "text": "Welcome to academia, which is full of written rules that 1) mean the opposite of what they say (or mean nothing at all) and 2) unwritten rules that will determine the success you enjoy in your career, and your ability to even have a career in the first place. This is a feature, not a bug, in the system, because it provides critical gatekeeping functions to keep Certain People out so that Serious People and Brilliant Scholars can be assured a place in the ivory tower. Good luck.",
      "author": "episcopa",
      "created": 1578438337,
      "upvotes": 24,
      "replies": {
        "fdih6ee": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdih6ee/",
          "text": "My favorite is when people on the committee have secret priorities for the new hire that are unlisted or when there is an item in the listing only because the dean wants it and it will be ignored by the entire committee. Makes it super easy to know where to apply to and what skills to highlight.",
          "author": "Prof_Acorn",
          "created": 1578442823,
          "upvotes": 16,
          "replies": {
            "fdj4gv1": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdj4gv1/",
              "text": "[deleted]",
              "author": null,
              "created": 1578458194,
              "upvotes": 1,
              "replies": {
                "fdjsda8": {
                  "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdjsda8/",
                  "text": "yeah it would be easier to have a conversation in sign language with a late-stage Huntington's patient.",
                  "author": "eskimoFry",
                  "created": 1578485757,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fdi26hq": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi26hq/",
      "text": "Some one emailed me today about a position I'm chairing and made some (possibly unintentional?) backhanded compliments about how nice it would be to work in my quaint writing center. Don't do that. Be brief, and refrain from complimenting or critiquing the program in any way. I know what my program is about, trust me (I'm drowning in assessment paperwork), so I don't need random evaluation from strangers.",
      "author": "cdb3492",
      "created": 1578434402,
      "upvotes": 21,
      "replies": {
        "fdi2vdh": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi2vdh/",
          "text": "I promise that wasn't me.",
          "author": "BostonDrivingIsWorse",
          "created": 1578434749,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "fdiow4x": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdiow4x/",
      "text": "I've chaired at least a dozen searches and have been a department chair for far too long. I am always happy to take those calls/emails, because 1) I don't want to be bothered with applicants who aren't good fits for the job, and 2) I don't want to miss a good applicant who isn't sure about the position. One of my favorite colleagues was hired away from a tenure-track position elsewhere \\~15 years ago because she called me to ask some questions about the job...she wasn't on the market but was intrigued enough to apply after we talked about the course load, tenure expectations, etc.\n\nWe welcome questions and will answer any that we can as quickly as possible. I won't vet people's applications for them or tell them anything confidential, but why would you not be willing to tell them what courses they'd be teaching, how big the classes are, and other relevant info that isn't in the job ad or available on the departmental web site?",
      "author": "SnowblindAlbino",
      "created": 1578447739,
      "upvotes": 12,
      "replies": {
        "fdip7bf": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdip7bf/",
          "text": "> why would you not be willing to tell them what courses they'd be teaching, how big the classes are, and other relevant info that isn't in the job ad or available on the departmental web site?\n\nLiterally the questions I would have asked.",
          "author": "BostonDrivingIsWorse",
          "created": 1578447937,
          "upvotes": 6,
          "replies": {
            "fdj4668": {
              "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdj4668/",
              "text": "Probably best just to ask them directly. But given the tone of some of the responses in this thread, it appears that a good many search committee chairs simply don't want to be bothered by applicants until HR's computers trim the list and they can winnow the pool to something more manageable-- or they may simply be saying \"screw it, I'm not working on this search until it closes.\" Which is, as I noted, stupid because you're likely to lose good candidates as well as retain others you'll waste time evaluating. Better to simply provide info up front, or if you can't, to provide it to those who ask.",
              "author": "SnowblindAlbino",
              "created": 1578457968,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fdi36lx": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi36lx/",
      "text": "I am with others here that say that information is provided for you by the institution’s website, only some of the work you must do for your application. By not including them at all, you left them in the position that they had to assume some other question beyond what Wikipedia + scoping out the website told you.",
      "author": "amishius",
      "created": 1578434910,
      "upvotes": 7,
      "replies": {}
    },
    "fdi39w8": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi39w8/",
      "text": "It was probably because there is some information about the courses available through the university’s website, though it may hard to find. I have (unfortunately) extensive experience applying to academic jobs and have found that there is a lot of variability in terms of the ease of navigating a university website. Sometimes you have to dig pretty deep to find information about their classes.\n\nThat and the search chair might be kind of a jerk.",
      "author": "GrandmaMabelGrey",
      "created": 1578434959,
      "upvotes": 6,
      "replies": {}
    },
    "fdjxg0z": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdjxg0z/",
      "text": "You should have asked your questions right away. Asking for time to answer questions is just a timewasting email. I always contact the HR department or chair or relevant coordinator to get a better grasp of the job but always after reading the job description thoroughly.",
      "author": "frugalacademic",
      "created": 1578490572,
      "upvotes": 3,
      "replies": {}
    },
    "fdipcw0": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdipcw0/",
      "text": "To add what has already been said, you didn't make a mistake - no harm, no foul.\n\nBut, why worry about the program unless they seriously offer you an interview/job?  Just put in your application (one of many), and if you make it to the on-campus interview, you will have HOURS to ask every conceivable question you could ever imagine.\n\nYou have a long, long way to go to get to even the first round - just put in applications, and see what happens. \n\nThat is all you can do.",
      "author": "TallRazzmatazz5",
      "created": 1578448037,
      "upvotes": 3,
      "replies": {
        "fdjzgfi": {
          "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdjzgfi/",
          "text": "Largely because it would determine if it would be a waste of the committees time to review me as a candidate, and a waste of my time to apply (though less important).",
          "author": "BostonDrivingIsWorse",
          "created": 1578492184,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fdhyb73": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdhyb73/",
      "text": "Sounds like you determined at the very least the chair of the search committee for that department is a douchebag.",
      "author": "herbertwillyworth",
      "created": 1578432375,
      "upvotes": -8,
      "replies": {}
    },
    "fdi0sgq": {
      "link": "/r/AskAcademia/comments/elh4s1/is_there_an_unspoken_rule_that_youre_not_actually/fdi0sgq/",
      "text": "You didn't make a mistake. Search committee head is an idiot.",
      "author": "radionul",
      "created": 1578433699,
      "upvotes": -16,
      "replies": {}
    }
  }
}