{
  "sid": "q1u9jj",
  "link": "/r/AskAcademia/comments/q1u9jj/how_do_i_explain_why_im_captivated_by_a_field/",
  "title:": "How do I explain why I'm captivated by a field?",
  "text": "Sorry if I'm posting this in the wrong subreddit, any suggestions to where it might fit in better are warmly welcomed.\n\nI'm sat writing a personal statment for a second undergraduate degree, and I'm struggling to find appropriate words to explain *why* I like the field (law) so much. I was wondering if AskAcademia might be able to lend a hand by sharing why you love the fields you are in, and how you got around to being able to formulate it in a good way for yourselves?\n\nTo me, it's almost just emotional thing; when I've observed cases in courts I am captivated by the game of arguments, when I read articles things *make sense* and I feel at home. It's *fun* to play the game pf analysis and understanding the interaction between rules, understanding what guiding values we've sedimented into formal rules, and how what happens \"within\" the law influences wider society etc. Throughout the five years I've bene studying the law from a socio-legal perspective, it's just been that one spot of my life that makes sense and where I get things. \n\nWhat is it like for you guys?",
  "author": "RefrigeratorOK_96",
  "created": 1633432550,
  "updated": 1634078764,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hfgzda2": {
      "link": "/r/AskAcademia/comments/q1u9jj/how_do_i_explain_why_im_captivated_by_a_field/hfgzda2/",
      "text": "This may be an unpopular opinion, and I guess it depends on what the prompt is asking you, but I get tired of reading personal statements that are all about how passionate people are about their proposed field of study. Everybody's passionate (or says they are), that's why they're applying. I would much rather read a statement where the focus isn't on how much you love your field, but rather how prepared you are to succeed in the program. Being \"passionate\" is a component of that but it's by no means the only component.",
      "author": "justaboringname",
      "created": 1633437014,
      "upvotes": 11,
      "replies": {
        "hfh08xf": {
          "link": "/r/AskAcademia/comments/q1u9jj/how_do_i_explain_why_im_captivated_by_a_field/hfh08xf/",
          "text": "yes—strongly agree! I assume my graduate students care about the subject area. Don’t waste words writing about your passion. Explaining what you know about the field so far and why you think you would be good at the work is much more helpful.",
          "author": "Distinct_Armadillo",
          "created": 1633437506,
          "upvotes": 7,
          "replies": {}
        }
      }
    }
  }
}