{
  "sid": "qx40nu",
  "link": "/r/AskAcademia/comments/qx40nu/how_long_is_too_long_before_quitting/",
  "title:": "How long is too long before quitting?",
  "text": "I'm a postdoc in the life sciences and I've gradually come to the realization that academia is not for me. When I entered academia almost 10 years ago for a Masters, I was very uncertain about my job prospects and what I wanted to do with my life, was in the middle of a big depression, so I just rolled with it when a job opened up. That got me into the field, which later turned into a PhD, and later into a postdoc - always in the same institution, and mostly with the same mentors - my PhD supervisor is still my boss in the postdoc, which I went into because that allowed me to maintain some life balance without having to move to another country. I guess I'm reasonably good at what I do, at least my supervisor seems content with my work most of the time (despite my constant imposter syndrome).\n\nThe kind of research I do is... ok. Just not passionate about the topic I work on but it is objectively interesting, and publishes very well. Could be a stepping stone into my own actual interests but I'm so full of work with projects from my PI that I never have time to even sit down and think about my own stuff (which is what a prospective independent scholar should do). Even if I eventually just grind it out, I'm fed up with the politics, my institution, or if I change labs the idea of uprooting my life just for the sake of a career I don't even care much about or even dreamed about. \n\nBottom line, I feel like the career is disconnecting me from my own interest in the broader life sciences. Whenever I think about moving on from academia, I'm genuinely hopeful again and feeling confident of finally taking back control of my career and not spend it busting my ass for someone else's research interests. I am ready to move on, the thing is... I recently won important funding, and me quitting now would complicate things a lot for my lab and my institution (administrative problems and collaborator problems). I've kind of decided to wait about a year before quitting, at a point this issue won't be a problem anymore. Actual question: is grinding it out one extra year before quitting too much? Am I crazy for prioritizing the current status quo ahead of my own mental health and career opportunities?\n\nTL,DR: fed up with academia, thinking of holding on for one extra year just for the sake of finishing a project, am I crazy?",
  "author": "jupiterisred",
  "created": 1637282491,
  "updated": 1637353660,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.89,
  "comments": {
    "hl7he54": {
      "link": "/r/AskAcademia/comments/qx40nu/how_long_is_too_long_before_quitting/hl7he54/",
      "text": "It seems like you will be really struggling in the upcoming year if you keep the status quo. What about applying to jobs now and reassess staying vs going if you get any offers? And/or talk it out with your PI to see if they can change anything to make your stay more bearable. Best of luck to you.",
      "author": "BelgaerThinker",
      "created": 1637291149,
      "upvotes": 11,
      "replies": {
        "hl87w8x": {
          "link": "/r/AskAcademia/comments/qx40nu/how_long_is_too_long_before_quitting/hl87w8x/",
          "text": "My post-academia plans is to try out freelancing, so I could try to build up some things on the side in the meantime. My contract has an exclusivity clause, I can't do anything professionally outside of my postdoc (although of course the institution doesn't mind me doing lots of research in addition to the contracted project). But maybe if I ask for permission to do some non-research things on the side, like tutoring to increase my income, they won't mind.\nAs for talking with my PI, I already had some discussions about having too large a workload. He agrees, but even if temporarily I get reduced expectations and work eases a bit, eventually he starts asking about projects X, Y and Z, and the cycle of worrying starts again. I will have the discussion with him eventually that I'm leaving, but I'm dreading that moment...",
          "author": "jupiterisred",
          "created": 1637305982,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hl8q362": {
      "link": "/r/AskAcademia/comments/qx40nu/how_long_is_too_long_before_quitting/hl8q362/",
      "text": "Keen to hear answers for this. I’m in my first year of postdoc-ing and after a pretty intense year finishing my PhD, I’ve had to take time out for burnout. Seriously thinking about my prospects in academia myself - I have 6 months left on this contract and wondering if I can even finish it.\n\nIf I were you, I’d pursue other jobs and seriously consider options if you do get any offers. I’m fast learning that my mental health is way more important that staying in a job I’m not gelling with. They’ll always get someone else for the work, even if it’s complicated. You only get one brain.",
      "author": "staringspace",
      "created": 1637320538,
      "upvotes": 5,
      "replies": {
        "hl92f1y": {
          "link": "/r/AskAcademia/comments/qx40nu/how_long_is_too_long_before_quitting/hl92f1y/",
          "text": "Thanks for sharing your experience. My feeling reading your post is that maybe it would be best to stay for the last 6 months, that way it will be easier to quit without burning bridges. In my case I have an actual contract for 5 more years, so bridges may be burnt and I have to be super careful, that is why I'm thinking of at least tying up my funded project. But again, I don't know the specifics of your case, and not trying to play down your suffering",
          "author": "jupiterisred",
          "created": 1637328145,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}