{
  "sid": "pahdfv",
  "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/",
  "title:": "Academic job pay schedules",
  "text": "A question for those who have been in the academy for a while: is it pretty normal for academic positions, including full faculty positions, to not provide a first full paycheck until 2-3 weeks *after* your official appointment start date? Also, is it remotely normal for the appointment start date to be shifted to a later date (in my case, by a week) from what is given in the contract I signed? This was done to every new hire at my new institution, and it seems fishy to me. The original start date would have had us all getting a significant paycheck at the end of this week, but now we all get paid a tiny amount this week and don’t get a full paycheck until two weeks later. And, we never signed new contracts where we agreed to this change.",
  "author": "UCBC789",
  "created": 1629784397,
  "updated": 1634079511,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "ha54py1": {
      "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha54py1/",
      "text": "[deleted]",
      "author": null,
      "created": 1629797555,
      "upvotes": 19,
      "replies": {
        "ha5qhgt": {
          "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha5qhgt/",
          "text": "I’ve been in contact with HR and even the provost of my (relatively small) institution about it. Provost told me it is normal, and part of the reason for my post was to double check that. Both of my previous post-PhD positions actually gave me *two* months pay by the time I started teaching, so I suppose I came in with unusual expectations. However, provost’s last response to me dodged my (explicit) question about the legality of changing our appointment start dates without having us sign new contracts. \n\n\nThis actually isn’t coming from my institution’s admin directly though- it’s at the level of the university system my institution falls within. The reason given for the shift is to make our appointment start dates line up with the beginning of a pay period. Since the original dates were in the middle of the period, we wouldn’t have gotten full paychecks this Friday anyhow, but it would have been enough to help a lot. Now, all we get on Friday is pay for two orientation days, which doesn’t even cover my half of the September rent for the apartment I share with my SO. I’m lucky that she can wait for me to pay her back.\n\nWhat may still be the fault of the admin at my institution is failing to notify us about this until last week, *after* our original appointment start dates. At this point, these are issues that I’ll ultimately end up discussing with the faculty union I’m joining. It’s become clear I will get nowhere on my own.",
          "author": "UCBC789",
          "created": 1629811599,
          "upvotes": 1,
          "replies": {
            "ha6k00p": {
              "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha6k00p/",
              "text": "Paying in arrears is pretty much standard for all jobs, academia included. You get paid for the work you did, not the work you might do in future. \n\nShifting the dates is iffy - especially if you've already started working. Legally they have to pay you for the time you worked. And telling you after you started definitely isn't ok. \n\nAlongside your union, you may want to consult an employment lawyer who can advise you of your rights and help you craft emails with the right language to HR. Unions are generally good but sometimes useless (especially if you're a woman). \n\nLastly, you can ask for an advance on your pay. They aren't obliged to give it to you but many places will. It does mean you then don't get paid later though.",
              "author": "ACatGod",
              "created": 1629824190,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "ha5a7l9": {
      "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha5a7l9/",
      "text": "Contracts start Aug 1 but the first faculty event was Aug 9 for new faculty; for returning faculty it was Aug 11. Faculty don't need to \"report\" until there's an event for them. Classes started Aug 16. First paycheck will be Aug 31.",
      "author": "rockyfaceprof",
      "created": 1629802054,
      "upvotes": 6,
      "replies": {}
    },
    "ha4t3qk": {
      "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha4t3qk/",
      "text": "For what it’s worth, my stipend for PhD student will not begin until the month after I begin. But nevertheless that does seem a bit strange to have this shift after you signed the contract. Sorry I can’t offer any advice but maybe another situation will add clarity to your situation",
      "author": "KHippe",
      "created": 1629787461,
      "upvotes": 4,
      "replies": {
        "ha5oi77": {
          "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha5oi77/",
          "text": "That was the case in my PhD program as well, but that was always clear in the contract.",
          "author": "UCBC789",
          "created": 1629810624,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ha500r0": {
      "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha500r0/",
      "text": "Yes, some universities have a delay. Some have weird pay days too, make sure you check on your auto payments. I was in trouble when I started getting paid at the beginning of the month (vs the end) when I started the tenure track. Seems like a small difference… but it can be major on certain pay periods.",
      "author": "baileyes74",
      "created": 1629793363,
      "upvotes": 3,
      "replies": {
        "ha5rfzx": {
          "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha5rfzx/",
          "text": "Mine does have odd pay periods. We get paid on two week cycles instead of monthly which, given the way this uni system operates, is probably a lucky break. The ‘moving allowances’ I and other new hires get are not being paid to us until a full 30 days after our modified (not original) appointment start dates, coming with our second paychecks instead of our first ones. The main contract promises payment of those ‘within the first month’ of employment, and they decided to literally push the limit of that as much as possible. Given that they made us sign a promissory note saying that we’ll repay the allowance if we leave the job in 6 months or less, it baffles me that they would insist on giving that to us at the very last minute. \n,",
          "author": "UCBC789",
          "created": 1629812059,
          "upvotes": 1,
          "replies": {
            "ha621zg": {
              "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha621zg/",
              "text": "Our institution requires receipts for moving reimbursement and by the time everybody gets those in and approved by chairs and deans some will be past the first pay period cutoff (that's about the 20th of the month). They want to do everybody's at the same time for some unknown reason. So, it goes to the next month.",
              "author": "rockyfaceprof",
              "created": 1629816775,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ha5kqmf": {
      "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha5kqmf/",
      "text": "[deleted]",
      "author": null,
      "created": 1629808675,
      "upvotes": 2,
      "replies": {
        "ha5rvf6": {
          "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha5rvf6/",
          "text": "My provost told me a similar story about her first ever teaching position in response to my inquiry. That’s just awful treatment of new employees. I wonder what (if any) other white collar employers are as confusingly stingy as higher ed in this way. That sort of pay schedule makes it extremely difficult to move for the job, especially when (as in my case) any moving allowance you get arrives similarly late.",
          "author": "UCBC789",
          "created": 1629812260,
          "upvotes": -1,
          "replies": {
            "ha62c92": {
              "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha62c92/",
              "text": "Well, every job I ever had paid at the end of a work period. My kid and her husband (lawyers at different firms) got paid at the end of the work period for their first checks and all others. But, your point about it being difficult is certainly true. Things can get very tight before a paycheck arrives.",
              "author": "rockyfaceprof",
              "created": 1629816898,
              "upvotes": 1,
              "replies": {
                "ha79fap": {
                  "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha79fap/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1629834215,
                  "upvotes": 1,
                  "replies": {
                    "ha7cv5e": {
                      "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha7cv5e/",
                      "text": "That's a good idea. I never saw that or thought of it. But it would certainly be helpful. It was pretty typical for new young faculty to be scraping the bottom of the financial barrel when they got to campus. I was able to get a new faculty member a summer class one year when the scheduled prof bailed and the new faculty member had already moved to town. But that was the only time I was able to help out a new faculty member financially before their scheduled first paycheck.",
                      "author": "rockyfaceprof",
                      "created": 1629835578,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ha6cz0w": {
      "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/ha6cz0w/",
      "text": "Completely normal. The only weird thing is the change in the start date, but you're always paid after the period ends, often even with a larger lag than you report. For example, start Sept. 1, get paid at the very end of September.",
      "author": "uniadminthrowaway",
      "created": 1629821347,
      "upvotes": 1,
      "replies": {}
    },
    "hae418v": {
      "link": "/r/AskAcademia/comments/pahdfv/academic_job_pay_schedules/hae418v/",
      "text": ".",
      "author": "ciffy13abc",
      "created": 1629956811,
      "upvotes": 1,
      "replies": {}
    }
  }
}