{
  "sid": "m6m5ne",
  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/",
  "title:": "Academics who publish more than your peers: what do you do differently?",
  "text": "I've been using Scopus to compare publication records of academics in my field who have received early career grants to get an idea of what I should be aiming for. In doing this I've noticed that most people have a similar number of publications - usually 1-2 first author papers per year, plus a more variable number of co-authored papers further down the author list. \n\nHowever, there are some people who are comparably prolific, publishing upwards of 4 first-author publications a year multiple times in the first 5 years of their career (highest I've seen is 7 in one year), usually alongside many more co-authored papers. These authors are publishing in reputable journals with solid citations so they aren't just targeting easier journals.\n\nI've noticed that this usually occurs when the authors sticks closely to the same topic, sometimes even the same dataset (cohort studies in public health/psychology/psychiatry), or studies of different cohorts testing the same/similar research question.\n\nI'm curious about some less obvious differences that might be present. Writing on the same topic/data over and over of course is going to make writing faster and reduce time spent collecting data, but I don't think it's the whole story. I assume there must be other contextual factors at play, as well some differences in how these authors work.\n\nIf you are someone with a lot of first-author publications (in a field where that matters) compared to your peers, or you know someone like this, what do you think allows them to publish twice as much as their peers?",
  "author": "Miroch52",
  "created": 1615936427,
  "updated": 1634080678,
  "over_18": false,
  "upvotes": 208,
  "upvote_ratio": 0.98,
  "comments": {
    "gr6sskj": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6sskj/",
      "text": "Collaboration, so you’re one author on many papers. \n\nI knew an extremely prolific publisher who said he always looked for a publication from whatever he was doing. If he read a book, he wrote a book review. If he read an article he disagreed with, he wrote a reply. If he gave a speech, he wrote a paper. He had his own institute when I knew him, with loads of contracts with companies that provided data in return for consultation and money to pay an army of research assistants and students (he was in marketing). He worked a lot, and his wife worked in the same institute.",
      "author": "ginisninja",
      "created": 1615943110,
      "upvotes": 55,
      "replies": {
        "gr87y48": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr87y48/",
          "text": "I agree re: collaboration. And find someone who complements your weaknesses. If you’re a data person, find someone who is great at framing ideas. And if coming up with new ideas is your issue, then find someone who is good at it and be a closer so that they want to work with you. I know a lot of people who over time start publishing with similar names, and it’s usually because they develop specific roles within the research process that works well for them.\n\nOne of my old professors, for example, didn’t own any statistical programs on his computer. Yet he put out 5ish stats-heavy pubs a year. How? He worked with 2 other people who were both amazing with stats so he focused on the ideas, framing, and writing of the papers. All his solo papers were more theoretical or historical, with basically no statistical analysis. But it worked for him.",
          "author": "RHOAcademia",
          "created": 1615982370,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gr6otqs": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6otqs/",
      "text": "No kids and a spouse who also has a career.  It allowed me to spend as much time as I wanted publishing papers that I really enjoyed writing.  I’m not crazy prolific, but I do tend to fall above the mean.\n\nThe prolific folks I know in my field (social sciences) seem to be in that boat (at least in the earlier stages of their career).  The most prolific person in my field publishes 20 or so a year first author.  In chatting with him, it’s because he has a formula he uses to “tell the story” for each article.  It works really well and his articles are always some of the best I ever read.",
      "author": "tmodoc",
      "created": 1615941025,
      "upvotes": 148,
      "replies": {
        "gr72urs": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr72urs/",
          "text": "What is this magical formula? Asking for a friend",
          "author": "aledaml",
          "created": 1615948512,
          "upvotes": 37,
          "replies": {
            "gr86bao": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr86bao/",
              "text": "Unhealthy. The basic formula is unhealthy. Or, you know, unethical. Fabricating stuff, stealing colleagues’ ideas, profiting off their work in an unethical manner....",
              "author": "researcher1701",
              "created": 1615981142,
              "upvotes": -1,
              "replies": {
                "gr8x95r": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8x95r/",
                  "text": "WTF, none of that stuff is suggested in the original commenter's post. \n\nThey mean a formula for putting together a good article, not a formula for generating excess research results.",
                  "author": "pb-pretzels",
                  "created": 1615995871,
                  "upvotes": 9,
                  "replies": {
                    "gr97ww2": {
                      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr97ww2/",
                      "text": "They didn’t ask for a formula for putting together one good paper. Rather how topump out many papers per year. Productivity, as in number of papers per unit time. \nThis number is a common but bad metric, and it can be pumped up e.g. by working unhealthy amounts (what I did) or by unethical behavior like cutting corners, fudging data, choosing low hanging fruit etcetera.\nI think the metric is bad and that it selects for bad behavior.\n\nCutting corners, anomaly hunting, p-hacking are all very common. At times due to genuine dishonesty, at times due to inexperience. I have seen both - and a mix of the two.",
                      "author": "researcher1701",
                      "created": 1616000584,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gr6qadh": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6qadh/",
          "text": "What amount of “unique” or “original” research goes into this though? I would argue strongly that nobody can publish “100 books in their life time” or “20 articles a year” of unique or original research, no matter how few kids they have, or how many “just write four pages a day” mantras they hand out to new academics. \n\nNot that publications that aren’t exclusively unique or original research lack value, but this is a key distinction here. A lot of people who get published often are heavily recycling / reframing existing research and submitting for publication. Don’t believe me, simply follow the breadcrumbs of your favourite academic and read every paper they’ve published in the past 5 years. \n\nFurther, late career scholars are often heavily incorporated within research networks that ASK you to publish a contribution in an edited volume / special issue with little oversight. This can help to pad your CV, where one or two unique articles a year can be supplemented with one or two summaries / reframings for the purpose of the volume. \n\nI think the above and the quantity/quality aspect is an important dimension to recognize when assessing how much someone publishes. A lot of the other comments seem to correlate publishing rates with a capacity to “work harder” (more hours, more disciplinary writing techniques, less social life), but often it’s “work smarter” (reframing and collaboration with networks). \n\nIn some fields (think lengthy field research), it would be absurd to imagine publishing a book every year, let alone multiple.",
          "author": "doctorpolitik",
          "created": 1615941791,
          "upvotes": 99,
          "replies": {
            "gr6qi7a": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6qi7a/",
              "text": "I think you raise some good points!",
              "author": "tmodoc",
              "created": 1615941905,
              "upvotes": 18,
              "replies": {
                "gr6t7w9": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6t7w9/",
                  "text": "I think I left out recommendations for OP. Lol. \n\n1. Focus during your early career on establishing good research skills, and pushing forward unique and original research as much as you can. Develop your niche. Develop your angle. Get an overview of the land that you wish to contribute to.\n\n2. Use #1 to get engaged in as many productive research networks in your field as you can. Your unique and original contribution will establish your “niche” in an already oversaturated market for publications, and allow you to “work your way in” as the expert on “x” from position “y”.\n\n3. Publish your unique and original research in leading journals / in book format. Depending on the field, this can be through co-authored or solo authored publications. In my field (a social science with solo publication gold standard), aim for 1-2 high-tier articles PER YEAR in an industry leading journal of unique and original research. \n\n4. Publish summaries, reworkings, clever reframings, deeper investigations of a concept, experimental ideas in anything granted to you via your networks (edited volumes, special issues, reviews). If possible, try to take one of the above articles in #3 and publish 1-2 variants of it in top-tier or second-tier journals PER YEAR. Take chances on developing new directions here.\n\n5. Learn time management early. Do not waste time on projects that have no output to developing your CV, even if you think it’ll benefit you “intellectually”. This, sadly, might include extra curricular activities like teaching, administration, mentoring (and being good at these things). Spend your time exclusively on research and writing where possible. Aggressively resist anything else. This is far less realistic for some than others. \n\nIn the end (and especially in relation to #5), academia has been completely stripped down to market fundamentals. If you want to be a prolific thinker who writes one magnum opus in their life and becomes revered for their brilliance, don’t count on tenure (or at least wait until you’re already fully tenured to pursue this dream). \n\nPublish or perish is a sad reality, and for all the benefits of an over saturated market, it is very difficult to sit on something for a long time and not have someone beat you to the punch. There are very few unique or new ideas out there. This can be both DEPRESSING and LIBERATING in the context of publishing. On the latter, I often see the EXACT argument and evidence presented in my field by three to five different authors with only very slight variations of argument. In the same journals. It’s the nature of peer review and the sheer size of information out there.\n\nHopefully the above will help a bit in terms of contextualizing how things work at least in my field. Or perhaps, depending on where you are in your career, at the least revealing a little bit of the depressing burden it is for early-career scholars to overcome in today’s market.",
                  "author": "doctorpolitik",
                  "created": 1615943336,
                  "upvotes": 62,
                  "replies": {
                    "gr7fksc": {
                      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7fksc/",
                      "text": "I find 4 so difficult. I want to work on research, not rehashing old ideas or trying to sell my personal opinions. It’s probably silly of me because a publication is a publication so maybe I just need to explore options for papers that aren’t strictly speaking research.",
                      "author": "QueenAsphyxiaXIX",
                      "created": 1615956357,
                      "upvotes": 8,
                      "replies": {
                        "gr969oe": {
                          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr969oe/",
                          "text": "I would just think of publishing as a way to build on your thoughts, and share those thoughts, rather than a complete interrogation of a new and novel issue.\n\nThis is counterintuitive (and perhaps impossible in some fields like sciences I’m not sure), because publishers like to say they only publish new and innovative research. But the standard for innovation is TRULY baby steps. \n\nAn example (not related directly to my research):\n\nSay you’ve done field research to determine whether level of education / prestige of institutional training influences perceptions of class in government officials.  \n\nI.e. does a Harvard graduate in law have bias in their policymaking that favours the upper class? Is this statistically different than those in government who graduated from a lower or mid-tier university? \n\nYour first publication is on the results of your study and the data therein with preliminary directions for future research.\n\nYour second publication is applying a theory to understanding this data. You outline the use of the theory and it’s previous manifestations, then you rehash the findings from your previous data to prove / add weight to this theory. Or, depending on your epistemology/ontology, you use this theory to interpret the meaning of this data. \n\nYour third publication may be in an edited volume or special issue where you contextualize your findings from #1 and #2 within broader developments in your sub discipline. Weaknesses in dominant theory, etc. This is more a commentary of how your research relates to the field.\n\nYour fourth paper can use the data to compare against other data, or to go deeper. I.e. we compared state government officials in Utah vs. New York. Or, between Canada and US. Then make some preliminary suggestions about why the results vary / are similar. \n\nYour fifth paper expands on these preliminary suggestions and applies your previous theory in paper 2 to the issue. \n\nYour sixth paper takes a chance on a novel theoretical approach or dimension you’ve wanted to explore regarding that issue (now is your time to use Foucault!). \n\nThe cycle continues - you think of a new idea or you just make a career taking “baby steps” on your previous research. \n\nIn the end we ALL want our research to be the paper that blows everyone out of the water or radically changes the direction of the field. But truth be told, even the most cited papers are just “baby steps” on other people’s work. Sometimes it’s the clarity in language that makes them popular, sometimes it’s simply the title, other times it just becomes “viral” for no reason at all. Chasing being viral IMHO is less of a chance at becoming “prolific” than simply just writing and writing until one of your pieces stick. \n\nWorst case scenario, a few people appreciate what you’ve done in your life time but you have a good job doing what you love at a decent university. Best case scenario, you use these baby steps to build a community and get flooded with amazing ideas to contribute to projects you dreamed you’d be working on.",
                          "author": "doctorpolitik",
                          "created": 1615999858,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    },
                    "gr6ytkn": {
                      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6ytkn/",
                      "text": "Really working on #1 and #2 right now. Thanks for the tips!",
                      "author": "Miroch52",
                      "created": 1615946328,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gr8a6c7": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8a6c7/",
          "text": "> “tell the story” for each article\n\nAre there any good books/sources for this?",
          "author": "tiensss",
          "created": 1615983921,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gr7f0xt": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7f0xt/",
      "text": "As a first year PhD student in a field where most people get a single first author paper over the course of their PhD or postdoc: what the actual fuck are with these comments and the insane publication rate.",
      "author": "ahf95",
      "created": 1615955977,
      "upvotes": 49,
      "replies": {
        "gr7p38u": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7p38u/",
          "text": "Different publication cultures across fields. For example, what in some fields is frowned upon as \"salami slicing\" is entirely normal in other fields.",
          "author": "ColourlessGreenIdeas",
          "created": 1615964217,
          "upvotes": 14,
          "replies": {}
        },
        "gr7url3": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7url3/",
          "text": "Exactly what I was thinking. One of my colleagues is finishing his PhD this year and he has like 4 first author papers and maybe a couple of collaborations where he's second author. How are people here writing more than 4 papers per year? It's insane.",
          "author": "rorroverlord",
          "created": 1615969856,
          "upvotes": 10,
          "replies": {
            "gr83uad": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr83uad/",
              "text": "All those other authors on your colleagues papers? They only need to be supervising three PhDs, a postdoc, a former PhD and lead one or two papers of their own, that’s 10-15 at least. Not everyone on a paper is contributing an equal amount of writing.",
              "author": "ginisninja",
              "created": 1615979094,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "gr7npto": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7npto/",
          "text": "As a fellow PhD student, I consider myself an utter beginner. The point of the PhD is to learn how to conduct and publish papers. It's not fair to compare the student's work to the teacher's.",
          "author": "Miroch52",
          "created": 1615962984,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gr6p1o4": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6p1o4/",
      "text": "I’m in history and area studies. I like to think of my projects in terms of trilogies of interrelated articles, which are vehicles to communicate new information and perspectives while the longer-term project is ongoing. Associating myself with European and East Asian grant-funded research projects has also helped, since those often have publication requirements, which less to articles in special issues, edited volume chapters, etc.\n\nAlso, colleagues and I (at a poor institution where we had to push extra hard to get external funding and a chance to move) used to talk about the “minimum publishable unit” (MPU). An MPU roughly represents the amount of data and analysis necessary to make a valuable contribution to the field, such that it would be publishable as a journal article roughly 6,000-10,000 words in length. Thinking in terms of MPUs helped us restrain our natural tendency to put too much information into an article, and pushed us instead to streamline our writing and target a specific audience.\n\nFor example: If an article draft is 12,000 words and covers two related topics... maybe that’s actually 2 MPUs, and ought to be divided into two articles, so the ideas have space to breathe.\n\nIf a draft uses three methodologies to examine one subject... could it be 3 MPUs, each of which ought to go to a different journal? Could each part be fleshed out? If not, maybe it’s just 1 MPU.\n\n4-6 MPUs, of course, would be a book. 1-2 of those MPUs could be published separately as articles earlier on.\n\nThe idea isn’t to cheapen our work, but to avoid the compulsion to say everything in one massive super-article, and instead sharpen our arguments and speak to different audiences. I’ve seen senior European academics in my field do something similar.",
      "author": "Atarut",
      "created": 1615941143,
      "upvotes": 111,
      "replies": {
        "gr6qxm4": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6qxm4/",
          "text": "This might actually explain the prolific writers having papers with similar topics - they're probably breaking down their project into MPUs instead of trying to stuff it all into one big paper. \n\nI have a massive issue with my supervisor always suggesting something else to add to a paper. I do think my first paper could easily have been two papers. Thanks for the tip!",
          "author": "Miroch52",
          "created": 1615942130,
          "upvotes": 22,
          "replies": {}
        },
        "gr6pt2t": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6pt2t/",
          "text": "Strongly agree with this -- papers are only ever cited for one thing and one thing only e.g. \"Atarut 2020 found x\" and not \"Atarut 2020 found x and explored y, looked a little at z, and had deep thoughts about a, b, c\". \n\nIn short, people only remember x, and none of the other stuff. So if y and z are important, give them their own space.",
          "author": "GrumpySimon",
          "created": 1615941543,
          "upvotes": 65,
          "replies": {
            "gr6r67i": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6r67i/",
              "text": "I guess it also means you can pick the right place to publish each part. I published a paper that crossed 2 main fields. Which means there's no single journal that fit both topics particularly well and made it hard to publish (I had 3 desk rejections). This means that there's lots of people who could be interested in one part of my paper but never read it because it looks too much like it's about the other topic.",
              "author": "Miroch52",
              "created": 1615942254,
              "upvotes": 21,
              "replies": {}
            },
            "gr8a158": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8a158/",
              "text": "Although I guess it's a delicate balance! In astrophysics we call this \"salami slicing\" and it's not a respectable thing to do. People see it as manipulation if you purposely split up a study over multiple short papers, even if those papers can stand on their own. The view is that you're trying to artificially inflate your publication list when it'd actually makes sense to have all of it combined into one paper. Sliced papers often read like the authors were trying to pad it out to the required length precisely because their exploration of y was short and they only looked \"a little\" at z.",
              "author": "officially_anxious",
              "created": 1615983824,
              "upvotes": 4,
              "replies": {
                "grau0c9": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/grau0c9/",
                  "text": "Interesting. It’s definitely field-specific—I’d never heard of “salami-slicing,” maybe because the default mode in Asian history for a long time was to cram in *everything* until the paper was a dense, unreadable mess. Footnotes were like mini-articles in themselves, rushing to cover a whole topic in one cramped yet still overlong paragraph. The long footnotes are out of style now, but plenty of articles still append thousands of words of tangentially related material for the sake of “coverage.” I think this tendency basically comes from the old Orientalist desire to write the “definitive work” on every topic.\n\nWhile there are salami-slicers in the field (I’m thinking of one scholar who keeps recycling the same paragraph...), the new tendency seems to be to allow the material enough room to breathe, and to publish not the “definitive work,” but another step in an ongoing discourse. Sure, institutional priorities and metrics favor this practice, but it can still be intellectually healthy in the context of the field, at least for now.",
                  "author": "Atarut",
                  "created": 1616027902,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gr6qytc": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6qytc/",
      "text": "Performance = ability x motivation x support \n\nThis is in every management textbook. I don’t know who to credit.\n\nIt’s important to consider your motivation and support (time, resources, teaching load, etc.) but don’t forget ability. I can write all day every day but I’m not going to out publish someone who is also hardworking but more capable. \n\nPeople tend to think that everyone is equally smart but that’s not likely to be true, just like not everyone is equally good in basketball or whatever else you choose.",
      "author": "ThatProfessor3301",
      "created": 1615942147,
      "upvotes": 36,
      "replies": {
        "gr6rvei": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6rvei/",
          "text": "lol\n\na lot of the research is basically monkey work. A basic understanding is necessary but don't think it takes a genius to do most of the research done in the field. The most dedicated people succeed in academia not the most intelligent.",
          "author": "MIA_AIM1",
          "created": 1615942625,
          "upvotes": 1,
          "replies": {
            "gr6w34i": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6w34i/",
              "text": "It helps to be both. Those who both outhink, outwrite, and outwork their competitors...do more. But you need all of them.",
              "author": "Chemastery",
              "created": 1615944872,
              "upvotes": 12,
              "replies": {
                "gr7yhj1": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7yhj1/",
                  "text": "You don't need to outthink or outwork your competitors. You need to outwrite them and/or get your writing published in the right places. Job hiring committees and grant reviewer panels are not going to have any way to determine who outthought who. They will look at basic easily accessible publication stats without considering the quality of the publications.",
                  "author": "CaptainCornerCamper",
                  "created": 1615973845,
                  "upvotes": 1,
                  "replies": {
                    "gr8z71b": {
                      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8z71b/",
                      "text": "The easily available (dumb) stats will get you the interviews and shortlists, but the smarts will get you the job offers. Generally, a person who is smart in many ways (including socially and intellectually) will outperform others who lack those things.\n\nCaveat: outliers exist, sometimes it's more about whether you're just smart in exactly the way they're looking for (rather than smarter in all other ways). It's a messy business.",
                      "author": "pb-pretzels",
                      "created": 1615996733,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gr6mvl0": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6mvl0/",
      "text": "Nobody has commented yet so I'm assuming \"Don't spend a lot of time on reddit\" might be one of the tips. Now get back to writing all of you.",
      "author": "encom-mcp",
      "created": 1615939994,
      "upvotes": 260,
      "replies": {
        "gr6omzq": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6omzq/",
          "text": "[Guess I'll fail](https://i.kym-cdn.com/photos/images/original/001/231/999/ba5.jpg)",
          "author": "Miroch52",
          "created": 1615940926,
          "upvotes": 63,
          "replies": {}
        },
        "gr6nbru": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6nbru/",
          "text": "Thank you!",
          "author": null,
          "created": 1615940232,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gr6rx3t": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6rx3t/",
      "text": "I dialed way back in recent years but my approach used to be to treat it like a job with set hours. I would write MWF from 8-noon. I worked in a space where I did not have access to the Internet to avoid the temptation to browse and kept my phone in my backpack across the room. I would outline what I was going to write and gathered printed copies of any research I needed the night before and only used that four hour block to write. It was easy to write when you had absolutely nothing else you could do for four hours at a time.",
      "author": "csudebate",
      "created": 1615942650,
      "upvotes": 30,
      "replies": {}
    },
    "gr6w3zn": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6w3zn/",
      "text": "My old PI was prolific. Her secret was:\n\n-have a lot of graduate students (5-8)\n-be mostly absent so you aren't bothered by interruptions. \n-write a book and fly around speaking, gaining collaborators.\n-introduce the graduate students and collaborators, think of a study. \n-don't spend any time doing research, have grad students do it all and train each other.\n-have your grad students run the study, analyze the data, write the first draft of everything.\n-don't waste time with datasets, organizing them or analyzing. Don't waste time on research assistants.\n-have grad students co-apply to grants, where they write the first draft and you edit, to keep the funding flowing.",
      "author": "fiftycamelsworth",
      "created": 1615944885,
      "upvotes": 69,
      "replies": {
        "gr772qf": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr772qf/",
          "text": "[deleted]",
          "author": null,
          "created": 1615950930,
          "upvotes": 19,
          "replies": {
            "gr7kpj8": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7kpj8/",
              "text": "Haha I think so? I'm not sure it's abnormal... It's just one method that I've seen to be prolific.\n\nThe problem is that it isn't good in a lot of ways. It leads to shoddy research with no quality control. \n\nI think this system could have been very effective with a filing system, a lab manager, and someone who was paid mainly to do analyses.",
              "author": "fiftycamelsworth",
              "created": 1615960367,
              "upvotes": 17,
              "replies": {}
            },
            "gr7ox8a": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7ox8a/",
              "text": "That's the \"hands-off\" approach to being a PI. This may sometimes lead to a prolific track record, but it probably wouldn't work for people who are in it because they care for the actual research.\n\nTherefore, there's also the \"hands-on\" approach.",
              "author": "ColourlessGreenIdeas",
              "created": 1615964066,
              "upvotes": 11,
              "replies": {
                "gr7vnr4": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7vnr4/",
                  "text": ">but it probably wouldn't work for people who are in it because they care for the actual research.\n\nTrue. Shame caring for the actual research typically only diminishes ones chances of getting to the position of PI. While the people who care for the actual research are caring for their actual research, the people they will be competing with for faculty positions are caring for their reputations, friends networks, and publication stats.",
                  "author": "CaptainCornerCamper",
                  "created": 1615970812,
                  "upvotes": 2,
                  "replies": {
                    "gr7wmir": {
                      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7wmir/",
                      "text": "Well, you can be \"hands-on\" and still play the game a little bit. For a hands-on person, the challenge is to strike a good balance.",
                      "author": "ColourlessGreenIdeas",
                      "created": 1615971838,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gr6y8zc": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6y8zc/",
          "text": "This sounds like something you can do as an established researchers, but have you looked at what they did in the first 5 years after their PhD? Was she prolific early on, or did that start more after she got her first funding?",
          "author": "Miroch52",
          "created": 1615946027,
          "upvotes": 20,
          "replies": {
            "gr7kjoq": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7kjoq/",
              "text": "That's true. I'm not actually sure, as I met her in her 25th year of a tenure track job.",
              "author": "fiftycamelsworth",
              "created": 1615960229,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "gr71rtz": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr71rtz/",
      "text": "Can we also get answers coming from the Humanities please?",
      "author": "PM_MOI_TA_PHILO",
      "created": 1615947914,
      "upvotes": 20,
      "replies": {
        "gr72ngd": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr72ngd/",
          "text": "Wake up at 6 am to get email in before people can email you back and then don’t write back until the next morning. Collaborate. Stretch research into different kinds of publications. Don’t be afraid of more popular venues because then people will ask you to do stuff. Teach as little as possible. Don’t hem and haw — if your research is solid, publish. You can revise ideas in another publication later. Be a good editor of your own stuff so that you can move it fast and not get caught up in how you could have written it. Talk about your research in various formats so that you grow your confidence. Be friendly to people so they want to work with/help you publish. Don’t get caught up in department/institutional drama. Stretch research funding as far as you can take it. Have a supportive spouse/family. Take weekends to chill!",
          "author": "lidibid",
          "created": 1615948397,
          "upvotes": 23,
          "replies": {
            "gr7q79d": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7q79d/",
              "text": "> Wake up at 6 am to get email in before people can email you back and then don’t write back until the next morning\n\nGetting up at 6am aside, this is fantastic advice. Just check your email once per day. Set out a block of time so you don't get sucked into spending hours on it, then just close the window/tab/desktop mail client.\n\nAnd never have work email on your phone, and *especially* never have  email notifications.",
              "author": "ProbabilisticWorld",
              "created": 1615965253,
              "upvotes": 10,
              "replies": {
                "gr7xlpk": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7xlpk/",
                  "text": "Yes to all this! You can be the person who is reliable w email but doesn’t email back within minutes. People will still want to work with you and find you courteous, but you won’t get sucked in to conversations or as much service as someone who always replies immediately. Students also treat email like texting and not always writing back helps with this. When working with your collaborators on publication, use the old fashioned telephone or write together on zoom/Google docs anyway.\n\nAs for the 6 am: it helps with the guilt! Get right to work emailing, then write from 7-10 and you’ll feel more accomplished for the rest of the day. It’s okay then if the afternoons get eaten by admin or teaching (or nap) and you take the weekend to recharge!",
                  "author": "lidibid",
                  "created": 1615972895,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "gr78sem": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr78sem/",
              "text": "Nice input, that's good to know for me as a grad student :)\n\nI don't get the point of emailing people at 6am though. Does it matter if I'm just reachable anytime by email instead?\n\n>Take weekends to chill!\n\nThis is hard. I'm constantly feeling guilty if I don't spend a minute at the library.",
              "author": "PM_MOI_TA_PHILO",
              "created": 1615951951,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gr6s3bq": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6s3bq/",
      "text": "[I'll just leave this here... Something something quality and quantity](https://www.theguardian.com/science/2013/dec/06/peter-higgs-boson-academic-system)",
      "author": "GalacticCreature",
      "created": 1615942739,
      "upvotes": 18,
      "replies": {}
    },
    "gr6pnpa": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6pnpa/",
      "text": "I publish significantly more than my peers (12-14 papers a year compared to a peer average of 4-5/yr). I don’t think there’s really any one secret, though. Here are a few things I try to keep in mind: \n\n1. Pick projects that are important enough that even middling results yield papers. \n\n2. Know when to wrap up a project into a paper (I.e. don’t do too many experiments). Once each of the important figures are in place, start writing immediately and finish writing in 3-4 days. \n\n3. Say “no” to extraneous, non-productive tasks within the university. \n\n4. Work HARD for the 9 hours you’re at work (no internet, no coffee breaks, no colleague gossip, short lunch), and try not to think about work the rest of the time (nights and weekends). \n\n5. WRITE. Just write. Stop talking about writing. Stop thinking about writing. Just write. And love it. \n\n6. Don’t vomit words onto paper. Think as you write, so that what you’re writing can be the first of three drafts (the third ready for publication).",
      "author": "Aubenabee",
      "created": 1615941465,
      "upvotes": 121,
      "replies": {
        "gr6zc58": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6zc58/",
          "text": "My apologies if this reply is perceived as being rude. I acknowledge that you are very disciplined and hardworking, but among the papers that you publish, how many times do they get referenced in average (excluding from your own works of course)? Would you say to same extent that you are prioritizing quantity over quality, or rather how do you find the right balance between both?",
          "author": "MorningGlory747",
          "created": 1615946603,
          "upvotes": 25,
          "replies": {
            "gr8j9mr": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8j9mr/",
              "text": "I don't exactly know how to answer this. If it's informative at all, I'm 39, my h-index is 37, and my i10 index is 63. My field isn't huge, so citations numbers aren't gigantic, but we do all right.",
              "author": "Aubenabee",
              "created": 1615989163,
              "upvotes": 7,
              "replies": {}
            },
            "gr71nnn": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr71nnn/",
              "text": "Not who you're asking, but it seems like prolific authors I've found also tended to get more citations per paper than average authors. It doesn't seem to be the case that more publications = lower quality, at least when using citations as a metric.\n\nActually, one of the prolific authors I've found is someone who's a co-author on a lot of my lab's work so I've read a fair amount of her research. I hate her methods, I think there are huge limitations in her designs (a huge bummer since she designed a bunch of the studies I'm analysing data for and writing up). But for some reason, reviewers just don't seem to notice or care. Maybe it's because she's published so much and can cite her own methods being used previously that reviewers are less critical of it. But it doesn't seem to explain why she often gets over 100 citations on her first-author publications. I feel like reputation must have a role to play - people recognise her name and become more likely to cite her work. She's pretty well networked as well, which might also help explain it. \n\nAnother outstanding author I've come across has more publications in Alzheimer's and Dementia than any other journal - A&D has an impact factor of 17. In 2020 she had 7 publications in that journal alone and she was lead author on 4 of them. Either reviewers are biased towards her, or she has a serious knack for research design and writing. Not familiar enough with the field to assess that myself.",
              "author": "Miroch52",
              "created": 1615947850,
              "upvotes": 15,
              "replies": {}
            },
            "gr71uo3": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr71uo3/",
              "text": "I'm in a similar boat as above poster (10+ papers a year the past few years).\n\nAlthough some of these don't get a ton of citations, most get several, and some get a lot. E.g., I've got 8 since 2017 with 100+ cites, another 6 with 50+ cites, and a bunch more with 10+ cites.\n\nWhile the quantity vs quality argument is valid in some contexts, it _is_ possible to have a large number of high quality papers.\n\nMuch of this is right place/right time though. My group is relatively well known because we were the first to stumble into our problem domain, which has since become white hot.",
              "author": "worst",
              "created": 1615947959,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "gr7bggj": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7bggj/",
          "text": "[deleted]",
          "author": null,
          "created": 1615953606,
          "upvotes": 27,
          "replies": {
            "gr8imq7": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8imq7/",
              "text": "In my field, it's not the writing that takes a long time. It's the data collection and analysis (which can take anywhere from a few months to several years).",
              "author": "Aubenabee",
              "created": 1615988838,
              "upvotes": 3,
              "replies": {}
            },
            "gr7dpbs": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7dpbs/",
              "text": "I mean, it just means you finish the writing. That’s after the months of data collection and analysis.",
              "author": "Eigengrad",
              "created": 1615955072,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gr7g1k2": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7g1k2/",
          "text": "How do you sustain focus for 9 hours? Even Cal Newport only does deep work for 2-4 hours at a time I think. But maybe you’re counting teaching and email in there too?",
          "author": "QueenAsphyxiaXIX",
          "created": 1615956688,
          "upvotes": 15,
          "replies": {
            "gr8ik80": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8ik80/",
              "text": "It's not like I spend 9 hours just writing. I just spend >95% of my work day doing things that are productive towards my research goals. I probably spend 3-4 hours of my day writing and the rest advising, analyzing data, planning experiments, teaching, etc. I just don't get coffee, browse the internet for more than 5 minutes at a time, etc. I also say \"no\" to 19/20 service tasks that the administration asks for.",
              "author": "Aubenabee",
              "created": 1615988802,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "gr6xchp": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6xchp/",
          "text": "What field are you in?",
          "author": "TheScienceMothra",
          "created": 1615945543,
          "upvotes": 10,
          "replies": {
            "gr8jcv0": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8jcv0/",
              "text": "Molecular imaging.",
              "author": "Aubenabee",
              "created": 1615989210,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gr6xsn4": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6xsn4/",
          "text": "So I'm a bit of an outsider because I work in industry and really just lurk here, but that just sounds like... Work. What is everybody doing in a normal work day where they're not doing what you described??",
          "author": "pm_me_your_minerals",
          "created": 1615945785,
          "upvotes": 18,
          "replies": {
            "gr6y2i1": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6y2i1/",
              "text": "Emails.",
              "author": "empty_yellow_hat",
              "created": 1615945930,
              "upvotes": 39,
              "replies": {
                "gr6yh3i": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6yh3i/",
                  "text": "Emails and meetings. And teaching.",
                  "author": "Miroch52",
                  "created": 1615946147,
                  "upvotes": 44,
                  "replies": {}
                }
              }
            },
            "gr7koia": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7koia/",
              "text": "Teaching. \nEmails.\nMeetings. \nCommittees. \nOffice hours.\nGrading. \nPrepping LMS for next semester / updating content.",
              "author": "Sormaus",
              "created": 1615960342,
              "upvotes": 19,
              "replies": {}
            },
            "gr83z3h": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr83z3h/",
              "text": "A lot of academics do research outside of 9-5 hours, as they have so many other commitments.",
              "author": "ginisninja",
              "created": 1615979214,
              "upvotes": 6,
              "replies": {}
            },
            "gr8jcbq": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8jcbq/",
              "text": "Lol. People - in industry and academia - are really good at doing things that FEEL like working but aren't actually working.",
              "author": "Aubenabee",
              "created": 1615989202,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gr7ax79": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7ax79/",
      "text": "The most prolific person I know fits your description. He mines the same area for multiple publications. But he also has a spouse who does all the childcare and housework, he works most evenings, and has no hobbies and very little social life.  Not exactly a balanced lifestyle.",
      "author": "Readerokie",
      "created": 1615953266,
      "upvotes": 12,
      "replies": {}
    },
    "gr6qfxx": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6qfxx/",
      "text": "A few anecdotal observations as a PhD student - a lot of people who publish prolifically appear to do so because they are successful at grant writing - grant money means research assistants, research assistants means a lot of the groundwork gets done for you. \n\nAlso, a lot of prolific writers I’ve worked with have a big network. They collaborate a lot but also get exposed to a lot of ideas that appears to spark inspiration or debate. \n\nLastly, some scholars seem to lack basic organizational skills and that can create a gap in output between scholars. Research is amenable to project management, just like other work tasks. Keeping track of a lot of moving pieces (ideas, funding, new research, data, etc.) seems to help save time and improve efficiency.",
      "author": "onejiveassturkey",
      "created": 1615941872,
      "upvotes": 33,
      "replies": {}
    },
    "gr79thq": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr79thq/",
      "text": "**THE BEST ARTICLE:** See \"Thousands of scientists publish a paper every five days\" in Nature: [https://www.nature.com/articles/d41586-018-06185-8](https://www.nature.com/articles/d41586-018-06185-8)\n\nAnd – most interesting! – **81 raw-text responses** from the most prolific authors explaining how they did it (PDF): [https://www.nature.com/magazine-assets/d41586-018-06185-8/16110186](https://www.nature.com/magazine-assets/d41586-018-06185-8/16110186)\n\n\"Common themes were:\n\n* hard work;\n* love of research;\n* mentorship of very many young researchers;\n* leadership of a research team, or even of many teams;\n* extensive collaboration;\n* working on multiple research areas or in core services;\n* availability of suitable extensive resources and data;\n* culmination of a large project;\n* personal values such as generosity and sharing;\n* experiences growing up; and\n* sleeping only a few hours per day.\"",
      "author": "fdsnjhk",
      "created": 1615952579,
      "upvotes": 10,
      "replies": {
        "gr8ac79": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8ac79/",
          "text": "[deleted]",
          "author": null,
          "created": 1615984028,
          "upvotes": 7,
          "replies": {
            "gramxgq": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gramxgq/",
              "text": "> (a few decades ago one could have said \"exploiting their labour\")\n\nYou're allowed to say that again. Anti-capitalism is back in vogue.",
              "author": "ExplainsSocialNorms",
              "created": 1616024185,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gr7dclk": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7dclk/",
          "text": "> working on multiple research areas or in core services\n\nRNA seq",
          "author": "Useful_Bread_4496",
          "created": 1615954837,
          "upvotes": 7,
          "replies": {}
        },
        "gr7d2ft": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7d2ft/",
          "text": "Ooohhh I love data!",
          "author": "Miroch52",
          "created": 1615954649,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gr6oqmt": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6oqmt/",
      "text": "Countless writers have some variation of this, but I like David McCullough’s story. He saw an older author at a party who published nearly 100 books. When McCullough asked him how he was so prolific, he replied: “Simple. I write four pages every day.” There really is no trick to it, no shortcut. Just write—consistently! Now, obviously questions of quality quickly emerge, but in the short term, just write.",
      "author": "afairernametisnot",
      "created": 1615940979,
      "upvotes": 44,
      "replies": {
        "gr9027j": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr9027j/",
          "text": "I don't understand this. It isn't like you can just write. There is a ton of work to do before you can write anything besides the intro (which I usually write last anyway).",
          "author": "Ut_Prosim",
          "created": 1615997115,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gr7vuqz": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7vuqz/",
      "text": "In my 4 year PhD (in mathematics/theoretical computer science) I had 15 publications, 7 of which were single author papers, plus another 4 unpublished preprints.\n\nI think my secret was to take really good notes when I was working out some details of papers I read. Several times those notes naturally lead to a short paper that could be published. My record there was a paper that got from earliest notes to accepted manuscript in about a month.\n\nThe other important thing is that the perfect is the enemy of the good. Looking at some of my colleagues who are excellent mathematicians, but often we would be discussing ideas or results that they had never bothered to write up, because they didn't feel it was interesting enough or complete enough of a story to bother publishing.\n\nThe other other important thing is to not put too much crap in a single publication. The goal of an article is to communicatie new ideas and results, but the longer the article is, the less likely people are to read it in its entirety. So longer papers naturally succeed less at communicating the results.\n\nIt also helps that I quite like writing and finding the right way to communicate a new result or convince the reader that what I did is interesting to them.",
      "author": "johnie102",
      "created": 1615971017,
      "upvotes": 9,
      "replies": {}
    },
    "gr85p5v": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr85p5v/",
      "text": "Controversial opinion alert.  I am very frustrated with the publication pressure because the contributions end up being redundant and marginal.  Which makes  sense, it takes an awful lot of time to become an expert in any field, and once researchers discover the magic formula, they will stick to it to produce, often times this implies changing a small parameter or applying the same methodology to endless case studies, or you name it.  This creates an overload in the literature. Who will have time to read all of these mildly different publications?  Further, what is considered 'valuable contributions' is off. A failed experiment would never get published, but would actually provide insight to other peers on what route not to explore.  Overall, I think we really need to rethink the academic reward system linked to publications.",
      "author": "turanga_lilly",
      "created": 1615980656,
      "upvotes": 8,
      "replies": {
        "gr880v9": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr880v9/",
          "text": "Your opinion shouldn’t be controversial. Not sure it is. It’s rather a common view among those of my friends and colleagues I’ve spoken with about the subject.",
          "author": "ShadowyPrecepts",
          "created": 1615982425,
          "upvotes": 3,
          "replies": {}
        },
        "graeomm": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/graeomm/",
          "text": "Saw your post! I've been hearing this complaint since undergrad. At some point the complaints have to stop and the academics who complain need to start doing something different (collectively, not trying to target you). There are initiatives already starting but it will take a long time to  properly change since there are so many people already adapted to the current system.",
          "author": "Miroch52",
          "created": 1616019960,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gr6v2ql": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6v2ql/",
      "text": "My former PI works in a hot field (structural biology) and over the course of his 25 years he has developed an instinct for publishing the least amount of data required to sell a story. As a result, he has tons of unpublished data that is essentially held in reserve. About once or twice a year, another lab will publish something adjacent to his work and he will very quickly locate some old unpublished data of interest, write up a communication or response, and send it out. It helps that many of his students, including myself, have entire thesis chapters sitting unpublished that could suddenly become relevant given new findings. His voracious appetite for literature, combined with his encyclopedic memory for the work of his previous students, puts him in a position where he is current with the field without asking his students to put in the hours implied by the lab bibliography.\n\nHere's the thing: the more current/timely a research topic is, the more likely reviewers will tolerate lower-than-normal quality data. Therefore, the data might be noisy or visually unimpressive because they are old, but if you move fast enough then the quality can be explained away by stating that \"this is urgent and needs to be published ASAP, we don't have time to be perfect\". Additionally, I get the impression that communication journals encourage this kind of responsive research as it is more widely cited than research that is more deliberate, but isolated from the broader scientific discourse.\n\n**TLDR** Sell stories, not data. Save data whenever possible because it might be useful later.",
      "author": "diagana1",
      "created": 1615944329,
      "upvotes": 26,
      "replies": {
        "gr8g1yq": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8g1yq/",
          "text": "I see this \"tell me a story\" advise so often, but how do you approach it? Specially at scientific writing in which structures tend to be very formulaic, just aiming to report methodology, the data collected and the findings.",
          "author": "dollo_7",
          "created": 1615987457,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gr733cm": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr733cm/",
      "text": "- Once you get into the top-tier journal, it’s a lot easier to get in again.\n- I agree with what you said regarding publishing multiple times on a similar topic.\n- Having a big lab or a lot of collaborators is a way to have many coauthorships\n\nAlso it just depends on the discipline tbh.  I know you’re talking about within the same discipline, but even within a peptide chemistry lab, one person’s novel synthesis route could be publishable all on its own, whereas someone’s project requiring biologics studies (e.g. protein interactions) might take years to get things to work/have a publishable product.\n\nI don’t think there’s a way to cheat the system, people can work very hard and be prolific but there’s also quality vs. quantity and having more trainees/collaborators so you are more productive as a unit",
      "author": "Useful_Bread_4496",
      "created": 1615948643,
      "upvotes": 8,
      "replies": {
        "gr81rjb": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr81rjb/",
          "text": "The first point about top tier journals- is that because of skill or because of reputation?",
          "author": "Miroch52",
          "created": 1615977165,
          "upvotes": 1,
          "replies": {
            "gr894il": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr894il/",
              "text": "After the first time, which requires skill, your name has a reputation with the editors",
              "author": "Useful_Bread_4496",
              "created": 1615983207,
              "upvotes": 2,
              "replies": {
                "graed7r": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/graed7r/",
                  "text": "By skill I just meant that through doing it the first time you learn the necessary skills that make it easier next time. But thanks for that :)",
                  "author": "Miroch52",
                  "created": 1616019802,
                  "upvotes": 1,
                  "replies": {
                    "graioxv": {
                      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/graioxv/",
                      "text": "I see haha",
                      "author": "Useful_Bread_4496",
                      "created": 1616021990,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gr7dn80": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7dn80/",
      "text": "In my undergrad school, I had a prof like that (social sciences). And she would make it mandatory for students in her class (about 80 ppl) to take part in her experiments for credit. I took her class 3 times, and in every class she had about 2\\~3 experiments. So every semester, she easily gathered about 80 samples of data for 2\\~3 experiments, which was sufficient for several full papers.",
      "author": "Comfortable_Tiger_13",
      "created": 1615955033,
      "upvotes": 8,
      "replies": {}
    },
    "gr6rirb": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6rirb/",
      "text": "Write about something no one else is writing about. Become the go-to for that weird thing. Network.",
      "author": null,
      "created": 1615942439,
      "upvotes": 17,
      "replies": {}
    },
    "gr86794": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr86794/",
      "text": "Working insane hours, spending far too little time with family. That’s what I did, and it’s what my colleagues who also published a lot did/do. Those who HAD a family and/or spouse. \nI’ve seen several ruined marriages, estranged kids and even suicides among tenured and untenured colleagues - also among those who had brilliant careers (on paper). \n\nSo I quit, and I’m starting another job in a few months. Sayonara. It’s not worth it.",
      "author": "researcher1701",
      "created": 1615981057,
      "upvotes": 5,
      "replies": {}
    },
    "gr7qear": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7qear/",
      "text": "Are the people who hang out on this subreddit mostly graduate students? I don't mean offence, just somewhat puzzled how on multiple threads now the most obvious answer to me is frequently not even mentioned. And the most popular answers have a texbook-like quality to them - like they sound right on paper, but only to a person with no actual first-hand experience. \n\nTo your question OP, most of my peers who have published prolifically have done so largely through **salami-slicing** the hell out of their work. You kind of picked up on it when you mentioned how their papers examine variations on the same-ish research question, often using the same datasets. \n\nI work in an area of applied economics where this is very easy to do. And if you do it smartly, you can still get each paper published in a top-tier journal. However, it does carry a reputation and impact cost. \n\nFirst, each piece of work can seem very incremental and marginal. Had they combined 2 or 3 papers into one solid paper, the punch would have been more impactful and satisfying. While the total citations may be higher from the multiple papers, the reputation of the work has in my experience usually been diminished.\n\nSecond, you could blame it on petty jealousy, but nobody likes a salami-slicer. There are literally some people in my field whose name you cannot mention at a conference without someone calling them out on their tactics. One such colleague was referred to as a 'bottom feeder' by one of the founding fathers and preeminent scholars of my field. Ouch! I genuinely hope it never gets to my colleague.",
      "author": "gmk3",
      "created": 1615965437,
      "upvotes": 10,
      "replies": {}
    },
    "gr6ru4i": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr6ru4i/",
      "text": "My husband knew a professor who had published a huge number of books. His explanation was \"my wife finds a little of me goes a long way so I spend a lot of time at my office.\" I have been known to say that to my husband on occasion. ;)",
      "author": "grayhairedqueenbitch",
      "created": 1615942607,
      "upvotes": 7,
      "replies": {}
    },
    "gr7qjuf": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr7qjuf/",
      "text": "I am in humanities:\n\nI just write it. I don’t make it perfect.\n\nI set myself a time to do it (say a week) and whatever I have by the end of that week is what is submitted.\n\nI use research again and again in different ways so I am familiar with it.\n\nThe more you write the quicker you get at doing it.",
      "author": "reversechinlock",
      "created": 1615965582,
      "upvotes": 3,
      "replies": {}
    },
    "gr8cx3f": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8cx3f/",
      "text": "Within the same field, going from a high-productivity lab/mindset to a low-productivity lab/mindset is excruciating.  I will try to summarize as much as possible.\n\n&#x200B;\n\nEDIT: Obviously I am striking a nerve here with people, but think about that if you're struggling with productivity.  Maybe some of the things you really believe in are not as important as you think and are holding you back.  Worth a thought.\n\n&#x200B;\n\nApparently this question was a trigger for me.  I apologize.\n\n&#x200B;\n\nMindset of low-productivity labs:\n\n* The mindset is completely different.  There is so much questioning.  So much second-guessing.  So much *agonizing*.  So much TALKING.  And TALKING.  Oh, the talking.\n* Meetings.  Meetings.  Good lord.  More talking.  High productivity people do not TALK about doing things.  They just DO them.\n* Here's an example.  Someone had a reviewer comment about gender versus sex.  A single comment.  Came up at **2 separate meetings**.  These meetings had to be a month apart.  Seriously?  This is a 15-minute Google search at worst.  **Figure it out.**  You don't need hand-holding or to talk to people.  Just **get it done**.  For the love of God.  This is what happens when advisors hand-hold too much during a PhD.  People don't know how to just **figure shit out**.\n* \"Let's get a committee of 5 people together to work on this.\"  Why?  So we can **talk** about it more?  Jesus.  No.  **One person**.  One person who **makes decisions** and gets things done.  Stop the \"group work\".  Example: the lead author writes 80% of the paper, writing down questions as they go.  Once that is done, they send all the questions and the draft out at once.\n* Productive people have a \"ask forgiveness\" instead of an \"ask permission\" mindset.  Productive people are comfortable **making decisions** **despite incomplete information**.  Productive people understand that **getting things done** is far more important than getting things perfect.  Do problems come up sometimes?  Sure.  But in the meantime, they've gotten an R01 and just get a slap on the wrist.\n* Set boundaries.  Your writing time should be protected.  You don't let anyone - even the chair - infringe on that.  Because at the end of the year, the chair will judge you for the publications you do and don't have, not how available you were for meetings.  Block it off on your calendar.  A minimum of an hour a day, ideally first thing.  Nothing is more important.  You have to shift your mind from the idea that \"the chair will like me if I'm obedient and do what he asks\" to \"my chair is not thinking about how his requests infringe on my time, and I need to protect it.  The chair will judge me first and foremost on my productivity, not whether I finished the strategic planning x, y, z BS on an arbitrary  due date.\"\n* Think carefully about productivity.  How can you write a single IRB and get multiple studies?  How can you get other people to collect data for you (medical record databases are awesome if relevant to your field).\n* Learn how to delegate.  \"Oh, I don't have time to teach.\"  \"I need to do it myself, they don't know what they're doing.\"  So let me guess: you asked someone to work on it, expected a completed first draft without feedback, then got pissed and fixed it yourself?  No.  Have them come to you.  Look at it together, less than 20 minutes.  Meet again the next week.  Same deal.  You need to learn to leverage your time.  It is 10x faster to write when you have something to start with than to start from scratch.\n* This is maybe less relevant for a first-year, but once you start getting grants: Grad students and post-docs are expensive, distracted by too many things, and transient.  Think about hiring someone with a PhD, maybe someone who is a stay-at-home mom working part-time.  Someone who works from home that does lit reviews for you, makes powerpoints for you, drafts letters for you, starts your reviews for you so you only need to do a quick read through, formats your papers and submits them to journals.  You just need to do finishing touches.  Get time for that person in every grant you write.  Keep that person around for as many years as you can.\n* A lot of people who are less productive talk a lot about \"quality over quantity.\"  I agree with them.  But they're missing the point.  They're not producing much of either.\n* Don't be weird.  I've seen a lot of people who get hung up on authorship.  It costs you nothing to add an author.  Stop being petty and weird.  Weirdo.\n* There is a lot of conversation about teaching, posturing about teaching, but at the end of the day - I don't see a huge difference in the *quality* of teaching.  People have students coming to office hours on a regular basis.  I hate to say this, but: if you have students constantly coming to office hours to clarify lecture, there's a problem with lecture.  You are not breaking down the complicated concepts well.  You are either going too fast, cramming too much into each class period, over complicated things - or something.  Figure it out.  You're going wrong somewhere.  My teaching reviews were consistently among the highest.  Students came to me for help on other peoples' classes.\n* There's this idea that if people just notice how much you are \"doing for everyone,\" it will be appreciated.  Like getting food or plants or decorating common spaces.  Serving on endless committees.  Getting \"important\" positions on committees.  No.  If you're on more than one committee, you're going wrong somewhere.  No matter what a chair tells you, no one cares about the committee work.  No one cares about how you \"worked so hard\" fixing the problem in the department or organizing that cabinet no-one else would or whatever.  People care about the fact that you kept your head down and, at the end of the year, published papers.  Service is not important.  Service is not important.  **Service is not important**.  It is great, maybe fulfilling, wonderful.  But it is not important.  Ever.  Stop taking work time to do service.  It is an extracurricular activity and that is it.  Period.  I do not care what your tenure guidelines say.  No one cares.  (“But I helped draft the schools strategic plan!”  Whoodie-fuckin-do.  The only people who care about the strategic plan are administrators.  Strategic plans don’t change the focus on grants and papers.  How many publications did you get this year?). Trust me, I learned this myself the hard way.\n* Think long-term.  It is not about this publication.  It is about getting a backlog of 10 publications, then 20, until ultimately you become the person in the field.  It is about taking a deep breath, not freaking out over this paper, but instead just publish, publish, publish.\n* I apologize, because I can't write much more now as I actually have to work (be productive!) and this has turned into a treatise.  Hopefully it helps someone.",
      "author": "Depressaccount",
      "created": 1615985653,
      "upvotes": 7,
      "replies": {
        "gr8cxkr": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8cxkr/",
          "text": "More:\n\n&#x200B;\n\n**Here's some teaching tips:**  \n\n* The number one thing that students care about is clear expectations.  They HATE surprises.  They HATE changes.  It is better for you to spread out content and be on-schedule than to try to cram things in and constantly moving things around on your syllabus.  I don't care what your noble intention is in trying to cover all the content. **That's just disorganized, and it will come out on your evals**.  Do less.  It is ok.\n* One of the best things you can do for course evals is simply remind students, multiple times, of what is coming up next week, or the week after, at the beginning of each class.  And make sure that what you cover in lecture is what you test on.  Don't expect students to keep your class at the forefront of their mind all the time.\n* You don't assign an end-of-term paper that you grade all at once.  You don't assign a cumulative assessment that has never been evaluated in any other format.  Do you want junk?  That's how you get junk.  And trust me, whatever you write will not be looked at.\n* For written assignments, if you find the same thing happening again and again, say so, then stop correcting it.  You can just underline it each time it happens again.\n* Have a two-version turn in policy.  What?  Isn't that more grading?  No!  Ironically, this is a lot easier.  Telling students that as long as they put effort in the first time, you will send it back so they can revise for an A not only makes them happier, but they actually learn and read from the comments, and future assignments are much better.  This is especially great for labs.  Plus, trust me, it is MUCH harder to grade a C paper than an A paper!  Tell them what's wrong, send it right back.  I like to do this electronically, getting it back to them within a day or two,  using a PDF editor on a tablet so I can just write wherever on the paper.\n* You have the students submit and grade things in smaller chunks, using the feedback to make the next section better.  Hey, you even use class time to go from one group to the next, working with them, getting to know them, and grading what they've worked on while other groups meet.  Because face-to-face feedback is the best, most valuable feedback.  If this gives you a panic attack about wasting class time, you are in the mindset of cramming info into students instead of fostering real knowledge and comprehension.\n* Do not expect modern students, many of whom are first generation and working full-time or doing sports or whatever, to find time outside of class to meet with you.  You also don't expect them to find common time outside of class to meet.  If you expect that, you'll get one who writes the intro, one who writes the second section...\n* Minimize written grading.  You can make multiple choice questions into critical thinking questions through case study-type scenarios.\n* Do student presentations, because you're not taking extra time outside of class to grade.  Space them out across the semester.  You don't always have to be the expert in the room.\n* You get your entire class (powerpoint presentations, assignments, assessments, exams) prepped and posted online *before* the semester begins. You do not spend any time during the semester on class prep.  Yes, it is possible.  Just get it done.\n* You do NOT re-prep lectures every year.  Any re-prep you need to do is done after you finish teaching class that week, because that is when changes needed are fresh.  You do not obsess about keeping things cutting-edge for undergrad classes.  If things are cutting edge, you're probably not focusing on breaking down the most important central concepts they need to know.  Stop focusing on minutiae.  \n* You have smaller, more frequent online assessments (think each week) that are automatically graded.  These are posted at the beginning of the semester.\n* You do simple midterm evaluations and make changes based on them. \n* You do NOT obsess over a single comment a single student made in course evals and redo your entire course based on it.  \n* You do not teach different courses year to year.  Have boundaries and reinforce them.\n* Don't come in with a distrustful, adversarial attitude.  I've seen so many conflicts stem from an instructor just not TALKING to students.  If a student needs an extension, get over it.  Life happens.  It isn't personal.  There was a pseudo-famous case where an instructor \"caught\" a whole class \"cheating\".  The truth of the matter was that they used published online materials to prepare.  The teacher had reused the textbook's online materials verbatim, so was pissed when everyone got the same answers.  Did he ask the students?  No.  He just walked in and started yelling.  If you're yelling at students, the problem is not with them.",
          "author": "Depressaccount",
          "created": 1615985661,
          "upvotes": 7,
          "replies": {
            "graduw1": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/graduw1/",
              "text": "Love these tips too! Completely agree with marking an A paper vs a C. Currently in the middle of marking. This particular question is one I can mark in 2 minutes if the student gets 85%+ but it takes up to 10 mins when their answers are way off. \n\nJust a casual tutor at this point and have been teaching the same subjects each year so I hardly do any class prep now - just enough to remind myself of the content which is usually very similar year to year. Hoping to get a research only position after my PhD, but if not, I'll keep these in mind.",
              "author": "Miroch52",
              "created": 1616019550,
              "upvotes": 3,
              "replies": {
                "grau2b2": {
                  "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/grau2b2/",
                  "text": "Good luck!",
                  "author": "Depressaccount",
                  "created": 1616027931,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "grad6a2": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/grad6a2/",
          "text": "Tbh, I love seeing this. My supervisor LOOOOVES meetings. She's 3 weeks late on getting her grant submitted for internal review, along with multiple papers waiting for her approval before submission, but has plenty of time for meetings. I've never been in a highly productive lab to compare it to, and it's still frustrating. \n\nThanks for sharing your thoughts (even if some people got grumpy, haha). Looking through your next set now.",
          "author": "Miroch52",
          "created": 1616019216,
          "upvotes": 3,
          "replies": {
            "grau00y": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/grau00y/",
              "text": "Lol thanks :)",
              "author": "Depressaccount",
              "created": 1616027898,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gr8e6l3": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8e6l3/",
      "text": "I have a prof in my department that hasn't really ever done their own research. They have been very successful in finding research teams to join, have their name on articles and maybe do some writing. In the 13 years I have known them, I have never seen them analyze data. They're also not strong in theory, so all they do, really, is leech of research teams or their students.",
      "author": "frankie_prince164",
      "created": 1615986404,
      "upvotes": 2,
      "replies": {
        "graeyhk": {
          "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/graeyhk/",
          "text": "I think this is very common. At least my supervisor seems to be the same. But in terms of authoring her own papers (first author), she is not productive at all. Maybe 1 paper a year on that metric. Which is why I focused on first-author publications when comparing research outputs.",
          "author": "Miroch52",
          "created": 1616020096,
          "upvotes": 1,
          "replies": {
            "grahaof": {
              "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/grahaof/",
              "text": "I think what I meant to say is, some authors are very prolific because of their colleagues. The people I know with tons of papers, contribute very little to each one and are mainly just listed on grants. \n\nThe prof I was referring to in my previous comment has never done their own analyzes, even in grad school. They joined a research group early on and latched on (it helped that this person was older when they did a PhD, so seemed more competent than a young PhD student). Even their students have said they were useless.\n\nMeasuring someone based on their publications is really weird to me. I think academia should focus on quality over quantity 🤷‍♂️",
              "author": "frankie_prince164",
              "created": 1616021275,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "grgpkba": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/grgpkba/",
      "text": "I think you describe it in you post.\nMost prolific authors are able to expand their skills/work to other fields. Either by expanding a method to other fields/analysis. \nEither by working very hard, having good social skills/diplomatic, looking a bit more beyond their own topic or being lucky they are able to work on more projects fast.\n\nAnother skill I believe is to know when to cut your losses and move forward with another project is something doesn't work.\nBy working in a large variety of fields they are then also able to see new opportunities.\n\nOf course everything is multivariable and things like mentorship and funding also help.",
      "author": "preeepa",
      "created": 1616147228,
      "upvotes": 2,
      "replies": {}
    },
    "gr8br91": {
      "link": "/r/AskAcademia/comments/m6m5ne/academics_who_publish_more_than_your_peers_what/gr8br91/",
      "text": "Few but ripe was Gauss’s motto.",
      "author": "geometer2015",
      "created": 1615984935,
      "upvotes": 1,
      "replies": {}
    }
  }
}