{
  "sid": "qq13vp",
  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/",
  "title:": "I don't want any supervisors, wanna be independent",
  "text": "I hate being forced to have a supervisor who I have to obey. I want to be independent. I am a master's degree student. Still couldn't find a dissertation topic. My supervisor doesn't help, she just doesn't care, acts like someone who is nothing to do with academics. Like she does not know anything about any subject. \n\nNow its been months, I didn't contact her. Now I'm afraid she will be angry. I'm having nightmares about her. I hate being forced to have a \"master\" who I have to obey, I hate hierarchy. \nI wish there was a \"robot supervisor\" option, an AI which guides students, it would be amazing.\n\n\nedit:  Thank you for everyone who replied here, you are so kind and helpful. I post this topic without thinking and looking back twice, now I see I look like stupid here. I couldn't express myself correctly.  I am not competent for \"independent research\" I agree. All I was trying to  say was that \"I don't want human factor, I wish there was computer artificial intelligent supervisors which will HELP ME, I wouldn't have to worry about communicating, I don't feel submissive and the hierarchy\"  I said this because, I am having trouble about communicating my supervisor. I am anxious and afraid of her, it is all completely my fault, I am incompetent and I need help.",
  "author": "Banjo--Kazooie",
  "created": 1636454912,
  "updated": 1636654678,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.27,
  "comments": {
    "hjx95u3": {
      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjx95u3/",
      "text": "You can't complain about not wanting supervisors and complain that you can't find a dissertation topic and your supervisor doesn't help in the same paragraph. It sounds like you're basically working supervisor-free if she doesn't watch over your shoulder, you don't need to contact her all the time for her to get upset, she doesn't tell you what to do. If you want to work independently, just do it? You can update her but honestly it sounds like the problem is more about your mindset and your complaining about a supervisor you chose to do your master's degree with. If you want independence get to work on it and go ahead and show your supervisor you work well without supervision, prove that that works for you.",
      "author": "deserveanupvote",
      "created": 1636456753,
      "upvotes": 49,
      "replies": {
        "hjxa268": {
          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxa268/",
          "text": "Yep I'm with you, deserveanupvote (also, I upvoted you!). If you're still searching for a topic, it just means you need help and not exactly independent as you make yourself out to be. There's independence and then, there's arrogance. Think about it OP.\n\nA supervisor is meant to guide and mentor you. They're meant to challenge you and push the envelope further. They're there to help you realise your potential but it's a two-way relationship. They're not mind-readers so help them help you. If you think you're not getting the support you need from your supervisor, then maybe it's time to look for someone new (but only if you have exhausted all options with your current one).",
          "author": "darshvader23",
          "created": 1636457435,
          "upvotes": 7,
          "replies": {}
        },
        "hjx9qgb": {
          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjx9qgb/",
          "text": "problem is... its complicated. \n\nI found a topic, asked her, she didn't like it. Then she gave me an extreme vague subject. Something like \"analysis of x\" not spesific at all.  I guess she expects me to do my dissertation on this. Then its been months, I waited for summer to end, procrastinated for months. now I'm here and extremely anxious about everything. I'm afraid if I contact her she will scold me \"where have you been!\". I wasted so much time. :'(",
          "author": "Banjo--Kazooie",
          "created": 1636457192,
          "upvotes": -14,
          "replies": {
            "hjxa6pu": {
              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxa6pu/",
              "text": "It doesn't sound like you were very successful managing your own time while independent.  Honestly, I am the same way and it means you need to have more contact with your supervisor, even if all you are doing is giving updates.",
              "author": "The_Infinite_Cool",
              "created": 1636457530,
              "upvotes": 14,
              "replies": {
                "hjxal35": {
                  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxal35/",
                  "text": "If she accepted the topic I wanted to do, I would finish it maybe earlier than expected. However, she rejected it and didn't help me to find a good one. Now I'm extremely anxious to contact her. I had nightmares about her scolding me, I'm not joking.",
                  "author": "Banjo--Kazooie",
                  "created": 1636457817,
                  "upvotes": -9,
                  "replies": {
                    "hjxhapm": {
                      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxhapm/",
                      "text": "Given how badly you've managed the situation up to this point, has it occured to you that your research topic wasn't up to par? You want to work independently but everything you've said so far indicates you aren't at a point yet where you are able to do that. You were given a project with quite a wide latitude, which you say you wanted, but you've done no work on it and you've avoided your supervisor. I don't know how you can even say it's a bad project when you haven't done any work on it. \n\nYou want to be an independent researcher, well the first step is taking ownership of yourself and getting in touch with her. \n\nFWIW no one works truly independently. Even when established academics work on their own without a team their work is still reviewed, peer-reviewed and critiqued in multiple different ways. Most academics collaborate at some point in their career as well.",
                      "author": "ACatGod",
                      "created": 1636462163,
                      "upvotes": 12,
                      "replies": {
                        "hjxi8wb": {
                          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxi8wb/",
                          "text": "Thank you. My problem actually is not exactly about independence. Its much more complicated.  The reason I said I wanna be independent is because I'm afraid of her. I am afraid of all academic staff actually. I respect them too much, this is why I can't say a word to them. \n\nAbout the topic she gave me, what is your suggestions? I mean it is a broad topic that you can do anyting. But shouldn't dissertation topic must be spesific like \"xxx analysis of xxx in xxx\"   If it were like that, I would start or at least try. But this time, I don't know where to start because it is too broad.\n\nbtw: why the downvote guys? I need help I am in trouble.",
                          "author": "Banjo--Kazooie",
                          "created": 1636462705,
                          "upvotes": -5,
                          "replies": {
                            "hjy1s0t": {
                              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjy1s0t/",
                              "text": "Gently, what you're doing is the exact opposite of respect. You're wasting her time and being very disrespectful of the time she's offering to you. Instead of engaging constructively with her you've dismissed the project, refused to talk to her and claim you need to work independently on a better project of your own choosing. There's nothing respectful in that. \n\nYou need to go talk to her and be open to what she has to say. Otherwise I think you can kiss your degree goodbye.",
                              "author": "ACatGod",
                              "created": 1636471991,
                              "upvotes": 5,
                              "replies": {
                                "hjyib9v": {
                                  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjyib9v/",
                                  "text": "how did I waste her time? She spoke to me like 2-3 times online(which I am really grateful for her to try help me), months ago. Since she is my supervisor, I guess she earns money from supervising per student.  I might be the least time consuming student ever existed. She might have been forgotten that I exist. \n\nI've never been disrespectful to anyone in my university. I only posted this post, I may look disrespectful here, I try so hard to express myself but maybe my bad english prevents me to do so.  I don't understand why everyone gets angry to me here. Maybe I posted this to wrong subreddit. Still I am really grateful the ones who tried to help me. Thank you everyone who replied.",
                                  "author": "Banjo--Kazooie",
                                  "created": 1636478638,
                                  "upvotes": -2,
                                  "replies": {
                                    "hjynn6e": {
                                      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjynn6e/",
                                      "text": "Christ on a bike. Good luck, you're gonna need it with that attitude.",
                                      "author": "ACatGod",
                                      "created": 1636480721,
                                      "upvotes": 5,
                                      "replies": {}
                                    },
                                    "hjyo518": {
                                      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjyo518/",
                                      "text": "I think you are taking people's plain criticism as an insult.  I really mean this with no disrespect, but you are not displaying the tenacity and drive to do independent research.\n\nFor example for your first issue:  Your PI doesn't want you to do a specific topic.  You  could have:\n\n1) continued forward with your chosen topic, and tried to display semi-successful results as a way to support your original ideas.\n\n2) browsed the literature to find supporting evidence and broad application for your topic and use that as evidence it would be a worthwhile topic to explore\n\n3) developed an idea and experiment that bridges between what you want to study and what your PI would rather study, so as to have their support. \n\n4) worked closer with your PI to find a topic you both like \n\nYour choice was to do none of the above, play Skyrim and wait until the problem became worse and worse.  Do you see how in all of the options I just listed, it requires you to be independent and hunt for answers? This is why you are not yet capable of doing independent research.",
                                      "author": "The_Infinite_Cool",
                                      "created": 1636480919,
                                      "upvotes": 3,
                                      "replies": {
                                        "hjyyfyw": {
                                          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjyyfyw/",
                                          "text": "Yeah me playing Skyrim is actually sad :D let me tell you worse, I play dota2 too :'( \n\n I don't want independent research anymore, I am not capable. Actually I am quite a dumb person. I couldn't handle even master's degree. Even considering quitting. I don't know why am I like this. I used to be a successful student, what happened to me that I stuck like that.",
                                          "author": "Banjo--Kazooie",
                                          "created": 1636485013,
                                          "upvotes": 1,
                                          "replies": {
                                            "hjyzf9c": {
                                              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjyzf9c/",
                                              "text": "I want to be very clear: I did not say anything like what you are saying.  I did not get down on you like you are getting down on yourself.  \n\nJust because you didn't do well before, doesn't mean you can't learn and do better.  But as I will keep hammering: it comes down to you.  You need to find that spark to keep going in the midst of failure and tbh, it sounds like you need some self love as well.  Your PhD can live and die by your determination, not so much your actual research successes.\n\nEdit: I'm burning time on AC Valhalla these days while I avoid work, a far worse game to waste time on.",
                                              "author": "The_Infinite_Cool",
                                              "created": 1636485401,
                                              "upvotes": 2,
                                              "replies": {
                                                "hjz3z9w": {
                                                  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjz3z9w/",
                                                  "text": "thank you for your help. I know you try to help me. I'm just realizing that I am a total failure :d",
                                                  "author": "Banjo--Kazooie",
                                                  "created": 1636487214,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            },
                                            "hjyzp8u": {
                                              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjyzp8u/",
                                              "text": "Ok you're trolling we get it. You're hilarious. We wish we could be you.",
                                              "author": "ACatGod",
                                              "created": 1636485513,
                                              "upvotes": 2,
                                              "replies": {
                                                "hjz08ua": {
                                                  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjz08ua/",
                                                  "text": "Nah, I don't think it's trolling, I just think they're really lost and had no good mentors to help show them the gap between \"I'm a good student\" and \"I'm a good researcher.\"",
                                                  "author": "The_Infinite_Cool",
                                                  "created": 1636485730,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "hjz0yoz": {
                                                      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjz0yoz/",
                                                      "text": "Read all their responses. They're just giving ridiculously over exaggerated takes repeating whoever they're responding to. Their answers make zero sense put together. They're clearly trolling to get a rise out of people trying to advise them.",
                                                      "author": "ACatGod",
                                                      "created": 1636486018,
                                                      "upvotes": 2,
                                                      "replies": {
                                                        "hjz4d3l": {
                                                          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjz4d3l/",
                                                          "text": "no I am not trolling, you may look my profile posts to see I played Skyrim for months. I am just being self-critical, I don't know why are you so hostile towards me, you are just being rude.",
                                                          "author": "Banjo--Kazooie",
                                                          "created": 1636487367,
                                                          "upvotes": 0,
                                                          "replies": {
                                                            "hjz4zyh": {
                                                              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjz4zyh/",
                                                              "text": "You come across as flippant and arrogant. You have been dismissive and rude about everyone's advice, you've contradicted yourself and also been very rude about your supervisor without providing any evidence she's done anything wrong except try to help you. If I think you're a troll it's because you're not taking any responsibility for yourself and expecting everyone here to make you feel good about your bad behaviour and poor decision making. That's pretty troll-like.",
                                                              "author": "ACatGod",
                                                              "created": 1636487620,
                                                              "upvotes": 2,
                                                              "replies": {}
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "hjxjnf1": {
                              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxjnf1/",
                              "text": "I say this with all possible kindness: if interacting with academic staff is this difficult for you, perhaps you should take a leave of absence from the university and work on that? See a therapist for a bit. A Master’s doesn’t have infinite funding and time. If you’re at a point in your life where you cannot work effectively with others, you’ll waste the opportunity.\n\nNone of us can help you find a dissertation topic. But typically, you pick a lab based on your interests aligning with that lab, and everyone has a limit. It hasn’t occurred in my lab yet, but if someone proposed a topic way outside my expertise, my answer would be no or not without a co-adviser. Being told to pick something within the analysis of X range is very much how choosing a topic in your adviser’s expertise goes. If you can’t do that, I strongly advise you to take time off and work on yourself until you can.",
                              "author": "StorageRecess",
                              "created": 1636463489,
                              "upvotes": 8,
                              "replies": {
                                "hjxktdi": {
                                  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxktdi/",
                                  "text": "Thank you so much, you are so kind. I guess you are a professor, it is an honor to get advices from you. Thank you again, now I'm gonna think these advices through. ( sorry for my bad English, not a native speaker)",
                                  "author": "Banjo--Kazooie",
                                  "created": 1636464122,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hjyvkcx": {
              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjyvkcx/",
              "text": "Regardless of your situation: Supervisors reject students' ideas for dissertation topics all the time, for very good reasons. It is arguably one of the most important reasons for having supervisors at all. (For quality assurance reasons, as well as to make sure that the student doesn't start something that can't be completed.)\n\nWhen I say no to a topic, it is usually for one of the following reasons -- which the student can't be expected to understand/know about and just have to take my word for it:\n\n* The project isn't realistic because of its scope. Students often propose ideas that would take 50 years to complete.\n* It isn't scientifically important or significant enough. That the student is interested In a topic and wants to learn more about it doesn't suffice.\n* The student doesn't have the skills/prior knowledge needed.\n* The topic is outside of the discipline.",
              "author": "molobodd",
              "created": 1636483879,
              "upvotes": 3,
              "replies": {
                "hjyx7p2": {
                  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjyx7p2/",
                  "text": "Thank you. Mine was probably the second one :D it was really an easy topic I understand the reasons she rejected it. I hope I find a good one or I'll email her that I ignored everything and I am really sorry. Hope she doesn't get mad and help me.  I should have started months ago :(     I think I am really a dumb person.",
                  "author": "Banjo--Kazooie",
                  "created": 1636484537,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hjx9jp0": {
      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjx9jp0/",
      "text": "Usually people want to work without a supervisor if they have an idea or topic that they very strongly want to pursue but are being prevented from doing so.\n\nYou have no ideas or direction and don't want a supervisor because you don't like the idea of having a boss. It sounds like you just have a bad attitude.",
      "author": "TheProfessorsCat",
      "created": 1636457049,
      "upvotes": 11,
      "replies": {
        "hjxaax1": {
          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxaax1/",
          "text": "[deleted]",
          "author": null,
          "created": 1636457615,
          "upvotes": 1,
          "replies": {
            "hjxglui": {
              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxglui/",
              "text": "It's not that she \"doesn't know\". It's that part of the work that **you** need to do is to understand the state of the art and identify where you can make a contribution. That's as big a skill as actually doing the research.  She's meant to guide you, not do it for you.\n\nTo be honest it sounds like she may have just given up on you because of your lack of engagement but that's pretty much on you at this stage.",
              "author": "Broric",
              "created": 1636461767,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hjxe348": {
      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxe348/",
      "text": "Judging by your question, you absolutely need a supervisor. Despite your personality, viewson life and aspirations, you need a supervisor. You can't even find a research topic yet. You are not prepared to be independent, and won't be for quite a while. On a different note, your current supervisor might not be ideal, or even, might be awful. That's just her, not evryone else.",
      "author": "phenomenologist83",
      "created": 1636460229,
      "upvotes": 10,
      "replies": {
        "hjxipxp": {
          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxipxp/",
          "text": "what should I do now?  \n\nShould I contact her and say \"I didnt do anything, don't know what to do\"  \n\nOr should I try hard to find a good topic? Even though we talked this through with her with no conclusion. She gave me a extreme broad topic like \"design of xx\" Then she gave me no clue. \n\nAnother problem is that I am extremely afraid of academic staff, they deserve to be respected. I respect them too much that I can't speak them without being too respectful submissive. This is  why I wanted to be independent, so I don't need to confront them. \n\nShould I just quit? I done my courses, only the dissertation left. Maybe academics are not for me :(",
          "author": "Banjo--Kazooie",
          "created": 1636462973,
          "upvotes": -1,
          "replies": {
            "hjxj4jk": {
              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxj4jk/",
              "text": "I dont think you should quit, but that's up to you. You should focus on having meaningful conversions where you ask real questions without feeling offended and where you ask for the support you need. You dont need to be afraid of academics and respect does not require being submisive. Take her broad topi as a staring point. Look at what other people have done around the topic. These really are things you should be asking her. You do need supervision.",
              "author": "phenomenologist83",
              "created": 1636463196,
              "upvotes": 4,
              "replies": {
                "hjxjrvs": {
                  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxjrvs/",
                  "text": "yes I do.  Thank you again for your kind answer.\n\nSo I'll try do some research about that broad topic, if nothing comes out, I'm gonna ask her. She probably will be angry that I ignored everything. \n\nAlso I don't know why everyone downvoted me, I wanted to get some help, instead I seem to make you guys angry I don't know why.",
                  "author": "Banjo--Kazooie",
                  "created": 1636463558,
                  "upvotes": 1,
                  "replies": {
                    "hjxka8o": {
                      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxka8o/",
                      "text": "Dont mind about the downvotes. But probably the tone of your question doesnt come across as nice but as problematic. Focus on your research. Seriously. Get it done. Start reading about the topic and understanding it in detail. Look for \"future research\" in the papers you read. Thats how you define the gap. Good luck.",
                      "author": "phenomenologist83",
                      "created": 1636463837,
                      "upvotes": 4,
                      "replies": {
                        "hjxla8f": {
                          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxla8f/",
                          "text": "Thank you again, you've been really helpful. I procrastinated for two months, not joking. Whenever I start to research, I immediately started to play video games ( Skyrim ) to escape the reality. :D  Now I  try hard to focus, thanks.",
                          "author": "Banjo--Kazooie",
                          "created": 1636464374,
                          "upvotes": 1,
                          "replies": {
                            "hjxli06": {
                              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxli06/",
                              "text": "Thats because you are avoiding the mental strain and the frustration. We all do it. Its a copying mechanism. Find a colleague and keep each other accountably. Work every day. 3 to 4 hours minimum (!!!). Read about the topic,watch interesting videos. And think that we all feel frustrated. Just overcome it.",
                              "author": "phenomenologist83",
                              "created": 1636464488,
                              "upvotes": 3,
                              "replies": {
                                "hjxmicm": {
                                  "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxmicm/",
                                  "text": "Thank you again. If you want to spend your time, may I ask you something else? \n\nShould I be worried she will be really angry and disappointed of me. Since I respect her so much, this would devastate me. Would she say things like \" where have you been all this time! I thought you were working on the topic, but you did nothing at all?!\" I saw a nightmare her saying things like that.  \n\nbtw I am not a native speaker or haven't been to an English speaking country. Sorry for my bad english.",
                                  "author": "Banjo--Kazooie",
                                  "created": 1636465010,
                                  "upvotes": 2,
                                  "replies": {
                                    "hjxn7j8": {
                                      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxn7j8/",
                                      "text": "Dont be afraid. You may be open and tell her about how you have been scared and frustrated and you want to do better. Believe me, she does not think about you as a failure and she, much likely, doesnt want you to fail. We want our students to succeed. Just be open, honest and organize yourself. Your English is not bad at all. Dont apologize. Good luck.",
                                      "author": "phenomenologist83",
                                      "created": 1636465370,
                                      "upvotes": 3,
                                      "replies": {
                                        "hjxp6ex": {
                                          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjxp6ex/",
                                          "text": "thank you so much for all your replies. You are really a kind person and your students are lucky :)",
                                          "author": "Banjo--Kazooie",
                                          "created": 1636466353,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk0unmq": {
      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hk0unmq/",
      "text": "Sounds like you aren’t ready for academic freedom given this description",
      "author": "ohnoyoudin",
      "created": 1636513971,
      "upvotes": 3,
      "replies": {
        "hk1o3eu": {
          "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hk1o3eu/",
          "text": "Why you guys here obsessed with the \"freedom\" thing. I couldn't express myself at all. \n\nI said I dont want human factor, I need guide but it would be nice if it was an AI. I need guide. I need help.  The reason I said it was that, I'm having trouble finding topic and communicating my human supervisor. And since I made terrible mistakes ignoring her, I am afraid now she would be mad. If it was a computer AI,  I wouldn't have these problems. Most of you guys here lashing me out telling me how incompetent I am. I know , if I wasn't, I wouldn't beg here for help.",
          "author": "Banjo--Kazooie",
          "created": 1636532815,
          "upvotes": 1,
          "replies": {
            "hk1utca": {
              "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hk1utca/",
              "text": "The mere idea of an AI \"supervisor\" being even plausible is a bit worrisome. It's like thinking you can fire a research professor and substitute them with a bot. I think you might underestimate the complexity of the task, and what supervisors do.\n\nMaybe we don't need human researchers someday in the future, but that is science fiction-level possible.",
              "author": "molobodd",
              "created": 1636538711,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hjx8r2q": {
      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjx8r2q/",
      "text": "*know",
      "author": "Greenstrawberrypower",
      "created": 1636456430,
      "upvotes": 1,
      "replies": {}
    },
    "hjy3epv": {
      "link": "/r/AskAcademia/comments/qq13vp/i_dont_want_any_supervisors_wanna_be_independent/hjy3epv/",
      "text": "Do you have a question you forgot to ask, or are you just ranting?",
      "author": "Belzeturtle",
      "created": 1636472664,
      "upvotes": 1,
      "replies": {}
    }
  }
}