{
  "sid": "qmvidx",
  "link": "/r/AskAcademia/comments/qmvidx/how_soon_is_too_soon_to_keep_in_touch_with_old/",
  "title:": "How soon is too soon to 'keep in touch' with old professors?",
  "text": "Earlier this year, I was lucky enough to go straight from undergraduate to PhD, after congratulating me and such my undergraduate supervisor told me to keep in touch.\n\nDuring the start of my PhD (at a different university), my research partner has advised me that I should be spending a majority of my time networking, at least for the first few months, is it a good idea to use my old professor as a network point?\n\nI had considered emailing him and letting him know about the conference I've been invited too, his line of work is quite similar to what I am currently researching too, but I don't want to seem as though I am harassing him as it was only 6 months ago that we worked together, so it feels too soon to talk with him. Also it just feels rude since I feel like I don't particularly have anything to offer him either.",
  "author": "BlackBrown123",
  "created": 1636062341,
  "updated": 1636136893,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 1.0,
  "comments": {
    "hjc9511": {
      "link": "/r/AskAcademia/comments/qmvidx/how_soon_is_too_soon_to_keep_in_touch_with_old/hjc9511/",
      "text": "Yes, get in touch! Learning to network is partly about learning how to maintain connections over time.  This is great,  low- stakes practice!",
      "author": "Readerokie",
      "created": 1636063834,
      "upvotes": 11,
      "replies": {
        "hjeaksu": {
          "link": "/r/AskAcademia/comments/qmvidx/how_soon_is_too_soon_to_keep_in_touch_with_old/hjeaksu/",
          "text": "Would it be rude of me to ask him to do a readover of a paper I've been writing?\n\nIt's a short one (3,000 words) due for submission within a month and I'd like a second opinion..\n\nI'm new to this whole postgrad stuff so I'm always worried about doing stuff wrong",
          "author": "BlackBrown123",
          "created": 1636106373,
          "upvotes": 1,
          "replies": {
            "hjf780p": {
              "link": "/r/AskAcademia/comments/qmvidx/how_soon_is_too_soon_to_keep_in_touch_with_old/hjf780p/",
              "text": "That depends. Because you're no longer a student there, if you make the email transactional (\"could you help me publish this?\") then chances are lower - you'd be asking him to do what your grad school professors should be doing.  But if you write to catch up, you can mention you're preparing a paper in their area of expertise (if it is), then you can ask if they would look it over for you as you value their opinion.\n\nThat's assuming the following:\n\nIs the paper in his field of expertise? Is it the latest version of a topic you became interested in from working with them or from their classes? If the answer is yes, then sure. \n\nIf not, then it's still fine to write and say thanks for their support, tell them how you're finding grad school, etc.",
              "author": "Readerokie",
              "created": 1636124151,
              "upvotes": 1,
              "replies": {}
            },
            "hjg070k": {
              "link": "/r/AskAcademia/comments/qmvidx/how_soon_is_too_soon_to_keep_in_touch_with_old/hjg070k/",
              "text": "I’d say asking someone not an author to read over your paper would be out of the norm in my area of STEM because it’s actually quite a bit of work to put together useful edits. Also if it’s a peer reviewed publication and just needs minor tweaks you’ll get that as feedback from the reviewers. \n\nHowever, post publication as a “what I’ve been working on” update I’ve sent papers to my undergrad advisor who’s always been really, really supportive. \n\nYou can definitely email him though! Just a quick blurb about what you’ve been working on (maybe if something you did with him was helpful prep), and you can definitely ask him if you’ll see him at the upcoming conference. A lot of profs will be happy to meet their old students for lunch or such",
              "author": "little_grey_mare",
              "created": 1636135384,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjcd2n5": {
      "link": "/r/AskAcademia/comments/qmvidx/how_soon_is_too_soon_to_keep_in_touch_with_old/hjcd2n5/",
      "text": "He told you to keep in touch. Educators love hearing from former students! It’s like our own little non-monetary bonus, especially when you made it to a phd program. It will make him proud. I would not worry about offering anything. It’s understood he is the one with the access and more experience. Contact him to update him on your program and then find something to ask for advice. Professors love that too ;)",
      "author": "Scholarscollective",
      "created": 1636065469,
      "upvotes": 4,
      "replies": {}
    },
    "hjel4me": {
      "link": "/r/AskAcademia/comments/qmvidx/how_soon_is_too_soon_to_keep_in_touch_with_old/hjel4me/",
      "text": "I absolutely LOVE when former mentees reach  out to me. I might be too busy to see you at the conference but if I can, I make an effort to stop by their posters and such and love hearing updates (passed a qual, got married, etc)",
      "author": "Froggy101_Scranton",
      "created": 1636113852,
      "upvotes": 1,
      "replies": {}
    }
  }
}