{
  "sid": "pimxxu",
  "link": "/r/AskAcademia/comments/pimxxu/when_to_apply_for_phd_projects_in_uk/",
  "title:": "When to apply for PhD projects in UK?",
  "text": "Hello! I am only just starting my Master's course in a couple of weeks, but I always like to keep on top of things. I was wondering when I should apply for funded PhD positions during my Master's course. My Master's course runs September 2021-September 2022 so I'm not sure if I can apply to do a PhD in 2022, since I won't likely get my Masters results until after the academic year begins. Will I have to wait until Winter of 2022 to apply to projects?",
  "author": "Goldenracer99",
  "created": 1630881415,
  "updated": 1634079386,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hbqsxpj": {
      "link": "/r/AskAcademia/comments/pimxxu/when_to_apply_for_phd_projects_in_uk/hbqsxpj/",
      "text": "Usually, majority of phds get advertised starting around December, with application deadlines ending January (for following September intake), so I would say start looking towards end of November, then relook once a week (that’s what I did)",
      "author": "Molly-bdenum42",
      "created": 1630883912,
      "upvotes": 3,
      "replies": {
        "hbsc0h5": {
          "link": "/r/AskAcademia/comments/pimxxu/when_to_apply_for_phd_projects_in_uk/hbsc0h5/",
          "text": "My institution has the same deadline, although adverts go up earlier in the fall for us.  Interviews & offers happen through the spring.  \n\nYou don't need to finish your masters before applying, although you'll be more qualified/competitive once you've finished your masters (assuming you do well!).  I'd suggest doing some applications this round, and if you don't get in, apply again later.  Once you're further along or finished you'll have your thesis research, better letters of recommendation, and your grades from your Masters to help you look good.  \n\nOne last note, I'd encourage you to look abroad as well.  PhDs in the UK pay very poorly.  In some countries in Europe, for example, a PhD \"student\" is a paid employee with employment rights/benefits and higher salaries than the UK, and since you're not a student you can start any time in the year.  In the Netherlands, for example, even *after* all your taxes, social insurance, and pension contributions, you're still getting about €2k take-home per month.",
          "author": "polyphonal",
          "created": 1630915886,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hbyhqbp": {
      "link": "/r/AskAcademia/comments/pimxxu/when_to_apply_for_phd_projects_in_uk/hbyhqbp/",
      "text": "You can start contacting potential supervisors now. Once you speak to them they should be able to advise you on deadlines. \n\nA lot of people apply during their MA year so that isn’t a problem (I think they just use predicted grades). I have heard of people saying they’ve had more luck with finding a funded PhD once they’ve actually got their MA grade but it wouldn’t hurt to apply this year regardless. I personally took a year out as my undergrad grade wasn’t very good and wanted to have my MA grades before applying.",
      "author": "Sedapsfognik",
      "created": 1631037285,
      "upvotes": 1,
      "replies": {}
    }
  }
}