{
  "sid": "qcv1ha",
  "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/",
  "title:": "To Professors, PIs, etc - what are some common complaints about your graduate students?",
  "text": "Hello. I am a common lurker on r/Professors to see the complaints or vents professors have about students - however, the vast majority of posts about students there seem to be about undergrads.\n\nWhat would be some common problems or vents you face regarding your grad students (MS, PhD students)?\n\nI am an MS hopeful, from an Asian country very big on etiquette and harmony, so I want to research as much as possible which kind of things professors/PIs find annoying, so as to avoid these pitfalls. (Some of them are not intuitive for me, for cultural and also ASD reasons, so unfortunately I cannot rely on my \"common sense\" reliably here.)\n\nCreating the best possible relationships with future advisors and PIs is extremely important to me.\n\nThank you for your input.",
  "author": "SnakesOnAllThePlanes",
  "created": 1634832048,
  "updated": 1634849149,
  "over_18": false,
  "upvotes": 56,
  "upvote_ratio": 0.92,
  "comments": {
    "hhibf5g": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhibf5g/",
      "text": "The biggest issue I run into with students is perfectionism and (related) keeping to deadlines.  If I say I want a draft by Tuesday I want a draft,  no matter how rough, on Tuesday.  Often I have specific time each week that is free for reading/writing/editing so getting something on Wednesday morning doesn't work for me. I've moved on to something else until next week. What I find is that students want to send something really good (perfect) and will send it late as a (hopefully) better product. It takes years to get students to stop doing that and embrace the draft.  Sometimes I have to send them my own rough and partially completed drafts to show them that I don't mind.  \n\nNote: This is what bothers ME. You should ask your PI how she wants to operate (meeting frequency, draft stages, core working hours, # of papers) and then do that.  Clear expectations are nearly always the key to success.",
      "author": "grounded_out",
      "created": 1634834124,
      "upvotes": 88,
      "replies": {
        "hhiefmf": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiefmf/",
          "text": "I think ultimately this behavior arises because the academic world is so hyper competetive. Other than that, I think a lot of students encounter one or two really bad PIs that sort of ruin students ability to really trust that you would really actually want a draft. The last PI I had before leaving academia would publicly mock you, degrade you, berate you and just outright do everything he could to humiliate if you didn't hand in a draft where everything was perfect. So your mileage may vary with this. The university refused to do anything because he was too valuable. \n\nWhile he was definitely the worst in that respect, it was a common complaint that I heard from many graduate students where they were made to feel like they were wasting the pi's time if they didn't.\n\nI feel like this is a sentiment I see voiced on here fairly frequently",
          "author": "the_supreme_overlord",
          "created": 1634835299,
          "upvotes": 44,
          "replies": {
            "hhif349": {
              "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhif349/",
              "text": "Understood. I suspect that is why it's hard to break the habit (I am mostly dealing with more senior grad students and post docs). It just came up this morning,  and hence was top of mind.  \n\nPerhaps I should have flipped my comment to lead with asking the PI what there expectations are since each lab will operate slightly differently.  What would work great for my students might not work for others!",
              "author": "grounded_out",
              "created": 1634835554,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "hhifmoh": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhifmoh/",
          "text": "This is such a difficult issue, because it's rooted in emotion and self-preservation. One thing that my postdoc PI did that I've found helpful for some students is asking them to annotate their own drafts before they send them. This allows them to highlight any parts they're not yet happy with or point out something they're having difficulty with, or to explain what they're thinking on parts that might not yet be complete. On an emotional level, it functions as a hedge and they don't feel as much like they're being judged as if they're presenting this as a final work. And on a practical level, it provides me more context and direction as I'm reading their work, and it forces them to reread their own writing critically.",
          "author": "LeopoldTheLlama",
          "created": 1634835769,
          "upvotes": 32,
          "replies": {
            "hhigcsd": {
              "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhigcsd/",
              "text": "That is a great suggestion! I leave notes in my own drafts,  but had never thought about how it might be buffering the emotions of having a draft that I'm not proud of.  Nor had I thought to suggest it to students.",
              "author": "grounded_out",
              "created": 1634836049,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "hhif0f2": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhif0f2/",
          "text": "That's interesting! I would prefer to get a very good draft if it's a bit later. I only need tight times if it's very long and I need more than 30 min to read through it, and in that case it'll take me longer than a day or two to read, anyway, so timeliness is also not so crucial. \n\nBut someone missing a scheduled meeting or even rescheduling very soon in advance (within 24 hrs) is killer. I can't reschedule meetings nearly as well as I can flex my reading/editing times and it leaves a dead spot in my calendar since I like back-to-back meetings. \n\nGetting individual expectations is the best advice.",
          "author": "indecisive_maybe",
          "created": 1634835525,
          "upvotes": 12,
          "replies": {}
        },
        "hhiy81a": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiy81a/",
          "text": "One way I've learned to trick myself is to set up a shared project file (e.g. Overleaf or Dropbox folder) well in advance. The file is then shared as-is, without my having to worry about getting it \"show-ready\"",
          "author": "quadroplegic",
          "created": 1634843274,
          "upvotes": 3,
          "replies": {}
        },
        "hhiyk1x": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiyk1x/",
          "text": ">Note: This is what bothers ME. You should ask your PI how she wants to operate (meeting frequency, draft stages, core working hours, # of papers) and then do that.  Clear expectations are nearly always the key to success.\n\nIt's interesting. My supervisor was the exact opposite. I wanted to send a rough draft so he could see the structure of the paper, comment on what more graphs we would need, etc... and he wouldn't look at it until it was \"submission ready\". At which point he'd make me undo a bunch of work that I wouldn't have needed to put in if he'd read a draft.\n\nIt was frustrating.",
          "author": "ThePhysicistIsIn",
          "created": 1634843412,
          "upvotes": 3,
          "replies": {}
        },
        "hhj1kt6": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj1kt6/",
          "text": "I was VERY guilty of this during my PhD",
          "author": "dani_da_girl",
          "created": 1634844648,
          "upvotes": 3,
          "replies": {}
        },
        "hhigm4r": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhigm4r/",
          "text": "Thank you. I will keep in mind that honouring the time commitment is more important than perfection at first draft (it is similar to how development processes work in the companies I've been working at these past ten years, so I am glad it is a shared point of reference!)",
          "author": "SnakesOnAllThePlanes",
          "created": 1634836152,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhiil7b": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiil7b/",
      "text": "I wish they would communicate more when a problem arises. Do they need a software program to finish the project? Are they stuck behind paywalls for accessing articles? Are they being bullied by another faculty member? Are they having issues with visa paperwork, payroll, or their family situation?\n\nThey usually don't approach me/us for help until they are deep into a problem and days or weeks have gone by. Keeping us informed about these issues can help us to clear them up before they become a drag on productivity or student morale.\n\nAlso, related to this: **Please don't be afraid of us**. We took you on as students because we see your potential and want you to succeed. Beneath the title and fancy office furniture, we are still human beings, just like you. Most of us have been through the same issues you now face, and we are here to help you and protect you.",
      "author": "Greenmantle22",
      "created": 1634836935,
      "upvotes": 30,
      "replies": {
        "hhijjnn": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhijjnn/",
          "text": "Thank you! This is definitely, absolutely something I could see myself having trouble with in the future (coming from a very hierarchical culture, and also a culture where it is strongly expected to \"read between the lines\" about supervisors' expectations and never cause a trouble to someone).\n\nThis is something I will make sure to work on for sure before I work with a professor. I am easily intimidated by power differentials.",
          "author": "SnakesOnAllThePlanes",
          "created": 1634837319,
          "upvotes": 4,
          "replies": {}
        },
        "hhj7z8x": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj7z8x/",
          "text": "It's really hard to talk about faculty to other faculty, though. \n\nIf you're tenured at an institution, then you might be stuck with your fellow professors for decades, whereas grad students are much more transient. In my dept, I've felt like grad students are treated as pretty disposable. Faculty won't go against other faculty on our behalf, either because they're pre tenure and can't risk rocking the boat or because they have tenure and have to deal with each other indefinitely. The most I've ever felt comfortable saying to my (generally good and supportive) advisor is that a certain professor and I \"don't get alone\"",
          "author": "parsleybutter",
          "created": 1634847217,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhijhds": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhijhds/",
      "text": "When you meet with your PI, don't just ask \"what should I do next?\" and wait for the answer.  Come in with multiple questions or ideas about how to proceed (it's ok if they turn out to be bad ideas).  Even if you're brand new, your project is still YOUR project, and you need to be willing to contribute to a conversation about it.  \n\nOccasionally, I've gotten the sense that a student thinks it's respectful to act like an empty vessel ready to absorb the PI's ideas, or something.  This is completely wrong.",
      "author": "benjamindallen",
      "created": 1634837293,
      "upvotes": 21,
      "replies": {
        "hhikq9c": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhikq9c/",
          "text": "Thank you! I can definitely imagine myself deferring to my PI because I think my questions are stupid, overly preliminary, (and other things impostor syndrome/lack of confidence convinces me), so I will fight this instinct. As long as looking stupid in front of my PI does not get them to drop me or lose faith in me, hopefully :)",
          "author": "SnakesOnAllThePlanes",
          "created": 1634837797,
          "upvotes": 3,
          "replies": {}
        },
        "hhiv3op": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiv3op/",
          "text": "As a student, I think the line is vague.\n\nIf I really want to do research with a professor/PI, I may want to follow his/her research interests and topics even if they’re not in my top list. Therefore, it’s more likely that I would be accepted.\n\nI mean, I understand research should be interest-driven, but there’s indeed a trade-off between focusing on my main interests and finding a good PI when they’re not consistent.",
          "author": "scp-8989",
          "created": 1634841999,
          "upvotes": 3,
          "replies": {
            "hhiy5tx": {
              "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiy5tx/",
              "text": "I’m definitely not advocating for working on your own projects instead of those your PI wants you to work on. I’m saying you must bring your own ideas and enthusiasm to the project your PI has developed with/for you (or maybe, assigned to you).",
              "author": "benjamindallen",
              "created": 1634843249,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hhj95at": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj95at/",
          "text": "Meanwhile, as with all the replies here it depends. My (first) PI wound not care one iota when I wanted to try something different, he just wanted me to work on what he wanted me to work on. Of course *how I actually executed it* was up to me - with frequent input from him - but the main project idea had to be his.",
          "author": "imposter_syndrome1",
          "created": 1634847674,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhiofvk": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiofvk/",
      "text": "So I'm a postdoc, not a professor, and my only experience with mentorship is with advanced undergrads, writing some sort of thesis. My favorite type of student is one that takes initiative and thinks about things and problems that they come up against; it is the most frustrating when they just wait for instructions all the time and never see next steps. But it's a balance---I don't expect them to come up with all the answers by themselves, otherwise what am I there for?\n\nHowever, I wanted to pitch in my two cents which is that while there may be some common pitfalls (the literature comment was a good one, as is respecting people's time), a lot of people's pet peeves boil down to \"know exactly what your advisor's expectations are\". I've received basically every recommendation here and also its opposite.\n\nOn writing: I've had advisors that flat-out refused to read anything below a full draft, and others that would happily look over a detailed outline. One that wanted the draft a week in advance of the meeting so they could read it and another who would print it and read it in front of me IN our meeting, even if I sent it days in advance.\n\nOn learning: I've had advisors that wanted to give me pointers on how to get through problems, even if they didn't really know but could help me figure it out, and one who literally just told me to google it when they DID know exactly what the issues were. One advisor that encouraged talking through ideas and theory with them, one advisor that told me to just read what all the literature had to say and not bother them (not in those words, but that was the message), one that told me to just \"speak my truth\" and not worry about what other people's thoughts are, including theirs.\n\nOn reading: I mentioned that reading the literature is a good general one, but actually one of my advisors told us that they think reading other people's work is boring and a waste of time. On the other hand I also had a professor that refused to talk to me about a proposal I had until I read a particular book from cover to cover and could answer questions about miniscule details in it.\n\nOn progress: Good general advice to make progress. But this is specific as well. I had an advisor that would get upset if you didn't do MORE than you said you would. \n\nOn outside information: I had advisors that wanted to know what was going on with me and one that thought that I had a crush on them because I mentioned stuff outside of work.\n\nSo... yeah. My advice as a non-professor is to ask your advisors what their expectations are and respond accordingly. If you've got a choice of advisors/schools, it's good to try to get to know them a bit beforehand so you can see if your advising styles mesh well.",
      "author": "FunnyMarzipan",
      "created": 1634839303,
      "upvotes": 18,
      "replies": {
        "hhiq2ue": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiq2ue/",
          "text": "Thank you so much. It does seem there is a huge variance in expectations, which is exactly what was making me anxious. In my country we are always expected to \"read the air\" without being told what are the expectations, and naturally understand expectations explicitly through observation and EQ. As an autist it is impossible for me.\n\nHowever, it seems, in my perception at least, profs/supervisors/PIs in the USA and UK are more open to being asked directly about their expectations? Or did you also have to learn all of the above expectations for each supervisor through \"reading the air\" and trial and error?",
          "author": "SnakesOnAllThePlanes",
          "created": 1634839977,
          "upvotes": 2,
          "replies": {
            "hhiy57f": {
              "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiy57f/",
              "text": "Haha, I actually almost considered including the fact that some advisors are very open to explicit discussions of expectations and some are not. For some of my advisors it was explicit (usually the younger ones), and for some it was trial and error. I haven't had any truly \"Asian style\" advisors with implicit expectations yet. And my mom is from east Asia so I have some experience with those expectations of reading the air! And failing due to mismatched cultural expectations between myself and my Asian family, but not finding out until later because they apparently complained to everyone BUT me. So I feel you. \n\nIn the US, at least in my circles, the idea of \"mentoring compacts\" is gaining some popularity. This is basically a document stating the advisor's expectations for the student, and the student's expectations for the advisor. Now there is some variability in the specificity; my current PI has more broad expectations (\"make progress\" or something along those lines, for example) but I have heard of others being far more detailed, e.g. laying out exactly how much they expect you to contribute to your first, second, and third+ published papers of the PhD. \n\nThere are certainly some professors that are less explicit, or just simply haven't really sat down to consider what their personal advising style is (or that it is, in fact, personal, and not universal). I think one major difference is probably that in the US, they are more likely to tell you that they don't like what you did, as opposed to silently disapproving. I think in general it's safer to be more explicit on YOUR end---you should be able to ask questions or indicate what your plans are, and they'll tell you if that's okay with them.\n\nAgain if you're choosing between advisors, if you can get a good feel for how explicit professors are, you can make that one of the things you consider for compatibility. Maybe you really want to work with someone who is good at being explicit in this way.  One good way to do this is to ask current students; they'll usually have better perspective than the professor themselves unless the professor is SUPER thoughtful.",
              "author": "FunnyMarzipan",
              "created": 1634843241,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhichg0": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhichg0/",
      "text": "1.  That they don't show up to meetings or to their work space when they are supposed to.\n2. That they don't make progress on their project.\n3. That they come up with excuses that are sometimes ridiculous.",
      "author": "Amateur_professor",
      "created": 1634834541,
      "upvotes": 34,
      "replies": {
        "hhigee6": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhigee6/",
          "text": "Oh my. I think I would have an aneurysm before being late/missing a commitment (10+ years in Japanese companies and our strict rules...). \n\nThank you, these are good reference points.",
          "author": "SnakesOnAllThePlanes",
          "created": 1634836067,
          "upvotes": 16,
          "replies": {}
        },
        "hhiug13": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhiug13/",
          "text": ">excuses that are sometimes ridiculous.\n\nCould you mention one or two? I’m curious lol",
          "author": "scp-8989",
          "created": 1634841736,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "hhithkr": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhithkr/",
      "text": "I require only two things from my PhD students, which are both non-negotiable:\n\n1. **Strong verbal English Communication Skills:** My students need to be able to understand English at a high (scientific) level, and articulate their ideas, findings, concerns, etc. easily and clearly . Ideally, these communication skills should extend to writing as well, but that is not a requirement for me.\n2. **A Strong Ethical Compass:** Academia does not police its members like high-school kids. It is easy to pass of others' ideas as your own, to report false results, to over-claim your findings, and to perform other ethically dubious acts. It is up to the academic to do the right thing, and I go out of my way to ensure ethically ambiguous students stay out of academia as much as possible.\n\nIn general, I don't have any complaints about my students, because I do not agree to advise potential students who do not meet the 2 requirements above. I enthusiastically take up any other gaps in my students' knowledge, skills, etc. as my own training task.",
      "author": "entsnack",
      "created": 1634841354,
      "upvotes": 12,
      "replies": {
        "hhivxca": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhivxca/",
          "text": "Thank you for your input. It is reassuring to know that there are many PIs/people in academia who prioritize academic integrity, especially given some of the posts I have seen recently (regarding blatant and widespread doctoring of results, false reporting, faking data, particularly in labs of certain fields and unfortunately of certain national origins).\n\nThis gives me some hope that the spirit of academia still resides in academia.",
          "author": "SnakesOnAllThePlanes",
          "created": 1634842332,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhievuf": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhievuf/",
      "text": "Engage. With. The. Literature. Seriously. READ and UNDERSTAND A LOT. (You should be reading dozens of papers for hundreds of hours over the length of a PhD project)\n\n****BUT****\n\nDon't be paralyzed by the literature.\n\nThere is a balance of this for every group and project. Find out that balance ASAP.",
      "author": "lalochezia1",
      "created": 1634835475,
      "upvotes": 25,
      "replies": {
        "hhigzb7": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhigzb7/",
          "text": "Thank you! I have been maintaining the habit of reading a new research paper from arxiv every week around my discipline over the past four years (and presenting them periodically at journal clubs in my workplace), so it is a bit of a relief to know this habit can transfer right over :)",
          "author": "SnakesOnAllThePlanes",
          "created": 1634836297,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhj32yy": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj32yy/",
      "text": "My number one complaint about some grad students is that some cannot seem to imagine  themselves (see themselves) as my future colleagues.   (note:  i'm in the Humanities.) \n\nThey instead act passively... like undergraduates.  They want to be given assignments.  They expect that, if they complete just the assigned tasks, they are doing well.  \n\nIn short, many grads just don't take responsibility for their own graduate education.  \n\nInstead, they want to be (still in undergrad mode) handed information, rather than dig up information on their own.  (For instance, if I mention an article in a seminar and say \"it's great--check it out\" but don't *assign it*,  many grads will not bother with it.  Then, four months later, they'll hand in an end-of-term paper where that article would have been *perfect*... but it wasn't assigned, so they never looked at it.  grrrr.) \n\nOr, if they have a question about the reading, they (if they're courageous) simply ask about it in seminar... rather than chasing after the answer themselves.   (and I don't mean google it!  I mean, dig into the scholarship to figure it out.  They know how to do that--because I taught them.  But they just don't.)\n\nI love what I do... it's just that I don't have nearly enough time to do it.  If I were a grad student again--without all my current teaching and service requirements and narrow publication deadlines--oh the books I would read...!!!!!      \n\nI guess I just want grad students to love what they are doing.  (just like I loved what I was doing, back in grad school.)  I want them to be insatiably curious.  I want them to disagree with me!  I want them to tell *me*, \"actually, professor, you *really need* to check out this article--it really speaks directly to what you're saying.\"  \n\nThat would make my day.",
      "author": "DerProfessor",
      "created": 1634845262,
      "upvotes": 8,
      "replies": {
        "hhj7vre": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj7vre/",
          "text": "This is very cool!! I wish to have this level of passion about my field someday :) I agree it seems wonderful to experience students like that, who would even challenge you in return. This gives me something to aspire to.",
          "author": "SnakesOnAllThePlanes",
          "created": 1634847178,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhixjse": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhixjse/",
      "text": "This whole post, comments, and all, absolutely terrifies me.",
      "author": "beariel_",
      "created": 1634842996,
      "upvotes": 5,
      "replies": {
        "hhj6mfn": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj6mfn/",
          "text": "Why so?? I feel it is being of great reference to me. Otherwise I would definitely not know all this.",
          "author": "SnakesOnAllThePlanes",
          "created": 1634846678,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhj1u8g": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj1u8g/",
      "text": "My biggest struggles, especially starting out with mentorship for graduate students, is that they *always* overstate their expertise. \"Do you know how to use \\[insert statistical package\\]\" does not mean \"I used it in a class once.\" At this point, I just assume that any graduate student I oversee knows nothing, and they can stop me if they feel like I am overexplaining. The same goes for data analysis and visualization. If you've only had experience taking data from a secondary source and running frequencies/descriptives and throwing those into an Excel bar graph (or, worse, Google Sheets), for the love of all, *just tell me that* instead of telling me that you have \"extensive experience in data visualization and presentation to community members.\" \n\nWhile I've learned this now, not understanding the baseline experience of graduate students was basically nil turned into so much heartache, especially around reporting season and in manuscript preparation. Giving grad students a dataset and telling them to clean it is often *way* over their heads, even if their degree program is directly applicable to data management and analytics. It's astounding. \n\nNowadays, my graduate students get frustrated with how slow training is, but if I ask them to do the task instead of going through a very slow, iterative training process first, it's a complete nightmare for me to try to correct issues and find out that they know nothing beyond basic commands. \n\nAlso, within the last few years, it seems that graduate students have no concept of computer directory file systems or cloud computing and storage management. I keep having graduate students try to assemble documents in Pages or Google Docs when I give them a Microsoft Word template that all they have to do is open it and it creates a new document in exactly the format the funder requires. Then I get these weird questions about why the document isn't formatted correctly, and inevitably, they're opening their browser to use the file. Relatedly, \"open the file from your computer,\" has absolutely no meaning to them. They'll invariably open Google Drive, or Dropbox, or whatever, and open the file in their browser. Basic file management and document types are completely absent for them, and I have no idea when or how that got lost in education. I've had to write very detailed protocols with screenshots. \n\nLast part of the rant: graduate students have *no concept* of basic data compliance. I know they had to take the training for human subjects and our basic IT training for data management, but I feel like they must have just clicked through and gotten the quiz questions right by trial and error. Restricted data *cannot be downloaded on some random library computer*, or when you're on wifi at your local coffee shop. It has to stay on the cloud system, which I personally installed and integrated with your computer, and cannot be accessed unless you do it through the VPN system that the University required you set up on your computer before you could even use the campus wifi. Yes, you have to do this *every single time*.",
      "author": "insanityensues",
      "created": 1634844756,
      "upvotes": 4,
      "replies": {
        "hhj7iok": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj7iok/",
          "text": "Wow, this actually gives me a bit of encouragement - as working as a software engineer for 10 years, I've dealt with data compliance/privacy/security issues, and learned very very quickly that 80% or more of ML is data cleansing/formatting/munging and feature engineering.\n\nMaybe these are things I should even state in my SoP? \n\nIt seems the frustrations you share are extremely similar to what I and my teammates have experienced in hiring new graduate software devs, almost one for one.",
          "author": "SnakesOnAllThePlanes",
          "created": 1634847035,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhj8hbr": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj8hbr/",
      "text": "I wouldn't call it a complaint really, but sometimes PhD students are a bit too confident in the beginning (sometimes possibly an overreaction to imposter syndrome, I guess). It may take a year or two for them to gauge their own level of knowledge and understanding in the big scheme of things.\n\nOne way this manifests itself is that they sometimes think that everything they know is common knowledge in the field. This tells me that they may underestimate how much there is out there to know. It takes a while to come to understand this, and when they do they may become super stressed about it, leading them to \"rabbit hole research\". Ideally, they eventually understand that this isn't a problem. Senior researchers are typically aware of what they know and not, and are at peace with this fact.",
      "author": "molobodd",
      "created": 1634847414,
      "upvotes": 3,
      "replies": {
        "hhj9hoy": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj9hoy/",
          "text": "Interesting point, it sounds like a massive shift of perspective happens as one learns more about one's discipline, and these PhD students seem to be right in the midst of it. This is a perspective I'll try to keep in mind, and something I've had trouble with myself - the belief that all my knowledge is so basic that it is just on the level of \"background fact\". \n\nAny academic discipline is incredibly extensive in scope and in breadth, it seems.",
          "author": "SnakesOnAllThePlanes",
          "created": 1634847811,
          "upvotes": 2,
          "replies": {
            "hhjawhu": {
              "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhjawhu/",
              "text": "I think you could see it as one of two extremes. (1) A beginner PhD-student who is so confident in their own expertise that they resist advice, and (2) one that is too subservient and puts it on the advisor to make all decisions. \n\nSo, too cocky and not cocky (independent) enough are what you want to avoid here. :)",
              "author": "molobodd",
              "created": 1634848373,
              "upvotes": 2,
              "replies": {
                "hhjcmkv": {
                  "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhjcmkv/",
                  "text": "The perfect medium between the two :) got it!",
                  "author": "SnakesOnAllThePlanes",
                  "created": 1634849057,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhirdzu": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhirdzu/",
      "text": "Grade 👏your 👏undergrad 👏students'👏 work👏 on 👏time, 👏Jesus👏 Christ.",
      "author": "macabre_trout",
      "created": 1634840507,
      "upvotes": 6,
      "replies": {}
    },
    "hhj3j1q": {
      "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj3j1q/",
      "text": "Even if it’s awkward, just ask explicitly what expectations are. Also ask the current students how they approach this issue. I have not supervised PhD students but I recently was one, snd figuring out what my advisor expected was way harder for me than it should have been, and made the first two years really bumpy. I was so terrified I would “bother” him with my “stupid” questions or problems that I wasted weeks sometimes banging my head against a table trying to figure stuff out that he could’ve clarified in a fifteen minute conversation, and he would be frustrated with me for not having come to him sooner. \nAlternatively, sometimes I came to him for help too early in figuring out a problem and would be publically berated for not having figured it out on my own.  \nI was one of his first PhD students he had mentored and it kinda showed. I think it took him a few years to figure out his own expectations tbh, and it was a lot smoother by the end after we established a regular time line and framework for checking in. \nIt’s honestly really, really hard because academia is so international (which is one of my favorite things about it!), but this also means we can misunderstand each other very easily if we don’t explicitly communicate expectations. I’m from the US and my advisor was Scottish and even that was enough for us to misunderstand each other sometimes. \n\nMy life saver was a post doc who had been working with my advisor for many years and really understood him. She basically helped me screen my issues and practice presenting them ahead of time so I would be ready when asking him for help. It was a huge kindness on her part, but really necessary in this case, where I couldn’t figure out what the expectations where, despite honestly trying my best. It’s not unusual and if it happens to you, know you aren’t alone. If you can find other more senior students or post docs to help guide you, it’s a big, big help.\n\nEdit to add: remember that they are sometimes learning too. Supervising is not something they’ve usually had formal training on and it’s not something you just naturally know. Try to have grace for each other. Now that I’m in supervisory roles (not PhD students but field crews and other more junior biologists) I have an extra appreciation for how difficult it is to supervise truly well. I’m certain I’ve botched it myself more than once.",
      "author": "dani_da_girl",
      "created": 1634845443,
      "upvotes": 2,
      "replies": {
        "hhj8b79": {
          "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhj8b79/",
          "text": "This is great advice, thanks! In the end I wish to be an asset, not another burden or annoyance to my grad team :) \n\nI also like the philosophy of asking soon, \"failing fast\", so to speak. It is one of the core values of the company I am at. I will try to transfer this same spirit to my future grad environment.",
          "author": "SnakesOnAllThePlanes",
          "created": 1634847348,
          "upvotes": 2,
          "replies": {
            "hhjc2hw": {
              "link": "/r/AskAcademia/comments/qcv1ha/to_professors_pis_etc_what_are_some_common/hhjc2hw/",
              "text": "I think you’re gonna do great! Remember that a lot of the PhD students who will be your peers are going to be straight out of undergrad! Having work experience under your belt already means you will have way more experience and understanding of what is professional than the average student.",
              "author": "dani_da_girl",
              "created": 1634848834,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}