{
  "sid": "oyy37v",
  "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/",
  "title:": "Questions to ask for a new postsoc position?",
  "text": "Hi everyone,\n\nI was shortlisted for a postdoc position, and the PI allowed me to have a chat with some of the lab members before the final panel interview. What kind of questions should I ask them to understand if the lab is a good fit for me? How can I make a good impression?\nThanks in advance 🙂",
  "author": "Chronosandkairos_",
  "created": 1628218701,
  "updated": 1634079995,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.95,
  "comments": {
    "h7wihx5": {
      "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7wihx5/",
      "text": "First and foremost, assure them of your discretion and ensure you stick to it no matter what. Then a few general questions about whether it's a happy place to work, what sort of hours are expected, what management style the PI has, whether the lab is social if that's what you want, what funding is like. At some point once you've connected sufficiently, ask them what the best and worst thing is about this lab. I find this question gives really insightful answers. What you want is to give them the space and confidence to warn you off if needed. In bad labs people will very much want to tip you off. Ensure you're listening.",
      "author": "The-very-naughtyduck",
      "created": 1628227938,
      "upvotes": 14,
      "replies": {}
    },
    "h7w5saw": {
      "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7w5saw/",
      "text": "PI style, typical week/lab environment, brush up on their research, ask them about their specific projects and ask good questions - see if you can contribute to their project. Every project has some roadblock, so it usually helps if you’ve suggestions. But don’t be pushy of course. Manners. Most importantly, be interested. \n\nI sat through a postdoc interview where the guy was dropping F bombs everywhere. Not against swearing but during his formal presentation, in front of the PI who’s really not the type to swear, is just bad form. Also interviewees who say “good location” when asked why they want to join the lab really do not help themselves.",
      "author": "TorchTheSky",
      "created": 1628220284,
      "upvotes": 8,
      "replies": {
        "h7w7huw": {
          "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7w7huw/",
          "text": "Thanks for the advice!",
          "author": "Chronosandkairos_",
          "created": 1628221179,
          "upvotes": 3,
          "replies": {
            "h7wzi93": {
              "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7wzi93/",
              "text": "This is excellent advice (and some candidates are a nightmare). The meet and greet, and actually the whole interview, is also for you to sound them out. Don't view the \"have you any questions\" as another moment where you have to impress them with a brilliant answer, but rather an opportunity to ask them about the things that matter to you. If academic career progression is important, ask them about what their track record is and what they can do to help you, if work-life balance is important ask about it. Obviously don't ask anything too personal or inappropriate but if it's a good match with you they aren't going to see your questions negatively and you can get a sense if this is somewhere that you'd like to work.",
              "author": "ACatGod",
              "created": 1628241818,
              "upvotes": 3,
              "replies": {
                "h7x9wgf": {
                  "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7x9wgf/",
                  "text": "Do you think is appropriate to ask about in what kind of journals are they planning to publish? I would like my postdoc to be a step up for my career, but also I don't want to sound too cocky in my interview",
                  "author": "Chronosandkairos_",
                  "created": 1628250122,
                  "upvotes": 2,
                  "replies": {
                    "h7xd6yr": {
                      "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7xd6yr/",
                      "text": "I wouldn't ask - it's such a problematic area and every paper is different. Anything answer other than \"in peer reviewed journals\" is just ambition and outside their control.\n\nETA you can ask about how they go about deciding when to publish and how they choose where they publish. It's a slightly more neutral way of asking and you may get a sense of the lab values that way too. I did a postdoc in a lab where the PI basically decided all the figures of the paper on paper and where it was going to be published, and then sent everyone off to go do it. It was a very effective publishing strategy but was less great for postdocs looking to establish their own independent research. Depends what you want.",
                      "author": "ACatGod",
                      "created": 1628252217,
                      "upvotes": 6,
                      "replies": {
                        "h7xhelh": {
                          "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7xhelh/",
                          "text": "Great tips, thank you so much!",
                          "author": "Chronosandkairos_",
                          "created": 1628254569,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "h7xa4q9": {
                      "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7xa4q9/",
                      "text": "I would not ask that. You should be able to get a sense of that from their publications. If it’s a new PI, looks at their prior publications to see where you may possibly end up.",
                      "author": "spaceforcepotato",
                      "created": 1628250279,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h7xm6xm": {
          "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7xm6xm/",
          "text": "I’m curious about why “good location” would be such a significant red flag. Of course it shouldn’t be the primary reason for applying to a particular lab, but it is absolutely a factor for a very large number of people.",
          "author": "CootaCoo",
          "created": 1628256959,
          "upvotes": 1,
          "replies": {
            "h8dw0h6": {
              "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h8dw0h6/",
              "text": "It was a red flag because they couldn’t give a reason specific to the lab despite “having thought of it”. They were trying to solve a two body problem and their other half’s career brought them in the area. The message it sent is that they just applied to any lab in the university that they thought they had a shot at but don’t really have a reason for why they chose our specific lab.",
              "author": "TorchTheSky",
              "created": 1628580708,
              "upvotes": 3,
              "replies": {
                "h8ecbf6": {
                  "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h8ecbf6/",
                  "text": "Ah I understand, that’s definitely not a good look for the candidate.",
                  "author": "CootaCoo",
                  "created": 1628594657,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h7wizjz": {
      "link": "/r/AskAcademia/comments/oyy37v/questions_to_ask_for_a_new_postsoc_position/h7wizjz/",
      "text": "Great tips! Thanks",
      "author": "Chronosandkairos_",
      "created": 1628228285,
      "upvotes": 1,
      "replies": {}
    }
  }
}