{
  "sid": "lxk486",
  "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/",
  "title:": "Best practices for promoting your research after journal acceptance?",
  "text": "Longtime r/AskAcademia lurker posting here for the first time! I'm anticipating hearing good news about a submission I recently got a minor-revision decision for. It's a meta-analysis my coauthors and I are really excited about, and we think (hope) it's particularly newsworthy. We plan to promote on social media (maybe even on r/science) and reach out to our universities' media relations folks, but I would really appreciate it if others could share their experiences executing successful marketing campaigns for their research. Would it be feasible to start promoting upon acceptance, or would you advise waiting to announce until the journal posts a typeset version of the paper online ahead of print? For context, I do social science research (hence the tag), and the journal has an anticipated 2020 IF above 4.\n\nEdit 1: Thank you so much for the silver, /u/D3ADSH0T6581!\n\nEdit 2: The paper was officially accepted today! Thank you for the congratulations and invaluable insight, everyone!",
  "author": "Soothsayerslayer",
  "created": 1614863353,
  "updated": 1634081345,
  "over_18": false,
  "upvotes": 135,
  "upvote_ratio": 0.97,
  "comments": {
    "gpnlqun": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnlqun/",
      "text": "Share it on everything, Twitter, FB, LinkedIn, Research Gate, etc. If anyone asks for it I will give them a free copy.",
      "author": "SubcooledBoiling",
      "created": 1614868024,
      "upvotes": 77,
      "replies": {
        "gpnndcv": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnndcv/",
          "text": "Absolutely will be doing everything you mentioned!",
          "author": "Soothsayerslayer",
          "created": 1614868818,
          "upvotes": 13,
          "replies": {
            "gpnuvbh": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnuvbh/",
              "text": "I agree, but maybe check if the journal has an embargo on the article. At least for where I publish (life sciences), that's the day you can start posting about your work everywhere. Before that you may upset the publisher.",
              "author": "uraker9",
              "created": 1614872211,
              "upvotes": 26,
              "replies": {
                "gpnv9l2": {
                  "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnv9l2/",
                  "text": "Good point. I take different publishers' Green OA policies seriously, but it looks like this journal has a pretty lenient postprint-sharing policy—will clarify with the editorial assistant.",
                  "author": "Soothsayerslayer",
                  "created": 1614872384,
                  "upvotes": 10,
                  "replies": {
                    "gpofkam": {
                      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpofkam/",
                      "text": "I think even without OA you are encouraged to advertise. \n\nThe embargo I am referring to is the time in between acceptance and publication. To my understanding publishers (including OA) often like that there is no public discussion of the results after acceptance until the embargo is lifted. I am not entirely sure why but I encountered this every time I get an acceptance. The embargo is usually clearly stated in the acceptance email.\n\nEdit: Usually this time is used to prepare the press release. On the day the embargo ends you can release all your advertisement on all your channels and overwhelm humanity with the news of\nyour results.\n\nEdits 2:\nHere is a link to the embargo policy of Nature Communications (a fairly expensive OA publisher)\nhttps://www.nature.com/nature-research/editorial-policies/press-and-embargo-policies",
                      "author": "uraker9",
                      "created": 1614881132,
                      "upvotes": 14,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gpogwiu": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpogwiu/",
              "text": ">Share it on everything, Twitter, FB, LinkedIn, Research Gate, etc. If anyone asks for it I will give them a free copy.\n\nI would also share on relevant listservs, if that's appropriate to do so. I see 'articles of interest' sent out all the time on several of them.",
              "author": "tardarsource",
              "created": 1614881698,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gpnlk7t": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnlk7t/",
      "text": "Wait until the paper is available online - so you can link to it.   \n\n\n I put mine (and my group's) on Twitter. If it's a high profile paper, the Institute promo people pick it up and do their thing (press release, popular newspaper reports, interview, etc)",
      "author": "Why_So_Slow",
      "created": 1614867934,
      "upvotes": 31,
      "replies": {
        "gpnnoeg": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnnoeg/",
          "text": "By \"available online\" do you mean epub / ahead of print? I actually might be able to upload a postprint to the journal's OSF collection after the paper's accepted—presumably well ahead of any typeset version.",
          "author": "Soothsayerslayer",
          "created": 1614868965,
          "upvotes": 4,
          "replies": {
            "gpo4v2t": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpo4v2t/",
              "text": "Wait until it has a doi. I posted visual abstract on Twitter and linked the doi on the abstract.",
              "author": "Crafty-Glass-3289",
              "created": 1614876552,
              "upvotes": 9,
              "replies": {}
            },
            "gpogj19": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpogj19/",
              "text": "I wait for doi, and pre-print version is ok too (some journal put fast, unformatted versions as soon as they are accepted). I do not link to ArXiV.",
              "author": "Why_So_Slow",
              "created": 1614881541,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gpnny7f": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnny7f/",
      "text": "[deleted]",
      "author": null,
      "created": 1614869094,
      "upvotes": 49,
      "replies": {
        "gpnumdx": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnumdx/",
          "text": "so just like regular academia",
          "author": "hal_leuco",
          "created": 1614872101,
          "upvotes": 24,
          "replies": {
            "gpnwmat": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnwmat/",
              "text": "ThE fUtUrE iS nOw",
              "author": "Soothsayerslayer",
              "created": 1614872976,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "gpnoqua": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnoqua/",
          "text": "I mean... I think academia is pretty broken, so this sentiment is spot on haha",
          "author": "Soothsayerslayer",
          "created": 1614869474,
          "upvotes": 16,
          "replies": {}
        },
        "gpod2an": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpod2an/",
          "text": "That's the world we live in. If you want to be successful (however you define it) in academia, you have to put yourself out there and promote your personal brand and your publications.",
          "author": "NicCage4life",
          "created": 1614880075,
          "upvotes": 8,
          "replies": {
            "gpqidrx": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpqidrx/",
              "text": "Self promotion.  o_0\n\n0_o crippling social anxiety.\n\n\n0_o --> crippling social anxiety",
              "author": "GayDeciever",
              "created": 1614916358,
              "upvotes": 2,
              "replies": {}
            },
            "gpqku3c": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpqku3c/",
              "text": "This is absolutely not true. I have never promoted my work beyond giving talks at conferences, and I’ve done pretty well for myself (full professor before 40, two R01s, etc.). This cynicism isn’t helpful. Good work speaks for itself.",
              "author": "Aubenabee",
              "created": 1614917780,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gpnsnua": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnsnua/",
      "text": "Presenting at conferences. I presented at a conference last year and somebody who saw it invited me to be a plenary speaker at a webinar which is actually tomorrow.",
      "author": "ProfZuhayr",
      "created": 1614871234,
      "upvotes": 17,
      "replies": {
        "gpnt4ly": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnt4ly/",
          "text": "I'm definitely a fan of presenting at conferences. But, in my field, we don't present already-published research at conferences (I've even had to check boxes to affirm that the work isn't being considered for publication). For the most part, we students are encouraged to present our studies at conferences *before/while* preparing them for journal submission (and I did this for the study in question). Congrats on the successful outreach, and have a fantastic time presenting tomorrow!",
          "author": "Soothsayerslayer",
          "created": 1614871440,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gpngaa9": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpngaa9/",
      "text": "I'm pretty shameless about it. I have accounts with Twitter, Google Scholar, Academia.edu, and Researchgate.net. Everything gets posted there. Also, I include my two most recent pubs in my email signature line. And based on analytics, those are really helpful getting traffic up. I talk about my research with my students and colleagues (when it is relevant, obviously). And keep a folder of PDFs on the ready even on my personal laptop just in case. I'm no wonderkid but I've done a good deal of self promo and it has paid off. Recently featured in a high-profile general-interest science mag. The person who \"found\" me, did so via Twitter.",
      "author": "ocherthulu",
      "created": 1614865164,
      "upvotes": 53,
      "replies": {
        "gpnn9fb": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnn9fb/",
          "text": "Thanks for the reply! Including a couple recent pubs in your email signature sounds like a brilliant idea. Do you just include the DOI URL and track engagement on the journal's site, or do you do something fancier (e.g., tracking link)?",
          "author": "Soothsayerslayer",
          "created": 1614868767,
          "upvotes": 9,
          "replies": {
            "gpqlz8e": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpqlz8e/",
              "text": "[deleted]",
              "author": null,
              "created": 1614918461,
              "upvotes": 5,
              "replies": {
                "gprb32h": {
                  "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gprb32h/",
                  "text": "It might vary from field to field and from person to person. I do agree that including papers in your signature is a tad too much. What's next? Sew a doi or url on your bag for everyone to see while walking on the campus or commuting?",
                  "author": "Grash974",
                  "created": 1614938498,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gprw2ej": {
              "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gprw2ej/",
              "text": "I include a full citation (why make it harder for people to cite you?) plus an embedded weblink. Depending on the pub, that goes to a DOI, the journal, or one of the sites listed above if there is a paywall.",
              "author": "ocherthulu",
              "created": 1614953702,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gpnu7sh": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnu7sh/",
      "text": "I would get a copy of the press release from your university and send it to any popular press/blogs who are interested in similar content.",
      "author": "MercuriousPhantasm",
      "created": 1614871921,
      "upvotes": 7,
      "replies": {
        "gpnvhfp": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnvhfp/",
          "text": "Makes sense! Looks like getting a press release done is only the beginning.",
          "author": "Soothsayerslayer",
          "created": 1614872480,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gpnyqg9": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnyqg9/",
      "text": "In my experience, the university’s press release people tend to write the articles that get scraped by EurekaAlert and the other scientific media sites. My co-advisor is pretty active on Twitter as well and that seems surprisingly effective. I would wait until the day of acceptance to publish everything personally, but if you have the media team start writing it right at acceptance then they can have the press release on the day of publication\n\nEdit: also, congratulations!!!",
      "author": "quohr",
      "created": 1614873900,
      "upvotes": 7,
      "replies": {
        "gpqcjc7": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpqcjc7/",
          "text": "Yes, the best exposure my own work has gotten has been through university press release type articles.\n\nI kind of find the while question a bit cringeworthy. The world is full of peacocks and there are feathers everywhere.  If your work is good it will promote itself. I find self promotion in academia rather pukey.",
          "author": "__x0x__",
          "created": 1614913118,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gpoj38n": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpoj38n/",
      "text": "Here's something outside the box.\n\nYou said in another response that you're interested in connecting to the general public. If it's really newsworthy outside of the scientific/academic community you might consider writing a contributed column for the NYTimes or WSJ that looks at a focused aspect of the issue and links to the article. We've done that a couple of times over the years. Yesterday I sent some data to a co-author to write another one. We do animal behavior megafauna research at a major zoo, so it's pretty easy to find something that is of interest to the general public. Both of the newspapers I mentioned run this type of story.",
      "author": "rockyfaceprof",
      "created": 1614882606,
      "upvotes": 7,
      "replies": {}
    },
    "gppb1yn": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gppb1yn/",
      "text": "Just want to share my conflicting opinion; I don't like or trust social media companies, and therefore I don't have any social media accounts except Reddit, Researchgate, Google Scholar (does that count?) and LinkedIn. I refuse to create social media accounts just to share my doctoral research-especially not Facebook or Twitter. I think it's downright sick that we are basically forced to suck Facebook's dick and nobody except for a handful of social scientists are raising the alarm bell (I'm STEM). I am not gonna do it, even if I do get more speaking events/connections/whatever. I am doing just find and am mildly successful so far without posting anything on social media.",
      "author": "notjennyschecter",
      "created": 1614894356,
      "upvotes": 3,
      "replies": {}
    },
    "gppk0u7": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gppk0u7/",
      "text": "Another option (among those mentioned) is writing up a short summary piece about it for The Conversation. It’s an outlet for academics to communicate their results to the general public, and some articles are picked up by major news stations.\n\nI wrote one related to a paper I wrote, and it got 10k+ views and was reprinted in several regional newspapers. Super easy to do too. I think it was ~1000 words and timeline start to finish (emailing the editor with the idea and nothing written to published on their site) was <2 weeks.",
      "author": "ProbablyNotAPuffin",
      "created": 1614898482,
      "upvotes": 4,
      "replies": {}
    },
    "gpnmx99": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnmx99/",
      "text": "Its not a popular opinion but trust me, you don't need to worry about promoting. It will be picked up by the scientific community if you are confident that it is good.",
      "author": "KS_tox",
      "created": 1614868607,
      "upvotes": 11,
      "replies": {
        "gpnooio": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnooio/",
          "text": "Thank you for responding, and I appreciate your viewpoint. I'm confident that others in my field's scientific community (but my field's practitioners? That's another story...) will read it as this particular journal has been surging in popularity. But, I'm also interested in engaging the *general public*, so we're putting in extra effort to promote our study.",
          "author": "Soothsayerslayer",
          "created": 1614869443,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gpo7miv": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpo7miv/",
      "text": "Share on social media. Explain its relevance in said shares. Share a post-print if it’s paywalled to get more eyes in it. Engage with relevant conference hashtags when appropriate. Is their an organization that is relevant to similar work? If so, offer to write a blog post about it in their platform. If there are follow ups to the work and folks who may be engaged in that type of work, send it to them directly or say what your thoughts are for follow ups and whether they’d be interested in collaborating or know who would.",
      "author": "rollem",
      "created": 1614877741,
      "upvotes": 2,
      "replies": {}
    },
    "gppf0ig": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gppf0ig/",
      "text": "Our press office does releases for important works, and at that point they generally get picked up by newspapers if they are public interest. The publicity does not always work out well though. Sometimes public interest does not equate to “something the public is happy to read is true”. I’d also go via LinkedIn over FB if you want to do social media promotion.",
      "author": "wellEulerbedamned",
      "created": 1614896120,
      "upvotes": 2,
      "replies": {}
    },
    "gpqyjzi": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpqyjzi/",
      "text": "As noted, careful about any journal embargo.  The reason for this is if the journal wishes to promote the work, they get first stab at it.  In fact there is a whole blog about breaking of embargos.\n\nhttps://embargowatch.wordpress.com/",
      "author": "Life_time_learner",
      "created": 1614927353,
      "upvotes": 2,
      "replies": {}
    },
    "gpsbub7": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpsbub7/",
      "text": "RemindMe! 7 days",
      "author": "dapt",
      "created": 1614960954,
      "upvotes": 1,
      "replies": {}
    },
    "gpnfvbh": {
      "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnfvbh/",
      "text": "RemindMe! One week",
      "author": "rainbowWar",
      "created": 1614864937,
      "upvotes": -3,
      "replies": {
        "gpnfxn6": {
          "link": "/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnfxn6/",
          "text": "I will be messaging you in 7 days on [**2021-03-11 13:35:37 UTC**](http://www.wolframalpha.com/input/?i=2021-03-11%2013:35:37%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/AskAcademia/comments/lxk486/best_practices_for_promoting_your_research_after/gpnfvbh/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FAskAcademia%2Fcomments%2Flxk486%2Fbest_practices_for_promoting_your_research_after%2Fgpnfvbh%2F%5D%0A%0ARemindMe%21%202021-03-11%2013%3A35%3A37%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20lxk486)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
          "author": "RemindMeBot",
          "created": 1614864973,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}