{
  "sid": "iy15mt",
  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/",
  "title:": "What are some unwritten rules of etiquettes in research/academia that you often see being overlooked?",
  "text": "Recently had a misunderstanding between my PI about publications, authorship, roles in the project were which lead to some conflict. Looking back, I see that we could have avoided those misunderstanding if we had talked about these things before we started the project and made those point crystal clear rather than talking about it in the middle.\n\nAnother etiquette that I learned about although I'm not completely sure. If someone else applies for the grant which is awarded and leaves, its polite to keep them updated about the project or invite them as a co-author on any potential papers or acknowledge them in the paper if they'd prefer that.",
  "author": null,
  "created": 1600825896,
  "updated": 1634080728,
  "over_18": false,
  "upvotes": 190,
  "upvote_ratio": 0.97,
  "comments": {
    "g6a8kvg": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6a8kvg/",
      "text": "Hmmm... less political than your examples, but clean up after yourself and respect the common equipment. If your agarose spills in the microwave, don't leave it for someone else to clean up. Do your dishes.   \nIf you notice that tips or a reagent are running out, be sure to order more or alert whoever handles the ordering. Don't wait until things run out to speak up.   \nCommon sense stuff, but somehow overlooked. :)",
      "author": "CaffeineDeprived",
      "created": 1600831290,
      "upvotes": 151,
      "replies": {
        "g6a9abs": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6a9abs/",
          "text": "As the person who orders things, please tell me BEFORE things run out. Orders can take a week or more, so if you need more reagent for your experiment tomorrow you're out of luck.",
          "author": "bacon_music_love",
          "created": 1600831719,
          "upvotes": 76,
          "replies": {
            "g6aka7x": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aka7x/",
              "text": "This was the most annoying part of being a lab manager lol. People would fail to add reagents to the order sheet when they ran out, and would then act like chickens with their heads cut off when they couldn’t do their experiments!!\n\nI literally have no way of knowing that your precious reagent ran out unless you tell me. This was a constant issue with screentape for our bioanalyzer. I would get panicked texts about it approximately every other week, even though a- not cheap, so I wouldn’t order it unless it was running low, and b- those expire pretty quickly!",
              "author": "imanoctothorpe",
              "created": 1600839782,
              "upvotes": 21,
              "replies": {
                "g6avn1u": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6avn1u/",
                  "text": "I'm having flashbacks of when I ran a bunch of labs. Even if I happened to notice that someone's reagents or consumables were low, I ignored it until the person(s) using it asked me to order some. I told them fine, but it will take a week or perhaps two. In the beginning, they freaked out because they need it TOMORROW AND WHAT SHOULD THEY DO NOW WHY DOES IT TAKE TIME GET A QUOTE AND TO GET APPROVAL FOR A QUOTE AND A PURCHASE ORDER AND I DIDN'T KNOW IT TAKES TIME TO GET HERE!!!??? I told them to beg for what they need from other labs, and next time let me know if you need something before you use the last of it. Not long after, I started receiving requests well in advance of things running out. \n\nYou'd think that adults work in labs.\n\nOrder your consumables before, and not when, they run out. If someone else does it for you, be thankful.",
                  "author": "Affable_Additive",
                  "created": 1600851605,
                  "upvotes": 13,
                  "replies": {
                    "g6b4abm": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b4abm/",
                      "text": "Exactly! Even our shortest experiments end 3 weeks after we order the mice, so I tell everyone to check their reagents and reserve the rooms and equipment needed before I even order the mice. Usually they listen.",
                      "author": "bacon_music_love",
                      "created": 1600861241,
                      "upvotes": 4,
                      "replies": {}
                    },
                    "g6brfqt": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6brfqt/",
                      "text": "By the same token, sometimes things get backordered or go out of stock, and there’s nothing I can do about that!! That’s why it’s always important to figure out well in advance what reagents you need. \n\nSourcing filter tips lately has been a major headache bc of COVID, and no matter how many I ordered they weren’t arriving... and people still refused to use regular (non filter) tips for less sensitive experiments to conserve the filter tips for more important applications. And then complained when the filter tips ran out, as if I can manifest them into existence from thin air lol",
                      "author": "imanoctothorpe",
                      "created": 1600875260,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g6bl2l8": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bl2l8/",
              "text": "Use the kanban system, put a sticky on the third to last box with your email address.",
              "author": "sumguysr",
              "created": 1600872025,
              "upvotes": 5,
              "replies": {
                "g6blqg3": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6blqg3/",
                  "text": "Haha I'm the lab manager, they all know my email and phone number. My desk is in the lab, and the order sheet is right next to me. And that system doesn't work for tiny bottles of antibodies or opaque bottles.\n\nMaybe that would be useful in a large lab or space shared by many people, but we only have 10 people.",
                  "author": "bacon_music_love",
                  "created": 1600872372,
                  "upvotes": 1,
                  "replies": {
                    "g6bpoku": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bpoku/",
                      "text": "The main point is marking the item which should trigger a reorder when it's used.",
                      "author": "sumguysr",
                      "created": 1600874384,
                      "upvotes": 1,
                      "replies": {
                        "g6br9kh": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6br9kh/",
                          "text": "I understand that, and we have that system for some items. But for many items we only have one at a time, and it just needs to be reordered when almost empty.",
                          "author": "bacon_music_love",
                          "created": 1600875173,
                          "upvotes": 2,
                          "replies": {
                            "g6byxoc": {
                              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6byxoc/",
                              "text": "Draw a line on the bottle?",
                              "author": "sumguysr",
                              "created": 1600878941,
                              "upvotes": 2,
                              "replies": {
                                "g6c1ppu": {
                                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6c1ppu/",
                                  "text": "Again, doesn't work on opaque or small bottles. For small items I tell people to check if they have enough for their experiment well ahead of time. if they don't, I order more and it arrives in time for them to use it.",
                                  "author": "bacon_music_love",
                                  "created": 1600880290,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g6ap7et": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ap7et/",
          "text": "A thousand times yes.  Cleaning up after yourself at counters, benches microwaves, refrigerators, cold rooms, break areas, shared equipment, etc tells your colleagues a lot about who you are.  It will also get you a lot more respect and loyalty from support staff.  Also dry the floor when you open a freezer and frost falls on the floor.\n\nDon’t get me started on cold rooms.   Just label your things clearly, sanitize surfaces now and again, cycle your things to prevent mold outbreaks, don’t get greedy for space and don’t be that person who puts styrofoam boxes in the cold room. (Same applies to the break room refrigerator).\n\nAnd if an alarm is going off on someone’s freezer or equipment, give them a heads up, don’t just ignore it!",
          "author": "trewstyuik",
          "created": 1600844343,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "g6ack4j": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ack4j/",
      "text": "Know when a person should refer to a faculty member as Professor or Doctor or first name. This depends on what kind of student you are (undergrad or grad) or whether you know the person personally or not. Of course it’s not a huge deal if you do it wrong, but just pay attention to what tends to be a sign of respect or someone’s preference.",
      "author": "Nanotribes",
      "created": 1600833798,
      "upvotes": 76,
      "replies": {
        "g6arvxb": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6arvxb/",
          "text": "[deleted]",
          "author": null,
          "created": 1600847128,
          "upvotes": 48,
          "replies": {
            "g6b096d": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b096d/",
              "text": "Very much by country. In some it's more formal, to the level that even undergrad students are addressed by Mr./Ms. Lastname, and you go up from there, using proper academic titles, like Master/Doctor/Professor.",
              "author": "Why_So_Slow",
              "created": 1600857178,
              "upvotes": 10,
              "replies": {}
            },
            "g6brxg8": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6brxg8/",
              "text": "This is wild but reinforces my desire to move to Australia when my husband retires from the Coast Guard. You guys need any nursing instructors/addiction researchers from America? Pretty please?!?",
              "author": "aislinnanne",
              "created": 1600875503,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g6aeytd": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aeytd/",
          "text": "And default to the more respectful title particularly if the person Is a woman, because often women are treated more disrespectfully so a little goes a long way.",
          "author": "Sloeeyed",
          "created": 1600835519,
          "upvotes": 87,
          "replies": {
            "g6aqeww": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aqeww/",
              "text": "When do you not use first names in your department?",
              "author": "dampew",
              "created": 1600845559,
              "upvotes": 7,
              "replies": {
                "g6attlm": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6attlm/",
                  "text": "This is very dependent on the culture of your university and/or department.  \n\nI see comments like this every time this is brought up, but I can tell you I have been on faculty at 5 different universities and affiliated with 2 others, and using either Dr. or Prof. Lastname was the default for students, undergrads or new grad students, until you were invited otherwise.  And sometimes that invitation never comes.  \n\nAdditionally, I can say at least 2 different universities where I have this kind of experience, in formal university meetings (IACUC, Faculty Senate, President's Council, Academic Council, other top level shared governance meetings), we have used formal academic titles (eg, Dr. Smith made a motion, we invite VP Brown to give a report, etc.).  In meetings where formal minutes are not kept, eg, department meetings and college level meetings, then everyone is first name.",
                  "author": "manova",
                  "created": 1600849362,
                  "upvotes": 24,
                  "replies": {
                    "g6ba62m": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ba62m/",
                      "text": "Seconding this comment to add that I've mostly experienced this similarly with emails: if I'm \"cold-call\" emailing someone, I use formal title and end with my first name, treating my salutation as an invitation to call me Bangarang instead of Dr Rufio. Then they reply with: \n\nBangarang,\n\n... etc and so forth... \n\nThanks, \n\nFirstName\n\nwhich is a reply in kind invitation to call them by their first name. It can feel political but sets up an atmosphere of respect and limits the chances that you will ever have someone feel that they have been disrespected, even subconciously (I have to admit that I still read an email that begins with Dr Rufio differently than one that begins Bangarang unless I already know the sender.",
                      "author": "BangarangRufio",
                      "created": 1600865713,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                },
                "g6atmdp": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6atmdp/",
                  "text": "always when talking to undergraduates, with PG and externals it will depend on how well I know the person I'm speaking to and/or about",
                  "author": "tc1991",
                  "created": 1600849116,
                  "upvotes": 7,
                  "replies": {
                    "g6au6rf": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6au6rf/",
                      "text": "PG?",
                      "author": "dampew",
                      "created": 1600849810,
                      "upvotes": 6,
                      "replies": {
                        "g6av0sn": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6av0sn/",
                          "text": "Post graduate (Masters and PhD Students)",
                          "author": "tc1991",
                          "created": 1600850830,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g6b0f99": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b0f99/",
              "text": "“Yo toots”",
              "author": "TakeOffYourMask",
              "created": 1600857368,
              "upvotes": 7,
              "replies": {
                "g6b0goq": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b0goq/",
                  "text": "So not like that? ☝🏻",
                  "author": "TakeOffYourMask",
                  "created": 1600857414,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "g6ankjr": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ankjr/",
          "text": "With senior faculty I often start with using the person’s formal title, and revert to first name if they suggest doing so.  It’s just safer that way.  Even if I am in a first name basis personally, I don’t bring that into meetings that are not lab meetings.  In meetings and when speaking about them in the third person, I usually revert to formal titles. It is ingrained from when I worked for clinical faculty in the hospital environment, patients or others could be within earshot and it is overall just more professional.  I think it’s a little more casual with postdoc researchers, who mostly don’t roll with wearing the “Doctor” title everyday in a medical school setting.",
          "author": "trewstyuik",
          "created": 1600842748,
          "upvotes": 15,
          "replies": {}
        },
        "g6ahskz": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ahskz/",
          "text": "In my department it's a running joke to use titles.\n\nFirst names only please. Never call me Professor or Doctor.",
          "author": "atypic",
          "created": 1600837714,
          "upvotes": 11,
          "replies": {
            "g6akcct": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6akcct/",
              "text": "Ok Professor Doc",
              "author": null,
              "created": 1600839832,
              "upvotes": 19,
              "replies": {
                "g6aso0u": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aso0u/",
                  "text": "It's a little awkward :|",
                  "author": "atypic",
                  "created": 1600847997,
                  "upvotes": 2,
                  "replies": {}
                },
                "g6h5opm": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h5opm/",
                  "text": "Ironically... I have a professor who asks us to call him that. No lie. Guy is old, and usually just says to call him Doc... but he is a professor!",
                  "author": "comped",
                  "created": 1600986442,
                  "upvotes": 1,
                  "replies": {
                    "g6h5s8d": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h5s8d/",
                      "text": "You should stand on a chair and say \"oh doctor my doctor \"",
                      "author": null,
                      "created": 1600986496,
                      "upvotes": 1,
                      "replies": {
                        "g6h6ojh": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h6ojh/",
                          "text": "I've not had the chance to take a physical class with him yet - just one online haha. But I suppose if I see him this semester I'll do that!\n\nIt grinds me gears when many of the professors at my college (a top 3 US/world hospitality school) have for-profit doctorates as well, especially the newer ones, but I can't change that.",
                          "author": "comped",
                          "created": 1600987002,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g6a6mzh": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6a6mzh/",
      "text": "Most people take pipette tips in order and some people are monsters who just take from anywhere or break the order I started",
      "author": "3dprintingn00b",
      "created": 1600830077,
      "upvotes": 138,
      "replies": {
        "g6ab171": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ab171/",
          "text": "It’s me, I’m the monster",
          "author": "UNTDuderino",
          "created": 1600832789,
          "upvotes": 43,
          "replies": {
            "g6abgne": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6abgne/",
              "text": "Monsters for life",
              "author": "CheetosInMilk",
              "created": 1600833069,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "g6ac5vb": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ac5vb/",
      "text": "If you didn't intellectually and directly contribute to a research project, your name isn't supposed to be on the paper.",
      "author": "Seankala",
      "created": 1600833532,
      "upvotes": 87,
      "replies": {
        "g6adfq8": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6adfq8/",
          "text": "But I nodded enthusiastically when you presented the paper?",
          "author": "amhotw",
          "created": 1600834405,
          "upvotes": 85,
          "replies": {}
        },
        "g6af4a2": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6af4a2/",
          "text": "I hate this rule. It’s dumb, IMO. If someone technically contributed to a paper, they deserve to be listed on the authorship.",
          "author": "putativeskills",
          "created": 1600835633,
          "upvotes": -17,
          "replies": {
            "g6af6z9": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6af6z9/",
              "text": "I'm confused. Are you expressing disagreement towards what I commented, or are you agreeing?",
              "author": "Seankala",
              "created": 1600835689,
              "upvotes": 27,
              "replies": {
                "g6ah0o1": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ah0o1/",
                  "text": "I read it as a question of technical vs intellectual contribution.",
                  "author": "SeraphTwo",
                  "created": 1600837091,
                  "upvotes": 26,
                  "replies": {
                    "g6ahxci": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ahxci/",
                      "text": "Nah, technical contributions are of course included on the author list.",
                      "author": "atypic",
                      "created": 1600837821,
                      "upvotes": 22,
                      "replies": {
                        "g6chqqx": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6chqqx/",
                          "text": "Merely technical should not be I don't think, but it is not difficult to go beyond the merely technical and that does in fact usually happen. If I gave a sample to a tech who ran an NMR and gave me the results, and that's all he did then he should not get authorship. He didn't contribute any knowledge to that paper. That doesn't mean he isn't a valuable member of the team; keeping those tools running is absolutely critical to the many labs who use those tools. But, it alos doesn't make sense for him to be an author on every paper in the chemsitry department just because he runs most of the NMR samples.  \n\nNow, very often, he helps interpret that NMR spectra. He may give suggestions as to what happen when we get an unexpected result. At that point, authorship makes sense to me. Usually, if someone has any idea what the sample is for and has any idea there is a paper, they've made some intellectual contribution.",
                          "author": "Average650",
                          "created": 1600888106,
                          "upvotes": 2,
                          "replies": {
                            "g6cqg1s": {
                              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6cqg1s/",
                              "text": "Sure, infrastructure is different. This might be specific to my field, computer science, in which a lot of people spend significant chunks of their PhD's programming and/or building some system and/or models.\n\nWe don't tend to acknowledge individuals who administrate or operate tools, but if someone built, say, some new-fangled doothingy-MR-machine only for this particular paper, surely this person would be included.",
                              "author": "atypic",
                              "created": 1600892433,
                              "upvotes": 2,
                              "replies": {
                                "g6crhf5": {
                                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6crhf5/",
                                  "text": "Absolutely. Assuming it wasn't like a kit they put together but something new, then that's absolutely qualifies and this special machine would be a real contribution to the paper. Guess my comment was geared more towards very well established techniques that wouldn't in any way be novel or described more than the tool name and operating parameters in the paper. \n\nNovel tools, or very specialized tools where that tool itself is a product absolutely qualify.",
                                  "author": "Average650",
                                  "created": 1600892982,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "g6aipth": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aipth/",
                      "text": "I was speaking under the impression that technical contributions are grouped inside intellectual contributions. Perhaps I should have been clearer.",
                      "author": "Seankala",
                      "created": 1600838473,
                      "upvotes": 20,
                      "replies": {
                        "g6b2eob": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b2eob/",
                          "text": "If the person made a proper analysis and provided expertise, then this is a valid authorship contribution.\n\nHowever, simply operating a machine and giving back minimally processed data doesn't mean authorship. That's service and warrants acknowledgement at most.",
                          "author": "Why_So_Slow",
                          "created": 1600859486,
                          "upvotes": 15,
                          "replies": {
                            "g6begj8": {
                              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6begj8/",
                              "text": "Good luck getting someone to operate that machine for you again then.",
                              "author": "bobgom",
                              "created": 1600868379,
                              "upvotes": 3,
                              "replies": {
                                "g6bgxjq": {
                                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bgxjq/",
                                  "text": "Never been an issue and I've been around for quite some time.",
                                  "author": "Why_So_Slow",
                                  "created": 1600869795,
                                  "upvotes": 2,
                                  "replies": {}
                                },
                                "g6chz30": {
                                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6chz30/",
                                  "text": "Usually lab techs that fill a role like that are paid to do that job and do not expect authorship. They're usually services to a large department, or an entire college or something. They aren't looking for authorship.",
                                  "author": "Average650",
                                  "created": 1600888222,
                                  "upvotes": 1,
                                  "replies": {
                                    "g6deh82": {
                                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6deh82/",
                                      "text": "Right, whether or not they get authorship is more a function of who did the measurements, is it a lab tech who has no need for authorship or a PhD student/postdoc/staff scientist? Who's equipment it is, is it some sort of departmental resource? Do I need to pay for it?\n\nIn another scenario, I may want to do a particular measurement, and I have a collaborator who has the equipment to do so. Very often this doesn't really require an intellectual contribution or analysis, they just need to send the data, but if I decided on that basis to refuse them authorship, they wouldn't be my collaborator anymore, and the measurement would not get done and our knowledge of the world would be (albeit probably marginally) poorer.\n\nOr for example many large  experimental facilities (synchotrons etc), make it a condition for use that the staff scientist who helps run your experiment is an author on any publications using the data. Granted they will often make significant contributions to data analysis and interpretation, but sometimes they will just help run the experiment and give you some data at the end. But again there is no question that they will be an author.",
                                      "author": "bobgom",
                                      "created": 1600907857,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g6auvmy": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6auvmy/",
              "text": "Define technical.",
              "author": "dexwin",
              "created": 1600850655,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "g6artg1": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6artg1/",
      "text": "You're not obliged to work with/for people unless you feel you're benefitting enough from it for it to take away from you doing your own work. You're not obliged to \"collegially\" do other people' work for them so they can profit off you.\n\nIt's far too kill-or-be-killed / vampiric a system for that, and people's goodwill and uncertainty - I think some of us started out assuming there \\*is\\* an etiquette there were there absolutely isn't - gets exploited horribly.",
      "author": "waterless2",
      "created": 1600847054,
      "upvotes": 25,
      "replies": {
        "g6bk4ap": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bk4ap/",
          "text": "I used to be that person who couldn't refuse to help when someone struggled or passed on their work to me. Did everything I was asked, and because I was good at whatever it was, the requests kept increasing. After a light breakdown, I learned my favourite word. No.",
          "author": "Affable_Additive",
          "created": 1600871525,
          "upvotes": 6,
          "replies": {
            "g6bqr7u": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bqr7u/",
              "text": "Brethren/sistren!\n\nWhat got me out of it first was realizing that I was helping the wrong people and really doing wrong rather than good; and now I've found I do so much more valuable work by working on my own research than being monkeyboy fixing other people's rubbish.",
              "author": "waterless2",
              "created": 1600874917,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g6ay72z": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ay72z/",
      "text": "[deleted]",
      "author": null,
      "created": 1600854771,
      "upvotes": 50,
      "replies": {
        "g6bohmq": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bohmq/",
          "text": "You briefly mention public constructive criticism but I'd like to expand on that: Open *constructive* criticism is important for a healthy lab environment. Only giving criticism offline can foster imposter syndrome and resentment because people only see their peers getting praise while they dwell on the criticism they receive. Not to mention, it allows everyone to learn from the experience of others in their lab. \n\nOf course, I think this should be limited to a lab environment (as opposed to fully publicly) and tone is very important -- its about feedback to improve future work, not about tearing down the individual.",
          "author": "LeopoldTheLlama",
          "created": 1600873784,
          "upvotes": 10,
          "replies": {
            "g6ciesz": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ciesz/",
              "text": "It's also helpful because students need to learn a lot of the same things. No need to repeat some common error 1000 times. But this would only apply to common, relatively minor, errors that your've probably seen a few times before.",
              "author": "Average650",
              "created": 1600888437,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "g6bikom": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bikom/",
          "text": "Agreed. I hate it when supervisors badmouth students. I had a sort of similar problem just today. I work with researchers from other departments to help supervise my students. One of the students did something quite big wrong. I won't go into detail, but I agree that what the student did was wrong, and so does the student. Fair enough. Today I had multiple phone calls and emails flying back and forth telling me how bad the student is (student included in the emails) and I now find myself feeling sorry for the student. Yes, they made a mistake, but they admitted it and apologised and immediately started working on it. In my eyes, the story is now over. No need for all the dramatics and the insults. I have too much work already, but I'll supervise this student myself because I'm really not in the mood to hear another word about some mistake we've already moved on from.",
          "author": "Affable_Additive",
          "created": 1600870704,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "g6alaz6": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6alaz6/",
      "text": "If there is a shared machine/equipment/resource that has to be booked to be used, and is usually booked up for more than 3 days a week, you should let other people know if something happens and you can't use it. Ideally let anyone who might be interested in the machine know, not just those who happen to be in your office/room/line of sight... Try to give as much notice as possible and especially don't just cross your name out/delete yourself from the online calendar (if here is one) on the day or the day before.\n\nIf the machine needs to be topped up with some kind of consumable for proper functioning on the next day/week, assume it is still your responsibility even if you don't use it, unless someone else confirms they will take over.",
      "author": "selkie_upsilon",
      "created": 1600840665,
      "upvotes": 19,
      "replies": {}
    },
    "g6arm87": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6arm87/",
      "text": "When I was a grad student, my first boss told me that if I needed to buy parts I could spend some amount without even asking him -- I think it was like a couple hundred dollars a day.  He figured it was small on the scale of my salary (assuming I didn't do it every day) and trusted me to buy what I needed.\n\nI left that group and joined a different one my first year.  My new boss wanted me to construct something, so I needed to buy some parts, so I made my shopping list of a couple dozen items, showed my boss, and gave a price estimate -- something like $5,000 -- and boss said OK.  My boss was out of the country so I just had a chat with the requisition department and showed them that email and got it all purchased, way under budget (say $3,000).  Turned out my boss was SUPER pissed that I bought all that stuff without having them sign a single purchasing form, whereas it was my understand that they had OK'd the purchase and just left it up to me to do it.\n\nSo, make sure you know when your boss wants to see/sign the purchasing forms :)",
      "author": "dampew",
      "created": 1600846840,
      "upvotes": 37,
      "replies": {
        "g6b0ni6": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b0ni6/",
          "text": "Well that’s their fault.",
          "author": "TakeOffYourMask",
          "created": 1600857625,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "g6bd1ux": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bd1ux/",
      "text": "If you are asked to review a paper but decline for whatever reason, please please please offer some other names of individuals who might be qualified to review it. \n\nI'm an associate editor for some journals, and it sometimes takes me hours to find possible reviewers and check their publication records / web pages to see if they are qualified (and several of my fellow editors have said the same thing). But if you're an expert in the field, it might take you only 1 minute to come up with names of other qualified reviewers. Help out your community by offering this small but useful service.",
      "author": "jas0nh0ng",
      "created": 1600867530,
      "upvotes": 14,
      "replies": {}
    },
    "g6adxf1": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6adxf1/",
      "text": "Often two authors (or two groups of them) work on the same problem, almost in the same way at the same time. If one of them is more influential, they tend not to acknowledge the other work even though both sides become aware of it. Of course, usually the other party doesn't have that luxury and cites them. In the end, contribution of the lesser known person is usually forgotten by the majority of the people (unless they have very closely related work). I know some journals used to ask these people to coauthor and produce one paper in these situations. I don't think that is a very good idea. Some journals publish these papers back to back. Of course, physical copies matter much less than it did 30+ years ago but still this is a better idea. Just require both sides to cite the other one and I am happy with that.",
      "author": "amhotw",
      "created": 1600834757,
      "upvotes": 30,
      "replies": {
        "g6b0kxz": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b0kxz/",
          "text": "It’s valuable to have papers reproducing other work. I think there should be rewards for it.",
          "author": "TakeOffYourMask",
          "created": 1600857546,
          "upvotes": 5,
          "replies": {
            "g6b1ntq": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b1ntq/",
              "text": "I was thinking about theoretical work where statements are proved formally so there is no point of reproducing them. However, of course everyone has a slightly different set of assumptions so the variety is of course valuable.",
              "author": "amhotw",
              "created": 1600858716,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g6ci5i3": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ci5i3/",
          "text": "What's wrong with coauthoring a single paper? I think it's an interesting idea.",
          "author": "Average650",
          "created": 1600888311,
          "upvotes": 1,
          "replies": {
            "g6cjkhw": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6cjkhw/",
              "text": "In the instances I know, none of the authors were happy with the end result and usually papers merged this way turn out like a Frankenstein.",
              "author": "amhotw",
              "created": 1600889005,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g6atj72": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6atj72/",
      "text": "Only one rule in academia: Don’t be a dick.\n\nConstantly overlooked - normally by aging white divorced professors.",
      "author": "reversechinlock",
      "created": 1600849008,
      "upvotes": 33,
      "replies": {}
    },
    "g6b6x7g": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b6x7g/",
      "text": "Value your lab assistant/research coordinator - They are the ones who make things happen. Every system/equipment/purchase order that went out was due in large part to them.",
      "author": "a220599",
      "created": 1600863414,
      "upvotes": 14,
      "replies": {}
    },
    "g6afard": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6afard/",
      "text": "If all you did to contribute to a paper was provide funding/resources, your name doesn't belong on the list of authors but rather in the acknowledgments section.",
      "author": "Seankala",
      "created": 1600835769,
      "upvotes": 45,
      "replies": {
        "g6avjjz": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6avjjz/",
          "text": "If you mean funding agencies, sure. If you mean PIs who wrote the grant application and got it over the line, surely they must have had some intellectual contribution developing the research hypotheses, conceptualising the problem and developing a potential methodology. Even if they were completely AWOL after the money came in, I think that's still a pretty good case for authorship.",
          "author": "gmk3",
          "created": 1600851480,
          "upvotes": 34,
          "replies": {
            "g6b177y": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b177y/",
              "text": "I wish this were a more universal thing. I can't speak for everyone, but here in Korea many professors aren't even aware of their students working on papers, and some go as far as to prohibit them from submitting them to venues.",
              "author": "Seankala",
              "created": 1600858224,
              "upvotes": 6,
              "replies": {}
            },
            "g6bsx4v": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bsx4v/",
              "text": "Every major guideline on authorship makes it clear that merely having acquired funding is not sufficient for authorship. If it's a good case to make, clearly nobody has made it yet, or it's been rejected.",
              "author": "simoncolumbus",
              "created": 1600875989,
              "upvotes": 3,
              "replies": {
                "g6cijrq": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6cijrq/",
                  "text": "His point is that writing the grant itself is an intellectual contribution. They had the idea for the experiments, for the goals, for the questions. They may not have done much in actually answering the questions, but just asking them is a real intellectual contribution. Not to mention the experimental plans they laid out.",
                  "author": "Average650",
                  "created": 1600888505,
                  "upvotes": 2,
                  "replies": {
                    "g6ensgf": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ensgf/",
                      "text": "\"Just asking the questions\", too, does not count for authorship. If a PI actually wrote a grant application to the level of detail that fulfills authorship criteria, sure, then they deserve authorship. But that has nothing to do with the fact that they obtained the grant. To just assume that somebody who obtained a grant made an intellectual contribution to any work funded by the grant is plainly silly. We all know that's not how things work in practice.",
                      "author": "simoncolumbus",
                      "created": 1600939640,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g6ag7ds": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ag7ds/",
          "text": "It doesn't warrant them authorship but I think it warrants invitation as a potential co-author and updates on the project that they designed and wrote. Also when someone who was not qualified stole the project from them, defamed their character and lied to the PI.",
          "author": null,
          "created": 1600836460,
          "upvotes": 19,
          "replies": {
            "g6ax6et": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ax6et/",
              "text": "One of our PI's came across an article using data from HER study, criticizing the methodology of the study. She keeps lists of articles published about each of her studies, and while updating the list, she happened to find this article she never knew about on PLOS One. The author obviously did not understand the methodology of the study, and tried to make it seem like the people who were in charge of the study screwed up. To make it even better, the author worked in another department on the same campus, three buildings away, and never even bothered to speak to the PI. Of course, she contacted PLOS and the article was retracted within a week.\n\nEdit: I forgot to mention that the author of the article in question was a co-author on more than 10 articles on the very same study with the PI, and also co-supervised with the PI. That's how the author got the dataset.",
              "author": "Affable_Additive",
              "created": 1600853531,
              "upvotes": 12,
              "replies": {
                "g6bdg5r": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bdg5r/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1600867771,
                  "upvotes": 2,
                  "replies": {
                    "g6bdsrn": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bdsrn/",
                      "text": "It was retracted for two reasons. The author did not have permission from the PI to use the data for publication (she got it from one of our students), and the criticism was factually incorrect. The author made assumptions about the methodology that could have been rectified in a simple email to, or conversation with, the PI.",
                      "author": "Affable_Additive",
                      "created": 1600867982,
                      "upvotes": 6,
                      "replies": {
                        "g6bfbbn": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bfbbn/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1600868878,
                          "upvotes": 1,
                          "replies": {
                            "g6bffjk": {
                              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bffjk/",
                              "text": "Sorry :) No, it was basically a criticism of the dataset.",
                              "author": "Affable_Additive",
                              "created": 1600868948,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "g6bt4y7": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bt4y7/",
                          "text": "Sounds like your PI not publishing data along with an article is part of the problem here. You shouldn't have to ask for permission to use data from published articles, especially not to critique the original work.",
                          "author": "simoncolumbus",
                          "created": 1600876095,
                          "upvotes": 0,
                          "replies": {
                            "g6btv1j": {
                              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6btv1j/",
                              "text": "It was unpublished data from the dataset, yet to be used.",
                              "author": "Affable_Additive",
                              "created": 1600876448,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g6aqimh": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aqimh/",
          "text": "I think PLOS allows for that possibility: https://journals.plos.org/plosone/s/authorship",
          "author": "dampew",
          "created": 1600845666,
          "upvotes": 4,
          "replies": {}
        },
        "g6bnc8c": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bnc8c/",
          "text": "I wish this was an unwritten rule, but it very much isn't :(. \n\nI think it is the norm for senior people to stick themselves on papers where their funding/resources was used even if they are barely aware of the work.\n\nI think the actual unwritten rule is the awful negative of the one you wrote: senior people that only contributed funding/resources aren't questioned about if they should be on papers or not, and are just assumed to be on them unless they request otherwise.",
          "author": "DevFRus",
          "created": 1600873193,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g6atlfe": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6atlfe/",
      "text": "Don't leave the toilet full of shit. The cleaning personnel are not your slaves, and it's disgusting when someone goes there for a quick wee and has to see that crap. This one should work outside academia as well.",
      "author": "aknb",
      "created": 1600849084,
      "upvotes": 10,
      "replies": {
        "g6b0sy4": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b0sy4/",
          "text": "Okay I thought you were using a metaphor at first.",
          "author": "TakeOffYourMask",
          "created": 1600857795,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "g6anuro": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6anuro/",
      "text": "Just because you are a postdoc, doesn’t mean you get to pull rank over PhD students. Post docs can be wrong sometimes too",
      "author": "btredcup",
      "created": 1600843018,
      "upvotes": 30,
      "replies": {
        "g6aorxw": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aorxw/",
          "text": "The minute someone pulls rank over me is the minute they have lost my respect, regardless of their role. Decisions should always be based on logical arguments. If I wanted to be bossed around, I would be in industry.",
          "author": "ColourlessGreenIdeas",
          "created": 1600843919,
          "upvotes": 26,
          "replies": {
            "g6ark3j": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ark3j/",
              "text": "I've been massively surprised and disillusioned by how hierarchical academia is. It's power and status and implicit threats and fear all. the. time.",
              "author": "waterless2",
              "created": 1600846774,
              "upvotes": 13,
              "replies": {
                "g6atcwm": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6atcwm/",
                  "text": "That seems to depend on various factors, such as field and country. Even though I come from a relatively hierarchical country (Germany), I never felt implicit threats and fear. I sometimes felt pressure to do things in a certain way, but where necessary, I defended my stance and usually got away with it, or accepted some clear logical arguments why the other way was better.",
                  "author": "ColourlessGreenIdeas",
                  "created": 1600848795,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "g6awr21": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6awr21/",
              "text": "I am exactly the same. A postdoc recently tried to push me out of a coauthorship and pull rank with some analysis we disagreed on. I got a second (& third) opinion that agreed with me. I’m now being ghosted by said postdoc and can’t get a look in at my own paper. \nI have lost all respect for him and the PI that allowed this. I now know not to work with them again.",
              "author": "btredcup",
              "created": 1600853002,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g6bj66i": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bj66i/",
          "text": "[deleted]",
          "author": null,
          "created": 1600871026,
          "upvotes": 4,
          "replies": {
            "g6jspkl": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6jspkl/",
              "text": "Nah. That's cool as fuck. If I had a Nobel Prize I would use it to win every argument. You want to watch The Boys? Well, my Nobel Prize says wee are watching Cobra Kai!",
              "author": "BlokeyBlokeBloke",
              "created": 1601051969,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g6bjg69": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bjg69/",
      "text": "I really hope academic culture undergoes a massive shift to abandon some of these pedantic formalities.  Seems every other post is someone complaining about politics, red tape, and bureaucracy in academia yet here we are entrenching a lot of those rituals.",
      "author": "elduderino260",
      "created": 1600871172,
      "upvotes": 7,
      "replies": {}
    },
    "g6addiu": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6addiu/",
      "text": "Pretty minor, but one I had to be explicitly told: the more junior person sends the calendar invite for meetings.",
      "author": "ossicones",
      "created": 1600834362,
      "upvotes": 63,
      "replies": {
        "g6agcue": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6agcue/",
          "text": "Huh. I’m 13 years into my career including almost 7 years in senior management and have never operated this way. Whoever wants the meeting can send the calendar invite.",
          "author": "so_i_happened",
          "created": 1600836576,
          "upvotes": 70,
          "replies": {}
        },
        "g6akct4": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6akct4/",
          "text": "In the current environment it's more like: the one person who knows how to send MS Team invites sends the mail.... Even if he isn't in the meeting.\n\nJust because we're scientists doesn't mean we understand computers.",
          "author": "noknam",
          "created": 1600839843,
          "upvotes": 42,
          "replies": {}
        },
        "g6akhjp": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6akhjp/",
          "text": "At all four of my universities, it’s always been the standard that the meeting invite is set up by the person requesting the meeting. Or if they’re an old man who can’t use Outlook, their admin.",
          "author": "Greenmantle22",
          "created": 1600839956,
          "upvotes": 18,
          "replies": {
            "g6h5vmd": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h5vmd/",
              "text": "I literally once had a professor brag he never learned to type because his pre-academic job told him he ought not to learn - that they'd much rather pay a secretary to do it, as it's cheaper.\n\nHe still doesn't know how to use outlook to send emails, but sometimes figures out how to read them.",
              "author": "comped",
              "created": 1600986547,
              "upvotes": 1,
              "replies": {
                "g6h9540": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h9540/",
                  "text": "Dumb bastard. \n\nI know a few senior professors in my department who still use overhead projector slides that \"the typing pool\" created for them in 1982. They still reference Eastern Airlines, Yugoslavia, and child star Shirley Temple.",
                  "author": "Greenmantle22",
                  "created": 1600988421,
                  "upvotes": 1,
                  "replies": {
                    "g6h9w7g": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h9w7g/",
                      "text": "He's not dumb haha. Just had better things to do - Disney hired him to produce entertainment for them, and he did it well. If you've been to any Disney park in the past 50 years, you've seen his shit. That's why he never learned to type - because his time was more valuable creating shit that made Disney money.\n\n> I know a few senior professors in my department who still use overhead projector slides that \"the typing pool\" created for them in 1982. They still reference Eastern Airlines, Yugoslavia, and child star Shirley Temple.\n\nWhat the hell are they teaching that something from 1982 isn't outdated?",
                      "author": "comped",
                      "created": 1600988862,
                      "upvotes": 1,
                      "replies": {
                        "g6hm0cj": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6hm0cj/",
                          "text": "People who claim their time is \"too valuable\" to do everyday tasks that everyone else does without complaint are just jackasses.",
                          "author": "Greenmantle22",
                          "created": 1600995994,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g6adxxf": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6adxxf/",
          "text": "[deleted]",
          "author": null,
          "created": 1600834768,
          "upvotes": 48,
          "replies": {
            "g6aesbd": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aesbd/",
              "text": "I think what they mention is about already agreed upon meetings/events.",
              "author": "amhotw",
              "created": 1600835385,
              "upvotes": 10,
              "replies": {
                "g6as613": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6as613/",
                  "text": "I don't know, it still doesn't make sense.\n\nWhere I am (Aus/UK), the person organising or in charge of the meeting is the one who sends the invite. That's typically the most senior person, or it's someone specifically appointed to the job of organising those meetings. The more junior person **never** sends the invite, and it would actually be incredibly rude to do so. If no one sends you an invite, you add it to your own personal calendar but you should never be so \"arrogant\" or presume to tell a more senior person how to add it to theirs. If you send the invite then you're claiming to be the boss or the person in charge of that meeting, and that isn't true.",
                  "author": null,
                  "created": 1600847437,
                  "upvotes": 14,
                  "replies": {
                    "g6jt325": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6jt325/",
                      "text": "I'm in the UK, and we operate it the opposite way to you. Setting up the meting invite is basically grunt work, so gets done by the most junior person attending.",
                      "author": "BlokeyBlokeBloke",
                      "created": 1601052153,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "g6h5rev": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h5rev/",
                      "text": "Works the same in America. Industry or academic.",
                      "author": "comped",
                      "created": 1600986484,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g6aefof": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aefof/",
          "text": "Just to clarify, you mean once a meeting time has already been agreed upon, the junior person is the one that sends the actual invite for that meeting to be added to schedules?",
          "author": "Greatbigdog69",
          "created": 1600835127,
          "upvotes": 17,
          "replies": {
            "g6af9nu": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6af9nu/",
              "text": "Correct.",
              "author": "ossicones",
              "created": 1600835745,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g6al41i": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6al41i/",
          "text": "I definitely don't think this is standard? At least in many situations I have been in, the more senior person was more persnickety about the calendar event formatting or had a lab manager/PA running the calendar and so it would have been rude for me (the more junior person) to send the invite. \n\nNow, with ownership of Zoom meeting rooms and such, it has tilted even further in favor of the more senior person \"owning\" the event as a logistical matter.",
          "author": "aggressive-teaspoon",
          "created": 1600840495,
          "upvotes": 9,
          "replies": {}
        },
        "g6aendb": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aendb/",
          "text": "Wait really? I didn’t know this...",
          "author": "beforward",
          "created": 1600835286,
          "upvotes": 6,
          "replies": {}
        },
        "g6ajuq2": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ajuq2/",
          "text": "Similarly the more junior staff member travels to wherever is most convenient for the more senior staff member.",
          "author": "wezwells",
          "created": 1600839416,
          "upvotes": 10,
          "replies": {}
        },
        "g6asbp4": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6asbp4/",
          "text": "Especially if youve asked me for the meeting! Granted it doesn't take much time to set up but it adds up if I have to do it for all/most meetings",
          "author": "tc1991",
          "created": 1600847610,
          "upvotes": 1,
          "replies": {}
        },
        "g6ao38f": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ao38f/",
          "text": "I've anothet question. What the fuck is calendar invite?",
          "author": "atrlrgn_",
          "created": 1600843246,
          "upvotes": 1,
          "replies": {
            "g6aq7ck": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aq7ck/",
              "text": "You don’t have a shared calendar through google or outlook? You just add it there so people get reminders and can make schedule changes.",
              "author": "UNTDuderino",
              "created": 1600845347,
              "upvotes": 5,
              "replies": {
                "g6as3hb": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6as3hb/",
                  "text": "> You don’t have a shared calendar through google or outlook?\n\nActually no. Maybe my advisors have it but I never use calendars. Am I missing something huge haha?",
                  "author": "atrlrgn_",
                  "created": 1600847360,
                  "upvotes": 1,
                  "replies": {
                    "g6atcz9": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6atcz9/",
                      "text": "possibly, if its not in my calendar don't be surprised if I'm not there, also shared calendars are an easy way of seeing when people have free time for a meeting, I often tell my PhD students to just look at my calendar and send me an invite, of course it may be that the people you work with don't use them so maybe it doesn't matter",
                      "author": "tc1991",
                      "created": 1600848797,
                      "upvotes": 6,
                      "replies": {
                        "g6atxfx": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6atxfx/",
                          "text": ">  of course it may be that the people you work with don't use them\n\nI guess that's my case here, but dunno. I will ask them asap haha. Thanks for the explanation!",
                          "author": "atrlrgn_",
                          "created": 1600849494,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g6as8yp": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6as8yp/",
              "text": "its like an email but it sets up an appointment in your outlook/google/i calendar, in outlook you can even set it up so that it auto connects to skype or teams\n\nhttps://www.webucator.com/how-to/how-schedule-meeting-with-microsoft-outlook.cfm",
              "author": "tc1991",
              "created": 1600847525,
              "upvotes": 3,
              "replies": {
                "g6asz48": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6asz48/",
                  "text": "Thank you. I didn't know it was commonly used.",
                  "author": "atrlrgn_",
                  "created": 1600848348,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g6bf9r8": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bf9r8/",
      "text": "I already posted something else here, but I just thought of another. If you present your research to others, assume that they don't know much about your topic, because most of them probably don't. I've been in too many scientific committee meetings where topics have to be approved for research, where the presenter blasts the committee with too much specialised information, acronyms, obscure methods or techniques, etc. Maybe one or two people will know what you're talking about, but the rest won't. Of course, they won't admit that and they'll pick on specific things that they recognise. I follow this rule of thumb: if my wife can understand what I'm trying to say, it's a good presentation (She's not dumb by the way - she's also a scientist but in a different field).\n\nI once sat in a Physiology PhD research presentation like that. So many details and technical jargon and statistics. People asked questions that seemed intelligent. Then the oldest and wisest professor leaned forward and said \"Hm... I'm sorry, interesting work but... Where is the physiology?\"\n\nBecause the presenter had buried the audience in alphabet soup, everyone except him had completely missed the fact that the study did not, in fact, contain a single bit of the subject at hand.",
      "author": "Affable_Additive",
      "created": 1600868853,
      "upvotes": 7,
      "replies": {}
    },
    "g6aovkt": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aovkt/",
      "text": "3/5 researchers don’t actually understand what a p-value is in applied statistics. It drives me nuts.\n\nFor your info A p-value is a conditional probability: Assuming the Null-Hypothesis (H_0) is TRUE, the obtained p-value is the probability that the effect is 0 in the population.\n\nThis is the weird part about frequentest statistics as opposed to Bayesian statistics. The argument you’re making is: assuming there is no effect in the population, it is unlikely that we would observe a difference as great as we did as compared to 0. Therefor we assume it is unlikely to be a 0 effect in the population.\n\nIt’s a backwards argument. Many people assume a p-value is the probs ability of the Null, this is not true in frequentest statistics. SO FOR THE LOVE OF REV. BAYES, STOP TELLING YOUR STUDENTS THAT AND READ A STATISTICS TEXTBOOK.",
      "author": "kakeman69",
      "created": 1600844020,
      "upvotes": 26,
      "replies": {
        "g6b169i": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b169i/",
          "text": "> For your info A p-value is a conditional probability: Assuming the Null-Hypothesis (H_0) is TRUE, the obtained p-value is the probability that the effect is 0 in the population.\n\nAt the very least, your own definition is written down in a very confusing way. Assuming a standard test of equality (so not non-inferiority, superiority or equivalence), your H_0 is already that the effect is 0 in the population, so the probability of that assuming H_0 is true is 1.\n\nYou obviously do know the correct interpretation in your second paragraph, but the way you wrote it down is just as wrong as the Bayesian interpretation you are complaining about.",
          "author": "n23_",
          "created": 1600858196,
          "upvotes": 15,
          "replies": {}
        },
        "g6bmhge": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bmhge/",
          "text": "The major problem is a lot of material just writes it like you do, which is good if you're already familiar with it, but confused the hell out of those who don't know the foundation these ideas are built upon.\n\nI like learning statistics with r of Danielle navarro because it builds it bit by bit, assuming little knowledge of mayhs and stats, and keeping in mind that the audience approaches stats as a tool, not a theoretician.\n\n(Don't mean to diss you btw I'm fully aware that the problem you specify is valid and serious)",
          "author": "borun_of_the_wastes",
          "created": 1600872755,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g6bkjs5": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bkjs5/",
      "text": "So many people confusing etiquette with soft skills or common sense...",
      "author": "thegreenaquarium",
      "created": 1600871752,
      "upvotes": 5,
      "replies": {}
    },
    "g6aeppr": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aeppr/",
      "text": "After defending your thesis you are supposed to buy a drink/meal to your advisor or at least show the kindness to offer it.",
      "author": "anavarzaaa",
      "created": 1600835334,
      "upvotes": 15,
      "replies": {
        "g6ahp4v": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ahp4v/",
          "text": "The student buys the advisor a meal? I've never heard of this. Grad students are usually broke.",
          "author": "geosynchronousorbit",
          "created": 1600837635,
          "upvotes": 48,
          "replies": {
            "g6ar48z": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ar48z/",
              "text": "In my department (in Sweden) it's tradition for the newly graduated PhD to invite all members of the group as well as the defense opponent and committee to a dinner to celebrate. But then, over here PhD students have decent salaries and benefits by virtue of being full-fledged employees of their respective universities...",
              "author": "Arachnid92",
              "created": 1600846301,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "g6avr86": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6avr86/",
          "text": "This is way too culture dependent.\n\nI graduated from Japan and they will never let me touch money at a dinner.\n\nIn fact, the professors will one up another to treat the students. It's often a race to the cashier to pay first.\n\nThey did throw us a very big \"victory dinner\" after the final person in our group defended. A huge meal in Osaka, across 3 labs from 2 universities, followed by two more rounds of drinks at two other places (I only joined one more -- had to take the train for another hour; could not stay until pubs close).",
          "author": "lunaticneko",
          "created": 1600851748,
          "upvotes": 20,
          "replies": {
            "g6h6alz": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h6alz/",
              "text": "Trains don't run that late in Japan?",
              "author": "comped",
              "created": 1600986782,
              "upvotes": 1,
              "replies": {
                "g6h9zg3": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6h9zg3/",
                  "text": "Depends on where you live. Tokyo main lines run until midnight-ish (may have changed), but regional trains stop earlier. In my case I had to ride from Osaka (where the fun took place) back to Nara (where I lived and studied), so I could not afford to stay too late.",
                  "author": "lunaticneko",
                  "created": 1600988914,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g6awfa6": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6awfa6/",
          "text": "Here in my experience in the U.K. the group usually buys a bottle of plonk and snacks etc for a wee party after a defence. The PhD student is likely brain dead at that point!",
          "author": "ayeayefitlike",
          "created": 1600852595,
          "upvotes": 5,
          "replies": {}
        },
        "g6bmvsz": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6bmvsz/",
          "text": "Where are you located? This is likely very dependent on where you live. In my experience in Canada, it is the opposite.",
          "author": "caakmaster",
          "created": 1600872961,
          "upvotes": 3,
          "replies": {
            "g6cc6t4": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6cc6t4/",
              "text": "Same in my experience in the Northeast US. The advisor often brings champagne to the defense (which they hide until after they announce that the candidate passed).",
              "author": "loopsonflowers",
              "created": 1600885383,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g6aiw17": {
      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aiw17/",
      "text": "Undergrads and masters students should stop bugging PhDs randomly for consultations as if they are being paid to do so lol. Set appointments. We are not your nannies.",
      "author": "cobie1em0ji",
      "created": 1600838615,
      "upvotes": 10,
      "replies": {
        "g6akndr": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6akndr/",
          "text": "For most, if not all, universities it literally lists teaching and assistance in contract.\n\nSo you ARE being paid for that.",
          "author": "noknam",
          "created": 1600840094,
          "upvotes": 21,
          "replies": {
            "g6aku0e": {
              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6aku0e/",
              "text": "In my case I am doing it for free and it was not stipulated in my scholarship contract. Just doing it cause my professor says so lol.",
              "author": "cobie1em0ji",
              "created": 1600840250,
              "upvotes": 5,
              "replies": {
                "g6atgoz": {
                  "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6atgoz/",
                  "text": "I realize that all labs run differently, but somebody with that attitude would have an incredibly short shelf-life in my lab.  How my PhD level staff (in position and post-doc) interact with the students, and how PhD students interact with Masters students, and how senior Masters students interact with new Masters students is one thing I keep a VERY close eye on.  It can determine whether I take them on when a positon becomes free, whether they get a glowing recommendation or a lackluster one, whether I take them into the PhD program etc.   \n\nNo, PhDs are not nannies - but they are expected to be role models and mentors.",
                  "author": "Life_time_learner",
                  "created": 1600848923,
                  "upvotes": 16,
                  "replies": {
                    "g6ave0m": {
                      "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ave0m/",
                      "text": "They are, however, they are also there to publish and move their career forward, if they want to do that in the area of teaching, that is there choice. You don't get to choose that for them.\n\nWhile I agree it is good to have collaborative attitude, often spending your research time to teach someone with no value to yourself, is only a detriment to your progression and really students should gauge there interaction as not only who they are helping but how  it is helping them. If they don' they aren't going to make it anywhere but burnout with nothing to show for it.",
                      "author": "Psyc5",
                      "created": 1600851285,
                      "upvotes": 6,
                      "replies": {
                        "g6azmey": {
                          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6azmey/",
                          "text": "Just to be clear, a senior who meaningfully helps a junior persons work to progress - gets to go on the paper.  In a highly collaborative lab (which mine is) everyone benefits.",
                          "author": "Life_time_learner",
                          "created": 1600856458,
                          "upvotes": 7,
                          "replies": {
                            "g6b11lr": {
                              "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6b11lr/",
                              "text": "“A rising tide floats all ships”",
                              "author": "cain2995",
                              "created": 1600858055,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g6ku63k": {
          "link": "/r/AskAcademia/comments/iy15mt/what_are_some_unwritten_rules_of_etiquettes_in/g6ku63k/",
          "text": "I completely disagree with this. Having a relaxed and inviting relationship between senior grad students with junior grad students/undergrads is very important. Asking somebody to run an experiment with only input from their PI is a terrible idea, people need help from those who work in the lab everyday and have direct experience with similar assays is very important. When you are new to the lab you need help and when you have been there for longer you pay it back, not having that sounds like a horrible lab environment.\n\nThis attitude where you either feel superior to those with less experience or a very selfish attitude to work and time would not work in my lab, no matter how good of a scientist you are my PI would tell you to leave. In my lab every PhD student has at least one undergrad they directly supervise and a junior grad student that works on a similar topic that they don’t directly supervise but are expected to help out when they have questions.\n\nEdit: I understand there are cultural differences so I am a 4th year PhD student at an R1 university in the US.",
          "author": "HMHype",
          "created": 1601071879,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}