{
  "sid": "l0zobg",
  "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/",
  "title:": "Academics - What Do Your Spouses Do?",
  "text": "My husband is a TT at a community college in the US in a department that he loves. I currently adjunct at a few colleges in the area, but I don't foresee a full-time position opening up for me, so I'm thinking of changing careers. The trouble is that we live in a small, rural city that doesn't offer many career opportunities for people with my academic background. \n\nSo, I'd love to hear what your spouses do, especially if you live in a small city. Do they enjoy it? How do you handle different schedules/summers off?",
  "author": "fafa2ewe",
  "created": 1611109956,
  "updated": 1634081853,
  "over_18": false,
  "upvotes": 115,
  "upvote_ratio": 0.97,
  "comments": {
    "gjwuxde": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwuxde/",
      "text": "Stay at home dad",
      "author": "abandoningeden",
      "created": 1611117374,
      "upvotes": 86,
      "replies": {
        "gjxq8uf": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxq8uf/",
          "text": "I’m so jealous.",
          "author": "Froggy101_Scranton",
          "created": 1611144267,
          "upvotes": 8,
          "replies": {
            "gjxqgg8": {
              "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxqgg8/",
              "text": "Ha well he kinda ended up that way by accident...moved to my tt job in 2010 when unemployment was 11% here and couldn't find a job, was taking some classes to work on a postbac when I had our first kid and still couldn't find a job that paid more than the cost of childcare. We have 1 16 year old car and live very cheaply and I am jealous of my colleagues who go on nice vacations semi regularly and can save for their kids to go to college.",
              "author": "abandoningeden",
              "created": 1611144441,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "gjxlik6": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxlik6/",
          "text": "Same here!",
          "author": "elmandala",
          "created": 1611139972,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gjwv7ad": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwv7ad/",
      "text": "My wife and I graduated Spring 2019 from grad school. I have an MA in English and am adjuncting. My wife’s a pharmacist. I’m really lucky that she doesn’t mind bringing in all the money while I raise our cat and try to figure my life out.\n\nETA: I’m not a guy, but y’all can now call me Cat Dad <3 thanks!",
      "author": "nerdhappyjq",
      "created": 1611117542,
      "upvotes": 130,
      "replies": {
        "gjxusbm": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxusbm/",
          "text": "Stay at home cat dad is legit!",
          "author": "SailinSand",
          "created": 1611147786,
          "upvotes": 12,
          "replies": {}
        },
        "gk0512x": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gk0512x/",
          "text": "The world needs more cat dads!",
          "author": "DavidDPerlmutter",
          "created": 1611186488,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gjxqwtl": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxqwtl/",
      "text": "I met my wife in grad school in 1977; she came in one year later than did I. I first saw her as I wandered into the department and she was in front of the building talking to people. Then I saw her in the computer center hitting a keyboard trying to login. I took the opportunity to help her and meet her. Then 5 months later at our annual Charles Darwin Birthday party we really met and stayed together since.\n\nShe finished her MA and decided to not pursue her PhD (ours was a PhD program where we got an MA on the way). She managed to get a job as a programmer (knowing virtually nothing!) at the hospital rehab center. She spent hours at night trying to get a PDP11 to run. Another programmer there took pity on her and handed her a piece of paper that said, 2+3=5 and told her that as soon as she could get the machine to run that calculation come back and talk with him. She did and he helped her out a bit more, then he hired her as a programmer for his side business making spirometers for the military. So, she's a self-taught programmer-and is really good at it.\n\nMeanwhile I finished my doctorate and came to a community college 80 miles away. I assumed she'd just move up with me but she stood firm on her Wisconsin small town morals and told me she wasn't moving to a small town and live with me unmarried. Marriage was a new idea for me but I embraced it.\n\nThe first month we were in our town she sat at home. Then the local school system got a PDP11 and called our CC and asked if they had a recent graduate who might be able to program it. Fortunately I'd had a conversation with the head of the Computer Operations program who told them to call my wife rather than hire a new student. Of course she was able to make the thing sing when she went in for an interview. She pretty quickly became the Director of Technology at the school system.\n\nShe worked 28 years there until she met the time requirements for her full teachers pension. Then she retired. At that time she came to our (now) baccalaureate college to teach as an adjunct. Then a full time person quit at the last minute and my chair and the dean came and asked me if my wife would like to teach full time for a year. I was married a long time by then and so told them that my wife was in an office down the hall and so they should ask her if she'd like to teach full time. They did and she did. It was supposed to be a one-year gig. But at the end of that year, again the chair and dean came and asked me if she'd like to continue. I continued to be smart and told them that she was still down the hall and to ask her. At that point the dean asked her if she'd like to be temporary instructor for the foreseeable future. She said yes. Then 4 years later I became chair of the department and couldn't supervise a spouse. The dean asked our acting president if my wife could officially move departments and simply answer to her, the dean, but the president wouldn't do it. Not a surprise because she came after a really bad president and minor scandal--she was going to be very careful. So, my wife retired again after 5 years at the college. I stayed 5 more years and then I retired--right before COVID. Thank goodness!\n\nSo, we managed to muddle through in small town. The school system might be a good place to find employment while biding your time for positions at the CC.",
      "author": "rockyfaceprof",
      "created": 1611144821,
      "upvotes": 16,
      "replies": {}
    },
    "gjxmssw": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxmssw/",
      "text": "My partner installs industrial tire lifts and alignment machines. \n\nWe like to joke that one of us thinks a lot and the other is actually useful.",
      "author": "EpicDestroyer52",
      "created": 1611141192,
      "upvotes": 29,
      "replies": {}
    },
    "gjwovip": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwovip/",
      "text": "My partner just started as a high school science teacher in a local district. He LOVES it. He had to take a year of classes to get his certification, but the expense was worth it. Plus he’ll have summers off with me (or off from teaching, I have R1 research expectations so summers aren’t really “off”).",
      "author": "boilerlashes",
      "created": 1611113829,
      "upvotes": 70,
      "replies": {}
    },
    "gjwupoz": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwupoz/",
      "text": "Software developer or as I call him, my sponsor for engagement in career masochism.",
      "author": "Zelamir",
      "created": 1611117245,
      "upvotes": 103,
      "replies": {
        "gjwyswo": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwyswo/",
          "text": "Software dev, flirting w academia. Rip me.",
          "author": "KillerSmalls",
          "created": 1611119886,
          "upvotes": 19,
          "replies": {}
        },
        "gjxqkw5": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxqkw5/",
          "text": "Same.  \n\n\nVery convenient when you have to change countries. Good software developers are very flexible in terms of place of work - they can either take it with them, or find a decent job in new location, plus the qualifications are internationally recognized.",
          "author": "Why_So_Slow",
          "created": 1611144544,
          "upvotes": 6,
          "replies": {}
        },
        "gjww7wm": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjww7wm/",
          "text": "[deleted]",
          "author": null,
          "created": 1611118183,
          "upvotes": -4,
          "replies": {
            "gjwzqkn": {
              "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwzqkn/",
              "text": "Good luck getting out. I’m so deep in the friendzone that she asked me to be one of the bridesmaids for her wedding after her good friend dropped out due to pregnancy. I of course accepted. Oh and did I mention she’s marrying my cousin, who basically bullied me all throughout my childhood (and even today).",
              "author": "JoeyLing",
              "created": 1611120543,
              "upvotes": -14,
              "replies": {
                "gjx0690": {
                  "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjx0690/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1611120851,
                  "upvotes": -5,
                  "replies": {
                    "gjx0vs8": {
                      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjx0vs8/",
                      "text": "Well, not really irl but I’ve made a character of him in WoW and named him my cousin’s name! I try to kick his ass at least once a day (in the game). Feels pretty good tbh",
                      "author": "JoeyLing",
                      "created": 1611121365,
                      "upvotes": -11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gjwx18q": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwx18q/",
      "text": "I’m a postdoc and my wife is a resident (lab animal medicine) at the same university. Since meeting 7y ago we’ve tried to steer our careers a bit more toward each other’s, and I’ve especially emphasized versatility of employment in my own development of career capital. She’ll also pick up relief work at nearby wellness / vaccine clinics every other weekend — pays quite well, usually between $200-600 per hour.",
      "author": "--MCMC--",
      "created": 1611118714,
      "upvotes": 46,
      "replies": {
        "gjx9y71": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjx9y71/",
          "text": "whoa. an HOUR?",
          "author": "drobtina",
          "created": 1611128741,
          "upvotes": 17,
          "replies": {
            "gjxkyq0": {
              "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxkyq0/",
              "text": "Yep, the system works by her putting in bids in an online auction system that the clinic organizers can either accept, counteroffer, or reject. Demand is effectively bottomless during the pandemic and the clinics usually pull in a couple thousand $ per hour in profit but have to be canceled if there’s no vet on staff (which they're also reluctant to do, since word might get around that they can't hold on to client appointments). So sometimes she’ll have bid a normal (~$250 / h) rate for one day of the weekend, and a higher amount for the other, and they won’t have been able to pull anything together for the latter so they’ll accept her higher bid. Other times they’ll accept her bid but modify the hours and still pay her the original amount — I think once they might have even paid her like $1k for 0 hours of work lol (they also want to keep their vets happy cos they’re an obvious lynchpin of the whole operation). She's also really well liked by other staff, patients, and clients -- regularly gets nice voluntary feedback notes on how much a pleasure she is to work with!\n\nedit: this is also in the SF Bay Area, a magical land where things in general cost more and all the SWEs don't want Spot to get Parvo.",
              "author": "--MCMC--",
              "created": 1611139434,
              "upvotes": 20,
              "replies": {}
            }
          }
        }
      }
    },
    "gjx6j44": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjx6j44/",
      "text": "Tenured at an R1 University.  Wife is an registered nurse.  Supported me through grad school and decided for some reason to stay with me.",
      "author": "Decadance",
      "created": 1611125778,
      "upvotes": 30,
      "replies": {}
    },
    "gjxhvrc": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxhvrc/",
      "text": "[deleted]",
      "author": null,
      "created": 1611136355,
      "upvotes": 13,
      "replies": {
        "gk05j6z": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gk05j6z/",
          "text": "If you don’t mind sharing, what exactly did you do your MA and PhD in? Your career path sounds pretty cool.",
          "author": "nerdhappyjq",
          "created": 1611186748,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gjww1uq": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjww1uq/",
      "text": "I’m the main character in an Anita Brookner novel, so I don’t have a spouse.",
      "author": "seagreengoddess",
      "created": 1611118075,
      "upvotes": 37,
      "replies": {}
    },
    "gjx0eqe": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjx0eqe/",
      "text": "Not exist",
      "author": "unique0130",
      "created": 1611121018,
      "upvotes": 27,
      "replies": {
        "gjxqu4u": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxqu4u/",
          "text": "How does one get into that field? It sounds more lucrative and less stressful than where I am now",
          "author": "Rizzpooch",
          "created": 1611144759,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gjwwxdq": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwwxdq/",
      "text": "After trying to deal with me during my PhD she’s now single heh",
      "author": "Aerialise",
      "created": 1611118645,
      "upvotes": 51,
      "replies": {
        "gjxl8et": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxl8et/",
          "text": "rip",
          "author": "advanced-DnD",
          "created": 1611139699,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gjws8qk": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjws8qk/",
      "text": "I’m a tenured faculty member. My partner is an engineer (with a bachelor of science) who designs and builds automation equipment (and therefore makes double my salary, which is nice).  I don’t get summers off (expected to research), but I do get the bulk of child duties because if my flexible schedule.",
      "author": "Ruby_Ruth",
      "created": 1611115776,
      "upvotes": 31,
      "replies": {
        "gjxoi7d": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxoi7d/",
          "text": "Same! My partner has a bachelor's in civil engineering and works for our city government designing roads. I'm a lecturer (with a PhD) and make about 70% of his salary while he also has a lot more room to grow. Unlike the person above me, I do get summers off (or get to make more money--up to about 85% of what he earns). We started dating near the end of my PhD and were very fortunate that he was able to VERY easily find jobs in both of the towns we've lived in since.",
          "author": "mamyd",
          "created": 1611142737,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gjwuy1s": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwuy1s/",
      "text": "My spouse works at the university as a student services manager. It works great for us because we have the same university holidays and can carpool to work together. We live in a small town so there's not a ton of other options, but the university employs a lot of non-academic staff.",
      "author": "geosynchronousorbit",
      "created": 1611117386,
      "upvotes": 14,
      "replies": {}
    },
    "gjxiklb": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxiklb/",
      "text": "He's also a lecturer. I'm a senior lecturer in humanities, he's a lecturer in computer science. We live in the city I work in, as I teach a more erratic timetable and he teaches only once a week so the commute is better. Plus, with the pandemic he's entirely online.",
      "author": "HumanXeroxMachine",
      "created": 1611137049,
      "upvotes": 7,
      "replies": {}
    },
    "gjxkauj": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxkauj/",
      "text": "My wife worked at a nonprofit prior to my TT job. The pandemic was a blessing and a curse - her original job posting she was excited for was removed (study abroad is dead ;( ) but her job is allowing remote work until its back-in-office. She’s decided to get her teaching cert and be a high school teacher. It bothers me every day my job caused her to have to shift her career plans, but she’s adamant it’s for the best.",
      "author": "MrLegilimens",
      "created": 1611138778,
      "upvotes": 7,
      "replies": {}
    },
    "gjxiwl8": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxiwl8/",
      "text": "Forestry work mostly. Also works in the family outdoor events business during the summer.",
      "author": "OrbitalPete",
      "created": 1611137391,
      "upvotes": 4,
      "replies": {}
    },
    "gjxyqos": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxyqos/",
      "text": "He's a chef! I previously worked in hospitality and am a night owl/artist as well as a PhD candidate, so his unusual hours don't usually bother me.",
      "author": "Neyface",
      "created": 1611150321,
      "upvotes": 4,
      "replies": {}
    },
    "gjxvqaj": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxvqaj/",
      "text": "Ha I’m the spouse, currently on the job market as my partner just started a TT position. After 8 years of being the breadwinner, just happy to take a break and look after our kid. I’m an urban planner by training, but have mostly spent my career managing government research projects, so the university is helping me find research coordination positions, though I’m leaning more towards finally doing a PhD myself (something I’ve put off until the partner was done).",
      "author": "yoshah",
      "created": 1611148439,
      "upvotes": 5,
      "replies": {}
    },
    "gjx4n2w": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjx4n2w/",
      "text": "Im not an academic (im a teacher about to pursue a phd). My partner is a doctor, training to become a consultant. \n\nLike the first response, im lucky to have a partner who doesn't mind being the breadwinner whilst I pursue a PhD in literature.",
      "author": "LemonCurdJ",
      "created": 1611124240,
      "upvotes": 10,
      "replies": {}
    },
    "gjxep65": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxep65/",
      "text": "PhD Scholar, about to graduate.",
      "author": "kewra_bangali",
      "created": 1611133173,
      "upvotes": 5,
      "replies": {}
    },
    "gjwxzc0": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwxzc0/",
      "text": "My husband is a software developer, so he’s able to move around easily, especially since his current company lets him work from home. We live in a similar rural city and enjoy the outdoors and my new colleagues. \n\nI usually do more research in the summer or handle more of the domestic work.",
      "author": "soph876",
      "created": 1611119329,
      "upvotes": 13,
      "replies": {}
    },
    "gjxbbeu": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxbbeu/",
      "text": "I'm the trailing spouse, partner is TT at a SLAC. I coordinate the peer tutoring program at the same school. If/when we have kids, I'll be a stay at home dad for a while.",
      "author": "lucianbelew",
      "created": 1611130000,
      "upvotes": 8,
      "replies": {
        "gjxiyyg": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxiyyg/",
          "text": "Feel a bit ignorant; I don’t know what SLAC means. Can someone enlighten me?",
          "author": "tropical_librarian",
          "created": 1611137458,
          "upvotes": 1,
          "replies": {
            "gjxjzkj": {
              "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxjzkj/",
              "text": "Either the Stanford Linear Accelerator Center, or Small Liberal Arts College.",
              "author": "notadoctor123",
              "created": 1611138471,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "gjxqp5d": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxqp5d/",
      "text": "My husband got tenure last year and I'm still adjuncting and working a second consulting gig. The university we work for is categorically against spousal hires even though they keep losing good faculty because of it. A lot of academics are married to other academics which is why a lot colleges use spousal hires to attract people. Our dean and provost keep talking about how they are aware the university has a \"dangling spouse\" problem but have yet to provide solutions.\n\nI hate that term by the way. Beyond condescending.",
      "author": "archyslayer",
      "created": 1611144645,
      "upvotes": 8,
      "replies": {
        "gjy0tgu": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjy0tgu/",
          "text": "I've never heard that term and somehow it's 1000x worse than \"two body problem\" which I have ALWAYS hated.",
          "author": "BananasonThebrain",
          "created": 1611151509,
          "upvotes": 2,
          "replies": {
            "gjy4hpx": {
              "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjy4hpx/",
              "text": "Yuck. That one sucks too.",
              "author": "archyslayer",
              "created": 1611153510,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gjx7tcj": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjx7tcj/",
      "text": "He’s a pediatric surgeon",
      "author": "Vico82",
      "created": 1611126858,
      "upvotes": 10,
      "replies": {}
    },
    "gjxn27d": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxn27d/",
      "text": "Software developer.",
      "author": "gusfogensa",
      "created": 1611141434,
      "upvotes": 3,
      "replies": {}
    },
    "gjxv591": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxv591/",
      "text": "We’re both postdocs. He’s been on the job market since 2014. I started applying 2019. It’s tough. We’re just hoping one of us gets something and then the other can find something fulfilling.",
      "author": "zabulon_",
      "created": 1611148038,
      "upvotes": 3,
      "replies": {}
    },
    "gjxvsqu": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxvsqu/",
      "text": "I work at a a school that has the resources to compete for top faculty (i.e., poaching or countering other school's offers). It boggles my mind that there have been some times we've landed/kept faculty by giving their s.o. a job. It's never been a faculty position fortunately, and usually the position is a new one made up for them rather than displacing a theoretical future applicant. And honestly the s.o.'s who've gotten positions have turned out to be fabulous researchers/teachers. But in a world of employment struggles, the ability of a faculty member to say \"You want me? Give my partner a job then\" just doesn't compute.\n\nBut as for friends in this situation, the one I worry about is a best friend finishing his Ph.D. whose wife is a midcareer immigration lawyer. Her speciality exists in just two or three cities in the U.S. I don't know what's going to happen once he has to apply for postdocs in a field where you have to take whatever you can get. They also have a young kid.",
      "author": "dcgrey",
      "created": 1611148484,
      "upvotes": 3,
      "replies": {
        "gjxzs5k": {
          "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxzs5k/",
          "text": "I think spousal hires make perfect sense. In a specialized field, your options for applicants are limited and people are basically guaranteed to have to relocate. That means their partner will have to give up their job to move. If you think an applicant is worth it, removing that barrier makes perfect sense.",
          "author": "thatpearlgirl",
          "created": 1611150919,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gjxyepx": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxyepx/",
      "text": "Puppeteer and voiceover actress!",
      "author": "Aubenabee",
      "created": 1611150134,
      "upvotes": 3,
      "replies": {}
    },
    "gjxyjl7": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxyjl7/",
      "text": "Guitar technician. He plays guitar all day and gets paid a living wage for it. He basically sets up and tests out fancy guitars that rich people order from their store and makes sure they're in tune and sound good and they don't have any issues before shipping out. It's kind of the world's best gig.",
      "author": "everyoneisflawed",
      "created": 1611150211,
      "upvotes": 3,
      "replies": {}
    },
    "gjwqhq0": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjwqhq0/",
      "text": "My partner owns his own IT company. I teach year round, picking up classes during winter and summer sessions, so our schedules are quite similar. I’m going back to school for an EdD in the fall, but I doubt I’ll switch careers until I retire. I teach full time at a state college, and part time at a community college, but changing careers might be in the cards after earliest retirement.",
      "author": "apreena",
      "created": 1611114756,
      "upvotes": 7,
      "replies": {}
    },
    "gjx1m7p": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjx1m7p/",
      "text": "Market Research",
      "author": "theodoramarie",
      "created": 1611121909,
      "upvotes": 4,
      "replies": {}
    },
    "gjxrduq": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxrduq/",
      "text": "Wife is an data scientist with work  related to her PhD. We live in a top 3 city by size but she was hired as fully remote.",
      "author": "Prukutu",
      "created": 1611145213,
      "upvotes": 5,
      "replies": {}
    },
    "gjycll4": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjycll4/",
      "text": "My husband's an MMA coach and occasional SAHD :)\nMakes moving around the world after jobs much easier.",
      "author": "askja",
      "created": 1611157573,
      "upvotes": 2,
      "replies": {}
    },
    "gjxzzfe": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjxzzfe/",
      "text": "Not a direct answer to your question, but have you considered trying to pivot to a support staff role at one of the colleges you adjunct at? I’ve known several people from academic backgrounds who’ve done this. Depending on your specific skill set, student affairs, teaching and learning, research support and fundraising are all places folks with academic backgrounds can land.",
      "author": "wamme6",
      "created": 1611151035,
      "upvotes": 1,
      "replies": {}
    },
    "gjy17ih": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjy17ih/",
      "text": "My husband and I are both full time lecturers at a flagship state university. We both have our PhD in the same field. Our offices are across the hall from one another. However, we know at least one of us really needs a TT job. Even though our current positions are permanent, we don't get paid much and that needs to change. We have one kid and will have another one soon.\nWhichever one of us gets a good TT job will try for a spousal hire or help the other to find a decent gig in the area. If that doesn't pan out, we are flexible as we both have solid teaching and research records and are pretty fresh our of our PhD programs. Husband has considered changing careers as he is very crafty and a jack of all trades. Really likes making things and learning new trades. I am less flexible as I have a decent brain but not many other talents. Other than I'm a really rockin mom and want to push out more babies.",
      "author": "WorleyDooDickPotato",
      "created": 1611151726,
      "upvotes": 1,
      "replies": {}
    },
    "gjy1kw8": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjy1kw8/",
      "text": "I’m finishing my PhD and my partner is an engineer. He didn’t finish undergrad and was meant for a practical but engaging career. We balance each other out really well and sometimes he has better ideas/questions than I do. He doesn’t love the fact that our ‘vacation’ time never lines up (it’s kinda hard when grad students don’t really ‘get’ a vacation without feeling like they’ll be stuck in grad school for longer), and the long hours but he supports me 100%. We don’t live in a small town but also not a massive city. We respect each other and always discuss everything openly. But, when I had mentioned I was thinking about doing a post doc across the world he said that he wouldn’t want to come with me knowing a post doc position is short term and temporary. We’re both young without kids and I feel like we could have an adventure thru this but he wants stability. I’ve got some hard decisions to make.",
      "author": "fancyfootwork19",
      "created": 1611151933,
      "upvotes": 1,
      "replies": {}
    },
    "gjy1wyw": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjy1wyw/",
      "text": "I’m a faculty member at our local university and my partner is an instructional designer here. They originally wanted to go into academia (we met in the same grad program) but couldn’t handle the toxicity of academia. They are SUPER happy now working in a staff position- regular hours, better pay, full benefits, normal coworkers (lol), no overwhelmingly toxic competition/pressure to publish/tension between researchers.",
      "author": "Icuisine",
      "created": 1611152119,
      "upvotes": 1,
      "replies": {}
    },
    "gjyrkzr": {
      "link": "/r/AskAcademia/comments/l0zobg/academics_what_do_your_spouses_do/gjyrkzr/",
      "text": "My wife was until about a week and a half ago working as staff at the school I teach at, but then got let go for bullshit semi-pandemic related reasons, so we're trying to figure out what she's going to do now :(",
      "author": "mormoerotic",
      "created": 1611164245,
      "upvotes": 1,
      "replies": {}
    }
  }
}