{
  "sid": "5b96sy",
  "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/",
  "title:": "Final update: my departmental group scheduled a party at my abuser's home. I'm leaving campus.",
  "text": "This isn't an update I wanted or one that I even want to write out but I am in despair right now so I am typing it out.\n\nIn context, about three weeks ago I posted about a departmental party planned at my abuser's house and how after talking to the right channels the party was rescheduled to a different home.\n\n I don't think I went into a lot of personal detail in either post, but it was at his house that he sexually assaulted me the day before we broke up. There was no penetration but he got on top of me and dry humped me after I had told him there would be none of that. Post-breakup (which was in reaction to that and his decision to get black out drunk and in a car after I told him what he did wasn't OK and we needed to get on the same page about what was OK to do with my body) he continued to harass me in social situations, so I went to the Title IX office to get a no contact order. I thought that was the end of it but then he told one of my professors that I carried a gun on campus and I had to negotiate that. And then finally, a week and a half ago, he submitted to our creative nonfiction seminar a comic in place of an assignment, depicting his past relationships, our relationship (he uses my name), mentions my allegations of \"abuse\" and makes it all out to be over a forced kiss, and then several panels that appear to depict him raping and strangling my nude body. In these panels he says things like \"there's a fine line between sex and violence and killing.\" He sent this out to all classmates via email as well as the professor which is the standard for submitting assignments.\n\nI filed for an emergency ex parte but today the judge denied a full restraining order claiming that the comic did not fit the requirement missouri statues for harassment. I was told by a police officer that basically he would have to brandish a knife or gun or something to get a qualifier for harassment.  Although he has been kicked out of the class and has lost the only person in the department that can sponsor his thesis, he's still permitted to come into the same room I am in, be in the same building, hallway, office... And I can't do that. \n\nI've been told by my department that because the sexual assault can't be proven they can't do anything on their end. And I get it. I get that they have to do due process to guard against false accusations but what happened happened in his house when we were alone and no, he didn't tape it and no he doesn't wear a T-shirt that says this is what I did, and I get that I made a mistake by not immediately telling authority figures what he did to me but I just wanted to move on. There was no semen inside of me no chance of a baby no HIV or STDs just a moment where he abused my body that I thought I could move on from.\n\nTitle IX has opened an investigation and they are supportive but they've told me the outcome might take as long as sixty days and even after all of this he may still be a student next semester with no penalty. \n\nI know the next thing he will do will be to act on his fantasies. This has been escalating and he has always been reactive with his anger and after taking him to court I know that he is going to try to hurt me when he has the chance. People in the department think I am exaggerating but they don't fucking know him or how he acts when he is mad. So I am staying off campus now, and am going to try to not give him that chance. I'm really sad that I am the one that has to run. I'm really upset that this man is allowed to go to all his classes and continue to teach a class full of young women for his assistantship. I'm really sad that there are still people in the department that after seeing the comic think he's an OK guy and that I am making everything up. I'm really sad that no one seems to care if he kills me or not and it makes me wonder what the point is even of fighting for an education if my life is so expendable. And I don't have an answer to that. But I ask for prayers from all of you. I don't want to die. I have so much fucking life in me still. I won't let him take that away from me too. ",
  "author": "birdiewurdie",
  "created": 1478338456,
  "updated": 1634081895,
  "over_18": false,
  "upvotes": 106,
  "upvote_ratio": 0.83,
  "comments": {
    "d9mzzkr": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9mzzkr/",
      "text": "You may not feel comfortable doing this, and it's totally up to you, but if you want to PM me, I can put you in touch with friends of mine who are Title IX advocates. They have fought multiple campus administrations over things like this. I am outraged for you that your administration/department isn't doing enough. Do you have a copy of that comic saved (or does a trusted classmate)? That sounds like irrefutable evidence that his place on campus is a threat to you and possibly to others. You have a right to your education. Someone who violates and threatens you does not.",
      "author": "DancingHeel",
      "created": 1478363905,
      "upvotes": 60,
      "replies": {}
    },
    "d9mtfqg": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9mtfqg/",
      "text": "I am so sorry this has happened to you. I'm sorry you have to run. I'm glad you're putting your safety first.\n\nTry posting this in r/legaladvice, they might be able to help.",
      "author": "dopameanie1",
      "created": 1478352579,
      "upvotes": 21,
      "replies": {}
    },
    "d9mrrch": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9mrrch/",
      "text": ">I'm really sad that I am the one that has to run.\n\nYes, it absolutely sucks.  And it's what you have to do to stay safe.  Because yes, you probably know your ex better than anyone, and you are in a better position to predict what he may do to you.  \n\n>I've been told by my department that because the sexual assault can't be proven they can't do anything on their end. And I get it.  I get that they have to do due process \n\nIt's good that you can see their side of the issue.  The fact is that from everyone else's perspective but your own, there is not enough evidence against your ex to deny his rights.\n\n \n>and I get that I made a mistake by not immediately telling authority figures what he did to me \n\nThis situation is not your fault.  The fact that there isn't enough evidence of the assault is not your fault.  Even if you did report it immediately, it would still be your word against his.   It would probably made your present case only a little bit stronger, but not enough to tip the balance.  Unless there were bruises or scratches, which would be evidence of domestic abuse at least.\n\nIt is not your fault.  And yes, taking steps to stay safe is the right thing to do, even if it seems like you are giving up your education.  \n\nI wish you well, through this difficult time.    ",
      "author": "weaselword",
      "created": 1478348057,
      "upvotes": 53,
      "replies": {
        "d9mve08": {
          "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9mve08/",
          "text": "to be fair you are only getting one side of the story.\n\n",
          "author": "ghostofpennwast",
          "created": 1478356650,
          "upvotes": -47,
          "replies": {
            "d9myigq": {
              "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9myigq/",
              "text": "I love it when people say this in regards to me talking about abuse. Like what possible justification can you have for threatening somebody or assaulting them? It's honestly stupid. Do you want to hear \"omgggg she was just stressing me out so bad\" or \"she totally deserved it because she's such a bitch\" or \"I was going through a really rough time\"? Like this is the type of stuff where there is no excuse.",
              "author": "starshappyhunting",
              "created": 1478361753,
              "upvotes": 32,
              "replies": {}
            },
            "d9mwr1v": {
              "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9mwr1v/",
              "text": "Yes, I would love to hear the manipulations of an abuser who feels comfortable enough to publicly send out comics depicting sexual assault, violence, and killing.",
              "author": "Bananasauru5rex",
              "created": 1478359037,
              "upvotes": 43,
              "replies": {}
            },
            "d9n4jun": {
              "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9n4jun/",
              "text": "There is no \"other side\" of this story that would make his actions in any way acceptable. Fuck this attitude. ",
              "author": "LexicanLuthor",
              "created": 1478370359,
              "upvotes": 22,
              "replies": {}
            }
          }
        }
      }
    },
    "d9my7pt": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9my7pt/",
      "text": "I agree Title IX is the only agency/department who will be able to do anything about this, but, yeah, it will take a while. At my university, once Title IX completes their investigation it gets sent to student conduct and the head of student conduct, an attorney, decides if he/she wants to pursue disciplinary action. I'm on my universities conduct board and when I get sent the file for cases like the one you are describing they are usually hundreds of pages long. From what you described, I'd say our student conduct board would suspend him for a year or possibly until you graduate, forbid contact with you during and after the suspension is over, and put him on probation for the rest of his time with the university. As long as we found him accountable/guilty. The good, or bad, thing about the student conduct process is that they can frequently take action when the criminal justice system can't, because the burden of proof for the student conduct process is typically only a preponderance of the evidence. This is especially helpful in \"he said, she said\" cases where the criminal justice system is powerless, but student conduct can take action. ",
      "author": "BLB99",
      "created": 1478361303,
      "upvotes": 14,
      "replies": {}
    },
    "d9n0c81": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9n0c81/",
      "text": "This may not be much, but we are all wishing you strength, and rooting for you. ",
      "author": "lalochezia1",
      "created": 1478364399,
      "upvotes": 13,
      "replies": {}
    },
    "d9mw1x4": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9mw1x4/",
      "text": "I can't believe that even after that comic there are still people who would defend him.\n\nWill the Title IX stuff continue on in your absence? And have you been able to make arrangements to continue with your work from a distance?\n\nI am so incredibly sorry that you are going through this, I wish there was more we could do for you. Please take care of yourself, I commend you for taking such a proactive stance at protecting your life, and I hope that in the meantime you are still able to get on with living it.",
      "author": "foibleShmoible",
      "created": 1478357855,
      "upvotes": 22,
      "replies": {}
    },
    "d9myeo3": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9myeo3/",
      "text": "I feel this. I was in a very violent situation and people just don't get that the other person can kill me, has threatened to do so, has tried to do so… they're still so blind, they live in a world where they don't have to face the reality that seeming normal members of society can be fucking crazy and kill you. I've also had people accuse me of exaggerating, which is really ridiculous because like you say they have no idea what they're talking about. People will assume nothing is going on because it's easier to have a nice worldview that way, and will refuse to change their opinion even with video evidence or whatever.",
      "author": "starshappyhunting",
      "created": 1478361593,
      "upvotes": 7,
      "replies": {}
    },
    "d9mx45l": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9mx45l/",
      "text": "Do what you need to do to stay safe. Remember, *none* of this is your fault.\n\nIs there a shelter or group for abused women near you? They might be able to provide some support. It can be helpful to hear from other people who have been through/are going through similar situations.",
      "author": "ProbabilisticWorld",
      "created": 1478359625,
      "upvotes": 12,
      "replies": {}
    },
    "d9nm6wx": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9nm6wx/",
      "text": "I'm sorry you're going through this. ",
      "author": "OperaRiot",
      "created": 1478396254,
      "upvotes": 4,
      "replies": {}
    },
    "d9oabvp": {
      "link": "/r/AskAcademia/comments/5b96sy/final_update_my_departmental_group_scheduled_a/d9oabvp/",
      "text": "I'm so sorry to hear this happen to you. It's terrible not to feel safe at a place you go to every day. The bureaucracy of the school may mean that this takes a long time, or it takes a lot of fighting to get them to recognize this issue. You are very strong and so far, you haven't given up in the face of this adversity. I would hope there is someone who can recognize the danger you are in, and they can help you fix this issue.\n\nYou've done so much so far, and it's a huge burden on the victim in this case (and most cases of domestic violence, etc). Unfortunately, it's so much effort on your part just for you to be safe. Best of luck!",
      "author": "0102030405",
      "created": 1478450428,
      "upvotes": 1,
      "replies": {}
    }
  }
}