{
  "sid": "qwxpei",
  "link": "/r/AskAcademia/comments/qwxpei/job_hunt_advice_phd_filmcommunications_us/",
  "title:": "Job Hunt Advice - Ph.D. Film/Communications - U.S.",
  "text": "Hi, everyone.  First time poster.  First time Redditor, tbh.\n\nThis is my first year on the job market in academia and I'm trying to gauge how worried I need to be, what I need to expect in the coming years, and compare my situation to everyone else's.  I've lurked on this subreddit and other ones related to academia, watched YouTube videos, read statistics, and been told by faculty about how abysmally competitive and broken the hiring process has become.  Maybe foolishly, I've still waded into its waters this year.  To my eyes, it has not been going well, but that's why I'm curious to hear others' thoughts on my experience so far in relation to their's.\n\nBackground:\n\n\\-I completed my Ph.D. in Communication-Film (how it's listed on the transcript) in August 2021.\n\n\\-While finishing my dissertation this year, I was intermittently applying for positions, all of which resulted in automated rejections or radio silence.  Since graduating my sole \"job\" has been applying to academic openings at a variety of institutions.  I have applied for TT jobs at research, liberal arts, and other institutions along with full-time and adjunct pools at community colleges.  I have applied all across the United States and a few overseas openings.\n\n\\-My application materials have been looked over by former faculty advisors and peers.  They all seem to agree these documents are strong.\n\n\\-I have two published chapters in scholarly collections, a handful of conference presentations, and have taught undergraduate courses for six years (a combination of intro-level assigned classes and senior seminars that I have proposed and had approved).  I know my CV is weaker in terms of published work that others, but I have been told that is not out of the ordinary at this stage.  Though I am applying for both research and teaching positions, my dream situation would be to fill a full-time teaching-centric role at a community college or small liberal arts institute; I am far more passionate about teaching than research.\n\n\\-**Here's the major question:** Acknowledging that the 50+ applications I have completed are largely within the current hiring cycle (openings that begin in Summer or Fall of 2022), should I be worried that I have not been offered a single interview or response other than rejection emails? \n\nI read other posts about people who have submitted a similar number of applications who are also not finding work, but are at least getting interviews or some kind of reaction.  What really scares me is that none of the adjunct pools I have applied to resulted in anything; maybe ignorantly I thought I could fall back on those while continuing to send off for full-time jobs.  When I finished my Ph.D. program, I moved out of my apartment (couldn't afford it) and am currently living with some friends.  But that goodwill can only last so long and I'm terrified by the prospect of not having a job when they need me to leave.  I read that some people on here are on the market for two or three years before nabbing anything.  I would be grateful for advice from anyone who is/has been in this same position or has experience on hiring committees.",
  "author": "PhDestitute",
  "created": 1637264263,
  "updated": 1637353671,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl5tag2": {
      "link": "/r/AskAcademia/comments/qwxpei/job_hunt_advice_phd_filmcommunications_us/hl5tag2/",
      "text": "Any chance of you getting a peer-reviewed journal article out soon? We have an ongoing search and we have >3 applicants who are pretty much perfect for the job. That includes such articles (and, for some of them, books). Our current task is narrowing down who we want to invite for on campus interviews. I'm afraid to say we wouldn't be looking at your packet anymore.\n\nIn terms of adjuncts, our department chair got his PhD at an R1 in our state. The majority of adjuncts we hire are funneled to him by faculty in the program he got his doctorate from. Before I got this job, I got adjunct position offers from two sources: my doctoral advisor; faculty from my master's program institution who I'd remained in contact with. Does your advisor or other mentors have any similar connections?",
      "author": "CruxAveSpesUnica",
      "created": 1637265210,
      "upvotes": 1,
      "replies": {
        "hl6g4ax": {
          "link": "/r/AskAcademia/comments/qwxpei/job_hunt_advice_phd_filmcommunications_us/hl6g4ax/",
          "text": "Knowing that a peer-reviewed article can be the decisive factor like that is very beneficial to hear, u/CruxAveSpesUnica.  Thank you for sharing the details of your department's specific search.  Unfortunately, I don't have any journal articles in the pipeline, but advice like yours convinces me that's a step I need to be working on as I apply.\n\nHonestly, yes, I'm sure I could get some kind of adjunct or instructor work from either of my previous two universities.  For personal reasons unrelated to either department, however, I have not pursued work within either state.  If I get desperate enough, I may give in and take advantage of those pipelines.",
          "author": "PhDestitute",
          "created": 1637274357,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl5tok6": {
      "link": "/r/AskAcademia/comments/qwxpei/job_hunt_advice_phd_filmcommunications_us/hl5tok6/",
      "text": "If they are for summer 2022, I wouldn’t be too worried. Many schools interview in Feb thru May.",
      "author": "Selvadoc",
      "created": 1637265365,
      "upvotes": 1,
      "replies": {
        "hl6g8yn": {
          "link": "/r/AskAcademia/comments/qwxpei/job_hunt_advice_phd_filmcommunications_us/hl6g8yn/",
          "text": "Thanks, u/Selvadoc!  Appreciate the reassurance!",
          "author": "PhDestitute",
          "created": 1637274410,
          "upvotes": 1,
          "replies": {
            "hl6gke0": {
              "link": "/r/AskAcademia/comments/qwxpei/job_hunt_advice_phd_filmcommunications_us/hl6gke0/",
              "text": "Sure! I totally understand.",
              "author": "Selvadoc",
              "created": 1637274539,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}