{
  "sid": "gr5qpd",
  "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/",
  "title:": "Do professors view students interviewing them as an inconvenience?",
  "text": "TL;DR- Will professors view me asking to interview them about their career as an inconvenience?\n\nI am doing a project that requires me to reach out to contacts all around my academic field and interview them regarding their career.  However, when I reached out to some of my professors, most were willing to provide me contacts from their networks, but one came back and said that he discourages me from interviewing people within the field.  He said that often times professors or other professionals view students asking to interview them as an inconvenience.  Is this a common consensus? I feel discouraged to continue with this project now because of this.",
  "author": "ecastro86",
  "created": 1590527430,
  "updated": 1634082356,
  "over_18": false,
  "upvotes": 93,
  "upvote_ratio": 0.96,
  "comments": {
    "frwu6hn": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frwu6hn/",
      "text": "It is only ever been an inconvenience to me when it has been requested last minute (asked the day before the deadline) or requested as I’m entering/leaving the lecture hall. I think that if you make an office appointment and ask politely you’ll have no problem.",
      "author": "matthuntgardner",
      "created": 1590527644,
      "upvotes": 171,
      "replies": {
        "frxesp7": {
          "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxesp7/",
          "text": "What he said. \nOther than that, and even then—I’m happy to.",
          "author": "casanovish",
          "created": 1590538510,
          "upvotes": 38,
          "replies": {}
        },
        "fry4b0k": {
          "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/fry4b0k/",
          "text": "I'll add that it is also preferable that you have a plan for what to talk about in your interview.",
          "author": "prof-comm",
          "created": 1590554141,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "frx1xqy": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frx1xqy/",
      "text": "Poorly thought out, meandering requests with 25 questions? Yes.\nA handful of carefully thought-out, tightly delimited questions. No",
      "author": "ocherthulu",
      "created": 1590531558,
      "upvotes": 101,
      "replies": {
        "frxyexu": {
          "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxyexu/",
          "text": "This needs to be the top comment.",
          "author": null,
          "created": 1590550131,
          "upvotes": 2,
          "replies": {
            "fryekes": {
              "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/fryekes/",
              "text": "If only reddit had a mechanism to decide that...a system of votes, perhaps",
              "author": "respeckKnuckles",
              "created": 1590562299,
              "upvotes": 21,
              "replies": {}
            }
          }
        }
      }
    },
    "frwvroo": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frwvroo/",
      "text": "Inconvenient, yes, in the sense that it’s not something most professors are eager to do. But a lot of us are willing to do it anyway. There is nothing wrong with asking—just be polite, explain your reasoning, and don’t take it personally if they don’t agree to it or don’t respond. If they do give you an interview, make sure to follow up with them afterwards; say thank you, and let them know how your project went and how they helped you.",
      "author": "SirDudelington",
      "created": 1590528436,
      "upvotes": 88,
      "replies": {}
    },
    "frwuyev": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frwuyev/",
      "text": "I think it depends. If you're asking to talk about their career because you're interested in how they got to where they were, and what advice they might have for someone in your position, I think most people are willing to do it.\n\nIf you're asking to interview them because of a class project that requires you to do so, you're less likely to get a response. And honestly I get really annoyed when other faculty make \"go find someone in your field and interview them\" a requirement -- it's a waste of time all around.\n\nOverall, it depends on how you approach it and why you want an interview. You're also more likely to get a response if it is someone you know or is at your university, or is someone you were put in touch with, rather than a cold email. Speaking for myself, I'd be very unlikely to respond to a cold email (from a student) asking to interview me.",
      "author": "Galactica13x",
      "created": 1590528024,
      "upvotes": 46,
      "replies": {}
    },
    "frxi694": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxi694/",
      "text": "Trust me, we won't let you inconvenience us. Professors are very well-practiced at saying no and protecting our time.\n\nJust be polite, respectful, and flexible when you ask. Bone up on their research and history and show you know a bit about them as an individual and say why you want to talk to them. Make it clear you will come to them and at their convenience. Allow them a polite and easy way to say no, and you'll be fine.",
      "author": "survivalothefittest",
      "created": 1590540430,
      "upvotes": 21,
      "replies": {}
    },
    "frx68jl": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frx68jl/",
      "text": "I get asked to interview people in the field for a lot of classes in my grad program. I always feel like it’s unfair to ask students to ask people to do that for free and unfair to expect that there’s any number of people out there willing to be interviewed for free. They aren’t getting anything out of it. I had one prof stipulate that we couldn’t interview anyone at our own institution because they were too busy. Apparently they aren’t busy at other universities?",
      "author": null,
      "created": 1590533802,
      "upvotes": 16,
      "replies": {}
    },
    "frxh6a1": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxh6a1/",
      "text": "I am currently a PhD student and had to do this for an assignment in one of my doctoral classes. \n\nI’d say be very careful about how you word the request. I emailed a request detailing what I was doing and why and how long it might take. Some other things to consider: Does the project involve some positive aspect of them you want to learn more about? If so state that. Does it interest you outside of the project at all? If so Mention that. \nFor example, I had to interview a leader (in their field) about their leadership style, and I used the assignment as a chance to understand why I might enjoy working with the people I asked. \nI’d also be very clear how long you’d think this would take when asking and that you are flexible to their schedule. \nOn the day I also recommend being well prepared and professional. \n\nJust the two cents of an experimental psychologist turned evaluator",
      "author": "PenguinFeather4",
      "created": 1590539863,
      "upvotes": 10,
      "replies": {}
    },
    "frxg7ex": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxg7ex/",
      "text": "I love been interviewed by students. I really do.",
      "author": "ThatProfessor3301",
      "created": 1590539313,
      "upvotes": 9,
      "replies": {}
    },
    "fryjdtu": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/fryjdtu/",
      "text": "I can't emphasize enough the extent to which a load of professors will be up for talking about themselves for an hour.",
      "author": "dl064",
      "created": 1590566698,
      "upvotes": 10,
      "replies": {}
    },
    "frx7l9l": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frx7l9l/",
      "text": "I would only be annoyed if the student gave me short notice, was unreasonable about scheduling, or was ill-prepared with questions.",
      "author": "lh123456789",
      "created": 1590534529,
      "upvotes": 8,
      "replies": {}
    },
    "frxhx1d": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxhx1d/",
      "text": "Some will, some won’t.  Wont know which is which until you ask.",
      "author": "VeblenWasRight",
      "created": 1590540285,
      "upvotes": 5,
      "replies": {}
    },
    "fryga7z": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/fryga7z/",
      "text": "Be open and honest when you reach out, provide time and be understanding if they decline. Perhaps more important: show real interest, don't interview in a way that makes it seem like you are just checking boxes off for an assignment (even if that is all you are doing). Find a way to make it worthwhile for *you*, to learn things that you would like to know about working in various fields related to your own.\n\nSome people will find it inconvenient; that is true of anything though. Fact is, professor's are there for students. Students are why they have jobs. Some may hate teaching (which bothers the hell out of me) and instead only care about their research, thus minimizing interactions with students based on their own personality. There are a good number of academics that fit this 'model' but more that don't - thankfully. \n\nAny professor who blows you off or, worse, tells you that you are being rude or inconveniencing educators for working on your educations - then *they are the problem*. That professor sounds like someone who shouldn't be a professor, based on what little you've said.\n\nAs long as you aren't pushy, show interest, and allow them time I think most will be happy to talk with you.",
      "author": "Euthyphraud",
      "created": 1590563802,
      "upvotes": 5,
      "replies": {}
    },
    "frxkf1i": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxkf1i/",
      "text": "I don't. I enjoy when I get to talk about the story of how I got where I am, as it was a bit non traditional from the jump. Granted, in the OT field, there isn't much interviewing of professors, but I always enjoy it when it does happen. I even enjoy when grads/alumni reach out when they are done and working to share a moment or ask if what they are feeling is normal.",
      "author": "ItsKKYall",
      "created": 1590541708,
      "upvotes": 4,
      "replies": {}
    },
    "frxvfhr": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxvfhr/",
      "text": "We're used to it. For several years running our incoming freshmen were required to interview a faculty member that wasn't teaching any of their classes as part of their first year experience class. I usually enjoyed those conversations. As long as you make an appointment in advance it wouldn't be an issue. Pretty much everyone on my campus does it multiple times each fall.",
      "author": "SnowblindAlbino",
      "created": 1590548260,
      "upvotes": 4,
      "replies": {}
    },
    "frxzl8e": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxzl8e/",
      "text": "Most people enjoy talking about themselves. In my experience faculty also enjoy speaking about their work/projects/career. Most are in the field they are in because they are passionate about it. Talking about it lets them nerd out with you.",
      "author": "99kedders",
      "created": 1590550888,
      "upvotes": 4,
      "replies": {}
    },
    "frzc9hi": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frzc9hi/",
      "text": "I run a podcast that involves interviewing medical professors. After \\~54 episodes,  \\~46% of people I sent cold email invites ended up accepting. The rest either didn't respond or weren't able to schedule it. \n\n&#x200B;\n\nI'd say shoot your shot!",
      "author": "RNARNARNA",
      "created": 1590589605,
      "upvotes": 4,
      "replies": {}
    },
    "frxoyyj": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxoyyj/",
      "text": "Give them enough of a heads up and be nice about it.\n\nI often host Q and A sessions for students and need lots of profs to be present. I found this is a great way for profs to engage w students outside of class and new profs particularly are eager bc they want to be better known w students (more students in their class + better reviews)",
      "author": null,
      "created": 1590544353,
      "upvotes": 3,
      "replies": {}
    },
    "frxy9dh": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frxy9dh/",
      "text": "No. I mean, it’s time out of their busy day so make it easy for them and come prepared, but unless they’re a jerk researchers are generally quite pleased to talk about what they do. We don’t get to do it very much with people who aren’t members of the research group.",
      "author": "TakeOffYourMask",
      "created": 1590550030,
      "upvotes": 3,
      "replies": {}
    },
    "fry06bo": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/fry06bo/",
      "text": "It's fine as long as you don't request for it to occur during the first week or finals week. Those are our hell weeks (at least they are for me)!",
      "author": "LVMom",
      "created": 1590551275,
      "upvotes": 3,
      "replies": {
        "frzn0r7": {
          "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frzn0r7/",
          "text": "Very true, fortunately these sorts of assignments rarely fall during those times (at my university you can't give any assignments during 'dead week' or finals week). And no one is going to be prepared to practice interview techniques after only a week or two - from my experience, this seems to happen mid-semester, when courses on polling, interviewing and qualitative methodology begin having students put it into practice.",
          "author": "Euthyphraud",
          "created": 1590595043,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fry3ghb": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/fry3ghb/",
      "text": "[deleted]",
      "author": null,
      "created": 1590553542,
      "upvotes": 3,
      "replies": {
        "frzmr0b": {
          "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frzmr0b/",
          "text": "We had research and polling methods courses where students had to develop interview questions, proper polling questions, etc. in order to understand how different forms of data can be collected, used, etc. You may politely decline, but the idea that you are going to go to another professor and tell them to stop giving them assignments that you don't like is... incredible. You know, a lot of Americans now work 70, 80 hour weeks. The life of a professor isn't too bad. If you can't make time for students, then you shouldn't be working with students at all. Graduate courses that teach interview techniques also often have assignments like this; it is critical for social science grad students (as an example) to understand how to interview, how to take notes, how to properly quote and attribute, how to transcribe, etc. Skills which are essential in political science and sociology. I'm sorry you work 50 - 60 hours a week. \n\nIf that is because you are doing more than most professors, perhaps overseeing an extracurricular club (as most universities require a faculty member to have an official 'club') - or if it is because you are doing a 4/4 teaching regimen like most professors at liberal arts institutions - then bully for you, politely decline and explain that you are simply too busy. You have zero right to tell another professor how to teach or what assignments are beneficial *for the students* \\- it isn't *about you* \\- it is about educating the students at your institution. Unfortunately, the attitude you present is exactly what is wrong with many professors who have lost sight of their educational mission and think the world revolves around their research (and, 99% of the time, I'm sorry to say - no one cares about your research except a handful of people doing the same thing - very little research, particularly in social sciences, actually affects policy outcomes or the like - admittedly, this is field dependent). Do you have office hours? Perfect time for students to have 20 minutes to sit down and ask you questions about what it is you do, how you go about it, why you are passionate about it, why you think other students should be too - instead you want to act like you know better than 'whoever is making these assignments'.\n\nI don't know why, and I really don't mean to sound offensive, but I found your comment rather disturbing - and one I've seen among a subset of professors at Purdue. They tend to be those that don't get along with other faculty members and who are rarely chosen to join dissertation committees (or refuse to). \n\nI've know professors who would barely speak to undergraduates, but would with grad students. Fact is, just like with people generally, some professors are just assholes who don't give a damn about students. They shouldn't be teaching, they shouldn't be within academia (aside from those focused on lab research in the natural sciences). If you find students inconvenient, and you are a professor, it really sounds like the problem is you - and a lack of passion for your profession and a total lack of respect for students and faculty members who teach in a way you don't like.",
          "author": "Euthyphraud",
          "created": 1590594910,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "frybdi1": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frybdi1/",
      "text": "I don't know that I've found them to be inconvenient, so much as sometimes as waste of time. As someone else already noted, if it's a student just going through the motions for a class requirement, that is not good. But it doesn't sound like you're in that situation.\n\nI would say, first off, ask via email. It's easy enough to turn down those requests if someone is too busy.\n\nThink through your questions carefully. Avoid any that have factual answers that you could look up on your own. Use questions that can only be answered by the individual being interviewed. End with an open-ended question to allow the interviewee to tell you about anything else that seems important or relevant.\n\nAnd don't ask how much money they make. That is rude. (I'm sure you know that already. But I'm still smh twenty years later after being asked that in a student interview.)",
      "author": "Violet_Plum_Tea",
      "created": 1590559599,
      "upvotes": 3,
      "replies": {
        "frznclm": {
          "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frznclm/",
          "text": "Good points - and thanks you for mentioning that it is really bad form to look like you are just going through the motions. Some students are going to do that, no matter what - and that's ok. A bit annoying, but it is what it is. Others are really going to take it seriously, and ask good questions (sometimes really good ones that might even get you thinking!). \n\nAnd yes, I agree about the money question. Many universities already publish the salaries of all faculty members so if that is something they need to know, it is easy to find. Otherwise, it should be included in a list of things you 'do not ask' similar to those lists they hand out to faculty everytime they have to go through the hiring process.",
          "author": "Euthyphraud",
          "created": 1590595203,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "frz3gps": {
      "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frz3gps/",
      "text": "The \"from their networks\" and \"other professionals\" make me think that you're not talking about interviewing your profs or profs at your school, but instead are talking about interviewing people you have no connection to and people who aren't necessarily profs at all?\n\nSo, dealing with this for students who are or have been in my classes is absolutely part of the job and I'm happy to help.\n\nDoing an interview with some other student at the university is only marginally part of the job... I'll still do it, but I'll probably think bad thoughts about whoever's demanding their students do this because the students are clearly just filling squares.\n\nDoing an interview with a student at some other school somewhere?  Where I really don't know them from Adam's housecat and the only reason they're bothering me is that one of their profs, who they could be interviewing instead, mentioned me?  Not my job, not my circus, not my monkeys.  Probably I'd still do this but whoever referred me owes me a damn beer.",
      "author": "smapdiagesix",
      "created": 1590584514,
      "upvotes": 3,
      "replies": {
        "frzoikg": {
          "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/frzoikg/",
          "text": "I do understand the distaste for the students who are just checking boxes, but that doesn't mean the assignment itself is bad. Hopefully, those students grades reflect their lack of enthusiasm. Any class is going to have its lazy students who don't care, and it's ambitious students who are fascinated by everything. Some are going to enjoy and get into these assignments, others aren't. However, for many fields understanding proper interview techniques is absolutely critical (this is especially true for graduate students in social sciences and history). Our political science graduate course on qualitative methodology involved two assignments involving interviews - one with a professor or other profession, one with a student - each on a different topic, and the assignments were very rigorous. Most everyone took it very seriously (you will have fewer undergrads take this sort of thing seriously, but anyone going into media studies, journalism, communication, polling, campaigning, etc. needs training *and practice* in proper interview techniques. \n\nThere is often too much self-segregation among different fields, and this has led to a widespread attitude that professors only need to give attention to students majoring in their field - perhaps minoring. I find this a rather insulting viewpoint, and one that undermines the gains we're finally making in promoting interdisciplinary studies. Part of the idea with some of these assignments is *precisely to interview someone from a field you know nothing about*  \\- this is really helpful when learning how to interview and if you are going to, for example, ever do field research for a dissertation then you need to know how to do this - it is critical training. Professors should be there for students - if I ever had a student reach out from a totally different field I always entertained it, so long as they could meet during office hours. I have always felt that education, that teaching - that is the real job of professors; research has become too dominant and universities are losing sight of students in some cases.\n\nThis is one reason why so much education had already begun moving online before the pandemic, which has exacerbated it (I read an article a few days ago suggesting that roughly 40% of adults who were in lockdown in the US took online courses during that time - hell, my husband actually got a TEFL certification during the lockdown). The kind of 'my research is my work, teaching is just what I have to do in order to be allowed to do my real work' attitude is part of what is driving students away from traditional university educations - and it is why tenure-track positions went from being a dime a dozen 15 years ago to almost impossible to find today.",
          "author": "Euthyphraud",
          "created": 1590595774,
          "upvotes": 2,
          "replies": {
            "fs01a5a": {
              "link": "/r/AskAcademia/comments/gr5qpd/do_professors_view_students_interviewing_them_as/fs01a5a/",
              "text": "I don't understand why you believe you are disagreeing with me; I already stated in clear, simple English that I would do this.  I did not outline a single instance where I would refuse to do this.\n\nYou are ascribing many positions to me, at least by inference, which I have not here stated.  Please retract them.  I am not a platform for you to place a soapbox upon.",
              "author": "smapdiagesix",
              "created": 1590601917,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}