{
  "sid": "l2t8qx",
  "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/",
  "title:": "Would you look poorly on a former student who’s been out of school for one year asking for an LOR over email?",
  "text": "Applying to law school, need LORs. Would prefer to ask in person but it doesn’t seem like a good idea right now, I believe you need to test negative to be on campus. Not even sure if the professors I want to ask are even on-campus. \n\nThey’re all also very friendly and I made good marks in their classes (A- or above), even traveled out of the country with one but I’m terrified they won’t remember me. I’m pretty quiet.",
  "author": "lezzieard",
  "created": 1611338642,
  "updated": 1634081328,
  "over_18": false,
  "upvotes": 136,
  "upvote_ratio": 0.95,
  "comments": {
    "gk7p99k": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk7p99k/",
      "text": "Not at all. I have students ask me for letters years down the line. If it's someone whom I don't remember, or recall as being a poor student, I politely decline. \n\nOtherwise, I'm always happy to help out. I've certainly benefited from my former professors' kindness in the past, after all.\n\nAnyways, the worst they can say is \"I'm sorry, but I don't think I can help you.\" Nothing is lost by asking.\n\nAlso, if you traveled internationally with them, I guarantee they remember you.",
      "author": "novht",
      "created": 1611338812,
      "upvotes": 164,
      "replies": {
        "gk96ucu": {
          "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk96ucu/",
          "text": ">If it's someone whom I don't remember\n\nMaybe I'm OK with crossing some ethical boundary I don't know exists, but why can't you just BS your way through a LOR? I mean sure, if you can't remember if they were a good student or not that's reasonable but otherwise I think a generic letter of praise is good enough.",
          "author": "Hardcore90skid",
          "created": 1611356263,
          "upvotes": 9,
          "replies": {
            "gk9aqse": {
              "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk9aqse/",
              "text": "I mean, in a real pinch I'm fine with that. But depending on what the letter is for and who's reading it, a generic one is going to be pretty easy to see through, and isn't going to do the applicant any real favors.\n\nIn my experience, it's necessary to be able to say something somewhat specific about the applicant, since almost everyone can find 3 people to write them *something.* One could, of course, just totally fabricate things, but that's a) endangering your own reputation, potentially; and b) possibly putting the applicant in a situation that they're not equipped to handle, but are on the hook financially for.",
              "author": "novht",
              "created": 1611358028,
              "upvotes": 21,
              "replies": {
                "gkduxvg": {
                  "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkduxvg/",
                  "text": "When I was a student asking for LORs, my mentors taught me to ask \"Can you write me a strong letter of rec?\"\n\nI tell this to students now.\n\"Hell yeah! I can write you a helpful letter!\"\n\"Sorry, I can't write you a strong LOR, it would be best of you to ask others for a strong letter\"",
                  "author": "epigeneticjoe",
                  "created": 1611414802,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gk9ukb5": {
              "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk9ukb5/",
              "text": ">why can't you just BS your way through a LOR? \n\nThat's a real disservice to the student IMO. In my department we write detailed, personal letters for everyone (or we decline). How is your \"I think she got a B and came to class regularly\" letter going to be weighed against someone else's that is detailed, personal, and evidence-based?",
              "author": "SnowblindAlbino",
              "created": 1611365404,
              "upvotes": 15,
              "replies": {
                "gkc962n": {
                  "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkc962n/",
                  "text": "I mean that's really great yall do that, but it is fairly rare. The norm is for a grad student to fill in a form letter with a few specific details to the student and the PIs signature.",
                  "author": null,
                  "created": 1611397893,
                  "upvotes": 1,
                  "replies": {
                    "gkdvj1z": {
                      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkdvj1z/",
                      "text": "Keep in mind that that's really field-dependent and also department-dependent. No one in my field does that, for example, and I didn't even know it was a thing until I read about it online here.",
                      "author": "pb-pretzels",
                      "created": 1611414940,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "gkg052q": {
                      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkg052q/",
                      "text": ">The norm is for a grad student to fill in a form letter with a few specific details to the student and the PIs signature.\n\nThis is an undergrad we're talking about (OP). Everyone at my school writes real LORs. We have no grad students to do the work. Granted, I'm not at an R1 but neither are most faculty in the US.",
                      "author": "SnowblindAlbino",
                      "created": 1611435460,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gka6yxm": {
              "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gka6yxm/",
              "text": "There is a difference between a somewhat generic letter (fine in a pinch) and BS-ing a letter (never a good idea).\n\nNot every student is going to leave a mindblowing impression on three professors, and that's OK. When a professor doesn't have a strong memory of the student, they can still review the student's work in the class (e.g., papers) and comment on what students learned in the class (particularly if that relates to the graduate program), noting any specific examples from reviewing the student's coursework. (It is for this reason that I keep digital copies of most of my students' papers, even years later--so that I have something to go off of when a student I haven't had in class for some time asks for a letter.) It may not have as many details or examples as some of the stronger letters I write, but I can honestly say some good things about what the student learned and the quality of their work, and sometimes a student just needs a certain number of letters.",
              "author": "jogam",
              "created": 1611369602,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gkc5xlr": {
          "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkc5xlr/",
          "text": ">recall as being a poor student\n\nMind sharing some examples?",
          "author": "runnersgo",
          "created": 1611397033,
          "upvotes": 1,
          "replies": {
            "gkdo08a": {
              "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkdo08a/",
              "text": "A student who got a poor grade because they did not complete assignments? Students whose work demonstrated no effort or engagement? \n\nI'm not sure what you're asking for here. Some students are obviously better than others, and I'd be hesitant to recommend a poor student to graduate school for a lot of reasons.",
              "author": "novht",
              "created": 1611412965,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gk7pba9": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk7pba9/",
      "text": "I don’t think this would look poorly. Couple of months ago I asked two professors for LOR. One I have not taken a class with since 2013. The other one since 2016. They were more than happy to write me an LOR .",
      "author": "gpitman1",
      "created": 1611338829,
      "upvotes": 58,
      "replies": {
        "gk7phnq": {
          "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk7phnq/",
          "text": "Thanks. I guess what I really need is a confidence boost!",
          "author": "lezzieard",
          "created": 1611338880,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "gk7q743": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk7q743/",
      "text": "Just got exactly such a request, and I was happy to tell the student yes. IMO, the whole point of LoRs is to address the aspects of a person that don't fit neatly into a checklist or transcript, so I have no particular rules or requirements for which students I will provide a letter for.",
      "author": "thisoneagain",
      "created": 1611339081,
      "upvotes": 21,
      "replies": {}
    },
    "gk7wu5x": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk7wu5x/",
      "text": "I can't speak for *every* professor as different folks will have different standards; however, **no**, I would absolutely not view this poorly. This is part of my job.",
      "author": "WrestlingStuffGuy",
      "created": 1611340989,
      "upvotes": 15,
      "replies": {}
    },
    "gk7yhqg": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk7yhqg/",
      "text": "I think the best thing you can do is provide plenty of details about what you need the letter to do for you. Give your recent resume, a description of what you are applying for, and maybe provide a copy of some work you are proud of that the prof can reference. I’’ happy to do LOR, but I hate when I get requests with no info and I have to hunt down details or write something generic.",
      "author": "drkittymow",
      "created": 1611341567,
      "upvotes": 13,
      "replies": {
        "gk881ap": {
          "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk881ap/",
          "text": "So many people forget to tell the Prof what they hope to highlight through the LOR. Your application is a story and each LOR should highlight one or two things you think are your strengths that you want shown off in the application. \n\nIf all three LORs just say how great you are academically you wasted 2 LORs.",
          "author": "entropyStable",
          "created": 1611344453,
          "upvotes": 7,
          "replies": {
            "gkimayk": {
              "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkimayk/",
              "text": "Yes! So many students are unaware of the kind of time this takes and that there is a big difference between a thoughtful LOR and a generic one I give anyone who passed.",
              "author": "drkittymow",
              "created": 1611477480,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gk9ry1a": {
          "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk9ry1a/",
          "text": "This should be the top answer.",
          "author": "mamaspike74",
          "created": 1611364507,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gk89box": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk89box/",
      "text": "Not even a little bit. You'll want to start your email with a refresher on who you are, but this is part of a professor's job and OF COURSE you ask via email in the middle of a global pandemic.",
      "author": "AgoRelative",
      "created": 1611344841,
      "upvotes": 8,
      "replies": {}
    },
    "gk8861i": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8861i/",
      "text": "No, no problem at all.  You are right there is no reason to go to campus right now so email is absolutely acceptable.  Also, the time lag is not weird at all.  It is not odd for me to get a former student asking for a letter years later.\n\nIf you are worried they don't remember you, there is nothing wrong with jogging their memory.  \"This is Lezzieard, I was in your such and such class\" and attaching your CV/resume to the request.  Also offer if they would like to discuss your request that you are open to a phone or zoom meeting. \n\nAs for being terrified, honestly, if they don't remember you, that means that would not write a good letter, so better to get back an email saying they can't write you a good letter than for them to submit something that undermines your application.",
      "author": "manova",
      "created": 1611344492,
      "upvotes": 4,
      "replies": {}
    },
    "gk8r72i": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8r72i/",
      "text": "I am personally a little confused because I would never have considered showing up in person. I certainly wouldn’t expect someone to show up looking for me in person without emailing ahead to make an appointment. Otherwise I might not even be there, even in non-pandemic times. \n\nSurely at that point the email would likely inform me what they wanted to talk about.. at which point the only reason a meeting would be necessary would be if the student wanted to discuss their application. Given this is for law school, if it isn’t law professors you are emailing there likely isn’t much input they would be able to give on that front anyway.\n\nI’m just a little confused as to why you would consider an in person meeting necessary to ask for an LOR - Covid or not.",
      "author": "wellEulerbedamned",
      "created": 1611351019,
      "upvotes": 4,
      "replies": {}
    },
    "gk8dvym": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8dvym/",
      "text": "This is perfectly appropriate to do over e-mail regardless of whether there's an ongoing pandemic.",
      "author": "pipkin42",
      "created": 1611346321,
      "upvotes": 3,
      "replies": {}
    },
    "gk8kg46": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8kg46/",
      "text": "I took over five years off between undergrad and graduate school and asked my recommenders after five years to write me letters. I sent them an email that didn't assume they'd remember me (I described myself and the classes I took with them) and then I linked a piece of writing or work that I had done for that specific class that had been evaluated well, just to jog their memory along with a copy of my CV. They responded very positively (I made it to grad school and I'm now faculty myself). I would also do this for any of my students. I think if you give them the information they need to remember you and remember that you were a good student, they'd be more than happy to write the letters!",
      "author": "Sportingnews",
      "created": 1611348741,
      "upvotes": 3,
      "replies": {}
    },
    "gk9uc6p": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk9uc6p/",
      "text": "I wrote one this week for a student who graduated in 2013. Granted, we stayed in touch via occasional emails, but it's entirely normal. I write LORs for alums all the time. One year is nothing, the vast majority of our graduates do not go straight to grad school.\n\nWhen you ask, make the request simple and direct. Then offer to provide whatever info they might need to do the job: transcript (if they can't get it online), resume, a draft of your application essay or personal statement, etc. Don't *send* that stuff until they say yes, then be sure to follow up with LSAC right away so they get the link to the form in a timely manner.",
      "author": "SnowblindAlbino",
      "created": 1611365327,
      "upvotes": 3,
      "replies": {}
    },
    "gk895xg": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk895xg/",
      "text": "As a professor and a program director I am often asked to write letters of recommendation from students who have been away from college and are applying for graduate school. You should know that you are an example of a real success from our educational institution and we are proud and happy to recommend you especially if you’ve been a good student. It means that you love the material enough to pursue a higher degree. So make those requests!!",
      "author": "sandrakaufmann",
      "created": 1611344793,
      "upvotes": 2,
      "replies": {}
    },
    "gk8fbo4": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8fbo4/",
      "text": "I just asked (through email and one Facebook message) three professors for LORs after 15 years(ish) hoping for one. All three said yes. One even had their grade book and notes still. If you’re quiet that’s ok! Don’t assume they won’t remember you. If you did well, contributed in class or attended office hours they most likely will! This was the hardest part of applying for me. Definitely ask and email is ok (there’s a pandemic!).\n\nAlso when you ask, saying something like would you be willing to write me a positive letter of recommendation. That way they’ll tell you if they can’t and if they do say no that’s better than a lack luster one (or bad).",
      "author": "TheNamelessGnome",
      "created": 1611346752,
      "upvotes": 2,
      "replies": {}
    },
    "gk8p0la": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8p0la/",
      "text": "Asked my mine 6 years after graduating and asked via email. Both said yes! Make sure to send resume and personal statement, after they’ve said yes, so they can see what you’ve been up to.",
      "author": "MPHJourney28",
      "created": 1611350416,
      "upvotes": 2,
      "replies": {}
    },
    "gk8qo4n": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8qo4n/",
      "text": "I emailed two professors 30 years down the road and they both did me a solid.",
      "author": "dali-llama",
      "created": 1611350874,
      "upvotes": 2,
      "replies": {}
    },
    "gk92ges": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk92ges/",
      "text": "I have no problem with it, but I love when students remind me who they are (\"I'm the one who sat in the front row with my sister and she brought her baby once.\" - yes, I received that email and immediately remembered). I like when they send me an essay they wrote for me, complete with my comments. Also, I like when student sends unofficial transcript and an indication of why they are applying to a certain program.\n\nYou can offer to meet with the professor via zoom. Also, if you want a guaranteed great reference, remind the professor of something clever they said that stuck with you. \n\nGood luck!",
      "author": null,
      "created": 1611354408,
      "upvotes": 2,
      "replies": {}
    },
    "gka337u": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gka337u/",
      "text": "Echoing others, it's not a problem at all; I think that professors see this all the time. I was worried like you about (my much larger) time gap and etiquette, and two days ago emailed a professor I had in 2013 who happened to run into me in 2017, about a LOR with a well-drafted and thought-out message. I graduated in 2015 so I've been out of school for nearly 6 years besides two cc courses last Fall and a hodge-podge of related experience. She remembered me, my final paper, bumping into me later on, and accepted my request and asked for a follow-up email of pertinent information. Offering to send a detailed second email or a zoom meeting if they're willing to write for you, and allowing them to choose what works best for them is a good idea.",
      "author": "Dracula_Margarita",
      "created": 1611368183,
      "upvotes": 2,
      "replies": {}
    },
    "gkaro6c": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkaro6c/",
      "text": "Happens all the time.",
      "author": "mbfunke",
      "created": 1611378048,
      "upvotes": 2,
      "replies": {}
    },
    "gkb3lz4": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkb3lz4/",
      "text": "I would absolutely not look down on a student out of school for a year. Life throws all kinds of curve balls--especially now! Consistency (in terms of grades & career trajectory) & perseverance (in the face of adversity) mean more to me than just smooth sailing because life someone's life has been frictionless. I can promise you, with your strong grades, & with being quiet, your prof absolutely remembers you. You were one of their best, most unburdensome students, & they would likely be pleased to write you a letter. Please keep this in mind: much lower graded--& very poorly behaving--students have no worries about asking for letters. Please do ask for your letter & aim for what's in your heart.",
      "author": "Nothingknew666",
      "created": 1611382647,
      "upvotes": 2,
      "replies": {}
    },
    "gk87bu6": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk87bu6/",
      "text": "You should definitely email them to ask.  \n\nIf you had any distinctive views or topics you focused on within the class you can mention them in the emails to jump start their memory, for example maybe you were a Keynesian if it was an economics class. \n\nAlso include a link to your linkedin with a recent photo of you incase they remember your face but not your name.",
      "author": "entropyStable",
      "created": 1611344240,
      "upvotes": 1,
      "replies": {}
    },
    "gk88jqu": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk88jqu/",
      "text": "Not at all. A year is reallly not that long, and there's really no point in physically coming to campus to ask (let alone during a pandemic).",
      "author": "badskeleton",
      "created": 1611344607,
      "upvotes": 1,
      "replies": {}
    },
    "gk89a0p": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk89a0p/",
      "text": "I did the same last year when applying because I now live in a different country than my alma mater. I don’t (didn’t) think is would look poorly in a regular situation and I assume that it is expected now due to COVID. \n\nHowever, as someone who also asked a couple years out of school, keep in mind that some may say no especially if you weren’t a stand out. I asked 4 profs who I got A/A- with, one politely declined because they did not remember me, another said yes in case I needed one but advised me against using his because he didn’t remember me and would use a template, and the other 2 remembered me well and agreed (only needed 2 for the program).",
      "author": "4s6flx",
      "created": 1611344827,
      "upvotes": 1,
      "replies": {}
    },
    "gk8bpa5": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8bpa5/",
      "text": "I’m sure most professors don’t do this but my PI who I’ve worked with for 3 years writes little notes to herself about students that she has a close relationship with and assumes will ask her for a LOR. She says it helps her have specific details to include even if they haven’t worked in her lab for a little bit.",
      "author": "Unlucky_Zone",
      "created": 1611345655,
      "upvotes": 1,
      "replies": {}
    },
    "gk8g6by": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8g6by/",
      "text": "I would definitely welcome an email from a former student asking a LOR, esp if that student had been a good student and esp if I had traveled out of country with the student!! Send your prof a nice letter with a request, remind them which classes you attended, and where you traveled with them. They will remember.",
      "author": "CrankyReviewerTwo",
      "created": 1611347007,
      "upvotes": 1,
      "replies": {}
    },
    "gk8k8eg": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8k8eg/",
      "text": "Nope, not at all",
      "author": "Mtt76812",
      "created": 1611348645,
      "upvotes": 1,
      "replies": {}
    },
    "gk8l6h3": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk8l6h3/",
      "text": "I don’t think it would be looked upon poorly at all! I think it would be rare to find people who asked for LOR in person unless they’re currently still working with/for the letter writer.",
      "author": "Froggy101_Scranton",
      "created": 1611349067,
      "upvotes": 1,
      "replies": {}
    },
    "gk9aks4": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk9aks4/",
      "text": "One of my best LORs was from the director of my Master's program from 3 years ago! If you're nervous about them remembering you, you can include a list of your accomplishments in the class as a reminder, e.g. \"I was hoping you could speak to my ability to collaborate, as I did in project X\" or \"As you may recall, this class was my first foray into subject Y - here is a link to my slides from that presentation.\" It's also a great opportunity to reconnect and ask them how they're doing. Also, maybe take some time to mention why you're applying to this new program (\"Inspired by my experiences in your class on topic Z, I'm excited to join this research lab were we will be studying Z-adjacent topic\"",
      "author": "gardenfractals",
      "created": 1611357953,
      "upvotes": 1,
      "replies": {}
    },
    "gk9exhb": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk9exhb/",
      "text": "Nope. I got a letter from a prof I hadn’t seen in 6 years and was accepted to my top choice.",
      "author": "isaac-get-the-golem",
      "created": 1611359784,
      "upvotes": 1,
      "replies": {}
    },
    "gk9k2us": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gk9k2us/",
      "text": "From the faculty side, what I'm looking for is someone who did well - chances are good I would remember them, or would after looking at records for the terms you studied with them. I'd be specific about when/what you took.\n\nI agree with one of the other comments - if you did study abroad with them, they'll remember you.\n\nDon't be shy about asking - it's part of our job to write recommendations for students, and every professor I know enjoys hearing from students who did well and would like one.",
      "author": "rosmarinaus",
      "created": 1611361750,
      "upvotes": 1,
      "replies": {}
    },
    "gka39es": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gka39es/",
      "text": "Almost all of my recent letter requests from students have been by email. Even pre-covid, it's pretty common.",
      "author": "bschoolprof_mookie",
      "created": 1611368243,
      "upvotes": 1,
      "replies": {}
    },
    "gkag8gw": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkag8gw/",
      "text": "Not a professor, but as far as I know, not in the slightest. To make sure the professor remembers you, don’t be afraid to attach copies of work you submitted in their classes, along with an academic resume. It would also help them speak better of your strengths in their LOR.",
      "author": "spacenb",
      "created": 1611373881,
      "upvotes": 1,
      "replies": {}
    },
    "gkaw19z": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkaw19z/",
      "text": "I'm in a super similar boat! Graduated last May and am now applying to grad schools (not in the US, so their deadlines are different than here). I sure hope they remember me, but I'm waiting to ask them until I can send my finished personal statement to them to remind them about me (just in case).",
      "author": "Calligraphee",
      "created": 1611379665,
      "upvotes": 1,
      "replies": {}
    },
    "gkbyphs": {
      "link": "/r/AskAcademia/comments/l2t8qx/would_you_look_poorly_on_a_former_student_whos/gkbyphs/",
      "text": "It’s perfectly normal to ask over e-mail as long you are polite and professional.",
      "author": "debacchatio",
      "created": 1611394675,
      "upvotes": 1,
      "replies": {}
    }
  }
}