{
  "sid": "l02phh",
  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/",
  "title:": "Stigma of wanting to be fairly paid for work",
  "text": "// cue rant //\n\nI'm tired of being looked down on for wanting to be compensated for my work. It's happened to me multiple times, during Masters and PhD.  I'm in the last year of my PhD and have maybe two months of downtime while I wait for things to progress through review, and I'm ahead of schedule so my weeks are a bit more mellow moving forward. So I've been looking to pick up some side hustle to earn a bit of extra income and reached out to one of my committee members (not my main adviser) who I know is short staffed to see if he wanted some temporary help.\n\nWe met. I was pretty clear upfront that I was looking for a part time \\*job.\\* Conversation went something like, \"Oh, well if it's important to you to be paid then I guess we'll have to look into that. If you insist...\"\n\nWhat? Of course it's important to me to be paid. Do you work for free? This is clearly supplemental above and beyond my stipend-related responsibilities, and I'm under no obligation to work extra for you. Especially because this project is basically writing donor reports and has no meaningful scientific outputs to advance my career.\n\nI'm tired of this culture of self-punishment that romanticizes graduate students working 60+ hours weeks for barely livable wages, as if intellectual passion should be sufficient to make rent and put food on the table. Yes, being paid is important to me. It's by no means the only thing that's important to me, and I take pride in doing intellectually rigorous work, but come on.\n\nPhD stipends at my university are less than what is considered \"livable\" wage for my area. I've done things like defer dental care out of income concerns. I budget carefully to make ends meet. I would love to buy a house one day, but right now saving for a down payment is not feasible, and I'll be well into my thirties before home ownership is realistic. Am I supposed to feel grateful and indebted to the university to provide free labor, all because the basic stipend is a generous minimum wage for only 9 months a year? I'm so over being made to feel like I'm whoring myself out by asking to receive an income, especially by out of touch faculty and administrators who make 5-6 times my salary.\n\n// end rant //\n\nEspecially as many universities are contemplating or enacting budget cuts in response to COVID, I would really love if there was more recognition and dialogue around the fact that many (most?) graduate students are struggling financially.\n\nEdit: To the folks making comments to the effect of \"supply and demand.\" Yeah, I get how that works. I'm not a moron. I know I'm \"replaceable\" and will likely only be paid in this case because I have a valuable skill set and there is a shortage of incoming staff due to Covid. Just because it's true doesn't make it right. I'm in the US, and it's clear how we (don't) value education and worker rights. Should the cost of education be serious and lasting financial hardship? Maybe you think yes because it's \"my choice\" to pursue education. That's your prerogative. I disagree. Plenty of other countries have legislation to protect people when capitalism becomes exploitative.",
  "author": "heythereanydaythere",
  "created": 1611000807,
  "updated": 1634080077,
  "over_18": false,
  "upvotes": 542,
  "upvote_ratio": 0.97,
  "comments": {
    "gjrbo36": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrbo36/",
      "text": "I really don’t know how universities get away with it. For my stipend I officially work 20 hours a week so they can say I’m paid $20 an hour. If I worked 20 hours a week I’d be kicked out my PhD program within a month. We’re paid $18,000 (USD) a year but required fees are $2,500 plus it’s $500 to park on campus. Based on my pay it’s about $2,300 a year in income taxes. So after taxes, fees and parking I’m left with $13,100 to live off of for an entire year. It’s not a livable income and I hate that nobody who has the power to change stipend amounts seems to care.",
      "author": "HMHype",
      "created": 1611004079,
      "upvotes": 276,
      "replies": {
        "gjrhi6p": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrhi6p/",
          "text": "PREACH. Worked an adjunct faculty side job teaching labs at a local private college all through the PhD to make ends meet. Advisor was like “oh I didn’t know you wanted to teach, here let me put you on TA.” Expected me to quit the adjunct job, HELL NO. Then I had double the grading, and research obligations. Wtf.",
          "author": "drelizabethsparrow",
          "created": 1611006971,
          "upvotes": 74,
          "replies": {
            "gjryubx": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjryubx/",
              "text": "Could you not be honest and say you’re doing it to make enough money to pay bills and eat food?  I feel like these people should understand that by now given the amount of people they’ve mentored. I assume things were different back in their days of PhD study when the minimum wage was closer to what was needed to live comfortably.",
              "author": "bones12332",
              "created": 1611016095,
              "upvotes": 39,
              "replies": {}
            }
          }
        },
        "gjs3wad": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjs3wad/",
          "text": "I literally turned down the one program I got into last year for this specific reason! I was somehow expected to live off less than $10k per year (after course fees and taxes) which is not doable. Everyone acted like I was passing up some amazing opportunity and I was like what the amazing opportunity to go $50-100k in debt that I will never be able to escape from?",
          "author": "squirrel8296",
          "created": 1611018879,
          "upvotes": 19,
          "replies": {}
        },
        "gjrr0hl": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrr0hl/",
          "text": "What makes me even angrier is that the same faculty saying, \"Well, you can find $10 for a six pack of beer\" or \"You manage to buy coffee, don't you?\" (as if that's at all comparable to rent, fees, etc.) will then compare your work and progress to people at MIT, Yale, or other top tier programs in the field.\n\nImho, it all comes from a place of privilege with the older faculty. They got their degree from _______ 25-50 years ago and $10k was just fine for them, so why can't you live off of $18k? And simultaneously they think it's justified to pay you lower because you didn't get into such programs.\n\nThat said, I think this is symptomatic of the larger culture in the US. Longer hours, lower benefits, harsher treatment, and cuts to grant funding have been the strategy ever since the boomers took over.",
          "author": "DrSpacecasePhD",
          "created": 1611011848,
          "upvotes": 93,
          "replies": {
            "gjsgc1l": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsgc1l/",
              "text": "[deleted]",
              "author": null,
              "created": 1611025377,
              "upvotes": 68,
              "replies": {
                "gjv2ans": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv2ans/",
                  "text": "It's ridiculous! And in our case, we weren't even at the pub. We we're drinking beers out of a cooler at the weekly grad student social for $1.50-$2 a piece. The disconnect is surreal.\n\nIt's sad that in a few decades we went from an image of grad-students \"roughing it\" by eating takeout pizza and drinking beer, to them being entitled if they expect the same thing today.",
                  "author": "DrSpacecasePhD",
                  "created": 1611084718,
                  "upvotes": 4,
                  "replies": {
                    "gjv2bnp": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv2bnp/",
                      "text": "Beep. Boop. I'm a robot.\nHere's a copy of \n\n###[Roughing It]( https://snewd.com/ebooks/roughing-it/)\n\nWas I a good bot? | [info](https://www.reddit.com/user/Reddit-Book-Bot/) | [More Books](https://old.reddit.com/user/Reddit-Book-Bot/comments/i15x1d/full_list_of_books_and_commands/)",
                      "author": "Reddit-Book-Bot",
                      "created": 1611084731,
                      "upvotes": 2,
                      "replies": {
                        "gjv2kui": {
                          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv2kui/",
                          "text": "You're off the mark, but I do appreciate the Mark Twain reference, bot.",
                          "author": "DrSpacecasePhD",
                          "created": 1611084848,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gjruuh3": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjruuh3/",
              "text": "Yes! \"If you cut down on buying a coffee everyday you'd save so much\"\n\n1) I don't buy coffee every day, only boomers can afford that kind of luxury.\n2) even if I did, let's say $5/day, working 5 days a week for 40 weeks = $1,000 saved in a year\n$1,000 being approximately equivalent to my rent for  a few weeks max, and all it cost me was sacrificing one of the only small pleasures I had left.",
              "author": "Philieselphy",
              "created": 1611013904,
              "upvotes": 71,
              "replies": {}
            },
            "gjrz2ti": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrz2ti/",
              "text": "I got my degree that long ago and it’s more than the degree timing that makes them so privileged. They are just entitled people who either had external support and/or cannot equate their struggles with the struggles of others.\n\nGood luck and enjoy your coffee and beer, you’re only young once so don’t waste it chasing someone else’s waterfalls!",
              "author": "Lamalaju",
              "created": 1611016223,
              "upvotes": 33,
              "replies": {
                "gjv2w9w": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv2w9w/",
                  "text": "Thanks, and don't worry! I made it out and have a great supportive boss in my postdoc now. Good luck to all the rest of you out there and heed this guy's words! It really is tough, and remember to go easy on yourself whatever path you choose to follow.",
                  "author": "DrSpacecasePhD",
                  "created": 1611084993,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gjtc9tk": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjtc9tk/",
              "text": "People should realize and allow people to have full, fulfilling loves outside of their jobs.\n\nAnd make 160 hours/month enough to live comfortably, especially as a graduate degree holder.\n\nDenmark can manage.\n\nFrance can manage.\n\nWhy can't the U.S?",
              "author": "Hoihe",
              "created": 1611048444,
              "upvotes": 8,
              "replies": {
                "gjuibzf": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjuibzf/",
                  "text": "According to the OECD, the median disposable income numbers adjusted for PPP for Americans remains close to the top of wealthy nations. Some small nations are above the US, but in every case we have States of equal or larger size that match those rare outliers.\n\nDisposable income looks at aftertax income and local cost of living of a standard basket of goods and services. Healthcare and education cost are\nincluded.",
                  "author": "rethinkingat59",
                  "created": 1611075672,
                  "upvotes": 1,
                  "replies": {
                    "gjv4vgi": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv4vgi/",
                      "text": "Question is:\n\nIs that with 160 hours maximum per month?\nIs that with holidays off, protected paid time off?\n\nThat's the key.",
                      "author": "Hoihe",
                      "created": 1611085895,
                      "upvotes": 2,
                      "replies": {
                        "gjv8hce": {
                          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv8hce/",
                          "text": "Most companies have PTO, Start with two weeks vacation that maxes out  at 5 weeks after X years of experience.   \n\n6-10 PTO days is separate and can be used for sick days or personal time in my past two companies.\n\nWhen discussing benefits in America usually the reddit talk turns to what hourly workers at retail and fast food restaurants earn, those are not great jobs, but are not the norm either.\n\nHere is an easily accessible public number of a job type where pay has to compete with the same type of private sector jobs.\n\n>According to the Office of Personnel Management (OPM) in a 2019 report, the Average Annual Base Salary (adjusted to include locality pay) for Full Time Permanent federal employees was $87,312 per year at the time of the report\n\n>All full time employees receive 10 paid holidays, 13 days of vacation per year for the first three years service, 20 days of vacation with three to 15 years of service, and 26 days after 15 years.\n\nThat is about 4 more paid national holidays than corporate jobs.\n\nhttps://www.fedsmith.com/2020/09/09/agencies-with-most-100000-federal-employees-lowest-average-salaries/",
                          "author": "rethinkingat59",
                          "created": 1611087527,
                          "upvotes": 1,
                          "replies": {
                            "gjvkd13": {
                              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjvkd13/",
                              "text": "In that case, what's the reasoning behind academics reportedly working 60 hours weeks, and in cases of this topic - paid less than high school educated people?",
                              "author": "Hoihe",
                              "created": 1611092809,
                              "upvotes": 1,
                              "replies": {
                                "gjvxe93": {
                                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjvxe93/",
                                  "text": "I assume they are not considered on the regular University staff.",
                                  "author": "rethinkingat59",
                                  "created": 1611099119,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gjroufs": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjroufs/",
          "text": "Does your stipend cover conferences, association fees, books/programs, and other thing you need? Just wondering because I've heard of very few programs that pay their people fell enough to afford all of the hidden costs of a grad program.",
          "author": "pseudodoxia",
          "created": 1611010710,
          "upvotes": 27,
          "replies": {
            "gjrpwtz": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrpwtz/",
              "text": "Conferences and association fees are covered under the grant I am on. I don’t need any books but I would have to pay for those out of pocket if I did.",
              "author": "HMHype",
              "created": 1611011268,
              "upvotes": 26,
              "replies": {}
            }
          }
        },
        "gjse5fn": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjse5fn/",
          "text": "It's disgusting how exploited graduate students are. If they're only going to pay us for 20 hours of work, then god dammit I should only have to work 20 hours. And to people saying we're \"replaceable so be grateful for what you have\", y'all can piss right off. We should all be for fair compensation and fair work hours for everyone whose labor enables those at the top of the food chain to even have their gross amount of wealth. This culture of putting your nose to the grindstone no matter what is toxic and needs to cease.",
          "author": null,
          "created": 1611024256,
          "upvotes": 24,
          "replies": {
            "gjt36i9": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjt36i9/",
              "text": "YES!!!\n\nIt's all about the contracts - a burgerflipper is a \"replaceable\" hourly job too...but no one expects them to work **for free (*****which is literally what working over your contracted time is*****)**",
              "author": "Duc_de_Magenta",
              "created": 1611040151,
              "upvotes": 10,
              "replies": {
                "gjtlb9a": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjtlb9a/",
                  "text": "The burger flipper creates a product that can be sold, a product whose value earns the money to pay the burger flipper. Graduate students, not so much.",
                  "author": "ThePhysicistIsIn",
                  "created": 1611057075,
                  "upvotes": 1,
                  "replies": {
                    "gjwu4z5": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjwu4z5/",
                      "text": "The average cost of an undergrad credit at an American 4yr public school in 2018 was ~ $325.\n\nThe college sells TA labor to undergrad students; that's the product. Sure, that's not the case with upper-level undergrad courses but the intro/non-major courses (not to mention fields with lab courses) need TAs.\n\nYou wanna talk about jobs not \"creating a product,\" how about we look at the admin jokers who spend all day invent new hoops for each other to jump through...",
                      "author": "Duc_de_Magenta",
                      "created": 1611116895,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gjufa9y": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjufa9y/",
          "text": "What the actual fuck.\n\nI just started my PhD in Belgium. I get paid a but more than 2000 euros a month, tax free. Every year I get a tiny little wage increase (like 50 euros or so, not much). \n\nAnd, as we have socialized healthcare, I don't have to think about saving money on healthcare or whatever. I can put aside a decent amount of money each month. \n\nIt's really baffling how the US keeps working. How the people are still taking this...",
          "author": "Gulmar",
          "created": 1611074290,
          "upvotes": 6,
          "replies": {}
        },
        "gjrubqr": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrubqr/",
          "text": "They get away with it because you're nothing special and they could replace you in a day. There's always someone willing and eager to take your spot - potentially for even less money.\n\nIn contrast, the guy who mows the lawn at your school is someone who is hard to replace. It's tough to find people who show up every day to do hard work groundskeeping and do a decent job of it. That's why he makes more money than you.\n\nThe real problem is the disconnect between how you view yourself and how potential employers view you. You think it's 'unfair' that they don't view you as anything special while they think you're an easily replaced commodity.\n\nIf you want to bridge this disconnect, you need to think more like potential employers and understand what they value.",
          "author": "ViskerRatio",
          "created": 1611013622,
          "upvotes": -24,
          "replies": {
            "gjsc3a1": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsc3a1/",
              "text": ">They get away with it because you're nothing special and they could replace you in a day. There's always someone willing and eager to take your spot - potentially for even less money.  \n>  \n>In contrast, the guy who mows the lawn at your school is someone who is hard to replace. It's tough to find people who show up every day to do hard work groundskeeping and do a decent job of it. That's why he makes more money than you.\n\nThe example you're citing right now is literally the difference between skilled and unskilled labor. Somehow a job that doesn't need years of technical training, education and daily grunt work (of a different kind) justifiably pays better? Not to mention that after the first few months or even a year's worth of training that a student receives, it isn't that straightforward to replace them as putting out an ad and getting someone in a few days or weeks.\n\nThe system is screwed up, simple as that. I don't know how much we as individuals can do short term to change that for the better..",
              "author": "Gee_Es10",
              "created": 1611023191,
              "upvotes": 19,
              "replies": {
                "gjsj5wt": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsj5wt/",
                  "text": "Here's the thing: if you think you're being underpaid, complaining about the 'system' is far less effective that quitting and finding a higher paying job.\n\nAfter all, you're not trapped in a company town or a slave on a plantation. You can take your skills anywhere you want. If they're so much more valuable than the pay you're receiving, you should have no problem finding someone willing to pay you more in line with what you believe you deserve.\n\nHeck, if your skills are so much more valuable than that 'unskilled' groundskeeper, why not apply for *their* job?\n\nUltimately, it doesn't matter how you much you think your skills are worth. What matters is how much your employer thinks your skills are worth. When there's a mismatch in these expectations, it's not 'unfair' - it's just a matter of you finding a better match.",
                  "author": "ViskerRatio",
                  "created": 1611026882,
                  "upvotes": -9,
                  "replies": {
                    "gjsptxv": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsptxv/",
                      "text": "You're missing a key point here: there is no competition on stipends between universities. There is no \"quit and go somewhere else for more pay\". PhD students are in effect a captive work force.",
                      "author": "Randaethyr",
                      "created": 1611030630,
                      "upvotes": 13,
                      "replies": {
                        "gjsqcij": {
                          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsqcij/",
                          "text": "Universities do not explicitly collude on stipends.\n\nNor are these the sole - or even best - source of income for graduate/PhD students. It's actually far easier to get into such a program if you've got an outside grant or employer funding.\n\nAnd, of course, you don't need that graduate/PhD program at all if you're willing to mow the lawn.",
                          "author": "ViskerRatio",
                          "created": 1611030947,
                          "upvotes": -6,
                          "replies": {}
                        }
                      }
                    },
                    "gjsqqzk": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsqqzk/",
                      "text": "Look, with all due respect, I don't know which field you're coming from but for an average PhD student to survive anywhere from 4-7 years in grad school, their pay is not (in almost all cases) what is pushing them forward everyday. There are things that money can't buy and we get that. To the OPs point however and as so many others have expressed too, that does not mean that it is fair that we spend some of the most crucial years of our lives living in squalor because of the stipends we receive. \n\nAnd yes, lots of people do quit because of not being able to make enough to take care of themselves or their families in case an emergency strikes, or heck, even pay for a sudden dental procedure that costs literally your entire stipend x5! Their intellectual curiosity and academic ambitions left on hold or sometimes, to an end.\n\nDoes that mean that some don't make it through? Sure they do. We all live within the system in different ways. Doesn't mean it's anywhere close to perfect and we've to be okay about it.",
                      "author": "Gee_Es10",
                      "created": 1611031192,
                      "upvotes": 10,
                      "replies": {
                        "gjstih1": {
                          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjstih1/",
                          "text": "No one is forcing you to pursue a grad/PhD degree. You were told the terms of the deal upfront. No one tricked you. *You chose this*.\n\nIf you didn't want to live on that money, all you had to do is just go out and get a job that paid more. Very simple.",
                          "author": "ViskerRatio",
                          "created": 1611032938,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gjrvxfq": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrvxfq/",
              "text": "I think you underestimate the cost of turnover. Yes they could easily replace me with a new PhD student if I left but even if they had great past experience it would take them months if not years to train them to completely replace me. Losing that much time on a grant costs more money than it would cost to pay me a living wage.",
              "author": "HMHype",
              "created": 1611014494,
              "upvotes": 27,
              "replies": {
                "gjrypes": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrypes/",
                  "text": "Not to mention, they can only replace you with a new PhD student (who is either brand new or hasn't been admitted to the school yet) or a current one who doesn't have a lab yet (rare). And as you said, many months training to get to your level unless they had substantial prior experience identical to yours.",
                  "author": "bacon_music_love",
                  "created": 1611016020,
                  "upvotes": 15,
                  "replies": {}
                },
                "gjs1bu5": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjs1bu5/",
                  "text": "Replacing a PhD student every day would inarguably cost money. But they don't need to replace a PhD student every day. After all, they were able to hire *you* for the wage you're getting and get years of work out of you. Your replacement would likely accept the same wages and spend the same years working for that wage.\n\nYou may be unhappy with the money you're receiving, but you still took the job and you're still doing the job. Given that there are plenty of people out there who would make the same decisions you're making, why would the university pay you more?",
                  "author": "ViskerRatio",
                  "created": 1611017468,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            },
            "gjspede": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjspede/",
              "text": "Okay Boomer.",
              "author": "Randaethyr",
              "created": 1611030370,
              "upvotes": 10,
              "replies": {}
            },
            "gjt3zmr": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjt3zmr/",
              "text": "Ok, but let's think this through. A PhD student (say a TA) is eminently less replaceable than a cashier or burgerflipper at Fast Food Megacorp (tm), right? There's a far more limited pool of candidates to be a TA in your field & fewer still when you factor in aligning research interests with the dept, etc.\n\nYet...if I strolled into my local chain of poison peddlers & they told me\n\n>You can have this job, it's 20hrs/wk - but also you'll need to work 30hrs/wk or your fired annnnnd we won't even consider paying you for those additional 10hrs/wk\n\nI would be downright livid! I would not accept those shenanigans for even a second; I doubt you would either! Even for the archetypical \"replaceable, no-skill labor\" job pretty much everyone accepts the basic idea that a freely agreed upon contract should be upheld.\n\nNow...**why is that standard not applied to graduate students???** These are young men & women working under (& getting paid according to) contracts that say they're essentially in a part-time job (usually \\~20hrs/wk) but I dare you to find an dept. where these TAs/RAs/etc actually only work their allotted time or have recourse to seek more funding if they go overtime? I get the inkling (not accusing) that you want academia to be more *capitalistic* \\- fine by me; how about we start by getting some overtime up in this bitch???",
              "author": "Duc_de_Magenta",
              "created": 1611040820,
              "upvotes": 4,
              "replies": {
                "gjtidfv": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjtidfv/",
                  "text": "But you’re not being paid for your labor. You’re doing the labor because you want a degree, and that degree requires you to run your own experiments, write your own papers, and present your own research at conferences. You benefit from that labour much more than your institution or your advisor does. In short, you’re not working for your PI, you’re working for you.\n\nThe stipend is just that - money to allow you to focus on your studies without having to also work a full time job at the same time.\n\nOnly the TA is straight up labor, and it’s fairly well paid for what it was. I got 12000$ a year from TA work (9 000$ from other sources, this was recently) for ~10 hours of work a week 8 months out of the year.",
                  "author": "ThePhysicistIsIn",
                  "created": 1611054420,
                  "upvotes": 3,
                  "replies": {
                    "gjuhyo8": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjuhyo8/",
                      "text": "Reread my comment, I was specifically talking about TAs - that was my experience in grad school.\n\nPaid us poverty-line wages despite TAs being, collectively, the backbone of the profit (no TAs no hundred-plus mandatory intro courses for undergrads)",
                      "author": "Duc_de_Magenta",
                      "created": 1611075507,
                      "upvotes": 3,
                      "replies": {
                        "gjuixm5": {
                          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjuixm5/",
                          "text": "You're saying you were working more than 20 hours a week as a TA?\n\nWhere's your union?",
                          "author": "ThePhysicistIsIn",
                          "created": 1611075946,
                          "upvotes": 1,
                          "replies": {
                            "gjukp6d": {
                              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjukp6d/",
                              "text": "Lmfao - boy, [you damn outta touch](https://www.epi.org/publication/graduate-student-employee-unions/) huh?",
                              "author": "Duc_de_Magenta",
                              "created": 1611076730,
                              "upvotes": 2,
                              "replies": {
                                "gjul2mc": {
                                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjul2mc/",
                                  "text": "What am I supposed to gather from that article? I already agree that all graduate students should be unionized. Each of my universities had a healthy graduate students union. Does yours not have one?",
                                  "author": "ThePhysicistIsIn",
                                  "created": 1611076895,
                                  "upvotes": -1,
                                  "replies": {
                                    "gjwvyfj": {
                                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjwvyfj/",
                                      "text": "Most American grad students rather clearly don't have a healthy union. I did not go to one of the small minority of school that have one.\n\nMy *point*, I suppose, is that just b/c you felt fairly compensated where-ever & whenever you went to grad school doesn't make that the norm for all or even most TAs/grads.\n\nYeah - grad work isn't the coal mines of 19th century WV. It's not the industrial backbone of modernity nor is it life-threatening work. Even still, American universities get away with disgusting levels of abuse against their workers. Workers they fundamentally require to function in the current paradigm (i.e. fleecing undergrads). When fast food & big box stores treat their unskilled labor better than universities treat their skilled labor...something's broken.",
                                      "author": "Duc_de_Magenta",
                                      "created": 1611118015,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gjtsrpj": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjtsrpj/",
                  "text": "Again, if it's such an unreasonable rate of pay, *why did you take the job*? No one is forcing you to. With a few rare exceptions, it's not a requirement for the degree.\n\nIf you think your skills are being undervalued, then just seek employment elsewhere. It's really that simple.",
                  "author": "ViskerRatio",
                  "created": 1611062674,
                  "upvotes": 0,
                  "replies": {
                    "gjujrfq": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjujrfq/",
                      "text": "Why should TAs have to quit b/c their multimillion dollar employers can't seem to count to 20? Not as if this is an issue in a single dept or single university system either; pretty universal that TAs are exploited & expected to work over contracts for no additional pay, at least from the (real) people I've spoken with & my own experiences...\n\nIt's not strictly about valuation, it's about fairness - why did we sign a contract if Edu Inc. can just do whatever they want regardless?",
                      "author": "Duc_de_Magenta",
                      "created": 1611076315,
                      "upvotes": 2,
                      "replies": {
                        "gjusz20": {
                          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjusz20/",
                          "text": "Again, *why did you take the job*? You knew what the pay was and the conditions of employment. You voluntarily chose to take that job and now you're whining because... the job lived up to exactly what you were told it would be?\n\nWhat you're expressing is a sense of overbearing entitlement. You think you should be able to do whatever you feel like doing... and get paid lavishly by others for doing it. But that's not the way the world works.",
                          "author": "ViskerRatio",
                          "created": 1611080461,
                          "upvotes": -1,
                          "replies": {
                            "gjwywoq": {
                              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjwywoq/",
                              "text": ">You voluntarily chose to take that job and now you're whining because... the job lived up to exactly what you were told it would be?\n\nI direct you back to the very top comment - they said it better than I could've:\n\n>For my stipend I officially work 20 hours a week so they can say I’m paid $20 an hour. If I worked 20 hours a week I’d be kicked out my PhD program within a month.\n\n\nThat's the norm. Was for me, was for most folks I've met in our field. You tell me how **I'm** \"entitled\" b/c I believe people should be paid what they're owed but schools who can throw millions at trendy \"initiatives\" or new complexes *aren't* entitled when they expect grads to literally work for free - b/c that's what working over 20hrs/wk on a 20hr contract is. Working for free. Everyone should feel entitled to be paid what their employer **agreed to pay in signed legal documents** - that's the basic thing grads are asking for.\n\n>You think you should be able to do whatever you feel like doing... and get paid lavishly by others for doing it.\n\nMhmm. That \"lavish\" dream of grads making above the poverty line & getting decent insurance. B/c that's what we're talking here; not \"TAs should be able to buy a house to raise a family,\" but \"would be nice to earn literally above the poverty line.\" I reckon it's pretty fair for anyone with 6+ years of education & training to feel \"entitled\" to that... Especially when the universities are rolling in more dough than ever.",
                              "author": "Duc_de_Magenta",
                              "created": 1611119958,
                              "upvotes": 1,
                              "replies": {
                                "gjwzw1e": {
                                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjwzw1e/",
                                  "text": "Again, *why don't you just quit*?\n\nHow hard is it to answer a simple question like this? You clearly believe you're being underpaid. When I believe I'm underpaid and under-appreciated at my job, I find new a job. That's what reasonable people do because endlessly whining about it accomplishes nothing.\n\nBy your actions, you are sending the message loud and clear that you do not believe you are underpaid and that are content with your working conditions.",
                                  "author": "ViskerRatio",
                                  "created": 1611120649,
                                  "upvotes": 0,
                                  "replies": {
                                    "gn8r6c2": {
                                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gn8r6c2/",
                                      "text": "You’re so right. The ultimate reason none of these grad students are willing to quit is because they believe the value of their education is worth it. True or not, that belief keeps them there.\n\nI quit a PhD program because I no longer thought the degree would be valuable. Tough to prove either way but I now make 90k and I’m a much happier person.\n\nEveryone has the option to quit and get paid more for their labor. Whining truly doesn’t do anything",
                                      "author": "kuzzy235",
                                      "created": 1613235214,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gjsfiip": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsfiip/",
              "text": "[deleted]",
              "author": null,
              "created": 1611024955,
              "upvotes": -6,
              "replies": {
                "gjskd5s": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjskd5s/",
                  "text": "It's pretty much the same reason you see young men whining about how girls always pick the 'bad boys' instead of them - they have trouble understanding it's not so much about what they offer than what she wants. If you're unwilling to provide what others want rather than provide what you'd prefer to provide, you're generally going to be disappointed in the results.",
                  "author": "ViskerRatio",
                  "created": 1611027520,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gjugqji": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjugqji/",
          "text": "[deleted]",
          "author": null,
          "created": 1611074955,
          "upvotes": -1,
          "replies": {
            "gjunk0l": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjunk0l/",
              "text": "This isn't from OP's history. This is another person.\n\nEdit after the person I responded to deleted: Yes, it wasn't from OP's history, but was from the person they were responding to history. My bad. :(\n\nRestating what was in the deleted comment: u/HMHype pays such a high tax because HMHype's spouse's income is greater than $100k/year. So no, HMHype doesn't live off of $13,100/year.\n\nTypically a person whose household income is $18,000/year would pay less than $600 in federal income tax after the $12k standard deduction.\n\nPLEASE DON'T UPVOTE MY COMMENT. THE UPVOTES BELONG TO THE DELETED COMMENT I REPLIED TO.",
              "author": "827753",
              "created": 1611077996,
              "upvotes": 1,
              "replies": {
                "gjv0bhv": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv0bhv/",
                  "text": "I file my taxes as single, I do not file joint taxes. My initial number ($2,300) was an estimate but I just calculated the actual number. I get $79.53 withheld from each of my paychecks, that’s $2,068 withheld from my salary every year. I did get about $500 back in my tax returns last year. So it’s closer to $13,800 a year to live off of. Not sure where you get $600 in taxes from as you are only including federal taxes.\n\nIf you’re referring to my post history where I’m asking about home buying that “combined salary” is a projection including what I expect my pay will be after graduating with a PhD in about a year. I make $18,000 and my SO makes about $45,000. We split all expenses evenly as we are not married.\n\nIt’s also not all about me. All of the other grad students in my department make the same stipend that I do and some of them don’t have a SO making more than them or have savings from working before their PhD.",
                  "author": "HMHype",
                  "created": 1611083810,
                  "upvotes": 3,
                  "replies": {
                    "gjv6i4v": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv6i4v/",
                      "text": "Thanks for filling in that information.",
                      "author": "827753",
                      "created": 1611086631,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gjsrg85": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsrg85/",
      "text": "Your comments about wanting to be paid a living wage are valid. I used to do external work to make money I needed, and it was discouraged by my department.\n\nMaking barely enough to scrape by becomes increasingly frustrating as you progress throughout your PhD. In my first year or two, I really was learning and felt like a student. In my final two years, I took zero classes, taught the same load as a tenure-track faculty, developed new courses, and trained faculty members on technology tools. Our PhD students teach many core classes and are being thrown in face-to-face classes this year as faculty members aren’t willing to and PhD students don’t have a choice even if they feel unsafe. \n\nI think it’s okay to acknowledge supply/demand while also recognizing the challenge of barely making ends meet while we provide real utility to the university. Of course, this comment doesn’t even scratch the surface of research - just noting how student enrollment in PhD-taught classes brings in $$. \n\nYou have skills entry-level PhD students don’t. It’s fair to want to be compensated appropriately.",
      "author": "SazeracSaturdays",
      "created": 1611031619,
      "upvotes": 24,
      "replies": {}
    },
    "gjru1bg": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjru1bg/",
      "text": "Not to mention the fact that, because PhD students are often considered part-time, we rarely qualify for benefits like sick leave/holiday pay/paid time off. Try not to get sick! Lol",
      "author": null,
      "created": 1611013467,
      "upvotes": 42,
      "replies": {
        "gjrz6i5": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrz6i5/",
          "text": "That must vary by school. PTO typically only applies if you're hourly or have a timesheet. At my school, grad students don't track their hours so they don't need to use official sick time, they just stay home. The program \"allows\" 2 weeks vacation but it isn't tracked and the PIs can be flexible, especially around the holidays. And they qualify for both employee and student health insurance and can choose either.",
          "author": "bacon_music_love",
          "created": 1611016279,
          "upvotes": 20,
          "replies": {
            "gjseza5": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjseza5/",
              "text": "That's how it was in my program. My advisor was so weird anytime we asked for vacation, so we ended up just telling them when we'd be gone rather than asking. They were super passive aggressive about it (and about everything), but I learned to ignore them and do my thing. They were one of the most incompetent scientists I have ever met and they knew it, so they didn't really challenge those of us who knew what we were doing.",
              "author": null,
              "created": 1611024682,
              "upvotes": 6,
              "replies": {
                "gjsf99a": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsf99a/",
                  "text": "Our PIs frequently \"remind\" the group that they're only allowed 2 weeks off, but they pretty much ignore the week of Christmas and new years since they're on vacation too. It only becomes an issue if a student is gone too often AND not being productive in lab.",
                  "author": "bacon_music_love",
                  "created": 1611024825,
                  "upvotes": 3,
                  "replies": {
                    "gjsg3m3": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsg3m3/",
                      "text": "It was always an issue with my advisor. They would send out an email reminding us about the \"policy\" literally the first week of December and then first week of June. Which is around when most of us would take vacation and not telling us, particularly the new domestic and international students, what the policy is made planning for flights tricky. I ended up just telling all the younger students who would join to just ignore them and book their trip anyway because of the slight leverage we had in that in my group, we as students wrote all the grant proposals (minus the financial stuff), all the manuscript reviews, and all the grant reports and presentations. Basically, we did my advisor's job for them. I calculated how much time I spent doing all that and I could have easily graduated four to five months earlier than I actually did. It's been about six months since I graduated and I'm still bitter about it and my experience there.",
                      "author": null,
                      "created": 1611025255,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gjs0szy": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjs0szy/",
              "text": "Oh wow! Yeah, I guess it depends on how time is kept. What you are describing sounds like a much better system tbh.",
              "author": null,
              "created": 1611017179,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gjrezvv": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrezvv/",
      "text": "Wait until you're doing your postdoc — then you'll get a livable wage! You will also get to see your smarter grad school friends get jobs at Amazon and Goldman Sachs, which will make you think \"wait... maybe I should have asked for more than just a livable wage\".\n\nThey keep fucking us over because we let them. And we let them because we genuinely like what we do. I don't know if there is an easy way out of this conundrum.",
      "author": "sure_complement",
      "created": 1611005730,
      "upvotes": 110,
      "replies": {
        "gjtdlkh": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjtdlkh/",
          "text": "And then you can move on into a faculty position where you get paid about 1/2 to 1/3 what you would make working in the private sector....\n\nI get paid less as an assistant professor than NIH post-doctoral salaries.",
          "author": "Eigengrad",
          "created": 1611049787,
          "upvotes": 10,
          "replies": {}
        },
        "gjrh6ka": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrh6ka/",
          "text": "Postdocs are not well paid by any means. \nWe don't let them fuck us over, we're forced into a corner by a system we have no power to change. Liking what you do isn't interchangeable with being paid. I'm sure brain surgeons feel like saving lives is rewarding in and of itself, but then they also get paid a shit ton, as they should.",
          "author": "Philieselphy",
          "created": 1611006813,
          "upvotes": 34,
          "replies": {
            "gjrrt26": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrrt26/",
              "text": "You may have misunderstood the comment you replied to.",
              "author": "respeckKnuckles",
              "created": 1611012269,
              "upvotes": 25,
              "replies": {
                "gjrud81": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrud81/",
                  "text": "Maybe, I guess I'm just annoyed and riffing.",
                  "author": "Philieselphy",
                  "created": 1611013645,
                  "upvotes": 10,
                  "replies": {
                    "gjrvuha": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrvuha/",
                      "text": "Understandable.",
                      "author": "respeckKnuckles",
                      "created": 1611014449,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gjulwj9": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjulwj9/",
          "text": "*laughs in 'couldn't get a postdoc'*",
          "author": "sirophiuchus",
          "created": 1611077263,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gjri5pt": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjri5pt/",
      "text": "Preach! (To the choir, probably, but oh well).\n\nMy postdoc contract finished last week. But guess what, I am still expected to write papers full time, and lead next month's zoom meeting (at 6am). Because we're a /team/, a /family/. And don't forget, if I want a reference letter, or a career at all, in going  to have to do all that, it's in my \"best interests\" and it would be \"such a shame to do this work and have nothing to show for it\". Fuck off with this reverence to The Project, like it's bigger than all of us, and we're honored to be a part of it. \n\nI have a family to feed, and on that salary, I could feed them but not myself all the time. And nobody thinks twice about why my work is a bit sloppy beyond that I'm lazy. Maybe a decade of financial insecurity and zero job stability and nobody giving a shit has something to do with it...",
      "author": "Philieselphy",
      "created": 1611007298,
      "upvotes": 77,
      "replies": {}
    },
    "gjrrc9f": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrrc9f/",
      "text": "This is why I kept my (industry) full time job while getting a PhD. I would rather dedicate all my time to school but who would be paying my bills?",
      "author": "SaltandVinegarBae",
      "created": 1611012021,
      "upvotes": 18,
      "replies": {
        "gju0s1p": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gju0s1p/",
          "text": "Christ, how did you divide your time and how much of it?",
          "author": "Jagulaari",
          "created": 1611067293,
          "upvotes": 7,
          "replies": {
            "gju8amx": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gju8amx/",
              "text": "So I’m almost done with classes and am now studying for comprehensive exams, I actually had to quit my last job because they weren’t understanding or flexible at all. But I luckily found a company now that’s good about time off and flexible hours. Other than that it’s all time management and basically having no life! Haha I track my time and put in about 12-13 productive hours a day, with about 6-8 hours a day on weekends. You gotta love what you study and not hate work!",
              "author": "SaltandVinegarBae",
              "created": 1611071005,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gjrac39": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrac39/",
      "text": "This drove me crazy when I ended up turning down the one offer I got last year for a grad program. Everyone was like why would you turn down such a good offer, when the offer was from my last choice school and I still would have had to go over 50k in debt to afford it because the mandatory fees would have eaten almost a third of my stipend. Even with multiple roommates and doing my best to minimize expenses how am I supposed to live on less than $10k per year? Its not doable when rent alone would be almost $1k per month.",
      "author": "squirrel8296",
      "created": 1611003423,
      "upvotes": 42,
      "replies": {}
    },
    "gjrfa13": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrfa13/",
      "text": "That is academia. Whole swats of people are being abused. The only people who make money are old tenured professors (and those are on their way out) or vice-chancellors/the big administrators. Graduate students, adjunct faculty, postdoc, ECR: all of those have to fight relentlessly for a dream that is increasingly impossible to attain. \n\nThe committee member probably went through her share of abuse and it becomes so ingrained in you that you accept it. Seriously, if you can move out of academia, do it. I am on my way out. Need one more job to keep running this year but I am building a business out of a research project. Once that is on the road, I close the academia door behind me.",
      "author": "frugalacademic",
      "created": 1611005871,
      "upvotes": 49,
      "replies": {
        "gjryopt": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjryopt/",
          "text": "Don’t forget staff! Also largely taken advantage of, especially at the lower levels. You’re absolutely right that there are only small pockets of the giant machine that is academia that are paid appropriately. Awful.",
          "author": "nattie_disaster",
          "created": 1611016010,
          "upvotes": 18,
          "replies": {}
        },
        "gjsbvwm": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsbvwm/",
          "text": "Even more egregious is the stratification of salaries at most institutions... I know that I made $21k/12 as a PhD student, $42k/12 as a postdoc, $84k/12 starting as Asst. Prof, and *might* just top out near $168k/12 as a Full Professor if I am a gigantic a'hole about negotiations over the next couple years. Meanwhile, the administrators at the top are making a full doubling above that, probably wondering why anyone would be so greedy.",
          "author": "Jon3141592653589",
          "created": 1611023084,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "gjrja4v": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrja4v/",
      "text": "Excellent point that should be repeated all over again. The problem is that university research should be funded by the state because it's of public interest, but Western societies see everything as merchandises that should be monetized, owned and \"profitable\".\n\nOf course, some disciplines are easier to commercialize than others, but in social sciences and humanities this means that more and more research is underfunded and only available to those who can do it for free, because why should you get paid for something that's not profitable and that cannot be sold? \n\nSo we need to agree on this, because I'm sure many people will disagree with me and start spewing neoliberal dogmas. Once we as researchers agree on the need for adequate public funding for research, we need to fight for it. We need to stop normalizing exploitation, we need to go to society and show why research in all areas of knowledge has societal benefits and is actually not an expense but a very valuable investment. \n\nThis will be difficult because many researchers have internalized an individualist \"meritocratic\" logic in which they see themselves as the very best and other researchers as competitors that need to be beaten, so it will be very difficult for us to collaborate. \n\nLuckily thanks to the internet and the mass pirating of academic books access to knowledge is democratizing and there will be plenty of intelligent people who will learn outside of universities whereas academia will be more and more full of arrogant, ignorant people who draw their self worth from diplomas and titles. \n\nSo to sum it up: congrats for not being brainwashed, never let people make you work for free!",
      "author": "Anteros94500",
      "created": 1611007872,
      "upvotes": 31,
      "replies": {
        "gjsrkb0": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsrkb0/",
          "text": "Terrific post. This is pretty much exactly what I say every time grants get mentioned in discussions within my (social science) department and people get offended due to the meritocratic logic you describe.",
          "author": "ketamet",
          "created": 1611031689,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gjrpbn1": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrpbn1/",
      "text": "I was a part-time TA during my master's program. I got a decent insurance package, a bit under 10k a year in stipends, and a tuition waiver. I would say I got worked hard, but generally not unreasonably. I'll admit I had to take out some loans to actually survive though. Then Covid hit and they told us that there would be no more TA positions. I refuse to take on an exorbitant amount of debt so I switched to a non-thesis master's as that only required me to attend for a single quarter unfunded. Now I'm trying to get into a decent Ph.D. program, but without a thesis, a lot of places are hesitant to take me on.",
      "author": "jgerhar",
      "created": 1611010957,
      "upvotes": 14,
      "replies": {}
    },
    "gjt2sv1": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjt2sv1/",
      "text": "I absolutely sympathize. Unfortunately, this will likely never change until universities in the US are fundamentally restructured. There's far, far too much administrative bloat & far too many college graduates in fields without career paths (who then turn back to academia even if it's not their aptitude). It's *supply & demand*, sure (a lot of kids want to go into academia - to get paid to study what they love), but it's also an ***artificially controlled demand***; universities should be letting in far fewer grad student, only accept/train the best & brightest (but then they'd have to pay a fair wage).\n\nThe unfortunate reality is - and this is the real gut punch - research oriented academia was not made for the middle class (much less the working class or below). Outside of STEM+ fields & certain corporate-type masters, \"the Academy\" as we know it today was designed for the children of the elites. They could fund their own research, subsist on family stipends, & use the university as an intellectual community to contribute/receive information/perspectives. The current system still inherently implies that this is the circumstances of graduate students (& even lower-profs); clearly that's not the case but it will involve a **fundamental** restructuring  - including changes to gov't policy - for universities to finally catch up to the reality of the past century or so.\n\nEdit: Also! universities breech employment contracts like it's going out of style which is disgusting, would never be tolerated in any other field, & is something I addressed in another comment.",
      "author": "Duc_de_Magenta",
      "created": 1611039831,
      "upvotes": 9,
      "replies": {}
    },
    "gjspjzo": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjspjzo/",
      "text": "I agree with you (of course) in general....  but can I offer a counterpoint?   (it won't be popular, but I think it's important to recognize.) \n\nFirst, it's not *just* about supply-and-demand (overproduction of PhDs), and not *just* about exploitation, although both of these are certainly there. It's also about life choices. \n\nIt's that the *kind* of people who go into academia--and, I might add, into education in general--are the kind of people who are already *not* prioritizing money as the benchmark of their success and/or happiness.    It's the same with school teachers.  Why are elementary school teachers paid such shit wages, considering that their job (educating and taking care of the entire nation's *children*, for chrissakes) is the second most important job in the entire nation (after farming)??  So why are teachers paid such shit wages, why are they disrespected constantly (\"those who can't, teach\")?  \n\nBecause society can get away with it.  *Because* people who want to be teachers (or academics) don't do it for the money, don't do it for the social status.  They do it for personal reasons--because it is a fucking crucial job, and (unlike a hedge fund manager) it actually *means* something to be *good* at this job.  \n\nSomeone else in this thread talked about quitting academia to work for Goldman Sachs.  yeah.  Fuck that.  Those people do not have my values.  If you work for Goldman Sachs, you are (in my opinion) not only NOT offering anything useful to the world or to humanity, but worse, you are a leech on human society. \n\nI worked for the corporate world--for a decent company with good people.  But even though it wasn't Goldman Sachs, the fact is, it was a meaningless career:  I was selling shit to people who really didn't need more shit.  \n\nI went to grad school (a long time ago), and my income dropped by 75%.   \n\nI survived on starvation wages... indeed, I burned through my savings I'd had from my corporate job. \n\nAnd I was never happier.   \n\nSo, is it disgusting, unfair, flawed, and (to go stronger) even a social *evil* that our society (modern US, but also other places) exploits this reality, and pays grad students, teachers, and even most professors absurdly low (barely survivable) wages?   \n\nAbsolutely.   \n\nBut if we didn't have people like me, and like my kid's elementary school teacher, and countless others, then the world would be a festering shithole of real estate con artists and dot-com scam bubble-inflators.  We ARE the backbone of society, we are the future, we are... really, everything important about humanity.   everyone else is just a monkey pressing the 'consume' button.\n\nFor me, that actually counts for a fair amount.    I ain't rich, but I'm happy.  If I wanted to be rich, I'd have stayed in the corporate world... and despised every minute of it (and myself, for being there). \n\nJust my own $.02  (an hour's wage... :-)",
      "author": "DerProfessor",
      "created": 1611030464,
      "upvotes": 17,
      "replies": {
        "gjsyym0": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsyym0/",
          "text": "If people who go into inherently \"rewarding\" professions get paid less, surely medical doctors should be struggling to pay the bills too? I'll tell you why school teachers don't get paid enough, same as nurses, child care, aged care. They're women-dominated fields. Women's work isn't valued. \n\nWhy we're all getting screwed in academia is a different issue.\n\nThere's no reason I can't love what I do, be highly trained and specialised, and get paid what I'm worth.",
          "author": "Philieselphy",
          "created": 1611036752,
          "upvotes": 12,
          "replies": {
            "gjt8t6j": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjt8t6j/",
              "text": "actually, I think it's more complicated than just that it's \"women's work.\"  (though I do very much see where you are coming from!)   In much of European and even early American history, schoolteacher was a predominantly male profession.  It was mostly in the Western US in the late 19th c. where it first became \"female\" in the USA... and has remained \"female\" since.  Certainly, this does have a lot to do with how little respect the profession receives.  (In Europe, schoolteachers are now a female-dominated profession, but get a lot more respect from society... perhaps because it was once male-dominated?  hard to say.)  \n\nBut I don't think that's the root cause.  \n\nFor instance, academia/university professors was *exclusively* male until just a generation or two ago.  And yes, salaries have fallen since women came into the profession.  But they were never astronomical... no where near (as you say) doctors or lawyers, for instance. \n\nThere's an American-ignorance strand factoring in here, of course. American culture is the most anti-education culture of the industrialized world, despite our university system being one of the best.  The UK is on a similar course. \n\nDoctors are a special case:  there's a case of 'desperation' there.  When you are gravely ill (or even facing death), there is no amount of money you wouldn't pay to get better.  \nThat (more than the cost of med school) is one of the factors that drives their pay upwards.\n\nBut think of all of the OTHER professions that are paid far less than their education (plus talent) would seem to require: \n\nsocial worker.  concert violinist.  elder care.  environmental sciences.  disaster relief.  working for national parks or the Forest Service.  \n\nThese career paths require degrees, sometimes post-graduate degrees.  (I know people who have PhDs in Environmental Studies who have a tough time getting a job as a low-paying Park Service.) \n\nOne reason is that people *want* to pursue these careers.  They want to do these jobs, and are willing to do them for less pay... because these jobs are *meaningful.*\n\nBut there are other reasons, too, of course.   One is sharply political.  Just accepting a job that (for instance) protects children for abuse or protects the environment instead of maximizing one's earning potential by going to work in a brokerage is making a political statement... and thus, has become a *target* for all of those people who have a vested interest (financial or even just in terms of their identity) in a non-socially responsible institution.   For instance, everyone I know in a low-paying socially-minded career has someone--a parent, uncle, spouse, whatever--who has a career that makes lot of money, and voices *constant* criticism (and sometimes worse) about the socially-minded person's career choice.  I've seen this so many times it's not even a meme , it's a universal reality.  People who choose money as their guiding light are profoundly, fundamentally *threatened* by people who make a different choice. \n\nThis is one reason for the disrespect, especially in America, land built around ~~money-making~~ sorry \"opportunity\".   A great deal of the shit heaped on academics by (especially) right-wing politics has, I would argue, insecurity and even envy at its core. \n\nBut in the end,  you are right:  there is NO REASON why you shouldn't be able to love what you do, be highly trained and specialized, and get paid what you're worth.",
              "author": "DerProfessor",
              "created": 1611045075,
              "upvotes": 10,
              "replies": {}
            },
            "gjuz902": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjuz902/",
              "text": "You're delusional\nMedics are paid well in the US because you break a leg and become indebted for life. In Europe medics earn shit.",
              "author": "_Zetto",
              "created": 1611083296,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "gjuaj1e": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjuaj1e/",
          "text": "I understand your perspective and share it to some extent but you seem to neglect the fact it's not just passion one needs to be happy. Staff making a wage below cost of living cannot survive and will not be happy in 99% of cases regardless of how passionate they were at the start or uninterested in money. Glorifying the starving struggle towards a noble goal while demeaning jobs that are better rewarded monetarily is a key way the institutions try to shame us into not daring to even hope for a better wage (\"what you want money? Aren't you doing this because you're passionate rather than for superficial reasons? How disappointing\"). This turns into the notion that only the poor starving PhD student is a real PhD student while neglecting the fact that A. Most PhD students that do well are successful precisely because they are not poor (due to preexisting privilege, accrued wages like you from a previous job or actual decent compensation) B. Forcing people to live in terrible conditions in the name of their passion almost systematically excludes huge numbers of very competent candidates that could contribute so much to society but can't because they are suffering from physical / mental issues or difficult circumstances and thus cannot afford to sacrifice themselves in the name of the greater good (or if they do, will do so with graver consequences). I'm fortunate to be a PhD student in France and my stipend is comfortably above minimum wage (while also being very far from what I'd earn in the private sector). Having a livable wage isn't necessarily and shouldn't be incompatible with doing a useful job and pursuing your passion. As another commenter mentioned doctors are payed decently despite also being a 'passion / higher motive' type profession. That is deeply rooted in supply and demand as well as historical bias against certain professions / areas of study. Summoning the 'higher calling' justification is just a way of excusing away unacceptable work conditions and, in my opinion, is not sufficient to justify defending the status quo.",
          "author": "throwrugcity",
          "created": 1611072066,
          "upvotes": 3,
          "replies": {
            "gjx86lf": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjx86lf/",
              "text": "I agree with every single thing you said. \n\nTo be clear, \nI wasn't trying to summon the \"higher calling\" to JUSTIFY the lower wages...!!!!     No no no. \n\nI was evoking it to *explain* the lower wages.   As in, 'society' can get away with paying me and my colleagues far less that what our education and talent would otherwise command, *because* we love what we do. \n\nBut I think it's wrong.   It's wrong wrong wrong. \n\nI shouldn't have had to rely on savings to help me get through grad school.  My grad students today shouldn't have to exhaust themselves with hours as a barista just to make rent, and then start their seminar work at the end of a shift.   And don't get me started on how immoral the abuse of adjuncts is. \n\nI was just trying to explain one element of the \"whys\" of it...not to say that this is good, okay, or even acceptable.  \n\nKnowledge is power, as they say.  (or it can be.) \n\nI have talents and education.  I KNOW how far that can do far better (financially) in the corporate world, because I worked in the corporate world. \n\nWhen I went to grad school, I wasn't \"choosing\" to be poor... but I was choosing to do what I loved, and I need to recognize that ANY inability or unwillingness to 'walk away' from a job in a capitalist system is (to put it bluntly) a \"weakness\" that this capitalist system will use against me.  (and ruthless capitalism with plenty of cheerleading from certain political directions who have their own agenda.) \n\nI guess I see some power (and perhaps take some comfort) in recognizing the state of things bluntly/crassly, rather than aspirationally/how things \"should\" be?   Hard to say if that's a good thing or no.",
              "author": "DerProfessor",
              "created": 1611127179,
              "upvotes": 2,
              "replies": {
                "gjxd6lb": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjxd6lb/",
                  "text": "True, I just worry that way of phrasing that blunt assessment makes it seem like there is no alternative / solution, like this is just something one must accept. Obviously some solutions to this issue are pretty much out of our hands although we can work towards them (wide reform of higher education). I think people in academia should strive to protect their freedom to walk away though. This is unfortunately much harder in some fields than others, but as much as possible I think we should try to build up alternatives (in other workplaces, industries, countries etc). The skills and ability people have to do good and enjoy themselves in academia can be useful elsewhere and sometimes could even be of greater use in alternate paths. The dichotomy between public good + academia + passion on the one hand and private interest + industry + superficial motives isn't the be all and end all. If you believe that you are unable or unwilling walk away, they will use that against you. That is a good thing to see and recognise bluntly but then the next powerful step would be to figure out how to make walking away possible / acceptable to you.",
                  "author": "throwrugcity",
                  "created": 1611131751,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gjs9fo8": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjs9fo8/",
      "text": "Never let anyone make you feel bad for wanting a decent income. Your worth is way higher than what grad school will ever pay. \n\nThere's a good podcast that talks about some of this stuff, especially in the U.S. context, and how grad students need to re-evaluate their financial worth during their Ph.D.: [http://pfforphds.com/podcast/](http://pfforphds.com/podcast/)",
      "author": "promiscuouspotatoes",
      "created": 1611021795,
      "upvotes": 8,
      "replies": {}
    },
    "gjsp209": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsp209/",
      "text": "I would imagine that the bigger problem with paying you would be getting permission to do so. I know my University would be happy for me to take on someone, but would NOT give me permission to pay them unless I had a grant and it had been written into the grant originally. Hell, I'd probably even be told I can't hire someone on to work unless they are earning credit (and thus paying us for the privilege). This may not 100% be the prof's decision, especially with covid. Hell, we had ALL our funding for anything additional stripped last year (so no funding for student or grad journals that we normally publish, no travel funds, no computer funds, nothing) so I ended up having to buy my own laptop when my work one died and we just didn't publish anything for the undergrads. I don't think that money is coming back, either. Once it's gone it's gone. :(",
      "author": "phoenix-corn",
      "created": 1611030170,
      "upvotes": 3,
      "replies": {}
    },
    "gjta47h": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjta47h/",
      "text": "You are absolutely right though, and there should be action on two fronts: a) boycott unpaid/underpaid positions that do not make up for it with substantial training/skills transfer, and b) adoption of laws that are at least as favourable as Germany's unpaid internship laws (if longer than 3 months, then at least minimum wage), if not better.\n\nI was fortunate that most of my academic work as an undergraduate (CY) and now graduate school student (DE) was compensated fairly, either monetarily or with real skill transfer. But during my undergraduate programme, that was down to the initiative of the people offering me those positions, they weren't required to do it.",
      "author": "agrammatic",
      "created": 1611046326,
      "upvotes": 3,
      "replies": {}
    },
    "gjuh1iz": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjuh1iz/",
      "text": "I'm kind of late to the party, but my institution decided to punish students and departments for complaining about exactly this. The graduate student union protested the wage for years. Eventually, they were able to double it. That doubling meant cutting all teaching assistant lines for nearly all departments in our college of arts and sciences, including some STEM fields. I'm still angry about it because now faculty can't even recruit students with a teaching assistantship, and the message is clear - get more grants. Really pisses me off [https://www.ubspectrum.com/article/2019/09/students-and-faculty-upset-about-recruitment-pause-in-college-of-arts-and-sciences-departments](https://www.ubspectrum.com/article/2019/09/students-and-faculty-upset-about-recruitment-pause-in-college-of-arts-and-sciences-departments)\n\nAs traditional universities move more towards a neoliberal way of operating, students who should be supported financially will be iced out of graduate studies more and more. It'll become the new unpaid internship, where only the privileged survive. \n\nI suppose if I were some terrible administrator I might make similar decisions. Why support and mentor new students into a field with fewer job prospects every year, when I can hire adjuncts who refuse to enter other areas of the workforce, for less? I guess I would let the graduate programs die a slow death, and then blame the professors later - well, if you got more grant money, this wouldn't have happened. If you published more and had more patents, this wouldn't have happened. Sorry but you just haven't had the enrollment for x number of years (but you wouldn't support our existence!). \n\nIt's worrisome to think where this is all headed.",
      "author": "yourmomdotbiz",
      "created": 1611075093,
      "upvotes": 3,
      "replies": {}
    },
    "gjrjyf6": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrjyf6/",
      "text": "The basic issue is supply and demand: labour by PhD workers is not in demand enough for people to pay for it. So long as that will remain true, conditions will not improve.\n\nIf people weren't willing to do the work at a low cost, the work would just go undone - because the PhD student values their PhD more than whoever is funding the PhD does.",
      "author": "ThePhysicistIsIn",
      "created": 1611008216,
      "upvotes": 10,
      "replies": {
        "gjta4zd": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjta4zd/",
          "text": ">labour by PhD workers is not in demand enough for people to pay for it\n\nAnd yet there's no shortage of courses and sections for PhD workers to teach.",
          "author": "truagh_mo_thuras",
          "created": 1611046346,
          "upvotes": 2,
          "replies": {
            "gjthdf5": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjthdf5/",
              "text": "They have PhD teach those because they’re already paying for PhD stipends. If they weren’t, they’d hire adjuncts, which are no more expensive. \n\nOnly if there were no adjuncts and no PhD students would they have to increase their offer for labor.",
              "author": "ThePhysicistIsIn",
              "created": 1611053487,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gjt5o4w": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjt5o4w/",
      "text": "I should have gotten a heart scan when I was having palpitations this summer, but that's like... $1,000+? Eh. I'll hope for the best. That's a half month income before taxes. I have one of the \"better\" stipends, and decent student health insurance. But an echo... Well. No one thinks \"what if a grad student might need an echo, to be safe.\" \n\nHere's to livin' on the edge!\n\n\nStill gotta pay for that holter moniter that was showing the weird tachycardia.\n\nDid I tell my PI? No. Lol. Who wants to look weak? Especially as a woman who is not in her 20s.",
      "author": "GayDeciever",
      "created": 1611042233,
      "upvotes": 6,
      "replies": {}
    },
    "gjua34f": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjua34f/",
      "text": "I'm sorry that you're going through this. \n\nWhen I was about to graduate, I wrote a kind of diary note about my frustrations at watching others go on to buy houses, have children, get a pet! At that point of my career, I couldn't even consider getting a dog because I was also working 40 hours in a 20 hour per week job while earning less than half of what I \"should\" for my level of education (ABD at that point). We made ends meet by having my spouse get student loans and by eating dinner with my parents often - a luxury that many do not have. \n\nI am well in to my 30s and just bought my first house, so your predictions are accurate, at least as far as I can tell. Again, I'm sorry and I wish you all the best with finishing up and finding a well-paying job.",
      "author": "Esmereldista",
      "created": 1611071856,
      "upvotes": 2,
      "replies": {}
    },
    "gjuoi5y": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjuoi5y/",
      "text": "My PhD advisor once gave us an “opportunity” to attend her class as guests. And if we wanted we could take on a group to grade. All her students felt pressured to attend and take a group. When I said I’d be happy to attend as long as I’m not grading she said something like what everyone else is posting here “Well the goal is to gain experience and build community.” I made up some bs about a schedule conflict and didn’t attend. All but one of her students escaped. The class project became editing her Wikipedia page for her pet theory. You better believe that poor grad student that didn’t escape was stuck with editing her wiki for the rest of his time there.",
      "author": "drpicoloco",
      "created": 1611078420,
      "upvotes": 2,
      "replies": {}
    },
    "gjs5gop": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjs5gop/",
      "text": "Maybe it makes you feel better if I tell you I had to work overnight in MacDonalds during my PhD just to be able to pay my rent. It was psychologically and emotionally very draining. \n\nYour life changes after graduation, but what you don’t recover ever after again is the time you spent working “autistically” on some one else’s agenda and not your own life!",
      "author": "inexplicableBeacon",
      "created": 1611019712,
      "upvotes": 5,
      "replies": {}
    },
    "gju8z62": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gju8z62/",
      "text": "Totally agree. I'm happy I did my phd in Europe, shorter and better paid. Does your university have a union? I feel this has made things so much better for postdocs where I am now.",
      "author": "labpenguin",
      "created": 1611071327,
      "upvotes": 1,
      "replies": {}
    },
    "gjull0h": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjull0h/",
      "text": "Your situation obviously sucks. But what you describe is pretty darn good compared to many situations.\n\n> I've done things like defer dental care out of income concerns.\n\nSo have I, and I am so outside of the \"going to the dentist\" habit that even though I now have dental insurance it has been over 6 years.\n\n> I budget carefully to make ends meet.\n\nYep. (Not anymore, but up until about 5 and a half years ago, you bet.)\n\n> I would love to buy a house one day, but right now saving for a down payment is not feasible, and I'll be well into my thirties before home ownership is realistic.\n\nI'm looking into my late 40s or 50s. I technically could buy a house today (thanks to a Credit Union that doesn't require down payments), but in the SF bay area it wouldn't be that nice of a house. Plenty of people will never afford a house. My parents didn't own until their mid 30s, and they had two jobs and no school debt. This is not unusual.",
      "author": "827753",
      "created": 1611077121,
      "upvotes": 1,
      "replies": {}
    },
    "gk9q4yd": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gk9q4yd/",
      "text": "It’s a scam, for sure. This culture is one reason I didn’t get a PhD",
      "author": "dammit_mcnulty",
      "created": 1611363885,
      "upvotes": 1,
      "replies": {}
    },
    "gknwj4h": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gknwj4h/",
      "text": "Wow!  My program is not offering a stipend.  I'm in my first year, though.  I don't think you should care what people think about your wanting to be compensated for your work.  You're an adult.  They don't pay your bills.  Be blessed.",
      "author": "Puzzleheaded_Raise26",
      "created": 1611540923,
      "upvotes": 1,
      "replies": {}
    },
    "gl0frvk": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gl0frvk/",
      "text": "If you don't like it then leave. Nobody is forcing you to do this. Either way, stop whining and get a grip of your life!",
      "author": "gobblegobbleultimate",
      "created": 1611787653,
      "upvotes": 1,
      "replies": {}
    },
    "gl7dyto": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gl7dyto/",
      "text": "I feel your pain. It breaks my heart to see so many young people go to college to avoid being broke, then end up broke precisely BECAUSE they went to college. America desperately needs to fix its broken educational system and copy the systems of more successful first world countries. It’ll be one of the few situations where copying somebody else’s work is actually a good thing.",
      "author": "ogcroak",
      "created": 1611901999,
      "upvotes": 1,
      "replies": {}
    },
    "gnsjbtm": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gnsjbtm/",
      "text": "There is a similar notion in the art world: if you want to make money doing art that means you are a sell out with no soul.",
      "author": "h3ineka",
      "created": 1613586662,
      "upvotes": 1,
      "replies": {}
    },
    "gjrkgg5": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrkgg5/",
      "text": "[deleted]",
      "author": null,
      "created": 1611008470,
      "upvotes": -28,
      "replies": {
        "gjrwmm9": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrwmm9/",
          "text": "You never felt that your advisor needed you for anything? You thought that without graduate students your advisor would still be able to research the same amount and pump out the same number of publications while still completing their other university responsibilities?",
          "author": "HMHype",
          "created": 1611014878,
          "upvotes": 21,
          "replies": {
            "gjt3eni": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjt3eni/",
              "text": "This is probably field dependent - I'm in a Field where it's rare for grad students to publish more than 1 paper across their PhD. So, in my case, I'd actually publish more myself if the time supervising my 3 students was replaced by research time (though I suppose in reality the chair would probably give me an annoying task instead).",
              "author": "serennow",
              "created": 1611040346,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gjro4u7": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjro4u7/",
          "text": "IDK, man. I can't help but be thinking that the anti-rant doesn't fit well with OP's rant. Like, shouldn't your faculty contract stipulate your teaching, service, and research ratios? Doesn't that indicate how much effort and pay you are receiving for each of those things? Wouldn't anything beyond that be a 'free-er' choice since you make a living wage? How is the life and compensation of a faculty member comparable to the typical grad school experience where contracts where effort 'depends' on your advisor, PI, and lab? OP's rant sounds like their department treats grad funding as tossing a porkchop to a yard full of hungry dogs. That doesn't sound like a nice way to treat your people, let alone live. Of course, these are just my thoughts, so grain of salt and all that.",
          "author": "pseudodoxia",
          "created": 1611010339,
          "upvotes": 32,
          "replies": {}
        },
        "gjsj8h3": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsj8h3/",
          "text": "I'm a graduate student who worked in my field for several years before going back to school. In fact, several of my peers did as well. I did like it better because not only did they pay me a competitive salary with good benefits, but overall I was treated with more respect and I got to do research I was passionate about. Was it perfect? Of course not, and that was why I pursued a PhD and I don't regret my choice. But academia can be toxic and it's easy for PIs to be abusive assholes under the guise of, if you want it enough, you'll do anything I ask. I knew what I was getting into and I knew myself well enough to draw boundaries at work (starting with not choosing a mentor that's a total dick), but not everyone has that luxury. It's important to recognize and understand when someone needs to say no. So while you may currently be in a position where doing all these things for free isn't taking food off your table or emotional energy you don't have, that isn't the case for everyone.",
          "author": "snaggletots22",
          "created": 1611026920,
          "upvotes": 8,
          "replies": {}
        },
        "gjs5guk": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjs5guk/",
          "text": "Okay boomer. There is sooooo much to break down in this comment.... all I'll say is that you make me feel grateful my advisor is nothing like you. Thanks for the perspective.",
          "author": "zsantana459",
          "created": 1611019714,
          "upvotes": 19,
          "replies": {}
        },
        "gjsq75x": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsq75x/",
          "text": ">If you like the taste of money, go work a \"real job\" (which I suspect you've never done; most grad students haven't).\n\nSpeak for your fucking self homie. I did day labor for awhile, was a longshoreman, and worked in a wood shop.",
          "author": "Randaethyr",
          "created": 1611030855,
          "upvotes": 9,
          "replies": {}
        },
        "gjtczxl": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjtczxl/",
          "text": "I'm actually shocked a tenured prof doesn't get this...but you realize that once you are in the program, you HAVE to graduate lest you don't benefit from it? In industry it doesnt matter that much because every day spent there is 'experience'. \n\nYou almost have to get a phd in certain fields (e.g., chemistry) to have reasonable job prospects.\nSo yes you are trapped. \n\nBtw you don't do any of the things you said for free. That's your job, and you receive an adequate salary for it and it's a permanent position. \n\nHonestly you sound like you never have experienced financial hardship. Furthermore you sound like you are in dire need of an humbling experience.",
          "author": "Swuuusch",
          "created": 1611049178,
          "upvotes": 5,
          "replies": {}
        },
        "gjv2vvq": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv2vvq/",
          "text": "Sorry you're getting downvoted so much. While of course it is reasonable to expect to be paid for work, I also think the OPs expectations are a little off for exactly the reason you describe - stipends. Your stipend is paying for you to do something other than \"wait\" and work a second job. Mentoring undergrads, reading papers, performing experiments beyond the thesis work, giving a seminar talk, organizing events for the lab, all of these are things you can reasonably be expected to do, occasionally, without extra pay.",
          "author": "temp-refinance",
          "created": 1611084988,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "gjrphow": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjrphow/",
      "text": "It is quite common for apprenticeships to involve unpaid or very low paid work. Particularly in institutions that evolved out of guild apprenticeship systems, as modern academia did.\n\n> Am I supposed to feel grateful\n\nAt every level of academia there are 10, 20, or 100 persons eager to do take one's place; at whatever the current rate is *or less*. So in a way, yes. Want that changed? Follow the money up, but if you stop at a department or even the upper administration for a university, you've stopped too soon.",
      "author": "ph0rk",
      "created": 1611011045,
      "upvotes": -16,
      "replies": {
        "gjupts5": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjupts5/",
          "text": "Yeah, but the apprenticeship is supposed to end around the age of 21, when one becomes a journeyman.\n\nPlacing the apprenticeship at the back end of years of study is one of the original screwups of the Ph.D. octopus.",
          "author": "827753",
          "created": 1611079012,
          "upvotes": 1,
          "replies": {
            "gjv537i": {
              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv537i/",
              "text": "> Yeah, but the apprenticeship is supposed to end around the age of 21, when one becomes a journeyman.\n\nBy that line of thinking we should expect them to have mastered basic skills by 18. That is not the case.",
              "author": "ph0rk",
              "created": 1611085993,
              "upvotes": 1,
              "replies": {
                "gjv6g5z": {
                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjv6g5z/",
                  "text": "> By that line of thinking we should expect them to have mastered basic skills by 18. That is not the case.\n\nYeah, I know, because of the back-ended nature of the Ph.D. octopus. We'll see if iGEM, yearly internships, etc... result in topped-up pre-Ph.D. training.\n\nAnd as a person who has/will have been working in the field for over a decade prior to my M.S. and Ph.D. it's a bit annoying that the system does/will expect me to be tabula rasa, and is/will be incapable of adjusting to the fact that I'm not.",
                  "author": "827753",
                  "created": 1611086607,
                  "upvotes": 1,
                  "replies": {
                    "gjvopp4": {
                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjvopp4/",
                      "text": ">  because of the back-ended nature of the Ph.D. octopus\n\nNo, because primary and secondary education fails forward. The vagaries of the PhD aren't why 18-20 year olds can't do basic algebra, can't write a simple essay, or have no basic computing skills; but each of those things does mean the beginning of a PhD has to start with what ought to be baccalaureate level (or lower) skills.\n\n> And as a person who has/will have been working in the field for over a decade prior to my M.S. and Ph.D. it's a bit annoying that the system does/will expect me to be tabula rasa, and is/will be incapable of adjusting to the fact that I'm not.\n\nIf you possess real skills you very much can progress faster. What you probably possessed, though, were somewhat similar skills that don't immediately translate. \n\nAnyone can start working on what will be their dissertation research in month one, if they know what that is and are conversant enough with the methods and the subarea.",
                      "author": "ph0rk",
                      "created": 1611094819,
                      "upvotes": 1,
                      "replies": {
                        "gjvsxwp": {
                          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjvsxwp/",
                          "text": "> The vagaries of the PhD aren't why 18-20 year olds can't do basic algebra, can't write a simple essay, or have no basic computing skills; but each of those things does mean the beginning of a PhD has to start with what ought to be baccalaureate level (or lower) skills.\n\nThe students you're mentioning probably shouldn't be accepted into a Ph.D. program. At least not without remedial work beforehand.\n\n> If you possess real skills you very much can progress faster.\n\nNot when you're working full time.\n\n> What you probably possessed, though, were somewhat similar skills that don't immediately translate. \n\nPost-docs and Ph.D.s come to me for advise and a second opinion on DNA assembly.  This works very, very well on a resume, but not for Scientist-level positions, as without a Ph.D. those positions are not open. And the academy will not recognize this field-specific experience in terms of course-work (the course-work is the real slog). Though yeah, it does save time in studying, but on the other hand it's quite depressing doing makework for some points.\n\nThe academy ate the science apprenticeships, and did so half-assedly.",
                          "author": "827753",
                          "created": 1611096869,
                          "upvotes": 1,
                          "replies": {
                            "gjvtd9w": {
                              "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjvtd9w/",
                              "text": "> The academy ate the science apprenticeships, and did so half-assedly.\n\nI don't agree - the thing people often forget about the guild apprenticeship system is lots and *lots* of would-be journeymen never make it that far. This happens at a later age now than it used to, but then again so does marriage.",
                              "author": "ph0rk",
                              "created": 1611097084,
                              "upvotes": 1,
                              "replies": {
                                "gjvz932": {
                                  "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjvz932/",
                                  "text": "> the guild apprenticeship system is lots and lots of would-be journeymen never make it that far.\n\nI'm curious how modern apprenticeship-oriented disciplines compare to the university in Journeyman versus Associates/Bachelors graduation statistics.\n\nI'm sure guilds sucked too (way too much politics, for example). Apprenticeships themselves have been around for thousands of generations though.\n\nI believe I would have thrived much better in a system in which learning and practicum occurred hand-in-hand, on an as-needed and as-desired basis. This is what graduate school is supposed to do. It just happens much too late. Without blowing up the system entirely I guess I would change the undergraduate program to focus more on pounding out nails and horseshoes than practicing debate with scholars.",
                                  "author": "827753",
                                  "created": 1611100079,
                                  "upvotes": 1,
                                  "replies": {
                                    "gjvzkev": {
                                      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjvzkev/",
                                      "text": "> I'm curious how modern apprenticeship-oriented disciplines compare to the university in Journeyman versus Associates/Bachelors graduation statistics.\n\nI don't have data, but I *have* been an apprentice electrician. 50% attrition sounds generous; it could have easily been more.\n\n> I guess I would change the undergraduate program to focus more on pounding out nails and horseshoes than practicing debate with scholars.\n\nWhat do you think undergraduate education looks like right now? We'd be lucky if they could make nails and horseshoes.",
                                      "author": "ph0rk",
                                      "created": 1611100242,
                                      "upvotes": 1,
                                      "replies": {
                                        "gjw7q04": {
                                          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjw7q04/",
                                          "text": "I think it looks more like practicing debate with scholars (neo-Roman patrician trivium and quadrivium extended for extra years).\n\nThanks for the info about today's apprenticeships. That's probably worse than community colleges.\n\nUltimately I want plurality in education. What we've got is way too monotone.",
                                          "author": "827753",
                                          "created": 1611104520,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gjri9d7": {
      "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjri9d7/",
      "text": "[deleted]",
      "author": null,
      "created": 1611007350,
      "upvotes": -20,
      "replies": {
        "gjsn6rv": {
          "link": "/r/AskAcademia/comments/l02phh/stigma_of_wanting_to_be_fairly_paid_for_work/gjsn6rv/",
          "text": "Really? Because I worked outside academia and when I asked for a raise because of increased duties I got it.\n\nWhen I didn’t do free labor for the company down the street I wasn’t fired.\n\nI got paid well above a living wage for my work. I went home when I was done for the day and don’t think twice about it.",
          "author": "Lamalaju",
          "created": 1611029084,
          "upvotes": 9,
          "replies": {}
        }
      }
    }
  }
}