{
  "sid": "r1ax5k",
  "link": "/r/AskAcademia/comments/r1ax5k/impossible_to_get_a_proper_recommendation_is/",
  "title:": "Impossible to get a proper recommendation - is there even any chance for me to continue to grad school?",
  "text": "I've been out of my undergrad for 12 years (graduated in 2010), and have only one academic contact/referrer left.\n\nThe rest of my references are professional, and on top of it I'm in a country where most people can't write in English, and has no culture of writing recommendation letters. So my professional references have all asked me to draft the letter for them, and then they'll edit and sign off on it, or else they won't write me one at all. Because the concept of them really just isn't a thing here, and they don't know how to start even. So, it turns out I have no contacts at all who could write me a letter on their own, without asking me to draft it.\n\nI see most schools don't allow LoRs in which the student had any part of drafting the letter. I just wonder, where does this leave applicants like me? Am I just not qualified to apply anywhere?\n\nI know my particular situation is rare but, I also know that many professors ask students to write or draft their own letters, so I can't be the only one in this situation.\n\nFor anyone who has faced this problem or can give any insight about it, could you please advise? Or is this saying that ppl like me just have no chance to go to graduate school?",
  "author": "SnakesOnAllThePlanes",
  "created": 1637776329,
  "updated": 1638206343,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlxgpn1": {
      "link": "/r/AskAcademia/comments/r1ax5k/impossible_to_get_a_proper_recommendation_is/hlxgpn1/",
      "text": "University graduate studies departments are staffed by humans, and as such I have to think that they would have some level of sympathy for your situation if you approached it in the right way. It might take applying to more programs than usual, but I’m sure you can do it if you persist. \n\nI would start by getting your remaining LORs from professional references. Then carefully write your cover letter, including a sentence or two to briefly say that your circumstances are unusual, and that you will detail this in a separate document. \n\nNext, write that document (call it a Personal Statement or something), and include a description of your background, your career path up to this point, why you want to go to graduate school, what you’ve been doing for the past 12 years, and why you’ve included professional instead of academic references. Make sure it’s worded in a positive and optimistic way, and highlight your strengths and why you know you will succeed in grad school. \n\nSome universities may even require this document. As one program I’ve been researching said, always be open and transparent. Don’t hide something that you see as a weakness, because the people you’re working with might see it as a strength. \n\nIn the meantime, if you’ve found a professor you’re interested in working with and that is interested in you (and you should absolutely do this before applying), why not volunteer to work in their lab? It’s a great way to get experience, show your work ethic, and get a feel for how you’ll get along with the person. They’ll get the same benefits, along with some free labor. \n\nHang in there, and good luck!",
      "author": "Coffee4MySoul",
      "created": 1637777575,
      "upvotes": 11,
      "replies": {
        "hlxmzgl": {
          "link": "/r/AskAcademia/comments/r1ax5k/impossible_to_get_a_proper_recommendation_is/hlxmzgl/",
          "text": "I agree with this. I would also add that it's very common for students to be involved in the writing of LoR. Professors often ask students to either write key points or sometimes even just write the whole thing. It's not allowed but it's very common. \n\nI think as a mature student with a professional background you're quite a strong candidate already and the above would probably work well.",
          "author": "ACatGod",
          "created": 1637780009,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hlztudj": {
      "link": "/r/AskAcademia/comments/r1ax5k/impossible_to_get_a_proper_recommendation_is/hlztudj/",
      "text": "As a director of a graduate program, I find it helpful when prospective students reach out to me and ask for my counsel on these matters. I can then give them advice relative to their situation. The added bonus is that I get to know the applicant a little, which helps me recruit the best match for our program.\n\n So, I would encourage you to reach out to the program director. If they respond to you, they may have helpful advice. If they do not respond, that may be indicative of their lack of response to their students in general, which is something to keep in mind if you're going to invest time and money into a graduate program.",
      "author": "Maleficor",
      "created": 1637813970,
      "upvotes": 5,
      "replies": {
        "hm0hdds": {
          "link": "/r/AskAcademia/comments/r1ax5k/impossible_to_get_a_proper_recommendation_is/hm0hdds/",
          "text": "This is wonderful advice, thank you! \n\nWould you recommend we reach out to the program director directly, or to the admissions offices, or the application help contacts? It seems each program provides so many different contact addresses that I'm always unsure which is the correct office/person to get in contact with about each issue.",
          "author": "SnakesOnAllThePlanes",
          "created": 1637828377,
          "upvotes": 1,
          "replies": {
            "hm2496i": {
              "link": "/r/AskAcademia/comments/r1ax5k/impossible_to_get_a_proper_recommendation_is/hm2496i/",
              "text": "The people I would consider contacting are:\n\nThe program's advisor (if they have one).\n\nThe program's admissions director (if they have one).\n\nThe program director (if that's all the program has).\n\nUniversities often have people involved in the admissions office for the graduate school overall, but these administrators and advisors are often very disconnected from all of the programs they serve. At my institution, for example, our graduate admission workers cannot answer most of the specific questions about our program, so they end up referring the students to me or the program advisor (our associate director).\n\nYears ago I directed a graduate program (Masters) that could seat 20 students potentially (we had enough faculty and enough space) but we only had 3 students in the program. One year after taking directorship we had a full cohort of 20. Later, when asked how I did it with no advertising budget or travel, my response was simple, I merely answsered all of my emails and phone calls from prospective applicants, and did so in a friendly way.\n\nI have noted that when a program faculty does not answer applicant questions, they less often avail themselves to student questions as well. Something to keep in mind as you are deciding if/when/where to attend a graduate program.\n\nI hope this helps.",
              "author": "Maleficor",
              "created": 1637862933,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}