{
  "sid": "pgd50w",
  "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/",
  "title:": "Take a part time research assistant position along with a full time PhD?",
  "text": "Hi friends, I have been asked to consider the position of an RA at a different lab than my PhD (part-time). I wanted to know if any of you have done anything similar and your experiences? I am keen to take on the position as it would add to my skill set and look great on the CV. But at the same time don't want to bite off more than I can chew. \n\nTips, tricks, advice welcome 😊",
  "author": "soul365",
  "created": 1630568370,
  "updated": 1634079431,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hbaile3": {
      "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/hbaile3/",
      "text": "I've been working part-time ever since I started my PhD - that's been my main source of income. It's doable, but you should be aware that your PhD project will suffer occasionally and will take longer than if you were to work on it full time; you will sometimes only have time to work on your PhD during the weekend, for example.\n\nIn any case, first check if your PhD advisors are OK with this; they will very likely expect you to focus on your PhD full time! If, however, you decide to take the job, my main advice would be to set very clear boundaries: since this is a part-time job, make sure to only work part-time and not more than that. For me, this has sometimes been a problem - because of an important work deadline, I would have to put in many more hours, which means I wouldn't be working on my PhD during that time and would have to compensate later.",
      "author": "al_m",
      "created": 1630570263,
      "upvotes": 6,
      "replies": {
        "hbake6r": {
          "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/hbake6r/",
          "text": "That's one of my issues, due to the nature of my PhD programme, during the research assistant-ship, I will be on lab roations as well. Is it necessary to inform the supervisors about it? \nIf I can work on the part time job on the weekends (it's remote)?",
          "author": "soul365",
          "created": 1630571871,
          "upvotes": 1,
          "replies": {
            "hban5lc": {
              "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/hban5lc/",
              "text": "I would say it's best to be open with your supervisors from the start in order to avoid having to justify yourself later, particularly if it turns out the job is a bit more demanding than you initially thought.",
              "author": "al_m",
              "created": 1630574397,
              "upvotes": 3,
              "replies": {
                "hbaogpd": {
                  "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/hbaogpd/",
                  "text": "That's a really good point. Thank you!",
                  "author": "soul365",
                  "created": 1630575578,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hbb4imw": {
      "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/hbb4imw/",
      "text": "I've known a number of people who took RAs in labs other than their advisor's. Income is income.\n\nIf you think you may run into conflict, probably should give your advisor a notice. \n\nDo be aware that you may run into deadline conflicts and will be expected to manage it.",
      "author": "rgbhsv",
      "created": 1630586306,
      "upvotes": 2,
      "replies": {
        "hbcf4u5": {
          "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/hbcf4u5/",
          "text": "Thanks! Good to know its a common occurence. And yes every little bit of money helps!",
          "author": "soul365",
          "created": 1630605933,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hbe5tra": {
      "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/hbe5tra/",
      "text": "As a PhD student,  i wouldn't have been able to do it. I was overwhelmed with what i had. Nobody in my program has ever done that. Too demanding. Now, as a PI, i wouldn't allow any of my PhD students to take employment at s different lab, even if part time. Here's why: as a PhD student in the states you have a teaching assistant appointment and a research appointment, each making up half of your contract,  which amounts to 40 hours a week. Additionally, you may pick up a few extra hours at the lab for dinner extra cash every semester, but nothing major. If you also take a job elsewhere, you won't be able to focus and generate what I'm paying you for. Since half of your salary comes from my grants, i must ensure you can give me everything. That's why i pay well at my lab. No part time gigs elsewhere",
      "author": "phenomenologist83",
      "created": 1630633363,
      "upvotes": 2,
      "replies": {}
    },
    "hbcsrbe": {
      "link": "/r/AskAcademia/comments/pgd50w/take_a_part_time_research_assistant_position/hbcsrbe/",
      "text": "Your advisor is currently not paying you?",
      "author": "NewAltProfAccount",
      "created": 1630611357,
      "upvotes": 1,
      "replies": {}
    }
  }
}