{
  "sid": "afj819",
  "link": "/r/AskAcademia/comments/afj819/a_big_thank_you/",
  "title:": "A big thank you!",
  "text": "So a few months ago I posted to this sub asking for advice regarding receiving a scholarship to NZ that I really wasn't expecting due to the competitiveness of it. \n\nIf course I would be stupid to say no so I will be re-locating to NZ this year with my partner to get my PhD which was the dream for the duration of my MSc and I only stopped believing it would happen because the funding source that I was extremely confident about fell through.\n\nIt is an absolute dream to both live in NZ and pursue the PhD and lurking on this sub when I was spending countless hours on my applications and reading information and advice from folk here about all things academia has reinforced my decision to advance with research. \n\nThank you all and good luck in all of your endeavours! \n\n",
  "author": "CR-Aesthetics",
  "created": 1547385231,
  "updated": 1634081951,
  "over_18": false,
  "upvotes": 101,
  "upvote_ratio": 0.97,
  "comments": {
    "edz4e6k": {
      "link": "/r/AskAcademia/comments/afj819/a_big_thank_you/edz4e6k/",
      "text": "Congrats! Make sure to enjoy the country while you are studying!",
      "author": "BananasonThebrain",
      "created": 1547389754,
      "upvotes": 11,
      "replies": {
        "edz5orh": {
          "link": "/r/AskAcademia/comments/afj819/a_big_thank_you/edz5orh/",
          "text": "Thanks!! I certainly shall be, I'm buzzing to go camping and immerse myself in nature to de-stress from the inevitable workload! ",
          "author": "CR-Aesthetics",
          "created": 1547391044,
          "upvotes": 8,
          "replies": {
            "ee177ol": {
              "link": "/r/AskAcademia/comments/afj819/a_big_thank_you/ee177ol/",
              "text": "Check out some of the rivers right along the highway maybe 15 km east of Queenstown. Absolutely gorgeous camping, minus the flies that eat you. ",
              "author": "notadoctor123",
              "created": 1547447066,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "edzqj4i": {
      "link": "/r/AskAcademia/comments/afj819/a_big_thank_you/edzqj4i/",
      "text": "Well done! I relocated to NZ for my PhD and wouldn't change a thing. It's an awesome place to live. Welcome! ",
      "author": "skididdle",
      "created": 1547405081,
      "upvotes": 9,
      "replies": {
        "edzqmte": {
          "link": "/r/AskAcademia/comments/afj819/a_big_thank_you/edzqmte/",
          "text": "Thank you! I'm glad to hear that, if you don't mind me asking where were you located in MZ for your PhD? ",
          "author": "CR-Aesthetics",
          "created": 1547405150,
          "upvotes": 4,
          "replies": {
            "edzqsfa": {
              "link": "/r/AskAcademia/comments/afj819/a_big_thank_you/edzqsfa/",
              "text": "I was based at Lincoln in Christchurch but I'm in Auckland now. Feel free to pm me if you need tips or advice about moving here!",
              "author": "skididdle",
              "created": 1547405253,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}