{
  "sid": "iq5r1y",
  "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/",
  "title:": "Should social ethics be a required curriculum component for scientists/pre-health professionals?",
  "text": "Undergraduate senior here. My thesis project revolves around analyzing case studies of science and medical curriculum that discuss scientific professional ethics, and then recommending a general chemistry curriculum with a greater focus on equity and understanding/recognizing personal and external bias, and analyzing ethical situation.\n\nMost professors believe that the ethics component should only be focused on teaching how to present “Good Science” and less on “personal conduct” (the argument being that you can’t change someones morals). My perspective is that by teaching awareness of historical and current social injustice in research and greater science, students begin to recognize more of their own and other biases, and may act accordingly. What’s your opinion?",
  "author": "246810you1",
  "created": 1599752426,
  "updated": 1634080668,
  "over_18": false,
  "upvotes": 209,
  "upvote_ratio": 0.93,
  "comments": {
    "g4pcsjz": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pcsjz/",
      "text": "I'd like to see some sources for the \"most professors believe...\" section of your post, since I have not heard a single colleague espouse that view over my time at multiple institutions. \n\nIn fact, most of us think it's a critical component of the curriculum....",
      "author": "Eigengrad",
      "created": 1599754823,
      "upvotes": 88,
      "replies": {
        "g4pdmt7": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pdmt7/",
          "text": "My source (Kovac. Scientific Ethics in Chemical Education. 1996) a little outdated but it was one of the starting sources for my personal  research on the subject. I don’t know if I worded it well; but the paper suggests that professors feel that reacting ethical dilemmas and situations comes from morals (which are usually established before students enter undergrad) and would be irrelevant to incorporate into the curriculum.\nThe lash-back that I’ve personally experienced is that some Professors don’t feel as if they have enough time to include ethics when they need to cover so much course material. That’s another issue though-",
          "author": "246810you1",
          "created": 1599755180,
          "upvotes": 13,
          "replies": {
            "g4pf9zc": {
              "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pf9zc/",
              "text": "IMO, that's an increasingly outdated view. I'd also note that in most departments, any faculty who were teaching in 1996 are likely retired or close to retired. \n\n25 years is roughly a \"generational\" changeover in faculty composition. \n\nI'd also say that Kovac's paper is very much a \"perspective\": they mention \"when I talk to my colleagues...\" rather than having, say, broad national statistics in terms of faculty perceptions. I'd be careful about generalizing one persons comments on their colleagues from 25 years ago to \"most professors\" broadly. Moreover, Kovac doesn't (from my quick reading of the paper) mention that \"most\" faculty feel that way, just that the those are the two most common objections they hear.",
              "author": "Eigengrad",
              "created": 1599755812,
              "upvotes": 56,
              "replies": {
                "g4pfhbr": {
                  "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pfhbr/",
                  "text": "Thats fair, and i definitely agree with regard to changing Professor’s personal values and ideals with regard to ethics. I don’t think that the curricula (from my experience and looking over other colleges course syllabi), have changed to reflect that",
                  "author": "246810you1",
                  "created": 1599755910,
                  "upvotes": 9,
                  "replies": {
                    "g4pg850": {
                      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pg850/",
                      "text": "Are you exclusively looking at general chemistry courses, or are you looking at chemistry curricula as a whole?\n\nI think there's a valid argument to be made that general chemistry (with a wide mix of majors and non-majors) is not the best place to extensively cover professional ethics, and that is better taught in either upper level courses or department specific seminars.",
                      "author": "Eigengrad",
                      "created": 1599756168,
                      "upvotes": 16,
                      "replies": {
                        "g4pgo5y": {
                          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pgo5y/",
                          "text": "I’m collecting information on all chemistry courses, but possibly limiting my curriculum suggestions to a general chemistry course. I actually think an intro course is a great place to start as it will have the largest reaching impact. I do agree that these issue-based/ethical conversations should continue and develop further in more upper level courses",
                          "author": "246810you1",
                          "created": 1599756372,
                          "upvotes": 1,
                          "replies": {
                            "g4pkz1e": {
                              "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pkz1e/",
                              "text": "I'd think carefully about the purpose (learning objectives) of a general chemistry course, and why you think it would be the best place for a discussion of ethics. \n\nJust because it reaches the largest audeince doesn't mean that the goals of a general chemistry course align well with these particular learning objectives. \n\nFor example, I'd consider the main purpose of a general chemistry course to introduce students to what chemists study and the lens through which they study it. While ethics is important, I have a hard time seeing how introducing interpersonal relationships and biases in experimental design fit in well with that course content, as the students aren't at the stage where they are actually developing their own experiments yet. \n\nThere are certainly ethical areas that can be introduced along with case studies (for instance, how we used to test toxicity, or how low funding has led to cutting chemical corners with respect to water quality in poorer areas, or any other number of things), but that's different than your suggested focus on \"personal conduct\" as a researcher.\n\n::edit- some examples:: For example, I talk about the Flint water crisis in my general chemistry class. \n\nI think content also matters. For example, a lot of the ethical issues with, say, testing drugs on traditionally white male candidates has led to severe issues in safety. But that's more suited for an organic chemistry / biochemistry / med chem course.",
                              "author": "Eigengrad",
                              "created": 1599758048,
                              "upvotes": 16,
                              "replies": {
                                "g4pl6zc": {
                                  "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pl6zc/",
                                  "text": "Thank you so much for your advice! This is definitely something really important to consider",
                                  "author": "246810you1",
                                  "created": 1599758125,
                                  "upvotes": 2,
                                  "replies": {
                                    "g4plp6m": {
                                      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4plp6m/",
                                      "text": "Sure thing! If you want to chat more as you're thinking through this, I'm happy to.",
                                      "author": "Eigengrad",
                                      "created": 1599758300,
                                      "upvotes": 4,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g4pgpaf": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pgpaf/",
      "text": "What is your basis for saying that this isn't already incorporated into curricula? I didn't go to a particularly progressive school (10-15 years ago) and research ethics were a topic of discussion in every class that remotely touched on human subjects research or science history (mostly biology courses). We also touched on biases particularly related to funding sources. In my grad courses we talked more about the erosion of trust in science and how that is fueled by high-profile cases of data manipulation, a rise in private interest funding of research to compensate for a decline in federal funding, and waning quality of science journalism that therefore mandates us as scientists to learn to better communicate our ideas and findings on our own terms.",
      "author": "MidnightSlinks",
      "created": 1599756386,
      "upvotes": 26,
      "replies": {
        "g4ph1zx": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4ph1zx/",
          "text": "Wow! I definitely have not heard of many people having these types of experiences, but I’m so glad to hear that these issues are being discussed at an undergrad level. I find that biological sciences do touch a little more on research and social ethics, but I haven’t seen the latter referenced much in my time as a chemistry student",
          "author": "246810you1",
          "created": 1599756557,
          "upvotes": 1,
          "replies": {
            "g4srwc6": {
              "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4srwc6/",
              "text": "In my first PhD program, a research ethics class was required for 100% of students. Don't do the class and you can't graduate from any degree. I had to attend even in theoretical physics. And this was in Australia, where you don't even have classes at the start of the degree and it requires a completely separate system to enrol (and so the class is free, of course). It's way more common than you think. It's a legal requirement in a lot of places. You cannot work with potentially-sensitive data without the training.\n\nIf I have any gripes, it's the fact that these courses are too specialised to **your** subject and to biology and health sciences. STEM is lumped together far too much, and so I know a lot about the laws regarding psychology data, how long chemists need to keep records, but learnt nothing about the TMT or how theoretical physics (or astrophysics) intersects with ethics.",
              "author": null,
              "created": 1599803889,
              "upvotes": 4,
              "replies": {}
            },
            "g4s3hma": {
              "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4s3hma/",
              "text": "Does your chemistry major require any philosophy or ethics courses? \n\nFor instance my biology degree required a minimum of two semesters, with many of my higher level coursework requiring general ethics if not further study like health care ethics. I graduated in 2018 from that degree",
              "author": "wavvy_fiji",
              "created": 1599788289,
              "upvotes": 3,
              "replies": {
                "g4scno1": {
                  "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4scno1/",
                  "text": "Not at the undergraduate level! I do go to a liberal arts college that does require interdisciplinary courses as part of a graduation requirement.",
                  "author": "246810you1",
                  "created": 1599793204,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g4pg6ok": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pg6ok/",
      "text": "In my PhD, we had to take an ethics course like you're describing in order to keep our training grants.  It's probably already a lot more common than you think.",
      "author": "dontbothertoknock",
      "created": 1599756149,
      "upvotes": 20,
      "replies": {
        "g4pgdbl": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pgdbl/",
          "text": "Did you have any exposure to ethics in undergrad? Either through incorporating discussions of issues into the class or as a possible extra clads to take?",
          "author": "246810you1",
          "created": 1599756237,
          "upvotes": 2,
          "replies": {
            "g4pgvae": {
              "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pgvae/",
              "text": "I know I discuss ethics a lot with my undergrads as a bio professor.  We're all encouraged to do so.\n\nAs an undergrad myself, I had to take a general ethics course, but none of my professors talked about it.  When I was TAing courses during my PhD, the professors definitely taught their undergrads a lot of ethics.",
              "author": "dontbothertoknock",
              "created": 1599756467,
              "upvotes": 3,
              "replies": {
                "g4phf12": {
                  "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4phf12/",
                  "text": "I loved discussing ethics in bio! I would definitely say that its an issue that is brought up more in the biological sciences, rather than the chemical sciences, and so I’m leaning to focusing on the lack of these discussions in undergrad chemistry courses. I think these discussions and learning about professional ethic issues should extend beyond a specific discipline/ grad school",
                  "author": "246810you1",
                  "created": 1599756721,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g4pp7kg": {
              "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pp7kg/",
              "text": "I took a series of pre-grad courses that was essentially \"how to academia\" as an undergrad and there were classes dedicated to ethics in research practice, personal conduct/sexism/racism, etc. I took a similar seminar my first semester of grad school. Plenty of other classes have mentioned it in a more one off manner, especially if human data is involved, and have had to do an online module on ethics for every lab I've joined. I'm not sure more would change much. A lot of the problems aren't because people don't know, it's because they don't care, they probably won't get caught or punished, and there's a lot of incentive to do so.",
              "author": "mediocre-spice",
              "created": 1599759490,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g4qe4n5": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4qe4n5/",
      "text": ">Most professors believe that the ethics component should only be focused on teaching how to present “Good Science” and less on “personal conduct” (the argument being that you can’t change someones morals). My perspective is that by teaching awareness of historical and current social injustice in research and greater science, students begin to recognize more of their own and other biases, and may act accordingly. What’s your opinion?\n\nThat depends.\n\nIf you're wanting to expand the ethical curriculum to include what you want, then sure, go crazy.\n\nBut if you're wanting to add in this curriculum *at the expense* of the older ethical curriculum; that's a ***hard*** no.\n\nIn my own ethical courses in engineering (one mandatory in undergrad, another mandatory for PhD), there are clear topics that need to be discussed first and foremost. Social justice topics can find their way in, but it *cannot* be at the expense of reminding engineers that if they don't do their jobs correctly, [bad things happen.](https://en.wikipedia.org/wiki/Chernobyl_disaster) There's only 24 hours in the day, a strict limit of credit hours, and a very long laundry list of more important topics, which is why the engineers would prefer to delegate the social justice topics to those who can actually afford the time to spend on those matters.",
      "author": "r3dl3g",
      "created": 1599766153,
      "upvotes": 15,
      "replies": {}
    },
    "g4roj30": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4roj30/",
      "text": "As someone who has had medical ethics in medical school: it doesn't work. It just teaches people how to rationalize self-serving actions with justice vs autonomy vs benevolence. It doesn't improve ethical decision making, it just teaches people how to defend their crimes with some superficial bullshit.",
      "author": "ColorsYourLime",
      "created": 1599780473,
      "upvotes": 6,
      "replies": {}
    },
    "g4p6n79": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4p6n79/",
      "text": "I agree with you. In the current university where I work, this is a focus even in undergrad.",
      "author": "TGMPY",
      "created": 1599752981,
      "upvotes": 4,
      "replies": {}
    },
    "g4qie2i": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4qie2i/",
      "text": "Research ethics is a required class in every science department I’ve ever been in or taught in. It’s even required here in industry. I don’t know where you’re getting your facts from? But likely you need to update your sources, as these courses and workshops are required for almost every funding source (and you can’t have a program without funding) under the sun.",
      "author": null,
      "created": 1599767345,
      "upvotes": 6,
      "replies": {
        "g4qt65c": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4qt65c/",
          "text": "Yeah it was a mandatory course in my PhD too but what does it teach really? Report honest data, give credit where it’s due. We did have a fun seminar by an invited speaker who wrote a book about how historically many landmark papers have data that cannot be reproduced. But when you talk about ethics in a broader context these mandatory courses hardly cover it.",
          "author": "sciencechick92",
          "created": 1599770119,
          "upvotes": 3,
          "replies": {
            "g4ssyg1": {
              "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4ssyg1/",
              "text": "Agreed - the mandatory classes are too general, probably because they're mandatory and everyone wants to get it out of the way with as little fuss/cost as possible. Putting all STEM together in one room over 3 days to learn research ethics is an **awful** idea. It inevitably ends up focussing on subjects where ethics considerations are backed by law and/or are more complex, like sciences that deal with humans or animals or run experiments. Theorists and pure mathematicians are forced to learn how long a psychologist must keep their records for but get no ethics training related to their own field beyond \"don't commit academic misconduct\". \n\nAt the same time, the work that us theorists do on supercomputers contributes more to global CO2 than our *travel* does. It's more significant than flying to conferences. And that's basically never mentioned. No one is taught responsible programming practices for reducing CO2 emissions. Even for observation for astronomy, no one is formally taught that our telescopes are on indigenous/traditional owner land or any part of the ethics considerations that should go into using data from those observatories.\n\nI think people would be far more engaged if the ethics was related to their own subject.",
              "author": null,
              "created": 1599804810,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g4pgi0n": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pgi0n/",
      "text": "I do but it by itself wont be a solution if students aren't motivated to engage, it's easy to pass a 101 without learning anything and STEM majors cant realistically be expected to be given much more mandatory classes than that, ethics training should be a starting point for later self directed learning which need to be something engaged with throughout their careers.",
      "author": "tc1991",
      "created": 1599756299,
      "upvotes": 4,
      "replies": {}
    },
    "g4pht6a": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pht6a/",
      "text": "Social justice and recognition of one's own biases is taught quite a bit in medicine. You might be interested in reading some of the literature on social accountability, which is quite the hot topic right now.",
      "author": "Bright_Page",
      "created": 1599756793,
      "upvotes": 4,
      "replies": {
        "g4puqzo": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4puqzo/",
          "text": "Yet, there is still so much bias and stereotypes that influences how people are treated when seeking medical assistance... especially in the United States.",
          "author": "SpartyAC3_LZ",
          "created": 1599760938,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4r05sb": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4r05sb/",
      "text": "We do have an ethics course as part of my graduate program that discusses personal responsibility and making sure you're aware of others circumstances.",
      "author": "Littlefingersthroat",
      "created": 1599771813,
      "upvotes": 3,
      "replies": {}
    },
    "g4qjo09": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4qjo09/",
      "text": "Well, the general chemistry curriculum is notoriously overburdened with too much content with an instructional tendency to focus on topics that are more physical science than general chemistry. The criticism of \"an inch deep and a mile wide\" is reflected in the rapidly expanded textbooks, which when from 90ish pages in the early 1900s to several hundred pages now.\n\nI work in curricular design and reform in chemistry education. Adding socio-scientific issues is a low priority, especially because they are poorly incorporated and assessed. It's not that they're not important but the bulk of these ethics issues need to be taught within a discipline like philosophy, and we can work across disciplines to build on those ideas within a chemistry context. It's hard enough to fix general chemistry to get instructors to focus on the chemistry, and I would argue that most of us do not have the requisite expertise in ethics to give a comprehensive view anyway.\n\nWorst case scenario, build it into lab. Most institutions don't have laboratory courses that use evidence-based curricula anyway.",
      "author": "Schweizers_Reagent",
      "created": 1599767650,
      "upvotes": 6,
      "replies": {
        "g4qmzm8": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4qmzm8/",
          "text": "I like your suggestion of building in ethical components to lab courses. When I've taught them I've always tried to stress the importance of reporting data accurately and so on, but I can see room for broader discussions at the gen chem level. \n\nThere will be significant resistance though, because many lab classes are packed with experiments and no time for discussions.",
          "author": "sailingpj",
          "created": 1599768525,
          "upvotes": 4,
          "replies": {
            "g4qx29b": {
              "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4qx29b/",
              "text": "Excellent point! Even though we have no evidence that supports such a structure, lab courses are jam-packed with 14 weeks of cookbooks. We can scale back to fewer projects over multiple weeks and ask students to do the same experimental/technical skills while also giving them a chance to think about how what they just did connects to ethics, socio-scientific issues, or even just revising and collecting more data to refine.\n\nPlus, lab courses are less political to change. Faculty don't want to be told what to do, so changing lecture-based courses is really tough. Starting in the lab is already more student-centered and hopefully shows our future colleagues (the grad TAs) what our learning environments and curricula could be.",
              "author": "Schweizers_Reagent",
              "created": 1599771088,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "g4pzwcq": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4pzwcq/",
      "text": "What is your basis for establishing the curricula? If you're looking at \"degree requirements\", you're not going to find squat. At a minimum, you need to be surveying to the individual course syllabus level for this question, because you will rarely find an entire course dedicated to, for example, bioethics, as a required part of a major. Such courses, when they exist, are often taught out of Philosophy departments rather than Biology/biochem/neuro/etc. However, virtually every Biology-ish course involving human or animal research incorporates ethics during the course of lectures.\n\nI agree with others - general chem/general bio is a terrible place to ~~introduce~~ focus on ethics, not least because students don't have enough of a knowledge base to have those types of discussions.",
      "author": "guttata",
      "created": 1599762257,
      "upvotes": 3,
      "replies": {
        "g4rv9yo": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4rv9yo/",
          "text": "I once took a week of a 'philosophy of science' course in undergrad and it was absolutely terrible so I dropped it, and it really was focused only for philosophy majors and nobody else.\n\nIn my degree (chemistry), some general ethics were discussed in English 101, the only required course for absolutely everyone at the university, and science-specific ethical issues were talked about at mid-level seminar and writing courses.",
          "author": "JHT230",
          "created": 1599783962,
          "upvotes": 2,
          "replies": {}
        },
        "g4q87fj": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4q87fj/",
          "text": "Definitely looking at individual course syllabi for chemistry courses and science courses that focus on science and social ethics for the most part of my research. While I do understand that coming into an intro course that focuses on ethics might be a lot for a first-year, I think its fundamental to begin bringing up awareness and academic discussion of the issues in class; then continue this work more in depth in higher level courses",
          "author": "246810you1",
          "created": 1599764504,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4rl9w4": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4rl9w4/",
      "text": "During my PhD (OChem) too, ethics was a required course. So naturally, everybody waited until the last possible moment to take that course.\n\nI think the PhD job teaches ethics better than any course theory.",
      "author": "Flatland_Mayor",
      "created": 1599778790,
      "upvotes": 3,
      "replies": {}
    },
    "g4s3w4a": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4s3w4a/",
      "text": "AFAIK, ethics classes are required by anyone receiving NIH money, at a frequency of at least 1 every 4 years.",
      "author": "RustyRiley4",
      "created": 1599788499,
      "upvotes": 3,
      "replies": {
        "g4tjp67": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4tjp67/",
          "text": "Exactly, this is a required component for many biomedical PhD programs, since most of us have funding through the NIH. I had two semesters of ethics",
          "author": "Thunders00",
          "created": 1599829991,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4s5oe7": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4s5oe7/",
      "text": "NIH T32 training grants require research ethics grants every 4 years for grad students. This is a huge % of biomedical research PhD programs at top schools and even the others end up following suit (at least at my institution).\n\nI'm an engineer by training so we do more professional development/ethics training comparatively than science majors in undergrad.",
      "author": "the_mullet_fondler",
      "created": 1599789418,
      "upvotes": 3,
      "replies": {}
    },
    "g4tszz1": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4tszz1/",
      "text": ">scientific professional ethics\n\nHere in Quebec (Canada), our university biology classes (bachelors) already cover it. We had a 1 credit class called \"bioethics\" and we went over why it was important and such. Falsifying data, informed consent, comfort/respect of lab animals, those kind of things.",
      "author": "WulfLOL",
      "created": 1599835228,
      "upvotes": 2,
      "replies": {}
    },
    "g4qfrl2": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4qfrl2/",
      "text": "I agree with you. \n\nI think most people dont realize that a lot of our medical knowledge comes from scientists experimenting on Indigenous people, slaves or other groups deemed suitable for live experiments. There are still many remnants of those practices today. People seem to think that scientists and thus doctors, are inherently objective but dont realize that there are some many ingrained injustices in how we practice science. I think learning this history will help highlight contemporary issues, for example, the lack of knowledge of heart disease among women.",
      "author": "frankie_prince164",
      "created": 1599766596,
      "upvotes": 2,
      "replies": {}
    },
    "g4py6pp": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4py6pp/",
      "text": "Social ethics in my opinion should not be just a checkmark on a degree plan. Ethics should be at the forefront of training for ALL professions that interface with human beings. It should start at the beginning of one’s academic journey and continue throughout. There should be deep, introspective, critical reflection at every stage of the way. For undergraduates this may look like a yearly reflection on their encounters with ethical dilemmas and how they navigated them. Graduate and Professional schools should require prospective applicants to submit portfolios based on ethics. \nAnyone who is remotely bothered by discussions on ethics or integrating ethics into academic programs are actively upholding structures that thrive on disenfranchisement of others. Professors not wanting to teach ethics/integrate it into their courses do not want to take ownership of the part they play in maintaining elitist and discriminatory practices of higher education and professional communities. \n\nI find it interesting that we want to focus on “good science” and not policing personal conduct until someone’s personal conduct impacts our lived directly... then we want to snatch their credentials and punish the hospital or even medical school where they attended... but things should have never gotten that far in the first place.",
      "author": "SpartyAC3_LZ",
      "created": 1599761813,
      "upvotes": 2,
      "replies": {}
    },
    "g4sbane": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4sbane/",
      "text": "It sounds like conversations over applied phenomenology might be of interest to you.",
      "author": "PM_MOI_TA_PHILO",
      "created": 1599792443,
      "upvotes": 1,
      "replies": {
        "g4schc0": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4schc0/",
          "text": "Thank you! I will look into it, I’ve never heard of this before",
          "author": "246810you1",
          "created": 1599793106,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4t1uxn": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4t1uxn/",
      "text": "This is a group of people that would make Machiavelli blush. The real question is if they would even be able to to follow their own rules. Something they struggle with as a group already.",
      "author": "Snowpossum",
      "created": 1599813893,
      "upvotes": 1,
      "replies": {}
    },
    "g4t8ru0": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4t8ru0/",
      "text": "This should be required reading for anyone doing research, https://drive.google.com/drive/folders/1bfLP2Y0rGJshBI2PIvUgQlvgSbZ6p2Bx, it’s an amazing document created in collaboration between researchers and the community being researched on expectations of ethical research.",
      "author": "Seasnek",
      "created": 1599821485,
      "upvotes": 1,
      "replies": {
        "g4txtlh": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4txtlh/",
          "text": "Thank you so much!!!",
          "author": "246810you1",
          "created": 1599837655,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4rxxnd": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4rxxnd/",
      "text": "Yes\n\n-sincerely, a college student",
      "author": "ekaplun",
      "created": 1599785345,
      "upvotes": 1,
      "replies": {}
    },
    "g4s7obf": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4s7obf/",
      "text": "Ethics should be required of everyone in STEM.",
      "author": "dali-llama",
      "created": 1599790489,
      "upvotes": 1,
      "replies": {}
    },
    "g4r58yp": {
      "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4r58yp/",
      "text": "[deleted]",
      "author": null,
      "created": 1599773093,
      "upvotes": -2,
      "replies": {
        "g4r5apu": {
          "link": "/r/AskAcademia/comments/iq5r1y/should_social_ethics_be_a_required_curriculum/g4r5apu/",
          "text": "*No professional*\n\n*Ethics should. Social ethics*\n\n*Is not relevant.*\n\n\\- e-phy-air\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
          "author": "haikusbot",
          "created": 1599773105,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}