{
  "sid": "hyoujr",
  "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/",
  "title:": "How is your work/life balance? What do you do for it?",
  "text": "Mine is pretty bad, I'm not gonna lie. I would like to get better at it, because it sucks and just overall makes me feel shitty. I'm a postdoc in humanities, and it feels like research invaded every part of my life. I work from home a lot, so that probably doesn't help.\n\nHow do you handle your work/life balance? Did you have at some point the realisation that you need to re-balance things, and did you succeed in doing so? Any tips on freeing my brain of this anxiety that I should be working all day every day of the week? Or should I be working all day every day of the week? I don't know anymore.",
  "author": null,
  "created": 1595840863,
  "updated": 1634081935,
  "over_18": false,
  "upvotes": 103,
  "upvote_ratio": 1.0,
  "comments": {
    "fze0sdo": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze0sdo/",
      "text": "By looking at it as a job. Seriously, what a couple of years in academia taught me is that you shouldn’t worry so much. For me it is a job, with my PI being my boss. If my boss thinks I do a shitty job while I am doing my best then I guess this job is not for me.",
      "author": "TrickBand5",
      "created": 1595843057,
      "upvotes": 124,
      "replies": {}
    },
    "fze4tph": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze4tph/",
      "text": "I think it's a real problem in the industry, and institutions should do more to help. If the system demands that people write papers and grants to continue their careers, the time necessary to do that should be protected during the regular working week. Instead, most of my time seems to be taken up by fairly useless committees and administrative bullshit that often means I get no actual research work done in a full working day. It systematically disadvantages people with caring responsibilities (disproportionately women), and creates an unhealthy lifestyle for the people who do say in the office until 10pm working on grants and papers. Unfortunately I'm my experience a lot of academics wear their late nights like a badge of pride. I've been called a 'part timer' for leaving the office at 5pm.\n\nPersonally I'm lucky that my boss is genuinely supportive of a healthy work/life balance, even though she doesn't practice what she preaches. I'm also lucky that my wife is also an academic researcher and has a similar attitude to me. We help each other to maintain a healthy balance, while also supporting each other to work late when it's really necessary.\n\nI increasingly feel that the academic research world is split into two types of people, and you have to choose between being the live-to-work researcher or the work-to-live researcher. At one point I think I could have become the former, with corresponding fast career progression and high profile in the field, but ultimately I've chosen to focus on my family life first, so I'm now a work-to-live researcher. Once you make peace with that, it's easier to begin treating research like a 9-5 job instead of an all-encompassing lifestyle. When I talk to some of the high-achievers who are unable to have a conversation about anything other than work, I feel relieved that I'm not one of them.",
      "author": "EmileDorkheim",
      "created": 1595847152,
      "upvotes": 68,
      "replies": {
        "fzfclmz": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzfclmz/",
          "text": "Not related, but Dorkheim is a genius username.",
          "author": "Guy_2701",
          "created": 1595872316,
          "upvotes": 6,
          "replies": {
            "fzflxqg": {
              "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzflxqg/",
              "text": "Thanks. I feel like a fraud because I don't know much about Durkheim, but I do like s stupid pun.",
              "author": "EmileDorkheim",
              "created": 1595876691,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "fze4d3r": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze4d3r/",
      "text": "One thing that really helps is to set aside a section of your home for work, like a work area. When you’re in the work area, you don’t do anything but work, but once you’re outside, you don’t think about or look at work-related stuff anymore. (An additional thing that helps is to have separate email clients for work and personal email, and quit the work client at the end of the work day.) \n\nAs for the FOMO, where is the anxiety coming from? Is it you putting undue pressure on yourself, or is it your workplace where such behaviour is allowed/encouraged? The latter would mean a toxic environment, and you ought to be thankful it’s only a postdoc and not a TT position. If it’s the former, well, try to remind yourself that you won’t do anyone any favours if you burnout two years in. At the end of it all, it’s really cool if your hobbies are giving you ideas that spark work, but you need to draw the line yourself between work and leisure.",
      "author": "HoolooVee",
      "created": 1595846702,
      "upvotes": 17,
      "replies": {
        "fzetzko": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzetzko/",
          "text": "I agree with the workspace separation! I also have little rituals I do to distinguish \"work time\" from \"home time\". In the mornings, I go for a walk or bike ride as my \"commute\" before I start work. In the afternoons it varies, but usually a meditation session or something to transition me mentally out of work mode.",
          "author": "LotusSleep",
          "created": 1595863411,
          "upvotes": 11,
          "replies": {}
        },
        "fzfu8dh": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzfu8dh/",
          "text": "I agree with setting a section of your home aside for work, even if it’s just the kitchen table. When I started working from home more often, I had a hard time making the transition from “working hours” to “off-hours” and I just felt the constant need to be working. Now, I have a place in the house designated for work and a designated stop time; once my designated stop time rolls around, I put all my work away and clean up my work space. It’s definitely helped me feel a lot more motivated to get work done each day during my designated working time.",
          "author": "kaloon2",
          "created": 1595880597,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fzepqry": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzepqry/",
      "text": "Pre tenure: Worked every weekend/holiday and many evenings for 5 years. Personal life and health on back burner.\n\nPost tenure: I work 40 hours a week during the school year, less in summer. Trying to be healthy now, have hobbies. I do nothing on Saturday and Sunday and it is glorious.\n\nIt used to be a cult and now it's a job!",
      "author": "raspberry-squirrel",
      "created": 1595861313,
      "upvotes": 15,
      "replies": {
        "fzeq97r": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzeq97r/",
          "text": "I keep telling myself \"it'll be better with a permanent position\", but I'm not sure my mental and physical health can wait until then. But I'm glad to know it's possible!",
          "author": null,
          "created": 1595861577,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fzek5p9": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzek5p9/",
      "text": "I’ve learned watching young investigators and professors that at least one day of the weekend is just to rest. I met a lot of researchers with health issues (physical and mental) because burnout.",
      "author": "totideshaga",
      "created": 1595858263,
      "upvotes": 12,
      "replies": {}
    },
    "fze59pw": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze59pw/",
      "text": "PhD student here. I would say the balance is pretty good in my favor. At least it is now. This is pretty rare for PhD students, especially on this forum, but I generally leave work at the lab, and take nothing home. This may change a bit early next year when I am actually writing the manuscript. But I think it is important to separate work/school and the rest of my life. This also can be seen as a big weakness, especially from other PhD students and Post Docs that brag about how many nights and weekends were spent at their home running models or writing. But I just have to look past that.\n\nTo expand a bit, the first few weeks of my program were a living hell. I just moved to a new country (and continent) without speaking the language and lived on the lab campus. I spent 12 hour days at the lab getting caught up with what the team were doing, and getting the models running on my PC. All the while I was searching for permanent housing, getting visa and other official documents filled, and meeting hundreds of new people. It was horrible. I think my advisors saw that too, and after I found my own apartment, they respected that I distanced myself more from work. I even asked for a VPN key so that I could check email or run a few experiments from home, and they said \"No, don't do that until you have to\".  Life can still be a living hell, but at least it isn't caused as much by so much pressure from work and the lab, and more still trying to learn the language and make close friends.",
      "author": "PlanetariumCaeli",
      "created": 1595847577,
      "upvotes": 24,
      "replies": {
        "fze8k7d": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze8k7d/",
          "text": "> \"No, don't do that until you have to\"\n\nThat sounds nice...\n\nMy PhD advisor told me they couldn't wait for me to understand what it was to be as overworked as they were. Later, I was congratulated on looking exhausted... It was more like \"you're finally a real researcher\" than something really toxic, but it did rub me the wrong way.",
          "author": null,
          "created": 1595850503,
          "upvotes": 21,
          "replies": {
            "fze9x2d": {
              "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze9x2d/",
              "text": "I think my advisor told me that because he was previously the one pushing for that sort of work \"ethic\" and saw how burnt out people get by it. That way of working is truly toxic and you, and every other researcher, deserve better.\n\nI've pledge myself to not sacrifice my mental health for unpaid overtime, even if I am still a PhD student. Hopefully it won't come to even being asked to do so. And luckily I am in a country with very good worker's rights, and am treated as an employee.",
              "author": "PlanetariumCaeli",
              "created": 1595851609,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "fzezggh": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzezggh/",
      "text": "A big thing for me was realizing productivity and hours worked are different things. There's a point each week where if I work more, it's going to be junk. If I go weeks and weeks without taking a full day off or doing things that are genuinely fun and distraction, all the work I do is slower and also often junk that I have to rewrite/recode/reread. It's not worth it and it's ultimately less productive than just taking the break. \n\nAlso: prioritization. Some things don't actually matter and I don't let myself spend more than the absolute minimum time on them.",
      "author": "mediocre-spice",
      "created": 1595866037,
      "upvotes": 9,
      "replies": {}
    },
    "fze50ou": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze50ou/",
      "text": "Trash. I moved back home to suppport my family and unfortunately did not get into a PhD program. My family doesnt understand grad school is a full time job as a parent with a masters did theirs online without a lab work, thesis, or etc. I also semi lost my job in the pandemic and frankly have been searching for positions that are not directly working with the public. I see a lot of people being stupid about the pandemic one way or the other.  So im stuck feeling busy all days of the week. I work on lab work during the week since my advisor does nothing during the weekend so I try to work when they are working so they can be reponsive with what they need and etc.",
      "author": "Anonymouswhining",
      "created": 1595847340,
      "upvotes": 6,
      "replies": {
        "fze8sm0": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze8sm0/",
          "text": "I'm sorry you're going through this. This pandemic is not helping any of us...\n\nLooking for positions is such a time consuming hellish thing... I'm pretty convinced this should be counted as research work. If it didn't mean listing my failures, which I'm still a little insecure about, I would list all of the places and fellowships I applied to, as part of my \"research activities\".",
          "author": null,
          "created": 1595850697,
          "upvotes": 4,
          "replies": {
            "fzemhae": {
              "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzemhae/",
              "text": "So true!!",
              "author": "Anonymouswhining",
              "created": 1595859564,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fzew6ov": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzew6ov/",
      "text": "I found that putting things on my calendar helped a lot. I make my calendar public to colleagues so that they know when is a good time to drop by. For a while, I had a standing two hour appointment three times a week titled \"1-on-1 w/ Brooks\" which was my pair of running shoes. No one ever asked questions about who Brooks was or why they needed so much of my time. I also scheduled dinner with my partner, and other activities that were important to my balance.\n\nThe flip side, is I also scheduled my work. If I had a major deadline coming up, I would block off parts of my schedule to specifically work on the project that was due. If I was presenting at a conference, I would specifically schedule time to prep.\n\nI've found that if it's on your calendar, people respect it. But this only works if you also abide by it.\n\nMy university offers all sorts of programs for helping PhDs and faculty learn time management skills. I scoffed at them until my PhD advisor essentially told me that I had to go to at least one. I went, learned a ton of new time management strategies, and it ended up completely changing how I approach work. It has helped a lot.\n\nI would say the biggest mistake that I see students and other faculty making is that they don't take advantage of all the resources at our disposal. If you have access to professional development, you should maximize your use of it.",
      "author": "radicalcartograph",
      "created": 1595864469,
      "upvotes": 6,
      "replies": {
        "fzfe9z3": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzfe9z3/",
          "text": "I've been thinking about making myself a work schedule that I would HAVE to respect. I need a cool name for my exercise time, though.",
          "author": null,
          "created": 1595873093,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzf9i16": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzf9i16/",
      "text": "Working from home has helped for me. \n\nI work in bursts.  There are many leisurely days, but other days when I feel excited or there is a deadline (whether self imposed or not) I might do a burst and work until night. If I feel burnt out I simply take days off.  \n\nSometimes when I don't feel like coding, I will read some book/papers and chalk that up as work too.  I also make sure I exercise almost every evening.  I also have some side-projects that I take really seriously and have nothing to do with research.I also have a wife and an active social life, so I may drop work and do stuff with them if it sounds fun.\n\nI am not sure if this is a balance. I guess the key is having other stuff to do, like projects, socializing, etc.",
      "author": "colddarkstar",
      "created": 1595870855,
      "upvotes": 4,
      "replies": {
        "fzfd78m": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzfd78m/",
          "text": "That sounds great, actually! And I relate with the working in bursts so much.\n\nI am making myself take time for exercising, time with friends and family, fun stuff, etc. but I feel SO guilty. Definitely some sort of FOMO like somebody suggested.",
          "author": null,
          "created": 1595872597,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fzelpw2": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzelpw2/",
      "text": "If you are working from home, and you are able, set up some kind of area where you work that is for work only. Don't let work invade your living room, or where you eat your meals. Create a physical barrier.",
      "author": "ardbeg",
      "created": 1595859139,
      "upvotes": 3,
      "replies": {}
    },
    "fzep1wl": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzep1wl/",
      "text": "I'm quite happy with work life balance. Having worked shifts for years, I am used to turning off at the end of my alloted work time and have been strict on doing so with WFH too. Not working on Mondays, I can be bad for scanning my emails for anything urgent (there never is) but this is more when near a deadline like the start of a module I'm teaching/leading on.\nAs a student (nursing) mentors made a point of telling me to have something I really enjoy outside of work to help me balance and switch off, and this has been so important for me to keep up.\n\nMy Dad's work contract (corporate marketing) is for his workload with no specified hours so he will often work later. I remind myself that I am contracted to X hours without TOIL so if I can't fit all my work in that time it's time to question the workload, rather than my working.\n\nYou can do anything, but you can't do everything!",
      "author": "GenderMHNurse",
      "created": 1595860952,
      "upvotes": 3,
      "replies": {}
    },
    "fze9uzz": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fze9uzz/",
      "text": "[deleted]",
      "author": null,
      "created": 1595851563,
      "upvotes": 6,
      "replies": {
        "fzexqmk": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzexqmk/",
          "text": "It's not the one or the other though. I know people who work 4-5 hours a day, and still have a good academic track record. I know people who work 10 hours a day and have a lousy one.\n\nIt's an uncomfortable truth (for me): everything I do is half chance *at best*. It's about who I happened to meet at a conference, about a comment I made during a talk that someone paid attention to, or just the fact that I happened to be at just the right time when there was an immediate need for someone with just your skills. \n\nThe best job I ever had in academia was one where someone took a peek at my publication list (which is embarrassingly short, I have like 6 in 8 years, although one of them has a few citations) noticed I had cited one particular paper and elaborated a bit on ideas in it, and that was that. \n\nI guess what I'm getting at is that ... don't fool yourself into thinking risking your health and only life on just work. Even if it feels like a calling. I know math is a tough field with a lot of competition.\n\nDeath and/or old age is coming. Fast.\n\nAaanyway, that's just, like, my opinion. Who cares, really.",
          "author": "atypic",
          "created": 1595865218,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fzeuo28": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzeuo28/",
      "text": "In quarantine, pretty much nothing\n\nI submitted everything I had to before quarantine began in my country. I also finished all classes last year. There are just not enough papers to keep me sat down 8h a day reading.\n\nSo, what I do is I read a paper during the day, if I find something interest. I look for webinars or webevents to participate.\n\nOtherwise, its pretty much leisure time. I've spent more time increasing my cooking skill than working on my Phd.",
      "author": null,
      "created": 1595863734,
      "upvotes": 2,
      "replies": {}
    },
    "fzexwvt": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzexwvt/",
      "text": "MSc student - mine's good so far, I treat it like a full time job. I don't work on weekends, I'm working from home right now so I usually start work as soon as I wake up (6-7) so I'm done for the day around 2-3. If I need to put in some extra hours in the evening I have no problem doing it, but I don't do anything I don't need to beyond helping out other people in my research group if they need it. \n\nIt helps that my regular summer job in undergrad was work from home so I kind of got used to it. As well, it helps that my hobbies are out of the house, so I just turn my phone off when I leave and any work or concerns can wait until I get home. \n\nAlso, my current supervisor doesn't breathe down anyone's necks, he also very much appreciates leaving the office at 5PM and doesn't expect apologies for not working overnight to run calculations like my old supervisor for my undergrad thesis lol. It's a really great group to work in for a lot of reasons, but I definitely appreciate not having to work 24/7 :)",
      "author": "Quiinton",
      "created": 1595865301,
      "upvotes": 2,
      "replies": {}
    },
    "fzf1ypp": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzf1ypp/",
      "text": "It has the potential to be horrible, but I’ve worked hard for a decade to get to a place where I can relatively successfully compartmentalize the two. Much to my wife’s chagrin, part of the strategy is to try to talk as little as possible about work bullshit. We don’t do the whole “how was your day” stuff. Once we’re home, we’re home. Let’s live our lives. That has been tough because my wife has been inculcated in that American psyche to feel as if she lives to work. I’ve been working hard to show her that, indeed, the opposite should be true.",
      "author": "waxlrose",
      "created": 1595867247,
      "upvotes": 2,
      "replies": {
        "fzfdrry": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzfdrry/",
          "text": "Don't you ever feel the need to vent?\n\nMy partner is an academic too, I don't know that we would be able to do that, but I like the idea. And I do sometimes ask him to shut up about work and talk about fun stuff.",
          "author": null,
          "created": 1595872860,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzfbujh": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzfbujh/",
      "text": "I’m happy with mine at the moment. I’m tenured and commute, and being able to work from home due to Corona has been a life saver as I was getting burned out. \n\nI haven’t thought about work once and treat it 100% as a job and that they are paying for my time. So I give them what they pay me for. And no more.\n\nWith Corona I’ve been able to be at home and use my time for spending with the family and doing the homeschooling, get in shape, and indulge in some hobbies.\n\nI’m going to milk the work from home for as long as I can! Hopefully the full next school year. The physical separation between life and work has been wonderful.",
      "author": "reversechinlock",
      "created": 1595871963,
      "upvotes": 2,
      "replies": {}
    },
    "fzg4jl2": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzg4jl2/",
      "text": "Mine is absolute ass because I have a full time job and I’m a part time PhD student. Ever since COVID, both work and school have assumed I’ve got “plenty of free time” and have piled on the projects. \n\nI love my research and hate my job and dream of being able to quit! But, you know, bills :)",
      "author": null,
      "created": 1595885607,
      "upvotes": 2,
      "replies": {}
    },
    "fzhaezu": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzhaezu/",
      "text": "I need to find it. One day.",
      "author": "FoCoCS",
      "created": 1595909142,
      "upvotes": 2,
      "replies": {}
    },
    "fzi8tdc": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzi8tdc/",
      "text": "Pretty awesome and it's one of the perks of my job. I get to hang out with my kid a lot, and just schedule work when I can around that. I feel fortunate being in a job where I can still get paid my normal salary, get caught up on work actually (grants, writing, applying to faculty positions) and completely make my own schedule. Yes this means working at weird times, and having occasions where I drop my son off at his grandparents for the weekend so I can write all weekend, but the pros way outweigh the cons for me.\n\nFor once actually, I can schedule work AROUND my hobbies instead of the other way around, which is a remarkable plus. My buddy wants to go for a random bike ride tomorrow morning? No problem, I'll just work late at night. I have daily 10 AM jiu jitsu classes I could never make if going into lab everyday? No problem, I wake up at 6 am and blast through a good chunk of work before class and then work late.\n\nMy advice: schedule things around your family, fun, etc., and don't think of academics as a 9-5. Work when you can. Have a place that's dedicated to work (I converted our spare bedroom into an office), but also work when you can (like maybe watching a movie with the family, pull up laptop and do some work).\n\nAlso, make a calendar and have weekly/monthly etc., goals (I 'owe' myself 3 papers, 2 grants, etc., by September, for instance). Don't be firm on when you need to work on those goals; but be firm on actually getting them done. Be realistic, but ambitious and work on the goals flexibly.",
      "author": "neuronsandbeats",
      "created": 1595939619,
      "upvotes": 2,
      "replies": {}
    },
    "fzf2x20": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzf2x20/",
      "text": "This isn't a cool \"tip\", but the thing that works for me is to decide that when I'm working, I'm working; when I'm off, I'm off. So, no \"writing\" or grading while I watch TV, and (ideally) no hanging out on the internet while I'm writing. This helped me publish an article or two per year while teaching 3/3 or 4/4 (humanities). If I got something done and wasn't futzing around but calling it work, that frees my brain a little bit when I take a break.\n\nNow, I have a 2-month-old, so I have to actually get something out of my hour or two of writing time every day (and I can't really be multitasking when I'm taking care of him).",
      "author": "huskiegal",
      "created": 1595867701,
      "upvotes": 3,
      "replies": {}
    },
    "fzfuvim": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzfuvim/",
      "text": "I had a great work life balance until covid. During the shutdown I had to switch to working from home, which was productive for about 3-4 weeks before I ran out of actual work I could do (I’m a bench scientist). My institution let/made us return to campus on 6/1 but instead of working 8-5 I now had to work 6am - 2pm. So I’ve been waking up at 5, working in lab until 1-2, then having to log on for zoom meetings 4/5 days a week that go until 3:30 but sometimes as late as 4:30. \n\nCommunication has really deteriorated between the lab members (we work on separate shifts) and now most of the interactions are negative (“who forgot to reorder X, or why did someone move Y”) etc. Everyone is stressed which isn’t helping.\n\nI’m trying to keep it together for the new students that joined our group, but I can’t keep this pace up for much longer.",
      "author": "Pathological_RJ",
      "created": 1595880903,
      "upvotes": 1,
      "replies": {
        "fzlhhdu": {
          "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzlhhdu/",
          "text": "I'm sorry you have to deal with all this, that sounds really tough... Hopefully it'll go back to being great when this crisis is finally over.",
          "author": null,
          "created": 1596003458,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzecbi1": {
      "link": "/r/AskAcademia/comments/hyoujr/how_is_your_worklife_balance_what_do_you_do_for_it/fzecbi1/",
      "text": "Take a break ager working six hours to get other stuff done, come back to work late at night.",
      "author": "lednakashim",
      "created": 1595853419,
      "upvotes": 1,
      "replies": {}
    }
  }
}