{
  "sid": "p2kadc",
  "link": "/r/AskAcademia/comments/p2kadc/masters_in_contemporary_art_m21/",
  "title:": "Masters in Contemporary Art [M21]",
  "text": "Hello guys! I hope it’s not OT, what are the best master’s degrees in contemporary art history in the World? Many thanks in advance from an Italian guy!!",
  "author": "Ok-Physics9111",
  "created": 1628710326,
  "updated": 1634079923,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.66,
  "comments": {
    "h8kzjkr": {
      "link": "/r/AskAcademia/comments/p2kadc/masters_in_contemporary_art_m21/h8kzjkr/",
      "text": "Since you are asking about the world: you might consider looking for the best Ph.D. programs in the US or Canada. They will include the equivalent of MA level classes and you can always leave with an MA. Advantage is: they are usually funded, while terminal MA programs usually are not.",
      "author": "ndrsng",
      "created": 1628716487,
      "upvotes": 1,
      "replies": {
        "h8ldfpf": {
          "link": "/r/AskAcademia/comments/p2kadc/masters_in_contemporary_art_m21/h8ldfpf/",
          "text": "Out of curiosity, is it specific to your field that in Canada it will include the equivalent of MA level classes like it does in the US? \n\nBecause im from Canada in STEM and that's not the case for my field (Phds are shorter than US PhDs too because of it). \n\nIt's different from STEM for psychology too from my understanding so i wonder if things are just generally different from STEM in canada on that level for PhDs. \n\n(My question is not intended to contradict you, I am just curious to know how it is outside STEM for PhDs and it's the first time I can grasp the opportunity to ask)",
          "author": "methomz",
          "created": 1628722463,
          "upvotes": 1,
          "replies": {
            "h8p5b1l": {
              "link": "/r/AskAcademia/comments/p2kadc/masters_in_contemporary_art_m21/h8p5b1l/",
              "text": "Hi, sorry to be so late responding. In my humanities field the Canadian Ph.D.s are like the US ones. I don't really know much about how other fields are.",
              "author": "ndrsng",
              "created": 1628799886,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h8moj5t": {
      "link": "/r/AskAcademia/comments/p2kadc/masters_in_contemporary_art_m21/h8moj5t/",
      "text": "I'm a lecturer in Art History (although not in contemporary art). I can speak for the UK.\nUCL is very good as will be the Courtauld, you would some of the largest galleries in the world to explore. Cambridge is good too with ready access to London and elsewhere. There's some very good people at York as well. Have a look through some of the staff profiles and see what interests you.",
      "author": "Fardays",
      "created": 1628754376,
      "upvotes": 1,
      "replies": {}
    }
  }
}