{
  "sid": "on6tbh",
  "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/",
  "title:": "Social media alongside large online undergraduate courses?",
  "text": "I'm thinking ahead to the next semester of teaching asynchronous online classes, and am wondering if anyone has any experience (positive or negative) using social media (Twitter/Instagram/something else?) alongside delivery of the material? I was wondering if and how it would be successful in creating a more engaging, fulfilling experience for the students...\n\nMy context: 200-level (2nd year, US) undergraduate class with \\~200-300 students. Introduction to oceanography which fulfils the Universities science requirement, so a mix of students with STEM, non-STEM and undeclared majors.",
  "author": "squeakycheezes",
  "created": 1626668927,
  "updated": 1634082508,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.94,
  "comments": {
    "h5r35tw": {
      "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5r35tw/",
      "text": "If you go this route, I recommend surveying the students who are registered and gauging their relative interest in/use of the various platforms. You would ideally be using a platform that your students are already on so this can integrate into their existing routines. What is unlikely to result in robust participation is anything that requires them to visit an app for the sole purpose of participating in discussion for this course.\n\nIt should also be optional to participate since the TOS of those platforms are no joke and students may be boycotting one or more platforms for various reasons.",
      "author": "MidnightSlinks",
      "created": 1626702629,
      "upvotes": 11,
      "replies": {}
    },
    "h5qa7g6": {
      "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5qa7g6/",
      "text": "Not quite the same but I'm involved in a short course that I run every year. We've always used twitter as part of the course but we added in slack last year to counter the fact it wasn't in person. It was a slightly mixed response. The most engaged students engaged with everything we offered and then there were students who we literally never saw or heard from but we knew they were watching each session.",
      "author": "ACatGod",
      "created": 1626681720,
      "upvotes": 5,
      "replies": {
        "h5qahdh": {
          "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5qahdh/",
          "text": "That's a familiar dynamic, online or not! How did you use Twitter in the course?",
          "author": "squeakycheezes",
          "created": 1626681960,
          "upvotes": 3,
          "replies": {
            "h5qbdop": {
              "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5qbdop/",
              "text": "Well... That depends who was tweeting! We tweeted about sessions and gathered questions for panels on twitter. Generally we didn't have a lot of discourse on twitter but we did use it to up the energy a bit. We also used it to direct students to the next sessions and the slack channels and it was a good medium for our external speakers so they didn't have to join slack - they were able to tweet some replies or thoughts about the discussions we were having. \n\nI on the other hand mostly inserted cat GIFs with highly tenuous connections to the material we were discussing.  I basically shouldn't be allowed on social media.",
              "author": "ACatGod",
              "created": 1626682757,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "h5q1v0z": {
      "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5q1v0z/",
      "text": "You sound like an incredibly thoughtful instructor! I do think this would help up engagement- students always appreciate when it's clear their instructor is 'buying in' to make the content exciting, so I wouldn't be surprised if students felt more comfortable asking questions/attending office hours as well :)\n\nSome food for thought- with an async course, not all students will be in the US (or have access to a computer/mobile device, or internet away from campus). Re: non-US students, there may be access issues with international internet restrictions. Your uni may have a VPN that resolves this, but you might save yourself a headache by emailing your Centre for Teaching and Learning to get their perspectives on access! Best of luck with everything!",
      "author": "morganconsulting",
      "created": 1626674688,
      "upvotes": 8,
      "replies": {
        "h5qa8su": {
          "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5qa8su/",
          "text": "Very true about the buy in! Every other week we hold a discussion for about 30 students at a time about a relevant topic, things like sea-level rise, fisheries sustainability, geoengineering etc. I'm always impressed by how (most) students engage and seem to get a lot out of it, and it feels such a shame that they only get this space to engage live a handful of times a semester. I also see some students pivot their degree directions based on these interactions, so I think they are really important! The question is whether it is worth the extra effort- would they would really engage, given it wouldn't be mandatory... I think even sharing news articles/ retweeting relevant tweets could add something valuable.\n\nI hadn't thought about the access issue, thanks for flagging that!",
          "author": "squeakycheezes",
          "created": 1626681753,
          "upvotes": 1,
          "replies": {
            "h5qxfbl": {
              "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5qxfbl/",
              "text": "As well as technical restrictions involving access, you're also going to have some students who aren't willing to agree to the TOS for the various social media platforms, who don't want to support Facebook or Twitter or what have you for their role in almost destroying democracy, etc etc.",
              "author": "BarackTrudeau",
              "created": 1626699622,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "h5r1x3z": {
      "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5r1x3z/",
      "text": "Maybe something that would be useful is a discord or slack channel for students to both get to know each other while being virtual and for them to interact with you if they have any questions about the course material.",
      "author": "physics_masochist",
      "created": 1626702007,
      "upvotes": 2,
      "replies": {
        "h5rqeft": {
          "link": "/r/AskAcademia/comments/on6tbh/social_media_alongside_large_online_undergraduate/h5rqeft/",
          "text": "Its not worth taking the risk these days; if (e.g.) one student says something in the channel that another student finds \"offensive\" then there's a chance you might be blamed for facilitating the conversation. And given that almost literally everything is offensive at the moment, there's no point in opening yourself up to potential issues with no benefit in return.\n\nInteractions with students outside carefully curated venues should be minimised at this point in time, and you certainly don't want to be setting up any (non-moderated) discussion venues where you might potentially be held professionally liable for all comments.\n\nEven if your field doesn't have much potential for controversy, what do you if (e.g.) you encourage students to download discord and then one student insults/abuses another over private message on it? Or a guy uses it to ask out a girl and she decides its harassment/inappropriate? Its just a problem waiting to happen, and you don't need this hassle in your life.",
          "author": null,
          "created": 1626712957,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}