{
  "sid": "qzeexx",
  "link": "/r/AskAcademia/comments/qzeexx/considering_a_phd_in_marketing/",
  "title:": "Considering a PhD in Marketing",
  "text": "I’m in the final year of a Business degree and I’m considering pursuing a PhD in Marketing, Consumer Behaviour.\n\nMy situation is a bit of an odd one.\nI love learning about and researching Marketing but going into industry doesn’t appeal to me.\nI’ve some ethical issues with marketing, of course it’s in the realm of Business to Consumer Marketing..\nI just can’t shake the disdain for it.\nI’ve no interest in going to work at a marketing department.\nI know there are ‘good things’ to market but the decision isn’t always yours and ‘good thing’ is subjective..\n\nThat (tangent) being said, I find marketing fascinating.\nI’ve largely disliked/not cared for the rest of my Business degree but Marketing has kept me going.\n\nI’m a little stumped as to what to do career wise following my degree..\nI love marketing but don’t like the practice of it, so I’m considering a Marketing PhD in the realm of Consumer Behaviour.\n\nI’d also love to lecture.\nTeaching is something that’s always appealed to me, I’d be quite happy teaching marketing to a bunch of hungover first years given the opportunity. \n\nI’m just looking for some insight, any Marketing PhDs here?\nHow did you know if you were right to  pursue it?\nI’m sure those you half way through are disagreeing with your naive past selves, but even so, how did you decide?",
  "author": "seanf999",
  "created": 1637560363,
  "updated": 1637688582,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.67,
  "comments": {
    "hln7j5j": {
      "link": "/r/AskAcademia/comments/qzeexx/considering_a_phd_in_marketing/hln7j5j/",
      "text": "I'm in marketing (CB)! Prof now, but I did my PhD in marketing as well. I did my undergrad in psychology, and did research in the psych department as an undergrad. I really enjoyed my undergrad research, and volunteered at another psych department to get more experience and decide whether I really wanted to do research. When I was choosing grad schools to apply to and looking into who I might want to work with, I found that a lot of papers I liked were actually from people in marketing departments, and applied across both psychology and marketing. In the end I got into both psych depts and marketing depts and chose marketing for practical reasons -- my area of research spans across both psychology and marketing, but in psychology you do a 6 year PhD then a 2 year post-doc then hopefully get a job (but maybe do a second post-doc), whereas marketing post-docs are much much less commonly necessary (and a lot of people do marketing degrees in 5 years). \n\nMarketing is pretty different in different departments. In R1's, marketing departments are full of people with some background in psychology, doing work that could just as easily be in psychology, but in a marketing context. R1's really heavily value theory, and its often only a small group of people in the department who are really close to practitioners. On the other hand, at non-R1's, the expectation is that marketing isn't psychology, and should have more direct business implications, and psychology publications don't count toward tenure.\n\nI'd also echo the person who said to read Journal of Consumer Research papers to get a sense of what marketing research actually looks like (we massively simplify things for teaching, and marketing research may not look like what you think it is). JCR is viewed as an \"A\" journal across both R1's and non-R1's.",
      "author": "openunmarkeddoors",
      "created": 1637593176,
      "upvotes": 6,
      "replies": {}
    },
    "hlmkj5y": {
      "link": "/r/AskAcademia/comments/qzeexx/considering_a_phd_in_marketing/hlmkj5y/",
      "text": "Yea go for it. Loving the sound of one's own voice is always a good start for life in academia. Just FYI though that Marketing PhDs tend to lack connection to actual real businesses, especially in CB. Skim through the latest Journ of Consumer Research or Journ of Consumer Psych to see what I mean. If you wanna do a marketing PhD, be prepared to spend 3-4 years practicing to write something like that. You probably need at least two or three publications similar to those out of the gate to get a job.",
      "author": "gergasi",
      "created": 1637579573,
      "upvotes": 4,
      "replies": {}
    },
    "hlmhdkh": {
      "link": "/r/AskAcademia/comments/qzeexx/considering_a_phd_in_marketing/hlmhdkh/",
      "text": "I can't really comment on your question, as I am not in the field, but I want to commend you for your position. I also studied business, and found marketing both fascinating and abhorrent (in the tradition of Bill Hick's \"Kill yourself\" bit). I don't think the world needs more people trying to sell me stuff.\n\nWhatever you decide, good luck! It is always a good sign when people consider ethics as part of their career choice.",
      "author": "RomanTeapot",
      "created": 1637576885,
      "upvotes": 3,
      "replies": {}
    },
    "hlmlzjg": {
      "link": "/r/AskAcademia/comments/qzeexx/considering_a_phd_in_marketing/hlmlzjg/",
      "text": "I'm not in marketing, but you seem to be a good fit for a career in academia.\n\nI suppose you know this but be prepared for having students who question you for not going to industry. \n\nIn any field where there is a lucrative alternative job market, you will always have to deal with the \"Those who can't do, teach\" crowd.",
      "author": "molobodd",
      "created": 1637580740,
      "upvotes": 2,
      "replies": {}
    }
  }
}