{
  "sid": "ebkqdi",
  "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/",
  "title:": "How are committee members held accountable for passing bad dissertations/graduates?",
  "text": "Not that I'm advocating for any kind of punishment for busy faculty or anything, but I'm just curious.  There are lots of stories about committee members never reading their students' theses/dissertations - in fact, I suspect this happened to me when I finished my master's.  I'm sure plenty of graduates get through that never should have passed.  Is there any mechanism by which committee members are held accountable for this other than a nosy individual or reporter looking into it and trying to make a big deal out of it?",
  "author": "thatisUnnecessary",
  "created": 1576528433,
  "updated": 1634081858,
  "over_18": false,
  "upvotes": 110,
  "upvote_ratio": 0.99,
  "comments": {
    "fb61rgq": {
      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb61rgq/",
      "text": "Not that much, to be honest. Bad dissertations don't often get the students the sorts of jobs where anyone would care.\n\nAnd short of some actual fraud at work, there isn't much interest in that sort of thing. So and so had a poorly thought out dissertation - big deal. Particularly if they don't stay in academia.\n\nNow, all that said, advisors very much *do* pride themselves on successful students (where success is typically - but not always - defined as an academic career), so they have motivation to not pass a bad dissertation.\n\nThey have to be capable of telling the good from the bad, though.\n\nJunior folks on the committee are sort of screwed - it can cost them a lot to dig in their heels, especially if the chair is a senior person in the department. I left a committee because a masters thesis was going up a dead end and the chair wouldn't listen. It was costly, in terms of political fallout. At least locally; once I left no one cared.",
      "author": "ph0rk",
      "created": 1576539235,
      "upvotes": 62,
      "replies": {}
    },
    "fb5nped": {
      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb5nped/",
      "text": "The primary mechanism would be their department gaining a reputation for their graduates being shit hires.",
      "author": "lucianbelew",
      "created": 1576530986,
      "upvotes": 146,
      "replies": {
        "fb67u7u": {
          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb67u7u/",
          "text": "That would take many years though wouldn't it? And also, the majority of students would have to be really bad when in reality its usually that most of the students are OK and its just a few bad ones that slip through the cracks.",
          "author": "stathicus",
          "created": 1576543559,
          "upvotes": 21,
          "replies": {
            "fb6j3g7": {
              "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6j3g7/",
              "text": "Oh, please don't mistake my reply for any sort of suggestion that there's a robust mechanism for accountability.",
              "author": "lucianbelew",
              "created": 1576551547,
              "upvotes": 39,
              "replies": {}
            }
          }
        },
        "fb66soj": {
          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb66soj/",
          "text": "So basically, they aren't.",
          "author": "airwalker12",
          "created": 1576542805,
          "upvotes": 39,
          "replies": {
            "fb6aq3b": {
              "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6aq3b/",
              "text": "[deleted]",
              "author": null,
              "created": 1576545643,
              "upvotes": 29,
              "replies": {
                "fb6mc78": {
                  "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6mc78/",
                  "text": "Not if you don't have any pubs...",
                  "author": "Average650",
                  "created": 1576553836,
                  "upvotes": 21,
                  "replies": {
                    "fb7t7r8": {
                      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb7t7r8/",
                      "text": "Who lets someone graduate with a PhD if they haven't published? It's a requirement at my institution.",
                      "author": "violaki",
                      "created": 1576598834,
                      "upvotes": 2,
                      "replies": {
                        "fb7ttu9": {
                          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb7ttu9/",
                          "text": "It is not at all institutions. \n\nIn some cases it makes sense. I know some students who have done good work for the army or airforce, but who faces serious issues in publishing their results because the army/air force did not want key parts published. There is a separate issue here of doing academic research under such restrictions but it's certainly not the student's fault. \n\nOn the other hand, it's my understanding that in some humanities fields the thesis itself is the big published work they produce, perhaps in a book or something. But I could be wrong about this. \n\nAnd of course, there are cases where there is no good explanation and which I will not try to defend.",
                          "author": "Average650",
                          "created": 1576599238,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "fb80hsm": {
                          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb80hsm/",
                          "text": "If I had a dollar for the number of times I (and my friends) have been passed over by hiring committees for an Ivy League grad with no pubs . . .",
                          "author": "headlessparrot",
                          "created": 1576603459,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "fb88q44": {
                          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb88q44/",
                          "text": "I didn't know this till later but apparently it wasn't a official requirement in my dept until a year before I started. And they only decided to include it because the chair let one of their students graduate with no pubs and that pissed everyone off. So now it officially says in the dept guidelines that you can't defend unless you have at least 1 first author publication in a peer reviewed journal.",
                          "author": "stathicus",
                          "created": 1576608586,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fb6dv3e": {
          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6dv3e/",
          "text": "And not getting more good students since the department metrics would suck",
          "author": "TheRightSideOfDumb",
          "created": 1576547848,
          "upvotes": 2,
          "replies": {
            "fb6h74v": {
              "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6h74v/",
              "text": "Does your department make metrics publicly available?",
              "author": "knockknockbear",
              "created": 1576550199,
              "upvotes": 3,
              "replies": {
                "fb6r68y": {
                  "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6r68y/",
                  "text": "Mine doesn't explicitly but it has an alumni page with links so you can check on how people are doing.",
                  "author": "FunnyMarzipan",
                  "created": 1576557714,
                  "upvotes": 2,
                  "replies": {}
                },
                "fbdk11o": {
                  "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fbdk11o/",
                  "text": "Getting slots for grad students is an internal thing.\n\nHaving students want to come here is an external thing.  My particular department is pretty good and training grad students, and they do a lot to promote their success, so they do sort of publicize the metrics and success stories.",
                  "author": "TheRightSideOfDumb",
                  "created": 1576764371,
                  "upvotes": 1,
                  "replies": {
                    "fbdkmj8": {
                      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fbdkmj8/",
                      "text": "My department would not have wanted to advertise its metrics.  It had something like a 60% attrition rate.  And despite ~1/3 of the incoming students being women each year, there were some years where zero women were awarded Ph.Ds.\n\nIn my case, there's no way to learn these numbers until it's too late and you're already in the program.  I wish the NSF would require that all departments who accept their grants make these metrics publicly and readily available as a condition of funding.",
                      "author": "knockknockbear",
                      "created": 1576764836,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fb6drx7": {
      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6drx7/",
      "text": "Unless you become famous, the only other person who will ever read your thesis is your mom\n\nWhat \"proves\" that you can do quality independent research is that you have published quality , independent research.",
      "author": "TheRightSideOfDumb",
      "created": 1576547786,
      "upvotes": 45,
      "replies": {
        "fb7196m": {
          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb7196m/",
          "text": "My mum did not :/",
          "author": "Menesio",
          "created": 1576568774,
          "upvotes": 17,
          "replies": {
            "fbdjj7c": {
              "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fbdjj7c/",
              "text": "My mum still asks me when I am going to be a real doctor.\n\nWhen I published my first paper, she asked me  1) how much extra I get paid for each thing I publish and 2) why my title had so many words and 3) does that mean I am going to be making a normal salary now?",
              "author": "TheRightSideOfDumb",
              "created": 1576763978,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fb6l1ck": {
      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6l1ck/",
      "text": "I've been the downvote twice on prelims and once on a defense. The \"pass with conditions\" was proposed in one case, and was reasonable. In the other cases the student's PI thanked me for speaking up - she had said all the things I said, but apparently he doesn't listen to women (he didn't listen to me either, so he doesn't have a degree).",
      "author": "skleats",
      "created": 1576552912,
      "upvotes": 29,
      "replies": {
        "fb80709": {
          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb80709/",
          "text": "...I get that being a female PI is hard (I'm a woman myself), but why did the student's PI allow him to advance to a defense if she had serious issues with his dissertation?",
          "author": "roseofjuly",
          "created": 1576603273,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fb629du": {
      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb629du/",
      "text": "The way I've seen it work is that bad dissertations never make it to defense. It should be the job of the diss adviser to make sure it's in good shape before offering it up for defense. For me, I made sure to have the okay of everyone on my committee before I even set a date for the defense. That being said, I have seen someone fail a dissertation defense.",
      "author": "enephon",
      "created": 1576539582,
      "upvotes": 28,
      "replies": {
        "fb67qdk": {
          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb67qdk/",
          "text": "Can you elaborate on the circumstances? Was the student just someone who didn’t get approval/advice from their chair or was it a technical error?",
          "author": "imbored_ANARCHY",
          "created": 1576543484,
          "upvotes": 5,
          "replies": {
            "fb6jnts": {
              "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6jnts/",
              "text": "It was a student who left the department ABD to take a job. As often is the case, it took him a while to finish and didn't have the best of communication with his chair. He wanted to get it done so he pushed it through to the committee and disaster struck. This was at one of the more prestigious schools in my field so that may have played a role too. At the time they were notorious for not getting candidates through in a timely manner.",
              "author": "enephon",
              "created": 1576551940,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "fb6lwc9": {
      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6lwc9/",
      "text": "My department has external examiner that reviews the dissertation and is an examiner at the defense. They are from a separate department within our college, with the idea being that someone who is not wrapped up in department politics will provide an ability to prevent obviously unqualified candidates from passing. No idea how well it works. But it sounds good in theory",
      "author": "Mallornthetree",
      "created": 1576553525,
      "upvotes": 9,
      "replies": {
        "fb7siev": {
          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb7siev/",
          "text": "I had the same on my committee; in fact, two committee members were from other universities.",
          "author": "AgoRelative",
          "created": 1576598366,
          "upvotes": 2,
          "replies": {}
        },
        "fb89xew": {
          "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb89xew/",
          "text": "I think this is pretty common and it honestly doesn't make a difference. The person outside the department isn't going to know enough about the student or their field to judge whether it's good or not. They're usually just there to make sure everyone follows the rules",
          "author": "stathicus",
          "created": 1576609333,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fb6n63u": {
      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb6n63u/",
      "text": "I have seen some internal accountability.  We had a faculty member that often chaired poorly done master's thesis projects.  The chair (signs off on proposals) and associate dean (signs off on thesis) started paying closer attention to his student projects, requiring rewrites when needed.\n\nAt my PhD program before I joined, many faculty had gained a reputation of passing poor dissertations, so the new chair actually rebooted the program.  They did not take grad students in for a year or two, hired several young hot-shot faculty, and did not allow most of the old-guard to supervise dissertations, resulting in some early retirements.",
      "author": "manova",
      "created": 1576554436,
      "upvotes": 9,
      "replies": {}
    },
    "fb7bl6c": {
      "link": "/r/AskAcademia/comments/ebkqdi/how_are_committee_members_held_accountable_for/fb7bl6c/",
      "text": "> There are lots of stories about committee members never reading their students' theses/dissertations - in fact, I suspect this happened to me when I finished my master's. \n\nI don't really know. In our dept. each is marked by two people, who have to submit their grades seperately before meeting to agree. If the original grades differ substantially, a 3rd marker is brought in, and that thesis goes to the external examiner, who gets a certain proportion of theses. \n\nIt isn't a perfect system but I think it's relatively well-functioning; relatively robust.\n\nWhat I do tell students though is: markers usually agree on the band (1st; 2.1; 2.2.) but the exact grade within those bands...I wouldn't take personally.",
      "author": "dl064",
      "created": 1576584095,
      "upvotes": 3,
      "replies": {}
    }
  }
}