{
  "sid": "oy0cu3",
  "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/",
  "title:": "Overcoming productivity guilt",
  "text": "I'm a 2nd (almost 3rd year) PhD student in a molecular bio lab (USA) and I've been away from the bench all summer (since early June) prepping for my prelim. I got a conditional pass on said prelim a few weeks ago, so now I have to spend even more time revising my proposal, and resubmit to my committee by august 15th.  I also went on a one-week vacation last week, and just got back last night, which is adding to my guilty conscience.\n\nBasically, I feel really guilty for two reasons: \n\n1: I've basically generated zero data this summer.\n\n2: I write way better from home, and get distracted by coworkers and lab issues on campus, so I haven't been physically present in lab a lot. I know it's okay because I'm still getting work done on my proposal, but I feel super self-conscious because the other grad student, postdoc, and techs, are in the office a lot more than I am. \n\nAny tips for overcoming this? Especially the self-consciousness. I'm just really worried all my coworkers think I'm lazy.",
  "author": "beepboopsboops",
  "created": 1628105453,
  "updated": 1634080005,
  "over_18": false,
  "upvotes": 82,
  "upvote_ratio": 0.95,
  "comments": {
    "h7ptgu0": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7ptgu0/",
      "text": "It's not as if you've been sitting on your bum doing nothing. The prelim is part of your PhD, in fact as is getting well-deserved vacation to recharge. It's unfair to yourself to only measure your productivity in terms of data, your activities over the summer have also been advancing your career.",
      "author": "turtlobenzene",
      "created": 1628106570,
      "upvotes": 31,
      "replies": {}
    },
    "h7pt479": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7pt479/",
      "text": "If they're postdocs and other grad students, they've been there, done that (or seen that if they're experienced lab managers/techs). They'll get it.\n\nNo one should judge, and if so, so what? That means they're just undergrads / not yet grad students. They don't get to judge.\n\nNow. You should focus on fixing, get off this reddit, and then get back to the bench. No more guilt, problem solved lol\n\n&#x200B;\n\nWishing you good luck.\n\nBG",
      "author": "burntoutgradstudent",
      "created": 1628106425,
      "upvotes": 40,
      "replies": {}
    },
    "h7puuiu": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7puuiu/",
      "text": "I mean with the pandemic and lockdowns, I don't think anyone would be quick to judge anyone in terms of productivity.",
      "author": "stdoggy",
      "created": 1628107153,
      "upvotes": 10,
      "replies": {
        "h7rdtdl": {
          "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7rdtdl/",
          "text": "I need to hear this. But still, the guilt of being sluggish and unproductive working from home is a real thing. Its so hard to just shrug it off",
          "author": "Potential_Ad_2577",
          "created": 1628132458,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h7qtj8m": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7qtj8m/",
      "text": "Sending you strength and positivity OP!! ✨✨",
      "author": "afrikanturtle",
      "created": 1628122643,
      "upvotes": 2,
      "replies": {}
    },
    "h7rokpe": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7rokpe/",
      "text": "It’s worth it to get it done however you need to do it, then you can get back to it. Better than it being prolonged. Give it the commitment it deserves and yourself the mental necessity of not doing both at the same time",
      "author": "onetwoskeedoo",
      "created": 1628138509,
      "upvotes": 2,
      "replies": {}
    },
    "h7rqcgp": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7rqcgp/",
      "text": "No one gets anything really done year 2 besides their quals. Get them done and then get to work! It’s a marathon not a sprint. \n\nSending good thoughts as also a molecular bio PhD student starting year 5.",
      "author": "jlpulice",
      "created": 1628139591,
      "upvotes": 1,
      "replies": {}
    },
    "h7s8kaw": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7s8kaw/",
      "text": "I think so long as you are producing the work that you are intended to produce, this will speak volumes more than whether or not you are physically present in the lab. Just do your best and let your work speak for you!",
      "author": "Tired_Academic_",
      "created": 1628153630,
      "upvotes": 1,
      "replies": {}
    },
    "h7szfvh": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h7szfvh/",
      "text": "The best way to manage guilt about not meeting every demand on your time is to be able to prioritize well and then execute on a realistic and productive plan. As you advance in your career, there will be more and more important things you just don't have time or attention for. If you have a process you trust and are effective when working on the important things. You don't feel much guilt because you are confident that you are doing as much as can be expected and are doing what matters most. \n\nWhat others think is important as well. If you speak with confidence about what you are doing, others tend to think you have things under control and are productive. OTOH,If you complain generically about being overworked, they might think you are a complainer or a poor organizer. If you say nothing at all, what they think will have little to do with what you are really doing and you won't have a chance to find out what they think either.",
      "author": "IkeRoberts",
      "created": 1628171245,
      "upvotes": 1,
      "replies": {}
    },
    "h96p0zo": {
      "link": "/r/AskAcademia/comments/oy0cu3/overcoming_productivity_guilt/h96p0zo/",
      "text": "loss of productivity is factored into the prelim. Also, people are too wrapped up with themselves to be thinking about you. I've rarely had the thought that some person is lazy unless they're really fucking lazy, like completely checked out. You're fine.",
      "author": "scintor",
      "created": 1629136915,
      "upvotes": 1,
      "replies": {}
    }
  }
}