{
  "sid": "pyh7qu",
  "link": "/r/AskAcademia/comments/pyh7qu/will_a_selffunded_ma_affect_my_chances_of_getting/",
  "title:": "Will a self-funded MA affect my chances of getting into a good PhD?",
  "text": "I know this is potentially a dumb question as the conventional answer is \"don't fund your own research-thesis-based MA\". However, from what I have been searching around re: funding, as a non-EU citizen, it sounds nearly impossible for me to secure external funding for an MA in the EU (no I am not a US citizen either, I am from Southeast Asia). From what I have seen, most people in my position take government scholarships and then serve a government bond.\n\nI have my own money to do the MA (which is in Communications), but I am mostly concerned by whether or not self-funding will impact my chances of doing a PhD after it. I know that doing a PhD in the EU requires a masters, and that there is funding at the PhD level. But I have been told that self-funders \"don't get respect\", and continuing in academia will be difficult if I self-fund my masters.\n\nI would just like to know if this is true, and what would be a better route if so.",
  "author": "ramune_0",
  "created": 1632998672,
  "updated": 1634078802,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "heufswl": {
      "link": "/r/AskAcademia/comments/pyh7qu/will_a_selffunded_ma_affect_my_chances_of_getting/heufswl/",
      "text": "Self-funding your master's is standard pretty much everywhere in the EU and absolutely not stigmatised.",
      "author": "simoncolumbus",
      "created": 1633006796,
      "upvotes": 14,
      "replies": {}
    },
    "heuj2se": {
      "link": "/r/AskAcademia/comments/pyh7qu/will_a_selffunded_ma_affect_my_chances_of_getting/heuj2se/",
      "text": "No, it's super normal to self-fund your masters, especially in the EU. I did and now I'm in a US PhD, and I have plenty of pals who similarly did it and then went on to phd. You'll be fine.\n\nAnyone who said self funders don't get respect is talking crap. Obviously getting funding looks good, but it's pretty damn rare.",
      "author": "A1B6",
      "created": 1633008413,
      "upvotes": 8,
      "replies": {}
    },
    "heuzmaw": {
      "link": "/r/AskAcademia/comments/pyh7qu/will_a_selffunded_ma_affect_my_chances_of_getting/heuzmaw/",
      "text": "self-funding a PhD is often not recommended, as there's usually enough funding for those and it's not a very practical choice, but funding for MA/MSc's in Europe is pretty scarce (unless your job is paying for it or something) so self-funding it is really almost the only option.",
      "author": "Competitive-House202",
      "created": 1633015618,
      "upvotes": 5,
      "replies": {}
    },
    "hevw01f": {
      "link": "/r/AskAcademia/comments/pyh7qu/will_a_selffunded_ma_affect_my_chances_of_getting/hevw01f/",
      "text": "This may be a naive answer, but I'm studying my master's degree in Denmark right now, and I don't think any MAs here are self-funded. We usually call the candidate's degrees (translated from Danish), so you might want to look at that? Again, I may be a little too hopeful of the European systems, but one can dream!",
      "author": "vict0301",
      "created": 1633029040,
      "upvotes": 1,
      "replies": {
        "heyqrv8": {
          "link": "/r/AskAcademia/comments/pyh7qu/will_a_selffunded_ma_affect_my_chances_of_getting/heyqrv8/",
          "text": "Yeah, some master's in Denmark are self-funded. Some international students pay, I knew Americans and other non-EU students at KU who did. There's also the situation for people who've already had one paid for by the state who have to then self-fund for their second.\n\nhttps://studies.ku.dk/masters/applied-cultural-analysis/application-procedure/non-eu-eaa-and-swiss-citizens/tuition-fee/#:~:text=Non%2DEU%2FEEA%20citizens%20are,to%20commencement%20of%20each%20semester.",
          "author": "A1B6",
          "created": 1633089102,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}