{
  "sid": "qy5i7m",
  "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/",
  "title:": "MSc in Applied Biochem looking to combine it with another MSc (reason included). Please help!",
  "text": "**Hello all, please read till the end to have the full image. Thank you!**\n\nI have graduated last year (2020) with an MSc in Applied Biochemistry. The name looks big but I actually lack ***a lot*** of \"applied\" lab methods and techniques, mainly due to our university's budget and inability to provide more materials but I am thankful regardless :).\n\nUnfortunately, in my country (3rd world, limited opportunities in STEM), there isn't a big demand for biochemists, there are no startups or companies where I can work in interesting jobs (very limited to basic work that any lab technician can do and that's it. You cannot move forward in your career).\n\n**I want to get another Masters degree :**\n\n* I am hesitant whether to seek another masters in Biochemistry (pick a program focused on the practical side)\n* or seek a different one in an area that I am interested in such as Bioinformatics, Molecular Biology, Biotechnology (open to suggestions, all subdisciplines of biology are interesting for me)\n* What degree, if combined with my theoretical knowledge in Biochem, can give me a big push in my studies and future career?\n* Based on my interests what countries offer the best Masters programs and what countries have a high demand for Biochemists, Molecular Biologists, Biotechnologist, Bioinformaticians?\n* Not important but curious : Which one of the above makes more money in EU or America? I guess more or less they make about the same?\n\n**Reason why not a PhD :**\n\n* When I check some programs, I see that I cannot fulfill some requirements such as \"wet lab\" skills\n* Many draw PhD as a very serious, somewhat tough commitment, and since I will be experiencing life abroad for the first time, I am afraid of failure\n* Overall not confident tbh, I rather form my self properly before engaging in a such step\n\n**About me :**\n\n* 25 years old Female from Algeria\n* Holder of a Master Degree in Applied Biochemistry (Good grades, 2020, Algeria)\n* Zero (0) work experience in the field of my studies\n* Three (3) years experience as an online Virtual Assistant\n* C1 in English, C1 in French, Native Arabic Speaker\n* Around 10K in savings (cannot save more)\n* I do not mind learning a new language, I don't have issues with any weather\n* Interested in Biochemistry, Molecular Biology, Bioinformatics, Biotechnology...\n* My Masters Thesis : *In silico* design of new inhibitors of an enzyme by molecular docking\n\n**I want to hear your suggestions or experiences and I will be really grateful for any advice or guidance.**",
  "author": "-insilico-",
  "created": 1637414592,
  "updated": 1637688598,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hle2ylc": {
      "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hle2ylc/",
      "text": "Hi,\nI cross my fingers for you! In my opionion the best for you would be experience. Some international companies, especially in pharmaceutics, offer traineeships, so you could get your way in.\n\nGood luck :)",
      "author": "Theobroma_cacao_2021",
      "created": 1637420449,
      "upvotes": 4,
      "replies": {
        "hlfq86g": {
          "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlfq86g/",
          "text": "It's a bit complicated since I am still in my home country (not many are present here). However, I will consider it and try to apply regardless. Thank you for your kindness and advice!",
          "author": "-insilico-",
          "created": 1637446331,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hleaqoa": {
      "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hleaqoa/",
      "text": "I'm not really sure how a second masters, regardless of the field, will alleviate the problems you mention. \n\n>Many draw PhD as a very serious, somewhat tough commitment, and since I will be experiencing life abroad for the first time, I am afraid of failure\n\nFor an bachelor's degree holder, yes. For someone with a masters and thinking about a second masters, no. At least in some parts of Europe you'd be looking at three years for the PhD vs two for the second masters. \n\nIn terms of immigration, a PhD is far more useful than a masters. In terms of funding, they are much better than a masters.",
      "author": "CheeseWheels38",
      "created": 1637423957,
      "upvotes": 3,
      "replies": {
        "hlfqmws": {
          "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlfqmws/",
          "text": "\\> I'm not really sure how a second masters, regardless of the field, will alleviate the problems you mention.\n\nI thought that applying to a program that has a lot of practical courses can be helpful.\n\nThank you for your insight, I will definitely keep in mind. I appreciate it!",
          "author": "-insilico-",
          "created": 1637446516,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hleigt6": {
      "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hleigt6/",
      "text": "Just popping by to say you are a total bad ass, good luck with everything. Keep being awesome!",
      "author": "IndustryOrgPsych",
      "created": 1637427296,
      "upvotes": 2,
      "replies": {
        "hlfqsop": {
          "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlfqsop/",
          "text": "That's so kind of you! Thank you so much, I wish you all the best",
          "author": "-insilico-",
          "created": 1637446590,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hleli3o": {
      "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hleli3o/",
      "text": "Why not do a PhD in computational biology/biochem or something along those lines. Don't need any wet lab experience for bioinformatic research!",
      "author": "TheScienceMothra",
      "created": 1637428559,
      "upvotes": 2,
      "replies": {
        "hlfr0aj": {
          "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlfr0aj/",
          "text": "You've got a point! I will consider that, thank you for the advice",
          "author": "-insilico-",
          "created": 1637446688,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlfcxj9": {
      "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlfcxj9/",
      "text": "I am going to be very honest. You need to immigrate to another country to have access to the exciting and high-paying positions. USA has a plethora of opportunities for biotech, but the UK, Switzerland, and Germany are also good locations as well.\n\nWith an Msc in an American biotech hub, you can be making $75-100k USD in a few years...",
      "author": "booklover333",
      "created": 1637440339,
      "upvotes": 2,
      "replies": {
        "hlfsdcy": {
          "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlfsdcy/",
          "text": "Thank you for the help! Do you think there is a high demand for Biotechnologists or for Biochemists?",
          "author": "-insilico-",
          "created": 1637447318,
          "upvotes": 1,
          "replies": {
            "hllus0b": {
              "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hllus0b/",
              "text": "Yes! It's not insanely high demand, but the job market's pretty hot for biotech research",
              "author": "booklover333",
              "created": 1637559108,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hlfpgp2": {
      "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlfpgp2/",
      "text": "I wouldn’t get a second masters. You would easily find a job in France. Particularly given Brexit has created an employment hole in the EU. If not look on the Marie curie actions website and find a paying internship or something. There are many many funding opportunities to support people from third world countries. Meanwhile I had no idea Algeria was third world!",
      "author": "ImeldasManolos",
      "created": 1637445982,
      "upvotes": 2,
      "replies": {
        "hlft9su": {
          "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlft9su/",
          "text": "\\> You would easily find a job in France.\n\nI cannot because we don't have \"job seeking\" visa option. Also, someone is highly likely to hire someone in France already than bring someone from Algeria.\n\n\\> There are many many funding opportunities to support people from third world countries.\n\nThat is true but I don't find Algeria listed in the opportunities that I find. I will keep on looking tough! Thank you for your insight, I am grateful",
          "author": "-insilico-",
          "created": 1637447726,
          "upvotes": 1,
          "replies": {
            "hlftnk0": {
              "link": "/r/AskAcademia/comments/qy5i7m/msc_in_applied_biochem_looking_to_combine_it_with/hlftnk0/",
              "text": "If I got a scientific visa from australia not knowing how to speak French, you, a person with a masters degree, who speaks c1 French and c1 English, with ambition, who is willing to go to lengths to achieve your dreams - as much as doing a second freaking masters, you can do it easily. All you need is a chance to find an internship or secondment in a lab that will boost your wet lab skills. You can do it! You have everything you need.\n\nEdit:\nYou need to identify labs that motivate and excite you and contact them. It will be much harder than getting a PhD but you have a good chance. \n\nWhat about applying in the UK? That’s how I got my post masters break. Just by virtue of the fact i had experience with mice I got a three year job!",
              "author": "ImeldasManolos",
              "created": 1637447903,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}