{
  "sid": "qsija2",
  "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/",
  "title:": "PEOPLE WITH A MASTERS OR PHD BUT WITHOUT A JOB IN ACADEMIA: Do you still feel like going to grad school was worth it?",
  "text": "I have job security and a decent salary right now, but I have no passion for what I do. I really want to go back to school and ultimately, ideally, work in academia. However, everyone is saying the job market is horrible and only getting worse. So here's my question... Say I *do* get a MA (and maybe eventually a PhD) and I can't land a good job because of the job market in academia... Would it maybe still be worth it? I'd be so much more knowledgeable, I'd have the title (stupid ego bullshit, I know), and I'd have done the thing I set out to do... Or would the pain of the debt and whatnot outweigh that?  Let me know your thoughts.",
  "author": "yungrobot",
  "created": 1636744518,
  "updated": 1636745365,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkd9dsi": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkd9dsi/",
      "text": "In my opinion, the only reason to do a PhD is if you can't bring yourself to do anything else---you want it that much. Then if you get a job or not, it was something you had to do. \n\nAnd then, only do it if you can manage financially **without** taking on debt.",
      "author": "Ike_hike",
      "created": 1636744776,
      "upvotes": 3,
      "replies": {}
    },
    "hkdapfp": {
      "link": "/r/AskAcademia/comments/qsija2/people_with_a_masters_or_phd_but_without_a_job_in/hkdapfp/",
      "text": "It was worth it. Went in for the PhD and left with a master's. Thought that was a bad thing until I entered industry. Zero regrets. Academia was miserable compared to what I've done since. The Masters has been very beneficial for job security.",
      "author": "Beakersoverflowing",
      "created": 1636745344,
      "upvotes": 1,
      "replies": {}
    }
  }
}