{
  "sid": "p5k1fv",
  "link": "/r/AskAcademia/comments/p5k1fv/question_on_ukscottish_academic_job_application/",
  "title:": "Question on UK/Scottish Academic Job Application",
  "text": "Hi fellow academics! I'm looking to apply for a lecturer position at a Uni in Scotland. The ad clearly states that all the \"essential\" and \"desired\" qualifications must be addressed point-by-point; however, it does not list the required materials. \n\nOn the application platform, there are upload areas for the CV, covering letter, and two optional fields: \"Qualification Details\" and \" Professional Bodies.\" \n\nThose who are familiar with the UK/Scottish conventions, would you advise I address these qualifications in the covering letter or a separate document (Qualification details) ? If a separate doc, what format would it take? Similar the to Five-Year Plan? I would be grateful for any pointers as a google search has not returned any relevant results. Thanks!",
  "author": "needlethreadscissors",
  "created": 1629132721,
  "updated": 1634079587,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "h96ve9t": {
      "link": "/r/AskAcademia/comments/p5k1fv/question_on_ukscottish_academic_job_application/h96ve9t/",
      "text": "Essential and desired qualifications are standard for any UK academic position. There must be a formal list somewhere. If they're not written in the jobs.ac.uk listing (which I assume you're referring to), then they must be on the institution site. If you still can't find them, then contact the department because it would be an error to exclude them.\n\nI would put them under \"qualification details\". Literally a point-by-point list addressing each one is best. Believe me, assessing these is a box-ticking exercise for the hiring committee members so make them as clear and simple as possible.",
      "author": "Vievite",
      "created": 1629139475,
      "upvotes": 6,
      "replies": {
        "h99wxx6": {
          "link": "/r/AskAcademia/comments/p5k1fv/question_on_ukscottish_academic_job_application/h99wxx6/",
          "text": "+1. Make it as obvious as possible how you meet each criteria. There can be hundreds of applicants for a position, so HR and the hiring committee look for reasons to exclude applicants and whittle the applicants down to a short list.  Your challenge at this stage is to avoid being one of the applicants being whittled out.",
          "author": "sbw2012",
          "created": 1629197957,
          "upvotes": 3,
          "replies": {
            "h9ucoi6": {
              "link": "/r/AskAcademia/comments/p5k1fv/question_on_ukscottish_academic_job_application/h9ucoi6/",
              "text": "I was on a job search committee recently. One of the essential criteria was large group teaching experience. We had a lot of applicants, and one way we initially narrowed the pool by checking to see who addressed this criterion in their cover letter or cv. Didn't mention it? In the bin.\n\nThis isn't just the committee being arbitrary, either. In my experience, committees have to report back to HR and show their work on who was and wasn't shortlisted with reasons for each decision linked to the published criteria.\n\nIn my experience, most people address essential/desirable criteria in the cover letter. Some even highlight key words in bold. I've also seen some people do a bullet point type list with a sentence or two on how they meet each criterion.",
              "author": "LookingOutFromDia",
              "created": 1629586304,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h96xb7b": {
          "link": "/r/AskAcademia/comments/p5k1fv/question_on_ukscottish_academic_job_application/h96xb7b/",
          "text": "Thank you! This is so helpful! There is a list, I just didn't know how to address it as part of the app material. I will do as you suggest and  try to make it very straightforward.",
          "author": "needlethreadscissors",
          "created": 1629140236,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h979j4z": {
      "link": "/r/AskAcademia/comments/p5k1fv/question_on_ukscottish_academic_job_application/h979j4z/",
      "text": "I've just started as a lecturer in art history at a Scottish University. The different criteria should be easy to spot in the cover letter, copy the language in the job posting very closely. They're not going to read it, just tick off the fact that you meet the necessary outline for the post.\nAs for qualifications,  I think I just put in my national teaching qualification and left it at that. \nLet me know if I can do anything else.",
      "author": "Fardays",
      "created": 1629145089,
      "upvotes": 4,
      "replies": {}
    }
  }
}