{
  "sid": "qsvo7q",
  "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/",
  "title:": "Tenure Track with Misdemeanor",
  "text": "As started to prepare my application package for tenure track. I am getting more worried about my recent DUI. \n\n1. I am really worried and same time disappointed at me. The career I was working for suddenly in grey cloud. \n2. Three months back, charged with misdemeanor DUI. \n3. Now, I am worried, how it is going to effect my career and job search. I am looking for a tenure track position in STEM field.",
  "author": "stats_soil_r_python",
  "created": 1636786844,
  "updated": 1637180917,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hkgwjve": {
      "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkgwjve/",
      "text": "Have you checked the employee handbook? Most institutions have a policy on this, and it is highly unlikely that this charge will affect your tenure. I am at a state university and was charged with a DUI the same year i went up and it didn't bear on the process at all. In fact the chair of my tenure committee knew what had happened and didn't bat an eye. I attribute some of this to having a pretty airtight tenure app and track record, but honestly a DUI shouldn't disqualify anyone. \n\nYou may need to report this to HR if you are ultimately convicted. However, again, consult employee handbook. \n\nGood luck!",
      "author": "Jazzlike-Article8374",
      "created": 1636819661,
      "upvotes": 4,
      "replies": {}
    },
    "hkktmzq": {
      "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkktmzq/",
      "text": "On our state institution campus a misdemeanor charge is not relevant to hiring nor tenure/promotion. They do run background checks for all hires and for all tenure decisions but misdemeanors aren't reported out of HR to the academic departments.",
      "author": "rockyfaceprof",
      "created": 1636890685,
      "upvotes": 2,
      "replies": {}
    },
    "hkfqjr0": {
      "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkfqjr0/",
      "text": "I would guess that all state universities, being public sector, will run a background check and disqualify you.\n\nMaybe not private schools?",
      "author": "nevernotdating",
      "created": 1636791339,
      "upvotes": 0,
      "replies": {
        "hkhc3ep": {
          "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkhc3ep/",
          "text": "I know two people who have gotten tenure track jobs at very reputable institutions with duis on record. One misdemeanor isn't going to hurt your chances. Just be honest on the app if you are asked. Ideally, get into a treatment program and specify that you have done so if there is a question on the app. \n\nAlso, don't give any info if you haven't yet been convicted. Most places ask if you have convictions. Some might ask about pending charges but I rarely see this.",
          "author": "Jazzlike-Article8374",
          "created": 1636826309,
          "upvotes": 2,
          "replies": {
            "hkhnzkf": {
              "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkhnzkf/",
              "text": "I am going to be upfront and let them know. I am really disappointed on me. I was putting so much effort to make this career to be an a Professor and a scientist to contribute to my field of study. Even published few high impact papers and developed two complete new methodologies and when its time to apply for jobs, somehow I ruined it.",
              "author": "stats_soil_r_python",
              "created": 1636831444,
              "upvotes": 2,
              "replies": {
                "hkhowus": {
                  "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkhowus/",
                  "text": "Do yourself a favor and stop beating yourself up so much about this. Tons of folks have these kinds of charges. Focus on your accomplishments and do what you need to do to reflect on your drinking and make sure this doesn't happen again. Steel yourself for this job market, man. It is brutal out there!",
                  "author": "Jazzlike-Article8374",
                  "created": 1636831841,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkfnm3h": {
      "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkfnm3h/",
      "text": "Unless you're going to be using controlled substances in a lab or you need access to children, I don't think anyone is going to check your record.",
      "author": "Ophelia550",
      "created": 1636788845,
      "upvotes": -5,
      "replies": {}
    },
    "hkjf5wj": {
      "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkjf5wj/",
      "text": "Job applications are going to ask about convictions, not pending charges. So if you have not been convicted yet, there’s nothing to report. In the USA, you are innocent until proven guilty in a court of law. Definitely get a lawyer if you’re in this situation. You might be able to reach a plea bargain with the prosecutor and avoid a conviction. This will cost you a good amount of money, of course. A cab would have been cheaper, right?\n\nWhen applying, don’t lie when they ask if you if you have ever been convicted of a crime. Most likely, they are looking for felonies. But not disclosing a misdemeanor is disqualifying as it is. I would not worry too much if it is an isolated incident. The search committee probably won’t pay much attention to the criminal history part and will be focused on your academic qualifications and accomplishments. The HR office will be looking for a pattern of past behavior, so if it’s an isolated incident, it probably won’t disqualify you. There has been at least one past president of the United States with a DUI on his record, and several congresspeople as well. I would be prepared to make a statement about the incident and what you have learned from it if it comes up in an interview. But if it does not come up in an interview, there is no reason to even mention it. It is what it is.",
      "author": "cashman73",
      "created": 1636858985,
      "upvotes": 1,
      "replies": {
        "hkjhr5w": {
          "link": "/r/AskAcademia/comments/qsvo7q/tenure_track_with_misdemeanor/hkjhr5w/",
          "text": "It is an isolated incident, there is nothing in my record except this. I agree, It was such a lapse in my judgement that day, I am still very disappointed at me for that day, a bad day, which will never happen again. \n\nThank you for your input, I will definitely let the HR know, if something comes up in the conversation or I need to mention in the application.",
          "author": "stats_soil_r_python",
          "created": 1636860261,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}