{
  "sid": "j9bjps",
  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/",
  "title:": "No matter what I do, I keep feeling the pull back to higher ed. I'm 28 and will probably apply for a PhD next year but feel like I'm too old and the market is too volatile. Thoughts?",
  "text": "I graduated from university several years ago now. I had intended to apply for a PhD straight out but didn't due to a combination of health issues, feeling insecure about my chosen PhD project, and imposter syndrome.               \n                     \nWell, at the end of last year it became clear to me that my mind was never going to stop gravitating back to higher ed. I just fucking loved it. I loved taking classes, I loved going to guest lectures and panels and doc screenings, and I really loved being a research assistant.          \n                           \nAnd, in a weird way, I felt a sense of kinship with my discipline (in the social sciences) and my professors. It's hard to not feel gushy about it all, but I felt it then (even when it wasn't easy) and I feel it now.               \n                       \nMy intention was to apply this year but all things 2020 really took a toll on me mentally, to the point where it really started to impact my physical health. So, sadly, I am not ready to apply for programs this cycle (and a lot of programs closed their admissions anyway).           \n                             \nAt this point, the insecurities have started flooding in. Partially because I feel like I'll be starting my PhD very old and that it will make me incredibly unattractive in an already unstable and volatile higher ed market. There is also the good ol' imposter syndrome drilling away at me HARD.             \n                         \n               \nI'm honestly just looking for any personal advice/thoughts. No one else in my life has any real grasp on the academic or higher ed space. So I'd just love to talk to someone about this.",
  "author": "failuretobloom",
  "created": 1602443941,
  "updated": 1634080704,
  "over_18": false,
  "upvotes": 195,
  "upvote_ratio": 0.95,
  "comments": {
    "g8im1r7": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8im1r7/",
      "text": "28 definitely isn't too old. As to the volatility of the market, it would help to know your specific field.",
      "author": "lh123456789",
      "created": 1602444659,
      "upvotes": 143,
      "replies": {
        "g8incyk": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8incyk/",
          "text": "Thank you for saying that, but by the time I'd start, I'd be 30 😅 I would be going into a niche subfield of anthropology. Anthro programs usually take people 6-8 years. But I knew grad students who had been at my alma maters department for 10. And with COVID being a new global reality, I have no idea how field work would take place.",
          "author": "failuretobloom",
          "created": 1602445144,
          "upvotes": 45,
          "replies": {
            "g8jio9s": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jio9s/",
              "text": "I started a cultural anthro phd at 31 in 2013, graduated in 2018 at 36. Adjuncted for a year and am now a VAP at 38, turning 39 next week. It can happen. It’s a longshot, but it can happen.",
              "author": "lifeworlds",
              "created": 1602460324,
              "upvotes": 80,
              "replies": {}
            },
            "g8jjc9l": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jjc9l/",
              "text": "I should also say that it sucked and continues to be difficult and academia is a toxic backstabby place full of mega insecure narcissists....but I found a dept full of great people, a rarity...also a VAP is not job security, so no rose tinted glasses here. But it’s more than I ever expected. And happy to talk more in DMs\n\nEdited for typos",
              "author": "lifeworlds",
              "created": 1602460711,
              "upvotes": 53,
              "replies": {
                "g8jty3o": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jty3o/",
                  "text": "What is VAP? Assuming this is an american thing?",
                  "author": "dukesdj",
                  "created": 1602466560,
                  "upvotes": 8,
                  "replies": {
                    "g8jx4i5": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jx4i5/",
                      "text": "Visiting Assistant Professor. Usually 1-2 year appointment faculty position",
                      "author": "Mallornthetree",
                      "created": 1602468385,
                      "upvotes": 21,
                      "replies": {
                        "g8lfydu": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lfydu/",
                          "text": "> Visiting Assistant Professor.\n\nI thought it was vice AP...",
                          "author": "advanced-DnD",
                          "created": 1602514300,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g8jkipv": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jkipv/",
                  "text": "I'd love to talk more! DM sent (:",
                  "author": "failuretobloom",
                  "created": 1602461383,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            },
            "g8jpzkn": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jpzkn/",
              "text": "My friend who was accepted to an Ivy League PhD program in an extremely niche field at the age of 35 would love to have a word with you.",
              "author": "Durendal_et_Joyeuse",
              "created": 1602464380,
              "upvotes": 19,
              "replies": {
                "g8jq780": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jq780/",
                  "text": "I know this isn't a serious offer, but I'd actually love to talk to them lol",
                  "author": "failuretobloom",
                  "created": 1602464498,
                  "upvotes": 8,
                  "replies": {
                    "g8jqnuz": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jqnuz/",
                      "text": "Haha it would be a miracle — he's notoriously impossible to contact on social media. I think the bottom line (as many people seem to be saying in this thread) is that you're not too old. In fact, at the PhD level especially, the range of ages is so wide that no one thinks twice about seeing someone at a \"nontraditional age\" (to whatever extent that mid-20s is the \"typical\" PhD age).\n\nThere was an instructor at my alma mater who had just completed his PhD and was in his 50s. \n\nAt the end of the day, only you know your own life, and you know what's best for yourself.",
                      "author": "Durendal_et_Joyeuse",
                      "created": 1602464761,
                      "upvotes": 15,
                      "replies": {
                        "g8jzqhz": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jzqhz/",
                          "text": "I agree. I don't know if this compares to your experiences but my mom went back to school to get her bachelor's after being a nurse for 28 years at the age of 58. She had initially obtained an associate's degree in Nursing. After she got her bachelor's she went on to get her Masters. She was encouraged to continue to get a PHD but she had accomplished what she wanted and that was to be competitive and get a position where she worked as a coordinator of patients care.",
                          "author": "PhonoodlemeWontonly",
                          "created": 1602469885,
                          "upvotes": 6,
                          "replies": {}
                        },
                        "g8jyww3": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jyww3/",
                          "text": "Well, I'm glad to hear your friend is an example of a successful PhD candidate at a \"nontraditional\" age, and that your instructor resembled this too.                \n                    \nThank you for sharing their stories!",
                          "author": "failuretobloom",
                          "created": 1602469387,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g8iwwkc": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8iwwkc/",
              "text": "What subfield? I think alt employment prospects can vary quite a bit on the basis of e.g. quantitative emphasis",
              "author": "--MCMC--",
              "created": 1602449222,
              "upvotes": 8,
              "replies": {
                "g8ixa3f": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8ixa3f/",
                  "text": "I'd be a biosocial anthropologist, and depending on how my research evolves I may also be considered a linguistic anthropologist.",
                  "author": "failuretobloom",
                  "created": 1602449380,
                  "upvotes": 6,
                  "replies": {
                    "g8j19et": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j19et/",
                      "text": "Gotcha — in that case, do you think you can spin or structure your work along the lines of something like natural language processing? Lotsa lucrative industry applications there!\n\n(I’m evolutionary / paleoanthropology — finishing a PhD now — but pivoting to medical biostats via postdoc and would have otherwise looked for employment as a computational statistician / “data scientist”)",
                      "author": "--MCMC--",
                      "created": 1602451109,
                      "upvotes": 8,
                      "replies": {
                        "g8j30dl": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j30dl/",
                          "text": "Very interesting! Mind if I PM you to learn more about your journey and talk about my research question?",
                          "author": "failuretobloom",
                          "created": 1602451922,
                          "upvotes": 4,
                          "replies": {
                            "g8j5uft": {
                              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j5uft/",
                              "text": "sure, feel free :)",
                              "author": "--MCMC--",
                              "created": 1602453248,
                              "upvotes": 3,
                              "replies": {
                                "g8j6xg5": {
                                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j6xg5/",
                                  "text": ">\\--MCMC--\n\nSent (:",
                                  "author": "failuretobloom",
                                  "created": 1602453761,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g8jzxsn": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jzxsn/",
              "text": "I started my sociology program last year (at 33) and will probably be 37 when I graduate.  I was so worried about being the oldest student in my department and just feeling behind age-wise.  My supervisor is also not much older than me which is kind of weird sometimes, but we have a great relationship so it works.  I worked different jobs over the past 10 years and hated them all.  I always wanted to teach at a college level but never thought I was smart/privileged enough to even try.  Just going for it was the best decision I ever made.  I might be 40 when I finally land a university job and be behind the tenure curve, but it is what it is.  Could I have done this when I was 24?  Absolutely not.  Everyone is on their own timeline and when I finally accepted that truth, it all got easier.",
              "author": "AFKpink",
              "created": 1602470011,
              "upvotes": 6,
              "replies": {
                "g8k0462": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k0462/",
                  "text": "> Everyone is on their own timeline and when I finally accepted that truth, it all got easier.\n\nAny wisdom you can pass on to help me accept this. Because the struggle is real.",
                  "author": "failuretobloom",
                  "created": 1602470123,
                  "upvotes": 1,
                  "replies": {
                    "g8k2i5d": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k2i5d/",
                      "text": "I really wish I had some good tips to help that realization along, but I don’t. It took me years to get over what I viewed as personal failures compared to my peers. As cheesy as this saying is, it’s so true: You are the one who has to live your life, no one else. So just do what you need to do to get where you want to be. \nI also just read this post in another forum and it hit home for me:\n\nhttps://www.reddit.com/r/GradSchool/comments/j9gcen/a_letter_to_all_of_you_from_the_dumbest_person_in/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                      "author": "AFKpink",
                      "created": 1602471621,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g8jxzmv": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jxzmv/",
              "text": "I was telling somebody the other day about someone who started her PhD at ~40 and became a super well recognized researcher who does great work in her field and now runs her own lab.\n\nHer names Diana Six, she’s a researcher on bark beetles",
              "author": null,
              "created": 1602468875,
              "upvotes": 3,
              "replies": {
                "g8jzy9y": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jzy9y/",
                  "text": "Thank you for sharing this.",
                  "author": "failuretobloom",
                  "created": 1602470019,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g8kchul": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kchul/",
              "text": "I started undergrad at 30 and just finished a PhD with a job lined up. 28 is NOT too old.",
              "author": "rockdoc6881",
              "created": 1602478671,
              "upvotes": 1,
              "replies": {
                "g8kfnk6": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kfnk6/",
                  "text": "Congradulations on the job!",
                  "author": "failuretobloom",
                  "created": 1602481370,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g8kibp5": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kibp5/",
              "text": "I do psychology and 30 is not old at all for a PhD. I'm doing mine at 24 and am the baby of the group. The next youngest Phd in my lab is 28, oldest is 40 (there's 4 of us). I'm younger than most of the research assistants as well.",
              "author": "Miroch52",
              "created": 1602483856,
              "upvotes": 1,
              "replies": {}
            },
            "g8ko69a": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8ko69a/",
              "text": "One thing that you might want to consider is doing your PhD at an institution in the UK: It's harder to find one, because most of them are funded only for UK/EU students, but there are still quite a few that'd fund overseas students as well. The upside would be that it only takes 3 years (probably 4 with fieldwork) and the work-life balance tends to be much better for UK academics. The application process is also much quicker: In went from application to starting within 4 months, although for overseas students it would again be a bit longer, probably.\n\nGood luck in any case. I finished my PhD (in the UK) at 33 and while I sometimes think about being \"behind\" in terms of career development, it's really not too late at all. And a lot of people were around my age or older in my programme.",
              "author": "Timguin",
              "created": 1602490010,
              "upvotes": 1,
              "replies": {}
            },
            "g8kth2j": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kth2j/",
              "text": "Depending on how long ago you graduated and where you are in the world, that might have changed. At my university they changed the rules so that everyone had to be done in maximum of 5 years (and one of those required extenuating circumstances to justify). But it didn't apply to people who already started their PhDs, so I knew a guy who was there when I started mine and still there after I finished.",
              "author": "l_lecrup",
              "created": 1602496350,
              "upvotes": 1,
              "replies": {}
            },
            "g8l5f7m": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l5f7m/",
              "text": "I don't know if my story helps in any way but here goes. I started a 4 year program 7 years ago. Due to my abusive supervisor making an error, I discovered I had to re-analyze and re-write the 3 manuscripts I had ready by the end of my 4 year program. I'm now doing it on top of a job, still working on my first manuscript (of 4, ideally). I'm 32, so when I finish I will probably be relatively \"old\" as well. Luckily, I have a great co-supervisor now. She has taken on another PhD student who had stopped her PhD due to an abusive supervisor and regretted it some years later. Thanks to my supervisor, she now has a PhD.\n\nI know it's very different to your situation, but I understand the sort of gravitational pull that research can have. If you really love research, don't let age (or anything else for that matter) stop you. The best advice I could give you is to consciously chose your supervisor. A good supervisor goes such a long way. Starting your PhD at an \"older\" age can have many advantages. A supervisor that is concerned with your development into a good researcher, will probably be able to see those advantages. A supervisor that just wants you to execute without questionning so (s)he can advance his/her own research will probably not see the advantages of taking on someone at 30, but you probably don't want that kind of supervisor anyway.",
              "author": "Oedipurrr",
              "created": 1602507804,
              "upvotes": 1,
              "replies": {}
            },
            "g8l7fk6": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l7fk6/",
              "text": "6-8???\nSeriously? Go to Europe. Get one in half the time from a great university - and get paid a decent wage at the same time",
              "author": "ShadowyPrecepts",
              "created": 1602509187,
              "upvotes": 1,
              "replies": {
                "g8lfajy": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lfajy/",
                  "text": "I've thought about this a lot but, from what I know, there is way less mentorship in european universities.",
                  "author": "failuretobloom",
                  "created": 1602513939,
                  "upvotes": 1,
                  "replies": {
                    "g8lmfyc": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lmfyc/",
                      "text": "Three to five years of your life is a very steep price to pay - even if that’s correct. Sure it’s worth it?",
                      "author": "ShadowyPrecepts",
                      "created": 1602517710,
                      "upvotes": 2,
                      "replies": {
                        "g8lo731": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lo731/",
                          "text": "I think that just comes down to what an individual needs. In Europe, you *need* to get a Masters before your PhD, and I don't have on yet so that's 1-2yrs in addition to their projected 3-4yrs for a PhD. I'm honestly, also someone who likes the mentorship dynamic. It's super important for me to find someone who I can have that with, and if that isn't commonplace in Europe then I question what kind of experience I can have there. In addition to the practical question of, will my work be recognized in the states?             \n                                                   \nThere are also lifestyle questions that come into play. I'll need a certain amount of $$$ in a frozen bank account to prove I can be self-sufficent, I may not speak the local language, my options for working while going to school will likely be very limited, etc... I'm not against a European PhD, as a matter of fact, I've thought a lot about it. But those are the factors that hold me back.",
                          "author": "failuretobloom",
                          "created": 1602518600,
                          "upvotes": 1,
                          "replies": {
                            "g8lomc6": {
                              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lomc6/",
                              "text": "Oh you don’t have a master’s? You’re right that you must have a master’s degree to get one. In most universities (all the universities you should consider) the entry requirements are strict as well. If your masters isn’t top notch, and from a good university to boot, you’ll likely have a hard time getting accepted.",
                              "author": "ShadowyPrecepts",
                              "created": 1602518816,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "g8loxri": {
                              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8loxri/",
                              "text": "If you get one in Norway, and I think the other Scandinavian nations, you don’t need to prove self sufficiency. Legally it counts as a job, and it pays decently so you only need a work visa. In your shoes I’d very seriously consider it, especially given the political mess the us is in now. If things go belly up in November you might want to skedaddle.",
                              "author": "ShadowyPrecepts",
                              "created": 1602518977,
                              "upvotes": 1,
                              "replies": {
                                "g8lqa32": {
                                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lqa32/",
                                  "text": "> If things go belly up in November you might want to skedaddle.\n\nHaha, yes. I have thought a lot about using my desire to get a PhD as an escape plan. I actually didn't know Norway didn't require proof of self sufficiency, at that point it's just a question of finding a lab that allows me to do work I'm interested in. If I understand correctly, out there you work on an existing project (instead of creating and executing your own).",
                                  "author": "failuretobloom",
                                  "created": 1602519658,
                                  "upvotes": 1,
                                  "replies": {
                                    "g8lqjyw": {
                                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lqjyw/",
                                      "text": "If you are spectacularly good you can get funds to do whatever you want. Those are rare though.  You can also write an application with a professor for funds to pay for your own idea, but more commonly you apply for a position on someone else’s project, yes.\n\nYou can also write applications for funds when your degree is almost complete, and go straight into your dream post doc. Or, again if you perform remarkably well, you can get funds to do whatever you want.",
                                      "author": "ShadowyPrecepts",
                                      "created": 1602519798,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g8iwvcl": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8iwvcl/",
      "text": "I wouldn't say your age is a factor that would impact how you are viewed, but could impact you just due to life stage- do you have/want children? Will you be able to move freely for field work or future employment? Or are you more tied down? Also consider you won't be saving money and kinda sucks to start retirement savings in your late 30s. \n\nThe bigger thing is to realize how few people land an academic job. Make sure you are going in informed on how unlikely that is, how much adjuncting can suck, and what other careers you could do with your degree. If all that sounds ok, go for it.",
      "author": "AwkwardAccountant5",
      "created": 1602449207,
      "upvotes": 40,
      "replies": {
        "g8iyqm9": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8iyqm9/",
          "text": "> The bigger thing is to realize how few people land an academic job.\n\nThis has been one of my biggest hesitations. I knew an amazing PhD (R1, great grants, good research, good mentor/teacher from my personal experience with her) and yet she couldn't land a tenure track job. And the post-doc grind wore her out. It was so sad to watch that process unfold for her because she was so damn talented. Played it all \"right,\" but it still didn't work.             \n                   \nThat terrifies me.             \n                             \nLuckily, I am not someone who wants children. But I am scared of the lack of retirement savings, the poverty of grad life (I grew up broke but listening to the stories from friends who are walking this path is intimidating since I will not have any financial help), and weirdly I'm afraid I won't find a life partner since I'll be walking into this hypercompetitive space. Also the lack of location independence (given the political climate of the US, I know there are certain regions where I would not feel safe).                    \n                               \nI'm very slowly acquiring empirical research skills (working on learning software right now) and thought I'd step up that pursuit in grad school to try and make myself a valuable asset to policy labs, think tanks, university research centers, etc...",
          "author": "failuretobloom",
          "created": 1602449999,
          "upvotes": 11,
          "replies": {
            "g8jbyxt": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jbyxt/",
              "text": "Definitely not too old, but yes the market sucks and likely will for the  foreseeable future. Unless something major happens, most colleges are on track to cut TT positions and ramp up adjuncts. Academia is really like a professional sports league - a very tiny fraction of people get  TT jobs. But like you described with your friend's story It's a gamble,  so make sure you're clear headed about the risks and sacrifices you'll  need to make if you go down the path. Your friend's story is more of the norm, rather than the exception, even for people who do everything \"right\"",
              "author": "alwayssalty_",
              "created": 1602456517,
              "upvotes": 10,
              "replies": {
                "g8jr25h": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jr25h/",
                  "text": ">the market sucks and likely will for the  foreseeable future.\n\nProbably forever if we're being honest with ourselves. The [looming demographic cliff](https://www.cupahr.org/issue/feature/higher-ed-enrollment-cliff/) is going to kill a lot of smaller colleges, probably sooner now that COVID has created major financial stresses that won't be resolved before the enrollment crunch arrives. True especially for regions with excess supply, i.e. Midwest and New England especially. \n\nIf COVID continues long enough to require both spring and fall semesters 2021 to be hybrid or online we'll likely see dozens of mergers or closures next year as well. The market is never going to get better for them, and likely won't anywhere unless the federal government decides to invest billions in research and education funding over the next decade--- something on the scale of the GI Bill infusion of the 1950s or the Boomer-driven expansions of the 1960s.",
                  "author": "SnowblindAlbino",
                  "created": 1602464978,
                  "upvotes": 8,
                  "replies": {
                    "g8k3d58": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k3d58/",
                      "text": "Yup - Ithaca College announced today they're cutting 130 faculty positions b/c enrollment dropped 15%",
                      "author": "alwayssalty_",
                      "created": 1602472165,
                      "upvotes": 3,
                      "replies": {
                        "g8lrr1d": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lrr1d/",
                          "text": "Ouch-- hadn't heard that yet. That's a huge cut, far more than 15% of their faculty. Lots of schools are likely, I suspect, to make \"extra\" cuts under cover of COVID knowing things are just going to get more challenging as 2025 and beyond becomes the new reality.",
                          "author": "SnowblindAlbino",
                          "created": 1602520402,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "g8kyjli": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kyjli/",
                      "text": "In January, the job market was worse than it had ever been. Now it is basically gone. It might recover a bit in a couple of years, but probably never to pre-covid levels (which were terrible) and after that it will just keep getting worse.",
                      "author": "CaptainCornerCamper",
                      "created": 1602502069,
                      "upvotes": 1,
                      "replies": {
                        "g8lrwhj": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lrwhj/",
                          "text": "Pretty much all the positions I've seen advertised this fall have been contingent, with a few exceptions. It's looking about as bad as 2009-2011 but with less sense it's going to recover.",
                          "author": "SnowblindAlbino",
                          "created": 1602520481,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g8jqmix": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jqmix/",
              "text": "I’m not going to lie - my wife has a PhD in biological anthropology, and unfortunately I think that what you’ve described is the norm while getting a TT job is the exception. And right now it’s worse than ever. My (midsize, regional, public) university is looking at cutting its anthropology department including laying off the tenured faculty there. But maybe things will improve over the next 8-10 years before you’d be on the job market (based on the fact you’re thinking of starting in 2022, which I saw in another comment). \n\nOne of the best pieces of advice I’ve heard is, “only go into academia if you can’t imagine yourself doing anything else.” Just my opinion, but I think that applies here.",
              "author": "JayKayxU",
              "created": 1602464739,
              "upvotes": 4,
              "replies": {
                "g8jyc3q": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jyc3q/",
                  "text": "I'm so sad to hear that anthro faculty are getting cut :(      \n       \nYou're right, this *the* path I envision. I think I envisioned it for myself almost a decade ago but I just couldn't admit it to myself, and knowing the odds were stacked against me, I left. I'm still not sure if I regret that choice. But I think I will regret never going back. It's just such a hard choice to make when I feel like I'm walking myself into a dead end.",
                  "author": "failuretobloom",
                  "created": 1602469068,
                  "upvotes": 2,
                  "replies": {
                    "g8k6kpo": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k6kpo/",
                      "text": "You can kind of have your cake and eat it too if you have a solid \"industry\"/private job, and then adjunct teach on the side. You get to live the academic life, but have the better pay with your real job, etc.",
                      "author": "Theomancer",
                      "created": 1602474214,
                      "upvotes": 1,
                      "replies": {
                        "g8kfm4e": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kfm4e/",
                          "text": "The job I'm working at now is also dead end, and I'm a contractor so it's super unstable. I'm not opposed to the route you outlined I'm just not entirely sure how I'd make it work considering that a lot of PhDs are somehow in this weird space of being over/under qualified for a lot of jobs.",
                          "author": "failuretobloom",
                          "created": 1602481336,
                          "upvotes": 1,
                          "replies": {
                            "g8kyu5m": {
                              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kyu5m/",
                              "text": "I would also suggest reading into adjuncting and the lives of adjuncts and thinking about if this is a something you really want to be involved in.",
                              "author": "CaptainCornerCamper",
                              "created": 1602502359,
                              "upvotes": 1,
                              "replies": {
                                "g8lgski": {
                                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lgski/",
                                  "text": "Oh I'm all to familiar with the plight of the adjunct.",
                                  "author": "failuretobloom",
                                  "created": 1602514754,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g8kypfr": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kypfr/",
                  "text": ">unfortunately I think that what you’ve described is the norm while getting a TT job is the exception\n\nTrue, but a bit of an understatement. In almost every subject, only a tiny minority ever get a TT job. \n\n&#x200B;\n\n>But maybe things will improve over the next 8-10 years before you’d be on the job market\n\nMaybe but unlikely. There has been no indication that the job market will improve. All of the forces that have been responsible for the job market collapse (pre-covid) are still operating and will continue to operate.",
                  "author": "CaptainCornerCamper",
                  "created": 1602502230,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g8jrk0m": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jrk0m/",
      "text": "My opinion probably will get downvoted, but it needs to be shared.\n\nThink long and hard before entering a purely academic-oriented discipline. It's so easy to get lulled into the idea of \"pursuing your passion against all odds,\" but that on its own won't pay the bills.\n\nAsk yourself this:\n\nWhat do you currently do for employment? Are there ways you can leverage your interest in research, data, and analysis within your current line of work?\n\nI'm not in academia (I'm admin in higher ed), but I can honestly say from hearing what others go through that it's not worth pigeon holing yourself to a life of adjuncting.",
      "author": "ZenGuruji",
      "created": 1602465253,
      "upvotes": 25,
      "replies": {
        "g8jxx3t": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jxx3t/",
          "text": "I think your adding a valuable and honest voice to this conversation, and I appriciate that. Your points are things I've considered for the last few years. I guess I want to go back because I can't imagine not going back. It's been years and my mind gravitates towards it all the time. Maybe it's stupid, but so is all of 2020 so I figure why the fuck not?",
          "author": "failuretobloom",
          "created": 1602468835,
          "upvotes": 5,
          "replies": {
            "g8k3lpg": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k3lpg/",
              "text": "That's one approach, but since you asked for advice, it's not the one I'd recommend.\n\nIn your post, you mentioned:\n\n>I loved taking classes, I loved going to guest lectures and panels and doc screenings, and I really loved being a research assistant\n\nA lot of those are things that you can accomplish in a much more financially prudent manner. I'm assuming you have a master's degree, so have you considered adjunct teaching at a local community college, alongside a full-time job? You can interact with other academics, while still having stability.\n\nRight now, at 28, you're at an age with limitless career options (in your area of interest), and related to academia. Why waste the next 5-7 years pigeon holing yourself in a teaching-oriented PhD program? My concern is that you'll enter into a program, be lulled into a feeling of security for the next 5-7 years, and come out of your program at 35, competing for a limited pool of TT positions (projected to decrease) with candidates much younger than you.\n\nAsk yourself this question:\n\nWhen you say you can't imagine yourself doing anything else, are you envisioning the TT professor with office hours, a research schedule, attending conferences, and having stable benefits, or are you envisioning the struggling permanent adjunct who's rotating at three institutions (which is the more common scenario of today's grads)? \n\nIf you're truly okay with either scenario, then go for the PhD.",
              "author": "ZenGuruji",
              "created": 1602472316,
              "upvotes": 13,
              "replies": {
                "g8kz4qi": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kz4qi/",
                  "text": ">When you say you can't imagine yourself doing anything else, are you envisioning the TT professor with office hours, a research schedule, attending conferences, and having stable benefits\n\nOP, also ask yourself if you really understand what a tenure track or tenured professor actually does on a day to day basis. We picture the life of a professor being research and teaching, mostly involving pursuing one's own interests in both with obviously some mind-numbing grading to do from time to time. This is not the life of the modern professor, most of whom spend most of their time doing administrative tasks such as sitting in faculty meeting and applying for and managing third-party funding.",
                  "author": "CaptainCornerCamper",
                  "created": 1602502645,
                  "upvotes": 5,
                  "replies": {}
                },
                "g8k6n8s": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k6n8s/",
                  "text": "I do not have a masters degree. If I did I would probably feel way more confident about all of this. In my field, it's normal to jump from a BA/S to PhD. And I never contemplated a Masters because there is literally no funding for them (in my field), and I can not justify that kind of debt.       \n                                      \nI think most of us envision the illusive stability. It's a heart breaking reality, that's for damn sure.",
                  "author": "failuretobloom",
                  "created": 1602474261,
                  "upvotes": 2,
                  "replies": {
                    "g8lg323": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lg323/",
                      "text": "I would agree with CaptainCornerCamper. I’ve been a social sciences prof at an R1 for 13 years (I should note that I started my PhD program at age 29 - my wife started hers at almost 35), and I’d characterize much of my experience as disillusionment. I spent six years stressed out about tenure, only to find that tenure didn’t make the stress go away at all. I’m busier than ever, and to be honest, very little of the work is truly gratifying. Teaching has its moments, but when you’ve taught the same course a dozen times, it’s a challenge to keep it fun and fresh. Advising grad students can be rewarding at times, but it can also be incredibly draining- and I never trained to be a life coach, which is a big part of the job. I have never had the opportunity to devote myself to research the way I was able to during my PhD program, and now it’s hard to keep up, fight burnout, deal with rejection from grant proposals, etc. The guest lectures I was so excited about in grad school now feel like chores to attend, and I can barely keep up with the ever-increasing service load. There are plenty of great people in academia, but I’ve learned that all it takes is one narcissist to make life in a department almost unbearable.\n\nLook, I know I’m painting a gloomy picture here, and it’s not the whole story. Although I’m definitely looking forward to retirement (massive understatement), I’m not miserably unhappy, and I know I have a lot to be grateful for. I’ve had some great opportunities in this career.\n\nBut that said, my advice before you plunge into a PhD program with the intention of pursuing an academic career is to talk to a few professors who have “made it.” Tell them you want them to be completely candid about how they feel about their careers. If possible, talk to people in more than one setting. In a PhD program, you’ll only see what it’s like to be at a research university, but you also need to hear from the folks who are teaching 4-4 loads in conservative small towns. And there are huge differences between teaching at an Ivy League school and a second-tier public research university too. \n\nAlso talk to people at more than one career stage. Associate professors like me are often the unhappiest (there have been some good articles about this in the Chronicle, etc.), and their perspectives will be different from someone just starting out or on the verge of retirement.\n\nIf you still want to go for it, knowing that TT jobs are not only disappearing, but also not all we dream they will be, then go to the best program you can get into and find the most supportive advisor you can - and have a backup plan. None of my former PhD students are TT professors, but most of them are doing just fine in other careers. \n\nAgain, though, you’re definitely not too old!",
                      "author": "tlamaze",
                      "created": 1602514370,
                      "upvotes": 1,
                      "replies": {
                        "g8lka19": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lka19/",
                          "text": "I've actually done just that! I've talked to current PhDs, \"fresh\" PhD grads (within the past five years), R1 profs (from my alma mater), and CC profs (I started out at community college). I've talked to adjuncts, VAPs, and TT.               \n                         \nIt's been an interesting series of conversations that I've had... my ideal was R1 (like many others, I'm sure) but am actually more interested in CC sometimes because of how many instructors LOVE it, save the adjuncts. I know CC work cuts out the research portion though, which sucks.              \n             \nFor better or worse, I can have a hyper focused mind that wants to see ALL the perspectives, so I've had my fair share of conversations. And maybe I'm just stupid, because the stats point to this being a bad idea, but I still want to do it anyway.",
                          "author": "failuretobloom",
                          "created": 1602516599,
                          "upvotes": 2,
                          "replies": {
                            "g8mnq2h": {
                              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8mnq2h/",
                              "text": "> And maybe I'm just stupid, because the stats point to this being a bad idea, but I still want to do it anyway.\n\nJust out of curiosity, why are you asking for our thoughts on this if you're dead set on doing the PhD, even though your research has indicated it is statistically a poor choice?",
                              "author": "ZenGuruji",
                              "created": 1602536687,
                              "upvotes": 1,
                              "replies": {
                                "g8mr1zl": {
                                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8mr1zl/",
                                  "text": "I'm honestly not even sure. I'm more on the fence then that statement makes me sound. I'm torn between what I want and what is more \"viable.\"",
                                  "author": "failuretobloom",
                                  "created": 1602538441,
                                  "upvotes": 1,
                                  "replies": {
                                    "g8msr7e": {
                                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8msr7e/",
                                      "text": "Let's play devil's advocate for a second. Let's say you did pursue the 'viable' option instead of the PhD track. What career path does that represent for you?",
                                      "author": "ZenGuruji",
                                      "created": 1602539358,
                                      "upvotes": 1,
                                      "replies": {
                                        "g8my7iu": {
                                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8my7iu/",
                                          "text": "I would still need to undergo a transition period. My current train of thought is to look into doing something like a bootcamp and acquiring research software/stats skills so I can work as a researcher at policy lab, research institute, think tank, etc... But given the requirements of those positions, I may actually need to think about going back for a Masters.          \n          \nEDIT: This may or may not have been what you were asking but working at a research university aside, I think I would also enjoy community college but I'm not sure that's a \"viable\" alternative (I'm pretty sure it isn't).",
                                          "author": "failuretobloom",
                                          "created": 1602542387,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g8ix5dj": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8ix5dj/",
      "text": "[deleted]",
      "author": null,
      "created": 1602449325,
      "upvotes": 13,
      "replies": {
        "g8iyzdr": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8iyzdr/",
          "text": "Would you mind if I DM you? (:",
          "author": "failuretobloom",
          "created": 1602450109,
          "upvotes": 3,
          "replies": {}
        },
        "g8l8o9j": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l8o9j/",
          "text": "In my field (historic preservation), almost everyone was late 20s-early 30s in the terminal MS program. I was the youngest at 23-24. And I don’t know anyone who started the PhD program before the age of 28. I actually can’t imagine going straight from undergrad to a PhD program at 22 with no non-academic experience.",
          "author": "kayelar",
          "created": 1602510000,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8jcu2q": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jcu2q/",
      "text": "I went back in my 30s with a husband and kid. Age wasn’t a big problem for me. I think it was an advantage because I was focused and knew what I wanted.\n\nThe family made it harder since about 1% of grad students at my R1 had one, and it meant I couldn’t stay up all night working on research.\n\nThere is an opportunity cost to not earning a real salary and retirement during those (six for me) prime earning years, especially if you don’t end up with a job.",
      "author": "Crazy-Analyst",
      "created": 1602456990,
      "upvotes": 11,
      "replies": {
        "g8jks9w": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jks9w/",
          "text": "Assuming your done, what has the job market been like for you?",
          "author": "failuretobloom",
          "created": 1602461529,
          "upvotes": 1,
          "replies": {
            "g8mwcwg": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8mwcwg/",
              "text": "Well, I have a job, but it was very hard to get. All lines in my field are non-existent right now.\n\nWithout a pandemic, the job market in my field has historically been somewhat cyclical according to the data although everyone on the market always says their year was the worst.",
              "author": "Crazy-Analyst",
              "created": 1602541342,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g8jylka": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jylka/",
      "text": "The market is bad but your age is not.",
      "author": "garulous",
      "created": 1602469209,
      "upvotes": 6,
      "replies": {}
    },
    "g8j2c4g": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j2c4g/",
      "text": "You aren’t anywhere near too old.  In fact, your age is an advantage.  I was about your age when I went back to school for a Ph.D. and I was a better than average student because I had my life together in a different way and knew exactly why I was there.  I think your experience will be similar.",
      "author": "bigrottentuna",
      "created": 1602451610,
      "upvotes": 14,
      "replies": {
        "g8j3bx7": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j3bx7/",
          "text": "Thank you. Did you feel odd at all going back in your late 20s/early 30s? I wonder if I'll have issues relating to my cohort.               \n\n\n\nHaha, I don't know about having a leg up in terms of life together-ness. I may have more savings than the average grad student, but that would be about it. A lot of the work I've done post-grad has been mindless.",
          "author": "failuretobloom",
          "created": 1602452060,
          "upvotes": 4,
          "replies": {
            "g8jb5we": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jb5we/",
              "text": "It wasn’t odd, in part because I wasn’t the only older student there.  You’ll find others.  And you just have more life experience than those who went straight through.  It makes a difference.  Even those mindless jobs.  I saw it as a student and now I see it as a professor.",
              "author": "bigrottentuna",
              "created": 1602456082,
              "upvotes": 4,
              "replies": {
                "g8jlbpb": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jlbpb/",
                  "text": "I suppose. Can I ask what the path to professorship was like for you?",
                  "author": "failuretobloom",
                  "created": 1602461830,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g8jgihv": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jgihv/",
      "text": "I didn't even start my *bachelor's* until your age and I'm doing a STEM PhD.  You're letting your insecurities get the better of you, my friend.",
      "author": "CapWasRight",
      "created": 1602459070,
      "upvotes": 9,
      "replies": {
        "g8jkl1a": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jkl1a/",
          "text": "Yeah, I've had a weird existential issue with time since I was a kid 😅 How's the PhD life going?",
          "author": "failuretobloom",
          "created": 1602461418,
          "upvotes": 3,
          "replies": {}
        },
        "g8jwdlc": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jwdlc/",
          "text": "THIS. I also did my second degree in my late 20's and am now 34 and doing PhD. Age is only an issue if you make it one!\nIf anything I feel I have a leg up on my younger colleagues because I have so much life experience. The biggest issue for me and others in my field is the willingness/ability to travel for a good job once finished, which is sometimes harder if you're older and have a partner and/or kids.",
          "author": "female_aardvark",
          "created": 1602467970,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g8jte2r": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jte2r/",
      "text": "I love it when 20-year-olds use the words \"too old\" in a sentence. It's so cute.",
      "author": null,
      "created": 1602466250,
      "upvotes": 9,
      "replies": {
        "g8jxjch": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jxjch/",
          "text": "I know it sounds odd relatively speaking, but this is the oldest I've ever been haha. It feels \"old\" when I compare how my life trajectory would be compared to my peers who went straight out of undergrad and who may be graduating with their PhD as I'm barely going to enter, ya know? Or when I think of people climbing the industry latter, having kids, etc... while I'm in the middle of training for an unstable career.",
          "author": "failuretobloom",
          "created": 1602468625,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g8jpg1q": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jpg1q/",
      "text": "I think you should worry less about your age (doesn't matter) and focus on whether you can can happily live on a graduate student salary for the next several years and what you would do with the PhD, given the realities of the academic job market right now.",
      "author": "datafix",
      "created": 1602464089,
      "upvotes": 4,
      "replies": {}
    },
    "g8k4fo5": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k4fo5/",
      "text": "I started a PhD last year right after I turned 29 (US doing the PhD in Australia). I was probably right around the average age for my cohort. We were mostly late 20s, early 30s and honestly, my impression from a lot of the faculty is that they prefer students in that range. Older students are often better at work/life balance, better at communication and professionalism, and better at thinking for themselves and doing work independently. I know several PhDs who are in their 40s or even 50s who went back after working in industry for many years. To be fair, it's way easier in Australia to go back to school and there's not as much anti-intellectualism where the PhD puts you behind. Plus it pays better here than it does in the states. I do often think about the \"opportunity loss\" of doing the PhD. If I was working in industry I'd be making more than double what I do as a PhD. \n\n&#x200B;\n\nI also think you should be more creative in envisioning your future. Sure, there are not a lot of tenure track positions. The market is shifting and changing all the time and things don't look good for academia. I've realized that academia culture isn't what I'd hoped- hypercompetitive and overly emphasizes output and productivity- just like so many other industries. There's this idea that because the work is your passion, you should overwork for shitty or no pay at all! I say fuck that- I have hobbies and a social life and a partner and actually, it's a job. A job that I love and I want to stay in, but still a job. I don't think I want to end up in academia- I'm looking into the idea of starting my own consulting, working for government and NGO research sectors, or figuring out something else. Be open to different pathways and opportunities! Make opportunities for yourself if you can. And don't do a PhD if you think it will leave you in more debt than you started with- definitely not worth it, particularly in the US.",
      "author": "quixieixie",
      "created": 1602472850,
      "upvotes": 3,
      "replies": {
        "g8kfc61": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kfc61/",
          "text": "> Be open to different pathways and opportunities! Make opportunities for yourself if you can.\n\nI'm very much en route to learning stats data software and plan to build on my foundation with the hope of being involved in research from that route. And I totally agree with avoiding debt at every possible step!",
          "author": "failuretobloom",
          "created": 1602481089,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g8kbmfm": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kbmfm/",
      "text": "I'm 42, married, two kids, and I still have two years left in my program. I work in higher ed now and I can tell you that age is not a concern. Universities want to see people who are knowledgeable and can be innovative and follow current trends. You are the youngest of millennials, I think you'll do fine.",
      "author": "everyoneisflawed",
      "created": 1602477977,
      "upvotes": 3,
      "replies": {}
    },
    "g8kie9c": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kie9c/",
      "text": "Damn, now I feel anxious: I’m 30 and would want to apply for a PhD in a year or two. Reading your post makes me scared that I missed my moment",
      "author": "Covfefetarian",
      "created": 1602483924,
      "upvotes": 3,
      "replies": {
        "g8kii45": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kii45/",
          "text": "Please don't feel that way! I've had a lot of internal anxieties about time since I was a kid, very specific to me and my own mental processing. If you want to go for your PhD, do it whenever you feel you are ready.",
          "author": "failuretobloom",
          "created": 1602484028,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g8jkqod": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jkqod/",
      "text": "I’m 35 and pregnant with my second kid-I started mine this summer and have taken breaks due to health issues and childcare issues. I am aware this will take me a long time but because Im passionate about the work I do I think that will probably work out better for me. No need to rush. I’ve been told by numerous people that no one ever asks about how long it took you to complete the program-in terms of employers or higher ed institutions. I think it’s great you are following your passion and 28 is definitely not too old IMO\n\nAlso in terms of the imposter syndrome I have also felt this and I found it really helpful to just take it one small chunk at a time and gradually gain mastery that way. You will slowly start to feel better about what you are capable of and your ability to learn. It’s ok to not know everything-it’s ok to notice gaps in your expertise and this is a great time to push yourself without shame or judgement. \n\nYou got this!",
      "author": "justgila",
      "created": 1602461504,
      "upvotes": 4,
      "replies": {
        "g8jm3lv": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jm3lv/",
          "text": "Thank you! And I'm so happy to read your story. What field are you in?",
          "author": "failuretobloom",
          "created": 1602462268,
          "upvotes": 1,
          "replies": {
            "g8k1xff": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k1xff/",
              "text": "Trauma psychology-you?",
              "author": "justgila",
              "created": 1602471261,
              "upvotes": 1,
              "replies": {
                "g8k2824": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k2824/",
                  "text": "Anthropology, somewhere in the realm of biosocial and linguistics. Very cool that you're studying trauma psych by the way! Do you hope to do research or practice?",
                  "author": "failuretobloom",
                  "created": 1602471445,
                  "upvotes": 1,
                  "replies": {
                    "g8l119h": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l119h/",
                      "text": "Very cool!\n\nI’ve been practicing for 15 years as a therapist (licensed 6 years ago) and I hope to expand that to a combo of research, practice and teaching.",
                      "author": "justgila",
                      "created": 1602504372,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g8jud0c": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jud0c/",
          "text": "> I’m 35 and pregnant with my second kid-I started mine this summer and have taken breaks due to health issues and childcare issues. I am aware this will take me a long time but because Im passionate about the work I do I think that will probably work out better for me. No need to rush. I’ve been told by numerous people that no one ever asks about how long it took you to complete the program-in terms of employers or higher ed institutions. I think it’s great you are following your passion and 28 is definitely not too old IMO\n\nAge is not a number in academia.... citation count is though....",
          "author": "dukesdj",
          "created": 1602466801,
          "upvotes": 1,
          "replies": {
            "g8k1uub": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k1uub/",
              "text": "Yea I’m still trying to figure out reddit -sorry for the double post",
              "author": "justgila",
              "created": 1602471218,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g8jkxnt": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jkxnt/",
      "text": "I am 5 years older than the average age in my cohort. Age isn't really an issue for me since I look really young. Most people think I am the same age as them.\n\nI only feel the age difference with the amount of b.s. I refuse to tolerate. My younger peers just live with semi-abusive conditions and depending on the department, that could work against you if they \"other\" you out for working differently.\n\nEdit.. Just wanted to add that if you've worked professionally for a long time, it would become really noticeable how accepted norms in academia won't fly elsewhere. It's a culture issue and this could get frustrating since we can't do much about it as grad students. Younger peers are at an advantage since they don't know otherwise",
      "author": "grads_throwaway",
      "created": 1602461612,
      "upvotes": 2,
      "replies": {}
    },
    "g8k6ro3": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k6ro3/",
      "text": "I dropped out of school at 21 to be a ski / fly fishing bum. On Wednesday I defended my MS and begin my PhD research in a week. I’m 33",
      "author": "fuzzytrout",
      "created": 1602474346,
      "upvotes": 2,
      "replies": {
        "g8karny": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8karny/",
          "text": "Congradulations on your MS, on the start of your PhD!",
          "author": "failuretobloom",
          "created": 1602477309,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g8k7c5r": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k7c5r/",
      "text": "I left grad school when I was 22 and went back at 24.  One of my classmates was 34 and another was 45 and on his second career.  The market is a whole different question but 28 is not too old. If anything, going back with some life experience will make it easier to focus.",
      "author": "gone_to_plaid",
      "created": 1602474748,
      "upvotes": 2,
      "replies": {}
    },
    "g8k8m40": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k8m40/",
      "text": "You are not too old. I took 3.5 years in between my masters and phd and started my phd when I was 30.",
      "author": "TheForrester7k",
      "created": 1602475670,
      "upvotes": 2,
      "replies": {}
    },
    "g8kbrbc": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kbrbc/",
      "text": "I don't think there is such a thing as too old.",
      "author": "RuthlessKittyKat",
      "created": 1602478082,
      "upvotes": 2,
      "replies": {
        "g8kfo7p": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kfo7p/",
          "text": "It's a very internal issue I've had for years I think.",
          "author": "failuretobloom",
          "created": 1602481386,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8knv0i": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8knv0i/",
      "text": "Just be aware that on this career path you'll slowly walk away from a lot of things you seem to love.   \nThe time where you'll attend a lot of courses will be over soon and the further you walk this career path the less research you'll do. It'll peak during your PhD, but from then on your career will slowly turn into one where you enable others to do research that is more or less related to your interest. You'll slowly become teacher, supervisor, manager, fund raiser and admin and loose the ability to do a lot of research yourself. How much time you have to do any research yourself depends on your field and position. In many fields you'll have a pure support role and not do any active research.\n\nSo if you want a job where you actively research yourself, you might want to look for another position. Sadly, academia had no widely available alternative. Roles as \"permanent researchers\" that aren't professorships are more rare than professorships, since academia follows this weird system of putting together a new team of specialists for each project and releasing them afterwards instead of having one core team. The permanent researcher roles also often come with another set of compromises, since often you'll be closer to a lab tech that has to help everyone out instead of following their own projects full-time.  \nThese roles really only exist in industry, where they often give you the option to either advance to a specialist or a management role.  \nIf you get lucky you might also find a company that'll happily invest in you attending courses to hone your skills and depending on the direction they might still pay for conference visits, so these things aren't necessarily research specific.",
      "author": "LittlePrimate",
      "created": 1602489649,
      "upvotes": 2,
      "replies": {
        "g8lgr8s": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lgr8s/",
          "text": "I can definitely relate to this, even in the social sciences. I spend far less of my time learning and doing research than I did as a PhD student.",
          "author": "tlamaze",
          "created": 1602514734,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g8j2fus": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j2fus/",
      "text": "Definitely not too old. My department typically hires between 30 and 45 year olds for TT positions. Also, age brings maturity. In retrospect, I was a clueless baby when I started my TT position in my 20s.",
      "author": "OttawaExpat",
      "created": 1602451657,
      "upvotes": 4,
      "replies": {
        "g8j2pz0": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j2pz0/",
          "text": "You started your TT position in your 20s?! 😭",
          "author": "failuretobloom",
          "created": 1602451789,
          "upvotes": 3,
          "replies": {
            "g8jamyz": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jamyz/",
              "text": "Like I said, a baby! Now don't fall into the trap of comparing yourself to others. It's a dangerous game.",
              "author": "OttawaExpat",
              "created": 1602455812,
              "upvotes": 2,
              "replies": {
                "g8jl70s": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jl70s/",
                  "text": "I know it's dangerous but we do all kind of exist by relation to one another. Can I ask what field your in?",
                  "author": "failuretobloom",
                  "created": 1602461758,
                  "upvotes": 1,
                  "replies": {
                    "g8jlw8y": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jlw8y/",
                      "text": "engineering - defintiely one of the the easiest/fastest ways into tenure track positions due to the relatively lower competition (industry pays well).",
                      "author": "OttawaExpat",
                      "created": 1602462151,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "g8kzok7": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kzok7/",
                      "text": "Also don't fall into the trap of thinking you will get a TT position. That is vanishingly unlikely.",
                      "author": "CaptainCornerCamper",
                      "created": 1602503161,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g8j6ltk": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j6ltk/",
      "text": "I went straight from BA to MA, then took two years off before returning to get my PhD after realizing how much I thrived in the structured academic world. I am two years in (now 27) and everyday wake up feeling like I am the luckiest person in the world to be doing what I’m doing. I love teaching, love writing, love the fast pace and working weekends... everything. Even my worst days in grad school are still better than most of my best days were out of it. You are not too old, and if you are as passionate about it as you say, you should continue on because you are a rarity and academia needs people like you!",
      "author": "rueberry2017",
      "created": 1602453603,
      "upvotes": 3,
      "replies": {
        "g8j7ea3": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j7ea3/",
          "text": "> because you are a rarity and academia needs people like you!\n\nThank you 😭 You have no idea how much that means to me. I really miss the academic space. I know undergrad doesn't compare to grad school (or at least I'd assume since I haven't done any grad school) but I completely agree! The stress felt like good stress. The late nights were a joy. I feel so naieve for saying it, but there was just something so magic about being able to spend most of my time learning.                 \n                \nOut of curiosity, what field are you in?",
          "author": "failuretobloom",
          "created": 1602453999,
          "upvotes": 2,
          "replies": {
            "g8jtxvr": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jtxvr/",
              "text": "Oh I’m so glad! I’m in communication. I know that STEM fields are much tougher, so perhaps my love for higher ed is only because of the area I’m in. But I can’t help but feel grateful for the opportunity I’ve been given and the work I get to do!",
              "author": "rueberry2017",
              "created": 1602466557,
              "upvotes": 2,
              "replies": {
                "g8jxa32": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jxa32/",
                  "text": "I'm in the social sciences myself, so can't relate to the STEM mentality, but I'm glad to hear that you are doing meaningful work. I hope I get to join the PhD crew soon.",
                  "author": "failuretobloom",
                  "created": 1602468476,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g8iwugi": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8iwugi/",
      "text": "I hate the term \"imposter syndrome\". Sometimes you really do suck and just should not be getting a PhD or at least a PhD in a particular field. Let people sort it out for themselves which situation they're in.",
      "author": "Correct-Pipe2010",
      "created": 1602449196,
      "upvotes": 2,
      "replies": {
        "g8ix2rt": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8ix2rt/",
          "text": "I see your point. My indecision does, in part, stem from the self-doubt of whether or not I'm smart enough to do it. And that's something I just have to contend with I suppose.",
          "author": "failuretobloom",
          "created": 1602449296,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g8je917": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8je917/",
      "text": "I am 30 and just started my second year. You are not too old. \n\n Do not doubt yourself, I'm in a different field but I know you are not too old, and if I can get through this mess of a year, you can too.",
      "author": "Littlefingersthroat",
      "created": 1602457777,
      "upvotes": 1,
      "replies": {
        "g8jljeh": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jljeh/",
          "text": "> if I can get through this mess of a year, you can too.\n\nHaha, thank you for the encouragement. Part of me is even wondering if I should try to just throw my hat into what will likely be this dumpster fire of an application cycle.",
          "author": "failuretobloom",
          "created": 1602461952,
          "upvotes": 2,
          "replies": {
            "g8jmto8": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jmto8/",
              "text": "I would encourage you to apply if you can muster the energy. Everyone is feeling this difficulty, and you can leverage any experience you have in your personal statement as well as explain motivations for applying despite the general dumpster fire that is the state of the world. It might help get accepted to start next year, but if a lot of applications have closed you could spend some time preparing personal statements and researching who you'd like to work with and be extra prepared for next year's application cycle with a little less stress.",
              "author": "Littlefingersthroat",
              "created": 1602462670,
              "upvotes": 1,
              "replies": {
                "g8jov7i": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jov7i/",
                  "text": "I think I could potentially muster the energy and pull the letters of rec, though I'd feel awful for reaching out to any potential advisers this late in the game.                    \n                                                      \nThat and I'm also not sure how to justify my trajectory. My interests in undergrad are really different from my research interests now. And my current employment is a shitty mindless contractor job. There is no \"fluidity\" in my process from an outsiders point of view. It's just been a lot of internal searching over the past few years.",
                  "author": "failuretobloom",
                  "created": 1602463777,
                  "upvotes": 2,
                  "replies": {
                    "g8js1f0": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8js1f0/",
                      "text": "say that then, \"My interests in undergrad were very different, however through the years I've been very introspective and discovered that my biggest motivator and interest is ... because ... \"",
                      "author": "Littlefingersthroat",
                      "created": 1602465524,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g8jl9qm": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jl9qm/",
      "text": "All I can really share is what I did and what my concerns were. I left my job as a supervising attorney at age 31 to get a PhD in a policy field. Some of this may apply to you, but some may not.\n\nI decided to try for grad school when my health started affecting my work. My original plan going to law school was to get my degree, get a job, pay off debt, build some savings, and then try for a PhD. My health became an issue before I was in the financial position I wanted. I decided to do a selective test year of applications, only applying to a few good programs within driving distance of my house. I also did initial research, and I went in with a rough dissertation idea that was solidified within my first year. With careful research into the faculty and precise placement of committee members, I am on track to finish this year, which is year 3 for me. My program normally runs 4-5 years.\n\nThere are important qualifications I have to mention. First, law (my professional area) and policy are closely related. I'm doing a legal scholarship-style dissertation, so I was able to hit the ground running. Second, I was able to get support for the massive pay drop associated with going to grad school (a family member moved into my house with me). Third, I have plans B (post-doc), C (policy work), and D (going back to law) ready if I can't get a tenure track job.\n\nI am happy I went back. Even with everything, my net workload decreased. My health improved. I had time to start dating, and I am about to get married. I am published, and I was able to get an adjunct job teaching a class for experience (with permission from my department). For me, it was the right decision.\n\nAs for my advice: do your research into programs and submit applications. It takes time and money, but if you can't do that, it isn't the right time. Think about some ideas for research, and do some preliminary research to get reacquainted with everything. If you get in, take a few days and think about it. Come up with backup options. Look up the faculty and see who you want to work with. Email anyone you might want to work with and set up a time talk. If you feel secure, go.",
      "author": "Mjbbtt",
      "created": 1602461800,
      "upvotes": 1,
      "replies": {}
    },
    "g8jmckg": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jmckg/",
      "text": "I thought this was me posting, but I’m actually older _._",
      "author": "nerdhappyjq",
      "created": 1602462408,
      "upvotes": 1,
      "replies": {
        "g8johjd": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8johjd/",
          "text": "Welcome, friend. Are you applying this cycle or waiting it out?",
          "author": "failuretobloom",
          "created": 1602463576,
          "upvotes": 1,
          "replies": {
            "g8jv3nv": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jv3nv/",
              "text": "I’m 29 and I’d be applying for an English PhD for F21. I know what schools I’m applying for and who I want to work with. Just... I don’t know. The isolation of the pandemic is getting to me, and I’d rather not be pursuing a PhD while living in these conditions. I guess I’m hoping that things get better even though big universities are hot spots.",
              "author": "nerdhappyjq",
              "created": 1602467232,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g8jq7fu": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jq7fu/",
      "text": "I’m feeling this way also. I’m in my early 30s, and I’ve struggled with (what I really think is) Imposter Syndrome for many years, which kept dissuading me from applying to PhD programs. I’m considering re-entering the academic field, but I keep finding reasons to avoid it. If it’s your dream, I’d say go for it, just be responsible about it and do thorough research on it first before making any big financial decisions.",
      "author": "rubythursday25",
      "created": 1602464501,
      "upvotes": 1,
      "replies": {
        "g8jydht": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jydht/",
          "text": "Can I ask what field you want to go into?",
          "author": "failuretobloom",
          "created": 1602469088,
          "upvotes": 1,
          "replies": {
            "g8jyio5": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jyio5/",
              "text": "Art History. I already have an MLIS with a focus on museum archives, but being in the Art History field, to teach, has been my dream for over a decade now.",
              "author": "rubythursday25",
              "created": 1602469165,
              "upvotes": 1,
              "replies": {
                "g8jzv7g": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jzv7g/",
                  "text": "I hope you can make those dreams into a reality! (:",
                  "author": "failuretobloom",
                  "created": 1602469965,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g8jte8j": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jte8j/",
      "text": "PhD at 42. I’d been a practicing engineer before that though. My excuse was Military out of HS, which set me back a while, then BS and MS, then a lot of indecision. I found a good program and, more importantly, a great advisor.  \n\nNow, for the other side of the conversation.  I just finished paying off my loans. Do not take loans for an eight-year PhD in a social science at an expensive school, just don’t do it. You will never dig your way out of a mountain of debt on an academic’s salary. I wish you the best of success, but, please, do your research on job prospects (and predictions, eight years out).  On the other hand, now is the time to make a radical life decision, before mortgage, family, etc. limit your choices.",
      "author": "HighlyEnriched",
      "created": 1602466253,
      "upvotes": 1,
      "replies": {}
    },
    "g8jthn6": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jthn6/",
      "text": "I'm in my early 40s and have gone back to do a PhD.  I'd been out of college for over a decade by that time, though I was at least working in academia as an instructor in my PhD field.  It's never too late.",
      "author": "shellexyz",
      "created": 1602466305,
      "upvotes": 1,
      "replies": {}
    },
    "g8juv6s": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8juv6s/",
      "text": "Def not too old. At 27 I'm the youngest by far in my courses, and I'm at the dissertation stage. There's a fella in my cohort who is 63, went back at 60. You're never too old",
      "author": "teenibug312",
      "created": 1602467091,
      "upvotes": 1,
      "replies": {}
    },
    "g8jwd9q": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jwd9q/",
      "text": "Definitely not too old! Im 27 just starting my PhD and I'm not the youngest one in my class!",
      "author": "jesdevenport93",
      "created": 1602467965,
      "upvotes": 1,
      "replies": {}
    },
    "g8jxr25": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jxr25/",
      "text": "[deleted]",
      "author": null,
      "created": 1602468741,
      "upvotes": 1,
      "replies": {
        "g8k000n": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k000n/",
          "text": "Support group? lol",
          "author": "failuretobloom",
          "created": 1602470049,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8k2hfu": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k2hfu/",
      "text": "You are always going to get older. The question you want to ask yourself is whether you want to have a Ph.D. when you get there.",
      "author": "Alector87",
      "created": 1602471609,
      "upvotes": 1,
      "replies": {}
    },
    "g8k2ih3": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k2ih3/",
      "text": "31 and in my MS. I say go for it if you have something you want to do the research on.",
      "author": null,
      "created": 1602471627,
      "upvotes": 1,
      "replies": {}
    },
    "g8k4ixn": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k4ixn/",
      "text": "I’m getting a masters currently at 36, so you’re definitely not too old for a PhD. I think others have made this point, but just throwing that out there too.",
      "author": "enstillhet",
      "created": 1602472910,
      "upvotes": 1,
      "replies": {}
    },
    "g8k5mlu": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k5mlu/",
      "text": "I’m applying this year I’m 28. Don’t listen to people who bitch about your age. Our milestones are are not theirs. We cannot always move to the beat of that drum. Go when you’re ready. The PhD will help get a job in your field and don’t forget. The nice thing about getting a PhD is more positions open up in odd fields like content writing, fact checking, consulting.m, authoring books if you liked or journalism. Or in your field of course.",
      "author": "SamL214",
      "created": 1602473582,
      "upvotes": 1,
      "replies": {
        "g8k6vaq": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k6vaq/",
          "text": "I think you're the first person that has told me a PhD opens up jobs, most have told me that it closes off possibilities since you're somehow over and under qualified at the same time.",
          "author": "failuretobloom",
          "created": 1602474416,
          "upvotes": 1,
          "replies": {
            "g8kb28x": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kb28x/",
              "text": "When you are an authority on stuff all it takes is initiative to find a place. Also, if you can’t find work, you don’t even need put the PhD on the resume until the right job comes around again.",
              "author": "SamL214",
              "created": 1602477536,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g8kk5ux": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kk5ux/",
      "text": "I am applying at 27 and might apply again next year..don’t make the same mistake as many years ago..it’s not too late now to apply to some programs and in case retry next year. If you don’t get in this year, you will already have done some useful preparation(gre, lor, an sop draft) just try and don’t be disheartened!",
      "author": "_lmueth_",
      "created": 1602485655,
      "upvotes": 1,
      "replies": {}
    },
    "g8koh0t": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8koh0t/",
      "text": "The social science job market, and funding for Ph.D. Is very volatile right now. I’m sorry I wish I could say something more encouraging. If there is a will there is a way. Assuming you are in the US, maybe under more democratic leadership, funding for the sciences and academia will improve? We can only hope.",
      "author": "kakeman69",
      "created": 1602490356,
      "upvotes": 1,
      "replies": {}
    },
    "g8kq78h": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kq78h/",
      "text": "Most the people in my PhD cohort were about 28. If anything, I felt I was way too young at the time, as I was a bit younger than them.",
      "author": "xXxlandvaluetax69xXx",
      "created": 1602492378,
      "upvotes": 1,
      "replies": {}
    },
    "g8kx81p": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kx81p/",
      "text": "Personally, my experience has been that a \"snapshot\" of an archaeology graduate cohort has been (out of people actually focusing on archaeology as their subfield): all men (usually, 49-52% of the cohort, but it's varied in recent years to be majority of women in newer cohorts) are over 30-35, sometimes closer to 40-45 (or certainly look/feel it  and complain about it after spending their post-undergrad years doing CRM/field technician/shovel-bum jobs), married/engaged and often get along better with the senior faculty because they're much closer in age (10-25 year gap, so a lot of outside interests and experiences in common), and then the women are primarily younger (23-33, with some outliers in the 35-50 range) having maybe spent a few years in CRM/time off before fully deciding on doing the MS/PhD. There have also been outliers of women and men (equally few) who are over 50 pursuing a graduate degree. I went continuously from BA to MS to 8-month \"break\" between December graduation and Fall start of PhD (don't recommend it as I faced some serious burn out right after 2nd year and then had to do prelims before trying to get past it). I started the PhD at 25 and will be finishing this May (turning 31 before then). The most recent student to graduate from our lab started at 27 or 28 I think and was out by 33. She just started a tenure track position after spending 3.5 years in postdocs/visiting scholar positions. For her it was definitely who she knew/worked for in those postdocs that got her to that point. In terms of volatility, it did cost her her marriage and she considered choosing an alternative career after getting shortlisted and passed over for other candidates when she was applying for tenure-track jobs.   \n\n\nWith the increase in programs announcing they are not accepting new applicants/cohorts for the upcoming 2021-22 year, you might want to plan for that possibility and the consequences of that fall-out with an influx of applicants who would have gone to school X o(r others) as their top/only choice now applying to A, B, C, Y, and Z schools who are taking students.",
      "author": "Keoqe",
      "created": 1602500691,
      "upvotes": 1,
      "replies": {}
    },
    "g8kyqvf": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8kyqvf/",
      "text": "Not too old at all, I started my undergrad at 26, did a Masters at 30 and started my PhD at 31. While most other PhD students are younger than me, I've met more than a few of a similar age or older, all at different stages of their lives (married with kids etc.).",
      "author": "Lolandor",
      "created": 1602502269,
      "upvotes": 1,
      "replies": {}
    },
    "g8l0wuy": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l0wuy/",
      "text": "I started at 28/29. If you get funding, why not?",
      "author": "Anteros94500",
      "created": 1602504265,
      "upvotes": 1,
      "replies": {}
    },
    "g8l2l2i": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l2l2i/",
      "text": "I’m 41 and considering a PhD.....",
      "author": "shadeofmyheart",
      "created": 1602505660,
      "upvotes": 1,
      "replies": {}
    },
    "g8l5p7u": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l5p7u/",
      "text": "I'm a mature PhD student in the UK. If you are properly motivated to succeed then you can get your PhD quickly and with lots of publications (if that's what you need for career success in your field). You need to be self-motivated and focused. Being a bit more mature can help that. I don't think you are too old.",
      "author": "rainbowWar",
      "created": 1602508005,
      "upvotes": 1,
      "replies": {}
    },
    "g8l723n": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l723n/",
      "text": "Go for it! Markets go up and down. A down market may even be the best time to do a PhD. Furthermore 28 is not too old. The experience you bring to the process will be an asset.",
      "author": "Jumanji_Crickets",
      "created": 1602508934,
      "upvotes": 1,
      "replies": {}
    },
    "g8l792c": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8l792c/",
      "text": "Too old? Nonsense. I was not much younger than you when I started my MSc, and now I’m living the high life as a post doc.\n\nPerfectly fine. You’re not too old at all.",
      "author": "ShadowyPrecepts",
      "created": 1602509065,
      "upvotes": 1,
      "replies": {}
    },
    "g8lgch5": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lgch5/",
      "text": "You're definitely not too old. If you enjoy the studying and university life you should definitely do your PhD. The volatile market is another reason to do one as you will be much more employable.\nI started a part time masters last year and I'm 52. I would love to do a PhD next. \nI have family and friends who have done or are doing a PhD and you have to be prepared for the amount of work involved. I have found returning to education after so long a big learning curve and definitely would suggest you go back sooner rather than later.\nTaking into consideration the amount of work and time involved a PhD is still definitely worth doing.\nGo for it, and good luck.",
      "author": "Temporary-Magician-7",
      "created": 1602514512,
      "upvotes": 1,
      "replies": {}
    },
    "g8lhtmg": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8lhtmg/",
      "text": "I started my PhD at 28 and it was the best decision I made! Because I waited to start, I had very clear goals and reasons for pursuing a PhD and have life experience which has helped my research",
      "author": "drintraining0007",
      "created": 1602515309,
      "upvotes": 1,
      "replies": {}
    },
    "g8n4ufn": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8n4ufn/",
      "text": "I just graduated from a master in fluid mechanics enigneering in france, december 2019 not the best  time to graduate i guess lol, i'm 28 now and still have hope to continue the adventure with a PhD because i'm in love with the same things as you !",
      "author": "belka24",
      "created": 1602546298,
      "upvotes": 1,
      "replies": {}
    },
    "gbf23jk": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/gbf23jk/",
      "text": "I just applied to a doctoral program for English and I am 29, if accepted I would start when I am 30 and graduate between 33-35. My husband is 36 going for an associates degree in nursing. Stop comparing yourself. Everyone is on a different path it doesn't mean you are better than or less than them.  If it feels right, go for it.",
      "author": "LadyLazarus91",
      "created": 1604718747,
      "upvotes": 1,
      "replies": {}
    },
    "g8j3kg3": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j3kg3/",
      "text": "I’m in a different field but turned 29 this year and am waiting on the results of my PhD application to be released this week. \nSimilar to your experience, I graduated (pharmacy) and started working straight away but a few years down the track couldn’t help but feel like I needed something more. Completed my masters in management (International Business) to try and change career paths and after graduating and moving countries, landed a job in Project Management in the NFP space. My current role involves a lot of stakeholder engagement across multiple industries, including academics at various stages of their career (new grads to emeritus professors) and compared to industry, they’re clearly more passionate and really care about their subject matter rather than try to drive an economic agenda. I think I always knew that I would end up going back for a PhD and am glad I took the path I did as an assurance of my decision (if I get in)! \nI guess for me, age was never a major consideration as my dad did his PhD when he was in his 30s and with a young family but timing-wise, I feel like this is exactly the right age I needed to be to pursue this path. \nApologies if the above doesn’t flow, using my phone.",
      "author": "luwe4243",
      "created": 1602452168,
      "upvotes": 1,
      "replies": {
        "g8j6708": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j6708/",
          "text": "Thank you for sharing your story! It's encouraging to see that I'm not as alone in this as I thought. Out of curiosity, is your goal to stay in academia or to go back into industry?",
          "author": "failuretobloom",
          "created": 1602453405,
          "upvotes": 1,
          "replies": {
            "g8j6jyd": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j6jyd/",
              "text": "My goal is to stay in academia but I feel like in my field there are a lot of people pulled into industry because of its practical applications so I hope the money isn’t too tempting!",
              "author": "luwe4243",
              "created": 1602453577,
              "upvotes": 1,
              "replies": {
                "g8j71sl": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j71sl/",
                  "text": "What dimension of academia do you hope to go into? You mentioned doing pharm for undergrad then going into management for masters.",
                  "author": "failuretobloom",
                  "created": 1602453821,
                  "upvotes": 1,
                  "replies": {
                    "g8j7br7": {
                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j7br7/",
                      "text": "I’ve given sessional lectures in the past and really enjoyed them so an even split between teaching and research would be perfect.",
                      "author": "luwe4243",
                      "created": 1602453961,
                      "upvotes": 1,
                      "replies": {
                        "g8j8uxt": {
                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8j8uxt/",
                          "text": "Sorry I meant to say field 😅 Like what do you hope to research/study?",
                          "author": "failuretobloom",
                          "created": 1602454801,
                          "upvotes": 1,
                          "replies": {
                            "g8jcey1": {
                              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jcey1/",
                              "text": "Oh! Sorry hahaha I’m looking to go into Management and do research on team optimisation :)",
                              "author": "luwe4243",
                              "created": 1602456759,
                              "upvotes": 1,
                              "replies": {
                                "g8jkx4h": {
                                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jkx4h/",
                                  "text": "No worries, I think I worded my question poorly, and that's awesome! I've heard there are great academic options for those with PhDs in a lot of business fields since most leave academia for industry. Don't quote me on that though.",
                                  "author": "failuretobloom",
                                  "created": 1602461604,
                                  "upvotes": 1,
                                  "replies": {
                                    "g8jtesj": {
                                      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jtesj/",
                                      "text": "Fingers crossed then! All the best for whatever route you decide to go down :)",
                                      "author": "luwe4243",
                                      "created": 1602466261,
                                      "upvotes": 1,
                                      "replies": {
                                        "g8jxbsg": {
                                          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jxbsg/",
                                          "text": "Thank you, and you too!",
                                          "author": "failuretobloom",
                                          "created": 1602468503,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g8jxo4i": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8jxo4i/",
      "text": "28 yr old second year PhD student here. I highly recommend. I'm not gonna pretend it's all rainbows and roses, but I've never been happier with my work and I'm glad I applied.",
      "author": "DonHedger",
      "created": 1602468697,
      "upvotes": 1,
      "replies": {}
    },
    "g8k02fv": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k02fv/",
      "text": "I’m in a similar situation with musicology but a bit older (about to be 30). It sucks a lot. Sending solidarity.  The age thing, no. Most of friends finished their PhDs in their mid 30s so I think that’s normal.",
      "author": "vivaldi1206",
      "created": 1602470093,
      "upvotes": 1,
      "replies": {
        "g8k05qh": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k05qh/",
          "text": "Standing right there with you friend. We got this.",
          "author": "failuretobloom",
          "created": 1602470151,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8k1klv": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k1klv/",
      "text": "Stop talking yourself out of something that you really want to do, the market will always be hostile and so what if you’re 28. That is actually a better age to enter a phd if you have more confidence and an actual plan for your research and savings to supplement the stipend",
      "author": "maroonhaze",
      "created": 1602471040,
      "upvotes": 1,
      "replies": {}
    },
    "g8k1tx1": {
      "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k1tx1/",
      "text": "I’m in the social sciences for a PhD program in my second year at 28 and am one of the youngest members of the program by far. I have colleague in my cohort who is in their 40s working on their PhD. It’s certainly not too late!\nI can’t speak for the market, but my sense is you wouldn’t be nearly as off track by age as you might be feeling. Work experience that informs research and teaching is highly valued in many of the social science programs that I am aware of.",
      "author": "taako__tuesday",
      "created": 1602471203,
      "upvotes": 1,
      "replies": {
        "g8k1ycc": {
          "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k1ycc/",
          "text": "Sadly, the work I'm doing is very mindless. Nothing to be proud of or talk about.",
          "author": "failuretobloom",
          "created": 1602471277,
          "upvotes": 2,
          "replies": {
            "g8k2gt1": {
              "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k2gt1/",
              "text": "Honestly, I think any work is valuable compared to students who jump from undergrad to PhD programs. Stepping out of higher education to work is a refreshing experience that I have seen usually make people better students when they return. \nIn either case, I just want to say, if you have a passion for it you should do it! Life is worth pursuing the things that we care about. Good luck! :)",
              "author": "taako__tuesday",
              "created": 1602471598,
              "upvotes": 2,
              "replies": {
                "g8k2m2m": {
                  "link": "/r/AskAcademia/comments/j9bjps/no_matter_what_i_do_i_keep_feeling_the_pull_back/g8k2m2m/",
                  "text": "Thank you!",
                  "author": "failuretobloom",
                  "created": 1602471691,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}