{
  "sid": "ji9kt2",
  "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/",
  "title:": "There should be more opportunities for people who like teaching",
  "text": "For those who enjoy lecturing a lot and want to focus on teaching rather than research, there should be more job opportunities in academia. Far too often have I seen professors who hate teaching giving lectures and not putting any effort into the material or presentation, and I get it is because they have this huge pressure to spend most of their time researching.\n\nHowever, the educational aspect should be just as important as research at universities. Students need proper guidance and mentoring from people who can spend a lot of time putting good lessons together. Universities dont value teaching staff that much because their rankings are based on research output.\n\nAnd I often see an argument to justify this and it is that \"you need to keep up with the latest research in order to teach subjects properly\" but you know what? That is straight up BS. You dont need the latest research to teach calculus, or classical physics. You dont need the latest research to teach students to use numerical methods to solve problems with a computer: even old algorithms work well with modern computers. The truth is, you dont need the latest research to teach subjects to undergraduate students. The foundations are there and have always been there. Calculus doesnt suddenly change every year. Same applies to a lot of subject areas.\n\nLet more people who like teaching teach, and let those who like doing rsearch do research. Everyone wins including the students.\n\n*Edit: I am not saying as a lecturer you shouldn't keep up with latest trends in the field, because you can easily do that by reading journals/articles on a semi-frequent basis. I am just saying that you don't need to be at the cutting edge of discovery to teach undergraduate courses, so there is no need for a lecturer to have to \"publish\" articles continuously throughout the year. To give you an example, I studied both mechanical engineering and physics in my undergrad, and all the content we learned including fluid mechanics, heat transfer, thermodynamics, quantum mechanics and semiconductor physics was stuff that is well-established and has been around for at least 40-50 years. Adding more stuff to that isn't going to make things more effective for students because they need to understand the foundations first. It is fine to offer more \"research\" based courses but this shouldn't be the main focus of the university degree. Far too many people I know have ended up with very little knowledge and understanding of physics because some lecturers wanted to teach their very niche and specific research topics in class before even teaching them the foundations they needed to grasp the advanced concepts.\n\n** 2nd edit: Ok I realise most people here are from the US and it seems like your situation is different. I should have pointed out I am from Australia and the situation here is quite different. Most people in academia do 70% research and 30% teaching, and there are no positions that focus entirely on teaching other than \"teaching fellowships\" which are more scarce than Dean positions. So if you like teaching in Australia, it is likely you will end up in high school teaching even after you get your phD, which is what most of my colleagues have had to do.",
  "author": null,
  "created": 1603693393,
  "updated": 1634080127,
  "over_18": false,
  "upvotes": 352,
  "upvote_ratio": 0.94,
  "comments": {
    "ga607r3": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga607r3/",
      "text": "Community colleges, man. So much more teaching than research. It's great.",
      "author": "storyofohno",
      "created": 1603720466,
      "upvotes": 34,
      "replies": {}
    },
    "ga5lzew": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5lzew/",
      "text": "STEM lecturer at an R1 here. I love to teach and am lucky to get to devote my time and effort to it. The lecturers at my institution who are the most involved and respected still care about research in a few ways. First, they try to follow advancements in our field by some combination of keeping a science Twitter, attending conferences, or regularly scanning top journals. This allows them to provide up-to-date examples and cool \"science news\" for their students. Second, they engage in pedagogical research to learn more about effective ways to teach their material. This isn't the same as scientific research, but it's using a scientific approach to learn how to improve your teaching.\n\nOur institution actively encourages us to do both of these things, but with one major caveat. They don't really provide funds for it. Right now, our lecturers start around ~$50k for a 10 month appointment. Our institution gives us each some professional development funds to use on things like conferences, but that seems to be around $1000 as a one time chunk of money. Several on-campus grants and scholarships are available for pedagogical research.\n\nThe other difficulty is that there aren't a ton of these positions. My dept has about 15 lecturers and 70 tenure track faculty. I was hired 2.5 years ago and it was their first ever national search for a lecturer; prior to that time, they were typically filled by spousal accommodations or recent graduates of our department.\n\nAt our institution, at least some of this seems to be changing. We have ranks of promotion, similar to what tenure track folks have, though without the benefit of tenure. They just added a third rank, which allows lecturers to have room for growth beyond their first 5-6 years. Many lecturers were upset to learn that obtaining this third rank requires participation in pedagogical research, which had never been an explicit part of our job descriptions. Hopefully they'll end up offering additional funds to make that possible.",
      "author": "mamyd",
      "created": 1603709754,
      "upvotes": 34,
      "replies": {}
    },
    "ga5cir0": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5cir0/",
      "text": "I can say from 20 years of experience that your accusation of \"BS\" is completely inapplicable in the social sciences and humanities.\n\nNew research is constantly changing what we teach and how we teach it.  I'd be a shit professor if I weren't doing research and attending conferences and keeping up with new books and regularly reading the journals in my discipline and subdiscipline.",
      "author": "matthewsmugmanager",
      "created": 1603699004,
      "upvotes": 126,
      "replies": {
        "ga5dd67": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5dd67/",
          "text": "I will say this is a very discipline specific thing. \n\nLab research in STEM is really, really hard to nearly impossible to keep a really active program going with at a PUI, since there are constant costs, and getting grants requires competing with people who have 20-50 graduate students working for them full time + technical staff. \n\nKeeping up with your field is important, but there's a difference between keeping up and pushing the barriers to create new knowledge. The latter has a different impact than the former on teaching. \n\nI say this as someone who keeps up an active research program involving undergraduates, and while it's something I enjoy, it does not significantly inform my teaching. Most of what I teach is foundational material that is not rapidly changing. My research is a niche area that has little to no relationship to what I teach. Maybe once every few years I'll get a chance to teach a special topics course related to what I work on for research. 95% of my teaching does not touch on anything related to my research.\n\nThis is very different for my colleagues in the humanities and social sciences- they much more frequently get a chance to teach courses related to their research, and their research involves more engagement with the literature and an ever-changing body of work that they will teach.",
          "author": "Eigengrad",
          "created": 1603699969,
          "upvotes": 106,
          "replies": {
            "ga5isyh": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5isyh/",
              "text": "Yeah, all of this. I touch on some elements of my active research in final year classes, but there's no way a programme is agile enough to keep up with the rate of change in the field, let alone provide the baseline training necessary to grasp the nuance of the bleeding edge of most STEM developments.",
              "author": "OrbitalPete",
              "created": 1603706332,
              "upvotes": 35,
              "replies": {
                "ga5xjyp": {
                  "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5xjyp/",
                  "text": ">  let alone provide the baseline training necessary to grasp the nuance of the bleeding edge of most STEM developments.\n\nThe problem with this is to understand what you are being taught, you have to have context of what happened in the past. The brief history of the field, is as useful for academic theoretical teaching, as the bleeding edge of technology. The bleeding edge of technology can also be irrelevant to be taught a few years later as it was all hype and the results were problematic. \n\nIn practical terms it is a bit different, but this is really a post-graduate issue.",
                  "author": "Psyc5",
                  "created": 1603718855,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "ga6v6aa": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6v6aa/",
              "text": "Yep, at least in the sciences, there are usually the equivalent of 6-700 level courses (so upper-Masters to doctoral level) where you want an active researcher in charge of the material. My field (machine learning) moves fast enough that a conference paper presented last year can easily be the standard method for solving a certain class problems this year. But those courses are often taught as research seminars anyway. For basically everything below that level, pedagogy is probably more important than being absolutely current in your field in terms of student success.",
              "author": "deong",
              "created": 1603736160,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "ga5n17t": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5n17t/",
          "text": "Also in the humanities and I agree. However, I barely have time to \"keep up with the latest research\" on the subjects I teach, which are very broad, because of the pressure to do my own research, which is much more focused. I would be better able to absorb new research, attend conferences (as a spectator, not a presenter every year), read new books in my field, and teach undergrads of the pressure to produce was lessened. I actually enjoy my research and I'd continue to do it, but the balance would be different and better for my students.",
          "author": "monmostly",
          "created": 1603710807,
          "upvotes": 23,
          "replies": {
            "ga5rpuq": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5rpuq/",
              "text": "This was very similar to my thoughts, though I'm in STEM, so differs from your experience. I teach at a very small PUI and have no research expectations, which leaves me far more time to keep up with current research than my colleagues who have to produce research with their students on top of the high teaching loads of PUI's. I teach research methods in my 3- and 400-level lab courses and my students get the basic skills of experimental design and data collection through those experiences, while my actual research interests (that I can engage with in the summer months if I so desire) would hardly benefit the vast majority of my students because of how incredibly narrow they are compared to what I actually teach.",
              "author": "BangarangRufio",
              "created": 1603714867,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "ga5hbqu": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5hbqu/",
          "text": "I’m going to gently disagree with the doing research piece. Though I agree that attending conferences, reading, etc., all are a must. But to the OP, some universities have recognized what you speak of. For example (though there are many), the University of Toronto has both teaching and research stream jobs. Both achieve tenure, though in different ways, and the division for teaching stream is 60-20-20 - so 60% teaching, 20% research. If OP is looking for a job, they might consider looking for this type of job -As an example.",
          "author": "canadian_splash",
          "created": 1603704622,
          "upvotes": 51,
          "replies": {
            "ga5yyzq": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5yyzq/",
              "text": "Thanks for sharing! I'm at an R1 where teaching professors come from industry and there aren't a lot of opportunities for people who want to grow as instructional professors as a career choice. And none of my mentors really know anything about finding teaching positions - so it's good to know there are more positions like this out there than I realized.",
              "author": "bandinterwebs",
              "created": 1603719728,
              "upvotes": 5,
              "replies": {}
            },
            "ga5ng1q": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5ng1q/",
              "text": ">If OP is looking for a job, they might consider looking for this type of job\n\nYep. Just a shame OP's chances of getting such a job are almost zero, but that's a topic for another thread.",
              "author": "CaptainCornerCamper",
              "created": 1603711202,
              "upvotes": -3,
              "replies": {}
            }
          }
        },
        "ga6tr2o": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6tr2o/",
          "text": "Reminds me of undergraduate intro to bioanthro maybe 5 years ago. Our prof covered non-human primates first, saving human evolution until the end of the semester because ~halfway thru the year, the first papers on newly discovered homo naledi came out (and he was a coauthor).",
          "author": "djsquilz",
          "created": 1603735474,
          "upvotes": 2,
          "replies": {}
        },
        "ga8ecms": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga8ecms/",
          "text": "... so what's stopping you from reading the literature by yourself as a lecturer? The OP is talking about people DOING research, not reading.",
          "author": "MavropaliasG",
          "created": 1603764864,
          "upvotes": 2,
          "replies": {}
        },
        "ga7pcwt": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga7pcwt/",
          "text": "I can say with eleven years of experience that there is little or no progress in social sciences and humanities, only fashions. So you can teach old stuff that’s classic and interesting and your students will be just as educated as the poor victims of postmodernism.",
          "author": "Anteros94500",
          "created": 1603751328,
          "upvotes": 0,
          "replies": {}
        },
        "ga6vibg": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6vibg/",
          "text": "Yeah, I heard some corners of the humanities are even just now learning that the sciences have moved beyond positivism and behaviorism. Apparently many more still need to learn about that in their critiques, but maybe in another dozen conferences or so.",
          "author": "Prof_Acorn",
          "created": 1603736323,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "ga5kopy": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5kopy/",
      "text": "Overall I agree that you don't need to be active in research to teach well. However, I think you need to be doing _something_ in your field to maintain perspective on what skills are needed to be successful in your field. For instance, in our CS department we have a teaching faculty that teach game courses who makes games rather than write papers about games, and I think this is fine. Something like this might be easier to do in CS than in other fields though. \n\nUnfortunately I've seen several teaching faculty that don't do anything in their field outside of teaching. They come in, teach the same courses on auto pilot for years and years, do a few hours of admin work, and collect a fat paycheck given the amount of time they put into the job. This is pretty unethical IMO, and typically it leads to these faculty 1) teaching outdated material, 2) being unwelcome to new pedagogy techniques (e.g., active learning techniques) and tools, and 3) thinking that their courses are the end all be all of a student's education and not seeing how their tree of a course fits into the curriculum forest.\n\nAll that said, the teaching-only faculty that do _something_ ( a little research or some other activity to apply their discipline) tend to be the best damn educators I've ever met. There's definitely room for faculty whose only job responsibilities do not include heavy research, but IMO they can't just check out of their field and still be a great teacher.",
      "author": "dataispower",
      "created": 1603708372,
      "upvotes": 27,
      "replies": {
        "ga5s0po": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5s0po/",
          "text": "> However, I think you need to be doing something in your field to maintain perspective on what skills are needed to be successful in your field.\n\nI 100% agree, speaking as a teaching faculty member. However, I'd be quick to point out that the same is equally true of research faculty members. The large majority of our students will not go on to careers in research, so we must be sure that we aren't simply teaching students for the purpose of using those particular skills. I honestly don't see this as being a one-sided argument in that the large majority of teaching-focused seminars I've attended (almost all with a STEM-focus) have directly looked at the purpose of what we are teaching for students' future success.",
          "author": "BangarangRufio",
          "created": 1603715100,
          "upvotes": 9,
          "replies": {}
        },
        "ga5pnr7": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5pnr7/",
          "text": "It's probably not what you are trying to imply, but we shouldn't consider the fact that some people do their job badly to be an argument against the job existing. Of course some people teach badly, just as very many research professors do terrible research.",
          "author": "CaptainCornerCamper",
          "created": 1603713200,
          "upvotes": 11,
          "replies": {
            "ga5refm": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5refm/",
              "text": "Yeah I think it's easier to fly under the radar as a bad teacher than as a bad researcher though. Maybe it's different at other schools, but at my school there is virtually zero oversight on teaching faculty. Teaching reviews are not taken seriously and the only other mechanism for discovering bad teaching is through student reviews which aren't taken very seriously by admin unless something is very wrong.",
              "author": "dataispower",
              "created": 1603714618,
              "upvotes": 6,
              "replies": {
                "ga5rx45": {
                  "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5rx45/",
                  "text": "For sure. At my university (mainland Europe) there is literally zero oversight of teaching. Nothing at all. So long as the required teaching hours get done and no student sues the university, it makes absolutely no difference how well the teaching is done. We just hired a new full professor and during the hiring process, he had to give a teaching demonstration. It was an absolute joke. Probably the worst lecture I have ever seen, but of course he was offered the job because he has an ERC grant worth 1.5 million Euros.",
                  "author": "CaptainCornerCamper",
                  "created": 1603715022,
                  "upvotes": 10,
                  "replies": {}
                },
                "ga5z77e": {
                  "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5z77e/",
                  "text": "I agree with everything here but your comment re: teaching reviews. Student reviews are notoriously biased (there's been a healthy amount of research on the topic) and not a good metric of the quality of teaching. I speak as someone who's gotten misogynistic reviews and reviews that have straight-up lied.  \n\n\nETA: I guess I should clarify, I agree there doesn't appear to be oversight for teaching in a lot of schools. I just meant that I don't believe student reviews are the metric that should govern that oversight.",
                  "author": "bandinterwebs",
                  "created": 1603719866,
                  "upvotes": 5,
                  "replies": {
                    "ga65vxl": {
                      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga65vxl/",
                      "text": "Yeah I understand why student reviews are not a great metric but 1) there are no other metrics used to evaluate teaching other than DFW rate which is probably an even worse metric, and 2) student reviews can reveal some things if you look for trends in them so I don't think they should be totally ignored.",
                      "author": "dataispower",
                      "created": 1603723634,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ga5xv7c": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5xv7c/",
          "text": "> Overall I agree that you don't need to be active in research to teach well. However, I think you need to be doing something in your field to maintain perspective on what skills are needed to be successful in your field.\n\nBut does being a leading PI actually give you this? \n\nThe answer is somewhat, yes, but also somewhat no, there are many well funded labs who are basically stuck in their ways. Also if you are the leader in your field, doing the most novel results pulling in cash, that doesn't mean that there is actually that much cash to go around, a new researcher isn't turning up and pulling in millions, like the original PI might be. They need to learn skills that are functional and broadchurch that will allow them to do their research, not some super-specific technique that they will probably never use, if it can even be used out of its very specific role.",
          "author": "Psyc5",
          "created": 1603719049,
          "upvotes": 2,
          "replies": {}
        },
        "ga8n3xf": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga8n3xf/",
          "text": "You don't have to teach outdated material. You don't have to actively publish your own research to keep up to date with latest developments and so on. Also, I don't know any \"teaching-only\" positions at university that give this \"big fat paycheck\" you speak of, most of them pay very little considering you need to have a phD and plenty of teaching experience to even get the job in the first place.",
          "author": null,
          "created": 1603769856,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ga5gb3c": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5gb3c/",
      "text": "I think this is definitely true for your first year classes in Engineering at least. They tend to end up using those as fielding grounds for new lecturers so they can get used to the admin. It does help though to at least be aware of what's happening in your field though. I distinictly remember the day some researchers announced that they found something travelling faster than the speed of light and it was all over the news. Asked our physics lecturer about it and he broke down how it's proooobably not true and that some of the authors were taking names of the paper etc. But with my third year and final year courses they were becoming specialised enough that it was important that lecturers addressed new developments and especially since it helps put out feelers for students that might be interested in postgrad. I'd say have dedicated staff for the first and second year for teaching (and research on the side as well) but keep research profs for later years and just give them goddamn training on how to teach.",
      "author": "time_flask",
      "created": 1603703440,
      "upvotes": 5,
      "replies": {}
    },
    "ga5k14u": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5k14u/",
      "text": "This is a thing in Australia - we have teaching and research academics (~50/50 split between the two) and teaching-focused academics (~80 teaching, 20% research and the research is usually related to “the scholarship of teaching and learning” i.e. research to actively help students learn/teachers teach)",
      "author": "arobenator",
      "created": 1603707666,
      "upvotes": 6,
      "replies": {
        "ga883fu": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga883fu/",
          "text": "Or at least it used to be a thing, with covid and all the budget cuts to university staff this year we will probably see a lot less teaching-focused academics",
          "author": null,
          "created": 1603761557,
          "upvotes": 1,
          "replies": {}
        },
        "ga8n6m9": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga8n6m9/",
          "text": "Also the split is actually more like 70% research and 30% teaching in some of the universities I know, so the teaching quality is generally quite low",
          "author": null,
          "created": 1603769904,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ga5sj1m": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5sj1m/",
      "text": "Undergrads flock to research universities, even though undergrad education is not the first priority there. While I generally agree that institutions that provide a Teaching track and a Research track for faculty are the ones doing it right, we also need more students who choose to attend teaching focused colleges. The reality is that teaching focused colleges, especially with broad offerings, are expensive. \n\n\n\nEngineering in particular can be very expensive. Who pays for the large lab equipment and the staff to maintain it? It's almost impossible to do without a decent research program working alongside classroom instruction.",
      "author": "blue_pez",
      "created": 1603715482,
      "upvotes": 5,
      "replies": {
        "ga7k7ry": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga7k7ry/",
          "text": ">Undergrads flock to research universities, even though undergrad education is not the first priority there. \n\nBecause those have the most prestige/cheapest.",
          "author": "Indo_Europeanus",
          "created": 1603748567,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ga6yu7x": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6yu7x/",
      "text": "Community colleges, small liberal arts colleges, regional state universities, and teaching faculty/lecturers at research universities.  There are plenty of opportunities for someone to focus on teaching.\n\nWhat I think I hear you say is that you wish faculty with teaching as a primary function would get the same pay, job protection, access to conduct research, and possibly respect, as those faculty that focus on research first.\n\nAnd to your last point, as a researcher at a regional university, I do not see research as staying current in my field.  Instead, I see research as providing opportunities for students to gain experiential learning.  I have tailored my research to be appropriate for students and focus on getting them presentation experience and the occasional co-authorship.  I will never be on the short list for research awards, but I have helped many students move on to doctoral programs or working in research settings.",
      "author": "manova",
      "created": 1603737920,
      "upvotes": 6,
      "replies": {
        "ga9k7rf": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga9k7rf/",
          "text": "I thought this was one of the most useful and insightful comments in the thread.",
          "author": "Ronnie_Pudding",
          "created": 1603801167,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ga5h8lk": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5h8lk/",
      "text": "One of the most consistent pieces of feedback we receive from students is that they like having lecturers who are active researchers, we're able to connect to things that are 'actually happening'.",
      "author": "tc1991",
      "created": 1603704523,
      "upvotes": 23,
      "replies": {
        "ga5mmg5": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5mmg5/",
          "text": "also FWIW we do have a few teaching only staff in our department but they are also practicing lawyers",
          "author": "tc1991",
          "created": 1603710400,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ga6loxl": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6loxl/",
      "text": "Community College, my friend. All teaching. Full time pay can even be better than universities.",
      "author": "promibro",
      "created": 1603731559,
      "upvotes": 3,
      "replies": {}
    },
    "ga7tx7s": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga7tx7s/",
      "text": "Also if you’re a researcher you might be keeping super up-to-date with research in the tiny sub-field that you’re writing a paper on right now, but you’re probably not keeping up with everything from all the subjects you teach.",
      "author": "sexy_bellsprout",
      "created": 1603753857,
      "upvotes": 4,
      "replies": {}
    },
    "ga63z0n": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga63z0n/",
      "text": "my honors thesis advisor is a teaching professor. she gets paid a little less, teaches more, and researches less (no grad students) and honestly? she loves it. she doesnt feel as pressured to research and therefore still sees it as rly fun. she loves teaching and is rly good at it. \n\ni kinda hope i get to be a teaching professor.",
      "author": "sdbabygirl97",
      "created": 1603722597,
      "upvotes": 3,
      "replies": {}
    },
    "ga5etfo": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5etfo/",
      "text": "I would agree, you do not need to be a field-leading researcher to teach a subject, especially more general subjects. My undergrad experience at a research university had quite a few teachers who had absolutely no love or aptitude for teaching (they are primarily hired for their research which is their main thing and then the teaching responsibility is tagged on.) Additionally, most college tuition does not go towards paying teachers or the institutions directly supporting teaching. Compounding wealth growth and non-profit requirements have created ridiculous administrative bloat within academia in addition to a plethora of shiny surface features and developments to attract more donors and students from affluent families (who will mostly remain affluent due to, again, compounding wealth growth and estate tax loopholes, making them pretty safely future possible donor alumni)\n\nMaybe as we reframe our mindset towards all institutions, we will look towards the inability of academia to support the workforce of PhD grads it is creating, and with a possible change of priorities and values, find a demand for new types of jobs. There are applications beyond teaching to a person who is skilled in self-teaching and teaching others, and who has an interest and understanding of other people. The actual guidance and mentoring support offered at universities tends to be an afterthought, and only sufficient at a bare minimum.",
      "author": "otterpigeon",
      "created": 1603701681,
      "upvotes": 9,
      "replies": {
        "ga5ra9w": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5ra9w/",
          "text": ">  you do not need to be a field-leading researcher to teach a subject,\n\nbut you need star researcher to attract students, hence money. And the more prestigious you become, you can also occasionally attract students whose parents are rich a la Donald Trump.\n\nThe education institutions are beginning to turn into shameless corporation.",
          "author": "advanced-DnD",
          "created": 1603714528,
          "upvotes": 0,
          "replies": {
            "ga5s74a": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5s74a/",
              "text": "And also perceived prestige/exclusivity",
              "author": "otterpigeon",
              "created": 1603715237,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ga5dwvf": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5dwvf/",
      "text": "For psychology: It might not be a bad idea to split off some of the undergrad teaching duties from universities altogether. It's really a huge waste of time if you think in terms of the things academics are relatively uniquely placed to do versus things lots of other people could do as well, and possibly better, and with less resentment.\n\nFree up academics to just purely come in to teach guest lectures at education-focused organizations, and otherwise work on their research and post-grad mentoring. It'd probably create a New Golden Age of progress for all of society with a decade or so. Yeah, pretty sure we'd already be halfway to living in Star Trek if it weren't for admin and the Learning & Teaching mob.",
      "author": "waterless2",
      "created": 1603700609,
      "upvotes": 3,
      "replies": {}
    },
    "ga7oxgu": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga7oxgu/",
      "text": "I think this is encouraged by management because good teachers are social beings and mixing social awareness and social skills with knowledge leads to social bonding and collective action and therefore social change. So instead they prefer to have people who have gone half crazy from living locked up in libraries and locked up writing and who are completely absorbed by individualism and competition.",
      "author": "Anteros94500",
      "created": 1603751094,
      "upvotes": 2,
      "replies": {
        "ga8th6n": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga8th6n/",
          "text": "This isn't something insidious or specific to universities. I would agree, though, that authority is generally wary of social awareness, to the point where corporate culture has managed to neuter social support networks amongst workers with HR, and have managed to reframe professional displays of empathy as inappropriate or disruptive (if empathy is disruptive to the system, it really informs you about the system.)",
          "author": "otterpigeon",
          "created": 1603774399,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ga5hseg": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5hseg/",
      "text": "There are things called teaching professors who only teach. Also, at non-R1 schools where you're only expected to put out 1-2 papers a year with maybe a couple students, you definitely see more emphasis on teaching ability. I think you're just going based on your own experiences at your own school, but talk to anyone who went to a small liberal arts college and they'll probably say their professors were great at teaching.",
      "author": "rosealyd",
      "created": 1603705165,
      "upvotes": 7,
      "replies": {
        "ga6x3fq": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6x3fq/",
          "text": "And their professors will tell you how hard it is to balance a productive research program with very few institutional resources while teaching 5-6 classes a year. \n\nI see this sentiment a lot here, but most of the time it’s not from PUI faculty. Are you speaking from your experience as a faculty member at a PUI?",
          "author": "Eigengrad",
          "created": 1603737084,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ga5yigc": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5yigc/",
      "text": "I hear you - I'm a graduate student in STEM who wants to find a teaching position. Some of the classes I've taught would be great with a research-based overhaul, but no one's even doing research in that area in my department. The other classes are fundamentals that aren't changing any time soon. I try to apply a cool case study, but that's the extent of the research needed for the course. A lot of courses aren't impacted by most changes in the field.\n\n I also think it's frustrating that the barrier to entry for teaching positions is a 5-7 year research degree. It would be great if we could also tailor the PhD, JUST A LITTLE, to reflect where we want to go.",
      "author": "bandinterwebs",
      "created": 1603719450,
      "upvotes": 1,
      "replies": {}
    },
    "ga708jc": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga708jc/",
      "text": "[deleted]",
      "author": null,
      "created": 1603738586,
      "upvotes": 1,
      "replies": {
        "ga8m5wk": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga8m5wk/",
          "text": "There are positions like that, they are called \"teaching fellowships\" where you focus on teaching. It's not that the lecturer would hate reading or learning things. There is a huge difference between continuously learning new things or reading about new stuff, and actually having to come up with new things and publish research articles. You don't need to be someone who publishes research papers regularly to actually be up to date with things",
          "author": null,
          "created": 1603769260,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ga5yu0d": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5yu0d/",
      "text": "But there is a teaching path...? There are far more opportunities for jobs that are primarily teaching than jobs that are just research. Target SLACs, CCs, undergrad focused schools, some schools even have teaching track positions. \n\nThe bigger issue is that if you just want to research, you're forced to teach. We need more opportunities for just research so the people who truly do not want to teach at all can just work in a research institute.",
      "author": "mediocre-spice",
      "created": 1603719645,
      "upvotes": 1,
      "replies": {
        "ga6wqd0": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6wqd0/",
          "text": "Many SLACs and PUIs require productive research for tenure and promotion. They just require that you do it while teaching 5-6 courses a year and without much infrastructure.",
          "author": "Eigengrad",
          "created": 1603736909,
          "upvotes": 1,
          "replies": {}
        },
        "ga8mkrd": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga8mkrd/",
          "text": "Maybe that's in the US, but in Australia such things don't actually exist. There are a few positions called \"teaching fellowships\" which are education-focused at university. Other than that, your only option is to become a high school teacher\n\nAnd yes, the problem is people who only like research are forced to teach, and people who only like to teach are forced to research, so it doesn't work out well for anyone.",
          "author": null,
          "created": 1603769519,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ga5p5hk": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5p5hk/",
      "text": "Well as a phd student I was drag into 30 teaching as teaching assistant in field I was still (fuck I’m still) learning myself.\nReally tough. So maybe is not academia is just some Unis/programs.",
      "author": "porraSV",
      "created": 1603712763,
      "upvotes": 1,
      "replies": {}
    },
    "ga5c3t5": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5c3t5/",
      "text": "Go to a community college!",
      "author": "kierabs",
      "created": 1603698530,
      "upvotes": -8,
      "replies": {
        "ga60a2f": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga60a2f/",
          "text": "Dunno why you're being downvoted; it's true!",
          "author": "storyofohno",
          "created": 1603720503,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ga6fvkb": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6fvkb/",
      "text": "I see this cutting two ways. \n\nResearch production = neoliberal mentality. All institutions care about is bringing in external dollars. \n\nOn the other hand - I also think that even teaching faculty should have some involvement in their field in terms of research and publishing. Otherwise what's the difference between someone who can read a textbook and present info, and someone who's engaged in the field at large?",
      "author": "yourmomdotbiz",
      "created": 1603728729,
      "upvotes": 0,
      "replies": {
        "ga8me29": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga8me29/",
          "text": "The thing is that the way the system is structured does not address those points. Most lecturer positions I know of require a phD, which means that already you need to prove you are good at research and you have come up with new things in your field, so I don't see why just for the sake of teaching undergrad subjects you would have to continuously publish new research. Also, being \"Actively\" engaged in research doesn't make you a better teacher or mentor, it just makes you a better researcher.",
          "author": null,
          "created": 1603769403,
          "upvotes": 1,
          "replies": {
            "gaa99wn": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/gaa99wn/",
              "text": "So while it's true that the phd does prove research ability, people who only teach and don't do any field engagement afterwards I don't think are serving their students well. I have colleagues who have been teaching faculty for 20+ years, and they're out of date, don't know what's happening in their field, and they don't know much beyond the textbook or teaching materials that they've been using for a long time. In some fields this is ok, but in most, things change frequently.\n\nI'm not suggesting someone has to have a robust research agenda. I simply mean that they should be actively engaged in a network that gives them access to what's happening in their field, and to write an occasional paper. That way they're still a contributor over time, and they know what's going on in their area. \n\nFor example - I recently had to correct a history faculty member who has been at my institution for 30 years. He was teaching something very old and out of date. He said that the oldest continually inhabited city was Athens. I gave him a list of cities off the top of my head that had been continually inhabited longer than Athens. I'm not a history professor either. This is what happens when people don't pay attention to new developments and disengage and stay in their classrooms.",
              "author": "yourmomdotbiz",
              "created": 1603814995,
              "upvotes": 1,
              "replies": {
                "gabobhf": {
                  "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/gabobhf/",
                  "text": "yes, but it shouldnt be an extreme thing like expecting 4-5 papers a year. 1 publication per year should be enough",
                  "author": null,
                  "created": 1603839676,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ga5oamx": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5oamx/",
      "text": "I disagree with the idea that universities hire tenure track faculty for their research, at least not in the way people often mean. It is true that people are not hired for teaching, and usually their teaching abilities are barely considered by the hiring committee. However, people's research abilities are also not considered and neither is the quality of their research and their true research productivity. What is considered primarily are people's likely ability to bring in third party funding and their ability to generate large research stats and especially prestige stats. People need a large list of publications, especially in high impact factor journals, but it does not matter if any of these publications actually contain real research.",
      "author": "CaptainCornerCamper",
      "created": 1603711999,
      "upvotes": -4,
      "replies": {
        "ga65904": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga65904/",
          "text": "... what’s in those high impact factor journal articles if they don’t “contain real research”??",
          "author": "TourmalineTart",
          "created": 1603723288,
          "upvotes": 1,
          "replies": {
            "ga6geve": {
              "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga6geve/",
              "text": "Cargo cult science.",
              "author": "CaptainCornerCamper",
              "created": 1603728998,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "ga5yowq": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5yowq/",
      "text": "Your argument is one bought into by just about every US university. [73% of faculty are non-tenure-track](https://www.insidehighered.com/news/2018/10/12/about-three-quarters-all-faculty-positions-are-tenure-track-according-new-aaup), meaning they focus exclusively on teaching. I couldn't find numbers indicating how many of that remaining 26% are mainly focused on research rather than teaching, but it's a small percentage. \n\nSo congratulations: higher-ed in the US at least agrees with you.\n\nETA: the rampant downvotes are fascinating: is it the factual nature of this that people disagree with, or that I've dared to point it out?",
      "author": "iugameprof",
      "created": 1603719559,
      "upvotes": -7,
      "replies": {
        "ga8mooo": {
          "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga8mooo/",
          "text": "Well that's interesting to know because I live in Australia, and I am hating how here it is the complete opposite. It also means the education quality at universities here is very low",
          "author": null,
          "created": 1603769587,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ga5oo1q": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5oo1q/",
      "text": "Obviously a student post. This is not the place e for students.As most people\nnote, not the case about staying current, and one issue with higher ed is the proliferation of NTT lines, with low wages  and lack job security for equally well-trained contingent faculty.",
      "author": "mmilthomasn",
      "created": 1603712336,
      "upvotes": -17,
      "replies": {}
    },
    "ga5atmo": {
      "link": "/r/AskAcademia/comments/ji9kt2/there_should_be_more_opportunities_for_people_who/ga5atmo/",
      "text": "The place where professors don't do research is not a university, it's just a high school,",
      "author": "Pelycosaur",
      "created": 1603697096,
      "upvotes": -29,
      "replies": {}
    }
  }
}