{
  "sid": "q6p8av",
  "link": "/r/AskAcademia/comments/q6p8av/applying_for_tenuretrack_positions_while_starting/",
  "title:": "Applying for tenure-track positions while starting a post-doc",
  "text": "Last year the academic job market was terrible, so I got a post-doc lined up. I started a post-doc this fall but I want to apply for tenure-track positions now, now that there are quite a few positions opening up in my field.\n\nMy post-doc \"mentor\" (I have my own grant and my own project, so I'm not pulling any funds from him) is insisting it's a bad idea to apply for tenure-track positions now \"because I just started this post-doc\" (his words).\n\nMy Ph.D. advisor thinks this is very standard and there's nothing to worry about and his opinion is that at worst, you won't get it and there's nothing lost in that. I'm looking for some other perspective into this.\n\nTbh, my first month and half at this position has been rather underwhelming. I understand this could just be a temporary, initial problem, but I'm having second thoughts about sticking out the whole duration.\n\nTo add some info, I'm in one of the fields where getting a tenure-track at an R2 university straight out of a Ph.D. is a possibility.",
  "author": "anicedayinnewyork",
  "created": 1634053973,
  "updated": 1634078364,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hgdajsd": {
      "link": "/r/AskAcademia/comments/q6p8av/applying_for_tenuretrack_positions_while_starting/hgdajsd/",
      "text": "I expect your post-doc advisor wants to keep you for more than one year, especially if you brought your own funding. This might be a conscious or unconscious reason for their advice. Applying for tenure track jobs is good experience, even if you don’t get any offers, but it is really time consuming, which might also be a concern of your advisor. \n\nIf I were you, I would apply but think about whether to ask your post-doc advisor to be a letter writer.",
      "author": "adjective-study",
      "created": 1634054931,
      "upvotes": 14,
      "replies": {
        "hgdcqxg": {
          "link": "/r/AskAcademia/comments/q6p8av/applying_for_tenuretrack_positions_while_starting/hgdcqxg/",
          "text": "Yeah, I suspected that was the reason too.\n\nI agree about the time commitments, but that's the nature of the beast. \n\nAnd yeah, after this conversation with him I'm not too inclined to ask him to be a letter writer.",
          "author": "anicedayinnewyork",
          "created": 1634055843,
          "upvotes": 3,
          "replies": {
            "hgdva1w": {
              "link": "/r/AskAcademia/comments/q6p8av/applying_for_tenuretrack_positions_while_starting/hgdva1w/",
              "text": "If you have only just begun to work with your postdoc mentor, then the letter will likely be of limited benefit in any case.",
              "author": "mleok",
              "created": 1634063470,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hgdpzm3": {
      "link": "/r/AskAcademia/comments/q6p8av/applying_for_tenuretrack_positions_while_starting/hgdpzm3/",
      "text": "Apply away, it’s expected that post docs are looking for next step jobs.",
      "author": "ohnoyoudin",
      "created": 1634061280,
      "upvotes": 6,
      "replies": {}
    },
    "hgedmzk": {
      "link": "/r/AskAcademia/comments/q6p8av/applying_for_tenuretrack_positions_while_starting/hgedmzk/",
      "text": "What field are u planning to continue in?",
      "author": "animelover9595",
      "created": 1634070927,
      "upvotes": 2,
      "replies": {
        "hgeovhy": {
          "link": "/r/AskAcademia/comments/q6p8av/applying_for_tenuretrack_positions_while_starting/hgeovhy/",
          "text": "The postdoc and my Ph.D. are in similar, but not quite the same areas. So I'm not changing fields drastically in my postdoc, if that was your question.",
          "author": "anicedayinnewyork",
          "created": 1634075572,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hgehd9n": {
      "link": "/r/AskAcademia/comments/q6p8av/applying_for_tenuretrack_positions_while_starting/hgehd9n/",
      "text": "Uhh that’s like saying you shouldn’t apply for full-time jobs before you graduate from college. In reality, everyone has to apply when the recruiting season is open. They shouldn’t be holding you back!",
      "author": "Turbulent_Cranberry6",
      "created": 1634072433,
      "upvotes": 1,
      "replies": {}
    }
  }
}