{
  "sid": "onlbew",
  "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/",
  "title:": "Inspiration behind meaningful research",
  "text": "Hi, as a starting PhD student I would like to ask you, incomparably more experienced scientists, how do you know that your research is meaningful enough and not only the necessity to publish something in order to keep your job? Is it a skill that every scientist can acquire after reading many many papers?  \n\n\nHow do you find a balance between researching a topic that is not so popular and yet producing something meaningful? Or working on a research that is very popular and yet not being afraid that the results would not be enough?  \nWhat questions should I ask myself during writing/testing/reading papers in order to produce quality research?\n\nThank you all in advance",
  "author": "RLbeginner",
  "created": 1626723017,
  "updated": 1634082498,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "h5sl9h8": {
      "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/h5sl9h8/",
      "text": ">how do you know that your research is meaningful enough and not only the necessity to publish something in order to keep your job? Is it a skill that every scientist can acquire after reading many many papers?\n\nIf your paper is accepted at top journals then it's meaningful. In applied fields, you might even see your ideas adopted by the industry, or at least generate some interest from industry.\n\nI'm not sure what the popularity of a topic has to do with producing something meaningful. That said, in fast paced fields, if you're working in a popular topic you run the risk of getting scooped.\n\nI think these are good topics of conversations to have with your advisor and other lab-mates over a beer. It differs a lot from field to field and what you're working on.  \n\n\nEdit: I saw you clarified your point about popular topics below. Yeah, it's a bit tricky. I agree that it might be harder to make an impact in a space that's already crowded. But on the other hand you don't want to end up working on a problem that nobody cares about either.",
      "author": null,
      "created": 1626726153,
      "upvotes": 3,
      "replies": {}
    },
    "h5tv055": {
      "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/h5tv055/",
      "text": "All honest research is meaningful imo. As for immediate real world impact, that's not realy something to actively seek. You do honest research and create information that has substantial proof, the rest is not really in your control, unless you're getting a bit dishonest.\n\nAs for long term \"meaning / impact\", [Fermat's last theorem was initially a margin note in a book](https://en.wikipedia.org/wiki/Fermat's_Last_Theorem#Fermat's_conjecture), centuries later [the guy who came up with a proof was awarded nearly a million dollars](https://en.wikipedia.org/wiki/Fermat's_Last_Theorem#Prizes_and_incorrect_proofs). Fermat's Little theorem instead was [created on a personal letter](https://en.wikipedia.org/wiki/Fermat%27s_little_theorem#History), and [today is one of the pillars of digital cryptography](https://en.wikipedia.org/wiki/RSA_(cryptosystem)#Proof_using_Fermat's_little_theorem). Doubt Fermat would believe you back when he lived if you told him all this. That's to mean, meaning / significance / impact is unpredictable and depends on a lot of factors, most of which is our of the researcher's control.\n\nPopularity or the rank of the journals aren't a yardstick for importance or meaning. Not even novelty. Replication studies are just as important as original studies and way underrated.\n\n> What questions should I ask myself during writing/testing/reading papers in order to produce quality research?\n\n\"How can this be improved?\" \"Is this reasoning correct?\", etc.\n\nAlso, most papers and book chapters will have one or two paragraphs or even entire sections on how the research they did or the subfield / literature they explain can be improved, what are the recent questions, what is the most bleeding edge research at that time etc. Read them well and make a note of them.\n\nIn fact, whenever you think of a research question, good or bad, make a note of it. Your judgement may change the second time over, when you're reading your notes.",
      "author": null,
      "created": 1626747932,
      "upvotes": 3,
      "replies": {
        "h5uepma": {
          "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/h5uepma/",
          "text": "Thank you very much, this is really helpful :)",
          "author": "RLbeginner",
          "created": 1626759757,
          "upvotes": 2,
          "replies": {
            "h5ufbup": {
              "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/h5ufbup/",
              "text": "You're welcome!",
              "author": null,
              "created": 1626760219,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h5ujslw": {
      "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/h5ujslw/",
      "text": "There's multiple ways a paper or research project can be meaningful. We often assume something has to have practical applications to matter - but pure/basic research is just as important if it helps us better understand how the world or the people in it work! Just ask yourself this: will this information help us better understand the world?",
      "author": "DrRFerg",
      "created": 1626763786,
      "upvotes": 2,
      "replies": {}
    },
    "h5sieu7": {
      "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/h5sieu7/",
      "text": "You're drawing some weird distinctions that don't really withstand scrutiny. \n\nWork being meaningful and publishing to keep your job are not mutually exclusive activities. A paper that gets published in a peer review journal is \"meaningful\", it's also necessary in many places to keep your job and progress. \n\nDitto working on a popular topic - I don't know why you think working on a popular topic means your contribution is less meaningful. If anything there's more competition and the risk of being scooped so publishing is more of a challenge. Although working on a less popular topic means it can be harder to get accepted into the bigger name journals. \n\nAs you get familiar with the literature you'll start to get a sense of what volume of work is required for a paper and what journals your work is best suited to.",
      "author": "ACatGod",
      "created": 1626724930,
      "upvotes": 2,
      "replies": {
        "h5sjwz7": {
          "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/h5sjwz7/",
          "text": "I am sorry that I was not clear at some points. Ive meant \"publishing to keep your job\" as publishing in bad journals just to produce something (nothing new, no contribution, etc) This is common thing in my country and I would like to avoid this way as much as possible.\n\nRegarding working on a popular topic, I should explain my thoughts more clearly. My fear is, as you said, that working on popular topics means that the competition is much higher and therefore it surely is much harder to come up with contribution in a given topic.",
          "author": "RLbeginner",
          "created": 1626725580,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h677szw": {
      "link": "/r/AskAcademia/comments/onlbew/inspiration_behind_meaningful_research/h677szw/",
      "text": "For me, a meaningful research should be research topics that I can it being implemented and make a difference to the field. It gives me a tingling sense of satisfaction when I either managed to reproduce someone else's work (a huge amount of scientific literature are not reproducible) or I managed to prove an idea that I have through my experiments. The ups and downs of research to me forms my research experience. It is meaningful because I learn from it and others can benefit from it. \n\nThat said, I've seen so many people around me who just engage in research not for the sake of doing research but rather to get published. I've seen people who snide at the suggestion of reproducing others' observations. \" *This has been published so I dont have to reproduce it\"*  or *\"This is a hot topic so I'm going to do it despite it not having anything to do with my work because i want my paper to be published at an even higher IF journal.\"* \n\nTo this i said, you do what you feel best. My favorite example would be the Kerbs cycle that was rejected by Nature. You dont really know how meaningful your research it until others managed to reproduce it , be inspired by it and apply it.",
      "author": "overzealous_labgnome",
      "created": 1627005499,
      "upvotes": 1,
      "replies": {}
    }
  }
}