{
  "sid": "gyqf3z",
  "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/",
  "title:": "How do you memorize important information relevant to your field?",
  "text": "I'm currently an MA student in philosophy and I find myself constantly looking up things which I should have memorized by now. Like the different types of fallacies and arguments, significant contributions of certain philosophers, philosophical eras, certain definitions etc.\n\nI'm a good student and work pretty hard overall, but I'm finding this frustrating. How can I retain a foundational information 'data base', if you will, relevant to my field?",
  "author": "eudaimonia13",
  "created": 1591584347,
  "updated": 1634081193,
  "over_18": false,
  "upvotes": 153,
  "upvote_ratio": 0.96,
  "comments": {
    "ftc0mtx": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc0mtx/",
      "text": "Memorize? I don't. I look things up as needed, but I've noticed that the more times I have to look things up, the more easily I tend to remember them.",
      "author": "cascaderade",
      "created": 1591586202,
      "upvotes": 207,
      "replies": {
        "ftc1wdi": {
          "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc1wdi/",
          "text": "To piggy back off this comment, I’ll also just save the article. I’ll usually decide which article will be the “base” and serve as a central jump off for other articles (this is to save space). However, if I feel that a particular article is important enough, I save it, otherwise, I can just get it from the “base”",
          "author": "Munnodol",
          "created": 1591587042,
          "upvotes": 39,
          "replies": {
            "ftcjfp9": {
              "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcjfp9/",
              "text": "Source database software is helpful for this.",
              "author": "Snowpossum",
              "created": 1591600666,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "ftc2dlr": {
          "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc2dlr/",
          "text": "Yep. It's just about exposure. The more you come across something and need to look it up, the easier it becomes to recall that info over time. \n\nTry not to fall into the trap of feeling like you're not up to some standard, or should know everything by now. It's just not true, and you may be comparing yourself to those who have been experts in their fields for decades. Give yourself a break and keep going. \n\nOh! And never be afraid to say you don't know something. It's most always the best choice compared to making something up or bullshitting.",
          "author": "tamirabeth",
          "created": 1591587365,
          "upvotes": 35,
          "replies": {
            "ftc2ix8": {
              "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc2ix8/",
              "text": "Yep, I agree. Of course I've been in situations where I didn't know something that I probably should have, but no one is perfect, and in real life, people have to look things up all the time.",
              "author": "cascaderade",
              "created": 1591587463,
              "upvotes": 5,
              "replies": {
                "ftc2nah": {
                  "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc2nah/",
                  "text": "And quite honestly, we all have moments when we can't recall something, no matter who we are. And it just gets worse as we age!",
                  "author": "tamirabeth",
                  "created": 1591587545,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "ftc6xkw": {
          "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc6xkw/",
          "text": "Yeah, but to be fair, it is a huge advantage in a discussion if you can pull the premise of a major paper out of your back pocket during a debate about experimental progress.",
          "author": "airwalker12",
          "created": 1591590584,
          "upvotes": 12,
          "replies": {}
        },
        "ftce6ls": {
          "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftce6ls/",
          "text": "If I find that I'm looking the same thing up often, it goes on a sticky note on my office wall.",
          "author": "rlrl",
          "created": 1591596149,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ftc2jpc": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc2jpc/",
      "text": "The easiest way to learn that stuff _cold_ is to teach it. That doesn't necessarily mean in a classroom — there are other ways to simulate that kind of activity (like writing lectures for your future self to give). But synthesizing the information and re-explaining it in your own words, to someone else, is the best way to get your brain to re-code that as \"stuff you need to know\"; it will literally store the information differently than if you just read it passively. \n\nIn my experience, flash cards and memorization schemes are not the same thing as really knowing it. Rote memorization is hard even with really basic things (names, dates), and certainly not appropriate for summing up, say, Platonism. \n\nI'm a historian, which is close to what you're describing, and the stuff I have _ready to go_ in my brain is all stuff I've taught or written about. Everything else I have to look up when I need to.",
      "author": "restricteddata",
      "created": 1591587477,
      "upvotes": 99,
      "replies": {
        "ftc6lpe": {
          "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc6lpe/",
          "text": "This. I taught my dog the material from all of my doctoral seminars.",
          "author": "Enzohere",
          "created": 1591590338,
          "upvotes": 41,
          "replies": {
            "ftce4b4": {
              "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftce4b4/",
              "text": "This. Our dog knows way more than he should about early 20th century German intellectual movements and 17th century political organizing among the masses. I’m pretty sure he will use it against us one day!",
              "author": "dewitt72",
              "created": 1591596100,
              "upvotes": 18,
              "replies": {}
            },
            "fteaauf": {
              "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/fteaauf/",
              "text": "I sure wish I'd picked up that second masters in not shitting in the house.",
              "author": "deong",
              "created": 1591642506,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ftc6hj4": {
          "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc6hj4/",
          "text": "Cannot recommend this enough. Instead of memorization, focus on internalizing the knowledge. For me the easiest way to do this is teach it to imaginary students. I work in a room with 8 other PhD students, and at this point they are used to walking into the empty room either early in the morning or late in the evening and finding me just lecturing the empty room as if there are people there. I often realize things when I am doing this.  \n\n\nWhen reading books, I would read a chapter or parts of it quickly to \"initialize\", and then re-read that chapter to write my own summary. It is fun to re-visit your old chapter summaries to see what were you thinking when you read that book a year ago.",
          "author": "academe-throwaway",
          "created": 1591590255,
          "upvotes": 21,
          "replies": {
            "ftcgc8s": {
              "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcgc8s/",
              "text": "I talk to myself about my research all the time,  god knows what my neighbor's think",
              "author": "tc1991",
              "created": 1591597927,
              "upvotes": 4,
              "replies": {}
            },
            "ftd2c92": {
              "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftd2c92/",
              "text": "When I take a shower I often imagine giving a little lecture or talk on something, out of habit. It's often 10X longer than any actual lecture or talk would be! But it prepares my mind for it, so that when the time comes, everything is there, on the tip of my tongue.",
              "author": "restricteddata",
              "created": 1591618709,
              "upvotes": 3,
              "replies": {
                "ftg5o06": {
                  "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftg5o06/",
                  "text": "How long are your showers?",
                  "author": "Skydragon11",
                  "created": 1591680599,
                  "upvotes": 2,
                  "replies": {
                    "ftgyxbq": {
                      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftgyxbq/",
                      "text": "Depends on the lecture!",
                      "author": "restricteddata",
                      "created": 1591706972,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ftcmy8p": {
          "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcmy8p/",
          "text": "Agree completely with this. That’s one of the reason why it can be valuable to have friends on your program who don’t mind having extended conversations about your field. “I’m just reading a new book at the moment,” “Oh yeah, what’s it about?”, “Well it’s complicated but basically the idea is... X.”",
          "author": "Doglatine",
          "created": 1591603955,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ftcsb2l": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcsb2l/",
      "text": "[deleted]",
      "author": null,
      "created": 1591609427,
      "upvotes": 20,
      "replies": {
        "ftduhhv": {
          "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftduhhv/",
          "text": "I think this is a very thoughtful answer.",
          "author": "synthesis-synthesis",
          "created": 1591634709,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ftc6u5w": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc6u5w/",
      "text": "Read it a million times in a million papers.\n\nSay it a million times in a million meetings.",
      "author": "airwalker12",
      "created": 1591590512,
      "upvotes": 19,
      "replies": {}
    },
    "ftc1zlf": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc1zlf/",
      "text": "I never did, I just put sticky notes with key words on the pages in my books where I looked things up and marked (tastefully and discretely) the topics I looked up in the indices so when I looked them up again they would be easier to find. \n\nAs for my computational stuff, I make \"cheat sheets\" of all the stuff I keep looking up, so I can just go to those notes. Making the notes, of course, really helped me remember them better in the first place.",
      "author": "survivalothefittest",
      "created": 1591587102,
      "upvotes": 18,
      "replies": {}
    },
    "ftc97s0": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc97s0/",
      "text": "Maybe Feynman technique, aka teach/explain/present it. It can even be done to yourself.",
      "author": "robberviet",
      "created": 1591592284,
      "upvotes": 6,
      "replies": {}
    },
    "ftc3cbd": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc3cbd/",
      "text": "I've found that creating a private course with things I want to remember on [Memrise.com](https://Memrise.com) and periodically testing myself has worked wonders.",
      "author": "abrbbb",
      "created": 1591588018,
      "upvotes": 4,
      "replies": {}
    },
    "ftc2hzn": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc2hzn/",
      "text": "Have you heard of the memory palace technique? It's explained well in the book \"Moonwalking with Einstein\". Short version: it's strategy of memory enhancement which uses visualizations of familiar spatial environments in order to enhance the recall of information. \nI find it really helpful for dense material, or information that i don't find particularly interesting. Happy studies!",
      "author": "sublime-sweetie",
      "created": 1591587445,
      "upvotes": 7,
      "replies": {}
    },
    "ftbzbp4": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftbzbp4/",
      "text": "I’d recommend some good old fashioned flash cards. You can probably already make some to start you off. Every time you have to look something up that you feel like you should already know, make a flash card for it. Review 3 times a day, no more than 5 min each session. Over time, you should come to know the things on your cards automatically. There are lots of flash card apps out there, so you can even make waiting for the bus or waiting in line at the store a mini review session because you’ll always have your cards with you.",
      "author": "slipperqueen",
      "created": 1591585347,
      "upvotes": 6,
      "replies": {}
    },
    "ftcbhpv": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcbhpv/",
      "text": "The way I have had success at doing it is taking the fundamental concepts and ideas of my field and actually applying them when I think about a relevant topic. \n\nI still wouldn't consider myself an expert on the entirety of my field and I probably will never feel like I know and remember everything about every topic in my field.",
      "author": "Randaethyr",
      "created": 1591594026,
      "upvotes": 3,
      "replies": {}
    },
    "ftc3wu6": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc3wu6/",
      "text": "Anki digital flash cards worked wonders for me. Freely available",
      "author": null,
      "created": 1591588414,
      "upvotes": 5,
      "replies": {}
    },
    "ftc4sc3": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc4sc3/",
      "text": "I write it down using different colors.  Drawing also helps.",
      "author": "jo_mom",
      "created": 1591589031,
      "upvotes": 2,
      "replies": {}
    },
    "ftca5zk": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftca5zk/",
      "text": "I organize a ton of my stuff in Google drive. Make a folder by the topic from class or figure out your own way of breaking it down by topics. Then put the notes in Google docs and do it in an outline form by using the header selections. The documents are all searchable in the search bar even the contents of them and the outline form is super helpful for a bird's eye view to find things.",
      "author": "wayzofgray",
      "created": 1591593004,
      "upvotes": 2,
      "replies": {}
    },
    "ftcph2e": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcph2e/",
      "text": "Not the first one to say it, but I think Anki is exactly what you are looking for. You can use the cloze type of cards if you have a long text and want to conceal part of it. Also, the good thing is that you can use it on desktop and on your phone, so you can use 'wasted' waiting time throughout the day to study. I wrote a [tutorial/blog post](https://sofiabelen.github.io/selfstudy/Russian-education-maddness.html) about it, maybe you'll find it useful.",
      "author": "Sofiabelen15",
      "created": 1591606468,
      "upvotes": 2,
      "replies": {}
    },
    "ftcxcex": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcxcex/",
      "text": "I think the person asking you questions about why you need things memorized is on target. People can give more specific advice once they understand what you're asking.\n\nI just wanted to add that everyone is a bit different, in terms of what works best for them, when it comes to getting things into long term memory. Some people are extremely visual and have to see things written down or drawn out. Some people need to say things out loud. Others write themselves little songs to help them memorize things (I'm like this, if I make it a song or a rap I will never forget it, I can still tell you every stupid poem I memorized for french classes decades ago), and others need to cram right before going to sleep. You can give yourself flash cards on a given topic, try memorizing them using all kinds of different ways (different cards for different methods), and then test yourself to see what your retention is after a day, a week, a month. This will help you to learn about yourself, and your learning style. It may sound bizarre, but it works for me. Good luck!",
      "author": "sinenox",
      "created": 1591614464,
      "upvotes": 2,
      "replies": {}
    },
    "ftd1f10": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftd1f10/",
      "text": "SAFMEDS! Say all fast minute each day shuffled. They’re similar to flash cards, but with a few extra rules to maximize memorization. \n\nhttps://www.behaviorbabe.com/safmeds.htm",
      "author": "GradStudentMama",
      "created": 1591617975,
      "upvotes": 2,
      "replies": {}
    },
    "ftd7lcn": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftd7lcn/",
      "text": "While working on my MA I spoke to my wife's cat to help me remember important things. For some reason, saying information out loud and at a living thing helped me with memorizing. \n\nOtherwise, I just look things up if I cannot remember. The same goes for even the most talented professor I know, she still needs to look things up on occasion, even after a few decades of academic study.",
      "author": "GATX303",
      "created": 1591622395,
      "upvotes": 2,
      "replies": {}
    },
    "ftcp6xo": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcp6xo/",
      "text": "www.quizlet.com",
      "author": null,
      "created": 1591606176,
      "upvotes": 1,
      "replies": {}
    },
    "ftcs2zb": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcs2zb/",
      "text": "Not to discount other methods, but repetition and mnemonics work for me.",
      "author": "GrandOpening",
      "created": 1591609196,
      "upvotes": 1,
      "replies": {}
    },
    "ftcz1gr": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftcz1gr/",
      "text": "I work in science and I don’t memorise things per se but one way you could organise a large set of information relative to your field would be to keep or publish a personal Wiki. You would probably have to think very hard and work hard on organising all the little bits of info, and that would make you very familiar with the content. \n\nA nice example of a personal academic wiki is nosubject.com. There are some nice tools that to help you maintain a Wiki, for example tiddlywiki.",
      "author": null,
      "created": 1591615997,
      "upvotes": 1,
      "replies": {}
    },
    "ftd5ofd": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftd5ofd/",
      "text": "Ank",
      "author": "Malifix",
      "created": 1591621120,
      "upvotes": 1,
      "replies": {}
    },
    "ftdgykd": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftdgykd/",
      "text": "A phrase I often use: become intimately associated with the information.\nLook it up. \nUse it. \nTalk about it.\nTeach it. (This one is huge)\nI personally love teaching things because it allows me to use the cool knowledge I have acquired over the years and pass it on. When I’m learning new material I find myself doing this more. My roommate’s cat knows a lot of physics, biology and chemistry by now. Lol\nIt just takes time, the more senses you use the information the more ingrained it will be. Teaching is one of the best ways to use multiple senses at once.",
      "author": "CoheedBlue",
      "created": 1591627818,
      "upvotes": 1,
      "replies": {}
    },
    "ftdji9t": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftdji9t/",
      "text": "The book *The Memory Code* talks about how ancient people would remember vast repositories of cultural knowledge. For some of them were talking every plant, animal, insect, land or skyscape feature,  genealogies, paths to find water or migrate safely, information about other people’s and their relationships to the former, as well as the foundational mythology of the people. \n\nThey did this through training, and (the author argues) almost always by using a method that brings together “the method of loci”, song, and other factors. \n\nThe method of loci is the thing that you hear about when people talk of a “memory palace”, like memory champions use. The Greek Orators used to use the technique and our modern description of it traces back to them. \n\nThere are also books relating to these techniques, such as *Moonwalking with Einstein*. \n\nThe author of the memory code claims to have used these methods to remember every single country that exists as well as a few facts about each, and then another related one which traces all the important events she can find and add in from the Big Bang up to human history and to the present. \n\nIt sounds like you need to do the same as the old tribal elders and remember a vast amount of cultural knowledge. Maybe it’d be possible with methods like these.",
      "author": null,
      "created": 1591629162,
      "upvotes": 1,
      "replies": {}
    },
    "ftdogtc": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftdogtc/",
      "text": "You don't do anything special. You look it up when you need. When you look things up frequently enough, at some point you don't need to anymore.",
      "author": "dragonaute",
      "created": 1591631705,
      "upvotes": 1,
      "replies": {}
    },
    "fthlcp4": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/fthlcp4/",
      "text": "I’ve used funny mnemonics to memorize as much as possible. My masters is in education so it’s more experiential and not quite as technical and context heavy as other fields. \n\nFor example, I remember the 7 key parts Chickering’s 7 vectors development theory as: \n\nCompetence, emotions, autonomy, interpersonal [relationships], identity, purpose, integrity \n\nChubby Elves Amused Icicles Into Panicky Interns\n\nI just chunk data, use a mnemonic generator until it shows something funny, and just memorize it. This isn’t great for technical things, but easy and effective for short memorization that can help with quick recall in a class room, job interview, or conversation.",
      "author": "DeanGullberri",
      "created": 1591719033,
      "upvotes": 1,
      "replies": {}
    },
    "ftc9uyl": {
      "link": "/r/AskAcademia/comments/gyqf3z/how_do_you_memorize_important_information/ftc9uyl/",
      "text": "I am sympathetic to the comments that just say “I don’t memorize things, they just eventually stick” as a math major, since I rarely intentionally memorize things in math classes. However, as a premed major, I think it’s also important to understand that this won’t always work. I’m studying for the MCAT right now, and I have to basically put six ~400 page books into my head. \n\nThat said, I use Anki for all brute-memorization. It’s a flash card app that automatically creates a schedule for you to review cards in order to maximize the effects of spaced repetition, which helps you remember things over longer periods of time. I’ve never been great at memorization, but with this app I’ve been able to memorize ridiculous amounts of information. Also, I wouldn’t buy the $20 app on the AppStore—the free browser version works just fine for me.",
      "author": "cmahlen",
      "created": 1591592767,
      "upvotes": 1,
      "replies": {}
    }
  }
}