{
  "sid": "owg3c8",
  "link": "/r/AskAcademia/comments/owg3c8/industrial_phd_how_do_you_get_one/",
  "title:": "Industrial PHD, how do you get one ?",
  "text": "If i were interested in getting a Phd but only if a company was involved, how would I even go and find one ? Should i check job offers at the universities ? Should i contact professors and ask or contact companies and try to convince them myself ?\n\nAre they even a thing is most countries ? It seems they are in Denmark  [Industrial PhD - DTU](https://www.dtu.dk/english/Education/PhD/Intro/Industrial-PhD)",
  "author": "Pirlotti",
  "created": 1627915858,
  "updated": 1634080036,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "h7fonxc": {
      "link": "/r/AskAcademia/comments/owg3c8/industrial_phd_how_do_you_get_one/h7fonxc/",
      "text": "From what I know of in the US, you have to work at a company for a few years (usually a larger company), and then apply internally to their program that operates in partnership with a nearby university. I know one person that did it and he had to graduate by a certain time or he would have had to start paying tuition. He still did his dissertation work at the company but had to travel back and forth for classes the first year and probably later for journal clubs and seminars. I think it is more likely that your mentor/advisor/boss/whatever will leave the company before you finish compared to a regular academic PhD.",
      "author": "kirby726",
      "created": 1627916283,
      "upvotes": 4,
      "replies": {}
    },
    "h7fpl8w": {
      "link": "/r/AskAcademia/comments/owg3c8/industrial_phd_how_do_you_get_one/h7fpl8w/",
      "text": "I did a French CIFRE PhD in a company, I only spent something like 120 hours on the university campus for during my entire PhD. I applied as if it were a job, by emailing my CV and cover letter to the manager after finding the project listing online.\n\nYou can contact professors you know to see if they have a line on any industrial PhD projects, but I think it would be odd to cold-email profs you don't know.",
      "author": "CheeseWheels38",
      "created": 1627916704,
      "upvotes": 3,
      "replies": {}
    },
    "h7fqmdu": {
      "link": "/r/AskAcademia/comments/owg3c8/industrial_phd_how_do_you_get_one/h7fqmdu/",
      "text": "This is a thing in Catalonia too. \n\nOfficial info: [https://doctoratsindustrials.gencat.cat/](https://doctoratsindustrials.gencat.cat/)\n\nFrom a local uni (UAB): https://www.uab.cat/web/newsroom/news-detail/all-uab-industrial-phd-programmes-approved-1345668003610.html?noticiaid=1345667409053",
      "author": "onetwosex",
      "created": 1627917175,
      "upvotes": 2,
      "replies": {}
    },
    "h7fry2r": {
      "link": "/r/AskAcademia/comments/owg3c8/industrial_phd_how_do_you_get_one/h7fry2r/",
      "text": "This varies wildly between countries, programs, and fields.\n\nIn the US, it's very common to work with companies on your research (depending on the field) but it's often more of an arms length or consulting arrangement.  Sometimes professors can initiate this, sometimes students bring their own industry connections.\n\nOther times, PhD students will intern at companies for a period of time to support their research (fairly common in computer science/data science/tech fields).",
      "author": "Decisionsota",
      "created": 1627917773,
      "upvotes": 2,
      "replies": {}
    },
    "h7g29wk": {
      "link": "/r/AskAcademia/comments/owg3c8/industrial_phd_how_do_you_get_one/h7g29wk/",
      "text": "The ones I know of were initiated by the industry, aimed at getting some of their personnel research qualifications, and they reached out to a uni close by. I don't think there were any open applications or similar.",
      "author": "molobodd",
      "created": 1627922241,
      "upvotes": 2,
      "replies": {}
    },
    "h7lnwsl": {
      "link": "/r/AskAcademia/comments/owg3c8/industrial_phd_how_do_you_get_one/h7lnwsl/",
      "text": "They're called CASE studentships in the UK; you find them by going to jobs.ac.uk and searching for CASE as a keyword in the ads.",
      "author": "polyphonal",
      "created": 1628025789,
      "upvotes": 1,
      "replies": {}
    }
  }
}