{
  "sid": "osgj32",
  "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/",
  "title:": "How have academic values changed over the years?",
  "text": "How have academic values changed over the years?\n\nIs the ideal of an objective truth the real goal of academia? Was it ever? When did it come to prioritizing risk avoidance and protecting people? \n\nI understand the value of it of course, AI, the nuke, genetics and such can be scary, but can you think of any circumstances where it hinders progress? Where the fear blocks knowledge, sometimes even knowledge of how to deal with the things we fear?  \nAlso just generally interested in the history of it, maybe some leads or links to read about.",
  "author": "PizzaWizzardd",
  "created": 1627362864,
  "updated": 1634082422,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.6,
  "comments": {
    "h6ohmaa": {
      "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6ohmaa/",
      "text": "[deleted]",
      "author": null,
      "created": 1627368162,
      "upvotes": 8,
      "replies": {
        "h6qzk71": {
          "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6qzk71/",
          "text": "> During the colonial era where Europe and Russia were beginning to colonize the New World, the majority of scientific research\n\nThis is a really bizarre take, since \"scientific research\" as we think of it didn't really exist during the periods you're talking about. \n\nScientific research in universities is a 19th century thing.",
          "author": "Adventurous_Map_4392",
          "created": 1627418145,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6q9tno": {
      "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6q9tno/",
      "text": "I think academics are now more motivated by securing money, increasing commercial links with industry, and an increased career obsession. Research is a second thought (but good research is still being done). There are a number of ways this is shown, gift authorship, manipulation of the H-index, increasing grant applications for areas that seem promising on face value but are nowhere near practical. This is reflected by the increase in predatory journals, increase in PhD positions despite fewer academic positions. I have been a little jaded by my experiences but I think many would agree that this is the case. I mean PhD programs used to take years now it's like an assembly line. With many masters programs not being fit for purpose in the real world but nevertheless being advertised for the sweet sweet tution money.",
      "author": "b_33",
      "created": 1627406886,
      "upvotes": 2,
      "replies": {
        "h6qzb03": {
          "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6qzb03/",
          "text": "> I mean PhD programs used to take years now it's like an assembly line.\n\nI don't quite follow. Are there PhD programs that don't on average take years?\n\nDo you have actual evidence for the rest of your claims?\n\nI can promise you that the overwhelmingly vast majority of academics don't secure money at all and have absolutely zero commercial links to industry. I get the sense that you're describing whatever niche you've had a bad personal experience with, but have no notion of what the academic world is like as a whole.",
          "author": "Adventurous_Map_4392",
          "created": 1627418031,
          "upvotes": 1,
          "replies": {
            "h6rlq28": {
              "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6rlq28/",
              "text": "A lot of these are substantiated (e.g. the prevalence of predatory journals). But others are more difficult to prove (e.g. gift authorship). As for commercial links, fair. It depends on research stream especially if it is linked to STEM (there are several examples of industry links for this, it's not even worth asking for evidence). I would not necessarily view it as a bad experience for the most part. For instance links to industry, being career driven or money driven. It's what comes with it that IMO is a concern and should be a concern for academics (i.e. bad research, fugged data, hastily written proposal purely to secure more funding, bad research culture, increased competitiveness etc....). There is a study by hepi that somewhat highlights. Where they note that only 30% of PhD students actually stay in academia. Some of the reasons for leaving link to my earlier post. They highlight unhealthy work hours and competition as an example. But all these link back to what academia has become. Big business.",
              "author": "b_33",
              "created": 1627428214,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h6olun2": {
      "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6olun2/",
      "text": "The overriding goal of all academics is to get a TT position then get tenure. If something useful comes out of that along the way all the better.",
      "author": "nickbob00",
      "created": 1627371855,
      "upvotes": 2,
      "replies": {}
    },
    "h6oe7v0": {
      "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6oe7v0/",
      "text": "Academics will pursue truth until the government tells them not to…. The macro economic order of the world trumps all.",
      "author": "wackedoncrack",
      "created": 1627365414,
      "upvotes": -5,
      "replies": {
        "h6org3h": {
          "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6org3h/",
          "text": "This is such a naive take. Truth is largely subjective even in the empirical sciences and what \"truths\" we choose to seek out are almost entirely societally driven. For example, the study of intelligence was almost entirely motivated by a desire to prove differences in intelligence between races and the metrics chosen as demonstrating intelligence entirely favoured whites. Now when people caution against looking for biological bases for differences racial groups experience such as health disparities or differences in educational attainment they get accused of being \"woke\" despite the evidence of the \"truth\" of such studies showing they are mired in racist thinking and the consequence of biology is far less than socioeconomics. And this is just one example. Academia is hugely important to society but let's not pretend it is some pure thing that is only contaminated when it comes into contact with the outside world. Academia is a product of society, full of flawed human beings who reflect the broader prejudices of society. Academia isn't done independently of governments and publics and corporations it's done right alongside them in a complex interwoven network of values, beliefs, evidence and bias.",
          "author": "ACatGod",
          "created": 1627376998,
          "upvotes": 8,
          "replies": {
            "h6pn31c": {
              "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6pn31c/",
              "text": "The fact that you turned this into a critical race theory pissing contest makes me regret expressing anything.\n\nHave fun on Reddit flaunting your Wikipedia degree.",
              "author": "wackedoncrack",
              "created": 1627396785,
              "upvotes": 0,
              "replies": {
                "h6po5um": {
                  "link": "/r/AskAcademia/comments/osgj32/how_have_academic_values_changed_over_the_years/h6po5um/",
                  "text": "It's s shame your piss poor hot takes aren't the thing you regret, but at least you regret something.",
                  "author": "ACatGod",
                  "created": 1627397375,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}