{
  "sid": "ifywlm",
  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/",
  "title:": "How do European Universities compare to each other? I already know that rankings don't mean much in Europe; however, based on your experience, would any of you attempt to make a country-based ranking or so?",
  "text": "I´m from South America, and after doing a lot of research, I´ve figured out that University rankings don´t mean much in Europe and now I understand why. However, with time, I´ve become really curious about what are the differences between the education systems among EU countries; therefore, I´d like to know if from your experience (maybe you´ve done an international exchange in 2 or 3 different countries, or maybe your brother/sister studied in a foreign country and now you have an opinion about that country´s educational system, etc) any of you would state that there are \"better and worse educational systems\" among EU countries, and If so, which ones and why.\n\nFor example, I already know that the UK is seen as the European country with the best education, but I´ve also read that studying in France is really challenging, but the French just don´t care about rankings (at all) and they could easily compete with the British. Is that true? And what about Italy, then? And the Netherlands? And the Netherlands Vs. Belgium? And I always thought that the Universities of Vienna and Helsinski were at the top of the world, but they´ve remained below the top 100, according to rankings. Have their educational level really decreased? And what about Luxemburg? And German Universities vs. UK universities? Which systems could be the most challenging (more difficult tests/more coursework throughout the academic year)? Which systems could have the best teaching methods? Which systems could have the lowest acceptance rate for posgraduate studies?\n\nHaving said this, I know in advance that is almost impossible (and unfair) to compare between countries and its Universities, but I´d really like to know people´s opinions about their perceptions in regard to this topic. Thanks!",
  "author": "more_guess",
  "created": 1598306269,
  "updated": 1634081946,
  "over_18": false,
  "upvotes": 101,
  "upvote_ratio": 0.96,
  "comments": {
    "g2qrnzd": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qrnzd/",
      "text": "The French absolutely don't care about rankings. They also don't market themselves much, if at all. If you graduate from a French university, be prepared that nobody outside of France will have heard of it, and if they haven't heard of it, they may assume it's not a good university.",
      "author": "Philieselphy",
      "created": 1598310438,
      "upvotes": 84,
      "replies": {
        "g2qzgy7": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qzgy7/",
          "text": "Well I mean all the universities are merging in France now so that they can call themselves Sorbonne or ENS. I think they are starting to care.",
          "author": "iwantabrother",
          "created": 1598314599,
          "upvotes": 35,
          "replies": {
            "g2r4q0d": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2r4q0d/",
              "text": "Even if 5 universities merge, they are so scattered around that it'll take decades to get there.\nParis is a mess.",
              "author": "Sennksa",
              "created": 1598317505,
              "upvotes": 15,
              "replies": {
                "g2rbqoc": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rbqoc/",
                  "text": "Universities in France have an extremely poor reputation abroad considering their relative prestige and history. And I think it's actually pretty well-earned.\n\nI've had a few shitty experiences, and I know I'm not the only one.",
                  "author": "thegeneralstrike",
                  "created": 1598321284,
                  "upvotes": 20,
                  "replies": {
                    "g2re6k1": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2re6k1/",
                      "text": "I can't say much because most of my contact with French doctors were from the école polytechnique and honestly I have zero complaints there. Great people. A ridiculously strong base knowledge. But I get why this poor reputation might happen. You can fill a room with almost 40 students, all from different universities, with just people who studied in Paris alone. This is why..even if they do merge the universities, it's just too many of them to have any effect short to medium time. Germany got this right with their small and focused research institutes so maybe France could look into that.",
                      "author": "Sennksa",
                      "created": 1598322618,
                      "upvotes": 6,
                      "replies": {
                        "g2rl39p": {
                          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rl39p/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1598326653,
                          "upvotes": 15,
                          "replies": {
                            "g2rohm8": {
                              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rohm8/",
                              "text": "Yeah but those aren't teaching institutions.",
                              "author": "NilsTillander",
                              "created": 1598328888,
                              "upvotes": -1,
                              "replies": {
                                "g2rprh4": {
                                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rprh4/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1598329803,
                                  "upvotes": 2,
                                  "replies": {
                                    "g2rpv95": {
                                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rpv95/",
                                      "text": "Yeah, my comment was kinda aimed at the guy above you as well.",
                                      "author": "NilsTillander",
                                      "created": 1598329879,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "g5ogfg8": {
                          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ogfg8/",
                          "text": "Didn´t know French universities had that kind of a bad reputation! Sad to read that. Thanks for your comment!",
                          "author": "more_guess",
                          "created": 1600410573,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "g2tsmpn": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2tsmpn/",
                      "text": "I absolutely do not agree with this statement as far as biology research goes. People getting their PhD in France are high value in the US. We are considered as well trained, hard working and efficient. This post should be broken down into specialties.",
                      "author": "cristal91",
                      "created": 1598379880,
                      "upvotes": 2,
                      "replies": {
                        "g5ogi5f": {
                          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ogi5f/",
                          "text": "That´s a good point; thanks for your comment!",
                          "author": "more_guess",
                          "created": 1600410640,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "g5oggs0": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5oggs0/",
                      "text": "Thanks for your comment!",
                      "author": "more_guess",
                      "created": 1600410606,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g2s3ffo": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s3ffo/",
          "text": "I've been to 4 different french universities for my higher studies, and on my experience those who care the most about ranking aren't the better ones (école d'ingénieur - engineering school I won't state which one because I don't want to do bad press, and I was also a horrible student at the time so I may be biased) but I was also at University of Lille, Sorbonne Université and École Polytechnique. Although they are starting to care about ranking, and they differ in prestige, I have found that studying there is very similar, and the level of research is very high as well. In fact researchers in the three universities would collaborate all the time",
          "author": "hmadkour",
          "created": 1598342053,
          "upvotes": 8,
          "replies": {
            "g2s3ktw": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s3ktw/",
              "text": "I've also found however that, although the content of studies is very similar, the harder it is to get into the university, the easier it is because of the better teaching, and the collaboration between classmates that have nothing more to prove.",
              "author": "hmadkour",
              "created": 1598342210,
              "upvotes": 3,
              "replies": {}
            },
            "g2s5s47": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s5s47/",
              "text": "I am also at an école d'ingénieurs, but I haven't heard any talk of rankings. There is a lot of pressure from our funding body though, and it's ruining the research in my opinion. I wouldn't say I got in easy, but I think I arrived better prepared than my French peers. Also the standards for a PhD are lower than my previous institutions.",
              "author": "goatsnboots",
              "created": 1598344600,
              "upvotes": 2,
              "replies": {
                "g2s836b": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s836b/",
                  "text": "I have not done a PhD at an École d'ingénieur si I wouldn't be able to elaborate on that, but I remember during my undergrad there was a lot of talk about ranking in the beginning of the year presentation by the faculty",
                  "author": "hmadkour",
                  "created": 1598347144,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g5oglda": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5oglda/",
              "text": "Thanks for your comment!",
              "author": "more_guess",
              "created": 1600410718,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g5ogg4f": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ogg4f/",
          "text": "Thanks for your comment!",
          "author": "more_guess",
          "created": 1600410590,
          "upvotes": 1,
          "replies": {}
        },
        "g6p4ipv": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g6p4ipv/",
          "text": "I did my MA at France's top school in the social sciences. I think the students there fell somewhat on a range, from brilliant to honestly kind of flaky. I've heard French universities tend to have that approach in general, where they let a fair number of people in but the people who really succeed are at the top of the class, so it fosters a more competitive environment relative to some places. A lot of my professors were wonderful as people, but another thing about French institutions is there is no expectation of students getting personal attention from teachers outside of the classroom until MA or maybe PhD, and they're very big on hierarchy, however.",
          "author": "BayAreaDreamer",
          "created": 1601138339,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2qsgks": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qsgks/",
      "text": "I'm an international student in the Netherlands. Dutch universities don't care about ranking and most universities have close ties with one another. The level of education is really high and the Cosmopolitan culture of the Netherlands is amazing. Everyone here speaks English and people are warm. Be prepared to speak some Dutch atleast if you're looking to stay here and find a job but all in all i would Dutch universities are incredible. PM me if you have any questions about Dutch universities.",
      "author": "jayhsanghvi",
      "created": 1598310864,
      "upvotes": 50,
      "replies": {
        "g2sbnmu": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2sbnmu/",
          "text": "I would say this is not really correct. Due to the way in which Dutch universities are funded, they are enormously competitive with both each other and the outside world. For a student, that doesn't really produce an effect, as most Dutch Universities are all relatively similar in those rankings. However, if you are looking for a place to work afterwards, be aware that there is the continuing idea that we should compete with Ivy League and Oxbridge, but on a tenth of the endowment. \n\nSimilarly, although I do not necessarily disagree with the \"Cosmopolitan Culture\" remark, that is very much an effect of the bubble in which University towns in NL exist. It is a consistent complaint of friends, colleagues and students that it is very, very difficult to connect with the Dutch and most people and students are (happy) in the Academic Multi Cultural Bubble (that often includes a teeny percentage of Dutch students). \n\nAll universities in the Netherlands are really good in what they do, and I can especially recommend one of the Technical Universities (that actually do work together a lot and have divided areas of expertise amongst themselves). Culture wise though, it is certain easier to live here as an expat than in certain other countries, but I would caution against wearing too rose-tinted glasses if coming here.\n\nSource: Dutch academic working in NL with a lot of experience abroad.",
          "author": "MrPanofsky",
          "created": 1598351021,
          "upvotes": 13,
          "replies": {
            "g5oh8x1": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5oh8x1/",
              "text": "Thanks for your comment; quite down to earth. Thanks again!",
              "author": "more_guess",
              "created": 1600411308,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g2s93xz": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s93xz/",
          "text": "International PhD student at a dutch uni, also have an m.sc from another one in a different part of the country. I second all of this except for dutch people being warm 😂 \n\nI went to a top 20 uni in the US, and Oxbridge for an m.phil. I think the quality of education in the Netherlands is much, much higher.",
          "author": "cranky_thornback",
          "created": 1598348277,
          "upvotes": 7,
          "replies": {
            "g2vz7em": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2vz7em/",
              "text": "I've done 4 years o PhD in the Netherlands and found dutch people very nice and welcoming (except rurals). But then again I'm from Germany where we don't really warm up to people unless we've known them for half a year",
              "author": "DeepSeaDarkness",
              "created": 1598425170,
              "upvotes": 3,
              "replies": {}
            },
            "g2s9796": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s9796/",
              "text": "Hahahaha i got super lucky with my Dutch friends and generally people are super nice as long as I try communicating with them in my broken Dutch. 😂",
              "author": "jayhsanghvi",
              "created": 1598348375,
              "upvotes": 2,
              "replies": {
                "g2s9mtx": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s9mtx/",
                  "text": "Glad to hear it 😁 Don't get me wrong - I love it here 😁 my partner is dutch, and I want to build a life here. But there is an awful lot of truth in the blunt, frosty stereotype.",
                  "author": "cranky_thornback",
                  "created": 1598348844,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "g5ohcjg": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ohcjg/",
              "text": "Whaaat? Could you tell me more about that comparison, please? What would be your ranking then? Dutch uni > Oxbridge > US top 20 uni? I´m really curious. Which field you´re into?",
              "author": "more_guess",
              "created": 1600411400,
              "upvotes": 1,
              "replies": {}
            },
            "g6p4s3p": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g6p4s3p/",
              "text": ">I went to a top 20 uni in the US, and Oxbridge for an m.phil. I think the quality of education in the Netherlands is much, much higher.\n\nInteresting. What subject did you study, and what are the factors that you think make the quality of education higher?",
              "author": "BayAreaDreamer",
              "created": 1601138485,
              "upvotes": 1,
              "replies": {}
            },
            "g2s94en": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s94en/",
              "text": "**I found links in your comment that were not hyperlinked:**\n\n* [m.sc](https://m.sc)\n\n*I did the honors for you.*\n\n***\n\n^[delete](https://www.reddit.com/message/compose?to=%2Fu%2FLinkifyBot&subject=delete%20g2s93xz&message=Click%20the%20send%20button%20to%20delete%20the%20false%20positive.) ^| ^[information](https://np.reddit.com/u/LinkifyBot/comments/gkkf7p) ^| ^<3",
              "author": "LinkifyBot",
              "created": 1598348291,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "g5ogse3": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ogse3/",
          "text": "Thanks for your comment! Up until now I´ve only heard good things about Dutch universities and Dutch people, in general.",
          "author": "more_guess",
          "created": 1600410890,
          "upvotes": 1,
          "replies": {}
        },
        "g2rvzoe": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rvzoe/",
          "text": "[deleted]",
          "author": null,
          "created": 1598334818,
          "upvotes": 0,
          "replies": {
            "g2s97v6": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s97v6/",
              "text": "Yes you can. No worries",
              "author": "jayhsanghvi",
              "created": 1598348393,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g2qvifr": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qvifr/",
      "text": "[deleted]",
      "author": null,
      "created": 1598312395,
      "upvotes": 37,
      "replies": {
        "g2rsnmu": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rsnmu/",
          "text": "A good university matters when it makes you surrounded by other super smart motivated people who inspire you; and because of potential facilities, resources and infrastructure. Otherwise i agree with you.",
          "author": "doornroosje",
          "created": 1598332021,
          "upvotes": 12,
          "replies": {
            "g2s8qkt": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s8qkt/",
              "text": "[deleted]",
              "author": null,
              "created": 1598347866,
              "upvotes": 2,
              "replies": {
                "g5ohnoy": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ohnoy/",
                  "text": "What´s R2?",
                  "author": "more_guess",
                  "created": 1600411691,
                  "upvotes": 1,
                  "replies": {
                    "g7shesz": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g7shesz/",
                      "text": "It's a ranking in the [Carnegie Classification system.](https://en.wikipedia.org/wiki/Carnegie_Classification_of_Institutions_of_Higher_Education) Simply put, in the US, universities can be put into a few different categories, based on how much research they perform. R1 is the top, R2 is the second tier. \n\nDon't discount R2s or R3s. While they perform less research, there is still valuable material coming from them. Occasionally, an R2 may be the better choice than an R1, depending on your specialty.",
                      "author": "peanutsfan1995",
                      "created": 1601907835,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g2s75sw": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s75sw/",
          "text": "I can only speak for recruitment in academia (in several European countries): We don't care about the university where you got the degree. A candidate with a strong track record who got his degree in a no-name university is better than one from an elite university but with zero publications and relevant experiences. Of course, an elite university might be conducive to building a stronger track record.",
          "author": "ColourlessGreenIdeas",
          "created": 1598346116,
          "upvotes": 3,
          "replies": {
            "g5ohp5t": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ohp5t/",
              "text": "This is some really valuable information! Thanks for that.",
              "author": "more_guess",
              "created": 1600411729,
              "upvotes": 1,
              "replies": {}
            },
            "g6p52so": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g6p52so/",
              "text": ">I can only speak for recruitment in academia (in several European countries)\n\nWhat field do you do recruitment in, and what countries do you have experience with?",
              "author": "BayAreaDreamer",
              "created": 1601138657,
              "upvotes": 1,
              "replies": {
                "g6pbb9b": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g6pbb9b/",
                  "text": "Germany (most experience), Sweden, Netherlands. My area is in computer science.",
                  "author": "ColourlessGreenIdeas",
                  "created": 1601142153,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g5ohldr": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ohldr/",
          "text": "Thanks for your comment! Yep, I agree with you.",
          "author": "more_guess",
          "created": 1600411630,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2qn0th": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qn0th/",
      "text": "It really depends on the department and subject matter. You can find poor departments at ETH, Cambridge and Oxford. The rankings are indeed generally meaningless and based on reputation only. I did my BSc at a university ranked \\~1700 globally. I subsequently did MSc and PhD at top 100 places and to this day I would still say that the BSc place was the best place I was ever at.\n\n&#x200B;\n\n>any of you would state that there are \"better and worse educational systems\" among EU  countries, and If so, which ones and why.\"\n\nSome gross generalisations coming your way:\n\nFrance tends to go for cramming information without allowing the student creativity. Scandinavia and the Netherlands give the students too much freedom and results in poor learning outcomes. Germany seems to have the right balance between the two.",
      "author": "radionul",
      "created": 1598308018,
      "upvotes": 78,
      "replies": {
        "g2sbl9e": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2sbl9e/",
          "text": "[deleted]",
          "author": null,
          "created": 1598350953,
          "upvotes": 4,
          "replies": {
            "g3j582n": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g3j582n/",
              "text": "Hi, if you don't mind me asking,  what do you mean by French style teaching? \n\nJust a ll biit head up,  I am currently studying in a major where 98% professors are all French-educated.  And yes, they are all very rigid and harsh.  Getting an A? in my non existant dream hahah 😂.",
              "author": "barem00n",
              "created": 1598917770,
              "upvotes": 2,
              "replies": {
                "g3jca74": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g3jca74/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1598921479,
                  "upvotes": 3,
                  "replies": {
                    "g5oidpc": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5oidpc/",
                      "text": "Nice.",
                      "author": "more_guess",
                      "created": 1600412360,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "g5os0y6": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5os0y6/",
                      "text": "I went from the German system to the UK system and also think that the UK system is much better. In the German system a certain percentage of the class has to fail by default, no matter how good or bad the class is. I love how in the UK 40-50% is a pass no matter if everybody else gets 30% or 90%. I also love how an A already starts at 70% because everything is designed in a way that nobody ever gets 100%, so you don't have to know every single detail to be an A student, but rather understand the bigger concepts.",
                      "author": "idk7643",
                      "created": 1600423025,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g5oi4u2": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5oi4u2/",
              "text": "Thanks for your comment!",
              "author": "more_guess",
              "created": 1600412128,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g2rlfv0": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rlfv0/",
          "text": "[deleted]",
          "author": null,
          "created": 1598326873,
          "upvotes": 11,
          "replies": {
            "g2rsj2o": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rsj2o/",
              "text": "Don't forget the English language bias!",
              "author": "doornroosje",
              "created": 1598331920,
              "upvotes": 11,
              "replies": {}
            },
            "g2s8hqa": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s8hqa/",
              "text": "QS, the first ranking I googled, gets [50% of its ranking from reputation.](https://www.topuniversities.com/qs-world-university-rankings/methodology) Times Higher Education has [reputation determine just over 30%.](https://www.timeshighereducation.com/world-university-rankings/world-university-rankings-2020-methodology) These are two of the major worldwide ranking systems, and they certainly use reputation as a factor.",
              "author": "102849",
              "created": 1598347595,
              "upvotes": 3,
              "replies": {
                "g5oi1w5": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5oi1w5/",
                  "text": "You know what´d be a fucking cool excercise? To convert the QS and THE rankings into others without taking account reputation. How would those rankings look like, then?",
                  "author": "more_guess",
                  "created": 1600412053,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g5ohxbw": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ohxbw/",
          "text": "Thanks for those generalisations! That´s exactly what I was looking for, haha, so thank you very much. Could you please share with me why would say that the 1700 place was better than the top 100 place? And where are the top 1700 and top 100 universities located?",
          "author": "more_guess",
          "created": 1600411936,
          "upvotes": 1,
          "replies": {
            "g5oxsjx": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5oxsjx/",
              "text": "Well, the rankings are partially based on, for example, research being produced that makes it into the world news and such. New breakthrough in cancer treatment from Oxbridge is going to raise the profile of Oxbridge in general, so much so that even the political science department benefits from such a ranking boost, even though they have nothing to do with cancer research.\n\nThe place I did my BSc was not a research oriented university at all, so they are never going to produce world changing research. That is also not their goal. They are very much a teaching-oriented university. They hire staff based solely on their ability and willingness to teach. So in terms of their enthusiasm for teaching and the quality of teaching, it was really excellent. And at BSc level, that's ultimately what I needed. In some ways, it's probably better than being at a very \"prestigious\" place where some professors consider teaching to be a distraction and don't fully invest themselves in it.",
              "author": "radionul",
              "created": 1600428937,
              "upvotes": 2,
              "replies": {
                "g5p5kpn": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5p5kpn/",
                  "text": "It makes a lot of sense, thank you!",
                  "author": "more_guess",
                  "created": 1600434626,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g6p589z": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g6p589z/",
          "text": ">France tends to go for cramming information without allowing the student creativity. Scandinavia and the Netherlands give the students too much freedom and results in poor learning outcomes. Germany seems to have the right balance between the two.\n\nThis is also my impression to some extent, having studied in France and researched the education systems in Scandinavia and the Netherlands. Out of curiosity, what field are you in?",
          "author": "BayAreaDreamer",
          "created": 1601138744,
          "upvotes": 1,
          "replies": {}
        },
        "g2sddc1": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2sddc1/",
          "text": ">Germany seems to have the right balance between the two.\n\nhave you ever seen German Universities? They are underfunded and have huge classrooms (meaning faculty per student ratio). I wouldn't describe them as balancing the two.",
          "author": "Indo_Europeanus",
          "created": 1598352768,
          "upvotes": 1,
          "replies": {
            "g2u1br2": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2u1br2/",
              "text": "Hmm my ~1700 ranked BSc place had huge class sizes as well",
              "author": "radionul",
              "created": 1598384034,
              "upvotes": 0,
              "replies": {
                "g2u1irf": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2u1irf/",
                  "text": "Which is generally a minus, because you have less opportunity and time to ask questions on a one-by-one basis.",
                  "author": "Indo_Europeanus",
                  "created": 1598384127,
                  "upvotes": 2,
                  "replies": {
                    "g2u31oc": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2u31oc/",
                      "text": "It depends, really. Many of the highly ranked places with a low faculty to student ratio are filled with professors who consider teaching to be below them.",
                      "author": "radionul",
                      "created": 1598384853,
                      "upvotes": 2,
                      "replies": {
                        "g2u5xfb": {
                          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2u5xfb/",
                          "text": "Of course it depends. But holding everything else equal, more faculty per amount of students creates more time and opportunity for students to excel.",
                          "author": "Indo_Europeanus",
                          "created": 1598386227,
                          "upvotes": 2,
                          "replies": {
                            "g2w5lnm": {
                              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2w5lnm/",
                              "text": "I'm not so sure if that is as hard and fast a rule as you think it is. When I had large classes I had the best teachers, and also many classmates with which to exchange ideas. That's not to say I think that larger classes are better, but I don't think you can make such definitive statements on the matter.",
                              "author": "radionul",
                              "created": 1598431885,
                              "upvotes": 1,
                              "replies": {
                                "g2w88du": {
                                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2w88du/",
                                  "text": "Yes you definitely can. If a teacher has 25 or 50 students in 1 class, their time is going to be less per student for the 50 students class. Irrespective of how good the teacher is.",
                                  "author": "Indo_Europeanus",
                                  "created": 1598434742,
                                  "upvotes": 1,
                                  "replies": {
                                    "g2w8h7h": {
                                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2w8h7h/",
                                      "text": "Yes, you mentioned that already.",
                                      "author": "radionul",
                                      "created": 1598435006,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g2qyvfi": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qyvfi/",
      "text": "It's really simple, the ranks are biased.\n\nThey are biased towards certain professors, areas but I believe the two biggest rank-making points are:\n\n1. How big is your university! Big universities are publishing more, more papers, higher rank. The quality isn't as important.\n2. How much of your publishing is done in English.\n\nThese two will absolutely end most European countries except for Britain and a couple of countries.\n\nI don't think anybody doubts that Germany is an engineering powerhouse and a really big player at several areas. Yet, most German Universities don't even show up at ranks, That's because of how German education is structured towards both a practical point of view and the fact there are hundreds of small dedicated research institutes competing for funding alongside those universities. None of those, the institutes, technical universities and universities will ever get top 20 ranks but nobody can deny how good they are.\n\nCountries east of Germany (Poland, Russia, Ukraine, Lithuania etc...) tend to publish things on their native language. Bachelor thesis, masters and sometimes even phD is published first on their own languages. Nothing is wrong with that but the ranks don't care if you're publishing a major breakthrough at world of maths..in Russian (this is also valid for Asia but lets focus on Europe for now)\n\nFrance. France is flipping awesome. France will never get a big university. This is just how they are structured. Small department and fields focused colleges/Grand Ecoles instead of mainstream big universities. Paris alone has: 6 Groupings of Universities subdivided in 13 Universities and 30 Grand Ecoles.\n\n&#x200B;\n\n&#x200B;\n\nIn the end, just read papers, find a professor you admire/want to work with and chase him down all over Europe. Be it Poland, Portugal or Germany. It doesn't matter. If the funding is there and the research gets done. Be proud",
      "author": "Sennksa",
      "created": 1598314271,
      "upvotes": 28,
      "replies": {
        "g5oilyt": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5oilyt/",
          "text": "Thanks for your comment! Very inspiring.",
          "author": "more_guess",
          "created": 1600412577,
          "upvotes": 1,
          "replies": {}
        },
        "g2rm6au": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rm6au/",
          "text": "[deleted]",
          "author": null,
          "created": 1598327340,
          "upvotes": -7,
          "replies": {
            "g2ruj52": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2ruj52/",
              "text": "What..? Please read Teichler (2011) on social contexts and systemic consequence of university rankings, or feel free to read the whole \"University Rankings\" publication.",
              "author": "dagostix",
              "created": 1598333557,
              "upvotes": 4,
              "replies": {}
            },
            "g2rwx5e": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rwx5e/",
              "text": "> What rankings only take into account English-language publications?\n\nTraditional paper databases like Scopus and Web of science have a [well know trouble](https://harzing.com/publications/white-papers/do-google-scholar-scopus-and-the-web-of-science-speak-your-language) indexing non-english works. If the ranking system is based on them, it shows.\n\n> This is because most academics in said countries know little to no English\nFrom my experience, this is not the reason (maybe this was true 30 years ago). The problem is that if you are for example writing a policy paper in Poland, you naturaly want it to be easily accessible by polish police makers and public. This encourage you to write your paper in polish. But if you write your paper in polish, no one outside of Poland will read it.\n\nIf you are an author from non-english speaking country (especialy if you are in social sciences/humanities), all of your papers invole a trade off: Do you aim at public impact or academic one? Because you can’t have both. And this is why most non english papers exist",
              "author": "3ducklings",
              "created": 1598335660,
              "upvotes": 3,
              "replies": {
                "g2s6upa": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s6upa/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1598345774,
                  "upvotes": 3,
                  "replies": {
                    "g2tnrz4": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2tnrz4/",
                      "text": "> Again, what rankings only take into account English-language publications? You dodged this question because there are none.\n\nI didn’t dodge the question, I explained that the problem isn’t rankings intentionaly leaving non-english papers out, but the fact that non-english are more likely to slip unnoticed by the classic databases, which some ranking are based on.\n\n> That's simply false\n\nSource?\n\n> There are huge numbers of non-English journals in WoS and Scopus\n\nThis argument is completely irrelevant. The absolute number of non-english papers doesn’t matter, what matters is how big is the proportion of papers being left out.\n\n> And the web page you link to has nothing of relevance to add here\n\nPlease refer to figure 1 and study it carefuly.\n\n> It is a good thing that serious indexers don't include this flotsam.\n\nSource that “serious indexers” have less “flotsam” than Google analytics? If you don’t have one, please refrain from baseless accusations. They they are not conductive to a healthy debate.\n\n> Academic papers practically never have a public impact.\n\nYou are drawing false equivalence between the intent of impact and actual impact. As I already explained, a researcher may *want* to impact local policy and therefore writes in local language to hedge  their bets. Wheter the paper will actualy have impact is another, completely unrelated question.",
                      "author": "3ducklings",
                      "created": 1598377574,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g2s25cp": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s25cp/",
      "text": "I see you must be overwhelmed with all the info, whether to trust rankings or to trust which ones.  \n\n\nMost ranking agencies rank US and UK based universities among their top 50 or top 100. Scattered through you will find some Chinese, Singaporean, South Korean, Japanese, Swiss, Canadian, Australian and of course some European as well.  \n\n\nI definitely agree with others that rankings don't mean much here in Europe. One reason is that European countries have a lot of niche universities. Karolinska Institute in Sweden is one of the top medical schools in the world but since they are not a university in the sense that they don't offer programs and courses in other disciplines, don't have huge intake of students and a limited number of programs, they will be ranked low overall when compared to say Harvard or Stanford or Oxford. So it matters what your field of interest is.  \n\n\nI can not say much about all fields but for engineering/tech fields most European countries have some dedicated universities. Sweden has KTH and Chalmers. Netherlands has TU Delft, TU Eindhoven, Denmark has DTU, Germany has a number of TUs and so on. These universities are among the best in some engineering disciplines like electrical engineering, materials science. Netherlands has one of the world's best agriculture research university - Wageningen.  \n\n\nRanking and even reputation of your field at that university is one thing, the cost of living, climate, weather, your goals post graduation, job opportunities and a number of other factors should be taken into account when choosing a university. Scandinavia in general is very welcoming, while each country has their own language, English is spoken by pretty much everyone and university tuition is also low or non existent (Norway) when compared to US/UK but the weather sucks and many people from tropical or sub tropical countries complain when they have to face harsh winters and months of darkness.  \n\n\nJob opportunities also depend on various factors. Right now with COVID, I have no idea how this would affect upcoming batches of students but from their reputation, I would bet that Scandinavian countries with their strong economic policies and management, will handle economic downturn pretty well and be up and running much sooner than rest of the world.  \n\n\nI don't have much experience about other countries but Italy and Spain are relatively cheap to live and have some good universities and Mediterranean weather is also great for most of the year. Germany definitely has amazing universities but job prospects would be tied to you language proficiency so I suggest you focus on learning German from day 1. Same for French if you choose France but be aware that French people frown upon English so you may have a tough time initially communicating with locals (I have heard about active frowning upon English language by the French from a lot of accounts but I am not generalizing so don't get offended). Belgium, Netherlands are also great choices given their international nature.  \n\n\nSwitzerland would be a really amazing choice if you can manage to get into one of their federal universities - ETH/EPFL but admission rate is very low and they are among the world top 20 by most ranking agencies so yes. They are the best. But Switzerland is expensive. On average twice as expensive at least compared to any other place in Europe and getting permanent residence is also a long long journey if that is your end goal.",
      "author": "__jaykay__",
      "created": 1598340717,
      "upvotes": 9,
      "replies": {
        "g2scdkb": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2scdkb/",
          "text": "Very detailed answer covering the major information of universities across Europe!",
          "author": "nkx01",
          "created": 1598351773,
          "upvotes": 2,
          "replies": {}
        },
        "g5ok1uk": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ok1uk/",
          "text": "Thanks for your comment!",
          "author": "more_guess",
          "created": 1600414011,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2s3kix": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s3kix/",
      "text": "The ranking systems and the metrics they depend on were written long after many European universities were established. A random top-40 in the world American university is likely to mean less than Leiden University when applying for jobs in the Netherlands and likely to mean much less than the ENS or the Sorbonne when applying for jobs in France or the LSE when applying for jobs in the UK! I think that rankings can be useful sometimes but most often are just very US centric and Oxbridge and London centric. The universities are often just too small and structured differently to the monster American universities to do well in the rankings. My home university like to make a big deal of how well they are ranked but that is just because of marketing, I have never really heard anyone in academia remark how well my university is ranked, rather they will reference individual departments or scholars.\n\nEdit: for clarity",
      "author": "abcdefggfedcba1",
      "created": 1598342201,
      "upvotes": 5,
      "replies": {
        "g5ok4se": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ok4se/",
          "text": "Thanks for your comment!",
          "author": "more_guess",
          "created": 1600414097,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g2s6l7f": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s6l7f/",
      "text": "I did my BA in the UK at a University which ranks between 600-800, with an exchange year in Paris at a business school (Ecole Superieure) that is not in any rankings as its quite small, and my MA at a Dutch university which ranks in top 100. (I'm originally from Nordics).\n\nWhat can I say is that rankings absolutely do matter. They give a good indication of the overall level, of course, they should be taken with a grain of salt and not blindly relied on.\n\n\\- For the UK, it is definitely a very good indicator, I can easily say that my Uni there left me desiring for more and when I talked with others that went to higher ranking Unis in the UK, the difference in level was clear. Perhaps the most visible thing with the lower-ranking university was the other students, most were not much interested in studying,  performed badly, and the whole university lacked the atmosphere of seriousness.\n\n\\- For France, rankings matter much less because many French universities are not even in the international ranking lists, but within the country, people will know how each school is 'ranked' or rather viewed from the reputational point. Some schools like Sorbonne and Science Po (and some others) are viewed as out of this world and have immense status attached to). The school I went to was very highly regarded, top-notch teachers, guest speakers, etc. Very competitive environment, teachers were tough, but the study style is vastly different from the UK (in France they really love presentations for example).\n\n\\- For the Netherlands, it seems like all of their universities (not the applied sciences ones) are ranking within the top 100. I can say especially comparing to my UK uni, the level in NL is so so much higher, tougher and the teachers are well-known academics in their respective fields. All other students are super focused, the study is very demanding, its really hard to get good grades, and overall the atmosphere is overall very 'academic'.\n\nEdit: the rankings are based on this: [https://www.timeshighereducation.com/world-university-rankings/2020/world-ranking#!/page/0/length/-1/sort\\_by/rank/sort\\_order/asc/cols/stats](https://www.timeshighereducation.com/world-university-rankings/2020/world-ranking#!/page/0/length/-1/sort_by/rank/sort_order/asc/cols/stats)",
      "author": "mapsgeek",
      "created": 1598345482,
      "upvotes": 5,
      "replies": {
        "g5okekf": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5okekf/",
          "text": "Thanks for your comment! I really appreciate the comparison you made among those 3 different universities.",
          "author": "more_guess",
          "created": 1600414382,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2s15hk": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s15hk/",
      "text": "I can only speak for Germany (currently doing my BA in philosophy, German Studies, and education there). Your workload will very much depend on your subject. (disclaimer: I can only speak for how things are at my university. I know that things may be different at other German universities)\n\nI did maths for a while, and there you have weekly homework that you need to hand in, and you need to get 50% of the points overall for that, just to be allowed to take the actual exam. At the same time for philosophy and German Studies there's a lot of weekly readings. But if we're real here, you can get by even if you don't do all of the readings. In philosophy we usually have to do 2 assignments per seminar to be allowed to take the exam/write the final paper. Usually 1 oral assignment (e.g. a presentation, lead a discussion, record a podcast, etc.) and 1 written assignment (an essay). Same applies for German most of the time (although we do also have weekly homework for Medieval German).\n\nNow, the important thing (and I think that's different to how the US does it) is that you're solely graded on your final exam. All those smaller assignments during the semester are just a pass/fail thing. So there's way more pressure to do well in exams.\n\nWe also don't have something like Ivy League universities, as the majority of German universities are public. However, there is the \"German Universities Excellence Initiative\". Every 4 years 11 universities get elected be part of this initiative and receive extra funding. So they're kinda considered to be \"elite universities\".\n\nI am at one of those 11 universities, and they pride themselves with that, and also that they're in the Top100 universities of the shanghai university ranking (Top5 for national universities, best uni for maths in Germany). But as a humanities student you don't really profit from that :'D",
      "author": "pandoricas_box",
      "created": 1598339703,
      "upvotes": 4,
      "replies": {
        "g2s62au": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s62au/",
          "text": "The intermediate assignments not counting toward your final grade is specific to your university I would note. Perhaps even to your chosen field of studies. I also studied at an “excellence initiative” university, and while the final exam was heavily weighted (70% or so of your final grade), the intermediary assignments did at least count for something. Definitely there is a larger emphasis on this one final exam than the US system, however, perhaps made more difficult by the fact multiple choice is not a thing in Germany. Everything is written form, essay based, or mathematical proofs.",
          "author": "wellEulerbedamned",
          "created": 1598344907,
          "upvotes": 1,
          "replies": {
            "g2sryv5": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2sryv5/",
              "text": "Multiple choice is a thing at German universities. Friends at different unis in different subjects as well as myself had to take multiple choice exams !",
              "author": "headlesschickenfish",
              "created": 1598363389,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g5okpuw": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5okpuw/",
          "text": "Thanks for your comment! I´m happy to know more about German universities now.",
          "author": "more_guess",
          "created": 1600414710,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2s7kir": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s7kir/",
      "text": "What is it that you want to do? A masters? What after that? Do you want to stay in the country or go back to South America?\n\nI have studied and worked in a few countries in the EU. so here is my take. I am talking mostly about humanities here. \n\n* Belgium: very risk-averse. Also more focused on domestic students. Internationals are more used for the high tuition fees\n* Portugal: takes risks with research. A bit old-fashioned bureaucratic to start but you have liberty (depends on supervisor though).\n* Austria: well-funded, organised, but it does not seem to play internationally. Very much inwards but open to foreign students. The country is open administratively as well (more than Belgium for example) but the population is quite conservative. \n* Germany: A bit more open, but the academic job market is really hard. Only 5% of academics have tenure, others have 6ys contracts max. So it's good for a PhD and postdoc but not for later on. No tuition fees though!\n* Italy: the most beautiful country of the list probably but the University is just chaotic. No organisation whatsoever. An Erasmus student aborted her exchange after one month because the teaching and studying in general was so bad. \n* UK: actually the level if the students is not that good. Because of the high tuition fees, students are treated like customers, and they are not challenged as much as in other countries. Good for research though. On the other hand, UKRI has opened its grants for all international students so it's not limited to UK/EU students anymore. \n* Norway: very good conditions for study. I think you still get a maintenance grant. but it's Norway, not a really exciting place to live (and ridiculously expensive as well).\n* France: no experience, but they are pretty chauvinistic.\n\nEvery country has its advantages and disadvantages. I would certainly choose a place where you get a scholarship.",
      "author": "frugalacademic",
      "created": 1598346571,
      "upvotes": 4,
      "replies": {
        "g5olb6w": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5olb6w/",
          "text": "Thanks for your comment! I really appreciate the comparison you made. I´ll be going to Belgium in a couple of weeks to start my Master´s, and I can tell you that after doing a lot of research, that was the cheapeast option by much! For international students, some masters are between 950-1750 euros for the whole academic year, while literally every other university with such high ranking position (I´ll be going to KU Leuven, ranked 45° by THE) charged 17,000 euros and above (I literally looked into every top 200 university, and by \"every\" I literally mean every), so I´d say that Belgium would be the cheapeast option (among not only Europe, but every other high ranked university) for international students (if you don´t get an scholarship).",
          "author": "more_guess",
          "created": 1600415340,
          "upvotes": 1,
          "replies": {
            "g605lpi": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g605lpi/",
              "text": "Ok, KUL still has some cheaper tuition fees but they are being hiked up every year. What will you be studying? Regarding rankings: they don't mean a lot. \nAnyway, Leuven is a nice city, a bit small and most students go home in the weekend so it might feel a bit deserted. With COVID, obviously there are less people and less activities. For foreign students, check out Pangaea, a meeting space with regular activities https://www.facebook.com/PangaeaKULeuven/\nI saw your post about working, I'll answer there in a separate response.",
              "author": "frugalacademic",
              "created": 1600623802,
              "upvotes": 2,
              "replies": {
                "g606w55": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g606w55/",
                  "text": "Thanks brother! Yep, I´d like to travel on the weekends (as much as the current situation allows) to other cities/countries, since I totally expect Leuven to be a little empty/boring when students go home. I already subscribed to the \"Buddy Programme\" at Pangea, but the haven´t told us anything yet, but thanks for sharing that FB page! In regard to my post about working, thanks in advance! Oh, and finally, in regard to rankings, yeah, I know they don´t mean anything in Europe, but in South America they -unfortunately/fortunately- are quite relevant, and since there are 99% chances that I will come back to my country in 10 months after finishing my Master´s, I will have to take into account my country´s logic, however, I made this post cause I was curious about the European´s logic. Thanks for all the info!",
                  "author": "more_guess",
                  "created": 1600624200,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g6p6njp": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g6p6njp/",
          "text": ">Belgium: very risk-averse. Also more focused on domestic students. Internationals are more used for the high tuition fees\n\nI second what the OP said. As someone from outside the EU, Belgium has some of the cheapest tuition fees in Europe, especially if you're looking for English-language programs. Other countries charge like 14,000 euros and up to foreigners even at public institutions, or else are taught in non-English languages.",
          "author": "BayAreaDreamer",
          "created": 1601139530,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2qpccy": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qpccy/",
      "text": "I’m U.K. based so can’t speak to the rest of Europe, but the rankings certainly mean something here! Especially if you break it down by the actual subject you’re interested in and not just a universities general score. Obviously rank isn’t everything as where a university is and it’s style of teaching can suit people better or worse, but that’s more dependent on you.\nOutside the UK there are many fantastic universities, so I’m not sure it’s so easy to characterise every university in one particular country as better or worse than another. Once you get to the university level there’s much more diversity and less government involvement as well, so a country’s education system doesn’t have so much of an effect.",
      "author": "Pineapleman2",
      "created": 1598309213,
      "upvotes": 5,
      "replies": {
        "g2r74q2": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2r74q2/",
          "text": "how do you think a prospective student can determine the teaching style before entering such university if i may ask?",
          "author": "wadsworth_flufferton",
          "created": 1598318820,
          "upvotes": 1,
          "replies": {
            "g2s5oai": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s5oai/",
              "text": "In regard to the UK, “the student room” forum is an excellent resource. Since in the UK you select a specific course, it’s very easy to head over to the forum section specifically for your prospective university/course and ask/interact with people already studying there. Teaching may differ between departments so specifically interacting with your prospective peers is useful.  When I applied for my undergraduate degree, I used that forum extensively to identify universities where the course I wanted had Socratic style seminars, which is my preferred learning style.",
              "author": "wellEulerbedamned",
              "created": 1598344484,
              "upvotes": 1,
              "replies": {}
            },
            "g2s7acv": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s7acv/",
              "text": "Yep, student room or most university courses have fairly detailed descriptions of what things will be taught and how, especially if it’s a course with a fair amount of variation like medicine for example",
              "author": "Pineapleman2",
              "created": 1598346256,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "g5okr50": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5okr50/",
          "text": "Thanks for your comment!",
          "author": "more_guess",
          "created": 1600414747,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2sf9ti": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2sf9ti/",
      "text": "I'm from Italy, and even if it's true that we don't have rankings, there are some universities that are commonly considered the best, either because is extremely difficult to pass the entry exam, or because they are known for the high level of teachers that teach there (talking about people who are famous in their subject of research). \nAs I'm starting University this year I decided to focus mainly on the employment rate to decide (the percentage of people who got hired once they graduated) so I guess that's another way to rank Universities, also as I was told by many people who work abroad, Italian universities are the best in Europe, and some of the best in the world, since they were able to find a job mainly because of their Italian degree.",
      "author": "noeffort_",
      "created": 1598354560,
      "upvotes": 2,
      "replies": {
        "g5olj35": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5olj35/",
          "text": "Thanks for your comment! I was in Italy twice when I was kid and it was simply beautiful. I used to live in Brescia, in front of \"Lago di Garda\". Such a nice place!",
          "author": "more_guess",
          "created": 1600415576,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g5omngz": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5omngz/",
      "text": "Thanks to everybody! It's been a pleasure reading all your thoughts and perspectives. In my case, I did my Bachelor's at a top 1,000 university (according to THE) in South America, and I'll be going to Belgium to start my Master's in 2 weeks at KU Leuven (Belgian highest ranked university and top 45 worlwide, according to THE). I still don't know what to expect, but if any of you are curious about my experience, feel free to PM. Thanks to everybody again!",
      "author": "more_guess",
      "created": 1600416815,
      "upvotes": 1,
      "replies": {
        "g6p6x4r": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g6p6x4r/",
          "text": ">I'll be going to Belgium to start my Master's in 2 weeks at KU Leuven (Belgian highest ranked university and top 45 worlwide, according to THE). I still don't know what to expect, but if any of you are curious about my experience, feel free to PM. Thanks to everybody again!\n\nI've very curious to learn more both about what you're studying and your experience. I've thought of doing a MA in Belgium as well, and was accepted to a program this year but decided to defer for a year.",
          "author": "BayAreaDreamer",
          "created": 1601139682,
          "upvotes": 2,
          "replies": {
            "g6qr6ga": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g6qr6ga/",
              "text": "Feel free to PM me with everything you’d like to know/talk about!",
              "author": "more_guess",
              "created": 1601161924,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g2rzxhn": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rzxhn/",
      "text": "I can't speak to rankings, but I know one of my PhD supervisors didn't think much of Belgian unis. She said they hand out doctorates to anyone. I have no idea if this is true - I'm Australian. I also don't know if there was a bigger cultural clash underlying that comment (she's Dutch). I don't know anything about Dutch-Belgian history / relationships.",
      "author": "sentientketchup",
      "created": 1598338481,
      "upvotes": 1,
      "replies": {
        "g5ollxv": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5ollxv/",
          "text": "Haha, they´re always fight between each other! Whether it´s politics, education, financial situation; etc.",
          "author": "more_guess",
          "created": 1600415664,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2qqu82": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qqu82/",
      "text": "There’s things like the Shanghai rankings but I dunno how good they are really. http://www.shanghairanking.com",
      "author": "liedra",
      "created": 1598309995,
      "upvotes": -5,
      "replies": {
        "g2rp3ny": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2rp3ny/",
          "text": "Grossly irrelevant for non UK, non American universities, as they basically evaluate institutions based on how similar to Cambridge and Harvard they are.",
          "author": "NilsTillander",
          "created": 1598329320,
          "upvotes": 14,
          "replies": {
            "g5olnbu": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5olnbu/",
              "text": "I´m also aware of that.",
              "author": "more_guess",
              "created": 1600415705,
              "upvotes": 1,
              "replies": {}
            },
            "g2s55mg": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s55mg/",
              "text": "[deleted]",
              "author": null,
              "created": 1598343916,
              "upvotes": 1,
              "replies": {
                "g2s5e4a": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s5e4a/",
                  "text": "Yeah, I know, but they are decades behind, and their strategy is clunky at best, and downright confusing for students. Schools that have nothing to do with each others, with independent administrations, locations, and cultures are bundled together under buzznamy banners like ParisTech...it's just so freaking stupid.",
                  "author": "NilsTillander",
                  "created": 1598344175,
                  "upvotes": 1,
                  "replies": {}
                },
                "g2wcvdg": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2wcvdg/",
                  "text": "Yeah I hear Austrian unis are all about the Shanghai rankings too. I guess you like the ones you’re doing ok in?? :)",
                  "author": "liedra",
                  "created": 1598439497,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g2w4x8g": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2w4x8g/",
          "text": "Just try the following example to see how shit the Shanghai ranking is:\n\n\nSort it by the category aerospace. Suddenly, the top spots are filled with Chinese unis no one has ever heard about. There's no way these unis are better than MIT, Stanford, etc...\n\nI'm very confident in saying that because I went to BUAA (the top university in the Shanghai aerospace ranking). The quality of education is shocking.",
          "author": null,
          "created": 1598431142,
          "upvotes": 2,
          "replies": {
            "g5olq7k": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5olq7k/",
              "text": "Thanks for your comment!",
              "author": "more_guess",
              "created": 1600415795,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g5olmhi": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5olmhi/",
          "text": "Thanks!",
          "author": "more_guess",
          "created": 1600415680,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g2s8yz6": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s8yz6/",
      "text": "Nah, rather look at courses and their review-",
      "author": "porraSV",
      "created": 1598348126,
      "upvotes": 0,
      "replies": {}
    },
    "g2qryw5": {
      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2qryw5/",
      "text": "If money doesn't matter, I'd still look at world rankings to figure out which ones are highest ranked in the world. That's because you're likely to need your university to have a name and international connections, since you won't live in the universities country forever.\nI would avoid Germany because the classes are giant with hundreds of people in the same room, and the professors are arrogant and make people fail on purpose. In the UK you get a lot of personal connections with them and a lot of support.\nI'd definitely look into the northern countries, specifically Sweden has some very good universities.",
      "author": "idk7643",
      "created": 1598310601,
      "upvotes": -20,
      "replies": {
        "g2s78ad": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2s78ad/",
          "text": "I understand why you were downvoted, but for anyone who is interested why this poster made the comment he did about Germany, I would like to clarify: it is true that for some subjects you will fail. A certain percentage of the class *needs* to fail for some subjects. It’s nothing to do with arrogance on the part of the professor, and everything to do with that just being how the system works at some universities and for some subject areas.\n\nThe class average determines exactly that, the average. A C. The bottom however-many-percent of the class will fail. The top however-many-percent will get A’s. As an extreme (and unlikely) example, if the class average is 90/100, because you happen to be a part of an extremely capable cohort, 90 could become a C. It is an extreme meritocracy. It not only depends on how good you are, you also have to be better than all of your peers. It’s like combining class rank and grade into one measure, and makes it extraordinarily difficult to translate your grades outside of the German system. \n\nThe grading scale runs from 1 (best) to 6 (worst), though 5 is a fail. Thus, a degree grade of 2.5 is Good, and implies that among those who graduated, within your subject cohort at your university, you were perfectly average. Converting your grade based on international conversion tables, however, downgrades you to something around a 3.0 in the US system. Maybe even a 2.67. Despite the fact that, in recent years, national average grades in the US have moved towards a B (3.3) for many subjects. In the German system that wouldn’t be possible. The average is, and will always be, a 2.5.\n\nThis system does prevent grade inflation, indicates to employers your class rank among your cohort, and also whittles down the number of students for subjects that have no enrolment limits (Numerus Clausus), since you need to pass core classes in order to progress in the degree program. It also, however, fosters an absolutely cutthroat environment in some subjects, where collaborating with other students to study, and for note sharing, is not an optimal strategy; because your classmate may then do better than you - in turn lowering your own grade.",
          "author": "wellEulerbedamned",
          "created": 1598346194,
          "upvotes": 2,
          "replies": {
            "g2tsm4y": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2tsm4y/",
              "text": "I'm actually German but had the opportunity to encounter several other school and university systems, and that's why I wrote the comment. Germany would be my very last option for university, only before places like Bulgaria or Romania. In Germany 100 students could get grades between 85%-100%, and the ones with 85% would still fail, as you have explained. In other school systems passing or failing isn't tied to how lucky or unlucky you are, it is based on your actual ability-- e.g. 50% will be a pass, even if nobody gets it, or all get it. Also at a German University you will never meet your professors. In other systems, you can literally schedule a 1 on 1 meeting with any of them just to ask them questions.",
              "author": "idk7643",
              "created": 1598379872,
              "upvotes": 3,
              "replies": {
                "g2wt4j0": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2wt4j0/",
                  "text": "From my personal experience; you can always ask for 1 on 1 time with professors and you dont get graded in a curve (at least during your bachelors)",
                  "author": "EternalRMG",
                  "created": 1598450892,
                  "upvotes": 1,
                  "replies": {
                    "g2yrfdm": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2yrfdm/",
                      "text": "But how do they find time for that? Germans have told me that lecture halls usally hold hundreds of people at once. In the UK, my course is about 50 people, with maybe 40 showing up at peak times. There's usally 3-5 people waiting after class for questions. So how would that be practically doable with so many people?",
                      "author": "idk7643",
                      "created": 1598484142,
                      "upvotes": 1,
                      "replies": {
                        "g302xf3": {
                          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g302xf3/",
                          "text": "Most of them leave like 10mins for questions at the end of the lecture\n\nThe big halls are usually only for the first 2 or 3 semesters. Usually afterwards the amount of students falls to a more managable level. \n\n\nMost lectures have 10-15 people weekly practice groups that deal with most class questions and problems. Normally, either master students or bachelor students that have done well in the lecture in the past are responsable for there groups\n\nAnd then if you have more specific question the professors weekly hours are there for you",
                          "author": "EternalRMG",
                          "created": 1598515132,
                          "upvotes": 1,
                          "replies": {
                            "g34pitz": {
                              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g34pitz/",
                              "text": "Interesting. In the UK your course is specialised from the beginning, and it only happens very rarely that you have maybe 5 or 10 people from another degree in your lecture. You don't have that whole foundation thing where you study stuff that's not directly related to your degree-- e.g. I study biomedical science, so I had no lectures at all on animals, plants, advanced statistics or non organic chemistry. It only focuses on topics directly related to human biology right from the start. In Germany there's only Biology or Medicine, which are both very broad and generic.\n\nThat means that even in year one (semesters 1 and 2) you can't have just a masters student explaining you anything because a PhD is the minimum requirement to know what you're telling us. If a master student taught us anything he/she would only know it just as well as we do. All of our lecturers are also researchers, and their research usally relates to what they teach. E.g. My genetics professor simultaneously does research on cancer genetics. She can't suddenly go and teach about immunology or cells, because she's only a specialist in genetics.",
                              "author": "idk7643",
                              "created": 1598620113,
                              "upvotes": 1,
                              "replies": {
                                "g354qys": {
                                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g354qys/",
                                  "text": "There are also more specialized studies at a bachelors levels (Molecular Biotechnology, Biomedical Engineering, Mechatronics...) but those are usually a minority and they do have a lower ammount of students ( between 20 - 30 get accepted per year).\n\nBut the predominant philosophy in the german system is to go broad for your bachelors and then specialize either at the end of your bachelors (Depending on the Degree you can start specializing after your 3rd semester) or in your masters.\n(The education system here is based of the idea that you will always do both)\n\nThe courses that have the big 100+ halls are usually for the Degrees that have no or very low entry requirements but are also very hard (Physics,Math, EE...).\n\nAfter 1 or 2 semester those that arent cut for it usually leave, so the ammount of students drops significantly. \n\nThe Degrees that do have a high entry requirements are usually more stable but also have fewer students\n\nI have no experience regarding the system at a higher or more specialized level, but i assume that once you specialize more the situation becomes more similar to the one you describe",
                                  "author": "EternalRMG",
                                  "created": 1598628035,
                                  "upvotes": 1,
                                  "replies": {
                                    "g35yvuz": {
                                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g35yvuz/",
                                      "text": ">After 1 or 2 semester those that arent cut for it usually leave, so the ammount of students drops significantly. \n\nIn the UK only 5-10% leave per year, which are the ones who either drop out volunteeringly or who literally didn't put in any work and just never submitted anything. There's no difference between different degrees in that aspect.\n\nI think this might have to do with highschool: in Germany in the Abitur you have pretty much all subjects until the very end of grade 12 (Math, German, English, Science, etc...) but in the British school system, there's only 1 kind of highschool and it gets specialised towards the end. All people have to pass the GCSEs in grade 10, which is the minimum requirement to leave high school (equivalent to Mittlere Reife, Hauptschule doesn't exist). If you continue, you only choose 3 subjects you specialise in in your last 2 years, which are your A-Levels (Hochschulreife). \n\nNow the key is, that in your A levels you have an entirely free choice of the 3 subjects you choose. \nYou could only take e.g. Math, Physics and computer science, or philosophy, Art and English literature, or German, Spanish and Maderin. So your A level choices influence which subjects you can apply for at university.\n\nYou have waaay more lessons, with 9 lessons (40min each) 5 days a week, plus 3 times extra curricular activities which are usally made compulsory by the school. Plus 2h homework per day, so you easily have an 8-9h day during all of highschool. This means people who aren't \"cut\" for a bachelors in e.g. math, already fail at their math A level. If you get good grades in Math A level you have to be cut for a bachelors in it by default, because you can't pass any A level without having a lot of determination and a gift for it. For example, I did an A level is physics and ended up with an F. I put in sooo much effort and extra time and sat with my teacher 4h per week after school for extra practice, but I just suck at math. Meanwhile, I did really well in Biology, where our classes best student gave up and dropped it because she never got above C no matter what she tried.",
                                      "author": "idk7643",
                                      "created": 1598642339,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g5olus0": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5olus0/",
                  "text": "Love the fact that you´re a German critizing the German system!",
                  "author": "more_guess",
                  "created": 1600415933,
                  "upvotes": 1,
                  "replies": {
                    "g5orn08": {
                      "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5orn08/",
                      "text": "Yeah, a lot of Germans like to pretend like it's the best education ever, but the moment I experienced a different system it really hit me how incredibly stupid the German system is. Especially highschool as well, it might be the worst system anybody could come up with.",
                      "author": "idk7643",
                      "created": 1600422580,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g2w51jx": {
              "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g2w51jx/",
              "text": "This curve based grading does not happen in German universities very often. During my entire studies, I've never even encountered once. Professors always had fixed cutoffs: you pass when you get around 40% of the points. If that means that 60% of the class will fail - so what, try again next semester.",
              "author": null,
              "created": 1598431274,
              "upvotes": 2,
              "replies": {
                "g5osyvh": {
                  "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5osyvh/",
                  "text": ">If that means that 60% of the class will fail - so what, try again next semester.\n\nIf more than 30% of the class would fail in the UK, the professor would get into a lot of trouble because he seems to not do his job right.\nIn the UK all professors communicate with each other and have very specific guidelines on what a student has to know to get an C, B or A and thus they aim to make all modules you take equally hard.\nA grade isn't supposed to be harder or easier achieved depending on the professor or the course, but it's supposed to reflect how well you understand the subject. So the professor aims at having everybody get at least a C, because a C (50%) is defined as the \"satisfactory\" level of understanding. That doesn't mean the test is easier, it just means the professor will have to re-evaluate his teaching methods if people don't pass the test",
                  "author": "idk7643",
                  "created": 1600424087,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g5olr6r": {
          "link": "/r/AskAcademia/comments/ifywlm/how_do_european_universities_compare_to_each/g5olr6r/",
          "text": "Thanks for your advise!",
          "author": "more_guess",
          "created": 1600415826,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}