{
  "sid": "pxvf0i",
  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/",
  "title:": "What are the best conference-travel related financial \"hacks\"?",
  "text": "I've been really, really bad at taking advantage of points/membership/etc from airlines, hotel booking websites, cards that give you lounge access or cashback, etc when I've travelled. However I know some of my colleagues do a great job at getting lots of perks. We're not travelling these days because COVID of course, but what is your strategy for getting the most out of the perks of conference travel? Do you use certain cards, which airline reward points are worth it, are there certain hotel booking websites (e.g. booking.com I think when you're a member you get free upgrades) that are worth being a regular customer?",
  "author": "whataremyhockeys",
  "created": 1632922175,
  "updated": 1634078808,
  "over_18": false,
  "upvotes": 80,
  "upvote_ratio": 0.98,
  "comments": {
    "heqh869": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqh869/",
      "text": "I strongly recommend against using third party booking sites.  Basically you have to go through them for any issues, and I’ve seen plenty of people end up getting screwed.  Even had one friend pay the site , got confirmation but then the site didn’t actually buy the ticket from the airline due to a tech problem, so they had no ticket and also no money.\n\nStaying at the conference hotel is nice but there are often cheaper, better options.  “Conference rate” is sometimes HIGHER than the normal rate.  My next conference (fingers crossed it’s still in person) I’m staying at an AirBnB (whole apt) on the beach four blocks from the conference hotel for $100 less per night than the conference rate.\n\nOverall, I’ve found “churning” points to not be worth it unless you’re traveling a lot (last job was 30% travel).  Now I don’t bother.",
      "author": "Decisionsota",
      "created": 1632930558,
      "upvotes": 100,
      "replies": {
        "hercexu": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hercexu/",
          "text": ">third party booking sites.\n\nYeah, I used to use Expedia, but they won't even give out proper receipts.\n\n> Staying at the conference hotel is nice \n\nThis is one perk that I don't mind dinging my research budgets for.  It's *so* convenient to be able to pop up to your room during breaks or to slip out to the pool during boring sessions.",
          "author": "rlrl",
          "created": 1632943218,
          "upvotes": 35,
          "replies": {
            "hesfm44": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesfm44/",
              "text": "Proximity to colleagues is great too. Not that you'll be taking them up to your hotel room (I hope), but not having to worry about transportation is ideal and just being present in the colleague-rich environment of hotel bars, hotel breakfast areas, hotel adjacent restaurants can lead to more social connection and coincidental conversation. \n\nAlso those midday shoe changes, sweater grabs, laptop pickup or drop off... Nice.",
              "author": "IAmAQuailBiologist",
              "created": 1632960362,
              "upvotes": 18,
              "replies": {
                "heuvyl5": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heuvyl5/",
                  "text": "Yeah, through grad school I always stayed in the cheapest possible place. I got some great deals and ended up in some sketchy-ass AirBnB situations. \n\nOne time a Houston Uber driver looked at me horrified when the app told him the ride was over - “you’re staying *here*? Uh oh. Don’t be walking at night.” Didn’t end up feeling like I was in danger, though it was shitty. No towels or soap in the bathroom, broken locks on the doors, a theater group downstairs literally *practicing their screams* for an hour. But it was like $45/night… \n\nIf it were just about bare-bones accommodations, I might still be doing that shit. Cheap is cheap. A bed is a bed. What sucks, though, is when at the end of a long conference day, you’re talking with a colleague who proposes getting a nightcap at the conference hotel bar before they head back up to their room. But you know you’ve got 45 mins of bus/train/rideshare back to your shitty closet, then will have to leave it again at 6:30 am to get back in time for the first session of the day. \n\nSo you miss out on the real personal connection-building time, get awful sleeps, and can’t change shoes if you discover too late that your new pair is rubbing a blister. I feel lucky that my salary now lets me bite the conference hotel bullet.",
                  "author": "elizzybeth",
                  "created": 1633014094,
                  "upvotes": 2,
                  "replies": {}
                },
                "hewo2nl": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewo2nl/",
                  "text": "Hanging out late at night in the conference hotel *anyway* (depends on how lively the town is obviously) then having to order a cab to get to your airbnb *every night*, probably works out better getting the hotel unless it's on your actual dime",
                  "author": "whataremyhockeys",
                  "created": 1633041424,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hetyahw": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hetyahw/",
              "text": "Meh... Had a conference in Valencia  (Spain) once. I could pay 130 euros/night to stay in the depressed outskirt where the conference center is... In one of these cold \"faked feelings\" hotels, and nowhere near nice to eat... Or pay 70€/night to be in the heart of the historical centre, 15 minutes by metro away....",
              "author": "lucaxx85",
              "created": 1632994866,
              "upvotes": 6,
              "replies": {
                "hewobrl": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewobrl/",
                  "text": "Oh yeah this depends on how much you care about city hanging out vs the actual conference. We all know those conferences that are kind of boring but everyone goes to and there aren't many sessions you actually want to attend.. then, you stay in the city and ditch the conference hotel. Instead if it's a 8am-midnight conference (yup, this is my regular one)... you probably stay in the conference hotel",
                  "author": "whataremyhockeys",
                  "created": 1633041543,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "heqs6jh": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqs6jh/",
          "text": "Second!\n\nBut this is good advice for life in general. Third-party sites may save a buck, but they're a tremendous hassle if anything ever goes wrong.",
          "author": "Greenmantle22",
          "created": 1632934908,
          "upvotes": 22,
          "replies": {}
        },
        "her4ft5": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/her4ft5/",
          "text": ">My next conference (fingers crossed it’s still in person) I’m staying at an AirBnB (whole apt) on the beach four blocks from the conference hotel for $100 less per night than the conference rate.\n\nThis. So much this. \n\nI was at a conference in Philadelphia and the conference hotel was adjacent to the convention center. It was far more per night than an AirBnB off Spruce Street that was *perfect*. I paid less, had more space and was able to enjoy bits of Philadelphia (which I love). \n\nThe biggest hack is that using third party sites and booking at the conference's preferred hotel is often more expensive and inflexible than doing a bit of the legwork on your own. You'll save more money and often times get to actually experience the city you're visiting and not just hotel-conference-hotel circuits.",
          "author": null,
          "created": 1632939924,
          "upvotes": 11,
          "replies": {
            "hesrze8": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesrze8/",
              "text": "I've done pretty much this in Philly. Conference hotels there are way more expensive and a city like Philly has super fun and interesting neighborhoods to explore for far cheaper. The cost to Lyft in or use the train is way cheaper when all things are considered.",
              "author": "SpearandMagicHelmet",
              "created": 1632966159,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hertkk5": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hertkk5/",
          "text": "Price considerations depend somewhat on who's paying. If you have a block grant, work for feds, etc, or otherwise have a \"we have unlimited amount of money\" situation then it's usually not best for the individual to look for cheap options. Many big hotel chains like Hilton have great perks, including free breakfast and/or other meals. The trick is that your hotel room can be reimbursed (even if the rate actually includes food, as long as it's not a separate line item) whereas meals are not reimbursed separately if you have a time-based per diem system. That is, you can stay in a good hotel and eat for free, and still get the federal per diem reimbursement which you can buy alcohol with, put in your IRA, or whatever. On top of that is of course earning bonus points with that hotel chain, which you can usually use later for personal travel.\n\nOf course if you are working on a tight grant then that may not be an option",
          "author": "newpua_bie",
          "created": 1632950163,
          "upvotes": 8,
          "replies": {
            "hewojsk": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewojsk/",
              "text": "> whereas meals are not reimbursed separately if you have a time-based per diem system\n\nhooooo yes sir, this is the important point. we got a per diem that was REALLY paltry, and the amount of food you'd get for breakfast on that amount (a coffee and a slice of toast..?) is far less than the hotel breakfast buffet. side eye though at my labmate roomie who expensed an extra per diem for breakfast despite getting free breakfast at the hotel...",
              "author": "whataremyhockeys",
              "created": 1633041646,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "heshbuv": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heshbuv/",
          "text": "Thanks! What do you think about StudentUniverse. I tend to use them a lot as a student.",
          "author": "XoaH2",
          "created": 1632961186,
          "upvotes": 1,
          "replies": {
            "hesvsld": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesvsld/",
              "text": "I've never specifically used StudentUniverse, but I imagine it goes by the same rules: it's a third party site, so if anything goes wrong you have to work it out with them. Discount travel brokers tend to be less flexible and helpful than the actual companies themselves - e.g., Hilton is more likely to help you find an alternative place to stay if they accidentally overbooked than StudentUniverse is.\n\nI'd poke around first and see if you can find good rates even without them. Sometimes the rates on the third party sites actually aren't even the best.",
              "author": "roseofjuly",
              "created": 1632967950,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hesvcd2": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesvcd2/",
          "text": "This, this, this. Third-party booking sites also don't get real-time updates for availability - I've booked a hotel room through Expedia only to get to the hotel and learn that they had no room for me because they had sold the last room hours ago. I do not recommend going through third-party sites - you don't really save that much money.\n\nAnd yeah, airline points are made for people who travel a LOT - think once a month or more. Airline mileage clubs didn't start being meaningful to me until I was traveling 1-2 times a month for work. Look at the mileage plan details - you really have to spend or travel a lot in order to make out with anything valuable. I'd just book whatever is cheapest for conferences.",
          "author": "roseofjuly",
          "created": 1632967735,
          "upvotes": 1,
          "replies": {
            "hewows3": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewows3/",
              "text": "yeah if you're not the one shelling out money anyway, I wouldn't do it for a conference especially a big one where *all the popular places are going to be booked out* so you'd be screwed if something happened last-minute to your booking. OTOH I just used a third party site for a one-day vacation hotel and definitely benefited from that, if it fell through I could have easily booked one of many other airbnbs/apartments",
              "author": "whataremyhockeys",
              "created": 1633041814,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "het2cit": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/het2cit/",
          "text": "I stayed at a hostel in Austin instead of the conference hotel. $40/night plus live music, a bar, restaurant AND I didn't have to hobnob with conference attendees. I'll never do the conference hotel again!",
          "author": "WhitnessPP",
          "created": 1632971194,
          "upvotes": 1,
          "replies": {
            "hf14e21": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hf14e21/",
              "text": "> I didn't have to hobnob with conference attendees.\n\nIsn't networking like half the point of conferences, though? (This is not a rhetorical question.) I'd thought that remained valuable to some degree even after one was established professionally--though I wouldn't know personally. Of course, you might simply be late-career and past the point that it would be useful.",
              "author": "Super-Move",
              "created": 1633128657,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hewnwkt": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewnwkt/",
          "text": "Thanks for the reply! \n\n> Staying at the conference hotel is nice but there are often cheaper, better options.\n\nAgree but when your lab is rich, rolling out of bed into the morning talk, sneaking in naps during the day PLUS free hotel breakfast, is worth it IMO",
          "author": "whataremyhockeys",
          "created": 1633041346,
          "upvotes": 1,
          "replies": {
            "hex6hpv": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hex6hpv/",
              "text": "This is true.  I don’t currently have that kind of research budget unfortunately, and inevitably have to come out of pocket for travel by the end of the year.",
              "author": "Decisionsota",
              "created": 1633050434,
              "upvotes": 2,
              "replies": {
                "hf17ail": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hf17ail/",
                  "text": "Oof, that's painful..",
                  "author": "whataremyhockeys",
                  "created": 1633130067,
                  "upvotes": 1,
                  "replies": {
                    "hf1jmoq": {
                      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hf1jmoq/",
                      "text": "Yup but I want a job at the end of this process soooo…",
                      "author": "Decisionsota",
                      "created": 1633136140,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "heqpgcg": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqpgcg/",
      "text": "A couple of things I do:  \n1. Have a frequent flier account with an airline that's most convenient and try to use the same one. If you get to travel often, your miles add up pretty quickly and you can use that other perks, preferred boarding, booking vacations, traveling home and related stuff.\n\n2. Instead of staying at the conference venue, I prefer to stay at an Airbnb a small walk away. It's often a lot cheaper than the venue and allows me to travel and go around the city more.\n\n3. Don't use third party apps in general, they often charge more and are less accountable. It's easy to stay on top of these things yourself.\n\n4. Having a credit card that'll give you miles for regular purchases and airline travel also helps. A few of my friends had that and they were happy with it. But I personally prefer cash back cards instead.\n\n6. The conference restaurants can also be a bit expensive. Getting a meal or a drink with people somewhere near downtown or some other place helps. This also allows us to explore the city and try interesting cuisines if it's a new culture.",
      "author": "svenkata",
      "created": 1632933827,
      "upvotes": 31,
      "replies": {
        "her1zga": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/her1zga/",
          "text": "Related to the first and 4th points, see which airline uses your local airport as a hub. My local airport (MSP) is a Delta hub, so at the start of going to grad school here, I applied for an Amex/Delta partnership credit card that I use for most things including (when allowed) educational air travel. I get multiplied miles for school-funded transit. Most major airports are a hub for some airline or another, so see who's partnered with your airport!",
          "author": "Admiral_Sarcasm",
          "created": 1632938906,
          "upvotes": 5,
          "replies": {}
        },
        "heqqnzk": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqqnzk/",
          "text": "[deleted]",
          "author": null,
          "created": 1632934303,
          "upvotes": 11,
          "replies": {
            "heqrahc": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqrahc/",
              "text": "You should check with your own university/employer, but I've done that for travel with various different jobs.",
              "author": "nick_hedp",
              "created": 1632934550,
              "upvotes": 18,
              "replies": {}
            },
            "heqsasj": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqsasj/",
              "text": "In many cases, as long as it's at or below the GSA rate for that city, they'll reimburse any type of lodging. But that's not universal!",
              "author": "Greenmantle22",
              "created": 1632934957,
              "upvotes": 15,
              "replies": {}
            },
            "heqx3eu": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqx3eu/",
              "text": "Very much university dependent.  Mine used to but about a year before covid hit, they were cracking down on Airbnb reembursement so you really need to check your places guidelines.",
              "author": "AimanaCorts",
              "created": 1632936899,
              "upvotes": 6,
              "replies": {}
            },
            "heqt9k3": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqt9k3/",
              "text": "Many places yes, as long as it’s below the daily rate for that city.  Check your Uni Policy to be sure.",
              "author": "Decisionsota",
              "created": 1632935346,
              "upvotes": 2,
              "replies": {}
            },
            "herhdwi": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/herhdwi/",
              "text": "Totally depends on the university. \n\nOne university I worked at changed its policy for the next fiscal year (without publicizing it). At the time, they also required employees to pay on their own and get reimbursed. \n\nSo I stayed at an Airbnb for $45/night, versus $150/night for the conference hotel. The reimbursement process moved slowly, my receipts came up on the next FY's budget, and nope, no reimbursement allowed.",
              "author": "wipekitty",
              "created": 1632945222,
              "upvotes": 2,
              "replies": {}
            },
            "hequdhr": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hequdhr/",
              "text": "Yup, agree with what the others are saying. I've been doing that for most conferences I've been to and never had a problem from my university. My university was flexible that way. Better to check with yours.",
              "author": "svenkata",
              "created": 1632935804,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hes8vvk": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hes8vvk/",
          "text": "More broadly building on some of these suggestions, I’ve made really good use of shop.ID.me and the general discounts available for a lot of things. I’ve saved a mint on things I would have purchased anyway.",
          "author": "whycantusonicwood",
          "created": 1632957153,
          "upvotes": 1,
          "replies": {
            "hewpcc2": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewpcc2/",
              "text": ">  shop.ID.me \n\njust heard of this for the first time and looked at the website. I don't really understand - what exactly is it? how does it work?",
              "author": "whataremyhockeys",
              "created": 1633042018,
              "upvotes": 1,
              "replies": {
                "hewq2b6": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewq2b6/",
                  "text": "Discount verifying site. It seemed weird to me when I first saw it on the Under Armour website, but it’s the same underlying system that’s used to verify things like unemployment claims for various states. Basically just a way to verify whether someone claiming a teaching/medical/military/etc. discount online is verifiably entitled to that discount. I’ve saved a bundle on clothes I would have bought and was going to buy anyway, got some gift cards mailed to me by resigning up for Costco through it, and got cash back on some fishing gear and home improvement stuff I was already going to purchase. It’s free and has already more than made itself worth the effort I went through to get it. Your mileage may vary, but I’ve really enjoyed having it and have benefitted from it.",
                  "author": "whycantusonicwood",
                  "created": 1633042353,
                  "upvotes": 2,
                  "replies": {
                    "hewrhid": {
                      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewrhid/",
                      "text": "Oh interesting. What kind of discount are you claiming then? Is it a student or academic one?",
                      "author": "whataremyhockeys",
                      "created": 1633043024,
                      "upvotes": 1,
                      "replies": {
                        "hewruc6": {
                          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewruc6/",
                          "text": "Teachers get one (including those in higher ed.). \n\nEdit: as do other groups. There’s a list of what qualifies under each category on the website.",
                          "author": "whycantusonicwood",
                          "created": 1633043195,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hesgdc4": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesgdc4/",
          "text": "On #4 - cash back card all the way for me, or travel points that can be converted to cash (like Chase).\n\nMy work and personal travel destinations almost never allow airline loyalty, but cash money can always find a home.",
          "author": "IAmAQuailBiologist",
          "created": 1632960723,
          "upvotes": 1,
          "replies": {
            "hewpfda": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewpfda/",
              "text": "> cash back card all the way for me, \n\nwhich one do you use? clearly I need to sign up for one ASAP..",
              "author": "whataremyhockeys",
              "created": 1633042057,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hesqlbw": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesqlbw/",
          "text": "Absolutely endorse the frequent flier one, pick a program and then use the same airline and make sure you give your number for everything. A colleague taught me this and I accrued enough points for free lounge access, which is so great and useful, and I can offer to take colleagues travelling with me in too. Totally worth it, especially since you really just have to pick airlines when you’re booking anyway.",
          "author": "ranglin",
          "created": 1632965509,
          "upvotes": 1,
          "replies": {
            "hesx9q6": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesx9q6/",
              "text": "Exactly! It's doubly golden if you're an international student. When I'd travel back home, I could also get really significant price cuts on my international travel tickets. It's one of the relatively bigger expenses and as a student living on a stipend, it's a massive help.",
              "author": "svenkata",
              "created": 1632968657,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hewp63j": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewp63j/",
          "text": "Thanks for the useful answer!\n\n> 1. Have a frequent flier account with an airline that's most convenient and try to use the same one.\n\nwhich one do you use if you don't mind sharing your secrets..? \n\n> 3. Having a credit card that'll give you miles for regular purchases and airline travel also helps. A few of my friends had that and they were happy with it. But I personally prefer cash back cards instead.\n\nditto..",
          "author": "whataremyhockeys",
          "created": 1633041935,
          "upvotes": 1,
          "replies": {
            "hewyws4": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewyws4/",
              "text": "I studied in a small town near Chicago and Chicago O'Hare was a hub for American Airlines (AA). AA gave me the most flexibility and I went for that.",
              "author": "svenkata",
              "created": 1633046709,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "herebc9": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/herebc9/",
      "text": "Book holiday post-conference - means you can do some sightseeing without having to pay for flights!",
      "author": "DhatKidM",
      "created": 1632943992,
      "upvotes": 20,
      "replies": {
        "hesqqnx": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesqqnx/",
          "text": "Some institutions have policies for this, like only one or two days allowed each side of the conference dates. But good idea in general, and I always try and take whatever extra I’m allowed if I can.",
          "author": "ranglin",
          "created": 1632965578,
          "upvotes": 3,
          "replies": {
            "hesvwt9": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesvwt9/",
              "text": "Even if you're allowed only a few days, often the flight is still covered because it'd cost the same no matter when you fly back.",
              "author": "roseofjuly",
              "created": 1632968006,
              "upvotes": 3,
              "replies": {}
            },
            "hetyeuj": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hetyeuj/",
              "text": ">only one or two days allowed each side of the conference dates\n\nWhy would anyone do that? I guess the logic \"so... we emitted 4 tons of CO2 to send you to the other side of the world... Don't even try seeing what's there\"",
              "author": "lucaxx85",
              "created": 1632994974,
              "upvotes": 3,
              "replies": {
                "heug9ei": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heug9ei/",
                  "text": "Fringe benefits tax apparently, if you take more than 50% of your trip as personal time it constitutes a fringe benefit and the business has to pay tax on it.",
                  "author": "ranglin",
                  "created": 1633007034,
                  "upvotes": 1,
                  "replies": {
                    "heugskh": {
                      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heugskh/",
                      "text": "But \"my trip\" ends when the conference ends and I don't claim any receipt/hotel after that moment. I just move the plane ticket return date...",
                      "author": "lucaxx85",
                      "created": 1633007300,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "hetyfbm": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hetyfbm/",
                  "text": "4 tons would need 36287.4 human hairs to lift. This is assuming a hair can lift 100 grams, which is usualy but not always the case.",
                  "author": "useles-converter-bot",
                  "created": 1632994986,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "hetk6os": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hetk6os/",
              "text": "What's their logic behind that? Seems overly harsh...",
              "author": "DhatKidM",
              "created": 1632982323,
              "upvotes": 2,
              "replies": {
                "heu1r1y": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heu1r1y/",
                  "text": "My institution's logic is that they want you back at work to teach. Conference attendance is fine but it disrupts teaching (we're a teaching conference) and they want you to take vacations during the 4 months when classes aren't in session. Not paying for flights back past the day after a conference ends takes care of that.",
                  "author": "rockyfaceprof",
                  "created": 1632997807,
                  "upvotes": 3,
                  "replies": {
                    "heu1vhv": {
                      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heu1vhv/",
                      "text": "Ahhh I see - mine was more research intensive, so outside of scheduled teaching it was fairly relaxed.",
                      "author": "DhatKidM",
                      "created": 1632997905,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "heqs410": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqs410/",
      "text": "A lot of this depends on your university, and their travel policies.\n\nMy employer will only pay above the GSA rate for a hotel if it's the conference host site. This is common for lodging. I use an airline-branded card for hotel stays, as I get bonus miles for hotel charges. My airfare must be booked through the university's travel office. They get a staggering discount on airfare, but only work with one airline. Granted, we are just down the road from that airline's biggest hub and it's my airline of choice anyway, but it still stings people who want to fly a different carrier. You can add your frequent-flyer information to the reservation after the university books it, so that's a plus.",
      "author": "Greenmantle22",
      "created": 1632934879,
      "upvotes": 8,
      "replies": {}
    },
    "herjqc0": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/herjqc0/",
      "text": "Best advice is to pick one airline to use consistently - pick one that you like that has lots of flights out of your home preferred airport - and one hotel chain to use consistently (big ones are the Hilton chain and the Marriott chain). Personally, I use Delta and Hilton. I have the Delta branded card to stock up on miles and points so that I can get consistent upgrades when I fly. \n\nSecond everyone who has advised NOT to use third party booking sites (like [booking.com](https://booking.com) or expedia or others). You may get upgrades but there's also a lot of places for communication breakdown and tech issues, and if that happens the hotel or airline is under NO obligation to help you. When I book on the Delta app and Hilton app, my app confirms my booking with an email and I can use that at the hotel or airport to get help if I need it (I never have).\n\nAirbnbs are also a great option if your uni will reimburse them.",
      "author": "boilerlashes",
      "created": 1632946176,
      "upvotes": 7,
      "replies": {
        "hesr08v": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesr08v/",
          "text": "Do you get perks from Hilton for being a frequent stayer? I’m yet to find a chain with good perks for staying, but would preference a hotel if it helped.",
          "author": "ranglin",
          "created": 1632965702,
          "upvotes": 2,
          "replies": {
            "hesy03h": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesy03h/",
              "text": "Hilton has a free program called Hilton Honors. If you sign up, you see the lowest rates on their website and you get free wifi at their locations. You can also earn points, which you can then use towards free stays. The value is the enormity of the Hilton brand - lots of hotels will count towards points - but generally, you have to use them pretty frequently to get a free stay. Each dollar = 10 points; how many points you need varies by the location and type of hotel.\n\nFor example, there are 40 hotels in NYC that you could use points for; they vary in cost from 30K points to 717K points for *one* free night. Since each dollar = 10 points, to get to 30K points you'd need to spend $3,000 at Hilton to get one free night at the cheapest hotel in NYC. Assuming a conference rate of $300/night, and a stay of 3 days, that would be four conferences before you get one free night. It may take you 1-2 years to get one free night.\n\nHonestly, I found that most mileage and point systems are really made for very frequent business travelers: people who are probably traveling about once a month or so or more and are spending a lot of their company's money. The amounts of miles or stays you need to get into the upper tiers are really tied to that kind of travel: for example, even the level above basic (Silver) for Hilton Honors requires four stays a year (or 10 nights), and the level above that (Gold) requires 20 stays (or 40 nights).\n\nUnless you also travel pretty often for fun and always stay in a Hilton, many academics would likely struggle to hit Silver, and probably won't hit Gold. But there are some roles that basically have people living out of hotels M-R. Before the pandemic, my role had me traveling 1-2 times a month and I was like \"Ohhhh, THIS is how people get status.\" That doesn't mean you shouldn't join the program (they're free!) or try to book with a single airline or hotel chain if the prices aren't that different, but it does mean that all of the cool benefits they advertise may not be easily available to you, and you should definitely read through the terms.",
              "author": "roseofjuly",
              "created": 1632969015,
              "upvotes": 3,
              "replies": {
                "hewq5lo": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewq5lo/",
                  "text": "> free wifi at their locations.\nare there hotels that still don't have free wifi?? yeesh\n\n> That doesn't mean you shouldn't join the program (they're free!) or try to book with a single airline or hotel chain if the prices aren't that different, but it does mean that all of the cool benefits they advertise may not be easily available to you, and you should definitely read through the terms.\n\ngood to know.. I've never really capitalized on any perks of any points card really, I always also manage to forget about the points and they expire or something. :/",
                  "author": "whataremyhockeys",
                  "created": 1633042396,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hetylup": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hetylup/",
          "text": ">Best advice is to pick one airline to use consistently\n\nDo you manage to do that? I've tried but... Staying with one specific airline meant like spending even 200€ more per flight!  (e.g.: went to Australia via star alliance, tried to book again on that network to go to the US... it would have been 1,000€ instead of 800!)",
          "author": "lucaxx85",
          "created": 1632995149,
          "upvotes": 2,
          "replies": {
            "hewqbje": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewqbje/",
              "text": "I guess it depends if you're going somewhere with more variety of carriers, how rich your lab is (i.e. a 200 EUR difference wouldn't mean much) and how flexible you are with dates as to whether you're able to do this",
              "author": "whataremyhockeys",
              "created": 1633042472,
              "upvotes": 1,
              "replies": {}
            },
            "hexhruz": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hexhruz/",
              "text": "Yeah. I’m a bit forced though- I live in a small city only serviced by two carriers, and my uni has worked out a reduced business rate through one of them. We’re able to use the reduced rate for personal travel as well. So there’s way fewer options and we’re highly encouraged to go with the uni rate airline even if it’s more expensive than the other (more miles through uni = more strength when they negotiate reduced rate next year).",
              "author": "boilerlashes",
              "created": 1633055897,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hewpvvd": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewpvvd/",
          "text": "Awesome, love this response and will definitely start doing this! \n\n> Second everyone who has advised NOT to use third party booking sites (like booking.com or expedia or others).\n\nInteresting, I've booked tons of times on booking . com and never felt like I was gonna be out to dry, but then again I don't think I had any problems. For third party sites some of the smaller ones are more sketchy for sure, like for one flight (for personal travel) it was like impossible to reschedule.",
          "author": "whataremyhockeys",
          "created": 1633042271,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "heraet3": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heraet3/",
      "text": "Pre covid I was traveling once a month in Europe. Honestly there's nothing that good. The real hack is to realise how much money airports and hotels suck out of you just by casually being there and buying food and drinks. £1 chocolate bar , £15 lunch £3 water etc etc . All for crap stuff you can buy in the corner shop over the road , or take in a packed lunch on the way.  Bring a water bottle , you can refill it after security. \n\nThat will save you more money both ways on the journey than rewards points will ever get you.",
      "author": "zukerblerg",
      "created": 1632942395,
      "upvotes": 5,
      "replies": {
        "herawar": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/herawar/",
          "text": "It's a work trip. That's why the Good Lord invented expenses.",
          "author": "BlokeyBlokeBloke",
          "created": 1632942598,
          "upvotes": 6,
          "replies": {
            "hesy51k": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hesy51k/",
              "text": "That's if you can freely expense what you want. A lot of government workers and/or grants are on a per diem basis, where you can only expense a certain amount per day.",
              "author": "roseofjuly",
              "created": 1632969082,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "herq0ym": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/herq0ym/",
      "text": "If you work at a state U, see if your university has government hotel rates loaded into its online booking tool. Depending on the city, it can be a great deal, and you can often get that rate for personal travel, too.\n\nSee if your university's rental vehicle contract is available for leisure use.\n\nStay far, far away from third party booking sites of any flavor. If adding personal travel or upgrading a ticket, get comparisons at the time of booking and keep the personal part separate (or easily distinguishable on the receipt) to speed reimbursement.",
      "author": "fsu2k",
      "created": 1632948717,
      "upvotes": 6,
      "replies": {}
    },
    "her3wci": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/her3wci/",
      "text": "I've been using points to travel (not conference/work-related though) for years. We take at least one big trip or several smaller trips using points alone every year.  The major credit cards that provide the best rewards are either [Chase Sapphire](https://thepointsguy.com/guide/chase-sapphire-preferred-vs-chase-sapphire-reserve/) or [Capital One](https://www.capitalone.com/credit-cards/).  There are lots of sites out there that go into detail about the best way to take advantage of points. Some people get really advanced with using third party sites to buy points or applying for multiple cards per year but that's too much work for me.  Our Capital One card allows us to book whatever travel related item and then immediately apply the points/credit to the account.   I highly recommend it. :)",
      "author": "bungchiwow",
      "created": 1632939700,
      "upvotes": 3,
      "replies": {
        "heu2w5e": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heu2w5e/",
          "text": "For non-work travel, we do exactly this. Right now Chase Sapphire Preferred is offering 100,000 points if you spend $4000 in the first 3 months after approval. We use those points to stay at Hyatt Place hotels. Those are typically 5-8000 points to stay in but the cost would typically be $150-$180. Last month we took a 4 day trip from Nashville down the Natchez Trace, to Natchez, to Memphis and back home. We stayed in Hyatt Place hotels along the way and spent 31,000 points for 5 nights. The hotels would have cost over $900. The credit card costs $100 a year. It is first-dollar insurance for auto rental insurance and has travel insurance (that's really only relevant for illness, not for \"any reason\" to cancel travel).\n\nWe also got Chase Southwest cards (business and personal--business if you ever make a dollar outside of a paycheck works). Those also required spending a certain amount in the first months after opening the account. With that we then made me a companion for my wife's card, so I fly free for 23 months. She earned so many points by opening up the card that she's been flying free since she opened up the card 2 years ago. Obviously COVID has impacted our travel, but we've taken 5 trips in the last 2 years, all on points that came from opening the card. We still have many points left. I cancelled her cards right before the first year was up so we didn't have to pay for the cards beyond that time. When we run out of her points, I'll open up the 2 cards for me and we'll rinse and repeat. Each of us can do that every 4 years so by alternating we'll have free flights pretty much forever, until we've seen everything that we care to see where Southwest flies.\n\nThe only other thing I do to build points is to have a very minimal amount of taxes withheld and instead make estimated payments using the Chase card. It costs right at 2% to do it but the payback is very good. If I pay $5000 in taxes, it costs $100 to do it but I can use the 5000 points to pay for a Hyatt Place hotel that would have cost $150-180.",
          "author": "rockyfaceprof",
          "created": 1632998701,
          "upvotes": 2,
          "replies": {
            "hewr10w": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewr10w/",
              "text": "> The credit card costs $100 a year.\n\nI guess this relies on your academic work/life balance allowing you to take these trips to make up the cost :( travel insurance sounds good though, if I'm travelling at least 3-4 times a year. \n\n> She earned so many points by opening up the card that she's been flying free since she opened up the card 2 years ago\n\nWhoa. I guess I need to get on this. Is there an equivalent outside Southwest..? (As I am in the northeast)",
              "author": "whataremyhockeys",
              "created": 1633042806,
              "upvotes": 1,
              "replies": {
                "hexfqlw": {
                  "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hexfqlw/",
                  "text": "I don't know of any airline that has this kind of reward system other than Southwest. You might look at their route map; they fly all over the country and into the Caribbean and a few flights into Central America.\n\nhttps://www.southwest.com/flight/routemap\\_dyn.html",
                  "author": "rockyfaceprof",
                  "created": 1633054891,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hewqkro": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewqkro/",
          "text": "> The major credit cards that provide the best rewards are either Chase Sapphire or Capital One\n\nAwesome, this is what I needed! Thanks for the info",
          "author": "whataremyhockeys",
          "created": 1633042593,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "heqw1wh": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/heqw1wh/",
      "text": "Staying in a hostel is a great way to save money and also be near other conference-goers. The last conference I attended physically, we practiced our spiels on each other. This is almost always cheaper than the rate for each city. As others said, book directly with the hostel, and not through a 3rd-party app. \n\nSometimes, entire labs or groups of people get an AirBnB together. This is also pretty cheap.",
      "author": "Hot_Spinach7691",
      "created": 1632936479,
      "upvotes": 8,
      "replies": {
        "hera51g": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hera51g/",
          "text": "I don't want to save money. Someone else is paying for the trip or I am not going. And anyway, I cannot think of anything worse than sharing a house with my boss.",
          "author": "BlokeyBlokeBloke",
          "created": 1632942285,
          "upvotes": 13,
          "replies": {
            "hewqigi": {
              "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewqigi/",
              "text": "> I don't want to save money. Someone else is paying for the trip or I am not going. \n\nThis..\n\nAlthough by \"whole lab\" I would generally HOPE it's everyone EXCEPT the PI. This is how it was with my old lab although we rarely managed to get everyone in the same house (we are a huge lab).",
              "author": "whataremyhockeys",
              "created": 1633042562,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "herlp5j": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/herlp5j/",
      "text": "I get access to Tickets at Work and a group only hotel search engine by being a member of a national roller coaster group. I get far better rates that way than through conferences or my school. \n\nI also have an airline rewards credit card (specifically Amex for Delta) so sometimes I get a free flight.",
      "author": "phoenix-corn",
      "created": 1632946961,
      "upvotes": 2,
      "replies": {}
    },
    "het8tgk": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/het8tgk/",
      "text": "I agree with the other about airplane loyalty and hotel. O use United for airplane and JW Marriott for hotels. United because I can exchange the miles into goods (not only free flights). JW Marriott because almost every city in the world has this chain. Also the point exchange for free nights also relatively cheap.\nMy advisor never give me any concern as long as the prices are reasonable, US based airline and it's economy class.\n\nI just want to add another hack, which is pre conference reimbursement. Usually I already know that I have to present about 2-3 months before the actual conference.  So I will just buy the airplane tickets, book hotel and pay the conference fee right after the acceptance notification. Then I will process this reimbursement as soon as possible.  This makes me headache free because my credit card limit was really low and also avoid any credit card interest.",
      "author": "renangdidanau",
      "created": 1632974835,
      "upvotes": 2,
      "replies": {
        "hewraxt": {
          "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/hewraxt/",
          "text": "> I just want to add another hack, which is pre conference reimbursement.\n\nMy lab used to have its own credit card that we could just immediately charge, I miss those days :'( Luckily we now have a travel website that immediately takes the flight charge hit, but for accommodation and conference fees we have to reimburse again sadly..",
          "author": "whataremyhockeys",
          "created": 1633042935,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "her5o5s": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/her5o5s/",
      "text": "Airbnb",
      "author": "Benderineurope",
      "created": 1632940433,
      "upvotes": 1,
      "replies": {}
    },
    "herpsd6": {
      "link": "/r/AskAcademia/comments/pxvf0i/what_are_the_best_conferencetravel_related/herpsd6/",
      "text": "r/churning",
      "author": "LionSuneater",
      "created": 1632948621,
      "upvotes": 0,
      "replies": {}
    }
  }
}