{
  "sid": "dm3ui0",
  "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/",
  "title:": "Someone plagiarised my PhD dissertation. I need advice.",
  "text": "30% of their dissertation abstract is taken word by word from my own dissertation abstract. What should I do?",
  "author": "califarmb",
  "created": 1571856996,
  "updated": 1634081196,
  "over_18": false,
  "upvotes": 153,
  "upvote_ratio": 0.99,
  "comments": {
    "f4x5zyv": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4x5zyv/",
      "text": "If you are at a US university, then speaking both as the Research Integrity Officer (RIO) for my university and as someone who tried to deal with one of these situations myself when I was a faculty member, you should bring this to the attention of your university's RIO, along with clear documentation showing the problem.  This is exactly the sort of thing that we handle and we know how to handle it effectively.  I recommend that you do NOT contact the person or their university directly, as you will almost certainly not get satisfaction, you will be upset by the responses you get, and you will muddy the water.",
      "author": "bigrottentuna",
      "created": 1571862716,
      "upvotes": 287,
      "replies": {
        "f4ye3ee": {
          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4ye3ee/",
          "text": "After seeing several of your replies in a similar vein, I just want to say how much I appreciate having you on this sub. Full professors with decades-long careers in my department do no more than validate the frustration and shrug in futility when these issues come up. We do have an RIO, and still, the prevailing attitude is one of \"yeah, but what can they really do?\" It's encouraging to know that you and others in your position can be effective advocates. Thanks!",
          "author": "thereticent",
          "created": 1571875130,
          "upvotes": 154,
          "replies": {
            "f51tr52": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f51tr52/",
              "text": "Thanks for this.  This kind of situation is always ugly.  We take it seriously and do the best we can to help, but our toolset is almost as limited as that of your senior faculty.  However, we do know the right things to say and who to say them to, and people tend to pay more attention when those things are said by a campus officer and/or our attorneys.",
              "author": "bigrottentuna",
              "created": 1571944255,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "f4xdsay": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4xdsay/",
      "text": "The research integrity officer at your institution will have the experience and tools to work with you on this.",
      "author": "Amaranthesque",
      "created": 1571864626,
      "upvotes": 56,
      "replies": {}
    },
    "f4ycs8r": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4ycs8r/",
      "text": "Is it someone at your university? Is it someone that has the same advisor as you? Is it someone who is in the same cohort as you? Does your advisor know their advisor? Context?",
      "author": "episcopa",
      "created": 1571874665,
      "upvotes": 19,
      "replies": {
        "f4ydpwq": {
          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4ydpwq/",
          "text": "It's someone who did his PhD 5 years after me in the same lab with the same advisor, and on a very similar topic to my Phd.",
          "author": "califarmb",
          "created": 1571875001,
          "upvotes": 55,
          "replies": {
            "f4yi3dy": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4yi3dy/",
              "text": "Did you contact the person or the adviser to talk about it ? Do they acknowledge your work ? It is crazy that no one caught it, so it would be great to chat with your old adviser first and see what they think.",
              "author": "consciousbot",
              "created": 1571877000,
              "upvotes": 15,
              "replies": {
                "f4yi8dg": {
                  "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4yi8dg/",
                  "text": "I haven't contacted anyone yet. All of this is still new to me.",
                  "author": "califarmb",
                  "created": 1571877074,
                  "upvotes": 17,
                  "replies": {
                    "f4ykh8s": {
                      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4ykh8s/",
                      "text": "I wouldn't talk to your old advisor, I would talk to research compliance, and they will have a system, probably a Research Integrity Officer, review it for you. Don't force your old advisor to choose sides or make claims that later could hurt you or them. The school will take compliance and misconduct extremely seriously and can mediate everything for you.",
                      "author": "seringen",
                      "created": 1571878591,
                      "upvotes": 32,
                      "replies": {
                        "f50inhs": {
                          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f50inhs/",
                          "text": "I agree and I think that it's best to talk to your research officer rather than your old advisor.",
                          "author": "blueyagami",
                          "created": 1571928024,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "f4z1y7q": {
                      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4z1y7q/",
                      "text": "If it's just in the abstract, it might be that the first section (and a larger portion of the abstract) is an intro that summarizes your work that they built off.",
                      "author": "mediocre-spice",
                      "created": 1571891816,
                      "upvotes": 9,
                      "replies": {
                        "f4zb1oy": {
                          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zb1oy/",
                          "text": "> summarizes your work\n\nOP says they plagiarized word for word. That's not a summary. Doesn't matter if its 10% stolen, it was a profoundly stupid and lazy thing for the PhD student to do.",
                          "author": null,
                          "created": 1571902458,
                          "upvotes": 15,
                          "replies": {
                            "f5067ht": {
                              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f5067ht/",
                              "text": "My point was that the first several sentences of the abstract might word for word, but the actual corresponding piece in the dissertation might be a summary. Neither are acceptable but copying 30% of the actual dissertation or presenting OP's results as their own is much much worse than copying a few general statements in the abstract.",
                              "author": "mediocre-spice",
                              "created": 1571922586,
                              "upvotes": 2,
                              "replies": {
                                "f54esb4": {
                                  "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f54esb4/",
                                  "text": "> My point was that the first several sentences of the abstract might word for word\n\nNo, that is not acceptable and the fact we are having this discussion is ridiculous. I get that you can have similar ideas and sentence structure but it is not OK that the \"several sentences of the abstract\" are copied word for word.  One does not \"summarize\" by copying without proper attribution. \n\nWhy in the hell would you think that was OK?\n\nI do agree that what you mention is far worse.",
                                  "author": null,
                                  "created": 1571979672,
                                  "upvotes": 1,
                                  "replies": {
                                    "f55lmuf": {
                                      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f55lmuf/",
                                      "text": "As I said: \"Neither are acceptable\"\n\nPlease read. My point was that they're different situations and might need different strategies. If it's 3 sentences in the abstract that correspond to background and the rest is new, you can probably just talk to the advisor or someone else in the department. If it's a third of the actual document or claiming OP's results as their own, the advisor is likely in on it and OP needs to go straight to the office of research integrity.",
                                      "author": "mediocre-spice",
                                      "created": 1572009692,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "f50l5n3": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f50l5n3/",
              "text": "Possible that you can talk to your advisor?",
              "author": "episcopa",
              "created": 1571929077,
              "upvotes": 1,
              "replies": {}
            },
            "f5q4ksw": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f5q4ksw/",
              "text": "I feel for you...as far as I understand there is someone who joined your exlab after you under the same supervisor and plagiarised 30% of your introduction right?? if that is the case then I am gonna maybe disappoint you but your supervisor will not be able to do much. Depending upon the relationship you have with your boss (P.hD. supervisors are friends for life unless u get in bad relationship) he/she will listen to you and probably scold the student who plagiarised your work (again if its just intro) but not really go on an take an action that will destroy the career of that student. I have seen during my Ph.D. that supervisors hang to one of the good works of their ex-student and give that as a sample to their new students and they don't really mind them copying some of the part in the intro...For an example, my lab has a long history of working on splicing and there was this student who did a great job with the intro in 2010 and since then every alternate student as used the same format in the introduction of splicing...I tried my best introducing spliceosome etc in my way and with a different there but my boss kinda threw an old thesis on me and he said why don't you do sth like this. He even went on to say do this basic stuff as this ex-student did and focus & devote more time on the part that you would be introducing for the first time...I did as I was told to and I guess what my boss loved the part where I introduce the pathway i worked on. I am sure the next students will copy shit from mine...but hey I will be proud. \n\nP.S. it's my personal view...If you were copied by a student from another lab...go for a fight. if they copied anything apart from intro...go fight. Also, I am pretty sure ur boss knows that this student copied or took idea from urs.",
              "author": "apersonwithaPhD",
              "created": 1572372450,
              "upvotes": 1,
              "replies": {}
            },
            "f4zvsl2": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zvsl2/",
              "text": "I you already did your PhD it's no going to have an impact on you as it is only the abstract/State o the art.  It is not like this person is stealing your results, only your prose.\n\nOn that one, I would let it go. I mean if his PhD is the follow up of yours, abstract and state of the art should be more or less the same, as the physical principles should not have changed in 5 years!",
              "author": "nirvananas",
              "created": 1571916958,
              "upvotes": -7,
              "replies": {}
            },
            "f4z38yn": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4z38yn/",
              "text": "What honestly concerns you about this? It sounds like they used your dissertation as a starting point and borrowed from it. But now, what about the thesis??? Is it a difference angle? That's what's important here. If they just copied your wording on the background info then who really cares..\n\nAlso, getting official about this plagiarism will surely damage the relationship between you and your former PI. They should know what is stealing and what isn't because they literally directed both projects. If are you legitimately concerned, especially if you think they will publish without you (and you haven't published this work from 5 yrs ago), then you should contact your PI",
              "author": "IthinktherforeIthink",
              "created": 1571893143,
              "upvotes": -20,
              "replies": {
                "f4zatq1": {
                  "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zatq1/",
                  "text": "> What honestly concerns you about this?\n\nI imagine its the stealing someone else's idea/words part that they are concerned about. You know, academic dishonesty. Its astonishing the PhD student would do this.  If I was the PI, I sure as hell would want to know as this affects me as well.",
                  "author": null,
                  "created": 1571902274,
                  "upvotes": 21,
                  "replies": {
                    "f50kjdf": {
                      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f50kjdf/",
                      "text": "That’s what I’m saying.. how the hell would the PI not know at this point. When I asked that question I was wondering if he was concerned about being scooped for a paper or a grant. If you’re just talking about words and ideas.. OP’s dissertation is already out there, 5 years before this one. It’s a very simple claim at that point if it ever becomes a problem for some reason, so I ask what is the concern here",
                      "author": "IthinktherforeIthink",
                      "created": 1571928827,
                      "upvotes": 1,
                      "replies": {
                        "f54enrc": {
                          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f54enrc/",
                          "text": ">  If they just copied your wording on the background info then who really cares..\n\nNo what you're saying is what you said above in quotes. You're saying plagiarizing background is OK and it is not. This isn't a complex issue.",
                          "author": null,
                          "created": 1571979548,
                          "upvotes": 2,
                          "replies": {
                            "f59ozle": {
                              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f59ozle/",
                              "text": "Except it’s widely accepted to do so",
                              "author": "IthinktherforeIthink",
                              "created": 1572093180,
                              "upvotes": 1,
                              "replies": {
                                "f5ddm3c": {
                                  "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f5ddm3c/",
                                  "text": "In what field is it \"widely accepted\" to plagiarize word for word?",
                                  "author": null,
                                  "created": 1572152173,
                                  "upvotes": 2,
                                  "replies": {
                                    "f5durqk": {
                                      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f5durqk/",
                                      "text": "Biomedical sciences. I’m only talking about background. I see full sentences copied and then cited all the time",
                                      "author": "IthinktherforeIthink",
                                      "created": 1572159903,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f4wms67": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4wms67/",
      "text": "Is their abstract in a forthcoming or newly out article? Is it in a conference talk blurb, is it in their dissertation abstract? An abstract isn’t very long, so 30% the same doesn’t tell us much. If the piece is 30% the same, without attribution, then I’d contact their publisher. What’s the sitch here though, OP?",
      "author": "sami_shakur",
      "created": 1571857725,
      "upvotes": 31,
      "replies": {
        "f4wnq9p": {
          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4wnq9p/",
          "text": "It's their dissertation abstract. I edited the post to make it clear.",
          "author": "califarmb",
          "created": 1571858078,
          "upvotes": 31,
          "replies": {
            "f4ywjc4": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4ywjc4/",
              "text": "I second (third/whatver...) the suggestion to take this to the RIO, and to document. For this you have to look inside the dissertation as well, if you can.\n\nAt the same time, and notwithstanding the above course of action, I'd take a step back and reflect. There *is* a difference in gravity between \"plagiarized original work you did\" and \"plagiarized your formulation of introductory background material\". The latter, while still wrong, is much less severe and usually fixable. It would also not take away from how anyone views your *scientific* achievements, while the former, if left to stand, would.",
              "author": "pyrola_asarifolia",
              "created": 1571887123,
              "upvotes": 18,
              "replies": {}
            },
            "f4x4sdi": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4x4sdi/",
              "text": "Did you check the diss itself for further plagiarism? Just 30% of the abstract, while disconcerting for you, is fairly weak, but you should check the rest of the doc, and if you find anything else, or even if it’s just the abstract, you can contact the diss advisor/committee chair w/ your previously published diss abstract and theirs raising your concerns. It’s fair to do, but I’d check the diss doc too!",
              "author": "sami_shakur",
              "created": 1571862444,
              "upvotes": 38,
              "replies": {}
            }
          }
        }
      }
    },
    "f4yxmcg": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4yxmcg/",
      "text": "You got good advice to contact your RIO.\n\nBut what 30% is copied?  Is it the general background introduction like \"The dynamics  of the upper chromosphere are not well understood, but we know that small scale motions can imprint a significant influence on the general magnetohydro flow\",   or is it something very specific about conclusions and results?",
      "author": "arachnidtree",
      "created": 1571887978,
      "upvotes": 13,
      "replies": {
        "f4zcmsg": {
          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zcmsg/",
          "text": "I would like to read your dissertation on the vagaries of magnetohydro flows. I think you may have stumbled onto something deep here, solving climate change once and for all.",
          "author": "smilingbuddhauk",
          "created": 1571903755,
          "upvotes": 2,
          "replies": {
            "f507k8j": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f507k8j/",
              "text": "/r/wediditreddit",
              "author": "luleigas",
              "created": 1571923165,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "f4yrex3": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4yrex3/",
      "text": "[deleted]",
      "author": null,
      "created": 1571883396,
      "upvotes": 15,
      "replies": {
        "f4zavpq": {
          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zavpq/",
          "text": "> It might be just a very stupid mistake\n\nFrom a PhD student? This isn't an undergrad here.",
          "author": null,
          "created": 1571902320,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "f4xxsza": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4xxsza/",
      "text": "If it was published in the journal, let the journal know. If it was someone's dissertation, let their school know.",
      "author": "IIllIIllIIllIIllIIII",
      "created": 1571870068,
      "upvotes": 8,
      "replies": {}
    },
    "f4zdz8c": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zdz8c/",
      "text": "On the \"word by word\" plagiarism, don't universities have automatic systems to pick up plagiarism like this? \nI'm curious as to why this wasn't flagged from the system, as it's not particularly advanced cheating.",
      "author": "oz0n",
      "created": 1571904768,
      "upvotes": 5,
      "replies": {
        "f4zzwz0": {
          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zzwz0/",
          "text": "I don't think anybody is putting dissertations through Turnitin.",
          "author": "justaboringname",
          "created": 1571919301,
          "upvotes": 7,
          "replies": {
            "f50mvyl": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f50mvyl/",
              "text": "I thought pro quest or whatever online repository you have to submit to does this though",
              "author": "Gingerhaze12",
              "created": 1571929821,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f4wmuwy": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4wmuwy/",
      "text": "There's a bit of politics that could crop up here. \n\nYour best bet is probably to find the contact details for either the research ethics office or graduate school of the university they submitted to and forward them your thesis and a link to theirs.",
      "author": "OrbitalPete",
      "created": 1571857752,
      "upvotes": 8,
      "replies": {}
    },
    "f4wmoke": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4wmoke/",
      "text": "Contact the publisher/venue/conference or whatever.",
      "author": "CerebralBypass",
      "created": 1571857688,
      "upvotes": 1,
      "replies": {}
    },
    "f4zjkyp": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zjkyp/",
      "text": "I would first go and ask the person about it. If it were me in your position I would think the following: if the plagiarism is only in the abstract, I wouldn't really care. I mean it's a shitty thing to do, yes, but there's no actual content in the abstract. But if the person went further and plagiarised in the main text, *there* I would go scorched earth.",
      "author": "fuckwatergivemewine",
      "created": 1571908810,
      "upvotes": 0,
      "replies": {
        "f4zzz9a": {
          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zzz9a/",
          "text": "Why are you writing content-less abstracts?",
          "author": "justaboringname",
          "created": 1571919339,
          "upvotes": 2,
          "replies": {
            "f50cwio": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f50cwio/",
              "text": "What I mean is: the abstract is just the summary of the actual content, it's not \\*the\\* content in itself.",
              "author": "fuckwatergivemewine",
              "created": 1571925474,
              "upvotes": 1,
              "replies": {
                "f50em76": {
                  "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f50em76/",
                  "text": "Writing a good abstract is a skill, just like writing a good anything else, and plagiarizing an abstract is just as bad as plagiarizing anything else would be.",
                  "author": "justaboringname",
                  "created": 1571926253,
                  "upvotes": 3,
                  "replies": {
                    "f50f6pj": {
                      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f50f6pj/",
                      "text": "I differ in that. Of course, writing a good abstract is a super valuable and non-trivial skill. And plagiarising an abstract is bad. But I wouldn't go as far as claiming it's as bad as plagiarising a result. In practice I would draw the line by actually responding in full force without a warning if somebody plagiarises a result of mine, but actually go to the person and talk first if it's a matter of just the abstract.\n\nEdit: I think it's also worth pointing out the context. In my field, quantum information, introductory sections to papers have lost a lot of value. Like, it's a rare occurrence when the abstract or the introduction actually say anything new. Most of it is just hype name-dropping and meaningless. And also introductions to papers in similar subfields many times look *very* much alike. That's not ideal, I agree, but it doesn't imply that the science coming after is not good.",
                      "author": "fuckwatergivemewine",
                      "created": 1571926507,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f4yxczt": {
      "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4yxczt/",
      "text": "If you can still remember, submit the thoughts that led to the statements/questions in your paper, eg: \"I had actually thought of my cat climbing her tower so determinedly and it made me think that the evolution of her claws could be secondary to her desire to climb, which might have evolved due to her small stature, so I decided to ask if smaller animals worldwide tend to have claws.\" \n\nSend in a picture of the cat tower and your cat, as well as earlier copies of your work with the save dates showing that you wrote that material however many days/months/years before the other person. \n\nGet granular.",
      "author": "KajikiaAudax",
      "created": 1571887774,
      "upvotes": -7,
      "replies": {
        "f4zcdya": {
          "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f4zcdya/",
          "text": "What a weird suggestion. Most scientific thoughts/statements don't have a mundane bedside inspiration that you can just take a picture of.",
          "author": "smilingbuddhauk",
          "created": 1571903560,
          "upvotes": 3,
          "replies": {
            "f50ws6c": {
              "link": "/r/AskAcademia/comments/dm3ui0/someone_plagiarised_my_phd_dissertation_i_need/f50ws6c/",
              "text": "No shit.\n\nWhat I'm saying is that if someone plagiarized your shit, all other things being equal, what you have is a literature review you did and the papers that inspired you and previous analysis and e-mails to other authors and all kinds of things that show the process of you generating your paper.\n\nIt is common in computer science programs for the professor to call a student in and ask them their chain of thought that led them to constructing the code that they did. This is used to determine who actually wrote a program and who copied it, if both students are claiming to have generated the exact same code.\n\nBear in mind also that both students could also have coincidentally written the same code. That process is meant to discern whether or not that's the case.\n\nShow the process of you generating the paper if there is a dispute.",
              "author": "KajikiaAudax",
              "created": 1571934051,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}