{
  "sid": "pl24f4",
  "link": "/r/AskAcademia/comments/pl24f4/how_to_begin_to_start_being_engaged_in_research/",
  "title:": "How to begin to start being engaged in research this semester without research experience before?",
  "text": "I’m a grad student in R1 university. I don’t have any research experience before and want to purse PhD next year.\n\nI asked some professors in my university to work as volunteer in their research group (AI/ML/NLP/CV) but they seems to be not willing to accept the student without research experience. Some may say they might reconsider it after I take their courses. I’m taking and TA-ing some of them this semester, but actually I already have some prior knowledge and I want to be engaged in the research ASAP so that I can boost my resume (and papers) for the PhD application next year.\n\nIt’s hard for me to break out of this loop. What should I do?\n\nSince my domains lie at AI/ML/NLP/CV, a workaround is to look at the application side of ML, such as the research group on bioinfo, business, and social science. Another workaround is to reach out the researchers and professors outside of my universities but I’m not sure whether and how I can do it because this semester has already began.",
  "author": "scp-8989",
  "created": 1631207685,
  "updated": 1634079348,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hc7wcat": {
      "link": "/r/AskAcademia/comments/pl24f4/how_to_begin_to_start_being_engaged_in_research/hc7wcat/",
      "text": "Show them some of the work you've done from your hobby or class projects. Do you have a github repo?",
      "author": "fwafwa",
      "created": 1631216165,
      "upvotes": 2,
      "replies": {
        "hc89zei": {
          "link": "/r/AskAcademia/comments/pl24f4/how_to_begin_to_start_being_engaged_in_research/hc89zei/",
          "text": "I have. But all of us have them so it’s not a big plus I guess.",
          "author": "scp-8989",
          "created": 1631221703,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}