{
  "sid": "k46aua",
  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/",
  "title:": "What's your opinion on journals that charge article processing fees?",
  "text": "I recently saw one journal charging $3000. I was curious about people's opinions on article processing fees. Thanks!",
  "author": "Weird_Surname",
  "created": 1606773398,
  "updated": 1634082335,
  "over_18": false,
  "upvotes": 95,
  "upvote_ratio": 0.96,
  "comments": {
    "ge72luq": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge72luq/",
      "text": "[deleted]",
      "author": null,
      "created": 1606775572,
      "upvotes": 186,
      "replies": {
        "ge748o2": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge748o2/",
          "text": "/signed\n\nThere's been some success fighting back against the strangehold, but it's difficult. One problem seems to be the dinosaurs, despite official noises denying such a thing, still ultimately defaulting to using publishing in high-impact journals as a quality signifier, and the thing people are assumed to be aiming for, and thus having failed at if they don't have it.\n\nI do think we do need some kind of gatekeeping to signal quality beyond likes on Twitter and bullshit-artistry, and it needs to involve something like the ideal version of the current situation with gradations in selectivity of peer review controlled by respected academics, but it needs to be disentangled from the self-interest of journals and no longer perversely incentivized.",
          "author": "waterless2",
          "created": 1606776249,
          "upvotes": 39,
          "replies": {
            "ge77faq": {
              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge77faq/",
              "text": "I'm going to be real here. Not just dinosaurs, as a PhD student, I will absolutely submit to \"high-impact\" journals and glamour mags where possible, because these dinosaurs review our packets for hiring decisions, grants and fellowships. I'm competing with them and their students for resources.\n\nThis is a big part of the problem: the changes need to be top-down, ERCs should not have to handicap themselves, while competing for resources with established, famous labs who also started out in an easier job market.",
              "author": "HateMyself_FML",
              "created": 1606777605,
              "upvotes": 46,
              "replies": {
                "ge7cq03": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7cq03/",
                  "text": "Oh, absolutely, that's what I meant by the dino's using it as a signifier, and indeed those values then flow to the next generation. As far as I can tell it's not self-correcting just from internal processes. I suspect it's thanks to public scandals like the Stapel affaire and the replication crisis showing the dirty laundry that there's even a chance at a shift.\n\n(There's also a whole other level that's more inner-circle than I have a clear view of, where I suspect publishing in certain journals is strongly linked to belonging to certain cliques and thus signaling that when applying for grants or jobs. At least, when I was working for a big lab with a powerful PI things were a loooot different in communications with editors etc.)",
                  "author": "waterless2",
                  "created": 1606779894,
                  "upvotes": 7,
                  "replies": {}
                },
                "ge7lgm0": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7lgm0/",
                  "text": "Other ECRs don't submit to such journals out of principle, and move on to other careers. Think about them when you get hired thanks to your glam mag paper. If only you had also refused to play along, we could have changed the system.",
                  "author": "radionul",
                  "created": 1606784312,
                  "upvotes": -2,
                  "replies": {
                    "ge7pzke": {
                      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7pzke/",
                      "text": "Sorry, but I disagree. Changes need to be *systemic* and *top-down.* It's completely unacceptable to place the burden of change on ECRs, who are at the bottom of the totem pole.\n\nEstablished labs have much more money and clout. I see lots of empty promises for not publishing in glam mags but no commitment or follow through from them - heck, such empty support might even be accompanied in the next breath by DelIgHTeD to annoUnce mY NEw CNS PapER. Your not submitting to glam mags, only further cements their privilege.",
                      "author": "HateMyself_FML",
                      "created": 1606786606,
                      "upvotes": 13,
                      "replies": {
                        "ge7rtir": {
                          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7rtir/",
                          "text": "Today's glam mag obsessed profs were yesterday's principled ECRs who hated glam mags but just needed that one Nature paper to land the job. After that, they'd change things. But they never did. Turns out impact factor is like crack, and the rats in the cage keep pressing the button for more crack.\n\nChange starts at the personal level.",
                          "author": "radionul",
                          "created": 1606787602,
                          "upvotes": 1,
                          "replies": {
                            "ge7xm1n": {
                              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7xm1n/",
                              "text": "Systemic problems require systemic solutions - not hoping for the best from individuals at a personal level. A \"solution\" that places  this personal burden on the least privileged individuals, is no solution at all - it perpetuates privilege.\n\nYou want to assume personal responsibility? Start a petition to ban submitting to glam mags from your department and your uni - I'm more than happy to to help with such efforts.",
                              "author": "HateMyself_FML",
                              "created": 1606790707,
                              "upvotes": 6,
                              "replies": {
                                "ge8pmjz": {
                                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8pmjz/",
                                  "text": "I already assume personal responsibility by publishing ethically.",
                                  "author": "radionul",
                                  "created": 1606810643,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "ge8ojq3": {
                          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8ojq3/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1606809605,
                          "upvotes": -3,
                          "replies": {
                            "ge9cj9r": {
                              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge9cj9r/",
                              "text": ">If you're doing science at any level, you're privileged. Check your privilege.\n\nThis is a vacuously true statement. Of course I am in a privileged position relative to many people. This fact is also irrelevant to the discussion of power and privilege *within academia*. Everyone I'm talking about is engaged in science.",
                              "author": "HateMyself_FML",
                              "created": 1606831777,
                              "upvotes": 1,
                              "replies": {
                                "geg1f4g": {
                                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/geg1f4g/",
                                  "text": "Have you considered the possibility that the institution is no longer about anything beyond appearances? Even if there are products of practical knowledge, does that not self-publish at this point?",
                                  "author": null,
                                  "created": 1606962095,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "geb3n10": {
              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/geb3n10/",
              "text": "Do you see it changing though? I used to think it was a generational thing, but I see how the dinosaurs are hiring people who think just like them. 80% of PhD students despise the current system, but it's the 20% who play the game who get tenure, and they will perpetuate the system...",
              "author": "radionul",
              "created": 1606862412,
              "upvotes": 2,
              "replies": {
                "geb4ydd": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/geb4ydd/",
                  "text": "Honestly, for my field? I think it might well need to be destroyed and then rebuilt by different people, and I see the risks of that second part.\n\nWhere I'm seeing some internal improvements - in that paradoxical sense that it might need to die to get better - are the next generation being far more willing to leave academia, rather than staying in juuust long enough for their talent to be exploited by the dino's; people in academia being far more conscious and outspoken about what a toxic, life-draining, uninspiring mess it is; and something of a shift in attitude in which winning the academic career game (greedy funding capture, getting into high-impact journals, high-paying top jobs with no accountability) is more despicable than impressive. External positives are where scandals and massive failures are no longer swept under the rug - so it's a little harder to claim all is well and critics just have some form of sour grapes.\n\nMaybe COVID will save us, if it makes the uni's unviable as student fee milking factories, and we go back to direct public funding for research as the core business.",
                  "author": "waterless2",
                  "created": 1606863073,
                  "upvotes": 2,
                  "replies": {
                    "gebd7mo": {
                      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/gebd7mo/",
                      "text": "Ha, then your field is similar to mine. Burn it all down and start again.\n\nI think it is indeed about showing that the emperor has no clothes.",
                      "author": "radionul",
                      "created": 1606867452,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ge8cde2": {
              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8cde2/",
              "text": "Pay your dues. Behave. Don’t complain. Contribute til your soul bleeds, dammit.",
              "author": "Studguinea69",
              "created": 1606799395,
              "upvotes": -3,
              "replies": {
                "ge8x3mc": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8x3mc/",
                  "text": "LOL. so true",
                  "author": "radionul",
                  "created": 1606818656,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge7asq2": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7asq2/",
          "text": "> I am a PhD student. I don't submit my work to journals with APCs because I cannot afford them. \n\nMinor point: as a PhD student publishing alone you can often get the fees waived. Especially in society journals. For example, I had my fees waived recently for a paper in Genetics (which is considered one of the top society journals in my field).\n\nThat said, APCs are bullshit. And one shouldn't have to rely on the generosity of somebody selective waiving or reducing fees.",
          "author": "DevFRus",
          "created": 1606779057,
          "upvotes": 12,
          "replies": {
            "ge7gm3p": {
              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7gm3p/",
              "text": "[deleted]",
              "author": null,
              "created": 1606781683,
              "upvotes": 9,
              "replies": {
                "ge7wyzo": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7wyzo/",
                  "text": "Yep. Been through this process. Naively thought I would be able to get a waiver. After R&R, article acceptance, and multiple rounds of negotiation, they were willing to lower the fee by 60%. Never again.",
                  "author": "browneyes3190",
                  "created": 1606790365,
                  "upvotes": 10,
                  "replies": {}
                },
                "ge8i076": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8i076/",
                  "text": "This is a good point. I might have just gotten lucky. I had submitted based on advice from a senior colleague based on fit and didn't look into any fee structure. The fact that there are fees came as a surprise at the end and I just told them that I can't pay because I was a DPhil student at the time and they agreed to waive the fees. This was a society journal, though and I was a single author.",
                  "author": "DevFRus",
                  "created": 1606803812,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "ge8fx29": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8fx29/",
          "text": "But many grants won’t allow line items for publication fees beyond maybe a few hundred dollars.\n\nIt’s not too defensible to spend 3000 taxpayer dollars publishing a single article just to move an ambitious scholar one step up the mountain of tenure.",
          "author": "Greenmantle22",
          "created": 1606802111,
          "upvotes": 4,
          "replies": {}
        },
        "ge8n5of": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8n5of/",
          "text": "Fellow PhD without a grant to cover publication costs here. My university has recently started to push for more open access publications, which came with a special open access fund that researchers, incl. PhD candidates, can apply for to have their OA fees covered by university if they cannot be covered by a grant. The university also has deals with several publishers to waive all OA fees for university-affiliated authors; I guess in return university pays more for the subscriptions.\n\nIt doesn't solve the problem of outrageous fees in some journals, but it at least makes sure that (junior) researchers without big grants won't be at a disadvantage with regards to publications in high IF journals. Always worth checking with your advisor or librarians if similar structures exist at your university.",
          "author": "Lelislazuli",
          "created": 1606808310,
          "upvotes": 4,
          "replies": {}
        },
        "ge7jw1f": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7jw1f/",
          "text": "Which is why I upload everyone of my papers (even the final formatted manuscript) to ResearchGate, just to stick it in.",
          "author": "N1H1L",
          "created": 1606783495,
          "upvotes": 3,
          "replies": {
            "ge8ik9u": {
              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8ik9u/",
              "text": "For everything else, there's ~~mastercard~~ sci-hub.",
              "author": "Seber",
              "created": 1606804277,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "ge7uolh": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7uolh/",
          "text": "It sounds like you're paying the fees out of pocket or do I read that incorrectly?",
          "author": "Biology_Retriever",
          "created": 1606789131,
          "upvotes": 2,
          "replies": {}
        },
        "ge7hjxl": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7hjxl/",
          "text": "[deleted]",
          "author": null,
          "created": 1606782202,
          "upvotes": 2,
          "replies": {
            "ge7ls0o": {
              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7ls0o/",
              "text": "If journals were just looking to cover costs then they wouldn't have profit margins that far exceed Google and Apple now would they?",
              "author": "radionul",
              "created": 1606784466,
              "upvotes": 7,
              "replies": {
                "ge8klpg": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8klpg/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1606806011,
                  "upvotes": -1,
                  "replies": {
                    "ge8pdk8": {
                      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8pdk8/",
                      "text": "Regarding potential lost data: In contrast to copyrighted journals, if an open access journal goes bust, the data would not be lost. Precisely because of the open access license, university libraries are free to make copies for repository archiving and use the associated doi. In fact, they already do that with existing open access journals, and e.g. Google Scholar already prioritises the library archive versions in search results. So your concern about lost data is actually an argument to go open access.\n\nHigh rejection rates are a problem in general and generally waste millions of hours of people's time. I'd be all for having a model with higher acceptance rates where there is an interactive and open review forum. Perhaps a model where reviewer privelages are earned over time, in order to shut out trolls.\n\nI think you are so caught up in the academic mindset that you can't see the alternatives as better and viable, and dismiss them as soapbox pipe dreams. It's a shame, but not uncommon.\n\nAs for Apple and car companies, their profit margins are much, much lower than Elsevier and Springer Nature. Look it up.",
                      "author": "radionul",
                      "created": 1606810399,
                      "upvotes": 4,
                      "replies": {}
                    },
                    "ge92f92": {
                      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge92f92/",
                      "text": "I don't understand your argument. You say that if you get 100 submissions the 80-85 that don't get published still require the effort. But unless your journal works differently than most, neither you nor the reviewers are getting paid for that labor. So what does the labor with the other 80-85 have to do with the problem of expensive APCs? Yes, there are some costs with administering the process. What are those costs? Additionally, what makes the \"factors\" an article publisher needs to consider more valid, more pressing, or more important than those if the academics themselves? Theoretically this is supposed to be a mutually beneficial arrangement.\n\nI feel like if people involved in the system are going to use the \"but you just don't have all the ~context~\" argument, they should be at the ready to actually explain that context. Being dismissive of a pretty widely held industry concern isn't constructive or valid, either.\n\nAlso the fact that profit margins are also high on cars (which is actually not true) or iPhones is completely irrelevant. So what? Academic publishing is a different beast, and also, it sounds a lot like \"well everyone else is being exploitative too, so don't look over here!\"",
                      "author": "roseofjuly",
                      "created": 1606824183,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ge79zh9": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge79zh9/",
      "text": "Here is one rule of thumb: do not spend your personal money on publishing an article. Another rule of thumb: do not pay money to submit to or publish in a journal that you were invited to submit to (e.g., with a targeted email); it is likely a money grab / scam, and if they genuinely want your submission they should not be asking you to pay.\n\nThere is some discipline-specific variance about how common it is to pay to publish. Within my discipline, it is quite rare, and when it happens, it is to make an article open-access or for an open-access journal. Within other disciplines, I know that it is quite common and there are reputable journals that charge to publish. This should be paid for with university funds or grant money.\n\nIn general, I do not like the idea, but there are degrees of how much I dislike it. $3000 to publish an article sounds outrageous. On the flip side, a nominal processing fee for an article that will be open access that covers the cost of running the journal is less outrageous.",
      "author": "jogam",
      "created": 1606778706,
      "upvotes": 36,
      "replies": {}
    },
    "ge7i5yt": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7i5yt/",
      "text": "My society journals are moving to APCs to fund open access.  I’m fine with that.  But if the article is going behind a paywall, an APC is not appropriate.  And I won’t pay APC to a for-profit publisher (*cough* Elsevier *cough*) under any circumstances.\n\nI do find the magnitude of some APCs kind of staggering.  But if you’re publishing 30 articles a year I guess there’s not much economy of scale.",
      "author": "nrnrnr",
      "created": 1606782540,
      "upvotes": 16,
      "replies": {}
    },
    "ge7lnrf": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7lnrf/",
      "text": "These comments reflect the same as what I see when this conversation is had in the university.  This varies so much from discipline to discipline.  People should not make absolute statements.  \n\nIn some fields, nobody charges, and in others, it is only pay to play  or lower tier journals that charge.  But there are many fields where the flagship journals are jumping on this bandwagon. \n\nArticles that are open access on average get cited more than articles that are behind a paywall.  For people trying to get jobs or get tenure/promoted, citation counts are very important.  \n\nPlease do not be dismissive if this does not impact your field.  You have colleagues in the university that this does impact and it is possible this will come to your field some day.  For profit publishers are siphoning away much needed resources from academics.",
      "author": "manova",
      "created": 1606784408,
      "upvotes": 11,
      "replies": {}
    },
    "ge7cs5o": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7cs5o/",
      "text": "As a junior professor in the social sciences I never have and never will oay for publishing. I get paid by my university for publishing. Stop paying and they'll go out of bussiness.",
      "author": "phenomenologist83",
      "created": 1606779920,
      "upvotes": 18,
      "replies": {
        "ge92j7n": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge92j7n/",
          "text": "It's not that simple, depending on the field. Some of the journals with APCs may be important or high impact journals in the field, which means a rift opens: wealthier academics will be essentially able to buy their way into prestige.",
          "author": "roseofjuly",
          "created": 1606824291,
          "upvotes": 5,
          "replies": {
            "ge995l3": {
              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge995l3/",
              "text": "I understand that. But i repeat: i dont publish with them and if nobody did they wouldn't exist.",
              "author": "phenomenologist83",
              "created": 1606829606,
              "upvotes": 1,
              "replies": {
                "ge99uc0": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge99uc0/",
                  "text": "This is an overly idealistic stance, expensive journals in STEM are typically indicative of contribution to the field and thus good predictors of promotion and competitiveness for grant funding. As long as that incentive exists, scientist will continue to pay publishing fees.\n\n\"\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_(insert authority) grant me the serenity to accept the things I cannot change. The courage to change the things I can, and the wisdom to know the difference.\"",
                  "author": null,
                  "created": 1606830068,
                  "upvotes": 2,
                  "replies": {
                    "ge9be5m": {
                      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge9be5m/",
                      "text": "As I said, I'm in the social sciences. I have no idea about STEM, but I know it's a completely different context with different mechanics. STEM is what I can't change and I wouldn't attempt to. Paying for publishing in a journal in education, sociology, linguistics, anthropology and the like is easility avoidable if your work speaks for itself. As I said, as a social scientist, I never have, and never will pay to publish whicj helps dismantle a disgusting industry.",
                      "author": "phenomenologist83",
                      "created": 1606831064,
                      "upvotes": 1,
                      "replies": {
                        "genpjyi": {
                          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/genpjyi/",
                          "text": "That's why I said \"depending on the field.\" Obviously if it's not a problem for your field, then hooray for you, but we're talking about the folks for whom it *is* a problem.\n\n(Also, do realize that the fact that it is currently avoidable in the social sciences doesn't mean it will *always* be that way. If this model sees enough enough success and $$$ in STEM, the eye of Sauron may very well turn our way.)",
                          "author": "roseofjuly",
                          "created": 1607132543,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "genpez8": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/genpez8/",
                  "text": "I don't think you actually understood, though. My point is the \"if nobody did\" part won't happen, because academics with the money and the desire/need will continue to do so. There's nothing preventing them from doing so, and in fact, the lower volume will simply make it easier for them to do it.",
                  "author": "roseofjuly",
                  "created": 1607132461,
                  "upvotes": 0,
                  "replies": {
                    "genpia5": {
                      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/genpia5/",
                      "text": "Sure. Good luck.",
                      "author": "phenomenologist83",
                      "created": 1607132515,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ge7327w": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7327w/",
      "text": "I can't speak for every discipline, but in mine they're a racket, and notorious for publishing work that is poor quality. \n\nNever publish in one of these if you can help it. The only reason to do so, in my opinion, is if some committee is counting lines on your publication list, and one more will put you over the bar.",
      "author": "7Sax",
      "created": 1606775761,
      "upvotes": 24,
      "replies": {}
    },
    "ge7blag": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7blag/",
      "text": "The model is fucked. [join the boycott](http://thecostofknowledge.com/)",
      "author": "nqqw",
      "created": 1606779400,
      "upvotes": 15,
      "replies": {}
    },
    "ge7yuei": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7yuei/",
      "text": "If you're paying to have something open access, it might make sense. If you're paying to publish *and* it's not open access, you're being scammed.\n\nYes, the acceptance of journals with APCs varies by discipline (and even country); however, the above rule of thumb still holds generally.",
      "author": "WrestlingStuffGuy",
      "created": 1606791384,
      "upvotes": 3,
      "replies": {}
    },
    "ge8sn3t": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8sn3t/",
      "text": "Ahah, you, you have not yet read the [Nature announcement of their 10 k fee](https://www.nature.com/articles/d41586-020-03324-y), have you?\n\nIt's a racket. Publishers know we have to continue sending our work to them if we want permanent positions or grants, so they can do whatever they want. At this point, we need funding agencies to step in and just refuse that we use the money to publish in these journals; only way I can see for such high fees to disappear.\n\nWell, the other way would be that overall we move beyond metrics like impact factor and instead get evaluated really on the quality of our work, but as said above, that requires the dinosaurs to change their mind.",
      "author": "ClnHz",
      "created": 1606813749,
      "upvotes": 3,
      "replies": {
        "ge9ee8c": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge9ee8c/",
          "text": "I'm sure it varies by field and country, but I've found that some funders won't cover publication costs. It makes sense, because fundamentally they're paying for a report that they can do what they want with, not a journal paper that they have no control over.\n\nHowever, even if funders don't cover the costs, those costs are trivially low to my institution, so they will happily pay the costs just to get the departmental/institutional publication numbers up. Journal fees would have to increase massively to make institutions think twice about paying. It's like price inelasticity in addictive substances - it turns out you can raise the price of cigarettes to absurd levels before it changes purchasing.",
          "author": "EmileDorkheim",
          "created": 1606832888,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ge9drz8": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge9drz8/",
      "text": "My main funding requires that everything I publish is Open Access, so paying fees to cover that is essential. It's usually around £3,000. It's good because it makes peer-reviewed research more readily available to everyone, but it's also bad in terms of suppressing access to research from independent researchers and institutions with very tight budgets. However those people can always publish behind paywalls, which is better than nothing.\n\nThe whole journal system is woefully anachronistic and bloated, but I think charging processing fees is more of a symptom than a problem in itself, assuming the fees are primarily there to cover losses incurred by not paywalling an article. Unfortunately there is probably always some degree of skimming off the top happening, ranging from the wholly fraudulent journals pocketing almost all of the money to the legitimate journals taking a much lower proportion. It's tough to make a blanket statement about whether processing fees are legitimate or not.",
      "author": "EmileDorkheim",
      "created": 1606832526,
      "upvotes": 3,
      "replies": {}
    },
    "ge7bghc": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7bghc/",
      "text": "Over a decade ago, APCs started with the good intention of making the academic literature easily accessible to the public and eliminating pay walls.\n\nBut capitalism means we can't have nice things. So as soon as this kind of open-access started to get any real support from academics, for-profit publishers saw it as an opportunity for yet another profit stream. So now APCs tend to be even more restrictive than the old ways because they inhibit communication between scientists.\n\nYou should never fall for APCs for open-access since there are plenty of better ways like arXiv, bioRxiv (or your field's or university's repository) to make your work open access. And from the perspective of making your work accessible to the public, simply making the pdf free-to-get is just not enough. Usually you have to do more to contextualize your work for non-academic consumption and this can be done through blogs and social media.",
      "author": "DevFRus",
      "created": 1606779342,
      "upvotes": 8,
      "replies": {}
    },
    "ge846xh": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge846xh/",
      "text": "In my discipline I have been hard pressed to find journals without APCs. Any tips on options in biochemistry?",
      "author": "srtameow",
      "created": 1606794405,
      "upvotes": 2,
      "replies": {}
    },
    "ge8nbye": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8nbye/",
      "text": "Like the rest of the scientific publishing business, it's predatory, and the sooner it all goes down in flames, the better for science. :)",
      "author": "crazyGauss42",
      "created": 1606808470,
      "upvotes": 2,
      "replies": {}
    },
    "ge8od6v": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8od6v/",
      "text": "In short; I think it’s highly unethical profiteering.",
      "author": "ShadowyPrecepts",
      "created": 1606809431,
      "upvotes": 2,
      "replies": {}
    },
    "ge8y877": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8y877/",
      "text": "[removed]",
      "author": null,
      "created": 1606819870,
      "upvotes": 2,
      "replies": {
        "ge92tyq": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge92tyq/",
          "text": "Do academics not already volunteer to do most of the work running journals?",
          "author": "roseofjuly",
          "created": 1606824570,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ge94x4s": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge94x4s/",
      "text": "It's embezzelment of public funds. Private companies make universities and labs pay for authors' publications, even if they already pay for aaaaall the people involved in the process, from gathering the data to correct the typos. Most of the editors don't even produce a work of edition: they don't accept papers that aren't already perfectly publishable, conforming to the review's guidelines. That should be illegal AND as researchers, we shouldn't accept this anymore. Publishing in a top-10 review shouldn't be a criteria to be hired as a researcher.",
      "author": "Milougarou",
      "created": 1606826425,
      "upvotes": 2,
      "replies": {}
    },
    "ge7l1vx": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7l1vx/",
      "text": "It depends on how much. I publish in open access journals that charge a couple hundred max. That genuinely covers their costs for running the journal.\n\nNature Communications charges $5k (you are essentially paying for prestige), and in an environment where there aren't enough jobs to go around, and where we are funded by taxpayers, that kind of fee cannot be justified. Unfortunately enough people are willing to put their own selfish interests ahead of the common good for Springer Nature to make a huge profit anyway.",
      "author": "radionul",
      "created": 1606784115,
      "upvotes": 2,
      "replies": {
        "ge92lpl": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge92lpl/",
          "text": "Oh, that explains a lot about the papers I've seen in Nature Communications.",
          "author": "roseofjuly",
          "created": 1606824355,
          "upvotes": 0,
          "replies": {}
        },
        "ge7ynme": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7ynme/",
          "text": "On every hiring committee on which I've sat over the years, a publication in Nature Communications hurt more than it helped.\n\nMaybe in some fields and some departments it works, but in my experience blatant attempts at prestige-grabbing are seen through and derided.",
          "author": "WrestlingStuffGuy",
          "created": 1606791275,
          "upvotes": -3,
          "replies": {
            "ge8l4em": {
              "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8l4em/",
              "text": "That's good to hear, that there are still Islands of sanity to be found",
              "author": "radionul",
              "created": 1606806459,
              "upvotes": 0,
              "replies": {
                "ge8qqwk": {
                  "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8qqwk/",
                  "text": "Absolutely. I'm not against APCs where actually necessary and, as I said, in some fields pay-to-publish is much more common than in others; however, both my spouse and I have been sitting on hiring committees for over a decade each and at a few schools each... Neither of us have ever seen an NC publication garner much respect - there's a certain neoliberal feralness that can set into academia, but it doesn't seem to be the de facto norm quite yet.",
                  "author": "WrestlingStuffGuy",
                  "created": 1606811770,
                  "upvotes": 2,
                  "replies": {
                    "ge8wn5j": {
                      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8wn5j/",
                      "text": "This is my view too. NC publications are poor science with expensive branding. Unfortunately there aren't enough people like yourself and your wife on the hiring committees in my field.",
                      "author": "radionul",
                      "created": 1606818151,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ge7k0tc": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7k0tc/",
      "text": "This seems to vary greatly by discipline. I do research in math. I've publishing in quality open-access journals for years, and neither I nor my institution has ever paid a cent. It's never even come up.\n\nOTOH, in some other disciplines, paying to publish seems to be considered normal. I've even had people get angry with me for suggesting that it's very reasonable to run a high-quality journal with no fees for readers and no fees for authors.\n\nBut I don't see why people put up with it.",
      "author": "ggchappell",
      "created": 1606783571,
      "upvotes": 2,
      "replies": {
        "ge7m6b4": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7m6b4/",
          "text": "Hey man, PDF files on the internet is crazy tech, that stuff don't come cheap.",
          "author": "radionul",
          "created": 1606784655,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ge8bggn": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8bggn/",
      "text": "Garbage.",
      "author": "TakeOffYourMask",
      "created": 1606798760,
      "upvotes": 1,
      "replies": {}
    },
    "ge8wacn": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8wacn/",
      "text": "\"pay-to-win\"",
      "author": "hfsh",
      "created": 1606817753,
      "upvotes": 1,
      "replies": {
        "ge9dy5n": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge9dy5n/",
          "text": "That might be the case with some fraudulent, predatory journals, but with legitimate journals fees are paid after your article has already been peer reviewed and accepted. You can't simply pay to win because your research has to be good enough to be accepted first, although admittedly if you can't pay you definitely can't win!",
          "author": "EmileDorkheim",
          "created": 1606832627,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ge92apa": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge92apa/",
      "text": "I equal ACPs to scams, that simple",
      "author": "the_third_sourcerer",
      "created": 1606824061,
      "upvotes": 1,
      "replies": {}
    },
    "ge94oww": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge94oww/",
      "text": "Didn't Nature just announce something like this? I thought I saw a figure of $9k to make it open access.\n\nEdit:\nhttps://www.sciencemag.org/news/2020/11/9500-nature-journals-will-now-make-your-paper-free-read",
      "author": "bs6",
      "created": 1606826236,
      "upvotes": 1,
      "replies": {}
    },
    "gebvx2p": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/gebvx2p/",
      "text": "Those are scums of the earth. But who else to blame? \n\nThere are many PI who wants to become those scums of the earth journal reviewers.",
      "author": "yourseck",
      "created": 1606877813,
      "upvotes": 1,
      "replies": {}
    },
    "ge8c678": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge8c678/",
      "text": "I dunno... I kinda like the idea of publishing in glam mags... I’m very self-promoting...$$$ makes me happy, so I’ll spew whatever vomitus that ultimately pays the best. Call me unscrupulous, whatever... I left Cornell years ago to write my dissertation under the leading researcher and author in my field, get this - at an online for-profit university (he’s emeritus at two traditional universities, obviously). But my ideas and research are very impactful and I want them to be showcased. Hell, I’d pay $10k for that. Ultimately, it will make me millions on the lecture circuit and in book royalties. Now all of you bucking for tenure track positions - there’s a scam...$30k-$40k per year for 6-10yrs to be used and abused, then finally validated....nah... I’m not in the ‘ethical reputation’ business, I’m in the empire business, kids; some food for thought, something to think about - you’re not noble just bc you stay poor. Make it worth your while ; ))",
      "author": "Studguinea69",
      "created": 1606799255,
      "upvotes": 0,
      "replies": {}
    },
    "ge7t14t": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7t14t/",
      "text": "It's robbery. They can't function without us, yet take advantage of us",
      "author": "Hayw00dUBl0wMe",
      "created": 1606788246,
      "upvotes": 0,
      "replies": {}
    },
    "ge7ghss": {
      "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7ghss/",
      "text": "NEVER pay to publish. \nThere are always other journals to submit to that do not have any fees.",
      "author": "talkdata2me-",
      "created": 1606781617,
      "upvotes": -2,
      "replies": {
        "ge7oild": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7oild/",
          "text": "Yes, but they aren’t always of high quality and perhaps do not command the same respect by one’s colleagues. Some journals charge a lot because they are scams, others charge a lot because they know people will pay because of the attention and respect publishing in them affords.",
          "author": "Mallornthetree",
          "created": 1606785812,
          "upvotes": 7,
          "replies": {}
        },
        "ge7kx4v": {
          "link": "/r/AskAcademia/comments/k46aua/whats_your_opinion_on_journals_that_charge/ge7kx4v/",
          "text": "Research shows that articles that are open access get cited more and number of citations is a major quality indicator for articles.  So those hoping to get a job or those hoping to get tenure/promoted are absolutely going to care about this.",
          "author": "manova",
          "created": 1606784053,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  }
}