{
  "sid": "pgmxdw",
  "link": "/r/AskAcademia/comments/pgmxdw/starting_phd_soon_and_wanting_to_work_in_industry/",
  "title:": "Starting PhD soon and wanting to work in Industry after getting my doctrate.",
  "text": "I officially got into the PhD program last week and will be starting lab from Monday (need to move but I am under the weather for over a week). My supervisor's area of research is molecular oncology and cancer therapeutics. As the title suggests, I am more inclined towards eventually working in Industry. What sort of \"research\" plan should I go for so that I can get a job right after getting my doctorate.",
  "author": "1serendipitous1",
  "created": 1630604938,
  "updated": 1634079425,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hbcdmwz": {
      "link": "/r/AskAcademia/comments/pgmxdw/starting_phd_soon_and_wanting_to_work_in_industry/hbcdmwz/",
      "text": "First thing congrats!! Secondly search for job advertisements you want and work towards those requirements.  Re: research many industry jobs may not have any of these requirements so I know persons who just do the minimum but if you realize it's necessary then you must do enough to make yourself competitive. Hope this helps.",
      "author": "MAE2021JM",
      "created": 1630605312,
      "upvotes": 7,
      "replies": {
        "hbcrtbv": {
          "link": "/r/AskAcademia/comments/pgmxdw/starting_phd_soon_and_wanting_to_work_in_industry/hbcrtbv/",
          "text": "Thank you. Do you have any idea what kind of industry jobs I can expect?",
          "author": "1serendipitous1",
          "created": 1630610980,
          "upvotes": 2,
          "replies": {
            "hbdp5q4": {
              "link": "/r/AskAcademia/comments/pgmxdw/starting_phd_soon_and_wanting_to_work_in_industry/hbdp5q4/",
              "text": "This is where I can't help sorry! I am in the field of instructional tech and though I guide dozens of students on their academic journey but when it comes to specific fields you will have to find advertisements that meet your interests then model your study plan to suit those general requirements. When I started my PhD I did not even know about industry jobs in my field and though I still want an academic job but at least I know what both fields require and I am making myself marketable to fit into either category. Just do a general google search for jobs in \"molecular oncology\" and \"cancer therapeutics\" and after days of searching you will eventually find you interest areas. Hope this helps.",
              "author": "MAE2021JM",
              "created": 1630625529,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hbdvr04": {
      "link": "/r/AskAcademia/comments/pgmxdw/starting_phd_soon_and_wanting_to_work_in_industry/hbdvr04/",
      "text": "Molecular oncology and cancer therapeutics - I'm going to guess you're in a biological sciences type PhD? Strap in for the next 6-to-7 years, because you're in it for the long haul.\n\nI'll echo /u/MAE2021JM's post about looking up job descriptions that contain the phrases \"molecular oncology\" and \"cancer therapeutics\" but I'll tell you right off the bat that you're going to find a lot pharmaceutical companies looking for Scientist-level positions looking to head up candidate screening programs, designing experiments for finding efficacious molecules against 'clinically-significant targets of interest,' and lots of Big Data type number crunching and statistical analyses of genomics/proteomics; maybe even some machine learning since that's the latest buzzword these days.\n\nIf those interest you, great - you'll be doing a lot of those anyway during the course of your PhD, along with all of the other basic wetlab skills. By the time you're done everyone will expect you to have expert-level knowledge of how to effectively design experiments of appropriate statistical power, how to write grants and research proposals of significant impact, how to navigate the complex regulatory environments, and how to lead research activities with a diverse group of people. You'll need to know not just the science, but also the so-called 'soft skills' of working with people and managing them.\n\nThis depends on your supervisor's interests too - they might be more interested in publishing good fundamental scientific research, which is sometimes not necessarily the same thing as working on a clinically or even industry-significant product/process/outcome. If your advisor wants you to study a particular therapeutic molecule that the grad student before you came up with, then you're probably not going to be very happy if you instead want to synthesize your own molecule or come up with some workflow process that is more industry-relevant.\n\nMy advice to you, as an almost-done PhD looking for jobs: focus on your first year classes first, because you're just going to be getting your feet wet with the institution, your coursework, and your lab. Forget trying to think about tailoring a research plan to some nebulous job opportunity, and instead have a little fun, do some solid research, publish a few papers, NETWORK NETWORK NETWORK and only when you're in your last 2 years start to think about jobs. \n\nFor biological science PhDs, it's a tough market out there - lots of people can hold a pipette and design a solid experimental plan, so what's going to separate you from the rest? It'll be less about **what** you know and more about **who** you know, so when you're not doing your research, focus on cultivating relationships, contacts, and people in your network. Just my two cents - congrats on getting into a PhD program and good luck!",
      "author": "opalicfire",
      "created": 1630628672,
      "upvotes": 3,
      "replies": {
        "hbdyf9z": {
          "link": "/r/AskAcademia/comments/pgmxdw/starting_phd_soon_and_wanting_to_work_in_industry/hbdyf9z/",
          "text": "Great advice!!! Just an addition networking is very important but tends to get overlooked especially when you're overwhelmed with other minor tasks so enjoy the ride while never forgetting the prize at the end. It'll be a challenging journey, welcome.",
          "author": "MAE2021JM",
          "created": 1630629926,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}