{
  "sid": "p35b5y",
  "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/",
  "title:": "I'm a miserable and inadequate PhD student, should I drop out?",
  "text": "So, I'm at the end of my second year in a nationally-ranked Microbiology program (USA). I got a conditional pass on my qual last month, and my revisions are due in a couple days and I really have doubts about whether they will be accepted by my committee. I'm going to put in my best effort for this revision, but even if I pass, I still think I need to leave..Here's why:\n\nI've always been kind of behind the curve when it comes to academics, but since I managed to get as far as a PhD program I kind of assumed it was just imposter syndrome. Fast forward to now, and I've barely made any progress on my projects despite a very supportive, hands-on advisor. I consistently make careless mistakes, forget to record experimental notes, etc. and I am in general just not a good researcher. My advisor has had several, very nice, but still \"scary\" talks with me about this, and I always say I'll improve, and genuinely try to for a few weeks, but it doesn't seem to stick. I've seen a few psychs, tried taking antidepressants, ADHD meds (all prescribed) and in the end none of it helps. I dread going to lab, reading papers, coming up with research ideas, all of it. Basically, I think that I just don't love scientific research enough to discipline myself to be good at it.\n\nI worked for two years in industry before starting my PhD and those were the happiest, most carefree years of my life, despite not making a ton of money. I got really good at the few experiments my job entailed, and looking back, I could have definitely climbed the ranks to achieve a comfier salary. I just thought I had to get a PhD because that's \"what everyone does\".\n\nLooking forward, I think I'd be much happier back at a 9-5, making enough money to save a little each month and invest, getting official paid vacation, etc. My program is kind of stingy about mastering out, so I doubt I'd be able to leave with a masters, but I still feel so much relief when I think about quitting.\n\nTl;DR: Has anyone quit a PhD and not regretted it? How did you go about finding a job, and when did you tell your supervisor and your peers? The biggest things I'm worried about are 1) hurting/disappointing my supervisor and feeling like I utterly wasted her time and funding 2) being judged by my peers 3) not being able to find a job without listing my supervisor as a reference. 4) regretting the decision several years from now.\n\nTY in advance!!",
  "author": "DragonfruitBetter177",
  "created": 1628791471,
  "updated": 1634079711,
  "over_18": false,
  "upvotes": 135,
  "upvote_ratio": 0.94,
  "comments": {
    "h8oqmie": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8oqmie/",
      "text": "You said you were in industry for a couple of years before and were happy doing that, which is great because it means you have some experience and can jump back in. You haven't failed and don't need a PhD to be successful in life.",
      "author": "Toocheeba",
      "created": 1628793734,
      "upvotes": 136,
      "replies": {}
    },
    "h8onlti": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8onlti/",
      "text": "I tell you the harsh thing I tell everyone; you do not owe your supervisor anything. This is a job and changes like people quitting because they are unhappy is part of the deal. Believe me if the positions would be reversed and your supervisor would think about firing you he likely would not think twice either. The Pi will soon find someone else the world is full of candidates.The point is academia is not for everyone for all the different reasons. You do not have to burn may bridges explain your PI what is going on , if he is just a quarter a good PI he will understand and you can still list him as reference. Also no one should care\nAbout what others think. If not you do not you have already worked in industry having them as reference is much more valuable if you try to go back to industry. Finally do not think about things that might or might not happen in the future. Now is important and if you are unhappy can make that change do that. Good luck",
      "author": "CreepyBumblebee31",
      "created": 1628792370,
      "upvotes": 47,
      "replies": {
        "h8q9e99": {
          "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8q9e99/",
          "text": "Just a friendly reminder the PI in OPs statement is female...",
          "author": "ke_marshall",
          "created": 1628817543,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "h8p62t4": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8p62t4/",
      "text": "Talk to your committee about leaving with a master's- you might need to do something extra/stick around for the rest of the academic year but it's worthy trying.",
      "author": "RoyalEagle0408",
      "created": 1628800185,
      "upvotes": 39,
      "replies": {
        "h8pjero": {
          "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8pjero/",
          "text": "Came here to say this. It sounds like you've already made your decision, but having a masters will set you up for better and higher paying job opportunities in industry.",
          "author": "rf439",
          "created": 1628805569,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "h8p47gq": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8p47gq/",
      "text": "If you’ve discovered you’re happier in industry and don’t like the work style of academic research, LEAVE. This is such an important thing to have discovered about yourself. Why waste another minute (much less another few years) being miserable? You can move up in industry in the meantime, making a better salary doing something you find contentment in.\n\nDo everything in your power to leave with a Master’s, though. Your advisor sounds supportive, so talk to them about this. If you haven’t written a thesis, see if you can switch to a thesis track to get a Master’s. If you’re already at the point where you’re about to pass quals, there’s absolutely no reason you shouldn’t get a masters.",
      "author": "ConsciousReindeer265",
      "created": 1628799460,
      "upvotes": 30,
      "replies": {}
    },
    "h8pbts9": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8pbts9/",
      "text": "I haven't dropped out, so can't give advice on that.  But let me tell you, if you're unhappy with all of that right now, it doesn't get better, and the longer you go on the more you'll wish you had quit earlier.  The more work you do, the more you'll feel like you deserve the degree, which will make it harder and harder to leave with nothing.  There are some people who enjoy the degree once they find a good project, and some direction, but from what you're writing, it doesn't seem like you'll be one of them.  \n\n&#x200B;\n\nI think you should ask yourself whether you can see yourself ever enjoying the research.  If the answer is no, you should run from a phd as soon as possible, because you will hate it even more four years from now.  \n\n&#x200B;\n\nThere's no shame in quitting, and as others have said, you don't owe your advisor/school/department anything really.  At the end of the day, you owe it to yourself to do what's right for your well-being, irrespective of how your peers feel.",
      "author": "nctweg",
      "created": 1628802461,
      "upvotes": 11,
      "replies": {}
    },
    "h8pa3fk": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8pa3fk/",
      "text": "As a former PhD dropout; it does not define you and continuing when it just isn't right or something you can't just slog out can be a huge mistake.\n\nI do not regret deciding to give it up; I do regret not jumping (hindsight small) hoops for the MPhil my work thus far would have earned me (but felt too much at the time as I stepped straight into full time employment). So the other response about discussing for a Masters conversion definitely has merit.\n\nI would have been the fourth of my siblings to earn a PhD - truth be told none of us have had any notable edge with the qualification that several years of industry experience garners anyway.\n\nHappy to discuss in private if you need a non-judgemental stranger to bounce ideas off of.",
      "author": "AnonymousFairy",
      "created": 1628801771,
      "upvotes": 9,
      "replies": {}
    },
    "h8p5gce": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8p5gce/",
      "text": "From reading your post, I don't get that you are a miserable and inadequate PhD student. You are not a miserable student in the sense of poor performance if that's what you were implying. However you do sound miserable because you are unhappy with what you are doing. That's different and isnt something you can change. \n\nWhat I see is an excellent scientist that finds academic research boring which left them unmotivated and as a result, made it hard to focus which left them prone to minor mistakes. That doesnt make you a bad researcher at all, please don't be so harsh on yourself. As you said, you were performing well at your previous job, which had a research component to it. You are a good scientist who doesnt like academic research that's all. That just makes you a human who tried something and realized they dont like it and dont want to do it. \n\nFor your questions;\n\n1.Talk to your supervisor about considering dropping out before making any decision. They might be way more supportive than you think and offer guidance that might help you make a clear choice. \n\nIf they are truly a mentor figure and a good supervisor, they will want the best for you and support you no matter what. Yes they can be disappointed and sad to see you go, but they should still be supportive of your decision if they care about what's best for you. Imagine a close friend having to move countries for a once in a lifetime job opportunity. You are sad to see them go, but still happy for them and supportive. Should be the same thing here. \n\nIf they get mad that you are considering dropping out, then that just means they arent good mentors and there was never any real professional relationship there. So who cares how they feel? \n\nIn general you shouldnt care either, because to your supervisor that will see many students in their life, you  are just one of them. Supervisors leave their students all the time without a second thought for a better position elsewhere. So don't take any decision based on how you think any supervisor in your life will feel. \n\n2.Who cares what they think? People will always judge. Although I am not sure what there is to judge here. You seem to think it's super popular to do a PhD, it's not. As my old supervisor used to say \"It's one thing to start a PhD but it's another to finish it. Fewer students are able to achieve that. \" It's really common for people to drop out of a PhD. There's no shame about it. You wouldnt be some sort of outcast if that's what you are worried about. Think about it; a Phd is a lot of time and a lot of sacrifices. Things change within 5-7years, people's situation change, people's interest changes, etc. How could we except from anyone to commit to something has hard has a PhD for 5-7 years without leaving any room for change? Don't worry about it. \n\nIf the other people in your program judge you, it just means they werent your friend because if they were, they would be supportive no matter what. So who cares what mean people think?\n\n3.You really need to talk about your decision with your supervisor for this reason as well. I will be honest with you, leaving will create an employment gap in your resume which is hard to overcome. However it really depends how much of a gap we are talking about here. Since you have previous work experience, you should be able to overcome a 1-2 year employment gap, although it's not necessarily going to be easy. If we are talking about 2+ years, then I think you need to consider how you can show in your resume that you were doing some research during that time without disclosing you dropped out.  \nDepending on how your supervisor react to your decision, I recommend asking them if you could list your position as a Research assistantship instead of a PhD studentship in your resume and asking if they would be ok to provide you with a reference letter refering to you as a RA instead. That should be easy to get them to agree to if they plan on passing on your work to a new PhD student. \n\n4.Who knows if you will regret it or not. But to me you sound very unhappy! So not sure what there is to regret about not spending 5-7 years being unhappy but who knows! Yes money could be less, but as you said it yourself, you are pretty sure you could have worked your way up without a PhD! Do what your heart tells you and you wont regret it",
      "author": "methomz",
      "created": 1628799942,
      "upvotes": 12,
      "replies": {}
    },
    "h8qukw0": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8qukw0/",
      "text": "It's great you have some clarity on what path you'd like to pursue moving forward. Three things:\n\n**1)** While it's nice that you appreciate your advisor's efforts to mentor you, let me be clear: **as faculty, we wish you well, but we do not care if you leave.** Why we would we? You're an adult, not a child. (And even if you were a child, you're not our child.) We want you to pursue whatever path feels right for you. **Your arrival or departure from a grad program has ZERO impact on our personal and professional lives.** It doesn't matter how kind or warm or generous we are as advisors--we have no feelings about how you live your life. (The only exceptions are narcissists who have inappropriate boundaries and get angry because they see you as extension of them.)\n\nAnxiety tells us many false stories. One falsehood is that people are judging you. But the truth is *other people aren't thinking about you.* That might sound harsh, but it's actually liberating. You're doing the same thing even in this post--you're worried about professors' opinions about *YOU*, not about how they're feeling/doing in general.\n\n**2)** **Academia isn't special.** Like any sector, there are pros and cons. Leaving a PhD program is the same as leaving any job. Would you have all this anxiety if you were moving to another company or position? This is the same. Let go of whatever romantic ideals people commonly attach to academia (which mostly exist to convince people to work as underpaid adjuncts without health insurance).\n\n**3)** Beware of common cognitive distortions like black and white thinking or catastrophizing. One example is at the end of your post: in what world would someone feel regret for leaving a job they actively dislike (and don't excel in and don't feel motivated to excel in) to return to a career they already know they enjoy? Your anxiety is lying to you. Recognize the lies and make the decisions that are best for you with the information you have now. Good luck.",
      "author": "synthesis-synthesis",
      "created": 1628828271,
      "upvotes": 5,
      "replies": {}
    },
    "h8q6owm": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8q6owm/",
      "text": "Almost every PhD student goes through a time when the feel hopeless, useless and inadequate. That they've not done enough \"research\" or made enough progress and that they are basically wasting everyone's time including their own. Almost every PhD student goes though this time somewhere between 2nd and 3rd year. So much so that books refer to it as the \"2nd year blues\". Something to consider, are your feelings normal \"second year blues\", or are they bigger and more important than that?",
      "author": "ischickenafruit",
      "created": 1628816286,
      "upvotes": 3,
      "replies": {}
    },
    "h8pclws": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8pclws/",
      "text": "I agree that you should talk to the supervisor and see if you can actually get the Masters.  It seems fair given how much work youve already put in.   Go back to the career that made you happy.",
      "author": "lrk786",
      "created": 1628802777,
      "upvotes": 2,
      "replies": {}
    },
    "h8prf6z": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8prf6z/",
      "text": "I know exactly what your describing where you didn’t really consider what you were doing and it was just “the logical next step” but you just need to decide if this is what you really want. We on Reddit won’t tell you what is the correct thing to do. I don’t know if you want us to tell you to stick it out, or if you want us to tell you to get lost, what are you hoping to hear? Maybe that will help you decide what is right.",
      "author": "Ron_Day_Voo",
      "created": 1628809272,
      "upvotes": 2,
      "replies": {}
    },
    "h8pspjq": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8pspjq/",
      "text": "Probably. I'm not in stem but I have a friend who was in a similar situation to you in a similar field and the top program for her field. Her advisor was insane and ran people out of the lab. She mastered out. She never looked back and is way happier",
      "author": "yourmomdotbiz",
      "created": 1628809912,
      "upvotes": 2,
      "replies": {}
    },
    "h8qqpa6": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8qqpa6/",
      "text": "Others covered what I would, so I just wanted to highlight this, make sure if you leave because you are not good at research, that you are not actually good at research.  In my cohort we had a student who was brilliant at dissecting theory and finding ways to experimentally test ideas.  He was a strong writer and a great lecturer.  But he convinced himself that he bad at research to the point where when it came to his assignments for grades, he always choked.  He literally could write a book chapter or journal article, but when it came to comps then his dissertation he choked.  In the end he dropped out convinced he was just not good enough to be in research.  He is now teaching with his masters and basically leading a program of research in the program he is associated with.  \n\nSo yeah, if you leave because you are not good at research, talk with your supervisor and make damn sure you are actually not good at research and are not just giving into imposter syndrome.\n\nThat said, I think you could leave now without regrets.  You seem to have found what you wanted to do in industry, so it would make sense that maybe you should just return to industry if your pay and what not is good enough there that you can be happy having it as your long term career.",
      "author": "engelthefallen",
      "created": 1628826083,
      "upvotes": 2,
      "replies": {}
    },
    "h8s3wme": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8s3wme/",
      "text": "I haven't dropped out from a PhD program but honestly reading your post really got me upset. No person should feel anxiety and really bad because of dropping out from a PhD. Life is really too short and it's not worth it. You tried out getting a regular job and said it was the happiest time in your career. My advice, with all respect to others' opinions, is to pursue that which makes you happy. If you are happy, your output will be better and you will be able to climb the ladder, and sooner or later you will have the equivalent job/career your \"peers\" are aspiring to have. It's your decision and being afraid of hurting people's feelings is honorable and nice but it cannot be the sole thing to take into account. Hope this helped. Best of luck in your decision-making!",
      "author": "Unfair-Dependent2887",
      "created": 1628860593,
      "upvotes": 2,
      "replies": {}
    },
    "h8p1b4n": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8p1b4n/",
      "text": "Do you know what they call the dumbest student to complete a PhD?\n..Doctor… Professor… Mentor, \nYou didn’t get this far to only come THIS far man, get your shit together.. you got this in the bag!(:",
      "author": "learnme_somethin",
      "created": 1628798333,
      "upvotes": -10,
      "replies": {}
    },
    "h8q5w9y": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8q5w9y/",
      "text": "Get your Master’s and go back to what made you happy! Life is too short to waste on things that do anything but!\n\nAlso, realize that the time you dedicated to your work, even if you're unable to secure your Master’s, was well-spent, as it was a crucial turning point in your career that allowed you to discover where your passion and skills lie!",
      "author": "KindredKate",
      "created": 1628815924,
      "upvotes": 1,
      "replies": {}
    },
    "h8qa9eo": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8qa9eo/",
      "text": "It's your life, not your peers or your advisors. You'll waste more of your advisor's time sticking around and not actually getting experiments done than quitting and letting her hire someone who will. Any peers that judge you for making a choice like this suck and you should find more supportive people. \n\nThe big thing to decide is whether you'll regret it or not. Is another 3 years feeling like you do now worth whatever amount of wishing you had a PhD later? Guessing not but that's up to you.",
      "author": "mediocre-spice",
      "created": 1628817951,
      "upvotes": 1,
      "replies": {}
    },
    "h8qkzj0": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8qkzj0/",
      "text": "If you’re thinking it this seriously, I think you already know what you want and what’s best for you. Best of luck in whatever comes next!",
      "author": "taako__tuesday",
      "created": 1628823134,
      "upvotes": 1,
      "replies": {}
    },
    "h8qsnyd": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8qsnyd/",
      "text": "From what you have shared, I definitely think you are one of those that are more suitable for industry than academia, which btw is just a matter of choice. One question/ suggestion- Have you tried to communicate your problem/challenge with your supervisor and especially the med that you have tried to take and none of them works- that may help your supervisor to understand your decision and hopefully that can help you to get a master out of it, but regardless, I would say you need to move on- sometimes it’s just sunk cost- it may be eventually better off to figure out that academia is not your thing instead of spending another 5-10 years and then only realize the same thing by then.",
      "author": "justinfu123",
      "created": 1628827173,
      "upvotes": 1,
      "replies": {}
    },
    "h8r1zgg": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8r1zgg/",
      "text": "Don’t quit. You’re so close! It’s like tapping out of a marathon after running 24 miles! You only have two miles left, power through!! After you’re done, you’ll always have it, and you’ll never regret finishing. But if your heart’s not in it at that point, do whatever the hell you want to do, you have a PhD for God’s sake! Finish strong!!",
      "author": "83CrapBag",
      "created": 1628832938,
      "upvotes": 1,
      "replies": {}
    },
    "h8rhfkh": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8rhfkh/",
      "text": "I worked with someone who mastered out of an Ivy League microbiology PhD program. She is now a Senior Scientist (at a faster pace than is expected for her age). She is wicked smart and has applied her love of learning to her projects. This resulted in substantial gains for the pharma companies she worked with.\n\nNever stop learning or innovating and you'll be set irregardless of your PhD status. I think the PhD only matters if you want a C-suite title and even then that may not matter if you can negotiate properly. \n\nFollow your passion. It sounds like your body and your brain are indirectly telling you that they've had enough of your PhD program.",
      "author": "ashchelle",
      "created": 1628845151,
      "upvotes": 1,
      "replies": {}
    },
    "h8z67rs": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8z67rs/",
      "text": "No harm in dropping out. Most people I know that have dropped out say they are very happy with their decision 2-3 years down the line and are now in a much better mental space. If you chose a PhD because that's the default thing, rather than a specific passion, then why would you regret it?  \n\n\nHaving said that, it's disheartening to hear about people with ADHD feeling inadequate. I hope we can build environments and systems that are more supportive of researchers who have ADHD, because many of them are excellent scientists as long as they have the tools to deal with their ADHD.",
      "author": "Ok-Mall747",
      "created": 1628988813,
      "upvotes": 1,
      "replies": {}
    },
    "h90x1io": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h90x1io/",
      "text": ">Basically, I think that I just don't love scientific research enough to discipline myself to be good at it.\n\nI don't know much about PhDs (I'm in undergrad) but I do know about ADHD (I'm struggling with it myself). The whole \"I'm just not disciplined enough\" thing is a huge red flag for nagative ADHD related self talk for me. Maybe you could try to get an ADHD coach or therapist who can help you manage your mental health better so you can do your tasks better? Maybe all it takes is structuring your work differently or putting some safeguards in place to see a big difference. Meds help (haven't found any that work for me but from other people's experience) but they don't make your symptoms go away completely.\n\nHope you find whatever makes you happy and healthy but I just wanted to chime in from an ADHD perspective and tell you that you're not lazy or bad at your job, it sounds like you're struggling with ADHD and haven't got accommodations/ management strategies to help yet :)",
      "author": "melonrinds_infridge",
      "created": 1629031643,
      "upvotes": 1,
      "replies": {}
    },
    "h8pqugs": {
      "link": "/r/AskAcademia/comments/p35b5y/im_a_miserable_and_inadequate_phd_student_should/h8pqugs/",
      "text": "You should keep trying. I would give my left but to be able to do what you do. You will find what you need.",
      "author": "uglybutatleastimbrok",
      "created": 1628808985,
      "upvotes": 0,
      "replies": {}
    }
  }
}