{
  "sid": "qiyca7",
  "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/",
  "title:": "Does anyone else go through regular rough patches?",
  "text": "I've been slowly declining the last few weeks but the last few days have been especially hard for me. \n\nIt happens every few months were I'll feel great and then suddenly start to decline until I barely have the motivation to turn out the bare minimum.\n\nIs this depression?",
  "author": "Weekend_metalhead",
  "created": 1635587925,
  "updated": 1635779277,
  "over_18": false,
  "upvotes": 95,
  "upvote_ratio": 0.94,
  "comments": {
    "himm6of": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/himm6of/",
      "text": "I don't know about depression, but I have experienced myself and observed many others who struggle with motivation once you reach a goal and come out on the other side. We jump through hoops and after each hoop, I think it is quite common to be slightly at a loss on the other side. \n\nPsychologically, I guess this has a lot to do with how extrinsically we allow ourselves to be motivated when we work hard. You got accepted to a PhD program, check. You got your PhD, check. You got a TT, check. You got tenured and promoted, check. After each step, we may ask ourselves, \"what was the point?\", and \"in relation to the work, time, and hardship it took, was it worth it? How are things really better now?\"\n\nIt may be easier said than done, but if we let ourselves stay motivated by the things we enjoy more than \"hoops\", we can stay afloat much longer.",
      "author": "molobodd",
      "created": 1635589866,
      "upvotes": 44,
      "replies": {}
    },
    "hin5hm0": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hin5hm0/",
      "text": "I got them really often when I was in academia, but have found the social and company support in both mental health awareness and care much improved once I moved to industry.\n\nSupport in academia I found was just a bag of shit. You're largely on your own, and for a large part of your career you're a employee yet are treated as some kind of student+1.\n\nIt's been a tough couple of years since covid hit. From what little context you shared, sounds like you might be a little depressed. Don't be alarmed, it happens to us all. Seek help, and fall back on friends. Good luck!",
      "author": "pint_of_brew",
      "created": 1635601902,
      "upvotes": 7,
      "replies": {}
    },
    "hio12c8": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hio12c8/",
      "text": "I'd say my life is a rough patch with the occasional okay moment.",
      "author": "thegreenaquarium",
      "created": 1635615686,
      "upvotes": 6,
      "replies": {}
    },
    "hingc7t": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hingc7t/",
      "text": "I think it's pretty normal, ebbs and flows of not just academic life but life in general.  It probably does have to do somewhat with season, diet, etc., as others have suggested, maybe even hormones, burn-out, morale due to things going on, etc. But I don't think anyone feels like they are performing at peak levels all the time. Rather it's a series of peaks and valleys. I wouldn't say it's depression until you aren't even eking out the bare minimum and don't even care. I find when I get to the point where you are now I usually course- correct.  Might help to change up your routine a bit or get involved in a professional or personal project that gives you inspiration. Think of things that have energized you in the past, and pursue one of those again.",
      "author": "SilencedinAcademia",
      "created": 1635606983,
      "upvotes": 4,
      "replies": {}
    },
    "himut9w": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/himut9w/",
      "text": "> Is this depression?\n\nThat is a question for a mental health professional, not strangers on the internet.",
      "author": "Honestaltly",
      "created": 1635596044,
      "upvotes": 28,
      "replies": {}
    },
    "hin12g6": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hin12g6/",
      "text": "Could be a lot of things: \n\n* nutrition - how does your diet vary?\n* exposure to  sunlight\n* various biological cycles\n* neurological or social cycles\n\nAnd/or some form of depression. None of these are exclusive either; it could be two or more at any given time.\n\nAlso not something strangers on the Internet are going to be able to diagnose accurately.",
      "author": "iugameprof",
      "created": 1635599642,
      "upvotes": 13,
      "replies": {
        "hinfilx": {
          "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hinfilx/",
          "text": "I want to highlight this comment because if you're in the northern hemisphere, the days are getting very short. In my city it has also been raining a ton. I have been experiencing seasonal affective disorder like nobody's business. I never have it this bad this time of year. \n\nBut as others are saying, you need a professional to give you an accurate diagnosis. This is critical because your symptoms could be caused by major depressive disorder OR something else entirely that needs different treatment. Seasonal affective disorder, bipolar disorder, sleep disorders, vitamin deficiencies, etc for example. They know the questions to ask you to figure out what is going on.",
          "author": "genius-swan",
          "created": 1635606608,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hinhhk5": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hinhhk5/",
      "text": "I think it happens to most people. But I realized it happened to me less when I pace myself when I'm feeling motivated. As we sometimes forget to get enough rest and eat properly when I feel energized/motivated to get things done and that always comes back to affect me a short while after. It could also be a sign of depression or some sort of hormonal imbalances so I wouldn't rule that out completely.",
      "author": "Fluffy_Substance8161",
      "created": 1635607494,
      "upvotes": 3,
      "replies": {}
    },
    "hinw2x4": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hinw2x4/",
      "text": "It is normal, and your reaction/worry is normal. Nothing ever stays the same. Find something special to look forward to seeing.",
      "author": "Humanimal37",
      "created": 1635613635,
      "upvotes": 3,
      "replies": {}
    },
    "hinye0s": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hinye0s/",
      "text": "I have this same issue I call it burn out. I usually manage my time to avoid working too hard and burning myself out. However, sometimes the work piles up and you have no choice but to burn yourself out. It could also be the change in seasons like SAD or there’s a million and one reasons you could be feeling down. Your best might look different every day, that’s okay.",
      "author": "monkeyrollmonkeyroll",
      "created": 1635614580,
      "upvotes": 2,
      "replies": {}
    },
    "hio1zgr": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hio1zgr/",
      "text": "I’ve heard SAD lamps can help with this.",
      "author": "johnnydaggers",
      "created": 1635616072,
      "upvotes": 2,
      "replies": {}
    },
    "hio67md": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hio67md/",
      "text": "Sounds like regularly occurring burnout. Are you taking enough breaks, weekends, and vacations?",
      "author": "Turbulent_Cranberry6",
      "created": 1635617851,
      "upvotes": 2,
      "replies": {}
    },
    "hiomi15": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hiomi15/",
      "text": "Everybody does. It’s part of being human.\n\nJust watch rocky balboa: it’s not about how hard you get hit, it’s about how hard you get hit and keep going. \n\nJust keep going",
      "author": "drche35",
      "created": 1635624802,
      "upvotes": 2,
      "replies": {}
    },
    "hion39d": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hion39d/",
      "text": "yeah, but not an academia thing, I have mental illness. \n\nI typically tend to frontload my effort so that people get good first impressions of me and my early work is a good foundation for me, then when rough patches come I've built in padding interpersonally and work capacity-wise that protects me from serious professional consequences of mood cycling",
      "author": "isaac-get-the-golem",
      "created": 1635625069,
      "upvotes": 2,
      "replies": {}
    },
    "himmegc": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/himmegc/",
      "text": "May well be, or it could be Bipolar II, too. Please seek help. Knowing what you are facing will help you manage this. Good luck! Our occupation is great for many, many reasons, which we appreciate, but also has unique stresses and challenges. Someone who understands academia would be best.",
      "author": "mmilthomasn",
      "created": 1635590030,
      "upvotes": 0,
      "replies": {}
    },
    "hiofi4g": {
      "link": "/r/AskAcademia/comments/qiyca7/does_anyone_else_go_through_regular_rough_patches/hiofi4g/",
      "text": "I don’t know about depression. You should contact a mental health professional. However, right now, I am exhausted to the point that I have to pull myself to do things. \n\nThe last months have been rough on all of us. \n\nAlso, pre-pandemics I went through the periods you describe. Lots on energy in projects followed by bleh times. I am tenured, so I don’t have the pressure to perform at the same level I did before, especially at a teaching oriented institution. \n\nGo see a mental health person. Even if you are not depressed, they will give you strategies to cope and move forward during these low times.",
      "author": "9alby9",
      "created": 1635621737,
      "upvotes": 1,
      "replies": {}
    }
  }
}