{
  "sid": "orzyo4",
  "link": "/r/AskAcademia/comments/orzyo4/is_graduate_school_hard_whats_the_social_life_like/",
  "title:": "Is graduate school hard? What’s the social life like?",
  "text": "Hi so I have just finished my undergrad degree and am going to get my masters in public health: health administration and health policy. I have a few friends from my undergraduate degree that have full time jobs in the area where I am getting my masters. All of my classes are in the evenings and I have no classes on Monday and Fridays. In my undergraduate degree, I was very good about getting my work done on time and even earlier. I am wondering how hard is graduate school compared to undergraduate? And will I have time for a social life? I am very nervous. Any advice would be appreciated!",
  "author": "beachgirl125566",
  "created": 1627310128,
  "updated": 1634082429,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "h6ldj09": {
      "link": "/r/AskAcademia/comments/orzyo4/is_graduate_school_hard_whats_the_social_life_like/h6ldj09/",
      "text": "It's both harder and easier.\n\nHarder because the expectations are greater. The material is more advanced, the professors expect you to think for yourself more, the grading is more rigorous, the requirements are more stringent, the assignments are more complex and in-depth, etc.\n\nEasier because you are older, wiser, better prepared, more knowledgeable, more focused, more committed, less distracted, and for the most part you only have to take the classes that you care about, instead of the broad range of classes required for an undergrad degree.\n\nYou will have time for a social life, but (just like people who get a job at that age) you will find that you are a little busier and more focused, and will probably do a little less socializing than you did when you were an undergrad.",
      "author": "bigrottentuna",
      "created": 1627311886,
      "upvotes": 8,
      "replies": {
        "h6llodt": {
          "link": "/r/AskAcademia/comments/orzyo4/is_graduate_school_hard_whats_the_social_life_like/h6llodt/",
          "text": "Thanks! Yea all my classes are in the evenings and I have no classes on Fridays or Mondays which is nice. I’ve talked to a lot of other people and they say that it’s harder for more workload and it’s not really memorization like in undergrad grad but thinking for yourself",
          "author": "beachgirl125566",
          "created": 1627315482,
          "upvotes": 1,
          "replies": {
            "h6lo7oh": {
              "link": "/r/AskAcademia/comments/orzyo4/is_graduate_school_hard_whats_the_social_life_like/h6lo7oh/",
              "text": "That's absolutely true, BUT if you are into it--and you must be or you wouldn't be going to grad school--that kind of work is more engaging, so even though it is technically more challenging, it isn't necessarily going to be more difficult for you to do it. It may require more focused effort, but again, it shouldn't necessarily be harder for you.",
              "author": "bigrottentuna",
              "created": 1627316600,
              "upvotes": 1,
              "replies": {
                "h6lpplu": {
                  "link": "/r/AskAcademia/comments/orzyo4/is_graduate_school_hard_whats_the_social_life_like/h6lpplu/",
                  "text": "I am interested in public health in the health administration and health wellness aspect. For the electives part which I get in later, I’d want to take some classes that are geared towards health and wellness. My career goal is to be a program coordinator or wellness coordinator for a health organization",
                  "author": "beachgirl125566",
                  "created": 1627317253,
                  "upvotes": 1,
                  "replies": {
                    "h6lrjo3": {
                      "link": "/r/AskAcademia/comments/orzyo4/is_graduate_school_hard_whats_the_social_life_like/h6lrjo3/",
                      "text": "I think you are going to enjoy it. I liked it a lot more than undergrad, both because the classes were all on topics I cared about and the assignments more interesting,  and because I was older and more functional by that point in my life.",
                      "author": "bigrottentuna",
                      "created": 1627318048,
                      "upvotes": 1,
                      "replies": {
                        "h6lydj7": {
                          "link": "/r/AskAcademia/comments/orzyo4/is_graduate_school_hard_whats_the_social_life_like/h6lydj7/",
                          "text": "Yea that’s what I hear from a lot of people. I also do have a strong work ethic and manage my time well",
                          "author": "beachgirl125566",
                          "created": 1627320982,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}