{
  "sid": "q4tw05",
  "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/",
  "title:": "co-author title",
  "text": "I’m a lead author working on a paper on the autistic population in society. 1700 of the 13000 words was written by an acquaintance of mine which included their own original analysis and ideas. The rest is purely my work. They think their contribution is not enough for the co-author title whereas I think contributing original intellectual content is enough for the title regardless of significance. Thoughts?",
  "author": "Dangerous_Tip6190",
  "created": 1633813065,
  "updated": 1634078397,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hg0xkha": {
      "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg0xkha/",
      "text": "It doesn't matter how much one wrote for the paper - you may not write a single word, but still be a co-author if your contribution (to the concept, data collection, processing and analysis) is significant enough for the discussed research.",
      "author": "k8ua",
      "created": 1633813289,
      "upvotes": 20,
      "replies": {}
    },
    "hg120f0": {
      "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg120f0/",
      "text": "This depends a lot on the discipline, but in mine they would absolutely be listed as a co-author, but they do have the right to refuse co-authorship (in which case you should put them in the acknowledgments, if they are willing).",
      "author": "BananasonThebrain",
      "created": 1633815247,
      "upvotes": 9,
      "replies": {}
    },
    "hg10afj": {
      "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg10afj/",
      "text": "Yes, they should be listed as a co-author. One, their intellectual contribution is key, and as a general rule of thumb, someone making a significant intellectual contribution to an article should be listed as an author. I also think that writing over 10% of the manuscript merits authorship in and of itself. I would go so far to say as publishing this without listing them as a co-author would be academic dishonesty.\n\nIf they are open to being listed as a co-author and just don't think they did enough, then go forward with listing them. If they absolutely insist that you do not list them as a co-author (which would be odd), get their refusal to be a co-author in writing, consider removing as much of their portion as makes sense, and thank them for their contributions in the acknowledgments section.",
      "author": "jogam",
      "created": 1633814471,
      "upvotes": 5,
      "replies": {
        "hg3bo1q": {
          "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg3bo1q/",
          "text": "Yeah they’re insisting that I do not add them to the authors list because they just confessed they want all of their publications to be solo and 100% theirs. Don’t know how that’s gonna work but I’ll just add them to the acknowledgements section then.",
          "author": "Dangerous_Tip6190",
          "created": 1633864894,
          "upvotes": 1,
          "replies": {
            "hg54xw8": {
              "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg54xw8/",
              "text": "As Jogam said. Get written proof of where  he actively states that he declines the co-authorship. Might safe you some trouble in the future.",
              "author": "PhageBiome",
              "created": 1633895802,
              "upvotes": 3,
              "replies": {}
            },
            "hg5y9t9": {
              "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg5y9t9/",
              "text": "That is an... interesting thing to want. There are certainly fields where single author papers are very good (economics and public policy comes to mind), I fail to understand how it could be a disadvantage to them.\n\nThat said, I agree with getting their non-authorship request in writing and adding them to the acknowledgement section.",
              "author": "a-perpetual-novice",
              "created": 1633908428,
              "upvotes": 3,
              "replies": {
                "hg7ijab": {
                  "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg7ijab/",
                  "text": "Absolutely. Not to judge my colleague or anything but do you know if this is a common request in academia? I’ve certainly never seen something like this before…",
                  "author": "Dangerous_Tip6190",
                  "created": 1633942383,
                  "upvotes": 1,
                  "replies": {
                    "hg7lzr7": {
                      "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg7lzr7/",
                      "text": "Not for this reason. It is indeed quite an odd request.\n\nI have seen two folks decline their authorship because they didn't agree with the content of the paper and didn't want to be associated, but never in the case where they wrote a section of the paper.",
                      "author": "a-perpetual-novice",
                      "created": 1633945564,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hg8f6bc": {
              "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg8f6bc/",
              "text": "You need to take their work out of the paper then. If they aren't willing to take responsibility for their contribution to the paper then the work shouldn't be in there. \n\nIf this work turns out to be plagiarised, or have some other issue with it, you're going to be left holding the can as an author. Being an author isn't just glory it's also being accountable for the work you contribute to a paper. \n\nIf this person doesn't want to share glory and isn't collaborative just let them get on with it. These people are inevitably very difficult to work with and you're likely to get screwed over. They've made their position clear that they don't want to work properly with you, take them at their word.",
              "author": "ACatGod",
              "created": 1633963514,
              "upvotes": 2,
              "replies": {
                "hg8k3yt": {
                  "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg8k3yt/",
                  "text": "Good call, thank you.",
                  "author": "Dangerous_Tip6190",
                  "created": 1633965662,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hg1h9a8": {
      "link": "/r/AskAcademia/comments/q4tw05/coauthor_title/hg1h9a8/",
      "text": "I’ve read journal guidelines stating that anyone who wrote any part of the manuscript deserves credit.  I tend to agree, especially if the number of authors is in the single digits.",
      "author": "Doctor_Yev",
      "created": 1633822489,
      "upvotes": 2,
      "replies": {}
    }
  }
}