{
  "sid": "pcjosb",
  "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/",
  "title:": "Should I take a \"B\" level recommendation letter from a (European) \"famous\" professor?",
  "text": "Hi,\n\nI went to a study-abroad exchange program in Europe two years ago and took a course with a famous professor and got B in his course (it was the second semester after changing my major to math). I really like his research fields and intend to do that in graduate school as well. This year, said program offered online courses and I participated in his \"research course.\" In the research project, I was mainly responsible for organizing and managing the manuscript on Overleaf, communicating with others, writing not-so-technical parts of the paper, and submitting to arxiv. My regret is that I did not write many proofs in this math paper.\n\nRecently, I asked him if he would be willing to writing me a good letter, he told me that he's willing to \"write a 'B' level recommendation.\" I do not have much interaction experience with European professors, so I was wondering that should I take this opportunity to let he write this letter for me?\n\nMany thanks!\n\n*Edit*: I intend to apply to PhD programs in math in Canada, European, and some Asian countries. I may also apply one or two MSc programs.",
  "author": "hedgehog0",
  "created": 1630055205,
  "updated": 1634079475,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "hajf3pz": {
      "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajf3pz/",
      "text": "No. \n\nProfessor reputation matters less than the content of the letter.",
      "author": "Eigengrad",
      "created": 1630059780,
      "upvotes": 23,
      "replies": {
        "hajnx7s": {
          "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajnx7s/",
          "text": "Agreed and if OP is from the US the expectation on letters is much higher than in Europe - in as much as Europeans tend to be more reserved in their LoRs/references. They can think they've written a glowing reference only for an American reviewer to think it's a tepid endorsement. Definitely do not get a European \"B grade\" letter.",
          "author": "ACatGod",
          "created": 1630065642,
          "upvotes": 15,
          "replies": {
            "hajpio9": {
              "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajpio9/",
              "text": "Sorry I didn't mention the schools/programs I want to apply to. I intend to apply to math MSc and PhD programs (mostly PhD programs) in Canada, Europe, and perhaps some Asian countries.",
              "author": "hedgehog0",
              "created": 1630066560,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hajpmfv": {
          "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajpmfv/",
          "text": "I think I didn't perform that badly in his course. It's just that it was the second semester of studying math, and certain thinking modes of CS didn't \"transfer\" that well to math. I did my homework better than the exams.",
          "author": "hedgehog0",
          "created": 1630066619,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "halr4wm": {
      "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/halr4wm/",
      "text": "I shudder to think what a 'B' level recommendation from a European professor would look like.",
      "author": "mleok",
      "created": 1630097484,
      "upvotes": 8,
      "replies": {}
    },
    "han7fj6": {
      "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/han7fj6/",
      "text": "Under no circumstances. You could apply to the University of Eating Shit of Penguin Kingdom of Antarctica, and you would be still competing with students that will have stellar recommendations from authorities in the field.\n\nAnything less than than a recommendation from a professor that can directly attest to your relevant skills being the best according to their standards (i.e. not a “they were good in my class” recommendation) is to be used at your own risk.",
      "author": "tpolakov1",
      "created": 1630123227,
      "upvotes": 2,
      "replies": {}
    },
    "hatx6n3": {
      "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hatx6n3/",
      "text": "Unless this person is Žižek-level famous, a B-level rec will do more harm than good.",
      "author": "Radiant-Tax",
      "created": 1630260568,
      "upvotes": 1,
      "replies": {}
    },
    "hajijgf": {
      "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajijgf/",
      "text": "Any letter of recommendation is good. It's about who you know not what you know. People with clout can get you in without much effort on your part. It won't really matter what the letter says if in the end it achieves it's goal.",
      "author": "dhunt501",
      "created": 1630062268,
      "upvotes": -22,
      "replies": {
        "hajq3eu": {
          "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajq3eu/",
          "text": "What?!!\n\nNo. In fact, I'd argue that a tepid letter from a famous professor is way worse than a similar letter from a junior, unknown faculty, because people have more faith in the judgment of famous professors.",
          "author": null,
          "created": 1630066870,
          "upvotes": 11,
          "replies": {
            "hajr6yu": {
              "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajr6yu/",
              "text": "How would you even know? Unless you've read a lot of that person's letters of recommendation you'd never know it was lower quality then they can write one. They might just be bad at writing a letter of recommendation.",
              "author": "dhunt501",
              "created": 1630067466,
              "upvotes": -5,
              "replies": {}
            }
          }
        },
        "hajpglt": {
          "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajpglt/",
          "text": "The recommendation letters I've gotten by \"famous\" people are always very positive. If I ever got one that was \"B\" then I wouldn't pass that candidate along my any measure and I think most others wouldn't either.",
          "author": "bluethirdworld",
          "created": 1630066527,
          "upvotes": 5,
          "replies": {
            "hajqy3l": {
              "link": "/r/AskAcademia/comments/pcjosb/should_i_take_a_b_level_recommendation_letter/hajqy3l/",
              "text": "How would you know it was b? Maybe they just suck at writing good letters of recommendation",
              "author": "dhunt501",
              "created": 1630067334,
              "upvotes": -3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}