{
  "sid": "prx0su",
  "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/",
  "title:": "When does an assistant become a co-author of a paper?",
  "text": "Context: I'm editing an article for a book of collected articles. The thing is, I've had to read every reference the original author made and some extras too, and rewrite and correct a lot of wrong and missing information. I've basically rewritten every single sentence (the author's English is poor). I wrote an entire 600 word section from scratch to be included (as asked by the editor of the book). The article didn't provide analysis, more just a description of events and I wrote the analyses. All of them. I tied the article into the theme of the book essentially. Altogether I've written about 1300 words of the total 3500 word article from scratch. I told the editor I was a bit hesitant about the amount of work I was asked to do considering I don't want to step on the toes of the original author. I was told to go ahead anyway and not worry about it. \n\nWhat crediting am I allowed to ask for? I honestly feel like a co-author of this article at this point. I would at least like to get a \"thank you\" in the first footnote of the article. Is that in my right? Or am I getting too arrogant considering I'm a departmental research assistant and worked there for a little less than a year?",
  "author": "todayidontcarebear",
  "created": 1632151222,
  "updated": 1634078908,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "hdlvzn6": {
      "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdlvzn6/",
      "text": "Rewriting sentences? No. That's editing, not authoring.\n\nWriting more than a third of the paper from scratch, including analysis that was not part of the original? Yes, it is entirely reasonable to ask for (and even expect) credit as an author. However, that's still something the editor should discuss with the original author.",
      "author": "bigrottentuna",
      "created": 1632155304,
      "upvotes": 16,
      "replies": {
        "hdlyrq7": {
          "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdlyrq7/",
          "text": "Okay, thanks for the distinction! How should I go about asking for credit?",
          "author": "todayidontcarebear",
          "created": 1632156421,
          "upvotes": 4,
          "replies": {
            "hdlzx7m": {
              "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdlzx7m/",
              "text": "I would discuss it with the editor and just put it as you did here. Maybe something along these lines: \"Dear Professor, I wanted to ask again about co-authorship on this paper. I have now written more than 1/3 of it from scratch (in addition to rewriting nearly every sentence), adding whole discussions and analyses that were not part of the original. In any other context, I believe that would be sufficient for co-authorship. Is it different in this context and could you please explain it to me so that I can understand it?\"",
              "author": "bigrottentuna",
              "created": 1632156882,
              "upvotes": 7,
              "replies": {
                "hdm30q2": {
                  "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdm30q2/",
                  "text": "That's a good email, thank you for the advice! I really appreciate it (:",
                  "author": "todayidontcarebear",
                  "created": 1632158143,
                  "upvotes": 2,
                  "replies": {
                    "hdmhqgr": {
                      "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdmhqgr/",
                      "text": "Have a look at the credit taxonomy. It's for helping articulate authorship contributions but is also useful for identifying what activities you've done that might warrant authorship, and give you a better sense of what warrants authorship Vs acknowledgment. \n\nhttps://casrai.org/credit/",
                      "author": "ACatGod",
                      "created": 1632164183,
                      "upvotes": 2,
                      "replies": {
                        "hdmolm6": {
                          "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdmolm6/",
                          "text": "Thanks!! This is the kind of info I've tried to look for online but didn't quite know how do search for it (hence why I asked about it here on Reddit).",
                          "author": "todayidontcarebear",
                          "created": 1632166991,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hdm85jq": {
      "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdm85jq/",
      "text": "Editing sentences and improving the quality of writing does not qualify for authorship, but providing new ideas and analysis does.  You can ask to be a co-author, but realize that you are not holding many cards and the editor or first author would be entitled to tell you no.  Their primary reason to say yes would be to maintain a happy, healthy working relationship with you.  If the author does not know you, this will carry little weight.  It is ALWAYS best to discuss authorship BEFORE doing work that would qualify for authorship.\n\nAlso, if your career is anything like mine, you will have collaborations with many international students/academics whose native language is not English.  It's a great experience, but you will also be asked to read and edit a lot of papers.  I do this if I'm already an author or just like the person, but this can be a lot of work in some cases.  I'm not sure what position you hold at your institution.  It sounds like you might be paid to be an editor.  If I'm wrong and you are a PhD student doing research, remember that editing is not your primary responsibility.  You can choose to help, but don't sacrifice time you could be putting into your own research and graduating earlier.  It is the responsibility of the international student's advisor to make sure quality writing is being produced by their group..  If the advisor does not have time, they can hire an outside service.  It is inappropriate to shirk the responsibility onto a collaborator or even a research assistant in their own group/department.  Higher education carries enormous opportunity cost.  Don't let some jerk with tenure drive drive it up any further.",
      "author": "Late2TheThread",
      "created": 1632160238,
      "upvotes": 3,
      "replies": {
        "hdmoe6p": {
          "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdmoe6p/",
          "text": "Thank you! I am getting paid for editing. I've been working with the book editor this entire time and have a good relationship with her. I don't know the author of the article though, apart from a quick Google search (they're from a different university and country). For all the other editing I've done for the book I'm getting some kind of small acknowledgement along with the other assistants but I would very much like am extra note for this specific article considering the amount of original substance I have created for it. The thing is, the extra section and analysis I had to provide only came up after I started working on the article. Am I still ok to ask for specific credit for this article specifically?",
          "author": "todayidontcarebear",
          "created": 1632166909,
          "upvotes": 3,
          "replies": {
            "hdmshds": {
              "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdmshds/",
              "text": "I'm confused, is this editing project part of the responsibilities of an assistantship with your institution?  Or were you hired as an hourly contractor by a publishing company?",
              "author": "Late2TheThread",
              "created": 1632168586,
              "upvotes": 2,
              "replies": {
                "hdonet4": {
                  "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdonet4/",
                  "text": "I'm a research assistant at a university. Editing is my main responsibility.",
                  "author": "todayidontcarebear",
                  "created": 1632200597,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hdlr0a9": {
      "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdlr0a9/",
      "text": "[deleted]",
      "author": null,
      "created": 1632153280,
      "upvotes": -10,
      "replies": {
        "hdlywqe": {
          "link": "/r/AskAcademia/comments/prx0su/when_does_an_assistant_become_a_coauthor_of_a/hdlywqe/",
          "text": "Thanks for the input! How would I go about asking for credit?",
          "author": "todayidontcarebear",
          "created": 1632156476,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}