{
  "sid": "ioq05h",
  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/",
  "title:": "Is Math a skill you are born with, or something you can be good at if you try hard enough?",
  "text": "Hi everyone! Happy quarantine!!\n\nI have a question about math. I've noticed that lots of mathematicians are talented. They were brilliant as a kid.\n\nThat's not what I want to do, though. I want to do a PhD in Economics with a focus on international trade.\n\nThe thing is, I've never been good at math before. This is why I've decided to give it another go, to see if I can make it. I'm looking for online math courses right now.\n\nWhat I want to know is, if the math is for Economics, not Mathematics, then can I overcome it by working hard? Do you need talent to be good at Economics math?\n\nThank you so much! I would love to hear your experiences! I hope you all have a great day!:D",
  "author": "sammin4932",
  "created": 1599554174,
  "updated": 1634081740,
  "over_18": false,
  "upvotes": 122,
  "upvote_ratio": 0.93,
  "comments": {
    "g4fj7a1": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fj7a1/",
      "text": "[deleted]",
      "author": null,
      "created": 1599563956,
      "upvotes": 58,
      "replies": {
        "g4g42tw": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g42tw/",
          "text": ">Outside of disability (e.g. dyscalculia), I don't believe you can be \"bad at maths\" as a kid. It's a problem of teaching, where someone who probably hated maths in school is standing in front of 30+ different children, trying to force them to learn at the same pace. People inevitably fall through the cracks.\n\nCompletely agree with this statement. For almost all people, hating or \"being bad at\" math isn't something you're born with, it's something you're taught.\n\nI am always absolutely **floored** by the readiness with which college-educated adults will volunteer statements like \"I'm just someone who's bad at math\" or \"I don't have a head for figures, I could never learn to do that kind of math\".  Can you imagine **any** adult in any situation making a statement like \"I've never been able to read\" or \"I'm just one of those people who's illiterate, I could never learn to read those books\"? Of course you can't-- because in the developed world, reading is considered so fundamental to life that it would be shameful to admit to being illiterate. In educated circles it's well understood that you're supposed to at least pretend to enjoy reading. Yet adults readily volunteer their dislike or inability to do math as if it's normal or expected.\n\nAt its most basic, math is a language and understanding it is like being able to read-- being able to do math unlocks an entire world of scientific subjects, much like being able to read unlocks many different domains in the humanities, literature, history, and so on. \n\nSadly, we've trained generations of schoolkids that math is a series of steps that you memorize to get to the correct answer on an algebra test. Can you imagine if the only thing you ever used reading for in school was to answer the analogy questions on the SAT, and you never got to read a great work of literature? You might hate reading too in that situation...",
          "author": "DeskAccepted",
          "created": 1599577778,
          "upvotes": 28,
          "replies": {
            "g696bxv": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g696bxv/",
              "text": "To be fair, I studied for the GMAT math portion for about six months, and studied the verbal portion for a few days. Then I scored slightly below average on math, and in the top 0.1% on the verbal portion. It is upon this basis (and that same trend being my experience on tests and school since basically forever) that I say that I'm good at reading, and kind of \"meh\" at math.",
              "author": "BayAreaDreamer",
              "created": 1600809323,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g4fkswn": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fkswn/",
          "text": "Wow, this is so inspiring! Thank you so much for this! I will definitely give it a try! I guess I had horrible teachers, too. Thank you!!",
          "author": "sammin4932",
          "created": 1599565404,
          "upvotes": 5,
          "replies": {
            "g4fupra": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fupra/",
              "text": "Growing up I hated maths and I thought I was not good at it because I'm a girl. Those beliefs were instilled into me due to cultural conditioning too.\n\n Few years ago I started teaching myself math and I was surprised how fast I picked it up. I'm now doing my PhD and have recently gotten into bioinformatics and I love it. I realize now I just had horrible teachers who had no experience in dealing with kids who had a different way of learning. Our school system relies heavily on memorizing and not on logical/critical thinking. I'm not someone who is good at memorizing so naturally I had a tough time. Now that I'm teaching myself I realize, I just needed to understand the concept and not parrot it. So yes maths is something you can totally learn and be good at it because it's highly logical. Logical thinking is a skill that needs constant practice.",
              "author": "yako678",
              "created": 1599572485,
              "upvotes": 10,
              "replies": {
                "g4ieex3": {
                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4ieex3/",
                  "text": "Cultural indoxtrination holding people back is the worst. I was told in my backwards arse village chem is not for girls.\n\n\nThrough tech college and BSc, my classes had morr girls/women than men. Even after 60 people failed out of 1st year bsc, we got an evenish number.",
                  "author": "Hoihe",
                  "created": 1599620336,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g4gad32": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gad32/",
              "text": "For the longest time I thought I was bad at math. Then, my teachers changed and I actually took an interest in the subject. My attitude improved, and so did my grades. All it took was one teacher who was kind!",
              "author": "pin_yue",
              "created": 1599581037,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g4g7ysq": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g7ysq/",
          "text": "This is really nice to read from someone at such a high level. Thanks for taking the time.",
          "author": "GromflomiteAssassin",
          "created": 1599579795,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g4fcefd": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fcefd/",
      "text": "As with almost anything in life (arts, sports, and skill you can think of), you can learn math to a pretty impressive degree if you have no talent/have average talent for it. \n\nThe talent comes into play at really high level research, and it's usually tied to the ability to abstract, and thing in abstract terms on multiple levels. \n\nSo, seat your ass in a chair, grab a textbook, and get going. :)",
      "author": "crazyGauss42",
      "created": 1599556649,
      "upvotes": 205,
      "replies": {
        "g4fmdkz": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fmdkz/",
          "text": "Even the very abstract thinking can click if you work hard enough at understanding it. There's no line that requires a certain amount of talent to pass. But talent or innate intelligence does help you progress faster at every stage (from elementary school to PhD and beyond).",
          "author": null,
          "created": 1599566715,
          "upvotes": 30,
          "replies": {}
        },
        "g4fvw8c": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fvw8c/",
          "text": "A relevant paper that argued that disciplines where it is believed that people need to have some kind of raw talent, have fewer women and African American students: https://science.sciencemag.org/content/347/6219/262\n\nMost, not all, of the STEM disciplines fall into this category. There is no conclusive proof that they indeed require innate talent, but it's a common stereotype associated with them.",
          "author": "thisCantBeBad",
          "created": 1599573199,
          "upvotes": 74,
          "replies": {
            "g4g4ddy": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g4ddy/",
              "text": "Yeah, as a research scientist (chemistry), the whole talent thing in science doesn't make much sense. The vast majority of research follows on from past work (and the decisions you make in the research process are usually quite logical – just careful choices, not talent) – there's so little research that just appears out of nowhere and becomes a new field. If anything, major breakthroughs are a mixture of competence and luck (in my opinion, luck is a big one).",
              "author": "someth1ng_au",
              "created": 1599577934,
              "upvotes": 46,
              "replies": {
                "g4gf68o": {
                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gf68o/",
                  "text": "I can't agree more. I always had this hypothesis that there there are many equally talented equally hard-working scientists working on the same thing  out there but at the end only one or a few gets to be the associated with the supposed innovation or breakthrough. This is not a factor of talent at this level, it is sheer luck. Also the single handed break through we used to see in science are getting less and less and more collaborative efforts are coming into play, this is a good thing in my opinion.",
                  "author": "digital-idiot",
                  "created": 1599583512,
                  "upvotes": 23,
                  "replies": {}
                }
              }
            },
            "g4fz0ro": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fz0ro/",
              "text": "Right. It is not the innate talent you are seeing in successful people at a high level; it is the innumerable resources and mentorship they have received along the way.",
              "author": "cakebyte",
              "created": 1599575027,
              "upvotes": 20,
              "replies": {
                "g4g4jxs": {
                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g4jxs/",
                  "text": "Yes, just look at PhD graduates. The ones that go furthest (whether in academia or not) aren't the \"best\" researchers, they just had academic advisors that batted for them and made sure they got a fair go.",
                  "author": "someth1ng_au",
                  "created": 1599578029,
                  "upvotes": 25,
                  "replies": {
                    "g4ha6ph": {
                      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4ha6ph/",
                      "text": "Having a support network, starting with family and including at least one mentor who fully understand the possible pathways is a prerequisite for a successful career. Having tried, I think it’s pretty much impossible to operate totally alone at anything at the PhD level.",
                      "author": "marinegeo",
                      "created": 1599599007,
                      "upvotes": 6,
                      "replies": {}
                    },
                    "g4h0nmi": {
                      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4h0nmi/",
                      "text": "This definitely isn’t true in a field like math. It’s full of savants who were identified as being prodigies very early on, etc...",
                      "author": "nevernotdating",
                      "created": 1599594254,
                      "upvotes": -4,
                      "replies": {
                        "g4h2jyx": {
                          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4h2jyx/",
                          "text": "You mean the people who were raised their entire lives to develop and master a specific skill are the ones who are the best at it?",
                          "author": "murdermeformysins",
                          "created": 1599595187,
                          "upvotes": 10,
                          "replies": {}
                        },
                        "g5gyfj9": {
                          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g5gyfj9/",
                          "text": "Those “prodigies” start at an early age and practice over and over. It’s about having more time to develop those skills, still- many of them fail where their previously “mediocre” peers succeed when they leave home.",
                          "author": "catfeinee",
                          "created": 1600264361,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g4iykdy": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4iykdy/",
              "text": "Yes, I think (and see this in everyday life) it has a lot more to do with what you're exposed to and what your surroundings expect from you than some really innate talent. I've found another interesting [article](https://science.sciencemag.org/content/355/6323/389?intcmp=trendmd-sci) on the topic, about how early these stereotypes and pressures form in children.",
              "author": "crazyGauss42",
              "created": 1599636047,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g4fcfug": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fcfug/",
          "text": "Yes sir! Busting ass right now!!",
          "author": "sammin4932",
          "created": 1599556696,
          "upvotes": 40,
          "replies": {}
        }
      }
    },
    "g4fc3bi": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fc3bi/",
      "text": "[deleted]",
      "author": null,
      "created": 1599556289,
      "upvotes": 66,
      "replies": {
        "g4fc8lv": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fc8lv/",
          "text": "Thank you! I should put in a lot of time and effort!",
          "author": "sammin4932",
          "created": 1599556459,
          "upvotes": 17,
          "replies": {}
        },
        "g4gixon": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gixon/",
          "text": "I'd add math really depends on your early teachers.\n\nSome people (like me) just get so bad teachers that nothing makes sense. It then takes getting to adulthood to realise oh look, it all makes sense now. Shame I don't have the time to study all over again.",
          "author": "anotherbozo",
          "created": 1599585394,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "g4fp6ee": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fp6ee/",
      "text": "hi hello economist here\n\nI think talent/hard work is kind of a misnomer here. On the one hand, you can definitely learn math by working hard and most people I know did just that. On the other, there is a lot of math economists need to know, both to be admitted to grad school and to advance to candidacy, and for some people there aren't enough hours in the day to hard-work their way through it. I don't know if this is due to \"talent\" (whatever that is), or because they had a poor mathematical education in K-12 or whatever else. \n\nThere's not really such a thing as \"economics math\" - it's the same math as, god forgive me, \"math math\". It's why it's so advantageous to get a math undergrad to do econ in grad school (albeit not at all required). I know that in some countries, econ undergrads do \"calculus for economists\" or whatever which is a watered-down version, but in the US at least, to do econ, you need to know pure math.",
      "author": "thegreenaquarium",
      "created": 1599568834,
      "upvotes": 12,
      "replies": {
        "g4g2per": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g2per/",
          "text": "> There's not really such a thing as \"economics math\" - it's the same math as, god forgive me, \"~~math~~ low-level math\".\n\nForgive me.. but I haven't seen any use of higher undergraduate math concepts, e.g. Spectral Theory, Poincare Disk, Differential Geometry etc, being used in any of the economics graduate courses. Micro, okay math.. but the math in Macro was a joke.\n\nsource: 1.year in PhD economics before I fucked off to do math. Edited for clarification.",
          "author": "advanced-DnD",
          "created": 1599577048,
          "upvotes": 2,
          "replies": {
            "g4g4ix7": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g4ix7/",
              "text": "I'm confused why your undergraduate experience is relevant to my comment about getting a PhD in economics?",
              "author": "thegreenaquarium",
              "created": 1599578014,
              "upvotes": 2,
              "replies": {
                "g4ga55h": {
                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4ga55h/",
                  "text": "> why your undergraduate experience is relevant to my comment about getting a PhD in economics?\n\nI was actually in the PhD economic stream in my university for a year before I said \"fuck it\" and left for PhD in math. So yes, I took graduate level Macro, Micro and Econometrics.",
                  "author": "advanced-DnD",
                  "created": 1599580920,
                  "upvotes": 2,
                  "replies": {
                    "g4gl3xj": {
                      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gl3xj/",
                      "text": "Cool. Depending on what you end up focusing on, you can use anything from math major gateway courses to very advanced math.",
                      "author": "thegreenaquarium",
                      "created": 1599586480,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g4g4sd3": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g4sd3/",
              "text": "I just took the PhD econometrics sequence at my school last year and it was all linear algebra and probability theory. I feel like those subjects are without a doubt necessary and are not really covered in most undergraduate Econ sequences - you gotta do some sort of math for that",
              "author": "sk81k",
              "created": 1599578150,
              "upvotes": 2,
              "replies": {
                "g4gaf31": {
                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gaf31/",
                  "text": ">  PhD econometrics sequence at my school last year and it was all linear algebra and probability theory. \n\nThe PhD econometrics in my school starts with measure theory. But that was just brushing through.",
                  "author": "advanced-DnD",
                  "created": 1599581065,
                  "upvotes": 2,
                  "replies": {
                    "g4gl0h5": {
                      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gl0h5/",
                      "text": "Dang that’s kinda crazy. Which textbook did you use???",
                      "author": "sk81k",
                      "created": 1599586431,
                      "upvotes": 1,
                      "replies": {
                        "g4gp2bq": {
                          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gp2bq/",
                          "text": "For measure theory, none. Because no serious textbook will do the speed where we did.\n\nBut when we really got into econometric, it was \"Hayashi\".",
                          "author": "advanced-DnD",
                          "created": 1599588474,
                          "upvotes": 2,
                          "replies": {
                            "g4gqxke": {
                              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gqxke/",
                              "text": "Gotcha, that makes sense. Did they cover measure theory or would you recommend taking measure theory before PhD programs now?",
                              "author": "sk81k",
                              "created": 1599589416,
                              "upvotes": 1,
                              "replies": {
                                "g4gw9ca": {
                                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gw9ca/",
                                  "text": "> Did they cover measure theory or would you recommend taking measure theory before PhD programs now?\n\nWhat is your purpose? You want to do applied or theoretical? Measure theory is not essential for applied works.",
                                  "author": "advanced-DnD",
                                  "created": 1599592075,
                                  "upvotes": 2,
                                  "replies": {
                                    "g4gx21l": {
                                      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gx21l/",
                                      "text": "Probably applied but I’m also too young/fresh to know what I wanna do just yet if that makes sense (I just started my junior year of undergrad)",
                                      "author": "sk81k",
                                      "created": 1599592476,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g4fpc7g": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fpc7g/",
          "text": "Thank you for the great explanation! Guess I gotta buckle down and work hard to make up for the years I've wasted!!",
          "author": "sammin4932",
          "created": 1599568950,
          "upvotes": 1,
          "replies": {
            "g4fxaht": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fxaht/",
              "text": "Statistics and econometrics are your targets. Vector calculus. Linear algebra. Not necessarily solving problems, but focus on the theory as well. It’s applied math,  not pure math.",
              "author": "macdr",
              "created": 1599574038,
              "upvotes": 2,
              "replies": {
                "g4g0612": {
                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g0612/",
                  "text": "Yup this.",
                  "author": "VeblenWasRight",
                  "created": 1599575669,
                  "upvotes": 2,
                  "replies": {}
                },
                "g4gc477": {
                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gc477/",
                  "text": "Not if they want to pass quals their first year, then it's real analysis and optimization.",
                  "author": "alextoyalex",
                  "created": 1599581951,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g4fazea": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fazea/",
      "text": "It is something that we have to learn. Nobody is born good at math. But some are born with more active brain than other. So we can say that they can be better than us at math. But even they should learn it, to become good at it. So yeah, nobody is born good at math👍",
      "author": "meme_lover_rajath",
      "created": 1599554988,
      "upvotes": 19,
      "replies": {
        "g4fb9tr": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fb9tr/",
          "text": "Thank you! I'll do my best to be good at math!!",
          "author": "sammin4932",
          "created": 1599555327,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g4fstpt": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fstpt/",
      "text": "I'm sure there are a lot of great answers here already, but figured I'd add my own personal experience. I came from a small rural town, the local high school wasn't even accredited. It wasn't until tenth grade that I moved to a better area with a WAY better school system. Before the move I was a class clown and did awful in my classes. D's and F's. \n\nBut after, I didn't have any friends in this new place, so I figured \"what the hell, may as well actually do my work for a change\". Turns out I was pretty good. Soon I was turned on to chemistry and physics and decided that is what I would go for at college. \n\nIt took another year and a half for me to realize I loved math above any other subject. So about halfway through my undergrad I switched. Keep in mind there are brilliant people out there who have known since high school that they wanted to do math, so I was pretty late in the game to be starting. \n\nBUT if you love it enough and are willing to put in the work (definitely bust your ass, it's 100% worth it) you can absolutely become \"good\" at math and over come any difficulties. Case in point, I did terribly at real analysis my first go around, but no way in hell was I just going to accept being substandard. After A LOT of effort, analysis is actually my best subject (and favorite). \n\nDecided to never stop giving that much effort. Went on to finish a master's at the same institution before leaving. Now I'm beginning my PhD and definitely feel ready. \n\ntl;dr yes you can definitely become good at math with effort. I did it, so can you. Just don't give up trying.",
      "author": "NotJustAPebble",
      "created": 1599571298,
      "upvotes": 7,
      "replies": {}
    },
    "g4fc376": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fc376/",
      "text": "In my opinion, based from personal experience, this question has 2 answers. I will use a football example too.\n\nYes, Math to the level of doing a PhD in Math and revolutionizing the field, and making brilliant contributions to the world, is something you're born with. A great example of this is  Srinivasa Ramanujan. So yes, there are people who are born with a special talent for math, as there are people who are born with special talent to sing, just like Maradona and Messi were born to play football with an incredible talent\n\nNevertheless, I think that the math level required to do a PhD in Economics is something that you can learn, and if you invest 2000 hours or so to learn the math, you will achieve any goal related to it. You don't need to be born a genius to get a PhD, and you can work your way to it, be sure about that. As long as you don't aspire to be John Nash or something like that, you can work hard and with dedication until you make it. That's what Cristiano Ronaldo did, and see where he is now.",
      "author": "GugaAcevedo",
      "created": 1599556285,
      "upvotes": 17,
      "replies": {
        "g4g5b5j": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g5b5j/",
          "text": "Personally, I think it's better described as a skill ceiling – the reality is, for most people, no matter how much you trained, will never be a professional football player, or a top marathon runner, or the fastest sprinter. It seems like we're born with some natural ability but whether we reach the top level also requires a lot of hard work and probably the right guidance/coaching/teaching. With that said, I think you can become competent (even if not \"the best\") in almost anything, if given enough time and effort.",
          "author": "someth1ng_au",
          "created": 1599578423,
          "upvotes": 7,
          "replies": {}
        },
        "g4fc7he": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fc7he/",
          "text": "Thank you for your great advice! I'll keep it in mind and do my best!",
          "author": "sammin4932",
          "created": 1599556422,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4fvrs1": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fvrs1/",
      "text": "Cognitive Psychologist here. I tell all my students looking to improve their GRE (Grad school entrance exam in the states) scores to study for the math over the English sections.  While fluid intelligence plays a role in both, it's faster and easier for most students to learn or relearn enough math (crystalized intelligence) for a significant improvement in scores.  So many students want to study for the English section because the studying feels easier, yet it produces very small gains in scores.  But math is infinitely improvable, especially considering the deficits that many start at.",
      "author": "Der_Kommissar73",
      "created": 1599573126,
      "upvotes": 6,
      "replies": {
        "g5gyv0h": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g5gyv0h/",
          "text": "To be fair GRE math isn’t real math at all. That’s just the elementary logic games we’re taught in middle-highschool. More of that is reviewing for people who don’t have a strong quantitative/scientific background in the way the GRE wants.\n\nLearning how the GRE asks questions appears to be more important than your actual knowledge. For example, my friend who’s a math undergrad scored higher on verbal because he studied more for that, while his quant was lower because he thought he had it in the bag.",
          "author": "catfeinee",
          "created": 1600264607,
          "upvotes": 1,
          "replies": {
            "g5gz12w": {
              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g5gz12w/",
              "text": "That’s an interesting perspective. I’m wondering what your expertise is and how much experience you have had with the GRE?",
              "author": "Der_Kommissar73",
              "created": 1600264702,
              "upvotes": 1,
              "replies": {
                "g5gzu1r": {
                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g5gzu1r/",
                  "text": "I took it my junior year, I’m doing a 5 year joint ugrad-MS degree in chemical engineering, which a double major in chemistry at the undergraduate level. Hopefully I’ll be applying for Ph.Ds this cycle, but we’ll see how that goes with COVID.\n\nWhile the math I use is far below that of what a mathematician will use in terms of abstraction and depth basic algebra isn’t really “math.” The quant that was in the GRE was more about understanding how they ask the question. \n\nI think an issue is that a lot of people have the misconception that math is just memorization and algebra because that’s all they’ve been exposed to. That’s where all these misconceptions come from. You’re never going to see a PDE, a triple integral, or the cauchie stress tensor on the GRE, even if that’s what you’ve been enveloped in for 3 years. The GRE doesn’t really test the technical skills of the student, it tests how diligently they prepare. To disadvantaged students who can’t afford materials this can be a massive deterrent, especially those in STEM who have already overcome some of the most difficult/time consuming undergrad curricula you can find. \n\nI’m actually really opposed to the GRE because of this. It, like so many parts of academia,  seems to hurt minorities and people with no money, who deserve a place but can’t afford it.",
                  "author": "catfeinee",
                  "created": 1600265159,
                  "upvotes": 1,
                  "replies": {
                    "g5h0xkv": {
                      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g5h0xkv/",
                      "text": "Yes, absolutely, the math you use on an everyday basis is above what is included in the GRE. But I do think you are underestimating both the base level of mathematics competence in the general body of people taking the GRE and the difficulty level of the content.  Just because it's easy for you does not make it easy for everyone- that's an important lesson for everyone who's planning on being a professor or a teaching assistant.   In general, studying for the math section produces a better return for the population at large because of inadequate preparation and lack of self-efficacy in quantitative skills. \n\nOthers argue that these tests provide opportunity for minorities. Without test scores, applications are heavy influenced by interviews and connections- two things that whites with money have an overwhelming advantage in. What we need is to level the playing field by making sure that a quality education is provided to everyone, regardless of class, and to make the tests cheaper.  The test just reflects societal divides.  Those divides will still be there if you remove the test.",
                      "author": "Der_Kommissar73",
                      "created": 1600265770,
                      "upvotes": 1,
                      "replies": {
                        "g5h1e68": {
                          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g5h1e68/",
                          "text": "While I can see your reasoning, it is not backed up by [experimental evidence.](https://www.sciencedaily.com/releases/2019/01/190129124951.htm) In STEM, atleast, the GRE isn’t a good predictor of grad school success, and the cost/specific way to study hurts diversity.\n\n\nI’m not saying the basic algebra on the GRE is easy for everyone, but I would say it’s far cry from the math that most people in STEM have been doing. It’s more like high school level content that needs to be prepared for in a specific way. The GRE words questions in a certain way, and structures the exam a certain way, you learn the test, not necessarily the content.",
                          "author": "catfeinee",
                          "created": 1600266021,
                          "upvotes": 1,
                          "replies": {
                            "g5h2kv2": {
                              "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g5h2kv2/",
                              "text": "So, that's a well known and somewhat controversial study.  One problem with evaluating the predictive validity of the GRE based on graduation rates is restriction of range.  Because only those with higher scores are admitted to graduate school, the range of GRE scores in that sample is greatly restricted over the population.  As you likely know, regression under restriction of range will produce an attenuated correlation when compared to the total population.   If you were to admit more broadly, using lower or no GRE cutoff scores, you likely would see a significant correlation. \n\nIn general, you should cite and read the study rather than the pop science article based on it. The article is not an unbiased view of the research.\n\nAlso, it's not \"experimental evidence\".  It's a correlational/observational study.  An experiment is a specific method for testing hypothesis that provides for a greater ability to infer causality.  Correlational studies simply identify relationships that may be important to explore and understand.  You may not have meant it that way, but that's the jargon, and you should use it correctly.  \n\nHere's a counter perspective that you may find useful...  [https://www.psychologytoday.com/us/blog/channel-g/202008/welcome-channel-g](https://www.psychologytoday.com/us/blog/channel-g/202008/welcome-channel-g)\n\nTests are part of the solution, even if they are the easiest to attack part of the current problem.",
                              "author": "Der_Kommissar73",
                              "created": 1600266654,
                              "upvotes": 1,
                              "replies": {
                                "g5h6h0a": {
                                  "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g5h6h0a/",
                                  "text": "Also- if you read the actual article, GRE-Q scores were significantly correlated to PhD completion, but GRE-V were not.  That really only supports my point above.",
                                  "author": "Der_Kommissar73",
                                  "created": 1600268665,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g4g3vku": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g3vku/",
      "text": "I have taken up maths since I retired. Because I want to learn subjects that appeal to me. Topology, finite state machines, group theory.\n\nMy advice:\n\nPersistence leads to gradual understanding.\n\nMathematicians have a very terse, minimalist way of describing things. It has to be gotten used to.\n\nSymbols make everything look harder than it is. \n\nI find that books, Wikipedia articles, YouTube videos can all help. If you don't understand some point, move on. Maybe try another article.\n\nThe satisfaction of understanding a concept can be great.\n\nAfter a while, what you know starts to \"come together\" and maths starts to make sense as a way of thinking.",
      "author": "JulianUNE",
      "created": 1599577673,
      "upvotes": 4,
      "replies": {}
    },
    "g4fsriv": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fsriv/",
      "text": "Wow, best way to learn math would be sitting at the kitchen table/slab and holding back tears while your father screams at you for not being able to to solve something that you literally just saw for the first time. \n\n\nOn a serious note, practice & lots of it would help you get efficient at it. Granted, talented mathematicians can look at a question & what know what to do about it, but so will you only if you devote time to practicing it more than just taking a course on it. So, I’d recommend you have a plan of what’s the type of math that you’d require for your course & study it really well. You’d definitely get there!",
      "author": "SnehaMendiratta",
      "created": 1599571257,
      "upvotes": 3,
      "replies": {}
    },
    "g4gcb7d": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gcb7d/",
      "text": "It sounds like you're comparing yourself to those select few that were born with a different operating system. \n\nNo, if you weren't a child prodigy, you probably won't be prodigious as an adult either.\n\nThat being said, you can get very very very very smart by working hard and believing in yourself.\n\nYou go dude!",
      "author": "grawfin",
      "created": 1599582051,
      "upvotes": 3,
      "replies": {}
    },
    "g4fgv4a": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fgv4a/",
      "text": "I think it's a bit of both, i know many people who were skilled at math and i was not so much, i hated math but wuth practice i got a good grade eventually, but, its more a case of intelligence, not mensa iq but like real intellegence and the easiness of learning is different to everyone so, probably, but anyone can get better with practice. Economics is a bit harder but i can't see it as something impossible",
      "author": "Intelligent-Pen3499",
      "created": 1599561632,
      "upvotes": 2,
      "replies": {
        "g4fgxxr": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fgxxr/",
          "text": "Thank you!",
          "author": "sammin4932",
          "created": 1599561715,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4fvot6": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fvot6/",
      "text": "Math is just a form of logic. Some people are born more geared toward logic, some are not. But everyone can learn logic with enough practice. This is especially true of applied math, just focus on what the things mean, and less about how they got the formula.",
      "author": null,
      "created": 1599573077,
      "upvotes": 2,
      "replies": {}
    },
    "g4gr4wr": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gr4wr/",
      "text": "Nope. Given enough time, anybody can learn anything. Human potential seriously has no limit.",
      "author": "AfterTruth",
      "created": 1599589517,
      "upvotes": 2,
      "replies": {}
    },
    "g4gsjc8": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gsjc8/",
      "text": "I’ve long been interested in the concept of multiple intelligences, while I am also aware that it has its critics and there are hazards that go along with essentializing the idea too much into hardened inborn traits. There is a book that I read long ago called _Seven Kinds of Smart_ that sums it up quite nicely as word smart, number smart, picture smart, body smart, music smart, social smart, and self smart.\n\nA simple example: My ex-husband can add up long strings of numbers in his head. (I can’t. I need pencil and paper). I on the other hand can remember word-stuff, like names, addresses, and very conveniently, academic citations. We called him The Calculator and I was The Rolodex. Good team, haha. He’s more number smart, I’m more word smart, in other words, as compared to the other. This is not even a function of schooling, because I had more years of (equally good) schooling in math than he did.\n\nMore and more learning in math, as many have pointed out, means ability to think on increasingly higher planes of abstraction.\n\nArithmetic is concrete. Algebra, Geometry, and Trigonometry each require leaps to abstract levels of thinking. Assuming all other things being equal (a huge assumption, that), some kids make the leap quite easily, and some don’t. This difference represents (inborn?, not sure) _talent,_ a.k.a. math smart, in my view. (Inborn _brilliance_ or _genius,_ I am not sure how to define, but most people know it when they see it.) Those kids that don’t make the leap easily, there could be one of at least two reasons that I can think of: a learning disability, or they are simply not number smart (whereas they could certainly be word smart or picture smart or any cluster of the other ones instead). Can those kids make the leap? I think most of them can, even if it’s not easily. They can be taught. And most can get better with practice.\n\nThen we have the leaps to higher and higher levels of abstraction with Calculus, Differential Equations, and goodness knows what comes after, where the abstractions start to do weird things like bend at varying rates and convolute and get turned inside out. This is where a lot more get lost (including me) if they find it too difficult to make the leap. And again, some people make the leap quite easily. They are math smart. Others don’t. Their intelligences lie in other kinds of smart. Most of them, probably, can be taught, and can get very good at it indeed, with hard work and practice.\n\n“Math smart” exists. So does “genius.” No doubt about it. Whether it comes from inborn hard wiring or sociocultural conditioning is of course a difficult matter to settle. Whether math skills can be taught and practiced and developed, for the most part is yes. I think the key differences lie in whether a person finds it easy or hard — whether they are math smart or not (or not so much, or to a certain point). I personally found math easy, but for only as long as I could make pictures of it in my head (read: I am much more picture smart than math smart).\n\nTL;DR - “Math smart” is one of several key thinking styles in the schema of “multiple intelligences,” with some people being a lot more (easily) able to think on abstract planes than others. For  maybe most others, it can be learned and developed, but with effort.",
      "author": "jadynfirehawk",
      "created": 1599590210,
      "upvotes": 2,
      "replies": {}
    },
    "g4gsmqc": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gsmqc/",
      "text": "Math skills are definitely not something you're born with!! (I am very passionate about this.) In middle school and high school, math was something I did not understand and I just *got by* due to having peers in my class who knew what they were doing. Struggled *heavily* to get low A's and Bs (not terrible, but I'm a perfectionist lol). It was definitely my least favorite subject, but I want to be a doctor so I needed to get through calculus. I took my first college algebra class and while it kicked my ass, I learned so much and started to actually love math. I was understanding it rather than just getting by, and I realized that all of the subjects I enjoyed were revolving around math! I kept taking college math for 6 more quarters and I finished the entire calculus series with a 4.0 in every college math class I took including calc (not to brag, just trying to prove that you can *become* good at math.) Now I'm actually thinking of doing a minor or double major in math. \n\nI think a lot of it is just developing the problem solving skills you need to be successful in math classes, because they are unlike the skills you need in humanities, or even science classes. It is about going through the specific steps to solve a problem, which is very much a learned skill. I hope you will learn from me that you can be good at math without being born that way. Best of luck, and I hope you will consider to further your math skills!",
      "author": "sadbiol",
      "created": 1599590255,
      "upvotes": 2,
      "replies": {}
    },
    "g4gv4fl": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gv4fl/",
      "text": "I don't know the answer to your question, but I do know that working on your math will make economics easier.",
      "author": "dampew",
      "created": 1599591506,
      "upvotes": 2,
      "replies": {}
    },
    "g4i4du4": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4i4du4/",
      "text": "I got 38 out of 100 for my math test when I was in grade 9, before high-school. Now I'm doing my PhDs in Engineering. You're not born with it. The right exposure and your dedication will always be the key.",
      "author": "DreemingDemon",
      "created": 1599614585,
      "upvotes": 2,
      "replies": {}
    },
    "g4gk9l1": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gk9l1/",
      "text": "a basketball analogy may work.  You can love basketball, work very hard to be in great condition, strong, work on dribbling, passing, shooting, footwork, and become a great player.  But if you are 5 ft tall no amount of work will make you 7 ft tall.\n\nSo, go for it and work hard.  Good luck!",
      "author": "arachnidtree",
      "created": 1599586059,
      "upvotes": 2,
      "replies": {}
    },
    "g4ftszs": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4ftszs/",
      "text": "I think it depends on the person, so I'll probably go with a skill one is born with. My personal experience has taught me that no matter how much I try, I will never be good with math. I could do well with the basics but not with the complicated ones, more so if combined with concepts. A good example for me would be physics. I love physics, but sadly, it will never love me back. Even if I memorize an entire textbook word per word, I can never do well with problem solving involving math. I've learned to accept that there are different forms of intelligence and math will never be for me.",
      "author": "Ok_Cranberry8872",
      "created": 1599571919,
      "upvotes": 1,
      "replies": {}
    },
    "g4fx1df": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fx1df/",
      "text": "My PhD is in economics, my dissertation was in international finance, and I don’t think I’m particularly “good” at math and I know I am not particularly skilled.\n\nEconomics is primarily the study of resource allocation.  Yes math helps but you don’t need to be Einstein unless your idea of studying economics is studying mathematical techniques as applied to economic problems.\n\nLots of famous Econ authors that didn’t write a single equation.  \n\nWill you need some math to get thru the program?  Yes.  Will you need real analysis or topology or even vector calculus to finish your dissertation and understand international trade?  No.\n\nIn short economics is a big tent and I personally think anyone in the top quarter of the reasoning distribution can get through a PhD.  If you can do algebra, understand the notion of calculus, and understand basic statistics you’ll be fine.\n\nEdit: I should have noted that is does depend upon the program.  Some programs it will be tough to get thru but plenty of programs out their that fit my claim.",
      "author": "VeblenWasRight",
      "created": 1599573888,
      "upvotes": 1,
      "replies": {}
    },
    "g4fx62q": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fx62q/",
      "text": "I'd like to think I'm okay with maths. But in grade school I wasn't, not until like geometry and algebra etc. I couldn't stand the busy work with my adhd. \n\nNow I'm a mom that is suddenly homeschooling and going back through third grade maths with my oldest and helping my middle child learn addition facts up to 20 I definitely didn't learn maths this way BUT it's the way I saw it but it was \"wrong\" in public school. And that's what made the busy work so difficult. I'd say start maybe a level before your knowledge so that you can reinforce your understanding of say basic algebra or whatever and you should be fine. I've survived through chemistry maths and calc and I'm currently working through physics at 30 but I've still realized there are holes in my basic mathematical understanding that would have made things easier.",
      "author": "bishpleese",
      "created": 1599573966,
      "upvotes": 1,
      "replies": {}
    },
    "g4fyjpe": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fyjpe/",
      "text": "PhD in applied math here. \n\nI just also want to say that it's easy for people \"good at math\" (see other comments) to show that they are good at math. There are myriads of math competitions starting from middle school onwards, and there's a huge support system developed in many countries to train mathematicians. This is not necessarily true for economics for example.",
      "author": "runiteking1",
      "created": 1599574760,
      "upvotes": 1,
      "replies": {}
    },
    "g4g1ai6": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g1ai6/",
      "text": "Assuming the post flair is relevant: The sorts of math most social scientists need is an acquired skill, but it is similar to the sorts of skills most knowledge workers use. \n\nIdentifying patterns is what is of most importance, generally the additional math understanding isn't as important as model assumptions (though it can take some algebra to fully understand these).\n\nIn my experience (from teaching applied statistics to social scientists), many lack some background, but this is mostly jargon and that's easy to pick up. Some never took basic statistical courses, but that's just content, not some innate knowledge they were born with.\n\nNobody is born with the definition of the normal and uniform distributions.\n\nEconomics may be a special case as many economists develop new equations meant to represent real world processes - if you want to be this sort of economist, you'd need to learn that language, and I'd expect a decent understanding of calculus to be a requisite. \n\nNobody is born knowing calculus, either, save perhaps Newton if we want to be snarky.",
      "author": "ph0rk",
      "created": 1599576283,
      "upvotes": 1,
      "replies": {}
    },
    "g4g1s1g": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g1s1g/",
      "text": "Maths in econ can range from nothing to msc applied maths level. Even if you are not good at maths after working hard (which I doubt) you can still produce applied theory papers.  Start with the book Advanced macro by Romer, the math is nothing fancy, and I would say macro is more theoretical than almost every field in econ already.\n\nps: since your interested in trade, read Krugman 1981. The maths there is just calculus.",
      "author": "Economist294",
      "created": 1599576548,
      "upvotes": 1,
      "replies": {}
    },
    "g4g3op6": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g3op6/",
      "text": "I suspect that there's a lot you can learn and do with sufficient energy and effort (and a spectacular teacher) but without the right genes you won't be a super-duper whiz kid: Serena Williams got to be a champion by lots of practice and training, but if she lacked the good genes, she's wind up playing a lot of tennis with friends.\nIt's the old nature vs nurture debate: nature provides a lot, but won't do a damned thing for you without sufficient nurture.",
      "author": "goodlit",
      "created": 1599577572,
      "upvotes": 1,
      "replies": {}
    },
    "g4g5m3c": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g5m3c/",
      "text": "Both",
      "author": "ellaAir",
      "created": 1599578579,
      "upvotes": 1,
      "replies": {}
    },
    "g4g6z2w": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g6z2w/",
      "text": "Have a look at the maths books by KA Stroud. They're for engineering but do cover statistics I think? \n\nThey transformed maths for me. Step by step guide through examples and answers.\n\nJust beautiful books.\n\nAll you need is someone to explain it clearly, and sometimes  YouTube has great alternative explanations too, to reinforce stuff.",
      "author": "pmabz",
      "created": 1599579285,
      "upvotes": 1,
      "replies": {}
    },
    "g4g8u5b": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g8u5b/",
      "text": "It's not about talent. You have to put the work and effort in to succeed. Use all of your resources to learn and understand what you want to know. That means getting into study groups, working with a tutor, talking to your professors, etc. You may have not been afforded a good math teacher up to this point! So maybe it's not you; it's them! Also, look at textbooks and online resources outside of the texts you're directed to use for class. It's why we have thousands of books on the same topic. Some do a better job of explaining things than others. Took me a long time to realize that, but it was a serious eureka moment. Good luck!",
      "author": "Hot-Pretzel",
      "created": 1599580247,
      "upvotes": 1,
      "replies": {}
    },
    "g4g9qgv": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g9qgv/",
      "text": "From my experience, I feel like its a little bit of both. Simply because if you’re naturally inclined toward something you’ll probably enjoy doing it a little more and actually practicing it, but it really is like 90% practice. I sat down with a GRE book and khan academy and basically retaught myself everything from basic algebra to calculus. Not too bad either just takes a lot of time and determination. And paper. Lots of paper",
      "author": "DSTST",
      "created": 1599580707,
      "upvotes": 1,
      "replies": {}
    },
    "g4gcwnh": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gcwnh/",
      "text": "It's not necessarily relevant, but I can’t believe no one's brought up that this is one of the oldest academic questions out there and Socrates even discussed it in his work *Meno*.  His conclusion was that an intuitive understanding of logic and maths is innate. However, his is far from the final word on the topic!",
      "author": "drinkermoth",
      "created": 1599582357,
      "upvotes": 1,
      "replies": {}
    },
    "g4gfj2p": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gfj2p/",
      "text": "Someone else mentioned Khan Academy but I will do a plug for this as well. My kids are homeschooling this year and so I have decided to re-learn elementary math. You could start at second grade in Khan Academy and build your math skills (back) up from fundamentals, and you can probably blast through the first bits really quick. I'm using the Khan Mastery approach to figure out where my strengths and weaknesses are for each grade level, then doing unit tests for each grade unit until I hit Mastery - and if I struggle with a topic, then I'm watching and re-learning using the Khan videos. \n\nI blasted through second grade in about an hour. Same with third grade (although, somewhat embarrassingly, I struggled with a few of the strategies and learned something new!).\n\nIf I were preparing for econ grad work, I'd do this.",
      "author": "joyfulali",
      "created": 1599583694,
      "upvotes": 1,
      "replies": {}
    },
    "g4gk61p": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gk61p/",
      "text": "Anyone can be great at math, if you learn at your own pace, not moving on to the next topic until you have mastered your current level. \n\nMost people who excel at math, were able to learn the concepts at the rate they were taught in school, but you were slower and fell behind, creating gaps in your understanding. \n\nIf you take your time with it, you will be able to be just as good as anyone else. \n\nAlso, utilizing a tutor could work wonders for you.",
      "author": "mrsecurityman",
      "created": 1599586009,
      "upvotes": 1,
      "replies": {}
    },
    "g4gnnmv": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gnnmv/",
      "text": "Math ability is largely predicted by IQ. If you're smart enough to learn complex and demanding non-mathematical subjects, I don't see why excelling in mathematics would be an issue.",
      "author": "ElitistPopulist",
      "created": 1599587763,
      "upvotes": 1,
      "replies": {}
    },
    "g4gq5t2": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gq5t2/",
      "text": "I’m doing my PhD in Maths and would definitely echo everyone else in that it’s something that requires lots of work and practice, it’s not necessarily something you’re born brilliant at. I struggled with Maths as a child and also didn’t have good teachers. When I got to 16 though I had a great teacher and I found myself really getting into it and it all went up from there. Hope everything goes well for you, just put in good amounts of work and practice and you’ll get there! Best of luck :)",
      "author": "catsgloriouscats",
      "created": 1599589026,
      "upvotes": 1,
      "replies": {}
    },
    "g4gq6l6": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4gq6l6/",
      "text": "The math involved in economics is easy compared to many other sciences. Just integral calculus plus prob & stats and maybe some graph theory. You don't need talent for it. Just the discipline to learn it. If you already have an algebra/precalc background, you could do it in a year.",
      "author": "IAmVeryStupid",
      "created": 1599589037,
      "upvotes": 1,
      "replies": {}
    },
    "g4i5uzc": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4i5uzc/",
      "text": "In aspects of research you need all of the following (in ascending order)\n\n1.  Desire\n\n2.  Enjoy your field \n\n3.  Aptitude \n\n4.  Work ethic \n\nAs a note, I’m a very intelligent man, and yet I am more successful than people that make me look like produce because of my work ethic (and communication skills)\n\nTalent can make people lazy, never having adversity can make you soft",
      "author": "k0np",
      "created": 1599615391,
      "upvotes": 1,
      "replies": {}
    },
    "g4fr69b": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fr69b/",
      "text": "I'll add, the opposite of OP's premise is true: there are definitely math-specific learning disabilities and some people are permanently impaired despite being normal or above average in most other domains.",
      "author": "TurnsOutImAScientist",
      "created": 1599570216,
      "upvotes": 1,
      "replies": {}
    },
    "g4g6qia": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4g6qia/",
      "text": "I teach gifted students.  I can tell you it's a lot like athleticism.  You are born with some innate tallent, and then you can choose to develop it or not, but some people will never be as good as others, no matter how hard they try.  Gauss, Euler etc. were born like Michael Jordan or Shaq.  They also trained, but they did definitely have innate abilities.\n\nI have students that were multiplying large numbers by age 4.  Doing calculus and linear algebra by age 11.  They instantly understand every topic.  They did not train this ability, they were born with it.\n\nBut I have students of varying different ability levels all improve.  Your natural talent weights the dice in favor success in math, but you get to decide how hard you want to work to overcome whatever natural limitations you have.",
      "author": "bjos144",
      "created": 1599579162,
      "upvotes": 1,
      "replies": {}
    },
    "g4fcncc": {
      "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fcncc/",
      "text": "Maths",
      "author": "Matt14451",
      "created": 1599556944,
      "upvotes": -7,
      "replies": {
        "g4fcp45": {
          "link": "/r/AskAcademia/comments/ioq05h/is_math_a_skill_you_are_born_with_or_something/g4fcp45/",
          "text": "Thanks",
          "author": "sammin4932",
          "created": 1599556999,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}