{
  "sid": "qikvql",
  "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/",
  "title:": "Is it normal for it to take a while for your research assistant position to take a while to start?",
  "text": "About two weeks ago, I was offered an amazing research assistant position at a lab. In the acceptance email, they asked me to respond within a week so that we could \"get the ball rolling\". I responded that same day. A week and a half later, I emailed to check in about the onboarding process and still haven't heard back. Should I be concerned? Might they have taken my offer off the table?\n\nI apologize for the typo in the question!",
  "author": "Dobbyssockpleaseth",
  "created": 1635537006,
  "updated": 1635779294,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hijz6l2": {
      "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hijz6l2/",
      "text": "Universities and bureaucracies move slowly. University bureaucracy just compounds that.",
      "author": "CerebralBypass",
      "created": 1635537154,
      "upvotes": 22,
      "replies": {
        "hik0zf1": {
          "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hik0zf1/",
          "text": "[deleted]",
          "author": null,
          "created": 1635537840,
          "upvotes": 1,
          "replies": {
            "hik13xg": {
              "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hik13xg/",
              "text": "Think you meant to reply to the OP - not my comment.",
              "author": "CerebralBypass",
              "created": 1635537888,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hik14aw": {
      "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hik14aw/",
      "text": "You didn’t give a lot of details, so I’m going to make an assumption that it’s an academic lab run by a PI. If it’s a top-tier research group particularly, the PI is probably coordinating with you himself right now, offering the position and will do the administrative things later. Top lab PI‘s can often get hundreds of emails a day, which they normally don’t have an assistant for.\n\nMy guess is one of three things. They either missed it, opened it and forgot about it, or opened it and started doing administrative things to hire you but forgot reply to your email. In any case I would just sent another polite email asking if they have any information for you.",
      "author": null,
      "created": 1635537892,
      "upvotes": 14,
      "replies": {
        "hik1i1x": {
          "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hik1i1x/",
          "text": "I sent a follow-up email yesterday so hopefully they will get back to me soon. I'm just scared that they somehow decided to revoke my offer or something of that nature, but your explanations make much more sense!",
          "author": "Dobbyssockpleaseth",
          "created": 1635538040,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hik8zr5": {
      "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hik8zr5/",
      "text": "They haven't sent you the contract yet and you're asking about onboarding?\n\nYou need to negotiate your salary and start date first before they can send you details about onboarding. A week and half is really not much time at all. It sounds like you're able to start immediately but remember most of the people they recruit will have notice periods and people often can't start their jobs for several weeks to months. This means HRs are keen to get your acceptance ASAP so they can get the paperwork started but once that happens they don't generally need to move very quickly as most people can't start straight away. Also university HR teams are generally massively under-resourced while handling extremely complex recruitment - lots of visas, secondments, visiting workers, and the start-up packages of faculty. Unfortunately, junior roles tend to not get priority.",
      "author": "ACatGod",
      "created": 1635541024,
      "upvotes": 5,
      "replies": {
        "hikl99b": {
          "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hikl99b/",
          "text": "It's an unpaid position so there isn't any need to negotiate salary or anything like that, but it's good to know that it typically takes a while!",
          "author": "Dobbyssockpleaseth",
          "created": 1635546193,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hilbz0v": {
      "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hilbz0v/",
      "text": "When I received my offer letter, I was asked to confirm my decision with the graduate advisor the very next day which also happened to be the start date of the position. After declaring my acceptance, I didn't hear from the supervisor until 1.5 weeks later and I reached out first (I only didn't reach out sooner because I was told by the advisor I'd hear from them). We arranged a time to meet and everything was good, he was just busy.",
      "author": "dionys0s-",
      "created": 1635558840,
      "upvotes": 2,
      "replies": {}
    },
    "hilnqmg": {
      "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/hilnqmg/",
      "text": "I'm in the same situation. It's been more than 2 weeks and I haven't heard back from PI.",
      "author": "__proximity__",
      "created": 1635564809,
      "upvotes": 1,
      "replies": {}
    },
    "himc41y": {
      "link": "/r/AskAcademia/comments/qikvql/is_it_normal_for_it_to_take_a_while_for_your/himc41y/",
      "text": "two weeks is nothing for any hiring process in a large organization! don't fret it!",
      "author": "doornroosje",
      "created": 1635581589,
      "upvotes": 1,
      "replies": {}
    }
  }
}