{
  "sid": "co57kb",
  "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/",
  "title:": "Found my masters dissertation was plagiarised. Where to go from here?",
  "text": "A PhD student from the lab where I did my masters 2 years ago submitted his/her thesis earlier this year, and as I was reading it, I noticed a number of similarities in the writing. I looked back at my dissertation and found a number of sentences and a whole paragraph from the literature review and the conclusions were either very similar or copied word-for-word. His/Her conclusions were drawn from mine because one whole chapter was a repeat of my masters work. Only two small parameters were changed: used Brand B instead of Brand A with the exact same specs and used a different arbitrary constant in the calculation. The end results were virtually identical, so it wasn't like their changes improved what I had done or built on top of the work in my dissertation; it was a repeat without the hurdles of optimising the parameters. Nowhere in the thesis was me or my work acknowledged or referenced.\n\nI don't know what to do. On the one hand, I'm gutted that this happened. I am not confident in my writing at all, and I worked extremely hard to produce a good, coherent literature review and conclusions; I never even discussed my ideas with them, only my supervisor, who must have given them a copy of my dissertation. I knew my work would be in their thesis after I submitted my dissertation because our supervisor said he/she would use it (I learned all this after I graduated). Although I wasn't thrilled about it, I knew to expect it. On the other hand, in the worst case, this is two people's careers at stake, and as angry as I am, I don't believe my masters dissertation is worth two careers.\n\nWhat would you do in this situation?",
  "author": "gold-ukthrowaway",
  "created": 1565370116,
  "updated": 1634080661,
  "over_18": false,
  "upvotes": 215,
  "upvote_ratio": 0.99,
  "comments": {
    "ewg8f35": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewg8f35/",
      "text": "Don't ever let someone take credit for your work. A PhD is a title given to those who have earned it through hard work, dedication, and novel insights to their field. If they can't do their own lit review, they don't get a PhD. \n\nIt's a disservice to you, your field and really that person. How long did it take to write that? How long does it take to copy someone else's ideas and words into a document? You deserve recognition for your work. \n\nDon't email the chair saying this was plagiarized. send both documents,, direct the chair to the plagiarized parts, say you've noticed many similarities and ask him to come to his own conclusions.",
      "author": "EmmasDragon",
      "created": 1565376192,
      "upvotes": 302,
      "replies": {
        "ewghuog": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewghuog/",
          "text": "> send both documents,, direct the chair to the plagiarized parts, say you've noticed many similarities and ask him to come to his own conclusions\n\nThis... I think OP doesn't have to think s/he's going to end 2 careers **just for his/her master thesis**, but they are themselves doing for not following basic research ettiquette: if part of OP's work has been plagariased, what else  might have as well?",
          "author": "the_third_sourcerer",
          "created": 1565382186,
          "upvotes": 124,
          "replies": {
            "ewgw929": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgw929/",
              "text": "Exactly. I've def c+p part of other people's work into my rough draft and I've def handed in the wrong version of something before. I don't think this needs to ruin their career, but it needs to be acknowledged and fixed. Either this was intentional and then I'm sure others would find more examples of this. Or it was a mistake, and OP deserves their citation, and the PhD needs to correct it.\n\nEdit: I'm assuming the level of plagiarism is relatively low, like maybe a c+p'ed paragraph, or sentence or two  and a missing citation, not a 100% ripped off piece of work. Nothing career ruining. \n\nBut if it is career ruining, they did that to themselves. OP isn't going to unjustly ruin someone's career. If it does ruin their career it's because the offense was that serious and people outside of OPs control made that decision.",
              "author": "EmmasDragon",
              "created": 1565391828,
              "upvotes": 25,
              "replies": {
                "ewjli95": {
                  "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewjli95/",
                  "text": ">I'm assuming the level of plagiarism is relatively low, like maybe a c+p'ed paragraph, or sentence or two and a missing citation,\n\nWhat OP describes sounds much more serious than that.",
                  "author": "FermatsLastAccount",
                  "created": 1565468433,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ewgl6wi": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgl6wi/",
          "text": ">Don't email the chair saying this was plagiarized. Send both documents, direct the chair to the plagiarized parts, say you've noticed many similarities, and ask him to come to his own conclusions.\n\nThis is really good advice. Follow it.",
          "author": "johnnydaggers",
          "created": 1565384355,
          "upvotes": 53,
          "replies": {}
        }
      }
    },
    "ewg9txo": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewg9txo/",
      "text": "Speaking as the Research Integrity Officer for my campus, you should definitely report this.  The minor changes and lack of attribution could make this a serious case of academic misconduct.  I recommend that you report it to the Dean of Graduate Studies and VP for Research (or equivalents) at your university.  They are the most appropriate people and will definitely follow up on it.",
      "author": "bigrottentuna",
      "created": 1565377089,
      "upvotes": 96,
      "replies": {
        "ewgilk1": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgilk1/",
          "text": "Thank you so much for your thoughts and advice. It’s very reassuring to know I’m not making a mountain out of molehill. If I can ask, realistically, what are the possible outcomes? I’ve considered “What do I hope to achieve in reporting this?”, and the truth is I really don’t know, partly because I don’t even know what *could* happen.",
          "author": "gold-ukthrowaway",
          "created": 1565382670,
          "upvotes": 30,
          "replies": {
            "ewgkidb": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgkidb/",
              "text": "Assuming they determine it to be plagiarism, they also have to decide who was responsible, how extensive it was, how much it contributed to the dissertation, how intentional it was, and ultimately how serious of a problem it was.  Possible consequences for your advisor range from nothing to some sort of administrative penalty.  He is highly unlikely to be fired or lose his job.  Possible consequences for the Ph.D. student range from nothing to being required to revise the dissertation to having the Ph.D.  revoked.  It really all depends on how serious it is determined to be.  \n\nMy gut suggests that your work was related to and part of a larger project that was the Ph.D. student’s work, and that you did a piece of that work and produced some results within that context.  In that situation, it is common to include those results in the dissertation.  It is improper to include someone else’s text directly (unless from a coauthored paper), and very improper to have done either without appropriate attribution.  The part where they changed some details could represent falsification of results, which would itself be a very serious problem.",
              "author": "bigrottentuna",
              "created": 1565383914,
              "upvotes": 37,
              "replies": {
                "ewgp69k": {
                  "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgp69k/",
                  "text": "Thank you so much for your detailed replies! This answers my question perfectly. And yes, your hunch is correct, my work was part of a larger project with the group.",
                  "author": "gold-ukthrowaway",
                  "created": 1565387056,
                  "upvotes": 8,
                  "replies": {
                    "ewgtfl0": {
                      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgtfl0/",
                      "text": "You're welcome.  Given my position, I occasionally end up thinking a lot about these issues.",
                      "author": "bigrottentuna",
                      "created": 1565389994,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                },
                "ewgmcu4": {
                  "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgmcu4/",
                  "text": "I've also been advised that copying sentences from your own prior work counts as self-plagiarizing and should be avoided. It is okay to paraphrase what you already published.",
                  "author": "Cantos",
                  "created": 1565385143,
                  "upvotes": 7,
                  "replies": {
                    "ewgnyxp": {
                      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgnyxp/",
                      "text": "It depends on the context.  It is common for a dissertation to contain verbatim portions of one's own publications, and vice versa (of course).  The issue when it comes to publications is that you are representing your submission as entirely original unpublished work.  If you submit a paper that contains verbatim portions of another publication (yours or someone elses's), that representation is false.  But even that rule is not 100% black and white because, for example, with technical papers it is not uncommon for people to reuse snippets of a related work section from one of their own prior papers and nobody cares because that section is not expected to represent novel work.  In any case, it is ok to paraphrase your own prior publications, but anything important should be cited just like you would cite anyone else's prior work.",
                      "author": "bigrottentuna",
                      "created": 1565386234,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ewgr9te": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgr9te/",
          "text": "It seems to me that an added benefit of going to the RIO is that OP can stay out of it more and let the chips fall where they may.  Going to the chair may result in fallout to OP.",
          "author": "fetch04",
          "created": 1565388531,
          "upvotes": 8,
          "replies": {
            "ewgrqj4": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgrqj4/",
              "text": "I agree 100%.  Plus Chairs may have great intentions, but do not necessarily know what they are doing with situations like this.",
              "author": "bigrottentuna",
              "created": 1565388861,
              "upvotes": 8,
              "replies": {}
            },
            "ewgttff": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgttff/",
              "text": "From personal experience... Skip discussing within your department, go directly to the RIO. Fallout and retaliation is not uncommon.",
              "author": "CyclotronOrbitals",
              "created": 1565390237,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "ewfzkst": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewfzkst/",
      "text": "I would wait for more feedback from other people, but one thing I think is that, if you end up writing to someone, you should write to the university's ethics officer, dean of students, or someone similar. Whoever is in charge of investigating academic dishonesty. I say this because the PI and the department head might ignore your email if they don't want to deal with such a messy and serious issue. The dean of students (or whatever their title might be in your case) would probably not ignore it because investigating such things is part of their job. And someone should be copied into the email so that at least two people get it, but I'm not sure who that should be.\n\nI'm in the humanities, so my thoughts might be contradicted by others who know your discipline better.",
      "author": "user963852",
      "created": 1565370657,
      "upvotes": 49,
      "replies": {
        "ewghg20": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewghg20/",
          "text": "Thanks, these are all really good ideas; I think if I do pursue this, I will follow this route!",
          "author": "gold-ukthrowaway",
          "created": 1565381920,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ewfz5g3": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewfz5g3/",
      "text": "I would go talk to the department chair about it, and ask for guidance on what to do next.",
      "author": "Weaselpanties",
      "created": 1565370413,
      "upvotes": 36,
      "replies": {}
    },
    "ewg03tl": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewg03tl/",
      "text": "If they’ve plagiarized you, they’ve likely plagiarized others, and will continue to do so. \n\nIt’s possible that your advisor takes some credit for your thesis as they likely heavily edited and maybe even re-wrote some of it (like, reworded sentences to clarify or something), but you should still at least be referenced.\n\nIf your advisor caught you plagiarizing they could have kicked you from the program, so in that sense your thesis was worth at least one career. \n\nI agree with the other poster that you should say something to someone. Maybe you don’t need to outright make any accusations yet. It’s possible some accident happened somewhere but it sounds like, best case, someone was lazy with editing and references and, worst case, two people are actively plagiarizing you. Neither is great.",
      "author": "thebly",
      "created": 1565370970,
      "upvotes": 42,
      "replies": {
        "ewg87we": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewg87we/",
          "text": "In your best case scenario, how is this an editing mistake? As in, someone may have inserted OPs work as some sort of guide for whatever prices they were working on and said to model off of that? Best case scenario here sounds like one person was hoping to not get caught copying OPs work. Worst case scenario is two people know they’re plagiarizing.",
          "author": "b0wie_in_space",
          "created": 1565376066,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "ewgagqq": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgagqq/",
      "text": "Two careers? You mean the thesis supervisor? Unless he was expected to specifically identify this plagiarism which I assume standard software didn't catch, I don't think it would upend their career.\n\nI certainly think you should report this person. Document the plagiarism, take it to the department head and show it to them. If you're getting the sense that the department doesn't really care, you can choose to go above their heads and take it to your University authorities directly. Typically this would be someone such as the Dean of ethics, the university honour team or whoever is incharge of research studies.\n\nPS: I just want to say, as someone who's work has been plagiarized (though it was a program thesis) it's ok to feel violated. Academic work is time consuming and to some extent soul draining. We literally put ourselves into our research. It's ok to be upset by someone cutting corners and skating in on your work.",
      "author": "boringhistoryfan",
      "created": 1565377497,
      "upvotes": 13,
      "replies": {
        "ewgjlv1": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgjlv1/",
          "text": "Thank you so much, you hit the nail on the head. It does feel violating, in a way I’d never expect. \n\nI guess I am thinking of the supervisor as well because they would have known that a chapter and its conclusions were a repeat of (very least, based on) their masters student’s work, and it’s strange it wasn’t referenced, mentioned or acknowledged at all.",
          "author": "gold-ukthrowaway",
          "created": 1565383329,
          "upvotes": 5,
          "replies": {
            "ewgjxan": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgjxan/",
              "text": "TBH I doubt it would matter. The professor would very likely simply say he didn't remember and thus didn't realize. Unless anyone could show he knew, I doubt his career would get affected. On the other hand if he *did* know and winked at it, he deserves the penalties.\n\nYou found your work was plagiarized. You should report it. You aren't responsible for the consequences other people suffer from their own actions. Beyond reporting it there's no burden of responsibility on you.",
              "author": "boringhistoryfan",
              "created": 1565383533,
              "upvotes": 9,
              "replies": {}
            },
            "ewgl0wu": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgl0wu/",
              "text": "[deleted]",
              "author": null,
              "created": 1565384244,
              "upvotes": 2,
              "replies": {
                "ewgmkpi": {
                  "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgmkpi/",
                  "text": "Oh absolutely, I don’t feel that repeating the work itself is the plagiarism. However, in repeating the work and getting the same results, I am upset that they took verbatim lines from my conclusion and discussions and presented those as their own original ideas to describe the results. \n\nI suppose I thought our supervisor would have noted that it said nothing about “these results are supported by previous observations” etc.",
                  "author": "gold-ukthrowaway",
                  "created": 1565385288,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ewh6r75": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewh6r75/",
      "text": "Prediction: the supervisor knows about and suggested these actions. I hate to say it, but I think it is likely the supervisor recommended, in particular, the use of Brand B instead of Brand A. There is enormous pressure to produce. The supervisor wants the student to complete the MS thesis and start to work on the PhD. \n\nI sincerely hope I am wrong.",
      "author": "janemfraser",
      "created": 1565399392,
      "upvotes": 6,
      "replies": {}
    },
    "ewgjvh9": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgjvh9/",
      "text": "Email your former supervisor and mention that you noticed something concerning and show him the problems.  He most likely did not notice the word for word repetition.  Compile all the similarities and send it along.  Let him go from there.",
      "author": "engelthefallen",
      "created": 1565383502,
      "upvotes": 3,
      "replies": {}
    },
    "ewggdqe": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewggdqe/",
      "text": "Does your university not use plagiarism checking software? It is baffling to me that that at the very least didn't pick this up.\n\nBeyond that though, there is a difference between basing a chapter of your thesis off of someone else's work, and straight up lifting from that work. The first is basically how a lot of research develops, the latter is (as you identified) straight up plagiarism, and should be reported to whomever in the university is responsible for research ethics and integrity. What they decide to do with that information is on them, but for your sake, your department's sake, and honestly the sake of everyone who honestly earned their PhD, please don't let this slide.",
      "author": "foibleShmoible",
      "created": 1565381236,
      "upvotes": 2,
      "replies": {
        "ewglf8x": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewglf8x/",
          "text": "For a PhD thesis? Don't you think that's unlikely because the level of trust inherent to a PhD student in a department is way beyond that? That's also why plagiarism in a thesis is grounds for dismissal from the program and destroys your entire career if you are dishonest enough to try it.",
          "author": "johnnydaggers",
          "created": 1565384511,
          "upvotes": 3,
          "replies": {
            "ewgp7bn": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgp7bn/",
              "text": "At my PhD institution and the one I currently work at an electronic copy of the thesis is submitted along with a hard copy, to be run through Turnitin (or similar).\n\n> plagiarism in a thesis is grounds for dismissal\n\nHence why we check.\n\n> trust inherent to a PhD student\n\nis nice and all, but posts like this demonstrate why plagiarism checking is a good idea. One that also doesn't really cost anyone time or effort, but is an extra protection to keep everyone honest.\n\n\nEdit: Also, happy cake day!",
              "author": "foibleShmoible",
              "created": 1565387076,
              "upvotes": 3,
              "replies": {}
            },
            "ewgx0qb": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgx0qb/",
              "text": "In my faculty, grad students have to take a short course in ethics as part of their degree requirements. You would not believe how many of them cheat on the test. It's awful.",
              "author": "ohkatiedear",
              "created": 1565392365,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ewgj8fy": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgj8fy/",
      "text": "I don't have any additional advice other than what's been presented here, but just wanted to say I'm sorry this happened to you, and please keep us updated!",
      "author": "yayhazelnuts",
      "created": 1565383086,
      "upvotes": 2,
      "replies": {
        "ewgkx7v": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgkx7v/",
          "text": "Thank you! I have a meeting with my PhD supervisor next week, and will discuss with her before making any moves",
          "author": "gold-ukthrowaway",
          "created": 1565384178,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ewhahvq": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewhahvq/",
      "text": "Talk to your PI about it. Tell him you want to report it. See what he says. The copy that was didn't have to come from your PI. Your school's library has your dissertation. Unless you signed a specific form when you submitted dissertation, it is likely ProQuest has a copy they will sell anyone for $40. If you PI did provide the copy, they probably never thought that it would be plagiarized. They will likely be horrified to find out.",
      "author": "writtenexam",
      "created": 1565402384,
      "upvotes": 2,
      "replies": {}
    },
    "ewgirmk": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgirmk/",
      "text": "Having lurked on r/legaladvice for years, I'm confident that community would scream one thing: save everything you can. You likely currently have multiple documents whose metadata shows when you were working on the later-plagiarized passages. If this other person says \"OP plagiarized me. I bet our professor shared my work with them!\" you'll have evidence that your work predates theirs.",
      "author": "dcgrey",
      "created": 1565382780,
      "upvotes": 3,
      "replies": {
        "ewgkvdg": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgkvdg/",
          "text": "[deleted]",
          "author": null,
          "created": 1565384144,
          "upvotes": 8,
          "replies": {
            "ewivd9t": {
              "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewivd9t/",
              "text": "Ha, yes, looks like I read right past the first sentence. I guess my generalized advice then would be to have all of this kind of documentation (submission info, email exchanges, and document metadata) organized, backed up, and at hand.",
              "author": "dcgrey",
              "created": 1565457354,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ewgkrj4": {
          "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewgkrj4/",
          "text": "Haha, yes I have pdf copies of my dissertation submitted two years ago, timestamped raw data files, and backed up emails with our supervisor discussing the PhD student taking on my data for his/her thesis.",
          "author": "gold-ukthrowaway",
          "created": 1565384076,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ewk6fqw": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewk6fqw/",
      "text": "There is a lot of good advice here.\n\nI'm in the UK and we don't routinely screen PhD theses on TurnItIn etc. Too big a job and it is assumed that such plagiarism would be caught by examiners/in a viva.\n\nYou are totally within your rights to bring this up formally. However, it might also be worth asking what happens if you don't. Not long after my PhD, a student a year or two behind me, who I had helped quite a lot, published a paper. When I read said paper I realised that it copied portions of my thesis, some just the structure, but also an appendix which was verbatim code, used without attribution. Was I angry? Yes. I complained to our supervisor (a co-author), with whom I was on good terms. He should have known, but like many busy PIs he hadn't realised. He apologised and had already fallen out with the plagiariser.\n\nI could have taken it further, but the truth is that the person in question was never going to go far. She became a lecturer, but it ended badly (some gossip there I heard!). I knew that she was not technically very capable and unlikely to have a successful career. Our paths were unlikely to cross again. So I let it slide and haven't regretted it.",
      "author": "another_secret_prof",
      "created": 1565477158,
      "upvotes": 1,
      "replies": {}
    },
    "ewhkpym": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewhkpym/",
      "text": "I'm going to take a very different perspective than everyone else here: as for the literature review - if you are both working on the same subject your lit review should be similar. It might be that this paragraph was so heavily edited by the PI for both of you that it came out the same. I think that part you can breathe easy about and take as a silent compliment on your writing skills.\n\nThe more problematic part is the results and the conclusions. The question is did he do all the work too? Did your PI help both of you with the results? Was this data published in a peer reviews journal?\n\nI think since things written an a masters dissertation will very likely not be read by anyone ever (sorry) there's a low level of repetition that's acceptable so the work you did can get out there (which is the point in science, no?).\n\nBottom line - I think you should contact your former PI and tell him you think you should be acknowledged and your thesis referenced.\n\nDon't think that anybody would think there's even a slight possibility that it wasn't you if this gets reported and that can have fallout for you.\n\nTo plagiarize Leonidas from \"300\": \"THIS. IS. SCIENCE!!!\"",
      "author": "justryingtokeepup",
      "created": 1565411262,
      "upvotes": 1,
      "replies": {}
    },
    "ewhq5bv": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewhq5bv/",
      "text": "This is fairly clear cut, if what you are writing is more or less factual. You can also just invoke your supervisor.",
      "author": "atypic",
      "created": 1565417184,
      "upvotes": 1,
      "replies": {}
    },
    "ewhcfox": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewhcfox/",
      "text": "Was your master thesis original research or was it based on a program? Was is your idea? Is it the same advisor? \n\nIt's common in some places for a PhD Student work with other research fellows, usually doing their master work, and for the PhD Student to gather all of their work and make it something more. Of course not changing brands but using more brands. You used A the PhD will use A, B, C and D and compare all.\n\nWhat I find weird is the lack of reference to your work",
      "author": "zzay",
      "created": 1565403940,
      "upvotes": 0,
      "replies": {}
    },
    "ewhptvs": {
      "link": "/r/AskAcademia/comments/co57kb/found_my_masters_dissertation_was_plagiarised/ewhptvs/",
      "text": "Does your University have a Vice President for ethics and compliance? You should definitely file a formal complaint. The reputation of the University is also at stake here, so they should take this seriously.",
      "author": "barbaricattax",
      "created": 1565416811,
      "upvotes": 0,
      "replies": {}
    }
  }
}