{
  "sid": "qxj3oo",
  "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/",
  "title:": "How to handle publishing after name change?",
  "text": "I am what someone might call an early-mid carreer scientist. I have a respectable number of publications and I like to believe that my name is known in my community. Despite that, I will be marrying next March and I plan to take on my SO's last name. Should I publish future papers with my new name? (It is tremedously easier to read and pronounce for an international audience). Shall I email everyone I know about my name change? Is it legit (and pratical) to keep my old name for scientific publications? How did people in my situation handle this?",
  "author": "badIRONmole",
  "created": 1637337224,
  "updated": 1637353645,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hl9nvgu": {
      "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/hl9nvgu/",
      "text": "Get an ORCID number, it tracks all your publications regardless of the name you use.",
      "author": "brianwat6",
      "created": 1637337766,
      "upvotes": 13,
      "replies": {
        "hl9r952": {
          "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/hl9r952/",
          "text": "I got that already. It's just... people don't click on the ORCID icon but read the authors' names.\n\nEDIT: position of apostrophe",
          "author": "badIRONmole",
          "created": 1637339115,
          "upvotes": 5,
          "replies": {
            "hla2974": {
              "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/hla2974/",
              "text": "You're correct. The ORCID will help with most things that track your publications but it will not transfer the reputation you have already build up to your new name. Informing collaborators of the name change would help a bit but you'll always lose some of that \"oh, that person is really active in X area\" effect. \n\nMost people I know in this situation just stuck with their maiden name. It's obviously your decision but if you don't have strong feelings either way, I'd strongly recommend sticking with the name under which you started publishing. It's common and not much different than authors or artists being known by names other than their legal names.",
              "author": "Timguin",
              "created": 1637343425,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hl9pm3b": {
      "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/hl9pm3b/",
      "text": ">Should I publish future papers with my new name?\n\nIf you'd like to. Regardless, getting an ORCID account is a good idea.\n\n>Shall I email everyone I know about my name change?\n\nI wouldn't send an email explicitly for this purpose, though I have seen people change the name in their email signature to something like: FirstName NewLastName (OldLastName).\n\n>Is it legit (and pratical) to keep my old name for scientific publications? How did people in my situation handle this?\n\nI know female faculty in my departments who kept their name in the professional world, but do change the name personally.",
      "author": "poniesgirl",
      "created": 1637338463,
      "upvotes": 4,
      "replies": {}
    },
    "hl9qy0f": {
      "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/hl9qy0f/",
      "text": "It's largely up to you. I know some people who still publish under their maiden name, others who have switched to their married names. As others said, an ORCID ID helps to link everything together anyway.",
      "author": "Broric",
      "created": 1637338991,
      "upvotes": 2,
      "replies": {}
    },
    "hladywq": {
      "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/hladywq/",
      "text": "I published in FirstName LastName and then after I got married I just added my married name to the end professionally - FirstName LastName MarriedName. \n\nMeans that for new publications my old full name is still there.\n\nI know people who have just continued publishing in their old name and used that professionally and their married name socially and it’s totally legitimate.",
      "author": "EllieMRoberts",
      "created": 1637347868,
      "upvotes": 2,
      "replies": {}
    },
    "hl9nm3n": {
      "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/hl9nm3n/",
      "text": "Following because I’m about to publish two papers and am getting married in a year and really don’t know what to do!",
      "author": "Pleistoqueen",
      "created": 1637337658,
      "upvotes": 2,
      "replies": {}
    },
    "hlafbha": {
      "link": "/r/AskAcademia/comments/qxj3oo/how_to_handle_publishing_after_name_change/hlafbha/",
      "text": "A lot of academics I have met continue to publish under their maiden name/use it for academia and use their married name for other life areas. You can also go the hyphenated route?",
      "author": "Substantial_Pilot759",
      "created": 1637348350,
      "upvotes": 1,
      "replies": {}
    }
  }
}