{
  "sid": "p5lywx",
  "link": "/r/AskAcademia/comments/p5lywx/postmasters_advice_uk/",
  "title:": "Post-Masters Advice (UK)",
  "text": "Last year I finished my (taught) masters degree, and am now finding myself missing the academic world and wanting to continue studying (or start working in academia). However, I’m not quite sure where to go from here and would really appreciate some advice! \n\nNow with an undergrad and postgrad loan, I can’t afford to keep paying for more degrees. However, I’m unsure I’d get a place on a funded PHD because my Masters was a taught one and not research based. I assume I’m unable to start working in academia unless I have, or am completing, a PHD? \n\nDoes anyone have any suggestions on where to go from here? \n\nIf relevant, my undergrad degree was a BA (Hons) in Early Childhood Education and my postgrad was a MA in Social and Public Policy. I currently work as a Family Support Coordinator. \n\nThanks in advance",
  "author": "crinklecut6489",
  "created": 1629138443,
  "updated": 1634079580,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "h971lqf": {
      "link": "/r/AskAcademia/comments/p5lywx/postmasters_advice_uk/h971lqf/",
      "text": "You generally don't need a master's to get on a funded PhD in the UK and a master's taught or otherwise will stand you in good stead for getting a place. However, just so you're clear a PhD isn't studying.",
      "author": "ACatGod",
      "created": 1629141973,
      "upvotes": 5,
      "replies": {
        "h9gijst": {
          "link": "/r/AskAcademia/comments/p5lywx/postmasters_advice_uk/h9gijst/",
          "text": "Really? Sciences perhaps not, but social sciences and humanities, even at somewhere less prestigious, you'd pretty much tank your chances of receiving full funding by not having a Master's, even with a First with a First in your distinction. For DTP finding, you wouldn't even be eligible to apply for +3 funding.",
          "author": "Fluffy_Ad2274",
          "created": 1629323634,
          "upvotes": 1,
          "replies": {
            "h9jsxli": {
              "link": "/r/AskAcademia/comments/p5lywx/postmasters_advice_uk/h9jsxli/",
              "text": "My DTP is funded by the ESRC, they do a variety of combinations of 1+3, 1+4 etc, +3...",
              "author": "giraffesaurus",
              "created": 1629390341,
              "upvotes": 1,
              "replies": {
                "h9jtbr8": {
                  "link": "/r/AskAcademia/comments/p5lywx/postmasters_advice_uk/h9jtbr8/",
                  "text": "Yes, they do indeed - but to get a +3, a Master's degree is a prerequisite. 1+3 you can apply straight from BA, as that's what it's designed for - but not a +3.(Obviously, that doesn't mean people don't still apply :-D)",
                  "author": "Fluffy_Ad2274",
                  "created": 1629390497,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h99xmjk": {
      "link": "/r/AskAcademia/comments/p5lywx/postmasters_advice_uk/h99xmjk/",
      "text": "tbh missing studying is rarely a good reason to get a PhD. You may simply need a nice vacation.",
      "author": "thegreenaquarium",
      "created": 1629198430,
      "upvotes": 2,
      "replies": {}
    },
    "h99pr85": {
      "link": "/r/AskAcademia/comments/p5lywx/postmasters_advice_uk/h99pr85/",
      "text": "Good news is that a taught MSc won't really affect admissions either way. The bad news is that it is very difficult to get a funded PhD social science posistion in the UK. Departments might only have one or two scholarship posts a year. There are funded PhDs, but they are project based so you have to find a project that is appealing to you and which you're qualified for.",
      "author": "bad_jew",
      "created": 1629192361,
      "upvotes": 1,
      "replies": {}
    }
  }
}