{
  "sid": "p5zu6i",
  "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/",
  "title:": "Are industrial PhDs funded completely by the company?",
  "text": "Or are they funded partly also by the academic partner?\n\nI am planning to cofound a startup in Germany but also want to do a PhD. The startup doesn’t have any funding as of now and so cannot fund my PhD. I want to know if it is generally possible to find an industrial PhD position which is also partly funded by the university.",
  "author": "zshn25",
  "created": 1629189752,
  "updated": 1634079574,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "h99pzx3": {
      "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h99pzx3/",
      "text": "[deleted]",
      "author": null,
      "created": 1629192564,
      "upvotes": 16,
      "replies": {
        "h99qnjm": {
          "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h99qnjm/",
          "text": "That sounds like the most likely case. Thank you for the heads up.",
          "author": "zshn25",
          "created": 1629193107,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h99qlax": {
      "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h99qlax/",
      "text": "It depends, at the universities I've been involved in its a percentage (have seen ranges from 20-80% funded by the company) and is usually part of determining IP rights to any results, findings etc",
      "author": "IntLawprof",
      "created": 1629193054,
      "upvotes": 7,
      "replies": {}
    },
    "h99tmuf": {
      "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h99tmuf/",
      "text": "German universties consider PhD students 'research workers' and mostly pay the normal wage of about 50k euro yearly. The tech positions are mostly 100%\n\nFraunhofer offers about 65% so part time.\n\nIf a company takes you as a PhD you are treated like a normal worker.\n\nThere are also some programms founded by the ministry of education. The students do a start up that is supervised by the university and get monthly about 1200 Euro for their living expenses. I remeber seeing documents regarding that when working as a HiWi in the industrial machines departament, but I cannot recall the name of the programm. I think you can look under something like Existenzgründung Studenten, maybe you will find it. Then I recommend contacting either the specific faculty of the university or the local Studierendenwerk.",
      "author": "faultierin",
      "created": 1629195502,
      "upvotes": 8,
      "replies": {}
    },
    "h9aqrmk": {
      "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h9aqrmk/",
      "text": "If your goal is to eventually build your own startup, I would reconsider joining Fraunhofer (or other part-industry-part-research institutes that serve as the \"link between universities and industries\" in Germany). Some good reading:\n\nhttps://www.businessinsider.de/gruenderszene/business/vorwuerfe-fraunhofer-startups/\n\nOther institutions (TU Munich instantly comes to my mind, you might want to google \"tu münchen entrepreneur\") offer way better conditions.\n\nIf you have any further questions, send me a message. I have done some extensive reading regarding this particular question.",
      "author": "theta4-7",
      "created": 1629212843,
      "upvotes": 4,
      "replies": {
        "h9bpyyn": {
          "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h9bpyyn/",
          "text": "That article you linked speaks against research institutions in startup regard. And with my experience, it was very similar. These institutions really disincentive any kind of success and are greedy, which is very surprising keeping in mind that most of these are public universities",
          "author": "zshn25",
          "created": 1629229318,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "h99nl2z": {
      "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h99nl2z/",
      "text": "Not sure how it is in Germany specifically but my understanding is that industry researchers won't get academic funding unless they are approved for a specific project, to which they'll compete with academics that will almost certainly be preferred to the apots",
      "author": "lucsampaio",
      "created": 1629190526,
      "upvotes": 2,
      "replies": {}
    },
    "h9auwzr": {
      "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h9auwzr/",
      "text": "Often it's funded from the same place academic funding comes from - research funders. They have specific industrial programs where there is a company and a university co-supervising the student, with the funding be administered by the university (ie one university, multiple commercial partners). You need a degree awarding body involved, which companies aren't.",
      "author": "ACatGod",
      "created": 1629214520,
      "upvotes": 2,
      "replies": {
        "h9bn6qb": {
          "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h9bn6qb/",
          "text": "Are the industrial partners predetermined then? Is it possible for my startup to be a part of this cooperation somehow?",
          "author": "zshn25",
          "created": 1629228141,
          "upvotes": 1,
          "replies": {
            "h9bnhki": {
              "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h9bnhki/",
              "text": "I'm not sure. I think your best bet is to get your compa y to approach some local universities to see what they're open to.",
              "author": "ACatGod",
              "created": 1629228268,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h9a059f": {
      "link": "/r/AskAcademia/comments/p5zu6i/are_industrial_phds_funded_completely_by_the/h9a059f/",
      "text": "For UK EngD's, where the topics/problems essentially come from industry (as opposed to abstract, BlueSky queries), the partnering company contributes to the stipend\n\nIn my case, I received £1583 a month in 2019. £150 was from industry, and £150 was from another funding body, which was a charity that funds research into metal castings. The rest came from the research council (EPSRC)\n\nThis increased to about £1670 a month from 2017, and the ratios remained the same.\n\nIn my case, my sponsoring company ceased to exist xD. Fortunately, however, the other contributing funding body agreed to make up for it, so I received the same stipend amount",
      "author": "Energia91",
      "created": 1629200084,
      "upvotes": 1,
      "replies": {}
    }
  }
}