{
  "sid": "qcmfg8",
  "link": "/r/AskAcademia/comments/qcmfg8/how_do_you_balance_your_personal_writing_process/",
  "title:": "How do you balance your personal writing process with external expectations?",
  "text": "TLDR: COVID and self-doubt have put me behind in my dissertation progress and my advisor is putting pressure on me to catch up. Recent improvements to my writing habits have given me a better sense of what my writing process is, but it's not super conducive to the particular types of writing my advisor wants to see, or to the types of timelines he sets. I want to honor my process (because I work faster and better that way) while still meeting his expectations so that he can give me more regular feedback and I don't appear to be lazy or a flake. Does anyone have tips for managing these two sets of expectations and/or for communicating better with my advisor about my needs?  More details on my process and his advising style below. (Sorry for the novel 😬). \n\nI'm a current PhD candidate writing my dissertation in a literature discipline. I defended my prospectus in May 2020, so right at the beginning of COVID. Since then,  I've been running into ongoing struggles around the writing/research process.   I would estimate that COVID limitations put me behind about a semester (online teaching and limited library resources meant that I got very little done until I went on fellowship this past spring). I generally work pretty well with my advisor when I meet with him. He believes in my project and offers constructive feedback while also helping me with certain organizational issues I've faced. However, I still haven't figured out the best way to advocate for myself in our meetings and I struggle to work according to the timeline and goalposts he suggests for me.\n\nI have been struggling with morale because I have been working on my first chapter for about 9 months now and am making slow progress. I joined a writing accountability group this summer and have been writing consistently for several hours each day in addition to planning tasks.  I typically really struggle with organization during the early stages of a big research project, so  in that regard I'm not surprised that it's taking me a long time to do this chapter. My process tends to require a lot of muddling around in the planning phases. I can write discrete fragments of drafts and a general argumentative arc, but it's difficult to arrive at a full-length, cohesive draft until fairly late in the writing process. At that point, I still need more revisions, but those go much faster and are much easier to accomplish. Before that, my early drafts consist of these fragments (some well-written, some sketches) and lots of outlines and free writing to maintain a grasp on my broader argument. I've been having a lot of success with this approach now that I'm writing every day and am trying to lean into it, since when I try to force myself into something different I tend to get paralyzed and get nothing done. My approach and framework have changed significantly since I started, I landed on a new and better structure for the project, and I feel genuinely excited about my ideas and my work for the first time in ages. \n\nHowever, I am struggling to balance these feelings of personal accomplishment with external expectations from my advisor and department.  My university extended normative time to degree by a year so I have about a year and a half left before the funding situation becomes more dire. Obviously my advisor is trying to push me along so I can move on to my second chapter. When I meet with him, he is very helpful, but he prefers when I send full, structured drafts, and the timelines he suggests for those are not realistic in the early stages due to the process I described above. I've sent him my earlier fragments for feedback and he always says \"these are good ideas but they need structure/a strong argument/etc., which i obviously know because that is my process.\" I am reluctant to send him the fragments anymore because he clearly stated that he wants a whole, cohesive chapter with an argument, etc. I also feel terrible each time I miss an arbitrary goalpost or send unpolished fragments instead of the full shiny thing he wants and I promised. I end up scrambling to try to finish and getting paralyzed conceptually because I can't force it. I also waste valuable time for reading, side projects, and other research tasks.\n\n\nNow that  I'm finally within a week or two of sending him the full thing, 6 weeks after he wanted it, but I want to avoid this cycle in the future. I want to get in the habit of setting clear writing goals that work with (rather than against) my natural process so that I don't have the constant feelings of guilt and anxiety each time I miss a soft deadline or turn in something incomplete.  I want to find ways to articulate these concerns to him without appearing to be flaky or making excuses for late/incomplete work. I know that in the real world there will be hard deadlines for publications, but I will also have way more practice in managing projects of this scope.\n\nI just wondered if anyone on here has any advice for how I can raise these concerns with my advisor and negotiate a system where I can hopefully still check in with him regularly and show him writing. I also wondered if anyone has personal tips for how you balance your own writing process with the expectations of the academic clock?  I obviously don't want to work too slowly, but I also believe I produce higher quality work more efficiently when I lean into my process rather than resisting it.",
  "author": "bely_medved13",
  "created": 1634801787,
  "updated": 1634849151,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhidrz4": {
      "link": "/r/AskAcademia/comments/qcmfg8/how_do_you_balance_your_personal_writing_process/hhidrz4/",
      "text": "I would ignore advice from outside the humanities on this because writing varies so greatly across disciplines. Unsurprisingly reddit skews STEM, so this is probably not the best place to be asking this question. Consult some trusted colleagues in your program. If your university has a writing center, they'll likely organize writing workshops by discipline. Those are a great resource to discuss strategies with people doing the same type of writing as you.\n\nThat said, writing is such a personal practice that it's hard to give advice even as a fellow humanist. You just have to try to find what works for you and stick with it for as long as you can. If it's not working, try some new tactics. There are loads of self-help books and blogs, in addition to the resources I mentioned above.\n\nI'll add that in my experience, the writing process is not necessarily inherent. I have some personal tics, but I wouldn't say that I have a \"natural\" process because it depends on my working conditions. I wrote differently as a grad student than I did as a postdoc than I do as an assistant prof. Mostly, this has to do with simply having less time to spare. I had to learn to gradually abandon perfectionism and find shortcuts as I progressively took on more and more responsibility.  You can change these things with time, practice, and patience.",
      "author": "jmgbam21",
      "created": 1634835045,
      "upvotes": 2,
      "replies": {}
    },
    "hhgz9e1": {
      "link": "/r/AskAcademia/comments/qcmfg8/how_do_you_balance_your_personal_writing_process/hhgz9e1/",
      "text": "The first comment you received is incredibly ignorant. Do not feel guilty. Humanities and social sciences approach writing in a very different way than any other sciences, people who are not in HSS just don't understand. \n\nThe natural process you described is how I work too. It's hell, but no amount of training will change it, it's how you work (I've tried).\n\nMy supervisor was understanding at first even though she eventually lost patience in the end. Note that I'm at the last stage of my PhD so if you have more time than me it's always good to stand your ground and explain how you roll. Academics must try to fit to academia that's for sure but If academia didn't have to fit to academics there wouldn't be academics, you know what I mean? (English is not my first language sorry). You're allowed not to be a machine. \n\nI'm currently waiting for a diagnosis for ADHD, because I felt that my \"natural working process\" was a bit... unusual... I always feel like I'm a scientist with the working mind of an artist. This might be an avenue to explore? \n\nAnyways this is not much of an answer but I sympathize very much. I wish too that I could work differently but it's not possible.",
      "author": "Bright-Bookkeeper797",
      "created": 1634808102,
      "upvotes": 3,
      "replies": {}
    },
    "hhgxkmw": {
      "link": "/r/AskAcademia/comments/qcmfg8/how_do_you_balance_your_personal_writing_process/hhgxkmw/",
      "text": "Honestly?  You're just going to have to develop your writing skills/processes so that they support your career and collaborations instead of damaging them.\n\n> I want to honor my process (because I work faster and better that way) \n\nTaking 9 months to write a single chapter does not support your assertion that this method is fast or good.  You're a student; you're there to learn professional research skills, and one of those skills is how to write in a way that gets the job done.  It's not sensible or reasonable to refuse to develop your skills and methods, just because you find your slow chaotic approach to be comfortable.  \n\nI imagine you can use your process for your pre-first draft, but you need to learn the discipline and efficiency to do it quickly enough that you can produce and thoroughly edit it in time for your deadlines.  Waiting till some vague future job fixes this problem is not a good plan.  Those opportunities won't be open to you if your references are telling your future employers that you can't meet deadlines.",
      "author": "polyphonal",
      "created": 1634806497,
      "upvotes": 2,
      "replies": {}
    }
  }
}