{
  "sid": "qe2re7",
  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/",
  "title:": "Do you think that I should continue to pursue a career in Academia based on my current qualifications, I'm looking to become a lecturer in Computer Science?",
  "text": "I'm 33 years old. \n\nWhat follows  is my qualifications I have obtained, and then I would greatly appreciate for some advice based on my current intentions/plans. \n\n**Qualifications** *(all UK, I'll be looking to to get a lecturing position somewhere in the UK or Republic of Ireland)*: \n\nBA: International Relations (poorly ranked university) - Grade: 1st class. \n\nMSc: Computer Science (Better uni than before, between top 30 and 40 in UK) - Grade: Merit (60%) - *Transcript contains a tolerated failing grade for algorithms module, and a capped grade for IT security module*. Some distinction grades for other modules. \n\nMSc: Intelligent Systems (Average ranked university, not as good as before). Grade: So far two distinction grades for the two modules taken. \n\n**Assumptions and intentions**\n\nIf we assume that I have overcome my shortcomings in the MSc Computer Science degree and I get a high distinction grade for the MSc Intelligent Systems degree overall, and I obtain a PhD at a university no worse than the average one I'm at now and get at least four articles published in academia (solo or collaboration), is that enough to get a lecturing position at any university in the UK in the field of Computer Science/AI/Intelligent Systems? \n\nIf not, how about a postdoc to increase my chances? \n\nI'm also under no illusions that I ought to have a plan B to get a job at the end of this. I have my heart set on a PhD because it can increase my chances at getting a job outside of academia also. But my first priority would be a job in Academia. \n\nThanks for reading, any advice on this would be greatly appreciated.",
  "author": "BillMurray2022",
  "created": 1634986888,
  "updated": 1635184088,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.77,
  "comments": {
    "hhqilqa": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqilqa/",
      "text": "I could have written this a decade ago.\n\nI got my Ph.D. from a top university in my non-US country.  Did a VERY prestigious postdoc.  Worked 2 tenure-track positions at shitty teaching universities and left them both in disgust.\n\nThe vision that many graduate students have of easily walking into a tenure-track position, with extensive research support, after their defense (or possibly a postdoc) is decades out of date at this point.  The entire system happily lets Ph.D. candidates fool themselves about what they're working towards.\n\nMy cohort in graduate school all started wising up in the last couple of years of our program and it was a little depressing how everyone's unspoken dreams faded once they realized the trajectory they were on compared to the one they THOUGHT they were on.\n\n\\> I have my heart set on a PhD because it can increase my chances at getting a job outside of academia also.\n\nI would strongly disagree with this expectation.",
      "author": "TADodger",
      "created": 1634992576,
      "upvotes": 38,
      "replies": {
        "hhqql57": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqql57/",
          "text": "> I would strongly disagree with this expectation.\n\nMaybe the PhD doesn't add too much, but a CS master's alone is enough to get some pretty nice jobs.",
          "author": "pacific_plywood",
          "created": 1634997485,
          "upvotes": 14,
          "replies": {}
        },
        "hhqj44o": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqj44o/",
          "text": "> I would strongly disagree with this expectation.\n\nWhat I meant is that of course you can't really expect to get a lecturing position without a PhD. But also that having a PhD is surly good for the job market as well, no? To put it another way, it cannot harm your chances of getting an IT/ComSci job if you have a PhD. Or can it?",
          "author": "BillMurray2022",
          "created": 1634992894,
          "upvotes": 6,
          "replies": {
            "hhqsuur": {
              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqsuur/",
              "text": "A UK masters in computer science and related degrees is enough to get a lucrative career in data science or engineering if you focus with portfolio/modules smarty. \n\nFor a PhD it depends how much you value 3-4 years of stress, intellectual curiosity and low wages.",
              "author": "MFA_Nay",
              "created": 1634998856,
              "upvotes": 10,
              "replies": {}
            },
            "hhscgf9": {
              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhscgf9/",
              "text": "CS might be one of the rare exceptions, although it depends what you mean by lecturer. Do you mean a lecturer as in a teacher of university students, or a lecturer as in the academic position primarily doing research, applying for grants, running a research team and doing some teaching on the side?\n\nIf you're just interested in teaching then it's quite possible to get a job with only a master's (or not even that if you have industry experience). There are lots of universities in the UK which have non-academic CS teaching teams.",
              "author": "ACatGod",
              "created": 1635025140,
              "upvotes": 5,
              "replies": {
                "hhsg70e": {
                  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhsg70e/",
                  "text": "The second definition of lecturer is what I meant. To become a lecturer as in the academic position primary doing research would likely require a PhD.",
                  "author": "BillMurray2022",
                  "created": 1635026856,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hhqs6eb": {
              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqs6eb/",
              "text": "> But also that having a PhD is surly good for the job market as well, no? To put it another way, it cannot harm your chances of getting an IT/ComSci job if you have a PhD. Or can it?\n\nNo, not always good for the job market and it can certainly harm your chances. You'll be missing out on years of industrial experience and could be considered over qualified by many employers. Not to mention you're 33. By the time you graduate you'll be 36 minimum, more realistically 37 or 38. Plus one or two postdocs it you don't give up on the academic 'dream' when you finish your PhD, you'll be in your early 40's applying for effectively graduate level positions which more often than not will not require a PhD. Other applicants will have the same experience as you and could be half your age.",
              "author": "01010100111011011011",
              "created": 1634998449,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hhqrg3h": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqrg3h/",
      "text": "May I ask why you got a second masters? I think you're overthinking the importance of grades, especially by the time you get to applying for lecture positions. \n\n> is that enough to get a lecturing position at any university in the UK in the field of Computer Science/AI/Intelligent Systems? \n\nAt **any** university in the UK? No, of course not. By the time you get to applying you'll take what you can get, and expect very very few opportunities. You will undoubtedly need postdoc experience unless you're exceptional in your PhD.\n\n> it can increase my chances at getting a job outside of academia also\n\nVery sceptical about that comment. Perhaps partially true in the US, but I would certainly argue the opposite in Europe. Speaking from experience with a PhD in engineering and now in industry.",
      "author": "01010100111011011011",
      "created": 1634998011,
      "upvotes": 15,
      "replies": {
        "hhqs6k5": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqs6k5/",
          "text": "> May I ask why you got a second masters? \n\nTo maximize my chances of getting onto a PhD. You'll note my first degree is in a completely unrelated subject and my MSc wasn't particularly good.",
          "author": "BillMurray2022",
          "created": 1634998451,
          "upvotes": 3,
          "replies": {
            "hhqsktu": {
              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqsktu/",
              "text": "Honestly I don't think that was a good move. I don't see a second masters as a good thing, and I don't think either your Bachelors or first Masters are inherently bad. You got a top level BSc and then a merit for the MSc? That's not bad. I got a 2:1 from a 30-40 level university for my bachelor's, then also a merit for my master's (although, from arguably a very prestigious university). Both in the UK. You're thinking too much about university prestige and grades. Do you have any industrial experience?",
              "author": "01010100111011011011",
              "created": 1634998690,
              "upvotes": 7,
              "replies": {
                "hhqv535": {
                  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqv535/",
                  "text": "The issue is my first degree was in politics and my MSc transcript has a tolerated failed grade and a capped grade. So a merit, but just scraped at 60% exactly. I don't think those qualification alone will be enough to get onto a Phd in CS. \n\nNo industrial experience.",
                  "author": "BillMurray2022",
                  "created": 1635000186,
                  "upvotes": 1,
                  "replies": {
                    "hhqwbre": {
                      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqwbre/",
                      "text": "Did you try to apply for PhDs following your first masters? I effectively failed a course during my bachelor's, and I still got into a good master's at a good university. I'm not saying that to brag, and maybe I got lucky, but I haven't found that individual course grades to be that scrutinised through personal experience. I think you're judging your qualifications way more than the people that actually review them.\n\nI don't mean this to be rude, but how are you 33 with no industrial experience? Are you only thinking of CS experience? A-levels/college at 18, bachelor's at 21, first masters by 22, second by 23. Where did 10 years go? You'll be surprised at how relevant non-CS experience would be in applications.",
                      "author": "01010100111011011011",
                      "created": 1635000875,
                      "upvotes": 6,
                      "replies": {
                        "hhqxsg3": {
                          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqxsg3/",
                          "text": "Undergrad 2010 to 2013, tried to get into journalism until 2014, decided to change career paths to CS and worked to save money from 2014 to 2015, started masters in 2016, graduated end of 2017 (resits extended the course by four months). Been working since and preparing myself for a more specialized MSc which I started in 2020. \n\nNo jobs local in a relevant field, I've been working in care. I couldn't relocate at the time as I found myself living with sick immediate relative who essentially couldn't be left on their own for too long. \n\nI didn't attempt to apply for a PhD because a) my poor transcript (I got 42% in algorithms, it's a fundamental part of CS and 50% capped grade in IT security, 52% for programming and 58% for computer concepts (basic stuff in CS and I barley passed). 69% for databases,  62% research methods, 72% software engineering, 75% Human computer interaction and 60% for thesis, and b) funding. Perhaps I could have been accepted onto some PhD somewhere, but a funded position, the competition is surely to severe, especially given that my main degree is in a completely unrelated field.",
                          "author": "BillMurray2022",
                          "created": 1635001691,
                          "upvotes": 3,
                          "replies": {
                            "hhqzrh2": {
                              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqzrh2/",
                              "text": ">Undergrad 2010 to 2013, tried to get into journalism until 2014, decided to change career paths to CS and worked to save money from 2014 to 2015, started masters in 2016, graduated end of 2017 (resits extended the course by four months). Been working since and preparing myself for a more specialized MSc which I started in 2020. \n\nI think you need to stop and really think about what you want from a career, and to really take a look at the job opportunities available in academia in the UK (spoiler: they're not good). \n\nYou've jumped around a lot and I think that is what is going to stand out far more than your grades, which is why I think your second masters was a bad move. If I were reviewing your CV, I'd ask why you've moved from politics to journalism to computer science to another field of computer science, rather than 'explain this grade you received in algorithms'. \n\n>No jobs local in a relevant field, I've been working in care. I couldn't relocate at the time as I found myself living with sick immediate relative who essentially couldn't be left on their own for too long. \n\nHonestly, that sounds like an excuse. I'm sorry about your relatives, but the UK is a densely packed country. Unless you tell me you're in the Highlands I'm going to assume you could find some relevant experience in a nearby city and commute. Can you elaborate on 'care'? If you're in some kind of healthcare I would be interested in that on a CV. You can often relate anything to your field of interest, even if you're not currently working in it. Have you identified anything during your experience in care that could be benefitted using CS? \n\n>I didn't attempt to apply for a PhD because a) my poor transcript (I got 42% in algorithms, it's a fundamental part of CS and 50% capped grade in IT security, 52% for programming and 58% for computer concepts (basic stuff in CS and I barley passed). 69% for databases,  62% research methods, 72% software engineering, 75% Human computer interaction and 60% for thesis, \n\nThere you go listing grades again like they *really* matter. You're once again judging your own grades and assuming everyone feels the same about them. 42% in algorithms? Yeah, not great, but not necessarily a deal breaker. Are you actually using a 72% as a negative, or have you just listed all your grades? Maybe I'm just shit, but 72 isn't bad...\n\n> and b) funding. Perhaps I could have been accepted onto some PhD somewhere, but a funded position, the competition is surely to severe, especially given that my main degree is in a completely unrelated field.\n\nI didn't have funding before my PhD. Got talking with people, identified an advisor that I got along with (same uni as my MSc), he found some funding opportunities, we built an idea and submitted an application. Got the funding, got the PhD position. 3.5 years later, got the PhD.\n\nI think your number one problem is that you're your own worst enemy. Let the professors review your CV, not you.",
                              "author": "01010100111011011011",
                              "created": 1635003184,
                              "upvotes": 6,
                              "replies": {
                                "hhr2lij": {
                                  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhr2lij/",
                                  "text": "> Honestly, that sounds like an excuse. I'm sorry about your relatives, but the UK is a densely packed country. Unless you tell me you're in the Highlands I'm going to assume you could find some relevant experience in a nearby city and commute. Can you elaborate on 'care'? If you're in some kind of healthcare I would be interested in that on a CV. You can often relate anything to your field of interest, even if you're not currently working in it. Have you identified anything during your experience in care that could be benefitted using CS?\n\nAutism. Yes, at the moment for a module I'm attempting to build an Autism diagnostic tool of sorts. \n\n> There you go listing grades again like they really matter. You're once again judging your own grades and assuming everyone feels the same about them. 42% in algorithms? Yeah, not great, but not necessarily a deal breaker. Are you actually using a 72% as a negative, or have you just listed all your grades? Maybe I'm just shit, but 72 isn't bad...\n\n42% isn't just not great, it's a categorical failed grade in which I didn't even get the 15 credits for! 72% is a distinction grade, I got two of them, out of 8 modules, 10 if you include the thesis. Anything between 50 and 60% isn't particularly \"great\". But at least it is a pass. \n\nGrades matter less in a less competitive environment. PhD's are pretty damn competitive, especially funded ones, hence why I decided to get another MSc to hopefully make up for the shortcomings in the previous MSc. \n\n> I didn't have funding before my PhD. Got talking with people, identified an advisor that I got along with (same uni as my MSc), he found some funding opportunities, we built an idea and submitted an application. Got the funding, got the PhD position. 3.5 years later, got the PhD.\n\nOf course that could be an option now with my current uni. I intend to embed myself into the department and become part of furniture. I didn't really do that at my previous uni, I wasn't enjoying it and I was very stressed out. \n\nIt's different if you know and get along with your department. I think anyone would stand a better chance of progressing within their own uni. Of course I'm defo thinking about that.",
                                  "author": "BillMurray2022",
                                  "created": 1635004566,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhqm1c3": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqm1c3/",
      "text": "I'm a Lecturer at a large private east-coast US university, our CS department has ~800 undergrads and a strong research / PhD program. I taught there for about 15 years as an adjunct in another department and the last 7 years as full-time faculty in CS. I hold a BTEE and MSCS and have a very successful academic career.\n\nAt your age and place in your career my advice would be to work in industry in your field and teach on the side to gain experience managing courses and classrooms. Pick a few topics in CS that are hot right now and work on building your knowledge in those areas to increase your value to a CS department. Write articles / books on the subject or blog to establish credibility. Many schools have a lot of older, tenured faculty who teach whatever it was they were teaching 20 years ago and just don't have the time or interest to look at something new, but that's what students are demanding. I truly don't think a PhD is going to be of value to you except maybe as a personal accomplishment.\n\nI'd also work on classroom skills, maybe over technical skills, at this point. Even with high marks in your degrees, you aren't going to be hired if you aren't personable and comfortable teaching. \n\nI was hired because of my industry experience (I was a consultant in the financial services sector). No one ever asked to see my transcripts. I taught on the side as an adjunct for 15 years because I truly love teaching, and it was an easy transition to a full-time slot.",
      "author": "perrydBUCS",
      "created": 1634994605,
      "upvotes": 8,
      "replies": {
        "hhqq53z": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqq53z/",
          "text": "Just to clarify, in 'successful academic career', success means that I really enjoy what I do, not that I am 'successful' by some arbitrary measure of what an 'academic' is.",
          "author": "perrydBUCS",
          "created": 1634996783,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hhr10go": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhr10go/",
      "text": "I'm a CS professor at an R1 in the US, but some of my closest collaborators are in the UK.\n\nYou have a lot of \"ifs\" in your question. Too many to give any meaningful advice.\n\n1. All papers are not created equal. Four papers in shitty venues is not worth as much as a single paper in a good venue.\n2. Different communities in CS have different publication expectation. Four papers in theory is probably pretty good. Four papers in ML is not necessarily that impressive.\n3. Saying you are going to get four papers is quite a different beast than actually writing and publishing them. I've seen plenty of students come in talking about how they are going to write N papers only to see zero submissions after a few years.\n4. The job market is a massive coin flip with an unbounded set of variables that are often entirely out of your control. In the UK in particular, there is a fair amount of internal hires, for example. In academia in general, there are both \"global\" (research community level) and \"local\" (college/department level) politics. Stuff that you will probably never even know exists, but plays a massive role in hiring decisions.",
      "author": "worst",
      "created": 1635003815,
      "upvotes": 8,
      "replies": {}
    },
    "hhqdhet": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqdhet/",
      "text": "I don't know about CompSci but in my STEM field you need FAR more than that. You need a strong publication record, you need to be able to demonstrate leadership, you need to have a decent track record of winning your own funding, a fellowship helps too. That's 5-10 years of effort post-PhD unless you're lucky or a superstar.",
      "author": "Broric",
      "created": 1634989018,
      "upvotes": 19,
      "replies": {}
    },
    "hhqkg9s": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqkg9s/",
      "text": "Do you see yourself as someone who wants to focus on research or teaching in HE? Some UK institutions now have posts called University Teacher, which is more teaching/tutoring focussed and tend to have slightly less stringent requirements for research heavy PhDs, are they want people who can focus on the teaching aspect of tertiary education, which historically can be very mixed. Quality and consistency of teaching has a strong link to student experience.",
      "author": "TeuchterX",
      "created": 1634993699,
      "upvotes": 5,
      "replies": {
        "hhqkrgo": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqkrgo/",
          "text": "A bit of both really. I definitely want to do some research, but of course I would expect a lecturing position to involve a fair bit of teaching. \n\nI will have a look at \"University teacher\" positions also.",
          "author": "BillMurray2022",
          "created": 1634993886,
          "upvotes": 1,
          "replies": {
            "hhukp0w": {
              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhukp0w/",
              "text": "There are a lot of UK universities advertising more and more \"teaching track\" lectureships. Those lectureships have the same career advancement as your standard Research and Teaching one, except that you are evaluated and promoted based on teaching activities (curriculum development, outreach, etc.) rather than how many REFable papers you put out. You can still do research, but it's not your focus. It's also somehow less competitive than R&T jobs because it has a weird (and undeserved) stigma. \n\nAs for R&T jobs, lucky for you, I just got rejected from an AP position in a UK research focused uni and the HoS nicely accepted to meet me personally to explain  the weaknesses of my application, so I can tell you exactly what is expected. For a standard position, the biggest criteria for getting a job in a research focused uni are going to be the following:\n\n* Does adding you (and  your papers) into the team increase their REF score? If you only have 2* papers and their current average is 3*, then there is no incentive for hiring you. If you have 4* papers then adding you directly increases the competitivity of the university. \n\n* Have you shown that you can get funding independently? Even getting small grants shows that you can keep up with the field and you might be getting money in the university to hire postdocs etc. who can then write more papers, etc.\n\n* General trajectory of your career. That's the trickiest one: are you improving, stable, or getting worse? If you were a stellar PhD student but slowly getting worse, publishing less and worse papers then that's a negative signal to the hiring committee.\n\n* Can you teach? That's usually a Boolean in a research-focused university. Having your PGCHE is a plus but usually not required as you can gain it during your first year of employment. \n\n\nI can also recommend reading \"A PhD Is Not Enough!: A Guide to Survival in Science\" and \"The Professor Is in: The Essential Guide to Turning Your PH.D. Into a Job\" (not really STEM-y but a lot of good advice) to learn more about academic careers. The podcast \"The Effort Report\" contains also a lot of invaluable information but obviously more diluted.",
              "author": "needlzor",
              "created": 1635073582,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhr8x8p": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhr8x8p/",
      "text": "Are either of these research MSc? Or both course based MSc?\n\nFor academic lectureships or professorships you need to be demonstrated successful in the scholarship of your discipline which means publications. Doing well - or poorly - in class work, taking additional class work, or doing research just as part of a 3 month independent study puts you in the \"no relevant experience\" category still. Everybody was there at one point, so it's not a negative mark on you and your potential, but predicting your chance of success with no relevant experience (yet) is too many steps removed.",
      "author": "IAmAQuailBiologist",
      "created": 1635007435,
      "upvotes": 5,
      "replies": {
        "hhrajn2": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhrajn2/",
          "text": "> Are either of these research MSc? Or both course based MSc?\n\nBoth course based, they're made up of 8 modules and a thesis at the end. \n\nI'm aware I would need published work, my tutor had indicated that it is possible for MSc students to get their work published, although it is not easy. Plus he said that it is also possible to collaborate with lecturers. So I do intend to get on that as soon as I feel I could contribute something.",
          "author": "BillMurray2022",
          "created": 1635008155,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hhrwy98": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhrwy98/",
      "text": "No one will look at your module grades when you apply for a lecturing position in the UK. They will score you against the criteria in the job description.\n\nThe main thing most applicants lack is demonstrable teaching experience in subjects that are in demand. You'd be better to try and get lab demonstrator work and on the books to give hourly paid lectures, even if this is for an FE college or an alternative provider.\n\nChoose the PhD very carefully too, so that you can teach an area where there is a shortage of lecturers.\n\nThere is nothing wrong with taking initial posts at universities lower down the league tables, then working up (if you decide you want to focus more on research than teaching). There is no equivalent to US tenure in the UK system, so you can expect to move universities multiple times during your career.",
      "author": "GM770",
      "created": 1635018113,
      "upvotes": 3,
      "replies": {
        "hhry4ta": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhry4ta/",
          "text": "Thanks. \n\n> No one will look at your module grades when you apply for a lecturing position in the UK.\n\nIs that so? I mean, that would be beneficial for me! Although that does surprise me a little I must admit. Not that don't believe you (although I guess if you have PhD then it absolutely shouldn't matter much anymore). \n\n> There is nothing wrong with taking initial posts at universities lower down the league tables\n\nI'm not particularly fussed about working at a top university.",
          "author": "BillMurray2022",
          "created": 1635018654,
          "upvotes": 1,
          "replies": {
            "hhs358k": {
              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhs358k/",
              "text": "They won't ask you about your grades as there's nowhere for that information on the application form. They will ask about your overall degree classification.\n\nHave a look on jobs.ac.uk for some adverts and start an application. You'll see the type of form you have to fill in. You don't have to submit the form in the end.\n\nThe single biggest part of the application is going to be addressing every single point in the person specification, along with relevant evidence. You have to write a paragraph or so for each point (many people don't do this and so will never get an interview).\n\nA lot of these are very standard things, such as teamworking and even showing you have basic ICT skills (PowerPoint etc). Some people assume this is obvious and so don't write about it, so will automatically fail against the criteria regardless of having a CS degree. You still have to give a relevant example (e.g. of an impressive presentation you made for a research talk).\n\nBut look at the adverts and the forms and that will give you an idea of where you need to get to. Then plan the route through the PhD to make sure you can demonstrate everything needed.",
              "author": "GM770",
              "created": 1635020866,
              "upvotes": 3,
              "replies": {
                "hhs6bcx": {
                  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhs6bcx/",
                  "text": "Great shout on the jobs.ac.uk website. There are some great jobs in CS on there, and a lot of positions compared to other fields.",
                  "author": "BillMurray2022",
                  "created": 1635022304,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhqg4jv": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqg4jv/",
      "text": "It's completely possible, but it would depend on the quality of your research. How were your MSc projects? To improve your chances, I would also advise trying to get teaching experience during your studies.",
      "author": "xaranetic",
      "created": 1634990935,
      "upvotes": 3,
      "replies": {
        "hhqhcus": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqhcus/",
          "text": "> How were your MSc projects?\n\nIf you're talking about my MSc thesis for the CS degree, then not great. Amazingly my main supervisor gave me 82% and the 2nd supervisor gave me 49%. You read that right, a high distinction to a failing grade. They eventually agreed on 60%. \n\nHopefully I'll do better with my current MSc.",
          "author": "BillMurray2022",
          "created": 1634991773,
          "upvotes": -6,
          "replies": {
            "hhqycvk": {
              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqycvk/",
              "text": "I've never responded to my own comment before and I do not care about Reddit karma. \n\nBut Jesus, I'm sorry for not doing well guys! I do feel bad about about it. :)",
              "author": "BillMurray2022",
              "created": 1635002342,
              "upvotes": 1,
              "replies": {
                "hhr255c": {
                  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhr255c/",
                  "text": "If I had to guess, no one is downvoting you for your grades. They're downvoting because of your response.",
                  "author": "01010100111011011011",
                  "created": 1635004355,
                  "upvotes": 4,
                  "replies": {
                    "hhr3pc7": {
                      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhr3pc7/",
                      "text": "I thought it was perfectly polite and a direct relevant reply to the question. But please highlight where it was rude or obnoxious. I would like to know? \n\nI mean that in good faith as well, please tell me what was wrong with the response. I'm not saying it wasn't.",
                      "author": "BillMurray2022",
                      "created": 1635005079,
                      "upvotes": 0,
                      "replies": {
                        "hhrdmnh": {
                          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhrdmnh/",
                          "text": "It wasn't rude or obnoxious, just (from my point of view, and I have commented elsewhere) the grade isn't bad and your comment comes across a bit weird.",
                          "author": "01010100111011011011",
                          "created": 1635009529,
                          "upvotes": 3,
                          "replies": {
                            "hhrencr": {
                              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhrencr/",
                              "text": "Weird how? I'm genuinely curious.",
                              "author": "BillMurray2022",
                              "created": 1635009983,
                              "upvotes": 1,
                              "replies": {
                                "hhrjyd3": {
                                  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhrjyd3/",
                                  "text": "I've explained multiple times in various comments. Your grades aren't as bad as you think they are, and you're acting like you failed every course and killed the deans kids.",
                                  "author": "01010100111011011011",
                                  "created": 1635012364,
                                  "upvotes": 3,
                                  "replies": {
                                    "hhrqiw5": {
                                      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhrqiw5/",
                                      "text": "That comment to the other person that got downvoted was me pointing out how uncommon (I guess?) it is for two supervisors to give almost polar opposite grades, I.e: 82% = high distinction, 49% = failed grade. And that's what I got. That's not weird. That's just an interesting thing to point I thought.  \n\nI know some of those grades on my transcript are good BTW, I wasn't suggesting anything over 70% is bad (it's distinction for Christ sake!). \n\nBut I think it's fairly universally understood that failing is bad! \n\nThe main point is, in terms of getting onto a CS PhD, all I had was a 1 year degree graded at 60% with asterisks on the transcript. That's it. No other relevant experience accept my first degree demonstrates I'm pretty good at writing essays and that maybe I work hard. But of course there is no other transferable skills, no maths, no programming, no comparable problem solving in politics. \n\nIt would only take a CS undergraduate to out-compete me as I only had a 1 year degree.",
                                      "author": "BillMurray2022",
                                      "created": 1635015278,
                                      "upvotes": 1,
                                      "replies": {}
                                    },
                                    "hhrmwiz": {
                                      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhrmwiz/",
                                      "text": "Appologies but was this reply for another comment I made elsewhere?",
                                      "author": "BillMurray2022",
                                      "created": 1635013682,
                                      "upvotes": 0,
                                      "replies": {}
                                    }
                                  }
                                },
                                "hhv43xu": {
                                  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhv43xu/",
                                  "text": ">  Amazingly my main supervisor gave me 82% and the 2nd supervisor gave me 49%. You read that right,\n\nPossibly because you seem to be obsessing over minutiae in grades and marking, suggesting an immaturity in outlook. Students who obsess in this way are often exhausting and irritating to deal with, so perhaps some of that is spilling over and influencing redditors' attitudes to you. And no-one really cares whether your Masters dissertation examiners disagreed with each other, it happens sometimes. It's perhaps slightly uncommon, but it's in no way \"amazing\".\n\nOf course, I could be entirely wrong, I'm just guessing here.",
                                  "author": "red_elagabalus",
                                  "created": 1635085259,
                                  "upvotes": 2,
                                  "replies": {
                                    "hhv4hj0": {
                                      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhv4hj0/",
                                      "text": "> it happens sometimes It's perhaps slightly uncommon, but it's in no way \"amazing\".\n\n+- 10%, but for two professors to disagree to the point one gives a high distinction and other a fail is quite the contrast. \n\n> Students who obsess in this way are often exhausting and irritating to deal with\n\nHow would they know unless they read this thread lol?\n\nAnd maybe you're using the word \"obsess\" when a more appropriate word is \"care\".",
                                      "author": "BillMurray2022",
                                      "created": 1635085443,
                                      "upvotes": 0,
                                      "replies": {
                                        "hhv7rdi": {
                                          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhv7rdi/",
                                          "text": "\\*shrug\\*  I'm just suggesting a possible explanation. Ignore it or don't, I'm not fussed either way.",
                                          "author": "red_elagabalus",
                                          "created": 1635086956,
                                          "upvotes": 2,
                                          "replies": {}
                                        },
                                        "hhz0q6i": {
                                          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhz0q6i/",
                                          "text": ">And maybe you're using the word \"obsess\" when a more appropriate word is \"care\".\n\nNo. Everyone cares about their grades. 'Obsess' is the appropriately used word here.",
                                          "author": "01010100111011011011",
                                          "created": 1635160290,
                                          "upvotes": 1,
                                          "replies": {
                                            "hhz1ozm": {
                                              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhz1ozm/",
                                              "text": "Respectfully I disagree, perhaps it's because I cannot convey tone via text. If we were having a conversation face to face about this I don't think you would detect any obsession, I'm sure we'd have a perfectly pleasant conversation!",
                                              "author": "BillMurray2022",
                                              "created": 1635161004,
                                              "upvotes": 0,
                                              "replies": {
                                                "hhz6mkm": {
                                                  "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhz6mkm/",
                                                  "text": "The only thing you have emphasized in every one of your comments is your grades. There is so much more going on here. You're clearly obsessed with them. Tone is not necessary here.",
                                                  "author": "01010100111011011011",
                                                  "created": 1635164281,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hhzje0x": {
                                                      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhzje0x/",
                                                      "text": "I have made 11 comments in this thread, 7 of which are not specifically about my grades. \n\nNot everyone of my comments. The obsession your seeing is not there. Although me trying to convince you that I'm not obsessed over the grades issue is perhaps becoming an obsession! ;)",
                                                      "author": "BillMurray2022",
                                                      "created": 1635170903,
                                                      "upvotes": 0,
                                                      "replies": {}
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhqvlyx": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqvlyx/",
      "text": "No. Do not advise. It's too tough.",
      "author": "chugotleung2016",
      "created": 1635000456,
      "upvotes": 2,
      "replies": {}
    },
    "hhsa90l": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhsa90l/",
      "text": "Just curious how did u go from do a CS masters with a bachelors in international relations?",
      "author": "tamade335",
      "created": 1635024123,
      "upvotes": 2,
      "replies": {
        "hhsfwue": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhsfwue/",
          "text": "CS masters was a conversion degree (in the UK quite a few universities offer them). Essentially, the only undergraduate degree you cannot have to get on the masters is a Computer Science degree.",
          "author": "BillMurray2022",
          "created": 1635026722,
          "upvotes": 2,
          "replies": {
            "hhsgb6t": {
              "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhsgb6t/",
              "text": "Oooh I see",
              "author": "tamade335",
              "created": 1635026910,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhqvxl6": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqvxl6/",
      "text": "this is a UK specific question:\n\n/r/AskAcademiaUK",
      "author": "lalochezia1",
      "created": 1635000646,
      "upvotes": 2,
      "replies": {}
    },
    "hhqns23": {
      "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqns23/",
      "text": "One thing that's being overlooked in some replies here is that CS faculty are in demand with lots of competition from industry. If you add some data science/machine learning/stats background, then your odds of landing a good faculty job are way higher than other fields. It's still not guaranteed and you'll still need to work hard, but you'll also land on your feet if you don't get a faculty job. Of course, this could all change over the next 5-10 years.",
      "author": "ProfOnTheMove",
      "created": 1634995559,
      "upvotes": 0,
      "replies": {
        "hhqwg5i": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqwg5i/",
          "text": "Yeah CS is in demand but not that in demand that they have run out of applicants from top 10 universities with some publications already",
          "author": "rosealyd",
          "created": 1635000944,
          "upvotes": 5,
          "replies": {}
        },
        "hhqx327": {
          "link": "/r/AskAcademia/comments/qe2re7/do_you_think_that_i_should_continue_to_pursue_a/hhqx327/",
          "text": "Yeah CS is in demand but not that in demand that they have run out of applicants from top 10 universities with some publications already",
          "author": "rosealyd",
          "created": 1635001305,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}