{
  "sid": "oztlmg",
  "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/",
  "title:": "ScientistsMBA from cheeky scientist review requested",
  "text": "Has anybody done scientistMBA from cheeky scientists and would like to give a review that how was it? And the certificate that they give after completion, how good is that? Do companies look at it as an MBA? Does it help for management jobs after PhD in life sciences?",
  "author": "Realistic-Swimming93",
  "created": 1628344193,
  "updated": 1634079980,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "h82jc8x": {
      "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/h82jc8x/",
      "text": "Cheeky Scientist is a scam, don't give them any money.",
      "author": "Mugstotheceiling",
      "created": 1628353515,
      "upvotes": 12,
      "replies": {
        "h8341h0": {
          "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/h8341h0/",
          "text": "Yup. I've seen their free advice on Facebook and it's absolutely terrible. In fact I just googled them to check it was the same company I was thinking of and came up with this gem, \"the most powerful thing in your cover letter will be mentioning a referral in the first paragraph\" and they go on to give an example of saying you know the CEO of the company. As a senior university manager who does a lot of recruitment and works with lots of people inside and outside the organisation on recruitment, I can categorically say this is horse shit. Anyone who expects me to hire them because we know the same people can f*ck right off. The rest of the article on cover letters was total garbage as well.",
          "author": "ACatGod",
          "created": 1628363144,
          "upvotes": 8,
          "replies": {
            "h8381ec": {
              "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/h8381ec/",
              "text": "I agree I have looked through their program and did not see anything valuable.\nMy honest opinion is that they prey on the fear of young professionals to not get a job and not being able to write successful applications. LinkedIn is Full of Horror Stories about how you will never find a job without their teaching  and how the job market is so bad and soon everyone is unemployed. \nHave some faith there is some good advice free of charge those certificates are worthless imo",
              "author": "CreepyBumblebee31",
              "created": 1628365067,
              "upvotes": 5,
              "replies": {
                "h838nv6": {
                  "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/h838nv6/",
                  "text": "Absolutely. Ask A Manager and the Thesis Whisperer both give out great advice. Ask A Manager may not be about academia but lots of her advice is applicable. \n\nThe worst thing about the cheeky scientist is that their advice is really terrible and will absolutely scupper anyone using it. Presumably that's so you come back and buy more services.\n\nETA I thought I'd torture myself by looking at their website again. I just read their advice and suggested email templates for neogtiating your salary. Who knew you could sprain your face yikes-ing so hard? I'm always open to negotiating salaries and very conscious about ensuring salary equity in my team, so I even go out to bat for my recruits on their behalf but if someone sent me those emails I'd seriously consider rescinding the offer.",
                  "author": "ACatGod",
                  "created": 1628365370,
                  "upvotes": 5,
                  "replies": {
                    "h8662jf": {
                      "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/h8662jf/",
                      "text": "Thank you so much. That was really helpful. If you wouldn’t mind , can I ask that do you recruit for academia or industry? And what would be the content of an ideal cover letter? Normally I introduce myself by first mentioning why the advertised position is important for real world in just 2 sentences and then 2 sentences about how my experience fit there. And then one paragraph to support my claim by mentioning broadly things I have done so far and then final paragraph about extra skill I bring that are important for job and a sentence about my motivation for the job and lastly thanking them. Am I doing it wrong? Because I do get a lot of offers from academia with this but not from industry",
                      "author": "Realistic-Swimming93",
                      "created": 1628432013,
                      "upvotes": 2,
                      "replies": {
                        "h86hlrk": {
                          "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/h86hlrk/",
                          "text": "I work for a research institute, so we have what superficially looks like university faculty - they're not a million miles off but there are some fundamental differences (no teaching, focus on a range of outputs not just publication, keen on commercialisation) and we have very close industry ties, with several initiatives with a mix of academic and industry employed staff. As a senior manager, I recruit for my own team but I'm also brought in to be on the panels of other recruitments - so it's a real mix although less on the industrial side.\n\nFor me a good cover letter tells me exactly how the person fits the role profile. When I write a cover letter I literally use each essential and desirable criteria from the job description as paragraph headings and write something for each one. Then I delete the headings and tidy up the letter to ensure it flows. When I score (and most of the other people I recruit with do this as well) candidates I score against the essentials and desirables, scoring between 1and 5 for how well they meet the criteria.\n\nPersonally I'm not particularly interested in applicants opinions on why the role is important - I already know why it's important, that's why we're hiring for it. However, someone saying it's important for them to have a role which satisfies X for them and this role does that, does help me understand their motivation for applying. \n\nThe other common mistake people make is not explaining why they are applying *especially* when it's not an obvious move for them. I don't know why candidates do this but if you're in a different sector, or you're in a more senior job and this is a step down, or just something else that might cause the reader to wonder why you're applying don't be coy about the reasons. I can think of so many occasions where we've had a long list of candidates and someone didn't make the interviews because we didn't want to risk wasting an interview slot on someone who maybe didn't want the job. As an example we had a PI from another university apply for a more junior non-academic role. He could have done the job with his eyes closed and would have brought expertise we would have loved but didn't have budget for, yet we chose not to interview him because we really had no idea why he was applying and the likelihood of him either turning down the job or asking for different terms of employment seemed too high. We had other good candidates and a deadline for finishing the recruitment and messing about with candidates like that can scupper a recruitment.\n\nIf you're wanting to move from academia to industry explain why you want to make that move - it helps show you are serious and also that you understand what the job will be like, both of which are concerns when you're recruiting. I've definitely recruited from left field - one of the most talented people in my team came from a job that I wouldn't have considered an appropriate background in a million years when I first created the role but her letter laid out how her experience was relevant (addressed the essentials and desirables) and explained why she wanted to make the move. \n\nGood luck.",
                          "author": "ACatGod",
                          "created": 1628437695,
                          "upvotes": 5,
                          "replies": {
                            "h87myva": {
                              "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/h87myva/",
                              "text": "Thank you again that was a detailed explanation satisfying what exactly I was looking for.",
                              "author": "Realistic-Swimming93",
                              "created": 1628456837,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h848slq": {
      "link": "/r/AskAcademia/comments/oztlmg/scientistsmba_from_cheeky_scientist_review/h848slq/",
      "text": "You don’t need this for an industry career. Please don’t give your money to these predatory services. Your graduate career centre on campus should be well-equipped to help you prepare for a career outside of academia. In general, I think another degree (even a legit MBA) is unnecessary if you have a PhD.",
      "author": "Hhas1proton",
      "created": 1628383795,
      "upvotes": 7,
      "replies": {}
    }
  }
}