{
  "sid": "orqous",
  "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/",
  "title:": "How can I speak with an academic advisor before I’m enrolled as a student?",
  "text": "I’m looking to continue my education and go into nursing, I’ve already graduated from a 4-year university with a BA but I need different pre reqs and recommendations about which route is best for me to pursue what I want. I really just need to meet with an advisor! But whenever I google about it- I always find that in order to speak with one I have to be a student at that school. Does anyone know if there are “freelance” academic advisors or opportunities to speak with one even if I’m not a student? \nAny info is helpful! Thank you!",
  "author": "Kweesteeen",
  "created": 1627270919,
  "updated": 1634082436,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "h6jrxsr": {
      "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6jrxsr/",
      "text": "You need to speak with admissions or the department at the school you're interested in attending.",
      "author": "CerebralBypass",
      "created": 1627271316,
      "upvotes": 18,
      "replies": {}
    },
    "h6js46y": {
      "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6js46y/",
      "text": "I’d reach out to programs you’re interested in attending. \n\nReally, there aren’t that many options from where you are: you either go into an accelerated BSN program, or you go back to school for a second degree.",
      "author": "Eigengrad",
      "created": 1627271423,
      "upvotes": 9,
      "replies": {
        "h6jt3rf": {
          "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6jt3rf/",
          "text": "I hear what youre saying, I guess I’m just not sure what pre reqs I need or which programs I would be eligible for given my previous degree (a degree unrelated to nursing, unfortunately). I’d just like for someone to look at my transcript and help me figure out the most efficient path, rather than waste $ or time being unclear about how my previous education might or might not apply to my future education. I think I’ve become more confused about this process because I know a few different people in nursing school, and they got there using completely different avenues. Some started from the very beginning and others were able to save some time by getting into programs that move quicker. Just don’t know where I stand.",
          "author": "Kweesteeen",
          "created": 1627272031,
          "upvotes": 0,
          "replies": {
            "h6jt7oe": {
              "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6jt7oe/",
              "text": "This should be listed on the admissions requirements page for nursing programs.\n\nAgain, you have two options: accelerated BSN programs and starting fresh. Choose a program, look at the requirements, call if you have questions.",
              "author": "Eigengrad",
              "created": 1627272099,
              "upvotes": 5,
              "replies": {
                "h6jtysm": {
                  "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6jtysm/",
                  "text": "Thank you. And by “starting fresh” I assume you mean getting an ADN first, then going for the BSN? Thanks again for your help I really appreciate it. Im pretty early on in my thinking about this, clearly 😅",
                  "author": "Kweesteeen",
                  "created": 1627272573,
                  "upvotes": 1,
                  "replies": {
                    "h6jv24l": {
                      "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6jv24l/",
                      "text": "No, I mean enrolling for a BSN as a new student. You don’t need an associates degree. \n\nAn accelerated program will allow you to transfer in credits from your original degree to take only the nursing courses you need, but often is competitive to get into and has a number of prerequisite courses- basically all of the requires science courses for the degree. \n\nYour other option is to enroll as a first year and complete an entire degree, like you did your first one. \n\nSome schools might let you transfer in some courses from your first degree, you’d have to specifically ask about that.",
                      "author": "Eigengrad",
                      "created": 1627273272,
                      "upvotes": 5,
                      "replies": {
                        "h6l3uw6": {
                          "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6l3uw6/",
                          "text": "You can work as an RN with a two year nursing degree. Our college offers it this way for folks. One year in the LPN program, one year in the ADN program, two years online for BSN while you’re working in the hospital.",
                          "author": "iamsavsavage",
                          "created": 1627307218,
                          "upvotes": 2,
                          "replies": {
                            "h6lerwv": {
                              "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6lerwv/",
                              "text": "Pretty sure this is state dependent for licensing.",
                              "author": "Eigengrad",
                              "created": 1627312451,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "h6kdovv": {
                      "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6kdovv/",
                      "text": "These days most courses have a website that explains the admission requirements and provides contact info. If you have a few colleges/courses in mind already, I'd just start digging around on the course pages and email admissions for additional information. The only people with the information are the admissions people, every course is slightly different even in a regulated field.",
                      "author": "ACatGod",
                      "created": 1627288012,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6k2jlk": {
      "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6k2jlk/",
      "text": "Most programs need anatomy, physiology, and microbiology.  You can take those at your local community college as long as they have labs. Some programs require a child development class or developmental psychology. If you have not taken a chemistry class, it is likely you will need to in order to take microbiology. Not sure where you are located but nursing programs can be very competitive to get into so it is important that your grades in those courses are high. You should check the requirements and how they accept students (waitlist, lottery, rubric, etc). You should be able to inquire with the school before you are a student or go to their nursing specific website for information.",
      "author": "bigchicken5991",
      "created": 1627278524,
      "upvotes": 1,
      "replies": {}
    },
    "h6lwj6k": {
      "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6lwj6k/",
      "text": "Yes.",
      "author": "Bibi_Baby13",
      "created": 1627320196,
      "upvotes": 1,
      "replies": {}
    },
    "h6pv8sj": {
      "link": "/r/AskAcademia/comments/orqous/how_can_i_speak_with_an_academic_advisor_before/h6pv8sj/",
      "text": "Admissions counselors (or equivalent) usually work with folks who aren’t students. Advisors work with folks who are students. Try searching something related to admissions counselors.",
      "author": "PhDapper",
      "created": 1627400582,
      "upvotes": 1,
      "replies": {}
    }
  }
}