{
  "sid": "kfdp1b",
  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/",
  "title:": "Professor wont let me see my own final- grade discrepency",
  "text": "My final exam got messed up and instead of getting my accommodation of \"time and a half\" on a 3 hour exam i got \"half time\"\n\non a 866 point final with 14 problems, I got stopped at 1 hour and 30 minutes. I notified the Prof who told me to just log back in and finish the text. It began an \"attempt 2\" where he said to just do the ones I missed the first time around. My first score for 9/14 was around 530 points give or take. \n\nThe grade he presented with was the 53(4?) plus what he implied was an obvious 54 points from my second attempt. That seems bonkers low and I really want to see the graded exam so I know how and where I messed up.\n\nwhat reason would he have for refusing to let me see? after all, he is the one who fucked up my disability accommodations. Does the grading confuse anyone else?",
  "author": "Fearless_Way_9931",
  "created": 1608264260,
  "updated": 1634081234,
  "over_18": false,
  "upvotes": 150,
  "upvote_ratio": 0.94,
  "comments": {
    "gg7udw5": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg7udw5/",
      "text": "So, instead 4.5 hrs, you got 1.5? And they have the weirdest points for an exam I have ever encountered?\n\nYeah. Something weird is going on. I'm clueless about what, but that is just weird.",
      "author": "AgreeableStrawberry8",
      "created": 1608264524,
      "upvotes": 219,
      "replies": {
        "gg7ulkl": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg7ulkl/",
          "text": "I technically just got 3 since i took two attempts at an 1 hour 30 minute exam. Also stressed my learning disabled ass out really bad. Im glad his grade isn’t just confusing me.",
          "author": "Fearless_Way_9931",
          "created": 1608264641,
          "upvotes": 92,
          "replies": {
            "gg7za95": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg7za95/",
              "text": "I’d email your Disability accommodations person. I had something similar occur with messed up timing and my person was amazing at getting it sorted out and was able to argue that several shorter attempts that add up to the right time doesn’t count in terms of the accommodations requirements. For what it’s worth, that points system doesn’t make sense to me either.",
              "author": "kleka",
              "created": 1608267397,
              "upvotes": 175,
              "replies": {}
            }
          }
        }
      }
    },
    "gg7uwo2": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg7uwo2/",
      "text": "Yea you have the weirdest fucking points system I’ve seen for an exam. I would contacting someone in the disability office about your accommodations being fucked and copying your professor on the email, so they know you’re not just gonna accept their fuck up.",
      "author": "puffycheetopuff",
      "created": 1608264806,
      "upvotes": 114,
      "replies": {
        "gg7v07e": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg7v07e/",
          "text": "Right?! Like bro, bryan what are you hiding?!?",
          "author": "Fearless_Way_9931",
          "created": 1608264861,
          "upvotes": 41,
          "replies": {}
        }
      }
    },
    "gg80m8k": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg80m8k/",
      "text": "Contact the disability services office—whoever you worked with to get the accommodation—and ask them for help on this. Don’t wait until next semester because your school might have a narrow window to resolve issues like this. Mine does. This is the weirdest sounding final. 14 questions worth 866 points. If there are students who have yet to take this exam, I can understand why the prof won’t let you see it yet. It’s not unusual to make a graded exam available after finals are finished. You should still follow up with disability services, though, because your accommodation wasn’t granted.",
      "author": "Opening_Doors",
      "created": 1608268266,
      "upvotes": 77,
      "replies": {}
    },
    "gg8rpo3": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8rpo3/",
      "text": "Did he say you cant see the exam, or has he just not gotten back to your email yet?\n\nA lot of professors don't let people look at online exams with the answers because too many students cheat. This is pretty normal. But it's a bit odd that you got a perfect score on the first part and then completely failed the second part (if I am understanding you correctly). Maybe he can just tell you what questions were wrong without showing you the exam?",
      "author": "Winesday_addams",
      "created": 1608292553,
      "upvotes": 19,
      "replies": {
        "ggapaqe": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggapaqe/",
          "text": "I keep saying “can i please seee the details of my final exam” and he will reply and just totally dodge the question. The grading period ended on the 14th and he responded to me the 15th",
          "author": "Fearless_Way_9931",
          "created": 1608327256,
          "upvotes": 2,
          "replies": {
            "ggarm6c": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggarm6c/",
              "text": "Can you ask \"which questions did I get wrong\" or \"may I see the correct answers?\" It seems like your question on details may be too vague for him. Maybe he thinks that the score is what you're looking for.",
              "author": "Winesday_addams",
              "created": 1608328338,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gg8z27j": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8z27j/",
      "text": "BTW, first you contact the professor again and ask to have him explain the grades and what you got wrong and right.\n\nThe disability office can deal with the messed up time limit, but NOT the policy of not returning exams (unless it is specified that you are allowed to have exams returned when nobody else in the class is).\n\nAfter you contact the professor, and leave appropriate amount of time, contact the chair of the department, explaining that you already contacted the professor.\n\nKeep to the facts",
      "author": "PersephoneIsNotHome",
      "created": 1608298402,
      "upvotes": 8,
      "replies": {
        "ggapenm": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggapenm/",
          "text": "I have been! He dodges any of my actually productive questions with his vague bullshit.",
          "author": "Fearless_Way_9931",
          "created": 1608327308,
          "upvotes": 2,
          "replies": {
            "gj3efk1": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gj3efk1/",
              "text": "He probably doesn’t know how to view multiple attempts ... and now he’s like ... shit... what do I do?!",
              "author": "Seanzietron",
              "created": 1610525783,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gg8804y": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8804y/",
      "text": "I don't really have a comment on your main question but grading system is not necessarily bad. People for some reason expect 100 points on every exam. It is just harder to grade when the numbers of points for each question are small; not enough room for fine partial grading. Of course, I can just as easily use non-integers etc, when I had more energy for grading, I used to do that (I remember using pi, e etc. in my grading, lol) but not anymore. Another alternative is to make the total points in an exam equal to its weight in the course, so if the exam is worth 25 percent of the total grade, it would have 25 points. This is obviously harder for the grader for the reasons above but students understand the scale of things better in this way I think. In fact, another reason to have hundreds of points is that students complain less. Like if a student gets 40 out of 100, they will complain. If they get 100 out of 250, they won't, even tho they are the exact same grade. (I just finished grading 100+ finals so apparently that's all I can talk about for the next few days.)",
      "author": "amhotw",
      "created": 1608273751,
      "upvotes": 27,
      "replies": {
        "gg8vmxf": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8vmxf/",
          "text": "Thank you! \n\nMy pet peeve is when my colleagues don't understand what aspects of grading are arbitrary (total points for an assignment) and what ones are not (are numerical grades converted to letter grades before or after averaging all components.)",
          "author": "blue_pez",
          "created": 1608295917,
          "upvotes": 12,
          "replies": {}
        },
        "gg938gn": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg938gn/",
          "text": "YES. I have a colleague who uses my labs (20 points). But, each lab is out of 42, 58, 24, etc points. He said I should be making them out of 20 — no, I’ll make them out of whatever number is easiest. Each semester I change what I want to ask and it’s hella lot easier to just assign points as I make questions then add up the points. If a student gets - 25/50 I do scale it for them to 10/20. So much easier than spending time rebalancing everything to be exactly 20 points.",
          "author": "knewtoff",
          "created": 1608301035,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gg7yyda": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg7yyda/",
      "text": "Get in touch with an ombudsperson. You have a right, as a student, to see your exam after it’s marked.",
      "author": "bornonsunrise",
      "created": 1608267187,
      "upvotes": 23,
      "replies": {
        "gg93np0": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg93np0/",
          "text": "Actually, you don't. Several professors use the same exam questions from year to year to track how well their students are learning material (and, thus, how well they're doing as a professor). Because of that, some professors are uncomfortable sharing the correct answers because they're worried the correct responses will reach the ears of incoming students and ruin the year-to-year tracking.\n\nThat being said, it sounds like OP got screwed over and should have an opportunity to complete a fair exam under appropriate circumstances (especially given their disability accommodations).",
          "author": "Esmereldista",
          "created": 1608301286,
          "upvotes": 8,
          "replies": {
            "gg9nl7m": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9nl7m/",
              "text": "The prof would likely rather show the exam than get involved with DSPS/disability law issues",
              "author": "PBandJammm",
              "created": 1608310958,
              "upvotes": 7,
              "replies": {
                "gg9ytgl": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9ytgl/",
                  "text": "Probably.",
                  "author": "Esmereldista",
                  "created": 1608315644,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gg9tiqm": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9tiqm/",
              "text": "So that actually doesn’t matter. Students are allowed to see their exams, but many professors - myself included - do not allow students to take home exams. There’s a key difference with that. But every university I’ve worked at requires that students have access to their exams, under the supervision of a prof or TA, following the marking of the exam. Perhaps there are some regional differences, but I’d be shocked if students were never given access to their exams!",
              "author": "bornonsunrise",
              "created": 1608313425,
              "upvotes": 9,
              "replies": {
                "gg9ykzy": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9ykzy/",
                  "text": "I'm a new faculty member, so perhaps I've missed something, but with increased use recently of websites like Chegg, I'm under the impression that students to not have a right to see their graded material. To be clear, this has nothing to do with me or my grading policies - this is what I've seen from others.\n\nI'm curious, how are you running your exams during the pandemic? Are your exams in person?",
                  "author": "Esmereldista",
                  "created": 1608315545,
                  "upvotes": 3,
                  "replies": {
                    "gga8yaa": {
                      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gga8yaa/",
                      "text": "Online since the world is on fire. But our departmental policy has still been to allow students to view their exams. Some courses have opted to hold dedicated virtual office hours to go over the material on the exams, and so students can only see the test/quiz answers during that time (e.g., screen sharing from the TAs computer). What I liked the most - though not all faculty are comfortable with this - is uploading a document with the answers that is locked after a certain time window. Even if students download it, the document is not able to be viewed. There are adobe settings that made this option work really well for an intro class with 750+ students, which made scheduling dedicated office hours tough, since there were only 2 TAs. But this still required a level of trust with students, but at the end of the day, we’ve taken the approach that we are all struggling during these unprecedented times and it’s better to show compassion. Students want to - and need to - be able to see where they went wrong so that they can learn. So even though class-wide policies vary, our department is very much of the opinion that students need to have access to their exams, especially should they request it.",
                      "author": "bornonsunrise",
                      "created": 1608319985,
                      "upvotes": 6,
                      "replies": {
                        "ggew835": {
                          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggew835/",
                          "text": "That's good to know. This semester I showed my students exams on an as-requested basis (since there's not a great way for me to get exams back to them...too many students to e-mail each one. I held up the exams during virtual office hours and that worked OK. It seemed to be more helpful when I just told them how to improve (opposed to awkwardly holding up the graded test).",
                          "author": "Esmereldista",
                          "created": 1608418943,
                          "upvotes": 1,
                          "replies": {
                            "ggfc15a": {
                              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggfc15a/",
                              "text": "Yeah, that’s totally fair. I think we’re all just trying to navigate through this weird time. As long as students are being given an option to see their exam if they want (e.g., via coming to virtual office hours), I think that’s fair! And I do think that telling students how to improve is far more valuable, since it’s very rare that they ever see the same questions on multiple exams. It’s more about the learning good strategies. :)",
                              "author": "bornonsunrise",
                              "created": 1608425837,
                              "upvotes": 2,
                              "replies": {
                                "ggfuj23": {
                                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggfuj23/",
                                  "text": "Exactly! One of the biggest thing I've tried teaching my students is how to see past the words and to picture the scenario itself (physics).",
                                  "author": "Esmereldista",
                                  "created": 1608436787,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gj3ehzg": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gj3ehzg/",
                  "text": "The problem is digital. He’s worried about screenshots of answers.",
                  "author": "Seanzietron",
                  "created": 1610525850,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gg9t2e3": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9t2e3/",
              "text": "That depends on uni/college/departmental policy. In my uni students are allowed to see the details of their grading so they can contest it if they feel like they were wrongly graded. It’s actually in the university’s charts.",
              "author": "spacenb",
              "created": 1608313239,
              "upvotes": 5,
              "replies": {
                "gg9ypk9": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9ypk9/",
                  "text": "Yes, I should have worded my original statement more carefully. I did not mean to imply that all colleges have the same policies. Thanks for correcting me on that point.",
                  "author": "Esmereldista",
                  "created": 1608315599,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gg9ck3t": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9ck3t/",
              "text": "Really? That sounds more like a professor’s personal policy rather than something supported by an institution. I’m willing to bet an exception for an individual student in extenuating circumstances can be made. Especially if the disability office is involved and the professor undoubtedly made a mistake.",
              "author": "hcos612",
              "created": 1608306056,
              "upvotes": 7,
              "replies": {
                "gg9y4fe": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9y4fe/",
                  "text": ">That being said, it sounds like OP got screwed over and should have an opportunity to complete a fair exam under appropriate circumstances (especially given their disability accommodations).\n\nNot sure if you saw this part of my comment.\n\nI'm sure the policy with regard to showing graded exams varies from college to college, however with exams being online, cheating websites like Chegg have been utilized more frequently, causing colleges to tighten up restrictions related to exams.",
                  "author": "Esmereldista",
                  "created": 1608315352,
                  "upvotes": 1,
                  "replies": {
                    "gga2r2h": {
                      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gga2r2h/",
                      "text": "Yes, I agree that students should have the opportunity for fair testing. It sounds like the solution you’re proposing is that the student takes another exam (which is problematic in the scenario you’re proposing, that there is only ONE version of the exam- OP has already seen it in this case), whereas OP just wants to look at the exam they have already taken to assure that the grade was calculated correctly. \n\nNow I’m curious. I haven’t had any first hand experiences with faculty members who don’t allow students to access their graded exams, so I’m not sure how this works. If students aren’t allowed to know what the correct answers were, what kind of feedback do they get?",
                      "author": "hcos612",
                      "created": 1608317317,
                      "upvotes": 3,
                      "replies": {
                        "ggexpbl": {
                          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggexpbl/",
                          "text": "I never actually proposed a solution since I wasn't asked for a solution, but if this type of thing happened between one of my students and me, I certainly would offer to do a re-write and let them have the full time. Of course re-writes are problematic for a variety of reasons, but there's just not a great solution (that I can see) in this case. Perhaps grading on only 2/3 of the total exam points since the student only had 2/3 of the time they were entitled to? I'm not sure what the best solution is. All I can do is suppose in this case.\n\nI don't know. From my understanding professors do not have to share the exam. I never said that they shouldn't. In the case of my classes, we have virtual office hours where I put the exam up near the camera, then I walk them through what went wrong/how to improve. But I do not give them the fully graded exam back (partially because how on Earth would I be able to reasonably get all of the graded exams back to my students in this online format?).",
                          "author": "Esmereldista",
                          "created": 1608419529,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gg8yro3": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8yro3/",
      "text": "Professors don't let the exam out because students post the exam to cheating sites.\n\nThere is usually some mechanism for you to view the exam - used to be during office hours, now I do it via zoom, but warn the the student that if the exam gets out, it is clear that I know the source.\n\nAsk your prof to see what you got and why.\n\nAlso, tone it down on the attitude.  There are many reasons for an LMS or an online exam to get kicked - like a temporary internet disruption.  (Online exams have actually been really enlightening about how often this happens in a documented way for enough time for someone to get kicked off).\n\nYou should have the right to see your grades and feedback for your assignments.  Having the attitude that the professor fucked up  is probably not going to benefit you.\n\nThe grading is going to be intrisinically weird because  there was a problem and this is going to have to input in a different way, or manually calculated.\n\n\nAs to people's comments about points - like an 866 point final.\n\nI started doing this also because my student do not understand weighted means.\n\nWhen I make everything out of 100 points, they also literally said things like \" I didn't do the HW because they were only worth 0.5 points each\". \" Or if the HW is worth 1 point in total, how can each question be worth 0.1 points?  Or I am only 3 points away from a pass - no, you are 3% away from a pass.\n\nSo now I make the class out of 5000 points or something like that. And by allocating absolute point values you get weighing .  Sad but true",
      "author": "PersephoneIsNotHome",
      "created": 1608298201,
      "upvotes": 16,
      "replies": {
        "gg9fhv8": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9fhv8/",
          "text": "I’m with you except “tone it down on the attitude”. This student has a reason to be upset and feel taken advantage of based on their disability. Remember learning disabilities also include executive functioning skills so s/he may need to be walked through these policies more than a typical student might. I understand the frustration this student is feeling.",
          "author": "Nylonknot",
          "created": 1608307541,
          "upvotes": 11,
          "replies": {
            "gga6wrb": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gga6wrb/",
              "text": "I am giving the student sound advice.  If they approach the professor with a respectful attitude they are much more likely to get a good response.\n\nAnd, not for nothing, I have had many students, with and without disability accommodations, who did not do something they needed to do for an exam to work (you must click on this , not that) so it isn't necessarily true that the professor is the one who fucked up.\n\nAnd even if they did, and it was a mistake, from a population who wants leniency , compassion and caring, and being treated with respect, than what is good for the goose is good for the gander.\n\nIf you think that approaching a professor with an attitude that is accusatory and blaming is going to get them a better outcome, you  are free to give that advice also.",
              "author": "PersephoneIsNotHome",
              "created": 1608319104,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gg9u87v": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9u87v/",
          "text": "There is a key difference in releasing an exam vs. allowing a student to see their exam. Many courses have policies that exams are not openly released. The issue is NOT that the prof is refusing to “release” the exam, but that the student cannot review their exams. In many courses I’ve taught, students are fully within their rights to review their exams with a TA or prof. However, they cannot take the exam with them.",
          "author": "bornonsunrise",
          "created": 1608313722,
          "upvotes": 6,
          "replies": {
            "gga5i98": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gga5i98/",
              "text": "Because of the sheer number of students who post the questions when allowed to view the questions and answers and otherwise cheat, some people only allow review of actual answers in person or in a zoom or whatever.  \n\nI agreed that the student should be able to see grading and see what they got wrong and  right.\n\nI have no idea what this comment even means",
              "author": "PersephoneIsNotHome",
              "created": 1608318498,
              "upvotes": 1,
              "replies": {
                "gga9m8d": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gga9m8d/",
                  "text": "The point I was making is that the profs don’t need to openly post (i.e., openly release) the entire contents of the exam, but some measures (e.g., allowing students to review the exam during virtual office hours) should be in place for students because they do have a right to see their material. Apologies if that wasn’t clear. I don’t think we’re in disagreement. :)",
                  "author": "bornonsunrise",
                  "created": 1608320275,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gg94ch2": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg94ch2/",
          "text": "If a student has a clearly document accomodation for 150% exam time and the professor doesn't grant it, that is absolutely a fuckup by the professor.\n\nI'm sympathetic because online exam systems can sometime suck, or even not allow variable exam time for different students, but everyone has been online for a semester+ at this point.",
          "author": "Homomorphism",
          "created": 1608301682,
          "upvotes": 14,
          "replies": {
            "gga7o06": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gga7o06/",
              "text": "As I pointed out, there are numerous reasons why an exam could stop or kick you out despite having the appropriate time accommodations programmed into the test.\n\nStudents with bad internet connections get kicked all the time.  If you use any browser security and they try to open tabs or do something they can't the exam also closes down.\n\nAt mine, for finals, the students with extra time have to approve their start and end time with the office to make sure this doesn't conflict with other finals,  If they don't do this properly and start with the rest of the class, the exam will close with the rest of the class.\n\nThere are a whole host of things that could have messed this up, including but not limited to , the professor fucked up.",
              "author": "PersephoneIsNotHome",
              "created": 1608319431,
              "upvotes": 2,
              "replies": {
                "gga8x5s": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gga8x5s/",
                  "text": "OP gave a straightforward explanation for the technical issue. They, of course, could be lying or misinformed, but my read of the situation is that the professor didn't correct accommodate them.",
                  "author": "Homomorphism",
                  "created": 1608319971,
                  "upvotes": 3,
                  "replies": {
                    "ggalevu": {
                      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggalevu/",
                      "text": "OP literally said \" I got stopped at 1 hour and 30 minutes\"\n\n\nThat is not lying or misinformed, they just know that the exam stopped.  They don't know why it got stopped.  I pointed out may reasons why in an LMS this could occur , and regularly does occur, without the prof being at fault, and pointed out that you catch more flies with  honey than with vinegar.\n\nHow many online exams have you  made and administered?",
                      "author": "PersephoneIsNotHome",
                      "created": 1608325396,
                      "upvotes": 2,
                      "replies": {
                        "gganrs8": {
                          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gganrs8/",
                          "text": "If the professor assigned the times incorrectly, it's a mistake. I'm not saying this is the worst thing ever (because LMSes are frequently bad) but it's definitely their responsibility to fix this error.\n\nAs always, it's better to be polite, but OP has every right to be upset that someone else messed up, *especially* if they are not being helpful in fixing it. I can't really assess whether the professor is being appropriately helpful, though.\n\nI have (as part of a teaching team) helped run four online exams. I'm aware they're complicated and easy to screw up, I'm just also saying that it seems like it's not OP's fault.",
                          "author": "Homomorphism",
                          "created": 1608326517,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gg9zgww": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9zgww/",
          "text": "You sound ableist.",
          "author": "eelninjasequel",
          "created": 1608315919,
          "upvotes": 6,
          "replies": {
            "gga53hy": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gga53hy/",
              "text": "Ok,  What did I say that makes you think that.",
              "author": "PersephoneIsNotHome",
              "created": 1608318323,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gg9f6xh": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9f6xh/",
      "text": "Send an email to the disability services offices and cc the department chair and dean of the professor. You need a paper trail here and emails are always better than phone calls.",
      "author": "Nylonknot",
      "created": 1608307391,
      "upvotes": 4,
      "replies": {}
    },
    "gg92obw": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg92obw/",
      "text": "The LMS (canvas, Blackboard or other) that you’re school uses probably is set to show the results of your latest attempt. I imagine that your professor will combine your answers across both attempts. But your LMS will automatically show your latest attempt. \n\nI don’t know how long it has been, but if that score remains, contact your professor regarding the score.  They made a mistake regarding the time allotted but appear to be trying to remedy it.",
      "author": "ILoveCreatures",
      "created": 1608300694,
      "upvotes": 3,
      "replies": {}
    },
    "gg936rq": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg936rq/",
      "text": "I’d send an email like this to the accommodations office:\n\n“Hello X,\n\nI’m writing you because I had an issue with a final exam in one of my courses. Rather than receiving my time-and-a-half accommodation, the professor only gave me half the normal allotted time. When I brought this up, he simply had me log back into the exam and take it two more times as a way to try to give me the full time. I was supposed to only do the questions I hadn’t done already. I tried to do this, but I really struggled with it and I don’t believe my accommodation was fairly met. I wasted time trying to identify which questions I’d already answered, and the additional hassle really stressed me out and reduced my ability to focus.\n\nMy final grade for the exam is confusing to me. Apparently I got a perfect score on the first attempt, and got very few correct points on the later attempts. This indicates to me that I was doing well until the formatting threw me off, and it makes me think that the assessment format (and lack of accommodation) influenced my grade negatively. I’ve tried speaking with the professor to get some clarification on the grade, but I’ve been able to successfully do so.\n\nCould you please give me advice about how to handle this situation? I’d be more than happy to retake a second version of the exam with the correct accommodations, but I’d also like to defer to your input about whether or not my accommodation was appropriately met. Any input would be appreciated!\n\nThanks,\nX”\n\nHonestly, this is something that they should take over. It sounds like a severe enough violation of your accommodation that they’d tell the professor to give you a make-up of some sort, and at that point the professor couldn’t decline. Mistakes happen—I know I’ve forgotten to give an accommodation once or twice before—but the remedy needs to either level the playing field or even default a little bit in your favor. You should never be punished because of a lack of an appropriate accommodation. But that office can handle this better than you can, and they can make demands of the professor that you can’t make, so I’d let them handle it.\n\nEdit: I’d make sure you answer any questions that they ask you, but keep in mind your professor may see all these emails so don’t say anything exaggerated, inaccurate, or less than complimentary. Do your best to always portray it as a mistake, not as anything else.",
      "author": "zarza_mora",
      "created": 1608301007,
      "upvotes": 3,
      "replies": {}
    },
    "gg8ygxc": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8ygxc/",
      "text": "The biggest issue here for me is that you are fully entitled to 4.5 hours to take the test and only received 3. This is a significant mistake and you should not only be able to see the final exam but request a second full attempt (or at least another 1.5 hours to work on it).\n\nDefinitely echo the advice to contact various people: first the professor of course. But also the ombudsperson, your dorm head, the academic dean, any disability officer you know of, etc. I would be careful not to throw this on the professor as an intentional mistake. The school will most likely side with the prof. But if you just explain that the requirements were not met and ask how to proceed, hopefully the school will respond quickly and fairly.\n\n\\[I'm a PhD Candidate teaching in a history department and I work with AEO (Accessible Education) students\\]",
      "author": "the1goodknight",
      "created": 1608297994,
      "upvotes": 5,
      "replies": {
        "gg94fei": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg94fei/",
          "text": "I'm curious - Why would the student want to contact the dorm head to reconcile improper exam conditions?",
          "author": "Esmereldista",
          "created": 1608301728,
          "upvotes": 6,
          "replies": {
            "ggc0f1s": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggc0f1s/",
              "text": "Perhaps it’s just at my university, but the dorm head also functions as a student advocate and is an intermediary between students and professors.",
              "author": "the1goodknight",
              "created": 1608354968,
              "upvotes": 2,
              "replies": {
                "ggevucq": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggevucq/",
                  "text": "Good to know. Thank you!",
                  "author": "Esmereldista",
                  "created": 1608418798,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gg878nx": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg878nx/",
      "text": "What do you mean by \"wont let me see my own final\"....??  It sounds like there WAS no final.  \n\nYou need to be in FULL communication with your professor.  (you're leaving a lot out, here...)\n\nOther people who say \"talk to the accommodations person\" or talk to the omsbudsman\" are missing the crucial first step.  Tackle this with the professor FIRST.  \n\nFrom a professor's standpoint, there are two issues:\n\n1) Who screwed up?  One of two things happened:  either you screwed up (by signing in wrong, following incorrect instructions, etc.) or she/he/they screwed up (set the exam-time incorrectly... VERY easy to do on Canvas or Blackboard or whatever system you used.)\n\nDon't assume it was the professor.  It might have been you.  Your job is to write a full, careful account of what happened.  Note:  a \"yo, prof, the exam done messed up, that's not fair!\" doesn't cut it here.  You need a full detailed explanation about how you logged in, what you did, what you expected, what it cost you (in terms of time, focus, and concentration), and then ask for suggestions on what, if anything, might be done.\n\n2)  What to do about it?   Clearly, your whole exam is messed up.  (multiple attempts, etc.) \nMost professors would get exhausted just thinking about this problem... and he/she/they have 400 other students to get final grades into the system for.  You are going to be LAST priority over those 400 other students, because you present a problem. \n\nGive the professor time, but be in full communication...  ask them to fill you in on what can be done once they have the time.",
      "author": "DerProfessor",
      "created": 1608273126,
      "upvotes": 18,
      "replies": {
        "gg8938n": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8938n/",
          "text": "Respectfully, I disagree that they will be the last priority. In my experience, the squeaky wheel gets the grease--students who are in direct communication with professors (complaining or bringing up issues) tend to get addressed before (or at least with more urgency) anyone else.",
          "author": "ExtraSmooth",
          "created": 1608274641,
          "upvotes": 32,
          "replies": {
            "gg8dq50": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8dq50/",
              "text": "well, maybe...but not at finals time.  When I'm getting grades in for a class of 200, I don't even *read* emails from students.  Those grades are due in 48 hours, usually, and they take priority over everything else.    \n\nI can easily give a single kid a grade and change it later.  But if I miss that deadline for 200 kids, that's two *hundred* grade changes.  And my department secretary and the Registrar and the Dean all yelling at me.  not good. \n\nSo, in this case, complicated issues--\"squeaky wheels\"--go last.  Indeed, I might even just throw down a 'placeholder' grade for them, just to get something in the system, and worry about what actually happened later.",
              "author": "DerProfessor",
              "created": 1608278752,
              "upvotes": 9,
              "replies": {
                "gg8tij4": {
                  "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8tij4/",
                  "text": "Sure, but if it's a learning accommodation issue, which it is, he's most likely entitled to a complete redo of the exam if he brings it up to the disabilities office, which he 100% should since his accommodations weren't met. That's something the professor needs to deal with immediately.",
                  "author": "mesilver47",
                  "created": 1608294203,
                  "upvotes": 3,
                  "replies": {
                    "gg9452y": {
                      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9452y/",
                      "text": "In a case like this, a grade of incomplete may be warranted (that doesn't hurt the GPA). That would allow the professor time to re-write the exam (a process that sometimes takes \\*days\\*), get their grades in on time, an allows the student to recover from the shock of what just happened and get the full time they're entitled to. Or, if changing grades is not terribly difficult, then the professor can offer a new exam after the rest of the grades turned in. \n\nI'm not sure that most people realize what a big deal it is if the professor misses the grade deadline. And yes, I do realize what a big deal it is for a professor to miss accommodations, which is why they need an appropriate amount of time to correct the issue.",
                      "author": "Esmereldista",
                      "created": 1608301563,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gg8gjfk": {
          "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8gjfk/",
          "text": "OP isn’t presenting a problem. Whatever this fucked up system is, is the problem. But I get what you mean.",
          "author": "AndrogynousHobo",
          "created": 1608281466,
          "upvotes": 6,
          "replies": {
            "gg8zdch": {
              "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8zdch/",
              "text": "Like a student never followed instructions improperly and then got dinged for it and blamed someone else.\n\nOr a student never read the email about how grades were going to be posted in this case.\n\nAbsolutely no chance of that happening at all.",
              "author": "PersephoneIsNotHome",
              "created": 1608298613,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "gg9eni6": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg9eni6/",
      "text": "The appropriate order of contact is: 1. the professor, 2. the chairperson of the department, 3. the dean of the school, 4. the VPAA, each contacted if you don't get an appropriate answer from the previous person. I would contact the disability services person with a copy of the email to the chair so that they're in the loop. If you don't get an appropriate answer from the chair, then I'd contact the disability services person separately. They will have their own processes to follow.\n\nAnd, surely you know not to use \"fucked up\" in any of your professional communications and, quite frankly, don't blame the professor for messing up your disability accommodations since EVERYBODY knows already that he is the one who set the time parameters and didn't do it correctly. Only if it gets to the level of the VPAA would I point that out. \n\nOne thing you could do is consider to what extent a mistake with the fix of your accommodation being to just start again with the questions that you hadn't done might have messed you up. You say it did in answer to somebody's post. If you really think it did mess you up you could argue for a whole new final exam, particularly if your accommodation involves anxiety. That would certainly not make the professor happy and I wouldn't suggest saying that unless/until you get to the chair level. I was a chair and if one of my faculty had done this I would have sat with him/her and asked what could we do to make it completely fair for the messed-up student given the accommodations. There are several possibilities and one is a complete redo.\n\nBy the way, the numbers are fine. Faculty do that for a variety of reasons, including making their grading non-obvious to students or a belief that a given problem is worth 50 points while another is worth 54 points, and so on. I think that belief is likely magical thinking, but faculty are free to do so if they'd like. The numbers available on the exam are not likely to be a topic of conversation between the faculty member and higher-ups if this goes up.",
      "author": "rockyfaceprof",
      "created": 1608307121,
      "upvotes": 2,
      "replies": {}
    },
    "ggawjq1": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggawjq1/",
      "text": "My only recommendation is to be polite.\n\nBeing polite leads to getting what you want more often.\n\nHad a student from hell once. I won't bore you with the story, but... treat the professor like you would want to be treated if the shoe were on the other foot. Even if you're angry or frustrated. Especially if you're angry or frustrated.",
      "author": "uniadminthrowaway",
      "created": 1608330972,
      "upvotes": 2,
      "replies": {}
    },
    "ggbilx4": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggbilx4/",
      "text": "Email your disability office **right now,** and call them as soon as Monday morning arrives.",
      "author": "TBDobbs",
      "created": 1608343578,
      "upvotes": 2,
      "replies": {}
    },
    "gg98aft": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg98aft/",
      "text": "Instead of adjudicating this here, talk to your university and find out how things get addressed there. If you have an ombudsman then a discrete discussion might really help. Or discuss this with your department chair. Generally speaking you will get  further faster if you are confident without being accusatory. Suggest that a mistake or system malfunction has happened, offer a way out and suggest a solution. \n\nGood luck.",
      "author": "Jumanji_Crickets",
      "created": 1608303856,
      "upvotes": 1,
      "replies": {}
    },
    "ggkwsom": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/ggkwsom/",
      "text": "Yall have been so awesome, when the whole kerfuffle is sorted out ill post screenshots of the resolution! Also i know my OP was hostile and i wanna prove that i have good communication skills hhaha",
      "author": "Fearless_Way_9931",
      "created": 1608553738,
      "upvotes": 1,
      "replies": {}
    },
    "gg8open": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8open/",
      "text": "Put in a formal complaint with the school",
      "author": "Adomillad",
      "created": 1608289611,
      "upvotes": -3,
      "replies": {}
    },
    "gg8zmez": {
      "link": "/r/AskAcademia/comments/kfdp1b/professor_wont_let_me_see_my_own_final_grade/gg8zmez/",
      "text": "You need to email your Department chair and CC the professor. And reach out to the part of your university that handles student complaints. Since this is about accommodations, you have a lot on your side here. Something bad happened, and you can see that just from the time limit not being what you were granted by your disabilities office",
      "author": "Mallornthetree",
      "created": 1608298781,
      "upvotes": 0,
      "replies": {}
    }
  }
}