{
  "sid": "oyhx8x",
  "link": "/r/AskAcademia/comments/oyhx8x/what_is_the_situation_with_the_arts_in_academia/",
  "title:": "What is the situation with the Arts in Academia?",
  "text": "I'm from the UK. I got top grades for my degree in Drama & Theatre Studies. I would love to pursue a masters + PhD = followed by a career in academia.\n\nBut it seems the arts is in a super shitty situation right now. 10 years ago the UK arts education sector was doing well in comparison to modern day. Now its been progressively going down hill with the UK government axing funding left right and centre in all age categories, coupled with a strong push away from the arts and humanities for teenagers.\n\nIn a few years (2025) in order to achieve a 'good' rating for your secondary school (11-16yrs) 90% of kids will have to choose industry subjects only \\[science, maths, english, business etc\\]. Kids are being forced to avoid humanities and arts progressively. \n\nThis is going to decimate the arts subjects in universities which are already struggling, I graduated in 2015 and over the past 5 years I've spoken to my lecturers and they said things have become harder and have changed. \n\nI even visited my local sixth form college (16-18yrs) in my hometown to find 90% of the staff have been let go. 10 yrs ago when I was there it had 3 full time drama teachers, 3 part time drama teachers, 2 music teachers, 2 lighting technicians, 1 dance teacher. Now it has 1 part-time drama teacher, 1 part time lighting tech. Music and dance is gone. GONE! \n\nAnyway what is everyone else's experience? In the UK, US, AUS, NZ, CAD, IRE? Is there any chance of working in academia abroad where it is blossoming? Or is it the same story everywhere else?",
  "author": "rayman713",
  "created": 1628171308,
  "updated": 1634080007,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "h7tlgvo": {
      "link": "/r/AskAcademia/comments/oyhx8x/what_is_the_situation_with_the_arts_in_academia/h7tlgvo/",
      "text": "I'm not in theatre or drama, but my campus does have a fairly thriving theatre program. The problem is that as academic jobs have become more rare in this field, the competition has increased dramatically. I work at a small, rural college in the US. Our tenure track hires all have 10+ years experience working in theatre, and most of them have experience working on broadway productions, not just working at a regional theatre. Most of them did an undergrad, and then got top-tier experience before pursuing a PhD. \n\nThey have excellent teaching records, and production experience that's kind of dizzying. They know writing, tech, costume design/production, lighting- they can basically do it all, and do it all quite well. Oh, and they have publications, on top of all the rest of it. \n\nI don't know the landscape in this field, but if my dinky college out in the middle of nowhere hires theatre people with those qualifications, then I can only assume it gets even more competitive in desirable locations. \n\nSeveral people in my family work in theatre and can't even get adjunct work- granted, their theatre experience is in regional stuff. \n\nAs a rule of thumb, it's not safe to bet on any kind of academic work right now, especially with the uncertainty of COVID. Based on what I've seen, it's perhaps worth aggressively pursuing theatre work before trying to move straight to academia. \n\nIn the past searches we've run, there have been \"academic\" candidates (people who have done theatre work in college, but who went straight from undergrad to phd) that weren't even considered due to their lack of experience (despite having solid teaching and publication records).",
      "author": "cdb3492",
      "created": 1628179269,
      "upvotes": 6,
      "replies": {
        "h7vhm66": {
          "link": "/r/AskAcademia/comments/oyhx8x/what_is_the_situation_with_the_arts_in_academia/h7vhm66/",
          "text": ">adjunct\n\nwow okay that is very helpful thanks!",
          "author": "rayman713",
          "created": 1628208343,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7t95xo": {
      "link": "/r/AskAcademia/comments/oyhx8x/what_is_the_situation_with_the_arts_in_academia/h7t95xo/",
      "text": "The trouble with publicly funded academia is that it has to be, on the whole, backed by the public. When there is money available, governments have no problem providing widespread funding to arts and humanities. However, with global economic difficulty coming out of the 2008 recession, funding green initiatives and now with Covid-19, the money isn't there. \nThe priority of the government and majority of the public is research that benefits people in the medical sciences, engineering and technology i.e STEM. No one wants their taxes to be spent on another 4yr PhD studying whether the misogynistic attitudes displayed in Jane Austen's novels are in line with social attitudes at the time of writing. The public want it to be spent on someone doing research into a devastating disease or green technology that could improve the climate crisis. \nThe arts and humanities rely a lot on philanthropy, and even philanthropists are switching to STEM as it's importance becomes more evident to those outside of the field. \nFor the same reasons, arts and humanities subjects are being dropped in favour of STEM subjects as this is the direction the government wants to take to economy in future.  As STEM sectors expand, the job prospects there become far greater than the arts.\nThe simple answer is, funding and education is guided by public and government opinion of what is important. The view is that STEM is far more important than the arts.",
      "author": "ModeCold",
      "created": 1628174202,
      "upvotes": 7,
      "replies": {}
    }
  }
}