{
  "sid": "qf7nc6",
  "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/",
  "title:": "Is the academic system reaching a point where the scientific advancements are becoming too complicated and expensive such that it will no longer be possible to churn out the same numbers of PHDs? How will the academic community respond if such a point is reached?",
  "text": "Given that to get your phd, you have to expand science or knowledge somewhat, which means that the next phd student will have to have slightly more work to advance it and so on.  From what I understand, phd students are taking longer and longer to complete their studies, but the economy still needs them for education and work.  What happens if there is no longer enough phds to fulfil societies needs?  \n\nI imagine some fields this won't matter, but in sciences and math, it would be worse.",
  "author": "SanDiegoof",
  "created": 1635131105,
  "updated": 1636172241,
  "over_18": false,
  "upvotes": 73,
  "upvote_ratio": 0.84,
  "comments": {
    "hhxzdue": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhxzdue/",
      "text": "Trust me, there are far far more PhDs still being churned out than open positions in academia. Just ask a professor or hiring manager how many applications they get for an open tenure-track position\n\nMeanwhile, you don't even need a PhD to get a job in industry...",
      "author": "H4R81N63R",
      "created": 1635131459,
      "upvotes": 106,
      "replies": {
        "hhz511f": {
          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz511f/",
          "text": "There's more nuance to that. Specific jobs in industry do require a PhD",
          "author": "JHDog93",
          "created": 1635163261,
          "upvotes": 21,
          "replies": {
            "hhzayik": {
              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzayik/",
              "text": "Sure, but you don't need a PhD to generally do the transition as those jobs that don't require a PhD are still a lot more common (meaning that again we have more graduates than jobs on their education level for them). The exact ratio of course depends on your field (and even sub-field).",
              "author": "LittlePrimate",
              "created": 1635166754,
              "upvotes": 7,
              "replies": {
                "hhzf418": {
                  "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzf418/",
                  "text": "Yeah, don't get me wrong I agree with you on the academia front. But the market is actually super hot for PhDs right now in industry,, but they're at the higher researcher level as opposed to a research associate which would only be applicable for bachelors. Yes they're the same industry, but they're competing for a completely different job market.",
                  "author": "JHDog93",
                  "created": 1635168888,
                  "upvotes": 6,
                  "replies": {
                    "hi8t0sx": {
                      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hi8t0sx/",
                      "text": "My experience differed but we may talk about different bubbles here.  \n\nMost people I know with a (usually Neuroscience) PhD had a hard time transitioning to industry and most ended up with jobs that didn't require a PhD. As I'm European they of course also had a Master degree but \"not needing a PhD\" and Bachelor Vs Master are of course two different discussions. I'm still definitely at fault for not making that distinction more clear as I of course kind of default to \"no PhD = you have a Master\" which simply isn't true for some countries.  \n\nPersonally I don't know anyone who got a lab or even research job in industry (where of course \"bubbles\" come into place), my peers and I am went to more or less \"transferable skills jobs\" so PR/science communication, patent right, Data Analyst, Software Dev/Tester, IT, Project Manager, Quality Assurance etc pp. We also usually did extra training or certificates before most of us found a job, but I think that's actually again very Germany-specific. Here the problem is that too many people apply for such jobs so they simply give preference to those who can show they had job related formal training. I was told e.g. North Americans are less easily impressed with certificates, not sure if that's for the better or worse.\n\nI'm always curious about official numbers but mostly I see anecdotes about that topic.",
                      "author": "LittlePrimate",
                      "created": 1635341108,
                      "upvotes": 1,
                      "replies": {
                        "hi8yuhb": {
                          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hi8yuhb/",
                          "text": "I see where you're coming from. I'm in the molecular medicine route in the Boston area, so I know many PhDs who have had a job lined up immediately after defending. But again, now that you mentioned it- it could be survivor bias on my part and I understand that it may not be as applicable to many new doctorates.",
                          "author": "JHDog93",
                          "created": 1635343781,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hhzble9": {
              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzble9/",
              "text": "I think you can get around that with experience in many cases. I have a friend with a decade of experience in research, many high profile publications and was headhunted for the COO position of a startup (her job is literally to establish the entire research program of the startup) with a lot of venture capital. She \"only\" had a bachelor's.",
              "author": "NosemaCeranae",
              "created": 1635167091,
              "upvotes": 5,
              "replies": {
                "hhzft6z": {
                  "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzft6z/",
                  "text": "You totally can, but I wouldn't say it's \"many\". In most cases your degree plays a large role in your career progression. Cheers to your friend, that's a great achievement. However understand that not many bachelors have the opportunity to publish on high profile journals. Many bachelors don't even go into R&D labs.",
                  "author": "JHDog93",
                  "created": 1635169226,
                  "upvotes": 4,
                  "replies": {
                    "hhzgbog": {
                      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzgbog/",
                      "text": "> However understand that not many bachelors have the opportunity to publish on high profile journals. Many bachelors don't even go into R&D labs.\n\nOK. I'm not trying to be combative but this came off as needlessly condescending. I'm not indicating that a large proportion of people that have earned bachelor's go into R&D positions or easily get industry jobs. She wasn't an undergrad at the time of those publications - she had already graduated. She had the opportunity to get those publications because she started as a research assistant and took initiative to develop her own research projects, building experience and credibility along the way. I'm just pointing out that, in contrast to academia, industry is more likely to look past the lack of an advanced or terminal degree and instead consider experience. Maybe that's not borne out in the numbers, but that's my experience, I just gave one concrete example.",
                      "author": "NosemaCeranae",
                      "created": 1635169468,
                      "upvotes": 1,
                      "replies": {
                        "hhzjaub": {
                          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzjaub/",
                          "text": "I don't understand how what I said was being condescending. I literally said it was a great accomplishment for her to become COO. Just because I generally disagree with you doesn't mean I'm attacking you or your friend. \n\nYes I understand that she probably worked her butt off getting those publications and progress in her career. I am not taking anything away from that. However you can't look at this anecdotal experience and apply it to most bachelors in industry, that was my point. Most bachelors don't work in R&D labs so they're not given the opportunity to publish. Is it bad or good? I don't know, it's just what it is.",
                          "author": "JHDog93",
                          "created": 1635170861,
                          "upvotes": 3,
                          "replies": {
                            "hhzkm7i": {
                              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzkm7i/",
                              "text": "> Just because I generally disagree with you \n\nNo. Not because you disagreed, but because you made the assumption that I don't have a basic understanding of academia. \"However understand...\" like you're an authority making a proclamation to an underling.\n\n>However you can't look at this anecdotal experience and apply it to most bachelors in industry\n\nI literally didn't do this. I'm confused about the misunderstanding you're having. I just pointed out a difference between academia and industry in terms of how they look at the degrees you hold. I gave one example, but I know quite a few people I graduated college with that went right into high paying industry jobs with just a bachelor's. Not making a sweeping claim, just talking trends, here.",
                              "author": "NosemaCeranae",
                              "created": 1635171476,
                              "upvotes": 1,
                              "replies": {
                                "hhzlu3l": {
                                  "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzlu3l/",
                                  "text": ">Not because you disagreed, but because you made the assumption that I don't have a basic understanding of academia\n\nWe're not talking about academia, we're talking about industry. In no way did I make that assumption.\n\n>I literally didn't do this. I just pointed out a difference between academia and industry.\n\nMy original comment wasn't about academia vs industry, it was that bachelors will have a different job market than PhDs even though they're in the same industry. Perhaps here is why we're not on the same page.\n\nIt's odd that you got so offended by this.  I'm not trying to cause an argument. However I can tell this convo is no longer constructive. So I will not respond anymore. Have a good day.",
                                  "author": "JHDog93",
                                  "created": 1635172037,
                                  "upvotes": 1,
                                  "replies": {
                                    "hhzr06k": {
                                      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzr06k/",
                                      "text": "The issue is that you don't really need publications to progress in industry (or get a high paying position). In fact, many companies will look more favourably a CV from a candidate with 4 years of experience in industry than the CV of a recently graduated PhD.\n\nCompanies want skills. They don't really care how did you acquire them.",
                                      "author": "EGCCM",
                                      "created": 1635174291,
                                      "upvotes": 5,
                                      "replies": {
                                        "hhztftl": {
                                          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhztftl/",
                                          "text": "I 100% agree that experience and soft skills is definitely the most important aspect in an applicant.\nYes publications aren't necessary.\n\nMy point is that a recent PhD grad isn't going to be applying to the same jobs as a bachelors grad, even if said bachelors grad has 4-5 years experience. Typically a PhD grad will be hired on as a scientist/senior scientist and an bachelors with those years of experience would likely be an senior RA or principal RA. Not that this is guaranteed of course, but it is the norm.",
                                          "author": "JHDog93",
                                          "created": 1635175345,
                                          "upvotes": 1,
                                          "replies": {
                                            "hhzutvq": {
                                              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzutvq/",
                                              "text": "I work on bioinformatics, so things will be a bit different than wet lab positions. \n\nI think that as a generalisation your point works, but with quite a few exceptions of senior RAs that might be interested in getting into the scientist path.",
                                              "author": "EGCCM",
                                              "created": 1635175937,
                                              "upvotes": 1,
                                              "replies": {
                                                "hhzv2te": {
                                                  "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzv2te/",
                                                  "text": "Ahh that makes sense. Yeah I was mostly speaking from a wet lab perspective.\n\nBut yes I do acknowledge there are exceptions.",
                                                  "author": "JHDog93",
                                                  "created": 1635176040,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "hhzs5g3": {
                          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzs5g3/",
                          "text": "I don’t think there was a condescending tone in any of these responses, but am sorry you are interpreting them that way.",
                          "author": "itshorriblebeer",
                          "created": 1635174789,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hhy4ljc": {
          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhy4ljc/",
          "text": ">Trust me, there are far far more PhDs still being churned out than open positions in academia. Just ask a professor or hiring manager how many applications they get for an open tenure-track position\n\nDo you think there are changes that need to be made?  I always figured that PhDs were in high demand in industry and academia, but it sounds like it is the opposite of what I believed.",
          "author": "SanDiegoof",
          "created": 1635134452,
          "upvotes": 5,
          "replies": {
            "hhyjyli": {
              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhyjyli/",
              "text": "Professors benefit from having large numbers of PhD students to do all the work, cheaply. Unfortunately there are not enough permanent academic positions for these PhD students, and the majority of industry jobs also do not require a PhD. It's easy to increase the number of PhD students, but what will become of them after they graduate?",
              "author": "cybersatellite",
              "created": 1635145723,
              "upvotes": 32,
              "replies": {
                "hhz027o": {
                  "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz027o/",
                  "text": "This it really just a pyramid scheme.    Im sure there will be a delay, but imagine if job opportunities open up for people with masters and bachelors, the pipeline of PhD applicants may start to dry up.",
                  "author": "Madefix33",
                  "created": 1635159792,
                  "upvotes": 5,
                  "replies": {
                    "hhz1o4f": {
                      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz1o4f/",
                      "text": "but look at all the jobs that require a bachelors when there is no need for one.   it might become like that if there is any value to the phd work done",
                      "author": "bu11fr0g",
                      "created": 1635160987,
                      "upvotes": 2,
                      "replies": {
                        "hhzd9qb": {
                          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzd9qb/",
                          "text": "Yeah, we're already experience degree-fatigue in some job fields, which always makes me wonder why not more companies try to invest in alternative programs where people are actually doing that job (or at least learn the exact skills) for 5+ years, instead of getting an unrelated degree and still being at starter level. Because a PhD is training to be an academic researcher, using that degree in industry is really just an after-thought for many jobs and wouldn't actually make you any better at the job (sometimes I fear it can even make you worse, as you'll learn different ways to handle things and prioritize etc).",
                          "author": "LittlePrimate",
                          "created": 1635167968,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hhyn1np": {
                  "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhyn1np/",
                  "text": "So do you think that research positions that PhD students are placed in should be paid better and treated more like jobs, so that the position is less of an overworked and underpaid transitional space?  On job listings, I have seen a PhD be listed as a requirement equal to an undergrad degree with experience, is this common in industry, or do PhD students get shafted and have to apply for the same type of entry level positions that undergrads like me apply for?  \n\nThe second question is the important one, because PhD students who don't get hired in academia or specific PhD level positions would get little reward for their work.",
                  "author": "SanDiegoof",
                  "created": 1635148311,
                  "upvotes": 7,
                  "replies": {
                    "hhypbg4": {
                      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhypbg4/",
                      "text": "I do think PhD students need to be paid better because it's not quite like being a student, their main job is to produce research that's part of their advisor's research program. (That's why grad students are unionizing too in many schools)\n\nI've definitely seen some jobs where PhD counts as work experience. But I also know PhD students applying to entry level jobs that don't require a PhD. Additionally, sometimes being in academia too long, e.g. postdoc applying for industry job, can be seen as a negative in industry because the postdoc expects to be paid more but all that extra academic experience may not be useful for the company.",
                      "author": "cybersatellite",
                      "created": 1635150423,
                      "upvotes": 20,
                      "replies": {}
                    },
                    "hhzcuqm": {
                      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzcuqm/",
                      "text": "In my experience (more inside of Europe), doing a PhD is usually not worth it (career-wise) if you do not absolutely need it for the job you want to work.  \nSimply because that title can't really replace 5+ years of job experience and salary raises you can collect in the same time.  \n\nWith a PhD you also often run into the \"no real world experience\" problem. You never learned how companies work and only know how to work in an academic setting. You also usually lack experience in that exact job so yes, you absolutely are at risk of being put on a junior position because doing a PhD for 7 years in Biology doesn't mean you have any job experience as Consultant or whatever. You're also \"oVerQUaLIfiEd\" which just means that they prefer to hire someone with less degrees for less money (because they assume you'll ask for more or demand more raises). Another problem I observed is that especially for the \"transferable skills\" companies often seem to hesitate because they don't have a way to tell how good you actually are in those as you never received any formal training.",
                      "author": "LittlePrimate",
                      "created": 1635167754,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hhzivju": {
                      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzivju/",
                      "text": "Q1: I know it's an unpopular opinion, but I felt like my PhD work was treated like a job and was fairly compensated. ~35-40k (higher end but also high cost of living) for 20 hrs of work, plus full tuition and benefits, unprecedented flex hours. If you want to equate that to a FT job that's 100k+ in compensation.\n\nFor 'entry level' research track we higher BS+5, MS+3, PhD+0 (pref postdoc, depending on position and hiring pay grade). For more technician roles, it's generally BS+2 or MS+0; though we consider PhDs, there becomes an issue of making sure they are intellectually satisfied and actually want to stay in that type role (can still advance, but still doing technical work). \n\nQ2: Personally I did not do a PhD (solely) for the specific job prospects; my intellectual curiosity and getting paid to explore that drove me to keep going with my education. The learning and personal growth itself was the reward. The post grad job is just a very nice bonus.",
                      "author": "HappyHrHero",
                      "created": 1635170663,
                      "upvotes": 0,
                      "replies": {
                        "hhzq3fj": {
                          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzq3fj/",
                          "text": "Well, for 20 hours a week if you treat your own research as a volunteer activity…Most PhD students work at least 40-50 hours, and many work much more, in total, most of which goes unpaid.",
                          "author": "Thisisstillkansas",
                          "created": 1635173898,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hhz5lv5": {
          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz5lv5/",
          "text": "> Meanwhile, you don't even need a PhD to get a job in industry...\n\nThis depends largely on the field. In some fields, lots of industry positions do require PhDs, at least in practice. Many jobs in these fields will outright state that a PhD is required or at least strongly desired. For those that list only a master’s degree as a requirement, however, the reality is often that it’s still incredibly tough to get hired with just that because the applicant will almost always be competing against candidates who *do* have PhDs (including, often, postdoctoral study and/or cited publications).",
          "author": "Northwind858",
          "created": 1635163640,
          "upvotes": 2,
          "replies": {
            "hhzqfw5": {
              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzqfw5/",
              "text": "I think it would be really helpful if comments like this would name names, field-wise. There’s such enormous variety between industries and someone with experience in (say) math has absolutely no idea what things are like for chemists or nuclear engineers.",
              "author": "Thisisstillkansas",
              "created": 1635174047,
              "upvotes": 1,
              "replies": {
                "hhzthc1": {
                  "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzthc1/",
                  "text": "Fair enough! I studied linguistics, specifically (because that’s a broad field) the more ‘hard-sciencey’ aspects of linguistics (empirical data collection and modelling; scientific method; statistics; corpora; some programming in Python, R, and XLE; high-level maths and formal logic; etc.). In the USA, almost no universities even offer terminal master’s degrees in what I do, probably because it’s damn near impossible to get hired without a PhD. One often cannot even apply to master’s degree programs in what I do; in most cases they *must* apply straight to `master’s + PhD` programs.\n\nI’ve lived the experience of this. I have a BA, Magna cum Laude with highest honors, from a top-2 university but I got rejected from 11 straight PhD programs in the US. At a friend’s advice I ended up attending (and self-funding with loans) a master’s degree programme in Europe to bolster my CV, but unfortunately there ended up being *things* going on in that department and over the course of the second year of the programme roughly 50% of the faculty and almost all the postgraduate students ‘left’ the department. I was no exception. I had to return to the US in the second half of 2019 with a lot of debt and no real job or even housing prospects lined up (and we all know what happened a few months later).\n\nI’m now making $15/hr and I hope to start training to be a pharmacy technician. It’s not what I wanted to do. I really wanted to work in my field or a related one (since the skills are highly transferrable), and would have loved to get a PhD to do it—but after the last 18 months I’ve had to settle for not starving or being homeless.",
                  "author": "Northwind858",
                  "created": 1635175362,
                  "upvotes": 2,
                  "replies": {
                    "hi00utj": {
                      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hi00utj/",
                      "text": "Oof. That's a sad story. I hope getting into a less...red-in-tooth-and-claw field ends up working well for you in the end.",
                      "author": "carlskevin",
                      "created": 1635178406,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhyjue9": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhyjue9/",
      "text": "Your premise implies that each new phd student has to understand all of the research leading up to their project. However that’s far from the truth. For a trivial example: many scientists do a theoretical PhD in which they write computer simulations. But how many of them understand how a modern CPU is constructed? Probably very few, and for good reason. Most of the research behind any topic gets abstracted away and the student focuses on only the most relevant layers.",
      "author": "TheSwitchBlade",
      "created": 1635145628,
      "upvotes": 31,
      "replies": {
        "hic94g6": {
          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hic94g6/",
          "text": "I imagine sometimes that centuries from now we might reach a point where an advance in even the narrowest of focuses requires so much study it cannot be done in a lifetime.  But as like a premise for sci-fi really.\n\nEither way we are nowhere near that in 2021",
          "author": "TheNextBattalion",
          "created": 1635393321,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhyjutx": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhyjutx/",
      "text": "No. You are way off reality man.",
      "author": "DesertAlpine",
      "created": 1635145638,
      "upvotes": 20,
      "replies": {}
    },
    "hhywvok": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhywvok/",
      "text": "I think people often confuse technological development with the need to produce more complex or just more data/analysis to get a PhD. My PhD is in biochemistry. My PhD supervisor, whose own PhD research contributed to a Nobel prize for her supervisor basically cloned some plasmids, expressed some proteins and purified some chromatin and did some very basic x-ray crystallography. These days you could knock that out in 6mo easily with much higher resolution to boot. However, at the time that was cutting edge technology and required vast amounts of work and produced foundational results. \n\nI joke about my PhD and where I work now. We have very high throughput pipelines and I find it hilarious that I'd spend weeks designing a cloning strategy and trying to get the PCR to work and where I work now people don't get out of bed for less than a thousand PCR reactions at a time. It's all robots and automation. They aren't working harder than I did, and I wasn't working harder than my PhD supervisor did. Yes the results are more complex but that doesn't equate to burning through finite resources of PhD students. \n\nThe increased competition on ever dwindling jobs is a different matter.",
      "author": "ACatGod",
      "created": 1635157235,
      "upvotes": 15,
      "replies": {}
    },
    "hhxz3hm": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhxz3hm/",
      "text": "No, because a PhD isn’t about how much money or how complicated an experiment is. It’s about developing a project",
      "author": "D1ckChowder",
      "created": 1635131302,
      "upvotes": 26,
      "replies": {
        "hhy3ejv": {
          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhy3ejv/",
          "text": "Are there limits on the project though, do they have to advance scientific understanding?  What happens when scientific understanding advances to a point where it takes decades or billions of $$$ to discover new things?",
          "author": "SanDiegoof",
          "created": 1635133729,
          "upvotes": 1,
          "replies": {
            "hhybpm1": {
              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhybpm1/",
              "text": "In certain very specific areas within specific knowledge domains, this might occasionally be the case - but the nature of knowledge development is such that there is always going to be some area within any field that may be expanded upon. Additionally, as tech progresses it opens up knew avenues that were previously unexplorable, either through the knowledge expansion itself or through cost reduction associated with tech development. Knowledge creation is an extraordinarily non-linear domain - do ur phd and this will make perfect sense.",
              "author": "scromboidfish",
              "created": 1635139221,
              "upvotes": 16,
              "replies": {}
            },
            "hhykm7z": {
              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhykm7z/",
              "text": "Of course there are the big experiments that cost 100s millions of dollars (and have thousands of people involved). But new research topics naturally arise from previous research, new technologies, interdisciplinary connections. Many are not expensive. The space of research is vast, even if you dive into a specific subdiscipline. I do not see PhD projects being limited.",
              "author": "cybersatellite",
              "created": 1635146266,
              "upvotes": 7,
              "replies": {}
            },
            "hhyxp5u": {
              "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhyxp5u/",
              "text": "That's not how innovation and R&D works. Things are expensive when they are first developed and then as more people adopt the technology and as newer versions of the technology comes along the price drops and becomes more and more accessible to the community. It becomes cheaper not more expensive to do research, although you do need to invest to be at the forefront. \n\nAs an example genomics is outpacing Moore's law in terms of data generation but the cost is constantly falling, dramatically so. It cost $14bn to sequence the first human genome and now 20 years on you can sequence a human genome for well under $1000 in a day. You can sequence viral genomes for around $15-$35 each. \n\nIt's a fallacy that important research has to cost big $$$. There's lots of research that could be transformative that costs ¢¢¢. Just as an example, treatments for menopause. Hugely neglected area, poorly understood biology, very large market. 50% of the population will go through menopause, many of those individuals will have symptoms that would benefit from treatments. We already know how to do the kind of research needed, there's a pretty penny to be made right there for not insane sums of money.",
              "author": "ACatGod",
              "created": 1635157923,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hhxzt4r": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhxzt4r/",
      "text": "We’re nowhere near that point. If anything, there’s way too many grad students for the amount of research necessary.",
      "author": "tpolakov1",
      "created": 1635131691,
      "upvotes": 14,
      "replies": {}
    },
    "hhynbmc": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhynbmc/",
      "text": "It just doesn't work like that. Thousands of students have gotten their PhDs at the LHC and its experiments and even if it all stopped today thousands more could still get PhDs on what hasn't been done yet. Complexity means more opportunities for PhDs, not less.",
      "author": "cc_cyanotephra",
      "created": 1635148564,
      "upvotes": 5,
      "replies": {}
    },
    "hhzm3h7": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzm3h7/",
      "text": "There is a major problem that we have not updated the model (conceptually or practically) for what should mean to contribute to our human scientific knowledge. Nor have we used the tools of science to evaluate how we are approaching training and growing our scientific knowledge. Let’s start with some basics. Getting a PhD is an indication that you have enough knowledge and experience to proceed to contribute to the work of science. However, the original model was that some people who were PhDs in the past (university professors) would simply read and evaluate your ideas and see if you had gone beyond what was already known in some form. This early criteria was easy to evaluate (little formal knowledge, less written down or transmitted) but clearly was already flawed. (E.g. until relatively recently, it was likely someone’s work in another language in another country might not be known. Further, doctorates have also always been a form of apprenticeship. The training in the skills needed for philosophy, science, etc. The historical structure for granting these, the expectations, etc. differed across the counties where they were being introduced. Fast-forward to the mid-twentieth century. The PhD became a more normal standard for becoming a professor in many fields where advanced studies were required. They still had a component of demonstrating sufficient knowledge and contributing novel insights, but more they required doing work under a professor as an apprentice to understand the techniques and practices of the field. But they also, as the modern capitalist framing effectively became a part of most western cultures, became a source of cheap labor. As the funding for science increased, due to the ever increasing complexity of research in biology, physics, etc., the PhD student was a cheaper alternative to hiring a ‘scientist’. This was further turned into a pyramid scheme when postdoctoral fellowships went from being optional opportunities to develop new skills to pre-requisites for getting hired in many fields. That led to a scaling of cost of labor (PhD < Postdoc < Research Scientist < Tenured Professor). Further, the increase in funding to train students at the PhD level was not matched by equivalent funding for the upper level positions, leading to ever increasing attrition across the ladder. This has led to inventive systems and metrics that are used to select as people move up the ladder—but which do not necessary correlated significantly with long term contributions to scientific knowledge. Further, they metrics are broken at most levels. For example, as a PhD student the different lengths of time between PhDs in the EU vs US create asymmetries in the likely paper produced during a PhD. Further, luck plays a major role in PhD students likelihood of publishing in a top-tier journal. As you more from Postdoc to PhD, the entire system has selected for a person who successfully works ‘alone’ or as the ‘primary’ driver of research, but the primary role of a professor is to teach and manage students and postdocs. This is not actually part of the incentive or metrics that led to—or sustain funding—at the top level.\n\nAnd this is before we get to the problem that science in many if not most fields (e.g. neuroscience, where I work) has grown so complex, requires so many skills to be brought together, that the only way to move forward as a field is to start taking larger-scale collaborative approaches to science the de-emphasize the individual and focus more on collective contributions and generating truly ‘useful’ knowledge. That is, a paper that produces a novel finding, but is never replicated, cannot be easily contextualized in the larger area of investigation due to unnecessary idiosyncrasies, etc. is likely to not actually be a ‘useful’ contribution in the long run. But the system as it is now provides impediments to moving in this direction in most fields (high-energy physics and astronomy being the notable exceptions). From funding mechanisms, to hiring, to promotion, the focus on actually generating useful knowledge and training new scientists for the changing space of human knowlege is lagging.\n\nAnd then there is the final problem. We fund science at a tiny fraction of the GDP spent on many other aspects of society. We let companies capture the profits on the backs of basic publicly funded research. The fact that we achieved a Covid-19 vaccine in record time required the combined efforts of many sectors and was built on huge amounts of basic research over the last 10-20 years. If we want to solve the problems humanity faces, we will need to shift the allocation of resources to science and applying that scientific knowledge to the problems. Of course, if we do shift those resources and recalibrate the incentives and metrics, getting a PhD is a great idea! We need more people working on the myriad of problems we need to solve if we want to avoid the disastrous consequences of climate change or cancer let alone keeping human civilization around as long as the other species who managed to get by for millions of years on this planet.",
      "author": "eejd",
      "created": 1635172157,
      "upvotes": 3,
      "replies": {}
    },
    "hhz0uvk": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz0uvk/",
      "text": "For this hypothesis to hold weight the world as a whole would have to become stagnant as far as technological advances go. The opposite is actually true.",
      "author": "ChickendantZZZ",
      "created": 1635160390,
      "upvotes": 2,
      "replies": {}
    },
    "hhz5d0j": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz5d0j/",
      "text": "If your premise is true, the opposite conclusion than the one you came to is obvious. If scientific advancements are more expensive, universities need more cheap labor - aka more grad students.\n\n> \nGiven that to get your phd, you have to expand science or knowledge somewhat, which means that the next phd student will have to have slightly more work to advance it and so on.\n\nIn practice, most dissertations are written to close a gap in a niche literature. This is in a sense expansion of scientific knowledge, but it concerns an obscure lemma (that may even be irrelevant to the function of the discipline) rather than a big new proof. There are millions such gaps in any literature, and the closing of these gaps often generates more gaps. Being able to find and close such a gap doesn't necessarily entail learning more in some absolute sense rather than learning a specialized niche of study. tl;dr students have to do about the same amount of work, just in a narrower scope.\n\n> phd students are taking longer and longer to complete their studies\n\nI'm not sure that this is true (I mean I know PhDs take a long time and often longer than matriculating students expect, but I'm not sure there's a lengthening dynamic through the years - if you have such data, that would be interesting). I'm also not sure that the causality you want to see is the causality that's there. There's lots of factors that can lengthen a PhD, and ime many of them occur more frequently than someone not being able to do the research: ran out of funding, advisor/committee issues, personal issues, experiments not working or getting scooped... If anything, imo this is more a problem at the TT level, where to get tenured you may have a requirement of x pubs in top 10 journals, and many people are simply unable to produce x separate research projects that are among the best in the entire discipline. The PhD dissertation simply isn't anywhere near that high a bar.\n\n> the economy still needs them for education and work\n\nthat's not what hte market is telling us\n\n> What happens if there is no longer enough phds to fulfil societies needs?\n\nthis is a science fiction scenario",
      "author": "thegreenaquarium",
      "created": 1635163481,
      "upvotes": 2,
      "replies": {
        "hhz866k": {
          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz866k/",
          "text": "> I'm not sure that this is true\n\nAccording to the Survey of Earned Doctorates, it isn't, at least over the last 15 years.",
          "author": "ph0rk",
          "created": 1635165208,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhzmtfg": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzmtfg/",
      "text": ">From what I understand, phd students are taking longer and longer to complete their studies  \n  \nI don't think that's right. [An NSF report from 2015 showed that the total time-to-degree among all 8 tracked STEM fields had declined in the prior 20 years](https://www.nsf.gov/statistics/2017/nsf17306/report/what-influences-the-path-to-the-doctorate/time-to-degree.cfm)",
      "author": "brett_hoover_wx",
      "created": 1635172484,
      "upvotes": 2,
      "replies": {
        "hi1nqlf": {
          "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hi1nqlf/",
          "text": "Yep. There is a lot of pressure to graduate students on time, much of it from the university and department level. Everything from curricula and harder program deadlines to dissertation \"boot camps\" and writing services have tried to reduce the tendency for students to languish in the degree program.",
          "author": "TaliesinMerlin",
          "created": 1635202685,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhzrjb2": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzrjb2/",
      "text": ">How will the academic community respond if such a point is reached?\n\nThey churn out too many now!",
      "author": "TheArcticFox444",
      "created": 1635174523,
      "upvotes": 2,
      "replies": {}
    },
    "hhz3jtw": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz3jtw/",
      "text": ">From what I understand, phd students are taking longer and longer to complete their studies\n\nNeeds citation (across multiple fields).",
      "author": "iugameprof",
      "created": 1635162287,
      "upvotes": 2,
      "replies": {}
    },
    "hhyz1us": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhyz1us/",
      "text": "No, this is not how this works.\n\nPhD students - hell, all researchers - apply models onto data. Those models were all created by humans. In these days, those models are usually computer-based models, which wasn't necessarily the case 2 decades ago. The models might be quicker, more accurate, hsve a higher throughput or whatever. But in the end, they are men-and-women-made and hence, usually researchers will understand them and will be able to apply them.\n\nWhat took months to evaluate in 1980 because it was printed on paper might also take months today, because you will need elaborate scripts to analyze the data.\n\nUnless the models we apply to data will 100% be generated by AIs, I do not see any problems at all.",
      "author": "theta4-7",
      "created": 1635159007,
      "upvotes": 1,
      "replies": {}
    },
    "hhz7ypv": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz7ypv/",
      "text": "The amount of new knowledge generated to earn a PhD will decrease if this is the only pressure added to the system.",
      "author": "ph0rk",
      "created": 1635165087,
      "upvotes": 1,
      "replies": {}
    },
    "hhzavvt": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzavvt/",
      "text": "I feel like you underestimate how hard it is, and always has been, to discover new things. It has always been expensive to do science and it has always been complicated.",
      "author": "BronzeSpoon89",
      "created": 1635166714,
      "upvotes": 1,
      "replies": {}
    },
    "hhzi00q": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzi00q/",
      "text": "Why would this occur PhD's are cheap labour, the more science costs, the lower you would want your labour costs to be. \n\nOf course this also completely turns into a fallacy when the new PhD student screws up a $20K experiment, but you know, these people are academics, not efficiency specialists in a price competitive business.",
      "author": "Psyc5",
      "created": 1635170253,
      "upvotes": 1,
      "replies": {}
    },
    "hhzul62": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhzul62/",
      "text": "Scientific advancement is accelerating not slowing down. Churning out PhDs is a different issue altogether.\n\nImagine if Covid 19 had struck the world in 1980 instead of 2020...",
      "author": "molobodd",
      "created": 1635175836,
      "upvotes": 1,
      "replies": {}
    },
    "hhy615x": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhy615x/",
      "text": "Agreed, the fact that I'm not comfortable with the technology, should speak volumes!",
      "author": "Forex808",
      "created": 1635135337,
      "upvotes": -10,
      "replies": {}
    },
    "hhz49a2": {
      "link": "/r/AskAcademia/comments/qf7nc6/is_the_academic_system_reaching_a_point_where_the/hhz49a2/",
      "text": "Society does not need PhDs; society needs scientists, mathematicians, engineers, etc.  PhDs are increasingly specialized and thus increasingly pigeon-holed, siloed, and irrelevant. There are a lot of problems with what has happened to the state of knowledge how we go about discovering and innovating and understanding the world, but amount of PhDs is not one of them.",
      "author": "SilencedinAcademia",
      "created": 1635162754,
      "upvotes": -5,
      "replies": {}
    }
  }
}