{
  "sid": "orgfda",
  "link": "/r/AskAcademia/comments/orgfda/phd_or_work/",
  "title:": "PhD or work?",
  "text": "Hey all,\n\n I have recently been accepted into a PhD in English in England. I will be studying a topic that is very near and dear to me (lyrics as poetry). I currently am teaching at two universities who treat me very well in terms of classes and treatment. My dilemma is I am torn on what to do. Since my PhD is in the UK, I have to pay for it out of pocket with student loans. Which won’t allow me to have that much to live on after I pay for rent, food, travel, etc. Whilst it’s a great opportunity to study abroad (seeing that I got my masters in England), I am nervous about not being able to work for 4 years. I will be 35 by the time I graduate and am nervous about leaving the teaching opportunities I have here in the States. I know the academia job market is not the greatest, but there’s a part of me that will always wonder “what if?” if I do not take the opportunity to get my PhD abroad. I have been very blessed to have found the jobs I have so easily and am wondering if leaving academic jobs for a PhD will benefit or harm me in the long run. I see the pros and cons of each situation and am really looking for advice. \n\n&#x200B;\n\nIs a PhD worth it if you are studying what you love? Is it worth leaving two pretty good academic jobs for?",
  "author": "jamesandtheholograms",
  "created": 1627235919,
  "updated": 1634081871,
  "over_18": false,
  "upvotes": 109,
  "upvote_ratio": 0.92,
  "comments": {
    "h6i7sbl": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i7sbl/",
      "text": "Humanities PhD here (recent grad). Don't do it if you have to pay for it unless you're independently wealthy and money is completely not an issue. \n\nIf you're set on the PhD reapply for programs that are fully funded. You're clearly a competitive applicant, so strengthen your application for programs that guarantee funding.",
      "author": "gggggggggggfff",
      "created": 1627241747,
      "upvotes": 114,
      "replies": {
        "h6i82cm": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i82cm/",
          "text": "Thank you for this advice :)",
          "author": "jamesandtheholograms",
          "created": 1627241883,
          "upvotes": 13,
          "replies": {}
        },
        "h6ja1ic": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ja1ic/",
          "text": "This. I would award it if I had any. \n\nIf you want to teach at a college for the long term, it is beneficial (sometimes necessary) to get a PhD, but apply near you so you could still work and get funded, or find one that gives a good stipend if you have to move.",
          "author": "sassafrass005",
          "created": 1627261344,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "h6i3rrz": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i3rrz/",
      "text": "Is a PhD worth it if you are studying what you love? \n\nNo. \n\nIs it worth leaving two pretty good academic jobs for? \n\nNo. Absolutely not in 100 years. Especially if you have to take on debt. \n\nI have a PhD in English, went into lots of debt for it. Wish I hadn’t. Not worth it, especially given that you have employment in the sector already that, believe me, will not exist for you to come back to (they will not hold the job for you, I don’t care who you are). \n\nJust don’t do it.",
      "author": "hillbillybajingowash",
      "created": 1627239793,
      "upvotes": 199,
      "replies": {
        "h6krlpq": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6krlpq/",
          "text": "Yeah. I would recommend OP do this if they didn't have to go into debt for it.\n\nWith debt, they're looking at, what, easily £100k for 4 years as a foreign student with living expenses included?\n\nThat's madness.",
          "author": "sirophiuchus",
          "created": 1627299973,
          "upvotes": 5,
          "replies": {}
        },
        "h6k7pi8": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6k7pi8/",
          "text": "For all practical purposes, you're right.\n\nBut there is an exception. If you're truly so selfless and passionate to dedicate your entire life to a subject, much like a monk in a monastery would, then there's reason to commit.\n\nIf you're doing it for yourself, there are very few reasons to go for it. E.g. Ph.D. Computer Science because your dream is to work for Microsoft Research, and you are certain you can hack it.",
          "author": "vonkrueger",
          "created": 1627282662,
          "upvotes": 2,
          "replies": {
            "h6kcdxs": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6kcdxs/",
              "text": "It's not just whether you're selfless and passionate. It's also whether you are lucky enough to be financially well off enough to support yourself doing it.",
              "author": "OrbitalPete",
              "created": 1627286803,
              "upvotes": 11,
              "replies": {}
            },
            "h6khv66": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6khv66/",
              "text": "The only people like this that I know are the ones for which things did work out. Superficially, yes, they're monks 100% commited to their research. But would they be happy monks while being in debt, finding no jobs and knowing they left a stable, food-on-their-table, lifestyle for this? Much less likely.",
              "author": "fuckwatergivemewine",
              "created": 1627291907,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "h6i62lb": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i62lb/",
      "text": "Paying for a PhD is a massive and hard PASS every time.",
      "author": "husky429",
      "created": 1627240911,
      "upvotes": 120,
      "replies": {
        "h6injj6": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6injj6/",
          "text": "I have my Ph.D. and I got it in the Netherlands. The Dutch view doctorate degrees as employment, so , not only did I get a salary while I studied and completed my thesis, I got a degree. \n\nCheck out what countries do this. \n\nFor example, while I was there I knew a few Americans studying medicine courtesy of the German government.\n\nSo much better graduating with savings  than debt.",
          "author": "Timetotuna",
          "created": 1627249510,
          "upvotes": 29,
          "replies": {
            "h6jl1xv": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jl1xv/",
              "text": "There are a large number of US institutions that do the same. Funding being given for teaching and research responsibilities. \n\nGenerally 20-30k /yr + tuition paid for. Field specific of course. I was always told it’s not worth doing a PhD if you aren’t being paid for it since it’s a full time job.",
              "author": "Enzohere",
              "created": 1627267345,
              "upvotes": 11,
              "replies": {}
            },
            "h6kroul": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6kroul/",
              "text": "Fun fact: the EU institutions treat a doctorate as three years of relevant employment experience if you go for a job with them.",
              "author": "sirophiuchus",
              "created": 1627300036,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "h6i7nwp": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i7nwp/",
      "text": "No way! If you already have a job, you have the thing the PhD would be meant to get you. I understand the desire to go to Europe but then your degree will not necessarily give you the best shot at a U.S. job. I think you should write about your topic to your heart's content and at most, pursue a U.S. PhD in the city you live in so you can keep your jobs. My real advice would be to do anything other than academia. You are not too old to run from it! I am a humanities PhD (early modern literature, so about as bad as job prospects in your field) and if I had a time machine, I would tell my younger self to bag it and do something else. Humanities departments are being shut down in many places and it's painful on the way out.",
      "author": "raspberry-squirrel",
      "created": 1627241688,
      "upvotes": 25,
      "replies": {}
    },
    "h6i3vns": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i3vns/",
      "text": "Gonna be real - paying \\*for\\* a PhD is a scam. The absolute worst case acceptable scenario would be a program that does not pay you, but does not cost you anything, and allows you to work another job while you do the program (and doesn't expect you to do much work for the program, since you are unpaid). I'm not sure how it works in the UK, but assuming they will have you teaching undergrads, they should be paying \\*you\\* and not vice versa.",
      "author": "isaac-get-the-golem",
      "created": 1627239845,
      "upvotes": 114,
      "replies": {
        "h6i7p34": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i7p34/",
          "text": "I am not allowed to work due to Visa/PhD restrictions. Sigh..",
          "author": "jamesandtheholograms",
          "created": 1627241704,
          "upvotes": 13,
          "replies": {
            "h6ihnnq": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ihnnq/",
              "text": "So typically PhDs aren't funded by TA/RA posts but through stipends from the research councils (plus some foundations/charities although the majority are STEM) which your visa would allow as it's not a salary.  \n\nDoing an unfunded PhD leaves you open to exploitation - although I suspect less so in the humanities than STEM. The research councils put a lot of pressure on universities to ensure that students complete on time and universities can lose funding if they don't. With no incentive to get students finished on time supervisors can and do exploit students, not entirely different from what you see in US universities where PIs don't want to see their free labour leave so don't support their students to finish. \n\nI can't comment on whether you should do the PhD - I see the comments here, which are totally correct but I might counter that you're probably not going to advance much further in academia without a PhD so if you want career progression you will need to eventually get a PhD. Whether it's this PhD is another matter...",
              "author": "ACatGod",
              "created": 1627246570,
              "upvotes": 20,
              "replies": {}
            },
            "h6i9o7z": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i9o7z/",
              "text": "But they can’t at least cover your tuition? Taking on loans while being completely unable to work sounds like a financial disaster",
              "author": "isaac-get-the-golem",
              "created": 1627242667,
              "upvotes": 15,
              "replies": {
                "h6ia8pd": {
                  "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ia8pd/",
                  "text": "I would only be able to cover my tuition and the cost of attendance which includes housing. What’s left over will be money for food, books, travel, etc. Unfortunately, that’s the name of the game.",
                  "author": "jamesandtheholograms",
                  "created": 1627242945,
                  "upvotes": 2,
                  "replies": {
                    "h6iffi4": {
                      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6iffi4/",
                      "text": "I don’t know specifically about English but there are many opportunities for funding in the humanities in the UK. It’s a little harder as an international student but absolutely possible. You can also apply for funding from your home country. Would not recommend taking out loans for a PhD.",
                      "author": "ravenpaw_15",
                      "created": 1627245484,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h6n28uk": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6n28uk/",
              "text": "You can't even work as a TA/RA?",
              "author": "PM_MOI_TA_PHILO",
              "created": 1627338764,
              "upvotes": 2,
              "replies": {
                "h6nclxz": {
                  "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6nclxz/",
                  "text": "I can’t unfortunately due to how the PhD is set up and visa regulations.",
                  "author": "jamesandtheholograms",
                  "created": 1627343922,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "h6if1ru": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6if1ru/",
              "text": "I don't understand, can't you get a new student visa based on your PhD offer?\n\nAlso PhD is not employment/work in the UK, you receive a tax free stipend and unlike Europe, they don't sign a contract with you so you might still be able to get a stipend on your current visa. Of course this is contingent on the lab/department being able to pay you. Do check with the student office to get your way, I'm sure there must be a way if there's money available.",
              "author": "Lollipop126",
              "created": 1627245300,
              "upvotes": 2,
              "replies": {
                "h6ioqk8": {
                  "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ioqk8/",
                  "text": "UK visa restrictions don't allow you to work more than 20 hours a week on a student visa.",
                  "author": "RegnumDei",
                  "created": 1627250121,
                  "upvotes": 2,
                  "replies": {
                    "h6j1h9c": {
                      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6j1h9c/",
                      "text": "Exactly right!",
                      "author": "jamesandtheholograms",
                      "created": 1627256717,
                      "upvotes": 2,
                      "replies": {
                        "h6k9kul": {
                          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6k9kul/",
                          "text": "but a PhD isn't employment in the UK system (see [this](https://www.theguardian.com/higher-education-network/2015/jul/16/should-phd-students-be-classed-as-employees)). You don't sign a contract of employment. You're a student and receive a stipend and tuition sort of as a thank you gift. That's why there are no taxes on your stipend.\n\nYou should ask your student office/international student office about this rather than go off your own understanding and the internet's limited knowledge. Maybe I'm wrong, that's okay, but what if you're wrong and you miss this opportunity to receive a stipend to do your dream PhD? Maybe all you need to do is apply for a new visa.",
                          "author": "Lollipop126",
                          "created": 1627284273,
                          "upvotes": 6,
                          "replies": {
                            "h6ptt3x": {
                              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ptt3x/",
                              "text": "You only get a stipend if you get a scholarship. Admission to a PhD program does not guarantee a stipend or even a tuition fee waiver.",
                              "author": "RegnumDei",
                              "created": 1627399965,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h6ilgi7": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ilgi7/",
      "text": "Short answer don't do it.\nLong answer: dooooooon't do it!!!\nIf you absolutely want a PhD, do it part time in the US whilst you keep your jobs. Take some little time off and visit Europe if you want to.",
      "author": "ReddMedPhy",
      "created": 1627248465,
      "upvotes": 12,
      "replies": {}
    },
    "h6i6n7n": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i6n7n/",
      "text": "How does one teach at a university without a PhD or without actively pursuing a PhD? I would love that gig.",
      "author": null,
      "created": 1627241187,
      "upvotes": 14,
      "replies": {
        "h6i764h": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i764h/",
          "text": "I have been very lucky to be full time without a PhD.",
          "author": "jamesandtheholograms",
          "created": 1627241447,
          "upvotes": 7,
          "replies": {
            "h6i7tiv": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i7tiv/",
              "text": "OMG! Do not leave this job (unless you're leaving academia, in which case go ahead). You have what many with a PhD badly want and never get.",
              "author": "raspberry-squirrel",
              "created": 1627241763,
              "upvotes": 51,
              "replies": {
                "h6i84x4": {
                  "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i84x4/",
                  "text": "That is great advice. Thank you!",
                  "author": "jamesandtheholograms",
                  "created": 1627241918,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "h6jdnmi": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jdnmi/",
              "text": "If you already have a stable full time academic position, then you're extremely unlikely to improve on your lot by getting an unfunded PhD, and you will probably be much worse off after getting the PhD.",
              "author": "mleok",
              "created": 1627263303,
              "upvotes": 7,
              "replies": {}
            },
            "h6jwv9w": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jwv9w/",
              "text": "If it's possible, maybe try to see if you can do a PhD with the university you are working at and get someone as an external co-supervisor to get the expertise you want.",
              "author": "tfburns",
              "created": 1627274473,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h6iibym": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6iibym/",
      "text": "Only go for the PhD if you're being paid to. And even then, really think about whether or not it makes sense and if it will be fulfilling. If it matches your long term goals and you're paid, not a horrible thing to do. But the market is so bad, and we're about to see significant changes in the post-pandemic world that will alter how academics do every part of our jobs.",
      "author": "andercm",
      "created": 1627246902,
      "upvotes": 11,
      "replies": {}
    },
    "h6iknz7": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6iknz7/",
      "text": "To echo what has been said- if you have to pay for it, *don't do it*. \n\nI tried for a PhD in the Humanities and even with my fees paid it set me back hard - I'm still catching up years later.",
      "author": "Cocanola",
      "created": 1627248066,
      "upvotes": 10,
      "replies": {}
    },
    "h6iqqob": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6iqqob/",
      "text": "I'm sorry but someone should slap you for even considering this. Also might want to get out of the adjuncting game and focus on a stable career.",
      "author": "notifyoulikefish",
      "created": 1627251142,
      "upvotes": 25,
      "replies": {
        "h6irar3": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6irar3/",
          "text": "Thank you for this tough, Moonstruck style advice.",
          "author": "jamesandtheholograms",
          "created": 1627251424,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "h6i3v0s": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i3v0s/",
      "text": "Just a quick point of information: if your goal is to land a tenure-track job in the humanities in the US afterward then a UK Ph.D. may hinder that. Due to the nature of graduate education in the UK (i.e. limited coursework) and the lack of US-style teaching experience (i.e. not TAing big lectures, teaching courses on your own, etc.) many search committee members at PUI/teaching oriented schools will simply reject UK Ph.D.s out of hand. The market is terrible and is going to get worse as more US schools close due to COVID's economic hit and the looming [demographic cliff.](https://www.cupahr.org/issue/feature/higher-ed-enrollment-cliff/) Anything that makes you a less competitive candidate is a risk. Note also that while there *are* jobs in rhet/comp subfield positions teaching literature are much more scarce.\n\nIf you're studying economics at the LSE or Brit Lit at Oxford that's probably a different matter. But in my now lengthy experience with search committees in the humanities at SLACs and other PUIs a UK Ph.D. can really be a handicap due to the teaching differences (and outright ignorance among search committee members). These days if you don't have direct experience teaching as the instructor-of-record you aren't going to make the first cut at schools like mine, as there are far too many applicants who do have both direct experience and the evals/LORs to go with them that committees are simply unwilling to gamble on untested/unproven candidates.\n\nThe situation for research-oriented jobs of course will be different.",
      "author": "SnowblindAlbino",
      "created": 1627239837,
      "upvotes": 35,
      "replies": {
        "h6ifixf": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ifixf/",
          "text": "Just curious, could you fill that lack of experience with a post-doc with teaching duties before applying for TT?",
          "author": "Lollipop126",
          "created": 1627245531,
          "upvotes": 6,
          "replies": {
            "h6ikrdh": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ikrdh/",
              "text": "Sure, if there's series teaching involved. In the humanities (and somewhat in the social sciences) there aren't many postdocs, so most people work as adjunct/term faculty before/while on the market; as a result almost all of the top candidates have at least a few semesters of teaching full time.  It's different in STEM, and one of the issues is that far too many STEM candidates never teach but only run labs. That's not enough for an SLAC job, so that postdoc teaching experience can be vital.\n\nIt's also *really* important that a candidate's teaching file include LORs from faculty who directly observed them teaching-- the old \"I hear she's a good teacher\" or \"students seem to like her\" or \"colleagues say there were no complaints\" sort of LORs are completely worthless. Strong candidates will also include student evaluations of their teaching, or at least summary information from those. One issue I've seen with UK Ph.D.s is that often neither of those are present, which puts the candidate at a severe disadvantage against someone who is, say, from the U. California system where ABD grads often teach independently and mentors are good about observing them.",
              "author": "SnowblindAlbino",
              "created": 1627248112,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "h6krtti": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6krtti/",
          "text": "Is this true though? Some stats from BLS here and they're expecting about double than the avg national growth for post secondary teachers. Obviously there are most likely different stats for TT tho but its looking decent for profs. \nhttps://www.bls.gov/ooh/education-training-and-library/mobile/postsecondary-teachers.htm no",
          "author": "AtreyaJi",
          "created": 1627300134,
          "upvotes": 2,
          "replies": {
            "h6l25pr": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6l25pr/",
              "text": "It's quite true-- the US has a gross oversupply of both Ph.D.s and universities (4,500 colleges/universities) and a \"supply\" of 18-year-olds that is going to drop starting in 2025. Add to that mix admins who decided 20 years ago that TT faculty were a burden to be replaced by contingent labor (term/adjunct faculty) and it's quite bad.  The BLS only counts \"instructors\" and doesn't differentiate between them; being contract labor is not the same as being a career professor.",
              "author": "SnowblindAlbino",
              "created": 1627306354,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h6ktryw": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ktryw/",
          "text": "> Brit Lit at Oxford\n\nHang on, do you Americans call what we refer to as \"English Lit\" as \"British Lit\", and what we refer to as \"American Lit\" as \"English Lit\"...\n\nBecause if so you guys have got to see how objectively backwards that is :P",
          "author": "drcopus",
          "created": 1627301457,
          "upvotes": 2,
          "replies": {
            "h6l1vtj": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6l1vtj/",
              "text": "Yep. Backward mostly-- it's \"Brit Lit\" and \"American Lit\" in most cases.",
              "author": "SnowblindAlbino",
              "created": 1627306208,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h6jd902": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jd902/",
      "text": "I would strongly counsel against paying for a PhD in the humanities, the job market is truly horrendous, and I would most certainly not advise giving up two pretty good academic jobs for the questionable (at best) benefit that a PhD might provide for a future academic job search.",
      "author": "mleok",
      "created": 1627263082,
      "upvotes": 6,
      "replies": {}
    },
    "h6i8lyr": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i8lyr/",
      "text": "Apply next year to see if you can get full funding.\n\nDoing a phd in a field like that unfunded is bonkers.",
      "author": "readingkittymeows",
      "created": 1627242148,
      "upvotes": 15,
      "replies": {}
    },
    "h6iohe6": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6iohe6/",
      "text": "Honestly, if you're not being paid to do a PhD, then the university/faculty doesn't really want you there in the first place. They will, however, give you an offer under the hope that you're gullible enough to give them money.",
      "author": "RegnumDei",
      "created": 1627249991,
      "upvotes": 5,
      "replies": {
        "h6mhvk6": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6mhvk6/",
          "text": "Yes!!! The students they consider best are nominated for fellowships, etc. Don't do it.",
          "author": "ndrsng",
          "created": 1627329526,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6i3rpr": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i3rpr/",
      "text": "No, almost certainly not if you are paying anything out of pocket for it. These wouldn’t be federal loans, right? You’d not even be eligible for PSLF after 10 years of payments.",
      "author": "profpetitfours",
      "created": 1627239792,
      "upvotes": 12,
      "replies": {}
    },
    "h6ie0la": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ie0la/",
      "text": "Are you in the UK already? If not, absolutely do not do this.",
      "author": "Tortured_scientist",
      "created": 1627244795,
      "upvotes": 11,
      "replies": {
        "h6ieo00": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ieo00/",
          "text": "I am not. I’m American and teaching in the USA.",
          "author": "jamesandtheholograms",
          "created": 1627245114,
          "upvotes": 3,
          "replies": {
            "h6iitda": {
              "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6iitda/",
              "text": "Definitely stay in the US. The UK is certainly not worth it.",
              "author": "Tortured_scientist",
              "created": 1627247139,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "h6iruf2": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6iruf2/",
      "text": "NO! Go work!\n\n\n🚩🚩🚩🚩🚩🚩🚩🚩🚩",
      "author": "yakiguriumai",
      "created": 1627251700,
      "upvotes": 5,
      "replies": {}
    },
    "h6itvkm": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6itvkm/",
      "text": "As someone who is glad I did my PhD, I always tell people that if there is legitimate debate, then you should not be going forward with the PhD. My 2 cents is you can always drown your \"what if\" sorrows on a nice vacation you get from having a good career",
      "author": "airwalker12",
      "created": 1627252750,
      "upvotes": 3,
      "replies": {}
    },
    "h6iy6d6": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6iy6d6/",
      "text": "If you want to live abroad, live abroad. Don't use this program as a vehicle to do so.",
      "author": "silkchemise",
      "created": 1627254963,
      "upvotes": 5,
      "replies": {}
    },
    "h6isk11": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6isk11/",
      "text": "If you have to pay for your PhD it ain't worth it. Scam all the way.",
      "author": "o2bprincecaspian",
      "created": 1627252065,
      "upvotes": 3,
      "replies": {}
    },
    "h6i7rry": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i7rry/",
      "text": "When starting the PhD application process the #1 piece of advice I got from every person I talked with was to never self-fund (though I’ve found funding most places to be especially competitive this year in the UK thanks to COVID and even Brexit). Do you like your prospective supervisor? Have you discussed the option of maybe deferring admission and re-applying for funding next year if you’re confident that this is the right university and supervisor for you?",
      "author": "_salty_fox",
      "created": 1627241740,
      "upvotes": 5,
      "replies": {}
    },
    "h6i3wb5": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i3wb5/",
      "text": "[deleted]",
      "author": null,
      "created": 1627239854,
      "upvotes": 2,
      "replies": {
        "h6i7uro": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i7uro/",
          "text": "Unfortunately, I will not be able to teach due to visa/PhD regulations.",
          "author": "jamesandtheholograms",
          "created": 1627241779,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6ivr4u": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6ivr4u/",
      "text": "Not an expert by any means, but logically, you should keep working.\n\nHowever, that doesn't mean that you should give up on your Ph.D. entirely. I would try to apply to some programs in the U.S. in the hopes that you could get it fully funded while teaching at the same time.\n\nA stable job is very important, but you should also be happy with your decision at the end of the day :)",
      "author": "KindredKate",
      "created": 1627253704,
      "upvotes": 2,
      "replies": {}
    },
    "h6jnex8": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jnex8/",
      "text": "“Is it worth it” is kind of subjective. I don’t want to disagree with the people who are saying no, because they are 100% right in what they say. What you’d need to ask yourself is, is it worth it to lose those two jobs when you won’t be able to get them back and have substantial debt to spend a few years studying what you love and hopefully be able to call yourself doctor at the end? Maybe for some people it is. But there are people with completed PhDs and post-docs who’d kill for what you have.\n\nAt the very least, apply for a program that will offer you full funding and a wage you can live off of.",
      "author": "JapanOfGreenGables",
      "created": 1627268659,
      "upvotes": 2,
      "replies": {}
    },
    "h6krqn7": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6krqn7/",
      "text": "Unless someone else is paying for it, and you don’t need to go in to debt, totally not worth it. Do not self fund a PHD Studying something you love is certainly a wonderful thing. But a PHD is not likely to change your overall employment situation. Accruing more debt for a few letters and a nice certificate to hang on the wall is at best something you pursue for yourself. Maybe approach one of the schools you work in? Possibly they would help you with a PHD and allow you to teach. Whatever you choose, I wish you luck.",
      "author": "GREYDRAGON1",
      "created": 1627300072,
      "upvotes": 2,
      "replies": {}
    },
    "h6kv6qv": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6kv6qv/",
      "text": "PhD in STEM here and I’m still going to say hard pass. You’ve got the job already without the stress and woes of a PhD, that job won’t be there when you get back. If you’re happy now, with your life and choice of subject, don’t do the PhD.",
      "author": "Nimble_Neighbor728",
      "created": 1627302364,
      "upvotes": 2,
      "replies": {}
    },
    "h6mx83p": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6mx83p/",
      "text": "Don't do it.",
      "author": "phenomenologist83",
      "created": 1627336411,
      "upvotes": 2,
      "replies": {}
    },
    "h6nfjf5": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6nfjf5/",
      "text": "[deleted]",
      "author": null,
      "created": 1627345416,
      "upvotes": 2,
      "replies": {
        "h6qmxnb": {
          "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6qmxnb/",
          "text": "I am an adjunct, yes.",
          "author": "jamesandtheholograms",
          "created": 1627412559,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6trc9b": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6trc9b/",
      "text": "English PhD here.....my general take on it is that humanities PhDs are an absolute ripoff. They require you to dedicate years of your life and tens of thousands of dollars for the attainment of a credential that has incredibly low value, given the abysmal state of the academic job market. I couldn't find a prof job w my phd, so I had to leave academia and now do an office job that I could have done with a b.a.\n\nPart of what enables this exploitative system is the false prestige that the PhD carries, that somehow having the title next to one's name confirms that one is a Real Scholar. The reality is that one can in fact become a great humanities scholar without attending a PhD program. In fact, I'd argue that a great deal of PhD education is actually detrimental to humanities scholarship, as it is often about training students in pursuing extremely specialized, obscurantist lines of inquiry that are largely irrelevant and alienating to the rest of humanity. This is why so many humanities scholars find that absolutely no one cares about their scholarship, aside from maybe 15 specialists.",
      "author": "traanquil",
      "created": 1627477858,
      "upvotes": 2,
      "replies": {}
    },
    "h6jfhme": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jfhme/",
      "text": "In 3-5 years you'll be posting here about massive debt, getting older, and little employable skills.\n\nYou'll get sympathy from others who made poor choices.\n\nThe rest of us work.",
      "author": "Responsible-Idea-847",
      "created": 1627264288,
      "upvotes": 2,
      "replies": {}
    },
    "h6i6pq2": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6i6pq2/",
      "text": "I have a PhD and I like your question \"PhD or work?\"  🤔",
      "author": "Stumblingtoepiphany",
      "created": 1627241221,
      "upvotes": 1,
      "replies": {}
    },
    "h6jr22n": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jr22n/",
      "text": "Go for it. It's clear that your heart would love to do this. Good luck!",
      "author": "No-Bite-7866",
      "created": 1627270791,
      "upvotes": 1,
      "replies": {}
    },
    "h6j84vs": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6j84vs/",
      "text": "You should search for funded PhD opportunities.",
      "author": "givemeyourdonut",
      "created": 1627260318,
      "upvotes": 1,
      "replies": {}
    },
    "h6jkg3s": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jkg3s/",
      "text": "I seem to recall from Labour Economics when I was in Uni decades ago that average expected life-time earnings is (oe was then) highest for Masters degrees.   Don't know if that helps....",
      "author": "Important_Fruit",
      "created": 1627267007,
      "upvotes": 1,
      "replies": {}
    },
    "hd0uwpo": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/hd0uwpo/",
      "text": "  This appears slightly crazy",
      "author": "thoseresignation6",
      "created": 1631754458,
      "upvotes": 1,
      "replies": {}
    },
    "h6igo1v": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6igo1v/",
      "text": "My advice is get your Ph.D n stay there.\n\n You don't want to teach kids in the US now.\n\n 67% nationally graduate reading n counting at the 7th grade level.  \n\nThen they are off to university where they demand A's (with their parents) for doing no work.",
      "author": "TSIDATSI",
      "created": 1627246091,
      "upvotes": -10,
      "replies": {}
    },
    "h6jbsco": {
      "link": "/r/AskAcademia/comments/orgfda/phd_or_work/h6jbsco/",
      "text": "You will get Graduate Teaching Assistant contract. So, you will be able to pay some of your tuition fees. \n\nHave you asked your school to provide a full studentship?\n\nIt is worth asking as the UK government has allocated funds for this type of research last year. If you get the full studentship, then you won’t have to worry about the tuition fees. The student loan is your option but it is still a loan. I won’t suggest you do that because a PhD without funding from the school will get less priority from the supervision team than funded PhD students. My supervision team mentioned that to me. But if you enjoy research (like me), then there is nothing that can change your mind. :)",
      "author": "arahmancs",
      "created": 1627262284,
      "upvotes": 0,
      "replies": {}
    }
  }
}