{
  "sid": "pfa398",
  "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/",
  "title:": "Letter to your younger self",
  "text": "I'm starting my M.S. currently and want to pursue a PhD eventually. What advice would you give your younger self as you started on your academic journey?",
  "author": "sharingacoke",
  "created": 1630429511,
  "updated": 1634079441,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.83,
  "comments": {
    "hb2x0h8": {
      "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb2x0h8/",
      "text": "1) Take the time to choose a mentor that's right for you. Get as much information about working in that lab and with the PI whose lab you're thinking of joining. You will be spending multiple years with this person, and if the relationship isn't a good one then it will make everything much more difficult. \n\n2) Since you can't always get all of the information ahead of time, do not be afraid to switch labs if a mentoring relationship isn't working out! Many people, including myself, will feel as though they're stuck and just need to push through and finish the degree. But this is terrible for productivity, and more importantly for our own mental and physical health. Even if you're already over a year in, it is much better to start over than to try and push through. \n\nI'm not compter science, but my PhD took 5 years. I actually started as a Master's student, but transitioned up to PhD after my 2nd semester because I really liked the project I was working on, was planning on getting my PhD anyways and didn't want to have to repeat courses at a different institution, and had the support of my committee.",
      "author": "MightyMitos19",
      "created": 1630430430,
      "upvotes": 8,
      "replies": {}
    },
    "hb43cwr": {
      "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb43cwr/",
      "text": "Talk to everyone you can about the job market: recent grads, your PI, assistant professors who just got hired, adjuncts, people in industry with your PhD. You need to prep for the job market from day 1.",
      "author": "ThatProfessor3301",
      "created": 1630448035,
      "upvotes": 4,
      "replies": {}
    },
    "hb3uee3": {
      "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb3uee3/",
      "text": "Don't.",
      "author": "Doctor_HowAboutNo",
      "created": 1630444244,
      "upvotes": 8,
      "replies": {
        "hb3xmju": {
          "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb3xmju/",
          "text": "I came here to say the same thing.",
          "author": "VerySaltyScientist",
          "created": 1630445599,
          "upvotes": 3,
          "replies": {}
        },
        "hb6nvyo": {
          "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb6nvyo/",
          "text": "Actually, I echo that. I would have probably done computer sciences rather than pharmacology.",
          "author": "Tortured_scientist",
          "created": 1630502899,
          "upvotes": 2,
          "replies": {
            "hb71ors": {
              "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb71ors/",
              "text": "I switched fields to computer science actually. I have no passion for it but at least I make enough I don't have to work multiple jobs anymore. When in academia I was in research pathology, needless to say this last 1 1/2 has left me very pissed off all the time.",
              "author": "VerySaltyScientist",
              "created": 1630508859,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hbcd7xc": {
      "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hbcd7xc/",
      "text": "1. Don't bother with the masters or the industry credential. You don't need them, do the PhD without them and if you want the credential later do it that way.\n\n2. Quit borrowing money to pay for school or living expenses.\n\n3. You are not special. Don't think you're going to be the bottom end of the cost range and top end of the salary range. Quit. Borrowing. Money.\n\n4. That \"big-name\" school is great if you can get it at comparable cost; it is *not* so much better than your other options given how much more it costs given you're still borrowing money, you utter fool.\n\n5. Seriously, Masters are expensive, skip it and do the PhD flat out.",
      "author": "Ancient_Winter",
      "created": 1630605140,
      "upvotes": 3,
      "replies": {}
    },
    "hb3zcpg": {
      "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb3zcpg/",
      "text": "I would tell myself not to do it and instead just go straight into the field I am currently in. I loved the work but the pay was horrendous, and no one even listens to scientist in my country. I was just pissed off all the time and worked a 2nd job as a personal trainer which paid more that I made as a researcher for an R1 university. Also animal work is really depressing, I thought I could do it for the greater good, but I was crying over mice I got attached to a few times a month. Eventually I picked up lecturing as well for a little extra money before just switching fields. Now I only have to work one job and don't have to be in a lab at weird ass hours of the nights.",
      "author": "VerySaltyScientist",
      "created": 1630446327,
      "upvotes": 2,
      "replies": {
        "hb59m7z": {
          "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb59m7z/",
          "text": "This was a very moving story about the mice. Peace, stranger.",
          "author": "hickorydough",
          "created": 1630467914,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hb7bkvh": {
      "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb7bkvh/",
      "text": "I started off thinking that research was all about catching the golden snitch; making the big discovery that would catapult me, if not to stardom, at least to the next milestone. There are golden snitches, and people do catch them, but research is much more about just keeping on putting the quaffle through the goal hoop.",
      "author": "CruxAveSpesUnica",
      "created": 1630512912,
      "upvotes": 1,
      "replies": {}
    },
    "hb7g41n": {
      "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb7g41n/",
      "text": "Get out after the PhD. Use the time during your PhD to apply to jobs. Focus on what makes you happy, not on what you think you need to be doing or on what others say you should do.",
      "author": "asstprofthrowaway",
      "created": 1630514751,
      "upvotes": 1,
      "replies": {}
    },
    "hb7iw46": {
      "link": "/r/AskAcademia/comments/pfa398/letter_to_your_younger_self/hb7iw46/",
      "text": "I'd say, If you have basic needs covered nobody depends on your income and you really love research then do a PhD. If you only want a PhD for \"street cred\" or because you think that'll give you a better job with more money then probably you shouldn't do it.  \n\n\nA PhD is like a tool not a ticket meaning that you getting a PhD will not imply a better job, the PhD only opens the door for you to apply to really small niche of jobs which need a PhD now you can also apply to normal jobs but you'll be offered the same income as someone with a MS or a Bachelor and that make a lot of people bitter about a PhD.  \n\n\n\"Follow your opportunities not your dreams but keep your dreams close\" Meaning that if you are offered a good paying job taking it wont mean that you'll distance from research you still can learn and keep in contact with colleagues and write papers and return to the academia.",
      "author": "one_bit_dev",
      "created": 1630515872,
      "upvotes": 1,
      "replies": {}
    }
  }
}