{
  "sid": "ollqky",
  "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/",
  "title:": "Quitting postdoc fellowship to change careers completely",
  "text": "Long story short, COVID really did a number on my mental health and made me realize that I’ve been forcing myself to continue down my career for everyone else (family/PI pressure, guilt of using funding) and not for myself.\n\nI decided that I need to leave my fellowship and change careers entirely, but I’m not sure what the correct etiquette is. I wasn’t really given a formal contract either, so I’m wondering if breaking this decision to my mentors during our next scheduled meeting and giving a two week notice would be appropriate? \n\nAny insight would be appreciated!",
  "author": "chickenandwaffurs",
  "created": 1626456849,
  "updated": 1634082523,
  "over_18": false,
  "upvotes": 37,
  "upvote_ratio": 1.0,
  "comments": {
    "h5gu0to": {
      "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5gu0to/",
      "text": "I would give way more notice than two weeks. 1-2 months is better. The most professional way to handle this would be to tell your PI in person and tell them you would be willing to train people. It’s not easy to replace someone on short notice so the more you can do to ease the transition the better things will be with your PI.\n\nAlso, not to pry but do you have a job lined up? A career to switch into? It’s fine if that’s your choice but another option is time off from lab to see if that’s what you want to do, and that way you don’t burn a bridge in the process.",
      "author": "ChemistryMutt",
      "created": 1626484848,
      "upvotes": 16,
      "replies": {
        "h5ildlq": {
          "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5ildlq/",
          "text": "> I would give way more notice than two weeks. 1-2 months is better. The most professional way to handle this would be to tell your PI in person and tell them you would be willing to train people\n\n\nThis sentiment, while common in academia, is crazily out of touch with the rest of the working world where no one would ever consider giving notice that long. This person is miserable and has no desire to continue in academia. It's cruel to tell them that the 'right' and normal thing to do is continue to be miserable for another 2 months in order to minimize the impact on the position that's making them miserable. \n\nPostdoc positions by design are temporary. I've seen plenty of postdocs give 2 weeks notice before heading to corporate jobs (corporate jobs generally won't wait much longer that after making an offer). The labs they left were fine.",
          "author": "carpecaffeum",
          "created": 1626530337,
          "upvotes": 15,
          "replies": {}
        },
        "h5gwsny": {
          "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5gwsny/",
          "text": "Thanks for your advice! My field is actually in social/health sciences, so I don’t work in a lab that would need replacement thankfully. I’ve already completed my required year 1 project so figured it was a clean time for me to leave.\n\nI don’t have anything officially lined up, but I’m making a switch into an acting/entertainment career (while picking up part-time survival jobs in the process). I have enough saved to get me through half a year while I look for jobs though because I’ve been fairly frugal since college.",
          "author": "chickenandwaffurs",
          "created": 1626486311,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h5g1j76": {
      "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5g1j76/",
      "text": "Really happy for you OP that you realized what’s truly going to make you happy :) I’m still a grad student so I don’t have any actual advice but it’s inspiring seeing people taking control of their lives. Best of luck to you and hope this community can give you some clarity",
      "author": "NattyKhala",
      "created": 1626470672,
      "upvotes": 5,
      "replies": {
        "h5g3h64": {
          "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5g3h64/",
          "text": "Thank you so much!",
          "author": "chickenandwaffurs",
          "created": 1626471567,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h5izjbu": {
      "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5izjbu/",
      "text": "Honestly bro if you’re personally not happy with something you shouldn’t do it, doesnt matter who tells you what or how much you make or whatever. Way too many people nowadays get stuck in these never ending cycles of “well I’ve been doing it for x amount of years I can’t stop now” and it’s sad cus they’re not happy.  Not really much insight here but just saying good choice, to chase what you want and be who you are cus the world we live in makes that really hard sometimes",
      "author": "Solaire_of_Astora211",
      "created": 1626537560,
      "upvotes": 5,
      "replies": {
        "h5l82ok": {
          "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5l82ok/",
          "text": "Thanks so much for the encouragement! I agree completely and can’t wait to start doing what makes me happy.",
          "author": "chickenandwaffurs",
          "created": 1626578483,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h5hwsci": {
      "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5hwsci/",
      "text": "Congratulations.   I'm glad you woke up.",
      "author": "onlyonetruthm8",
      "created": 1626511145,
      "upvotes": 4,
      "replies": {
        "h5il2wc": {
          "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5il2wc/",
          "text": "Ha, thanks! Me too 😅",
          "author": "chickenandwaffurs",
          "created": 1626530172,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h5f86da": {
      "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5f86da/",
      "text": "Just sent an email and move on if your mind is really made up. But do you have any job offers?",
      "author": "thedarkwillcomeagain",
      "created": 1626457852,
      "upvotes": 2,
      "replies": {
        "h5fadx8": {
          "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5fadx8/",
          "text": "Thanks for the advice. Nothing official yet, but I have enough saved up (Been frugal & saving since college) to survive for about half a year to look for opportunities. My fellowship is a bit unique in that year 1 and year 2 consist of different training activities, and I’ll be expected to sign my year 2 contract soon… thought it’d be best to leave before this even if I need to take some time off to look for jobs.",
          "author": "chickenandwaffurs",
          "created": 1626458786,
          "upvotes": 6,
          "replies": {
            "h5ggcnl": {
              "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5ggcnl/",
              "text": "Don't send an email - that's terrible advice and really unprofessional. Do it face to face, agree a notice period in which you can wrap stuff up (this doesn't mean finish all your projects, but leave them in an ordered state so someone else can pick them up). As you don't have another post to go to you can afford to be a little generous with the notice period, then put it all in writing in your formal resignation letter (email).\n\nETA 2 weeks in the US is fairly standard so that's not an unreasonable suggestion. You might want to consider being open to staying up to a month of they want you too. Once you've done the deed, you'll probably feel so much better about everything and money is money.",
              "author": "ACatGod",
              "created": 1626477795,
              "upvotes": 15,
              "replies": {
                "h5giaxu": {
                  "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5giaxu/",
                  "text": "Agree, definitely do it face to face and provided they've been a decent boss please be mindful that it might come as a shock, and they'll probably want to talk through your reasoning. If you are going to need a letter of recommendation don't forget to mention that.",
                  "author": "The-very-naughtyduck",
                  "created": 1626478778,
                  "upvotes": 3,
                  "replies": {}
                },
                "h5gwadt": {
                  "link": "/r/AskAcademia/comments/ollqky/quitting_postdoc_fellowship_to_change_careers/h5gwadt/",
                  "text": "Thanks, appreciate this advice! My next mentor meeting is coming up so I was thinking of discussing it then face to face.",
                  "author": "chickenandwaffurs",
                  "created": 1626486043,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}