{
  "sid": "cqasga",
  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/",
  "title:": "Academic job applications are making me a terrible person",
  "text": "I’m a postdoc in STEM in the US and this a throwaway because I expect to catch some slack and quite frankly deserve it.\n\nI feel bad about this, but I’m jealous of one of my colleagues’ situation and can’t help it. She is what is commonly called a “trailing spouse”. Recently I found out that she and her husband are both starting as assistant professors at an R1 institution. The problem is, she has only one first author paper from both the PhD and 4+ years as postdoc. This is absolutely not a track record that gets anybody in my field assistant professor interviews. Her husband is pretty impressive though and I suspect this was a concession to get him.\n\nThis job is literally a dream of mine. I would go to the ends of the earth just to get a lab, a modest startup and an ability to sole-PI grants (which are all things she got judging by twitter posts). I get that I’m being quite possibly sexist right now, but I am also a woman, I’m just uncommitted. I made a conscious choice not to date in grad school and postdoc because career and geographic mobility came first.\n\nPlease don’t @me with industry job evangelizing. I have transferable skills and could probably do well in the private sector. TT job at an R1 is the dream because of complete intellectual freedom in what I research and how I run my group.",
  "author": "JobMarketThrowaway00",
  "created": 1565794563,
  "updated": 1634081178,
  "over_18": false,
  "upvotes": 159,
  "upvote_ratio": 0.92,
  "comments": {
    "ewuzeky": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewuzeky/",
      "text": "I spent 9 years in postdocs and fixed term teaching contracts before I landed a permanent faculty role in the UK. In that time I saw students *that I had taught while I was a PhD student* go through and get permanent faculty positions. I saw people with worse teaching and research experience than me get positions. I saw people end up on projects that ended up getting unexpected nature papers and immediate hires into permanent roles. I saw skilled, talented, and well published people drag on in postdocs for years before making their escape elsewhere, and I saw outstanding future researchers nope-out of the whole thing immediately on getting their PhDs. \n\nI think half the problem is the people genuinely think this whole process is a meritocracy. It isn't, and it has never been. There is a huge amount of luck; you need to be on projects that turn out to be productive, you need to be on projects that are timed right such that their output is picked up and relevant to the wider field. You need to be hitting the job market at the right time for the right jobs to be coming available. You need the right universities to be looking for the right applicants in just the right niche at just the right time. \n\nGetting bitter about other peoples success in such a luck-based system is a total waste of your time. You may as well get angry that someone rolled a higher number on a pair of dice than you did. Be happy that they succeeded, and carry on plugging away. Or cut your losses. Whatever you feel works best for you.",
      "author": "OrbitalPete",
      "created": 1565795214,
      "upvotes": 303,
      "replies": {
        "eww8yft": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/eww8yft/",
          "text": "While I agree with you that much is based on luck, a few other things are not. First, something that if often not spoken about, but which is very significant, is the system of favors along networks in which people with specific advisers or from specific institutions get favored, even if they don't have as good a research record as others who might not be as well connected. And second, policies leading to cuts in education (affecting different countries in different ways) mean that fixed positions become fewer and fewer, making hire processes increasingly problematic and non-transparent when every position is flooded with applications and under this pressure a lot of irregular, random and sometimes unethical stuff goes on. I'm in the social sciences and it really annoys me how people who claim to understand society are governed by elitism and nepotism rather than merit and scientific integrity, apparently without being conscious of it (or at least never mentioning it in public). I agree with you that op might want to keep trying, but perhaps she should also play the connection game and call in any favors she has coming to her. It's unethical, but her competition is going to do it, so she might as well, if she is going to compete on any kind of level field.",
          "author": "encom-mcp",
          "created": 1565823276,
          "upvotes": 64,
          "replies": {
            "ewwscml": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwscml/",
              "text": ">While I agree with you that much is based on luck, a few other things are not. First, something that if often not spoken about, but which is very significant, is the system of favors along networks in which people with specific advisers or from specific institutions get favored, even if they don't have as good a research record as others who might not be as well connected. \n\nBingo. Academia is obsessed with pedigree and prestige. Patronage networks and opportunity hoarding can be determinative.",
              "author": "episcopa",
              "created": 1565834143,
              "upvotes": 44,
              "replies": {}
            },
            "ewwyssp": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwyssp/",
              "text": "Even getting into those institutions or advisor's labs to *start with* is largely about luck though. Which labs had openings the year you applied, who else applied for that research interest that year, whether your undergrad research advisors had connections, etc. The earlier you get some sort of lucky break - a prestigious award, a well connected advisor or collaborator, etc - the better your shot is.",
              "author": "mediocre-spice",
              "created": 1565838963,
              "upvotes": 16,
              "replies": {}
            },
            "ewxh22e": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxh22e/",
              "text": "I know of a situation recently, where someone went for a fellowship interview. They were prepared, it was tight, should be grand. \n\nOne of the panel was just a *prick*. Didn't let her finish questions, would throw accusations which were patently false like 'you have never published on topic X' when they had several papers on it. Bizarre.\n\nAnyway, if you looked back over previous years, the winner was *always* someone from his lab (!).",
              "author": "dl064",
              "created": 1565856993,
              "upvotes": 12,
              "replies": {}
            },
            "ewwspx6": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwspx6/",
              "text": "I don't think calling in favors is unethical. \nIt's the way the system works and OP needs to get savvy. I believed for years that I could get a job based on my merits alone. Accepting that was not the case helped me survive the market.",
              "author": "ProfMamaByrd",
              "created": 1565834391,
              "upvotes": 11,
              "replies": {
                "ewwvmlx": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwvmlx/",
                  "text": "Just because it is practical does not make it ethical, unfortunately. What about kids born to wealthy families and whose parents are \"legacies\" in an Ivy League school, giving them all kinds of entry points for such networks, versus kids who are the first of their family to go to college, don't have any family network or wealth to use to make connections, and go to a state college? I personally don't think it is ethical that we reward moderately competent rich kids more than smart working class kids who have had to work much harder to get where they are. But sure, I don't tell my students to try to change the inertia of the system, I tell them that realistically they are going to need to play the game of connections and networks.",
                  "author": "encom-mcp",
                  "created": 1565836514,
                  "upvotes": 28,
                  "replies": {}
                },
                "ewxh5d5": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxh5d5/",
                  "text": "It is practical and the way it works, but it is *obviously* unethical, and the more the system stamps it out, the better. \n\nI think the best system is genuinely the idea that grants/fellowships are rated, and then the fundable ones are put in a pot and plucked out of a hat.",
                  "author": "dl064",
                  "created": 1565857084,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        },
        "eww3rwz": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/eww3rwz/",
          "text": "Your reply made me feel better about my situation. Thank you.",
          "author": "brucedeedy",
          "created": 1565819812,
          "upvotes": 15,
          "replies": {
            "ewwxra1": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwxra1/",
              "text": "Me too. Thanks.",
              "author": "bomchikawowow",
              "created": 1565838141,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ewws9o8": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewws9o8/",
          "text": ">I think half the problem is the people genuinely think this whole process is a meritocracy. It isn't, and it has never been. There is a huge amount of luck; you need to be on projects that turn out to be productive, you need to be on projects that are timed right such that their output is picked up and relevant to the wider field. You need to be hitting the job market at the right time for the right jobs to be coming available. You need the right universities to be looking for the right applicants in just the right niche at just the right time.\n\nYou also need the right pedigrees. This is a pedigree obsessed field. A very very qualified person with lots of first author publications who graduated from Area State U will lose out to a Harvard person with no papers and no experience.",
          "author": "episcopa",
          "created": 1565834086,
          "upvotes": 10,
          "replies": {
            "ewx68s0": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewx68s0/",
              "text": "This is certainly a thing in some countries and fields,  but definitely not universal.",
              "author": "OrbitalPete",
              "created": 1565845881,
              "upvotes": 12,
              "replies": {}
            },
            "ewx4ok6": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewx4ok6/",
              "text": "[deleted]",
              "author": null,
              "created": 1565844253,
              "upvotes": 10,
              "replies": {
                "ewyerre": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewyerre/",
                  "text": ">In physics, nobody will give fuck about your university.\n\nThat's actually not true. This is the research field of a friend of mine and, while I don't recall the stats off of the top of my head, an alarmingly high number of tenure track professor positions go to people who graduated from the top 25 schools for physics (Edit: in the US). If you're interested, I can ask for the numbers, but they are in the middle of preparing a publication, so I might be able to just send a link to the arXiv when it's done.",
                  "author": "Esmereldista",
                  "created": 1565879824,
                  "upvotes": 5,
                  "replies": {
                    "ewyht7g": {
                      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewyht7g/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1565881310,
                      "upvotes": 3,
                      "replies": {
                        "ewzrt1z": {
                          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewzrt1z/",
                          "text": "That's a good thought, but I have also been told that if I don't come from one of the top 25 that I shouldn't apply for a faculty position in certain universities (from people who work at those universities). So, the research agrees with my personal experience, though I've not been around for a terribly long time, so maybe I just met a bunch of jerks. Who knows.",
                          "author": "Esmereldista",
                          "created": 1565899807,
                          "upvotes": 2,
                          "replies": {
                            "ewztgtv": {
                              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewztgtv/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1565900533,
                              "upvotes": 2,
                              "replies": {
                                "ewzwoqz": {
                                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewzwoqz/",
                                  "text": "I wasn't talking about working in a TT at a top 25. The research that my friend does shows that an alarmingly high percentage of TT faculty positions, in general, go to folks from the top 25. Of course everyone's experience is different and we all know people who are exceptions to this, but the numbers don't lie. This is not my research field, so my personal knowledge is somewhat limited, but as I said before, my friend is currently working on publishing these numbers. If you'd like, I can find their references or direct you to the arXiv when the manuscript is complete. Just let me know.",
                                  "author": "Esmereldista",
                                  "created": 1565901751,
                                  "upvotes": 1,
                                  "replies": {
                                    "ex00rld": {
                                      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex00rld/",
                                      "text": "[deleted]",
                                      "author": null,
                                      "created": 1565903326,
                                      "upvotes": 2,
                                      "replies": {
                                        "ex0vhd9": {
                                          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex0vhd9/",
                                          "text": ">When hiring, I will chose applications that demonstrated the ability to get research done and bring in funding and/or have strong recommendations from researchers that I know to be good judges of performance.\n\nAs a post-doc on the job market with a strong research/presentation/publication record, who did not attend a top 25, this gives me hope. To be honest, my friend's research has kind of discouraged me a bit. I suppose that's where the \"grit\" comes in.",
                                          "author": "Esmereldista",
                                          "created": 1565923222,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "ex02alx": {
                                      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex02alx/",
                                      "text": "Them being from an Ivy league institution is just one parameter. What were their publication and funding records?\nAre these people actually being hired despite poorer records compared to state university grads or because their pedigree actually helped them get better papers and grant funding than the state university grads?",
                                      "author": "Minny7",
                                      "created": 1565903912,
                                      "upvotes": 2,
                                      "replies": {
                                        "ex0uzed": {
                                          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex0uzed/",
                                          "text": "I never said anything about Ivy Leagues. Are you thinking of the OP of this thread? Also, again, not my research. It's my friend's research. I'd be happy to share the arXiv when they finish their manuscript.",
                                          "author": "Esmereldista",
                                          "created": 1565922867,
                                          "upvotes": 1,
                                          "replies": {
                                            "ex0xtcr": {
                                              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex0xtcr/",
                                              "text": "Yeah sorry I got that confused with another comment. Nevertheless, the point still stand. And if you don't actually know any details about your friend's research to be able to answer mine and other posters in this thread's basic questions, why are you posting these conclusions as fact?",
                                              "author": "Minny7",
                                              "created": 1565924925,
                                              "upvotes": 2,
                                              "replies": {
                                                "ex21zeo": {
                                                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex21zeo/",
                                                  "text": ">why are you posting these conclusions as fact?\n\nI stated generalizations, not facts. I've also offered to ask my friend for numbers and offered to share their arXiv many times. Would you like for me to ask them about the hiring statistics I mentioned?\n\nFWIW, I agree that the thread OP's statement was over generalized.",
                                                  "author": "Esmereldista",
                                                  "created": 1565961113,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ewz9cq0": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewz9cq0/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1565892878,
                  "upvotes": 3,
                  "replies": {
                    "ewzg762": {
                      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewzg762/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1565895458,
                      "upvotes": 2,
                      "replies": {
                        "ex7suce": {
                          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex7suce/",
                          "text": "> Which is not true in most fields. A very very qualified person will lose out to a Harvard person because Harvard allowed them to get an even better qualification, not because they are from Harvard. Being from Harvard and having a shitty track record would probably make your chances worse because people implicitly assume that they had to be a real fuckup to end up in a situation like that.\n\nWrong. Academia is very, very obsessed with brand. That Harvard, Yale, Princeton, etc degree in and of itself is considered evidence of having a great track record, and in and of itself is considered a superior qualification. \n\n  \n\n\"The evidence is not only anecdotal. A recent study by Aaron Clauset, Samuel Arbesman, and Daniel B. Larremore shows that “a quarter of all universities account for 71 to 86 percent of all tenure-track faculty in the U.S. and Canada in these three fields. Just 18 elite universities produce half of all computer science professors, 16 schools produce half of all business professors, and eight schools account for half of all history professors.” This study follows the discovery by political scientist Robert Oprisko that more than half of political-science professorships were filled by applicants from only 11 universities.\" \nhttps://chroniclevitae.com/news/929-academia-s-1-percent\n\nAcross the sampled disciplines, we find that faculty production (number of faculty placed) is highly skewed, with only 25% of institutions producing 71 to 86% of all tenure-track faculty (table S2; this and subsequent ranges indicate the range of a given quantity across the three disciplines, unless otherwise noted). The number of faculty within an academic unit (number of faculty hired, that is, the unit’s size) is also skewed, with some units being two to three times larger than others. Business schools are especially large, generally containing several internal departments, with a mean size of 70 faculty members who received their doctorates from other within-sample units, whereas computer science and history have mean sizes of 21 and 29, respectively (see Supplementary Materials). The differences in size within a discipline, however, cannot explain the observed differences in placements.\nhttps://advances.sciencemag.org/content/1/1/e1400005",
                          "author": "episcopa",
                          "created": 1566064391,
                          "upvotes": 1,
                          "replies": {
                            "exhyv9o": {
                              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/exhyv9o/",
                              "text": "Oh and here's another one about prestige and patronage networks, and the role they play in publishing. \n\n&#x200B;\n\n[https://www.insidehighered.com/news/2018/03/02/study-finds-evidence-institutional-favoritism-academic-publishing](https://www.insidehighered.com/news/2018/03/02/study-finds-evidence-institutional-favoritism-academic-publishing)",
                              "author": "episcopa",
                              "created": 1566317345,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "exevfcx": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/exevfcx/",
                  "text": "Hi, the friend here, this is my research area and I do have a publication in the works and would be glad to shout my results from the rooftops, because of their implications on diversity and inclusion, which physics desperately lacks (sad, but true). I've looked at every single R1, R2, and R3 institute in the U.S. which grants a Ph.D. in Physics, Astrophysics, Astronomy, etc. and found that the Ph.D. graduates from the top 25 programs (Harvard, Stanford, CalTech, etc.) occupy more TT positions than graduates from all other institutions (US and International) ***combined***. I will gladly share my publication on the arXiv when it's finished.",
                  "author": "fresnel_lins",
                  "created": 1566226304,
                  "upvotes": 3,
                  "replies": {
                    "exf2068": {
                      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/exf2068/",
                      "text": "Don't be surprised if once you publish it, you'll be told that well, people from  top 25 programs (Harvard, Stanford, CalTech, etc.) are just inherently *better* or more qualified or publish more than all the other universities combined. \n\nBut of course, the brand name of these universities helps you get more publications and more grants in the first place. \n\nThere are many many articles about this, but here are a few. \n\n[https://www.sciencemag.org/careers/2016/03/how-prestige-shapes-professoriate](https://www.sciencemag.org/careers/2016/03/how-prestige-shapes-professoriate)\n\n[https://www.insidehighered.com/news/2017/01/20/study-suggests-top-humanities-journals-favor-research-elite-institutions](https://www.insidehighered.com/news/2017/01/20/study-suggests-top-humanities-journals-favor-research-elite-institutions)\n\n[https://quod.lib.umich.edu/e/ergo/12405314.0005.010/--prestige-bias-an-obstacle-to-a-just-academic-philosophy?rgn=main;view=fulltext](https://quod.lib.umich.edu/e/ergo/12405314.0005.010/--prestige-bias-an-obstacle-to-a-just-academic-philosophy?rgn=main;view=fulltext)",
                      "author": "episcopa",
                      "created": 1566230822,
                      "upvotes": 2,
                      "replies": {
                        "exf2lvm": {
                          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/exf2lvm/",
                          "text": "I have been told this, many many many times. I'm actually not trying to fight this system because like many here have said, name = money = best lab equipment = publications = recognition = name and the cycle repeats.  My \"scheme\" is to get more diversity into the graduate programs of those top 25 Ph.D. granting institutions, and hopefully get physics faculty on the whole more representative that way down the road (by like 2040). I actually include a more formal version of this caveat in my article because I want to be able to head off comments like that. If you have any suggestions of other feedback I should be wary of ahead of time, I'd be appreciative to hear it!",
                          "author": "fresnel_lins",
                          "created": 1566231228,
                          "upvotes": 2,
                          "replies": {
                            "exhxoct": {
                              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/exhxoct/",
                              "text": "Well, here's where I disagree. In the humanities, lab equipment is irrelevant and grants are often third party. And yet, a small handful of universities are STILL overrepresented: \n\nFor example: \n\"The top 20 percent of institutions account for 86 percent of the articles, while the top ten PhD-granting institutions, which represent less than 3 percent of all institutions in our data set, account for just over half (51.3 percent) of all articles published. As we can see in table 1, authors with PhDs from Yale, Harvard, University of California–Berkeley, Columbia University, University of Chicago, Cornell University, Stanford University, Princeton University, Johns Hopkins University, and Oxford University wrote 2,729 of 5,259 articles.\"\n\nhttps://criticalinquiry.uchicago.edu/publication_power_and_patronage_on_inequality_and_academic_publishing/\n\n\nIn the humanities, you can get an article published without having spent a thin dime on research. (I know I did. Several times.)  So we can't say that money is the variable here.  Rather, I think it is reasonable to conclude that the relevant variable is simply the power of the brand name of one's institutional affiliation. And as someone who has been the managing editor on an academic journal, I have anecdotal evidence to support this as well. \n\nI would argue that a system that continues to place graduates from the same handful of schools in 60-80% of the tenured roles is not one we should support, regardless of how \"diverse\" those graduates are. Rather, we should be aiming for a system that challenges these prestige networks in the first place.",
                              "author": "episcopa",
                              "created": 1566316566,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ewy7pna": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewy7pna/",
                  "text": "I did have suspicion when reading the OP's post and the first few comments that the situation being discussed apparently has little or no thing to do with physics, my field too. And it may be very well country dependent too, I have been in some prominent science and technologically developed European and Asian countries for more than two years in each and the preference over applicants from reputed universities or PIs is not that strong, although the connection and network factors are not completely negligible either.",
                  "author": "whatisa_sky",
                  "created": 1565876327,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "ewx2cbt": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewx2cbt/",
              "text": "I don't think that's true at all.  Do you have any data to back up your assertion?  I have a lot of data to the contrary...",
              "author": "dampew",
              "created": 1565841985,
              "upvotes": 6,
              "replies": {
                "ex7t1ub": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex7t1ub/",
                  "text": "Yes. \n\nThe evidence is not only anecdotal. A recent study by Aaron Clauset, Samuel Arbesman, and Daniel B. Larremore shows that “a quarter of all universities account for 71 to 86 percent of all tenure-track faculty in the U.S. and Canada in these three fields. Just 18 elite universities produce half of all computer science professors, 16 schools produce half of all business professors, and eight schools account for half of all history professors.” This study follows the discovery by political scientist Robert Oprisko that more than half of political-science professorships were filled by applicants from only 11 universities.\" https://chroniclevitae.com/news/929-academia-s-1-percent\n\nAcross the sampled disciplines, we find that faculty production (number of faculty placed) is highly skewed, with only 25% of institutions producing 71 to 86% of all tenure-track faculty (table S2; this and subsequent ranges indicate the range of a given quantity across the three disciplines, unless otherwise noted). The number of faculty within an academic unit (number of faculty hired, that is, the unit’s size) is also skewed, with some units being two to three times larger than others. Business schools are especially large, generally containing several internal departments, with a mean size of 70 faculty members who received their doctorates from other within-sample units, whereas computer science and history have mean sizes of 21 and 29, respectively (see Supplementary Materials). The differences in size within a discipline, however, cannot explain the observed differences in placements. https://advances.sciencemag.org/content/1/1/e1400005",
                  "author": "episcopa",
                  "created": 1566064465,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "ewxv84a": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxv84a/",
              "text": "That is a very vast over-generalization.\n\nWe made TT offers to 6-7 people (that I know of) in the last 5 years at my last R1 large state institution in biological sciences, literally all of them were from state universities or in that tier, despite interviewing many postdocs from Ivy leagues.  Perhaps pedigree is most important among the very top tier research centers but the no paper no experience sounds like a statement with no data to back that up.",
              "author": "Minny7",
              "created": 1565869105,
              "upvotes": 2,
              "replies": {
                "ex7t0yb": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex7t0yb/",
                  "text": "At my R1, in my program, we only made TT offers people from Harvard, Yale, and Princeton. What happens when my anecdote cancels out yours? \n\nAh yes. We turn to data. \n\n\"The evidence is not only anecdotal. A recent study by Aaron Clauset, Samuel Arbesman, and Daniel B. Larremore shows that “a quarter of all universities account for 71 to 86 percent of all tenure-track faculty in the U.S. and Canada in these three fields. Just 18 elite universities produce half of all computer science professors, 16 schools produce half of all business professors, and eight schools account for half of all history professors.” This study follows the discovery by political scientist Robert Oprisko that more than half of political-science professorships were filled by applicants from only 11 universities.\" https://chroniclevitae.com/news/929-academia-s-1-percent\n\n\"Across the sampled disciplines, we find that faculty production (number of faculty placed) is highly skewed, with only 25% of institutions producing 71 to 86% of all tenure-track faculty (table S2; this and subsequent ranges indicate the range of a given quantity across the three disciplines, unless otherwise noted). The number of faculty within an academic unit (number of faculty hired, that is, the unit’s size) is also skewed, with some units being two to three times larger than others. Business schools are especially large, generally containing several internal departments, with a mean size of 70 faculty members who received their doctorates from other within-sample units, whereas computer science and history have mean sizes of 21 and 29, respectively (see Supplementary Materials). The differences in size within a discipline, however, cannot explain the observed differences in placements. https://advances.sciencemag.org/content/1/1/e1400005",
                  "author": "episcopa",
                  "created": 1566064456,
                  "upvotes": 1,
                  "replies": {
                    "ex7vu01": {
                      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex7vu01/",
                      "text": "Your anecdote doesn't cancel out anything since the only thing I stated was that jobs offer were made to state u applicants thereby nullifying your statement that those would have been beaten out by any Ivy Leaguer regardless of CV.\nYou still aren't providing any other data besides where the applicant went to school, like publication and funding record and this certainly doesn't back up your assertion that \n> A very very qualified person with lots of first author publications who graduated from Area State U will lose out to a Harvard person with no papers and no experience.",
                      "author": "Minny7",
                      "created": 1566065459,
                      "upvotes": 1,
                      "replies": {
                        "exf07hl": {
                          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/exf07hl/",
                          "text": ">Across the sampled disciplines, we find that faculty production (number of faculty placed) is highly skewed, with only 25% of institutions producing 71 to 86% of all tenure-track faculty https://advances.sciencemag.org/content/1/1/e1400005\n\nIf you read the rest of the you will learn that opportunity hoarding, patronage networks, and prestige play a far greater role in hiring than in actual merit. \n\nAnd btw, your likelihood of being published in the first place is influenced by the brand name of your university:\n\n>As figures 1 and 2 show, there is a strongly unequal distribution of PhD-granting institutions represented in the publication data. The top 20 percent of institutions account for 86 percent of the articles, while the top ten PhD-granting institutions, which represent less than 3 percent of all institutions in our data set, account for just over half (51.3 percent) of all articles published. As we can see in table 1, authors with PhDs from Yale, Harvard, University of California–Berkeley, Columbia University, University of Chicago, Cornell University, Stanford University, Princeton University, Johns Hopkins University, and Oxford University wrote 2,729 of 5,259 articles.\n\n[https://criticalinquiry.uchicago.edu/publication\\_power\\_and\\_patronage\\_on\\_inequality\\_and\\_academic\\_publishing/](https://criticalinquiry.uchicago.edu/publication_power_and_patronage_on_inequality_and_academic_publishing/)\n\nand here is the InsideHigherEd's writeup of this paper:\n\n[https://www.insidehighered.com/news/2017/01/20/study-suggests-top-humanities-journals-favor-research-elite-institutions](https://www.insidehighered.com/news/2017/01/20/study-suggests-top-humanities-journals-favor-research-elite-institutions)\n\nAnd another article from InsideHigherEd:\n\n\"Over coffee last month, a friend described a difference in his reception on the academic job market after he secured an Ivy League postdoc. He told me that, while his middle-tier institutional affiliation cracked a few doors, sending out applications on Ivy League letterhead busted them open.\n\nThat’s when it struck me: he’d laundered his degree. His credentials hadn’t changed, really. (He’d published over a half dozen articles before going on the job market the first time.) But he’d overcome a prestige deficit by switching letterheads.\n\nThis story shouldn’t surprise anyone with a stake in the tenure-track job market. Prestige, after all, is the hemoglobin in the bloodstream of academic value. We’re all familiar with a version of the academic placement truism that “universities don’t hire down.” Highly ranked programs hire their own, those aspiring to be highly ranked hire from the ranks of those already on top and so on\"\n\n[https://www.insidehighered.com/advice/2017/08/10/conversation-about-class-and-professoriate-essay](https://www.insidehighered.com/advice/2017/08/10/conversation-about-class-and-professoriate-essay)\n\nAnd here's another one:\n\n[https://www.sciencemag.org/careers/2016/03/how-prestige-shapes-professoriate](https://www.sciencemag.org/careers/2016/03/how-prestige-shapes-professoriate)\n\nHere's another one:\n\n[https://www.chronicle.com/article/How-the-Academic-Elite/241374](https://www.chronicle.com/article/How-the-Academic-Elite/241374)\n\nAnd another one about academia's prestige problem:\n\n[https://www.chronicle.com/article/Academe-s-Prestige-Problem/241432](https://www.chronicle.com/article/Academe-s-Prestige-Problem/241432)\n\nI dunno, it's very much an open secret that academia has a prestige problem. I am not sure why this is coming as a surprise to you.",
                          "author": "episcopa",
                          "created": 1566229614,
                          "upvotes": 1,
                          "replies": {
                            "exfcgld": {
                              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/exfcgld/",
                              "text": "Again, nobody is disputing that prestige plays a significant role in academic hiring. But saying a no publication no grant Harvard grad will always beat out a mid-tier grad regardless of publications or grant funding obtained is unbacked by any of the data or anecdotes over coffee you have presented so far. The fact that you still do not grasp the argument and keep presenting the same blogs and anecdotes over and over is a little tiresome.\n\nIt is right there in some of the blogs you present, that academic prestige leads to better opportunities, networking, resources ..etc... So essentially it is saying that these grads and post docs tend to have better CVs and access to equipment and personnel that supports academic success via getting better funding or publishing \"better\" papers in \"better journals\". It in no way implies that name of the institution alone gets you hired on the spot.",
                              "author": "Minny7",
                              "created": 1566237536,
                              "upvotes": 1,
                              "replies": {
                                "exhwwva": {
                                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/exhwwva/",
                                  "text": "Well, having been an assistant to a professor on a hiring committee, I have seen first hand a long list of very very qualified applicants from public universities with many publications get discarded while people from Harvard, Yale, and Princeton with no publications -- and not even a completed dissertation -- got shortlisted. \n\nAnd btw, I am seeing in the articles I present that academic prestige leads to better \"opportunities, networking.\" I also see where chances of getting published in the first place are increased by virtue of having gone to the \"right\" university, thus demonstrating -- again -- the outsized role played by patronage networks in academia. \n\n\"The top 20 percent of institutions account for 86 percent of the articles, while the top ten PhD-granting institutions, which represent less than 3 percent of all institutions in our data set, account for just over half (51.3 percent) of all articles published. As we can see in table 1, authors with PhDs from Yale, Harvard, University of California–Berkeley, Columbia University, University of Chicago, Cornell University, Stanford University, Princeton University, Johns Hopkins University, and Oxford University wrote 2,729 of 5,259 articles.\"\n\nhttps://criticalinquiry.uchicago.edu/publication_power_and_patronage_on_inequality_and_academic_publishing/\n\nThis is in addition to the sections of these articles showing that graduates of a handful of universities are way overrepresented amongst tenure line faculty, which you seem to be taking as evidence that graduates of these universities are simply more qualified. \n\nNot surprising. \n\nAs usual,  discussions about opportunity hoarding are playing out along the same contours that they always do: \n\n-it is suggested that graduates of certain universities are over represented in TT faculty due to the outsized role played by patronage networks and brand name in the hiring process\n\n-this suggestion is characterized as anecdote \n\n-actual data is presented showing that this is not, in fact, anecdote\n\n-the data is framed as evidence that graduates from these universities are actually deserving of these TT jobs because they simply have more access to \"opportunity\" than their peers at schools whose brand names are less prestigious. \n\n-it is pointed out that opportunity is not the same as qualification, and that opportunity hoarding and patronage networks are not equivalent to intellectual rigor \n\n-repeat \n\nOf course, if you find this \"tiresome\" you are welcome to decline to participate further.",
                                  "author": "episcopa",
                                  "created": 1566316060,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eww78mg": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/eww78mg/",
      "text": "Speaking of trailing spouses, I know at least one example of a trailing *ex* spouse AND her current partner both getting TT jobs in order to recruit a prominent scholar.  They had a joint custody arrangement so all 3 had to be in the same city!  I’m not saying any of them were unqualified for the positions, but it was the family situation that made it happen.",
      "author": "parrotlunaire",
      "created": 1565822112,
      "upvotes": 55,
      "replies": {
        "ewwanfq": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwanfq/",
          "text": "wow",
          "author": "phsics",
          "created": 1565824462,
          "upvotes": 24,
          "replies": {}
        },
        "ewytsqd": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewytsqd/",
          "text": "This is insane",
          "author": "hellozebrafish",
          "created": 1565886680,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ewvzwr3": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvzwr3/",
      "text": "I have wasted far too much time looking at colleagues' twitter feeds and feeling bitter. My advice is just don't compare yourself like that. Besides, who knows what else is going on there. She might be overworked and unhappy. You might end up much better looked after at a \"worse\" place.",
      "author": "another_secret_prof",
      "created": 1565817479,
      "upvotes": 23,
      "replies": {
        "ewxhbrt": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxhbrt/",
          "text": "There was an excellent thread on here in the last year, where someone had a similar post from the other perspective, like\n\n> my officemate was not succesful in their fellowship, and I was. How do I make them feel better? I feel guilty.\n\nAnd one of the top responses was like\n\n> This is a long game; maybe you'll find yourself out of work in 5 years when the fellowship is done, and they'll be on twice as much, entrenched in a great data science job.",
          "author": "dl064",
          "created": 1565857264,
          "upvotes": 4,
          "replies": {}
        },
        "ewxdnoe": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxdnoe/",
          "text": "This this this. I’ve left Twitter, and it was the right choice. Who needs to be on a comparison generating platform that produces infinite numbers of unattainable standards",
          "author": "raincloudsilverline",
          "created": 1565853567,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ewvrth8": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvrth8/",
      "text": "[deleted]",
      "author": null,
      "created": 1565812609,
      "upvotes": 69,
      "replies": {
        "ewzx3ht": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewzx3ht/",
          "text": ">Intellectual freedom to research means you're free to research whatever you get paid to research. Depending on your research interests, that might mean no freedom at all.\n\nI was planning to point this out, too.",
          "author": "Esmereldista",
          "created": 1565901927,
          "upvotes": 3,
          "replies": {}
        },
        "ex1hvmy": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ex1hvmy/",
          "text": "Depends a bit, but spousal hires can be advantageous to a department because it makes your faculty harder to poach.",
          "author": "WilyDoppelganger",
          "created": 1565945814,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ewwqn7r": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwqn7r/",
      "text": "[deleted]",
      "author": null,
      "created": 1565832973,
      "upvotes": 18,
      "replies": {
        "ewxhe3j": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxhe3j/",
          "text": "I know someone in Boston - female - who was headhunted by her PI, and she said 'I'd love to...but my husband' (they were from another continent). They found him a job based on what he *could* do, and I think he's now data manager or something.",
          "author": "dl064",
          "created": 1565857334,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ewvnskq": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvnskq/",
      "text": "While I'm a retired university professor, I've also worked in the computer industry and the military. (Though, I was drafted into the US Army so I never applied there.)\n\nFor whatever it is worth, I've never seen job applicants treated as poorly as I've seen them treated in Academia. That said, it is probably not prudent to  let events that you can't control influence your perspective. \n\n\n\n>... [keep in mind](https://www.insidehighered.com/blogs/confessions-community-college-dean/applying-faculty-jobs-community-colleges) that the market, ultimately, is not about you.  You can be pretty good and catch a lucky break, or you can be amazing and stuck on the periphery through no fault of your own.  There’s a tremendous element of luck to it, even more in the last few years.  I’ve seen plenty of searches in which the second-choice candidate was frankly excellent, and lost only because the first-choice candidate fit current needs more closely.  It happens.  Ultimately, you control only what you control.",
      "author": "UnoKitty",
      "created": 1565810205,
      "upvotes": 31,
      "replies": {
        "ewxh7mw": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxh7mw/",
          "text": "I have a friend who is an HR consultant, who often laughs that academics/people with PhDs are utterly brainwashed into not seeing their value.",
          "author": "dl064",
          "created": 1565857144,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "ewwpc1l": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwpc1l/",
      "text": "I saw a lot of friends in grad school get very unpleasant when they were on the market. When I went through it myself, I understood it: it's immensely stressful, there's tremendous uncertainty, and the line between the \"have\" and \"have nots\" feels super arbitrary and sometimes deeply unfair, and the whole thing makes one feel insecure and competitive.\n\nBut the silver lining is that once those people did get their futures sorted out, one way or another, they became the people I liked again. \n\nWhen I was on the market I resolved to just not interact with people when I was feeling uncharitable. And now that I'm in a good place myself, I try to use my position to help other good people when I can. \n\nJust try not to burn any bridges in the meantime. But it's OK to feel angry, stressed, etc. It's the market's fault, not yours. When you're feeling less insecure it will make you capable of feeling more charitable and understanding. It's tough for everyone. :-)",
      "author": "restricteddata",
      "created": 1565832087,
      "upvotes": 13,
      "replies": {}
    },
    "ewvjw5d": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvjw5d/",
      "text": "Two married academics face many challenges that a single academic does not. You are looking at the advantages they (she) has. What about their downsides. \n\nComparing yourself in this way is counterproductive. Keep working away, and analyze the situation you are in, the cards you have to play. Then play the best you can with those cards. \n\nThe job market brings out the worst in everyone emotionally. So expect that. But don’t fixate on others like this. Fixate on professional steps you can take.",
      "author": "rshaq99",
      "created": 1565807785,
      "upvotes": 75,
      "replies": {}
    },
    "eww1k1o": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/eww1k1o/",
      "text": "I just finished my search and started this year. Lab, (very) modest startup at an R2, more teaching duties than I wanted. It's a frustrating process and you may have to make compromises at some point along the way to get most of what you want. \n\nIf her research wasn't strong enough to get the job herself, then there's a good chance she won't be funded (funding agencies take past publications into account) and she'll have a hard time at her 3 year renewal.",
      "author": "fleemfleemfleemfleem",
      "created": 1565818474,
      "upvotes": 9,
      "replies": {}
    },
    "ewwnww7": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwnww7/",
      "text": "I am on the job market this year. This will be my second time on the market. I recently deactivated my Twitter. It's been the best thing I've done so far. No more comparing to other people and feelings of jealousy and inadequacy. My CV is my CV. It is what it is. I'm hoping this new IDGAF attitude will be helpful. The first time around, the job market consumed me. I won't let that happen this time. Good luck to you.",
      "author": "trustjosephs",
      "created": 1565831138,
      "upvotes": 9,
      "replies": {}
    },
    "ewwq76a": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwq76a/",
      "text": "I see this all the time in my work, and I can see how it makes you bitter. but I’ve also come to see that bitterness is just a trap, which drains energies that could be spent more productively elsewhere. \nI empathize with your predicament. I’m NTT in a dying field and since my market is in the single digits (not exaggerating), I’m very proud of the long-term, well paid NTT position I landed. I’m the last one in my department who landed anything at all\nin academia since graduating 5 years ago, and I got this without any connection or help. It’s not what I trained for nor what I dreamt when I was a grad student, but I’m pretty happy with it. Now, there are at least 3 trailing spouses in my department who got hired on the TT or as VAPs because their wives/husbands, who happen to be in a much more marketable field or in senior roles, basically pulled strings. They had abysmal records compared to mine when they started, but they get to call themselves  “research faculty” with the grand total of 2 articles published, or teach 5 seniors in a vanity seminar that our program doesn’t really need, while I carry the load of teaching large courses at the intro level, and the department wants me to do it because I actually do a decent job, take my work seriously, and have kept the enrollments healthy against the odds. I feel like a work horse during the semester, between training  inexperienced TAs and grading hundreds of assignments, and finding the time to craft high quality, rigorous, innovative materials. \nIt would be easy for me to just spend my days pining over the unfairness of this, but I ultimately came to realize I would just be poisoning my own life. Whether or not I stew over this, the “undeserving” trailing spouses will still have their cushy jobs. So I choose to focus on my own career goals instead, and try to make choices that work for me and my family.\nBeing on the academic market was one of the most frustrating and unfair experiences I’ve had In my entire life. I’ve been on it and it nearly killed me. My husband was on it and he eventually gave up and left academia altogether. Such a soul-crushing endeavor can turn even the kindest person  into a jealous, caustic, spiteful jerk. Try to keep your sanity. Stay away from the comparisons--it’s a toxic way of thinking that won’t do anything for your wellbeing or career. Cultivate other thoughts, don’t let the tunnel vision engulf the totality of your days. You will be a better scholar, a better person and a better researcher for this. \nBest of luck in your academic job search, I really hope it works out for you.",
      "author": "pepperzilla",
      "created": 1565832668,
      "upvotes": 8,
      "replies": {}
    },
    "ewwj5hv": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwj5hv/",
      "text": "What would conceivably be sexist about this? It's a spousal hire in which a tenure line is given to a less qualified candidate. I can totally see how that would be frustrating. I don't think it has anything to do with the person's sex -- would it be any less annoying if the star was a woman and her husband got the spousal hire (or her wife)?",
      "author": "Lonelobo",
      "created": 1565829181,
      "upvotes": 15,
      "replies": {}
    },
    "ewwa9pv": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwa9pv/",
      "text": ".",
      "author": "GetCookin",
      "created": 1565824190,
      "upvotes": 12,
      "replies": {}
    },
    "ewvki1x": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvki1x/",
      "text": "Weber once said in \"le politique et le savant\" that the university is the place where you have to accept to see people of less merit pass in front of you in advancement. Are you ready to accept that? If not, it's maybe not the best place for you.\n\n&#x200B;\n\nEveryone here, those who are in academia as much as those who are trying to get in, have lived through similar situations, and as a woman myself, and as someone who has been in academia for 20 plus years, my advice to you is to not build resentment over it, because if you start like this as a post-doc, what will it be in twenty years?",
      "author": "lefromageetlesvers",
      "created": 1565808160,
      "upvotes": 17,
      "replies": {}
    },
    "ewv46ik": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewv46ik/",
      "text": "Sadly it is not only based on meritocracy. Maybe she doesn't have the same quality paper you do but it is possible that she made a good job interview presentation and was liked by the university department. Maybe she had good research ideas and capacity to attract funding. It is easy to feel jealous and I get you. But don't compare yourself to others that much. Cut that lady some slack and cut some tou yourself too. Make sure you are on the competition. And if things come to that, leave academia and do not look behind.",
      "author": "valheime",
      "created": 1565798264,
      "upvotes": 14,
      "replies": {
        "ewv8th2": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewv8th2/",
          "text": "C’mon... slack is unwarranted here. Everyone knows about trailing spouse hires. I have seen them.",
          "author": null,
          "created": 1565801161,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "ewy81uu": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewy81uu/",
      "text": "You're not a terrible person. Academia brings out the resentment and frustration in all of us; you're allowed to be jealous and upset. I hope you find a position that's perfect. <3",
      "author": null,
      "created": 1565876496,
      "upvotes": 2,
      "replies": {}
    },
    "ewyu9r2": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewyu9r2/",
      "text": "You're a frustrated person, which is just another name for a person on the market.  Certainly it's not quite right to think that those two people getting those two jobs has anything to do with you not getting a job, but, at some point, any person getting any job starts to feel like a slight against the as-of-now-jobless.\n\nAt the moment when you get a job, there will be a lot of people who made different choice who don't get a job.  Some will be mad at you, but, really, they're mad at the market.",
      "author": "mediaisdelicious",
      "created": 1565886870,
      "upvotes": 2,
      "replies": {}
    },
    "ewxl00h": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxl00h/",
      "text": "This might not be what you wish to hear, but I am happy to hear at least some couples get to have good jobs and stay together in the same city. \n\nI have been in your shoes feeling negative emotions for a (former) student/colleague over something much pettier - she was in a relationship with a TA while still a student. She started getting amazing grades in several classes he was a TA in and later on she got the award for the best student of the generation despite me having a better track record in both studies, extracurricular activities and research. (Can you guess who was the one dropping off applications from our studies to the committee?) I submitted a complaint to the University committee and we ended up sharing the award. There were other situations in which I could not do anything about the situation of the person who I felt negatively for, and the only solution is to let go and focus on yourself.\n\nWhat I also genuinely can say is that I wish you the best of luck (since that is apparently one magical ingredient) in getting a professorship position with all the freedom and funding you could possibly want.",
      "author": "This--is--Me",
      "created": 1565861142,
      "upvotes": 1,
      "replies": {}
    },
    "eww6euq": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/eww6euq/",
      "text": "I feel ya, I know of another trailing spouse and she is an absolute oblivious pain in the ass. I think its normal to feel jealous but I guess you need to consider if that trailing wife is genuinely happy - you can lie to everyone but ultimately you can't lie to yourself. She knows she is where she is because of her husband. Earning something gives you a completely different sense of fulfilment and content that no monetary gift or position can ever buy. Sounds mushy but its true.",
      "author": "zero2hero2017",
      "created": 1565821556,
      "upvotes": 1,
      "replies": {
        "ewwjjie": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwjjie/",
          "text": "Exactly, the trailing spouse is getting an opportunity but they still have to prove themselves to the department (for tenure) and to grant agencies for funding which will be tough to obtain if their lackluster academic record is representative of their ability to conduct fundable research.  It's not going to be a walk in the park and if they do manage to make the most of the opportunity, then they deserved to be there after all. If they can't, then they will fall out.  In the end, you can only focus on your own production and research.",
          "author": "Minny7",
          "created": 1565829465,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ewwwklv": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwwklv/",
      "text": "The thing about trailing spouses is that the jobs they get are almost always \"make-work\". They are expected to fail and most do, and the department only experiences a temporary rough patch in its budget.",
      "author": "GlassDeviant",
      "created": 1565837224,
      "upvotes": 1,
      "replies": {}
    },
    "ewwxz7o": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwxz7o/",
      "text": "Commiserations. I got passed over for a TT job earlier this year for a weapons-grade idiot because they came along with their even more idiotic spouse. These two are totally feckless and universally reviled by students. Why did they hire them? Because the university could get two warm bodies for the price of one TT position - Idiot 1 as TT, and Idiot 2 as Visiting Professor.",
      "author": "bomchikawowow",
      "created": 1565838310,
      "upvotes": 1,
      "replies": {}
    },
    "ewuzw58": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewuzw58/",
      "text": "Spousal hiring needs to end. Sure, throw them an NTT position. But tenure? I'd be mad too.",
      "author": "wolfowls",
      "created": 1565795528,
      "upvotes": -17,
      "replies": {
        "ewvt97v": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvt97v/",
          "text": "What? The spouse has to make tenure on their own, regardless of how they were brought in",
          "author": "lavenderelectric",
          "created": 1565813463,
          "upvotes": 20,
          "replies": {
            "ewvtv41": {
              "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvtv41/",
              "text": "It's good tenure is such an objective process then.",
              "author": "wolfowls",
              "created": 1565813834,
              "upvotes": -1,
              "replies": {
                "eww19i9": {
                  "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/eww19i9/",
                  "text": "Compared to getting a job in the first place? It absolutely is",
                  "author": "lavenderelectric",
                  "created": 1565818297,
                  "upvotes": 16,
                  "replies": {
                    "ewxbzoz": {
                      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewxbzoz/",
                      "text": "In my experience, I can control the fairness and objectivity of a TT search. When it comes to visiting professors moving to TT and spousal hires it's all about friendships and such.",
                      "author": "wolfowls",
                      "created": 1565851966,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ewvg19k": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvg19k/",
          "text": "I disagree. Spousal hiring is a good way to attract and keep candidates that you might otherwise not be able to attract and keep. Can it be extraordinarily unfair? Of course, but so can every other facet of the process. I don't see any reason why a problem with an unqualified spouse getting tenure isn't just fundamentally a problem with the tenure system itself, and the way that it *can* insulate people who are incompetent or unqualified relative to the present state of the market from losing their job to someone more qualified.",
          "author": "MaceWumpus",
          "created": 1565805464,
          "upvotes": 26,
          "replies": {}
        }
      }
    },
    "ewvsqf6": {
      "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewvsqf6/",
      "text": "I never heard of trailing spouses and frankly I'm quite shocked. Is this really a thing? In which country, please? \n\nAbout not getting the job I'm sorry that you are going through something so stressful. It does bring the worst in people. Try to take a day for yourself, go out with friends, have a great day. Sometimes we need to remember ourselves that life is not only work/gols/jobs. Good luck next time",
      "author": "Rrlgs",
      "created": 1565813157,
      "upvotes": -11,
      "replies": {
        "ewwp5ur": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewwp5ur/",
          "text": ">I never heard of trailing spouses and frankly I'm quite shocked. Is this really a thing?\n\nSpousal hires are absolutely a thing in the US, but are far less common than people are suggesting here. Basically only R1s and elite privates can afford them; the vast majority of the 4,500 colleges and universities in the US would laugh at you if you asked for one. There are exceptions, of course, for superstars, Nobel and Pulitzer holders, etc. But for average folks it's just not in the cards.",
          "author": "SnowblindAlbino",
          "created": 1565831973,
          "upvotes": 10,
          "replies": {}
        },
        "ewzy7pk": {
          "link": "/r/AskAcademia/comments/cqasga/academic_job_applications_are_making_me_a/ewzy7pk/",
          "text": "Yes, they are a thing in the US. Usually it'll happen when one candidate is really fantastic (and the college has money to pay for them both). The job candidate will get get their offer, then negotiate to get their spouse hired, too. The ones I know have all been NTT, but I'm not shocked that some schools can afford TT.",
          "author": "Esmereldista",
          "created": 1565902371,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}