{
  "sid": "pq76ky",
  "link": "/r/AskAcademia/comments/pq76ky/should_i_stay_or_should_i_go/",
  "title:": "Should I Stay Or Should I Go?",
  "text": "US 1st year postdoc, psychology (put in STEM rather than SS because I think this situation applies more there, though I recognize psychology is sometimes put in both). Thanks in advance for any advice.\n\nI graduated my PhD earlier this year, and took a one-year postdoc. My ultimate goal was to seek out a SLAC/regional type of job; I did apply to faculty positions last year and made some headway but decided to quit the search early and take a postdoc to improve my CV further and wait out the job market after the COVID crash. My postdoc PI offered to let me work remotely, given the short length of the job and the pandemic. I have been working remotely since the spring, and now the time has come to have more talks about next plans. My PI has just recently offered for me to stay on (and move next year) for at least 1-2 years and has funding for me on a grant. The work and lab are all great and we get along well.\n\nI have been considering staying on as I'd have the opportunity to try for more grants, get more pubs, etc., and it would be guaranteed employment (with a raise as well). And I do really like my work! However, I'm getting married soon, so my partner would have to get a new job (which may not be easy) + we'd have to move to a more expensive city far away from family + we'd have to put off some personal goals for further in the future (including starting a family). And at the end of the day, this won't guarantee a job in academia - I could very well be right back where I started & even if I did get a job, we'd just have to do the whole process over again with the move and my partner finding a job.\n\nIn our most recent meeting, I broached the topic of me applying for faculty jobs (which I had discussed before, with some support from the PI), and the PI essentially said that if I'm seriously considering the possibility of going on the market that the PI would want to go ahead and plan to replace me and keep it a one-year position. Their mindset is essentially \"there will always be jobs\" and I should just apply to them at the very end of the extended position. Having been on the job market, and having friends who are on it, I know this just isn't the case, especially if I want to have any sort of choice about where to live. The PI seems concerned about the job market taking up too much of my \"work time\". I tried to explain that I was planning on taking the longer position and merely applying to a couple \"would regret it if I didn't apply\" jobs (and I didn't want it to keep it a secret as the PI and I had discussed this before), but that didn't seem to make a difference.\n\nMy first target jobs have due dates coming up, and my PI also wants me to make a call around that time too. After this conversation, I'm honestly leaning towards just going for it, going on the market, and keeping this as a one-year position. I know the odds of getting an academic job are always long, and that I could be more qualified if I kept at the postdoc longer, but I don't want to drag my partner around the country and put off important life things if I don't end up getting an academic job. I have a good amount of savings, so if the worst-case scenario happens and I just end up with nothing at the end of the year, I could cut my losses and stay afloat while I try to find a good industry job. I specialize in stats so I think this is a possibility. My partner is a very \"whatever will make you happy\" type of person without strong feelings either way. Would it be a mistake to pass up this \"sure thing\"?",
  "author": "Vivid-Armadillo6583",
  "created": 1631907672,
  "updated": 1634078958,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hd8vrc0": {
      "link": "/r/AskAcademia/comments/pq76ky/should_i_stay_or_should_i_go/hd8vrc0/",
      "text": "The PIs attitude about job market is infuriating. I don’t know why they don’t understand that people need money and security to live. Besides that, to clarify, is the PI saying they would fire you if you tried to apply for jobs?",
      "author": "PublicHost939",
      "created": 1631908235,
      "upvotes": 5,
      "replies": {
        "hd8whgj": {
          "link": "/r/AskAcademia/comments/pq76ky/should_i_stay_or_should_i_go/hd8whgj/",
          "text": "Yes, I know. I think they feel that since I have a secure job with them (for the next couple of years) that I shouldn't worry about this. I don't think they would fire me now, but that they wouldn't extend the position if I would be open to applying for jobs throughout the time. This did surprise me because they had been more supportive in the past - I suspect that it's because this grant funding came through and provided more work, and now they're concerned about filling several jobs at once. \n\nIt also concerns me because what's to stop them from doing something similar if I do stay on for longer? Their letter/support will only increase in importance. If I stay for 3 years and then they don't want me to leave, I'll be in a worse position (and the city, and not sure what my partner will be doing for work).",
          "author": "Vivid-Armadillo6583",
          "created": 1631908540,
          "upvotes": 1,
          "replies": {
            "hdgvqvo": {
              "link": "/r/AskAcademia/comments/pq76ky/should_i_stay_or_should_i_go/hdgvqvo/",
              "text": "Yeah the “security” is fairly minimal, given that they pay dramatically below market rates for your skills. \n\nPIs have far too much power, given how little management training they get and how little inclination to invest in career guidance they seem to have. \n\nWhat you’re describing just seems abusive. So sorry you’re going through that.",
              "author": "PublicHost939",
              "created": 1632063074,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hd97i6r": {
      "link": "/r/AskAcademia/comments/pq76ky/should_i_stay_or_should_i_go/hd97i6r/",
      "text": "If you don't have a TT position in hand, staying in the post doc will benefit you more in the long run.",
      "author": "Doctor_HowAboutNo",
      "created": 1631913278,
      "upvotes": 2,
      "replies": {}
    }
  }
}