{
  "sid": "qxhnxx",
  "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/",
  "title:": "Creepy/Problematic Psyc PHD Supervisor",
  "text": "I am a 22F prospective clinical psyc PHD student applying to programs this application cycle and was very enthusiastic about a particular program that I found to be a very good fit with my research goals.  \n\nSo I spoke with a clinical psychology grad student recently and one of her advices was to check the social media presence of the potential advisors you will be working with to get a feel of who they are. \n\nSo this program being my top choice, I looked at the social media of the PI who is a 40 something year old male and does research work with mothers and children. \n\nI came across his instagram to see who he follows (wanted to check he’s not weird ) and shockingly saw that he follows about 5 different accounts that post super vulgar, revealing, and sexualized pictures and videos of young women in college(w names like Hot College Girls on TikTok) . I got super shocked and creeped out but don’t know if I should revoke my application or what to do if I actually get an interview.\n\nI had previously contacted him through email and he was very kind and approachable and told me to definitely apply to his lab (but I just saw that as him being  being polite on email). \n\nI know that it’s a MAJOR red flag so now I don’t know if I should work with him if I get in… so sorry to send such a long message but I’d be grateful if you have any advice or experience on what to do in such a situation. I feel really creeped out…",
  "author": "Regular-Weird597",
  "created": 1637333035,
  "updated": 1637381384,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.77,
  "comments": {
    "hl9shzo": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9shzo/",
      "text": "Are you absolutely sure that it is his actual profile? I've known of fake profiles set up by undergrads supposedly of professors. To the point that one professor I've worked with had to put on his personal webpage that he has no social media and to ignore any accounts claiming to be him.",
      "author": "Honestaltly",
      "created": 1637339612,
      "upvotes": 12,
      "replies": {
        "hl9ta79": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9ta79/",
          "text": "Unfortunately it's definitely him :( That's what I thought too so I triple checked.",
          "author": "Regular-Weird597",
          "created": 1637339922,
          "upvotes": 7,
          "replies": {
            "hl9umn4": {
              "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9umn4/",
              "text": "Damn. Then yes, this is an awful situation. On the one hand you could talk to his other students, particularly female students, and see if they have issues with him. But even if the answer is no, and they think he's a good supervisor, I know I personally would always have this instagram account in the back of my mind. At the very least I'd feel deeply uncomfortable whenever he was around undergraduate young women.",
              "author": "Honestaltly",
              "created": 1637340451,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hl9nohg": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9nohg/",
      "text": "Guess I'm in the minority here, but I don't really see the problem, except that he's probably one of those older folks who has no idea how much people can see about their social media habits. If you managed to find out what type of \"personal entertainment\" everyone in the lab likes you would be equally creeped out by everyone in the room, the only difference is that this guy was sloppy with his internet hygiene and you happened to actually find it. Why not judge him by how he comports and behaves with you instead of something you found online that wasn't intended to be public information?",
      "author": "trying_to_be_amelia",
      "created": 1637337685,
      "upvotes": 33,
      "replies": {
        "hl9oc7t": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9oc7t/",
          "text": "Also, you're several steps ahead. These would be questions to ask if and when you're accepted. You can always choose to decline later on if you apply and are accepted, but it may not even get to that. If you are accepted you will have much more opportunity for contact with the lab, the PI, and current students and can learn more about the situation then.",
          "author": "trying_to_be_amelia",
          "created": 1637337953,
          "upvotes": 8,
          "replies": {}
        },
        "hl9scsb": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9scsb/",
          "text": "Thank you so much for your honest advice. That's exactly why I brought this too Reddit because I was feeling conflicted about this whole situation myself! The only thing that might be a bit of concern is that he has never had any graduate students work with him before, this is the first time he is recruiting an MA/PHD student to work in his lab.",
          "author": "Regular-Weird597",
          "created": 1637339554,
          "upvotes": 5,
          "replies": {
            "hla3m08": {
              "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hla3m08/",
              "text": "> this is the first time he is recruiting an MA/PHD student to work in his lab\n\nFind out if you'd have a co-supervisor. At my uni it is standard practice that every first-time supervisor gets a more senior co-supervisor to lend their experience. At least personally that would reassure me somewhat. That's something you can explore during a possible interview. Until then I don't see a problem in just letting your applicaton work it's way through the system and seeing what comes of it. Worst case scenario you get some application practice, even if you decide it isn't for you.",
              "author": "Timguin",
              "created": 1637343946,
              "upvotes": 3,
              "replies": {
                "hla71bf": {
                  "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hla71bf/",
                  "text": "This is such good advice. I didn't think about that at all. There are definitely other professors in this program that I'd like to work with so def something to consider!",
                  "author": "Regular-Weird597",
                  "created": 1637345286,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hlanupx": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlanupx/",
          "text": "Honestly, I came to the same conclusion...I don't see the problem?\n\nThroughout the course of your life you will likely work with many people who have creepy, distasteful, or mildly disturbing habits. Some of them you will know about and most of them you won't. While it's not the *greatest and most appealing* thing that this professor, apparently, likes to look at pictures of hot college girls...there's nothing terrible about it, it's actually pretty common, and quite frankly, I'm willing to bet that a significant chunk of the people you trust watch porn. Would you refuse to work for someone who liked to watch porn?",
          "author": "roseofjuly",
          "created": 1637351490,
          "upvotes": 2,
          "replies": {
            "hlb8vmi": {
              "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlb8vmi/",
              "text": "> Would you refuse to work for someone who liked to watch porn?\n\nWould you be cool with a high school teacher who enjoys porn fantasizing about high school students? And yeah, if my boss announced that they like porn that depicts a manager coercing their subordinates I would be hesitant to be alone with them. \n\nIf the porn they publicly announced they watch involves a group of people who they have power over, then yes it is an issue. Looking at pictures of attractive people isn't a big deal. Even looking at pictures of HoT cOlLeGe GiRlS isn't even an issue. What is an issue is that a college professor, who has power and influence over college students, likes looking at HoT cOlLeGe GiRlS so much that he followed multiple accounts on a public profile. He could not resist being horny on main.",
              "author": "Tofu_tony",
              "created": 1637359736,
              "upvotes": 0,
              "replies": {
                "hlbthxl": {
                  "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlbthxl/",
                  "text": "You do know that just because men watch babysitter porn doesn't mean they're actually fucking the babysitter, right?\n\nhOt cOlLeGe GiRLs may be a lot of things, but legal is one of them, and sexually attractive to 99% of the straight male population is another. If you want to require of professors that they've never, ever had sexual thoughts about hOt cOlLeGe GiRLs then you're simply not going to have any straight or bisexual male faculty left, not to mention a significant chunk of lady profs gone too. And if you also kick out every student who's ever had an R-rated thought about their professors, you'll eventually end up with a university population of 0.",
                  "author": "trying_to_be_amelia",
                  "created": 1637368552,
                  "upvotes": 2,
                  "replies": {}
                },
                "hlbma26": {
                  "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlbma26/",
                  "text": ">Would you be cool with a high school teacher who enjoys porn fantasizing about high school students? \n\nNo, because that would be illegal - minors can't consent to participating in porn. Those are completely different and incomparable situations.\n\nWould I be cool with a high school teacher who enjoys porn in which younger, but still adult, performers dressed up like high school students and played out hot for teacher fantasies? Yes. Because again, I understand that there's not a perfect correlation between a person's personal sexual fantasies and what they would do in a professional setting. Would I work for a principal who admitted liking (or, more analogously, was accidentally discovered to like) \"hot for teacher\" type porn? Yes, as long as they were an otherwise respectful individual.\n\nPeople are jumping to *a lot* of conclusions that I don't think are supportable by any of the evidence. Again I say: Liking something in your personal life does not necessarily have a bearing on how you comport yourself in your professional life. So far the only sin this professor has committed is not locking down his Instagram.",
                  "author": "roseofjuly",
                  "created": 1637365370,
                  "upvotes": 1,
                  "replies": {
                    "hlbps24": {
                      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlbps24/",
                      "text": "Our tastes aren't compartmentalized. If a person is a highschool teacher and likes legal porn roleplaying as highschool students, or. Like this PI sexually liking college girls and being in a position of power over college girls. Is not making any assumptions. Not being outwardly unprofessional is not the same as actually having respect for the person.",
                      "author": "No-Reflection-2342",
                      "created": 1637366887,
                      "upvotes": -1,
                      "replies": {
                        "hlbrgrn": {
                          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlbrgrn/",
                          "text": ">Our tastes aren't compartmentalized\n\nOf course they are. It is entirely possible to have compartmentalized tastes. Do you perform all of your hobbies at your desk?",
                          "author": "roseofjuly",
                          "created": 1637367635,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hl9xlc5": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9xlc5/",
          "text": ">If you managed to find out what type of 'personal entertainment' everyone in the lab likes you would be equally creeped out by everyone in the room\"\n\nI have to disagree. There's a difference between having different types of things you enjoy or fetishes that may be out of the norm or off-putting to some people, versus fetishizing the very population of students you work with (or at least around half of them), and with whom you're in an institutionalized position of power and who are too frequently exploited by such relationships, all of which is even sort of normalized in our culture. And then add the layer of I'm someone considering cultivating a professional relationship with this person, yet I am part of that population who is being fetishized. And THEN consider that someone in this program warned you to check on this very problem you've now found. \n\nSure, some people might hide what they do for personal entertainment, and many may never act inappropriately as a result of their personal \"interests,\" but IMO if they are someone who can't or won't hide it, I would be concerned about the possibility that they could be the type who can't help but to act out on those interests or at the very least to make the people they fetishize very, very uncomfortable.\n\nAt the same time, I suppose this post speaks to how different people are willing to take different levels of risk, and who are willing to put up with different levels of objectification or insult, or are more or less comfortable with their ability to exit such a situation, which is all fair enough. \n\nI have just seen how frequently these problems really do come up and I've also seen how often and how significantly people struggle with getting out of toxic advising relationships (I mean, just scan through this sub). It's incredibly stressful and affects people's mental health. \n\nFor all these reasons, personally, it's not a risk I'd take, nor is it one that I would advise others to take. Not to mention, there are other many fantastic professors to work with in any field!",
          "author": "corgi5005",
          "created": 1637341600,
          "upvotes": 2,
          "replies": {
            "hla0wr2": {
              "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hla0wr2/",
              "text": "I should also add that also in my mind is how all too often there is really no recourse for students who are sexually assaulted or exploited by professors. Title IX processes are complex and very often do not help students, and too often, there is no real consequence for the prof, or the process is worse for the student than for the prof. Not saying this is \\*always\\* the case but it is not unusual by any means. (See, for instance, Sara Ahmed's *Complaint!*)",
              "author": "corgi5005",
              "created": 1637342902,
              "upvotes": 4,
              "replies": {}
            },
            "hl9zd22": {
              "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9zd22/",
              "text": "Thank you so much for your input! This is definitely a lot to think about, especially since this seems to be a  huge problem in academia, and especially since I don't want to feel like a helpless grad student who has to focus on unnecessary stressors in addition to the stress that comes with grad school itself!",
              "author": "Regular-Weird597",
              "created": 1637342292,
              "upvotes": 3,
              "replies": {}
            },
            "hlaott1": {
              "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlaott1/",
              "text": ">There's a difference between having different types of things you enjoy or fetishes that may be out of the norm or off-putting to some people, versus fetishizing the very population of students you work with (or at least around half of them), and with whom you're in an institutionalized position of power and who are too frequently exploited by such relationships, all of which is even sort of normalized in our culture.\n\nThis is...a very black-and-white understanding of sexuality.\n\nI used to be a sexuality researcher, and it's a very complex and multifaceted thing. For example, there are many women who have sexual fantasies about nonconsensual sexual behavior; none of those women *actually* want to be sexually assaulted. There are many people involved in BDSM or kink who would *never* want to do those things with partners who did not also enthusiastically want to in safe environments. \n\nKnowing that a person likes to look at pictures of attractive young women tells you nothing other than that they like to look at pictures of attractive young women, which probably makes up a significant proportion of the population, honestly. It's simplistic and unnecessarily paranoid to make the jump from \"likes to look at pictures of Girls Gone Wild\" to \"is probably fetishizing and exploiting the young women who take classes from him.\" And the idea that because someone didn't perfectly lock down their Instagram account they probably are a predator is *ludicrous*. For all you know he followed those accounts years ago and just forgot to unfollow them.",
              "author": "roseofjuly",
              "created": 1637351855,
              "upvotes": 3,
              "replies": {
                "hlb7okh": {
                  "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlb7okh/",
                  "text": "Even in this sub the person who can tout personal research experience in the exact area of discussion is downvoted. O what a world!!",
                  "author": "yourfavoritefaggot",
                  "created": 1637359238,
                  "upvotes": 4,
                  "replies": {}
                },
                "hlbpuzx": {
                  "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlbpuzx/",
                  "text": "No such thing as consent in the power structure of professor/college girl.",
                  "author": "No-Reflection-2342",
                  "created": 1637366924,
                  "upvotes": 1,
                  "replies": {
                    "hlbrqeg": {
                      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlbrqeg/",
                      "text": "...I'm failing to see how that is remotely relevant to my comment. We're talking about looking at pictures. There is zero evidence that this professor is involved with any college women.",
                      "author": "roseofjuly",
                      "created": 1637367755,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl9tdy7": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9tdy7/",
      "text": "I have a few thoughts, but FWIW I’m a man and have never been on the receiving end of this particular situation. \n\nI personally wouldn’t withdraw my application to a program unless there are very serious concerns that have made you 100% convinced you don’t want the position. If there is even a 1% chance that might take the position, keep your name in the hat. Then if you get accepted you can later decline if you’re still not convinced. It’s also a much safer quieter way to bow out, and you never know who you might need to do you a favor later. \n\nRegarding your material concerns that’s a lot thornier. On the one hand I feel for the profs position. I follow a number of pages myself which have a certain kind of content. Further what chaos might ensue if everyone’s incognito mode browsing history were made public. At some point there ought to be an allowance for people to be real and human and that includes having certain….*interests.* But it’s another thing to be the target of that kink. For some people it’s easy to separate the professional and the private. For others, and I’ve seen a lot of examples of this, they can’t at all separate the two and let the private bleed into work spaces. \n\nMy suggestion would be to seek out lab grad students, especially former female students, who have worked with this person. It’s not foolproof. Sometimes people arnt honest, sometimes one person doesn’t see that side but another does, and sometimes life experiences change how that stuff is expressed for better and worse. But in my experience grad students talk, and female grad students are usually not quiet about when someone has harassed or been aggressive to them. You hear that this person has said that or they *really* like this kind of person in a creepy way. That dirt gets around, and in ways that make me feel like it’s intentional. I myself have told female peers to watch out for certain problematic people. \n\nSo if you reach out you might hear back. You can even phrase it in a neutral way. “I’ve had bad experiences in the past and might be over concerned, what do you think about lab culture and what not.” Then see what they say. Could be nothing. Could be a red road flair. You just don’t know till you investigate. And until your more certain I would do something irreversible.",
      "author": "BeondTheGrave",
      "created": 1637339963,
      "upvotes": 10,
      "replies": {
        "hl9u56p": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9u56p/",
          "text": "TRULY appreciate your response and advice! I definitely want to investigate this more because this PI has very niche research interests that I am particularly interested in and have done research in BUT like you said, I do fall under the \"young college girl\" population which is what concerns me the most. However, this person has never worked with grad students until this year so that is also somewhat of a concern.",
          "author": "Regular-Weird597",
          "created": 1637340258,
          "upvotes": 3,
          "replies": {
            "hl9wc1b": {
              "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9wc1b/",
              "text": "Well it’s possible they just got funding. 40s does seem on the younger side, potentially they just got tenure recently and are now advancing in the lab itself. I would contact other women in the same lab personally. Ask them who they’ve had classes with, who they’ve worked with, what they think of Prof X. Keep it vague but not, you know? In these situations it’s so hard to know what could be smoke and what could be fire. Ultimately though you have to protect yourself. It’s a sad reality, but it’s the way of things. \n\nBest case would be to keep your options open and (here’s to hoping) get acceptance at multiple places so you have multiple choices.",
              "author": "BeondTheGrave",
              "created": 1637341112,
              "upvotes": 4,
              "replies": {
                "hl9ws05": {
                  "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9ws05/",
                  "text": "Thank you! Appreciate all your advice!",
                  "author": "Regular-Weird597",
                  "created": 1637341282,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hla0y5m": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hla0y5m/",
      "text": "Question: the grad student you spoke with- was she at the institution where this guy works? If so, I would imagine that she led you to this guy's Twitter as a way of telling you what he's like without having to actually tell you. If that's the case, it's a warning I would take seriously. \n\nIf not, I'm not sure what my advice is. I do agree with those who suggest not withdrawing your application, but instead waiting to figure out what to do once you're accepted when you're actually in a position to choose. Most people are into some kind of porn, and a lot of people are into porn that would make people uncomfortable if they knew about it, but it has no bearing on how they treat people in real life. If  his women students don't report issues with him or seem cagey about questions on that front, I'd be inclined to just write it off as cluelessness and stay vigilant about any behavior that makes me feel uncomfortable. If they do seem cagey or report anything inappropriate, or if you get an interview and his behavior makes you feel uncomfortable, I'd stay away.",
      "author": "loopsonflowers",
      "created": 1637342916,
      "upvotes": 3,
      "replies": {
        "hlagrb0": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlagrb0/",
          "text": "I echo this suggestion. There are ways to highlight red flags about people without being so explicit that you get essentially blacklisted from other opportunities, funding, etc.",
          "author": "Professional_Bar_481",
          "created": 1637348869,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hla1rsw": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hla1rsw/",
      "text": "That’s very concerning. A professor at my old institute shared his screen once with the class and had forgotten to close a tab for “busty college girls” on his browser. He “resigned” a few days later. It’s completely unacceptable for a university professor to be so indiscreet about his “fetishes” and I would consider it a massive red flag. Even if he never acts out on it, I personally would be very uncomfortable working for him. A phd advisor is a long term commitment. What happens if the first year he doesn’t act out but then something happens a couple years in? Then you’d need to sacrifice your research and start all over again in a different lab or just stomach it for the remainder of your PhD.",
      "author": "Nothing_Relevant88",
      "created": 1637343239,
      "upvotes": 3,
      "replies": {}
    },
    "hl9o8zd": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9o8zd/",
      "text": "I mean I can see having “adult” things in the likes/follows and I try not to yuck anyone’s yum, but the fact that it’s all centered around young college girls would definitely be a red flag for me.\n\nEdit: typo",
      "author": "Pleistoqueen",
      "created": 1637337917,
      "upvotes": 9,
      "replies": {}
    },
    "hl9mj1o": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9mj1o/",
      "text": "That’s really weird. Could you reach out to his current or previous advisees?",
      "author": "Buttholes3000",
      "created": 1637337227,
      "upvotes": 4,
      "replies": {
        "hl9sixy": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9sixy/",
          "text": "I've done a bit of research and he's never had any graduate students work with him before, this is the first time he is recruiting an MA/PHD student to work in his lab so I'm feeling a bit conflicted.",
          "author": "Regular-Weird597",
          "created": 1637339622,
          "upvotes": 2,
          "replies": {
            "hl9uwl6": {
              "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9uwl6/",
              "text": "With that history, I wouldn’t want to be his first",
              "author": "sheath2",
              "created": 1637340559,
              "upvotes": 5,
              "replies": {
                "hlb3trm": {
                  "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlb3trm/",
                  "text": "As someone who’s only been in academia for a few years and has already worked with several predatory psych professors, I would personally agree with this.",
                  "author": "Whoatoxicpillow",
                  "created": 1637357684,
                  "upvotes": 2,
                  "replies": {
                    "hlb55ga": {
                      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlb55ga/",
                      "text": "I’m in English but there’s at least one top scholar in my friend’s field who is so bad he’s not allowed to work with female grad students. They even warn each other about him at conferences. This guy’s social media is already throwing up those red flags.",
                      "author": "sheath2",
                      "created": 1637358218,
                      "upvotes": 2,
                      "replies": {
                        "hlb5wmj": {
                          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlb5wmj/",
                          "text": "I had almost the exact same experience except my boss, who hired him, is the one that warned me. And while he wasn’t allowed to have grad students anymore, guess who still worked with undergrads and invites them over to his house for brunch?",
                          "author": "Whoatoxicpillow",
                          "created": 1637358523,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl9eaoy": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9eaoy/",
      "text": "Stay away! My advisor sexually harassed me the whole time I was dissertating. I wish I’d had information like this beforehand. Choose another lab or another program",
      "author": "Distinct_Armadillo",
      "created": 1637333784,
      "upvotes": 9,
      "replies": {}
    },
    "hl9dtns": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9dtns/",
      "text": "I would absolutely NOT work with him. Are there other profs who you would want to work with at that school?",
      "author": "corgi5005",
      "created": 1637333577,
      "upvotes": 9,
      "replies": {
        "hl9h3we": {
          "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hl9h3we/",
          "text": "There are definitely other professors that I'd like to work with at this program (very good program in general!) but they weren't recruiting for this cycle.",
          "author": "Regular-Weird597",
          "created": 1637334997,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlc61bz": {
      "link": "/r/AskAcademia/comments/qxhnxx/creepyproblematic_psyc_phd_supervisor/hlc61bz/",
      "text": "Definite red flag. It’s not so much that he likes to look at sexual imagery of young (but legal adult) women, but more bc the accounts he liked are so specific to the population he has power over. To add another layer, I would be less concerned if it was a private account but to have that be attached to his account set as public display is either gross behavior where he wants others to see it and is fine w it being attached to his professional self or shows that he has a disturbing lack of self awareness. \n\nI agree w others who say to proceed w caution. I have a male advisor and a female co-advisor. My male advisor has never been anything but supportive and awesome but when I first started I’d heard some horror stories from friends in other departments about legendary creeps in their fields so having a co-advisor allowed me to be more immediately trusting since I had another person that I could go to if there ever was an issue.",
      "author": "Single_Broccoli_745",
      "created": 1637374339,
      "upvotes": 2,
      "replies": {}
    }
  }
}