{
  "sid": "ahtuxc",
  "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/",
  "title:": "Everything is ruined. Advice needed.",
  "text": "Fifth year Ph.D. student in physics. Got through my quals, my candidacy, and I'm supposed to defend this semester. The problem?\n\nI published a paper last year. Got a result that I (and my collaborators) thought was good. Now, a whole bunch of new data just got released and it completely trashes the procedure I used in my paper and that I was using for my next paper. These two papers plus a third I'm second author on were going to be the bulk of my thesis.\n\nI'm really freaking out now. I can't write a thesis with a bad procedure, and I can't publish bad science. I have no idea what I'm going to do. Two weeks ago I was at a conference feeling good, and now the rug's been totally yanked out from under me.\n\nI have no idea what to do. My advisor seems less freaked out than I am, but not happy, and I'm seriously terrified that everything will fall apart yards from the finish line.\n\nWhat the fuck do I do now?",
  "author": "phd_throwaway_677",
  "created": 1547955802,
  "updated": 1634081396,
  "over_18": false,
  "upvotes": 127,
  "upvote_ratio": 0.98,
  "comments": {
    "eeirdoi": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eeirdoi/",
      "text": "A PhD is ultimately about gaining & demonstrating research qualifications, not about getting a gold star for having the World's Best Results.  If you've done things properly, published things that the field thought were publishable, developed new skills, and continue to act like a professional about it, there's no reason you shouldn't get your degree.  \n\n> I'm really freaking out now.  I can't write a thesis with a bad procedure \n\nCalm down - of course you can.  You can write up what you did, critically evaluate it, and put it in context with this new work.  You can brainstorm a small side project or reanalysis or something that will help you find some strengths in your approach, or quantify the errors from it, or build upon this new data with something unique that you have.  \n\nMost PhD theses don't change the world.  Many get proven wrong, or end up being kind of pointless, or are sloppy.  Negative results and intermediate procedures that get improved upon are one of the foundations of scientific progress.  C'est la vie.",
      "author": "polyphonal",
      "created": 1547981263,
      "upvotes": 391,
      "replies": {
        "eeitpi6": {
          "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eeitpi6/",
          "text": "This is such a great response! 🙌",
          "author": null,
          "created": 1547983723,
          "upvotes": 61,
          "replies": {}
        },
        "eej0v52": {
          "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eej0v52/",
          "text": "This is a great answer. Science progresses both by knowing what works, but just as important are the 99 other ways that don’t — and moreover understanding why they don’t. One thing I’d add is that it seems to me as though for better or worse, your thesis is probably one of the few avenues for publishing negative results, so although it’s difficult right now, perhaps try to take this as a good opportunity to do so.",
          "author": "keyskin",
          "created": 1547989846,
          "upvotes": 45,
          "replies": {
            "eejkjat": {
              "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eejkjat/",
              "text": "Yes, research is risky business. \n\nWell-formed negative results advance knowledge, too (even if journals rarely publish such). Love the responses here. ",
              "author": "needaburneracct",
              "created": 1548001899,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "eej6gpb": {
          "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eej6gpb/",
          "text": "> Negative results and intermediate procedures that get improved upon are one of the foundations of scientific progress. C'est la vie.\n\n+10000\n",
          "author": "lalochezia1",
          "created": 1547993383,
          "upvotes": 34,
          "replies": {}
        },
        "eej9khg": {
          "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eej9khg/",
          "text": "Ironically, this is also an example of the scientific method working properly. OP, you should be enthusiastic about the results, welcome them, and simply incorporate it and go forward -- that's literally how the process (purportedly) works.\n\n(And as a footnote, perhaps study some Thomas Kuhn and philosophy of science.)",
          "author": "Theomancer",
          "created": 1547995428,
          "upvotes": 22,
          "replies": {
            "eejm2br": {
              "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eejm2br/",
              "text": "theres really only one answer to all of this\n\n[IASIP](https://www.google.com/amp/s/amp.reddit.com/r/IASIP/comments/7qpuo5/this_scene_from_its_always_sunny_in_philadelphia/) ",
              "author": "Marcoarego",
              "created": 1548002758,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "eei1lkd": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eei1lkd/",
      "text": "I was listening to some vlogs by tara brabezon about how not to fail a PhD. She commented on how it was important not to sweep mistakes or dodgy data under the rug. She said some of the best theses she's read were mostly a documentation on how not to go about doing x-kind of research. \n\nIf you feel your procedure isn't as sturdy as you once thought, could you write about what went wrong and why you shouldn't use the methods you used? Maybe some recommendations of what you would do instead on reflection?",
      "author": "planetniffer",
      "created": 1547957135,
      "upvotes": 86,
      "replies": {
        "eeinr80": {
          "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eeinr80/",
          "text": "> If you feel your procedure isn't as sturdy as you once thought, could you write about what went wrong and why you shouldn't use the methods you used? Maybe some recommendations of what you would do instead on reflection?\n\nThis is the correct answer. Next publication, explain what went wrong and why. Next explain how, being the consummate professional you are, you are going to address the issue to move forward. \n\nYou = land on your feet and show you can roll with the punches. ",
          "author": "SparkyMcGhee",
          "created": 1547977901,
          "upvotes": 47,
          "replies": {}
        }
      }
    },
    "eei1fe3": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eei1fe3/",
      "text": "You've gotta talk to your advisor about this.",
      "author": "ProbabilisticWorld",
      "created": 1547957015,
      "upvotes": 65,
      "replies": {}
    },
    "eei1ze4": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eei1ze4/",
      "text": "Talk to your advisor.  Work out a plan.  It may involve work, but -- this is science.  The whole point is that you do work, it gets published, then others refine (or refute) that work and repeat.  Perhaps there are some more experiments which can do which confirm your results?  Or other ways of looking at your data?  Hard to say without knowing your area intimately.  Fortunately, your advisor does -- so the two of you can work this out.\n\nIt's Saturday night.  Go grab a beer (not too many...) with your grad student friends and vent.  It sucks right now, but you've got this.\n\nThe bright side?  When you do figure out the right solution and implement it, you'll have a great story.  A great story of how you hit a really hard problem, and solved it.  That kind of story is \\*great\\* for job interviews, as it shows your ability to Get Stuff Done.",
      "author": "colohan",
      "created": 1547957417,
      "upvotes": 46,
      "replies": {}
    },
    "eejm3vq": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eejm3vq/",
      "text": "Hey, there was a dark alley, hard to get into, full of perils. You went there, discovered that there's nothing there, and there's no point for anybody else to go down this alley. So you came back and wrote it on a post near the entrance, with good photos and full documentation. Like \"it looks interesting, but actually it's a dead-end. Don't go there\".\n\nThis is incredibly useful. It may not feel as glorious as discovering a forgotten temple or a hoard of gold, but it is still incredibly valuable for the community. Arguably, in many cases, more valuable, as we came to learn over the years that most claims of golden piles are greatly exaggerated.\n\nWell done, OP, and good luck with writing your thesis!",
      "author": "ampanmdagaba",
      "created": 1548002783,
      "upvotes": 8,
      "replies": {}
    },
    "eej007n": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eej007n/",
      "text": "If you can write intelligently and clearly about why the procedure you used was bad, then that is good. Might not get a published paper out of it, but I still consider it a contribution to knowledge. Other people might try double what you did and you can explain why the method is no good. That is worth knowing too, even if it isn’t a “result.”",
      "author": "TakeOffYourMask",
      "created": 1547989204,
      "upvotes": 3,
      "replies": {}
    },
    "eej4yeq": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eej4yeq/",
      "text": "There are much better answers by others, but one thing I keep reminding my undergrads is that the only time you've failed is if you didn't learn from the project. Learn from what went wrong and write your dissertation on that. It can still be a success. ",
      "author": "davesoverhere",
      "created": 1547992424,
      "upvotes": 2,
      "replies": {}
    },
    "eej2798": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eej2798/",
      "text": "The biggest thing you can do is discuss with your advisor. If there are problems with your procedure surely you can publish another paper comparing your previous results to a those from using a different procedure. \n\nIs your group the only one that used the flawed procedure?",
      "author": "c0smic_0wl",
      "created": 1547990787,
      "upvotes": 1,
      "replies": {}
    },
    "eeji6yc": {
      "link": "/r/AskAcademia/comments/ahtuxc/everything_is_ruined_advice_needed/eeji6yc/",
      "text": "This is ultimately a question for your advisor and committee, no?  I really doubt that they're going to say \"No, you need to stay another 3 years to get a proper thesis done\", but only they know what it actually takes to graduate.",
      "author": "Mezmorizor",
      "created": 1548000570,
      "upvotes": 1,
      "replies": {}
    }
  }
}