{
  "sid": "qbzpp1",
  "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/",
  "title:": "Improve women ratio in senior positions in STEM",
  "text": "How can Universities/departments improve the women ratio in permanent and senior positions in STEM?",
  "author": "NerdGrad",
  "created": 1634732956,
  "updated": 1634750161,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.61,
  "comments": {
    "hhcwzs4": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhcwzs4/",
      "text": "I have seen several women leaving STEM faculty positions soon after having a baby. I'd suggest massively increase funding for maternity / parental leave and child care. I'd also suggest intense self-reflection on remaining faculty members to have a real post-mortem discussion on how to better support them.",
      "author": "BananasonThebrain",
      "created": 1634736188,
      "upvotes": 18,
      "replies": {
        "hhd1tem": {
          "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhd1tem/",
          "text": "I think it needs more than that. It needs shared parental leave, encouragement of men to take up parental leave (because women will only stop being discriminated against when the \"risk\" of going on leave is the same regardless of who you hire) and you need to review all your policies to ensure that women aren't disadvantaged by having been on leave.",
          "author": "ACatGod",
          "created": 1634738401,
          "upvotes": 7,
          "replies": {
            "hhd5yh0": {
              "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhd5yh0/",
              "text": "Oh absolutely, and also to make sure stopping the tenure clock doesn’t mean stopping pay increases.",
              "author": "BananasonThebrain",
              "created": 1634740271,
              "upvotes": 5,
              "replies": {
                "hhdarni": {
                  "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhdarni/",
                  "text": "Hard agree. There's so many subtle things that happen when anyone takes extended leave but the general attitude is \"well if we extend the promotion window, that's all cool\". But that leaves women constantly chasing a gender pay gap, and doesn't address any of the issues like maintaining a lab while you're on leave, grant management, restarting paused work, the discrimination women face for being pregnant or going on leave, and so much more. Thing is making these things better is better for men too. \n\nWhen the Chemistry Dept at the University of York made a policy that when anyone went part time they would be able to return to a full time post if they chose (or something along those lines) suddenly a load of men requested to go part time seemingly to allow them to deal with personal life stuff knowing they could return to full time. How good is that for everyone? The benefits are enormous.",
                  "author": "ACatGod",
                  "created": 1634742287,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hhdq7il": {
              "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhdq7il/",
              "text": "Something like half of Americans are childless or unpartnered now. Women without children have careers comparable to men. There's no way to accommodate women with children without penalizing the childless, which is politically untenable.",
              "author": "nevernotdating",
              "created": 1634748477,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hhdgcwz": {
          "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhdgcwz/",
          "text": "I'll tell you a short story. \n\nI'm my first year as a PhD student, I was attending a meeting with a bunch of collaborators, a pretty large meeting (>60 people) including a lot of faculty, postdocs, all ivy league unis and big names. At the beginning of the meeting, the most senior PI asked when another faculty member is coming back saying \"she gave birth almost 6 weeks ago, she should be back already\". All the other PIs agreed that she should be at work already after \"all that vacation time\".\n\nThis is the message that these people sent to everyone on the call. People from which no doubt a lot of faculty will be selected, and many of whom mentor women in academia. Being a woman in academia is a liability.",
          "author": "ThisIsSpata",
          "created": 1634744573,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hhcsbi6": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhcsbi6/",
      "text": "Admit more women at junior levels.\n\nWait.",
      "author": "Spambot0",
      "created": 1634733811,
      "upvotes": 20,
      "replies": {}
    },
    "hhcr23h": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhcr23h/",
      "text": "Hire more women.",
      "author": "crkrshx",
      "created": 1634733131,
      "upvotes": 12,
      "replies": {}
    },
    "hhcsyvy": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhcsyvy/",
      "text": "Make professional advancement gender neutral when it comes to child care in the early years.",
      "author": "molobodd",
      "created": 1634734159,
      "upvotes": 8,
      "replies": {}
    },
    "hhdixp1": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhdixp1/",
      "text": "We’re on the right track imo. These things just take time. Remember that most people in permanent and senior positions did their training decades ago when hiring practices were sexist. Now, it’s far less so, but it’ll take time for the people that did their training decades ago to retire and open up positions women.",
      "author": "WhoCaresWhyBother",
      "created": 1634745612,
      "upvotes": 2,
      "replies": {}
    },
    "hhdnp9n": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhdnp9n/",
      "text": "Reduce the number of temporary positions in favour of permanent ones.",
      "author": "Hapankaali",
      "created": 1634747500,
      "upvotes": 2,
      "replies": {}
    },
    "hhd0q1t": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhd0q1t/",
      "text": "By doing a lot of work to understand the experiences of women already in the department and look to remedy their problems, then getting men on board with diversity intiitatives so that women aren't responsible for making the place better, and also looking at all your processes  hiring and promotion and look at how you can make them more attractive to women - state the salary, shared parental leave, active initiatives that directly drive change,  how do you accommodate parental leave into your faculty reviews (doing this for men is as important as for women). \n\nLook at how much space women are given compared to men, how much community service they are doing compared to men, how students are rating their teaching with an eye out overt and subtle gender bias, how long it's taking women to reach promotion compared to men, and talk to them about their experiences dealing with adminstration, publishing, students and committees, because women spend a lot of time having to deal with tiny incidences of misogyny and gender bias and it becomes death by a thousand cuts. I recently was in a meeting where a point I made (as chair!) was attributed to 5 different men by the other men in the room. It's exhausting and they came out thinking I didn't contribute anything. \n\nIf you're asking at the point of recruitment how to get more women to apply, it's too late. You need to lay a lot of groundwork first. \n\nYou need to bring in a specialist in equality and diversity but they also need to be someone who knows about change management. One of my unpopular opinions is there are far too many (mostly) women who have felt forced out of their academic career and gone into EDI careers but while they are passionate they have none of the skills required to change an organisation and the result is a lot of talking and no action. \n\nA good place to start is watching Picture A Scientist on Netflix. It'll give you an indication of the problems and also how some people have instrumentally driven change to the benefit of everyone in their organisations (or nearly everyone. The old boys who kept it a closed shop don't love the change).\n\nThis of course also applies to BIPOC and you must do the work there as well.",
      "author": "ACatGod",
      "created": 1634737907,
      "upvotes": 2,
      "replies": {}
    },
    "hhctclo": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhctclo/",
      "text": "Why should they? Isn't that kind of position supposed to be merit based, regardless of your gender?",
      "author": "ddeeppiixx",
      "created": 1634734360,
      "upvotes": -6,
      "replies": {
        "hhctli5": {
          "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhctli5/",
          "text": "It is merit-based, I think it is simply being aware of our biases in such situations since we are not used to seeing women in such senior positions - which is changing thankfully.",
          "author": "NerdGrad",
          "created": 1634734492,
          "upvotes": 9,
          "replies": {}
        },
        "hhcwl07": {
          "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhcwl07/",
          "text": "So if the full professor ratio is highly skewed towards males, it is because women as a group are less smart?",
          "author": "molobodd",
          "created": 1634735990,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hhdfk9m": {
      "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhdfk9m/",
      "text": "The biggest cause IMO is that women choose other fields of study. There are more female students at universities now overall and still much more males in STEM.\n\nIf we want to change that, we have to start at lower levels of education. Get girls in primary and secondary education interested in STEM fields and encourage them to follow that career path.",
      "author": "gebregl",
      "created": 1634744252,
      "upvotes": 0,
      "replies": {
        "hhdqe8z": {
          "link": "/r/AskAcademia/comments/qbzpp1/improve_women_ratio_in_senior_positions_in_stem/hhdqe8z/",
          "text": "How do you explain biology biochemistry and molecular biology then with approx 50% female PhD students and only 15-20% female lab heads? \n\nhttps://news.mit.edu/2014/research-reveals-gender-gap-nations-biology-labs-0630\n\nhttps://www.mpimp-golm.mpg.de/2213684/statistik\n\nEdit: to be honest I’ve become very disillusioned about encouraging more girls into science.",
          "author": "PristineAnt9",
          "created": 1634748551,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}