{
  "sid": "r01t24",
  "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/",
  "title:": "ADHD Student that has miserably dropped the ball needing advice... Please help",
  "text": "So this semester has been beyond my hardest. From transferring to a new school, taking the most hours I have ever taken, to just feeling isolated, switching meds, my cracks really started to show\n\nOne class I am in is a Tues & Thurs class. Tuesday we write 2-3 sentences on what we read; Thursday a quiz short essay question.\n\nHaving ADHD, taking this in class is extremely difficult given that there are numerous distractions and I need more time.\n\nThrough the DRC on campus, I'm granted extra time and a distraction reduced enviorment. But when I went to my professor, he said, \"I send the questions at least a day prior to the quiz, why can't you do the quiz before class, copy, and paste your answer with the rest of us.\"\n\nI thought this was a really good idea, and I wanted to show that I am capable. Then I forgot. I barely keep up to begin with. How am I suppose to add more to my plate in a class where there is already so much responsibility? You're literaly telling the kid with ADHD:\n\n*oh, you have problems with executive function? Oh you have accomidations to help you? Well, let's do this to accommodate you instead of what the DRC says and give you more to do than the rest of the class... because my idea is more accommedating...*\n\nbut at the end of the day... i know it is my fault.\n\nI should have been my own advocate and said, \"no, I need my accommodations to be honored.\" but then, every class I would stick out like a sore thumb. Having to leave the classroom and then return late would be humiliating every class. In-fact, I tried this. but couldn't find a quite place and did even worse, and returned to my seat with stigma louder than I could bare.\n\nI'm terrified to talk to my professor... it is my fault... im the one with adhd, and i failed to speak up.\n\nI have missed 4 quizzes, and I just want to be able to have the chance to do them with my accommodations. I stopped going to the class because of how it all made me feel.\n\nin the student rule, it says i can go to the dean and ask for an exception... *stigma gets louder*\n\nbut maybe I should email my professor all of this first and ask what he can do? *stigma stays loud*\n\nim just lost, depressed, and isolated...",
  "author": "ggfien",
  "created": 1637632036,
  "updated": 1637688567,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.61,
  "comments": {
    "hlpvqkf": {
      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlpvqkf/",
      "text": "As a professor, I would want to help my students—especially those who contact me. I’d suggest to email your professor and be 100% up front. Let them know you want to do the work but you are getting in your own way. Ask for advice. Stated that one suggestion seemed like it would work but you realized it’s not. \n\nI agree with talking to the office that handles these accommodations. They often have support students aren’t aware of. And, maybe ask them to be a mediator with you and your professor. \n\nHang in there. As a prof, I’m always rooting for my struggling students. Always.",
      "author": "One-Armed-Krycek",
      "created": 1637633926,
      "upvotes": 11,
      "replies": {
        "hlpxjf3": {
          "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlpxjf3/",
          "text": "Thanks for the encouragement, can I message you my email to him to see if it is appropriate?",
          "author": "ggfien",
          "created": 1637634774,
          "upvotes": 2,
          "replies": {}
        },
        "hlrb3m2": {
          "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlrb3m2/",
          "text": ">Hang in there. As a prof, I’m always rooting for my struggling students. Always.\n\nYou’re making the world a better place. Thank you.",
          "author": "Muserallusion",
          "created": 1637668631,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlpukj5": {
      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlpukj5/",
      "text": "If you are in the USA, talk to the office that manages your accommodations. They handle this kind of thing. (Unfortunately, it happens a lot). It isn't too late to get this situation resolved. Your professor will get a firm reminder that the ADA isn't optional. (And don't feel guilty about it! )",
      "author": "Quant_Liz_Lemon",
      "created": 1637633377,
      "upvotes": 4,
      "replies": {
        "hlpyayh": {
          "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlpyayh/",
          "text": "I am in the USA, and the disability advisor that helps me is an absolute rockstar! but, I really want to try to not make a big deal of this and keep it between my professor and I",
          "author": "ggfien",
          "created": 1637635134,
          "upvotes": 2,
          "replies": {
            "hlrk72g": {
              "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlrk72g/",
              "text": "Using the resources that are available to you isn’t making a big deal. It’s putting you on a more level playing field with other students. It’s ok that this is a little too much for you right now. To paraphrase a long-running joke with my diabetic friends, “if you can’t make your own executive function, store-bought is fine.”",
              "author": "Arderis1",
              "created": 1637674236,
              "upvotes": 2,
              "replies": {}
            },
            "hlrk3ke": {
              "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlrk3ke/",
              "text": "Instructor here. Can you find a way to loop in the office *not* because you are making a big deal but so the three of you can work it out together? Start by asking the prof in: if the two of you can talk with the office about a different accommodation that will help you succeed.\n\nI say this because the prof really may not understand ADHD or the nature of your accommodations: instructors and profs are not given teaching training the way grade school teachers are, even just about standard pedagogy, let alone about ADA, universal design, stigma, or any of that.\n\nIt doesn’t have to be a *big deal* per se, and the prof can learn in the process too!",
              "author": "schilke30",
              "created": 1637674184,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlqbl56": {
      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlqbl56/",
      "text": "Hey OP. I have ADHD too, and it plagued me in an oh so similar way on my first attempt at college. I'm in my 30s now and am doing just fine, as one day you will be too.\n\nFirst and foremost, remind yourself to be kind to yourself. Often times our anxiety and depression can make us forget that we are trying our best and that it's okay to take small steps at first. But never forget that you are valid and deserve kindness and compassion.\n\nSecond, understand that it's okay to reach out to anyone in your life, explain your situation, and ask for help. I can't tell you how many times my anxiety morphed simple tasks like emailing a boss/professor into these impossible situations in my mind. It takes strength to ask for help, and even if you don't get it you will ultimately feel better after trying.\n\nLast and most important of all, know that you're not alone. If you ever need to talk, message me anytime. I've made enough mistakes for several lifetimes and can at least tell you what not to do. If you have supportive family, I highly recommend getting them involved. If not, consider me your anxiety-ridden older brother. Best of luck out there, kid. Drink some water, get 8 hours of sleep, eat 3 meals a day, and get some sunshine. It helps more than you might think.",
      "author": "sardonicsuds",
      "created": 1637641727,
      "upvotes": 3,
      "replies": {
        "hlqc4d2": {
          "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlqc4d2/",
          "text": "That is so kind of you. Thank you so much for the encouragement. I actually emailed my professor with the help of another reddit user that commented and I'm feeling good about how I handled the situation.",
          "author": "ggfien",
          "created": 1637642019,
          "upvotes": 4,
          "replies": {
            "hlqcj8t": {
              "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlqcj8t/",
              "text": "You're welcome! Glad you're getting sound advice and moving in the right direction.",
              "author": "sardonicsuds",
              "created": 1637642246,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hlq9xt0": {
      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlq9xt0/",
      "text": "I’m a little confused on what you’re wanting. Do you want the extra time accommodations or not? It sounds like you do but then you list why you don’t (stigma as you leave the class). If you don’t, it sounds like his suggestion to prep the answers first before class was good. I mean I know you forgot once but why not try again? Keep a note and keep trying till you remember? If you strongly believe that won’t help, then you’re going to have to tolerate the feelings you get when the extra time accommodation is given. \nOn a side note, I have struggled with ADHD my whole life and it has been a struggle so I empathize. Unfortunately, I didn’t get officially diagnosed till later in life and went through college unmedicated and without any ADA accommodations. Although it made school much harder, I appreciated this because I sought out CBT which helped me develop strategies to combat it without meds or extra time. Now in combination with my meds, I feel I am almost at par or at least as successful/effective as my non-ADD peers. I have learned very successful strategies for focus, organization and effectiveness that I think are even better than the meds alone. Very useful as once you graduate, these accommodations cease to exist and the best you can hope for is an understanding and patient boss. My last tip is to only put as much on your plate as you can handle. Maybe drop a class or take less credits, talk to the office to see if it’s possible to get full time status for fewer credits if this is important to you for other reasons. I did not graduate in four years, although I had taken full time credits, I did the bare minimum to keep my head above water as best as possible.",
      "author": "Nothing_Relevant88",
      "created": 1637640829,
      "upvotes": 1,
      "replies": {
        "hlqal1o": {
          "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlqal1o/",
          "text": "\"try till you remember\" \"i went through college without accommodations\" \"I sought out CBT *instead of meds*\" \"i learned strategies for focus and organizations\"\n\nhi stigma!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
          "author": "ggfien",
          "created": 1637641178,
          "upvotes": -2,
          "replies": {
            "hlqer0b": {
              "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlqer0b/",
              "text": "I’m stigmatizing against a condition I have myself? I never said instead of meds, I said in addition to meds, these strategies can be helpful. Yes, I know “try to remember”, “try to get organized” etc can be annoying to hear when you are trying and your brain doesn’t work that way but it sounds like you’re just giving up. You doubt that self training can help? It took me 10 years to make a deadline on time. 10 years of feeling like a failure, 10 years of killing myself to try and get it done and it still not being done. But I don’t regret a single failure, or a single late paper or a single attempt because every time I got faster and better and yeah sometimes I still failed (forgot when it was due, just didn’t make it in time, etc) but every time I got better. Why that offends you so much that you would reply with such an incredibly rude and childish response I don’t know but I don’t believe I deserved it. I’m sorry if it sounded like a broken record or invalidation of what you’ve gone through but don’t invalidate mine either. I gave a tip of something that has helped me enormously and not only got me through undergrad, but through my PhD and post-doc. Spit in my face if it makes you feel better. I hope you find a solution to your problem.",
              "author": "Nothing_Relevant88",
              "created": 1637643533,
              "upvotes": 6,
              "replies": {
                "hlrkujz": {
                  "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlrkujz/",
                  "text": "One can certainly carry stigma against conditions they themselves experience. It’s internalized ableism, similar to internalized misogyny.\n\n(I am not claiming this is what you are doing, but just to point out that this can absolutely be a thing.)",
                  "author": "schilke30",
                  "created": 1637674584,
                  "upvotes": 2,
                  "replies": {
                    "hlsa23t": {
                      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlsa23t/",
                      "text": "Valid point. It does sound a bit like OP is though. Where any mention of therapy or obtaining ADA accommodations publicly is reinforcing a stigma they have created for themselves in their mind? Therapy has been proven effective for improving the symptoms of ADHD so I can’t imagine why anyone would reject it quite so hard if it wasn’t for fear of stigma (albeit self-imposed). \n\nEdit: I don’t mean to imply they have created stigma where it doesn’t exist as it does exist but that they may be hyper focused on the stigma versus getting the help that they need.",
                      "author": "Nothing_Relevant88",
                      "created": 1637685676,
                      "upvotes": 2,
                      "replies": {
                        "hlsemgz": {
                          "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlsemgz/",
                          "text": "The stigma however, is not only in their mind. It’s a result of living in a world where asking for help—in the form of therapy or drugs, for example, or the social safety net or charity—can often be deemed suspect or a liability, because “normal” people don’t need it. And while we here can all say out loud that it doesn’t penalize, that it doesn’t make one less than, that doesn’t negate all the voices and actions out there that *do* reinforce this, whether out loud or by their actions.\n\nThat doesn’t mean that I think your advice here isn’t potentially helpful—I don’t live with this disability so do not claim to know it—but we all need to try to understand where we are all coming from. Maybe OP has had a lot of pushback in their life, or different pushback than you have experienced. I think it is great that you shared your experience, and OP is maybe coming from a different place.\n\nETA: I am directly responding to the idea that the stigma may be self imposed, when that is highly presumptive. You have no idea what pushback OP may be experiencing. And I think OP was trying to point out that sometimes language—even when delivered in a spirit of accommodation—can hedge on stigmatizing. Language itself can be truly debilitating, just like normative academic structures and expectations, to which OP is evidently feeling some chafing to try to conform to, and which do not apparently feel remediated by the options generally available here.\n\nI also recognize here that I am going on for far too long when I have the sense you and I are quite allied in this. 🙌🏻 Thanks for engaging with me on this, too.",
                          "author": "schilke30",
                          "created": 1637687450,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlrr5r6": {
      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlrr5r6/",
      "text": "I have had meetings at the DIC  Office with a student and their advocate. I didn’t mind at all because I knew the student was using their means to address a problem and that they had engaged with their support system.\n\nI was also able to discuss and ask questions about how to actually make accommodations that work.\n\nRemember that most professors want students to learn the material, succeed at it, and find it as fascinating as they do.\n\nSo go to your DIC and ask them to set up a meeting for you with the instructor.",
      "author": "zastrozzischild",
      "created": 1637677722,
      "upvotes": 1,
      "replies": {}
    },
    "hlrukxe": {
      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlrukxe/",
      "text": "Hey i dont know if you i know but there’s a page for ppl with adhd, you’ll have lot more help here \nr/adhd",
      "author": "ChipsCreamOnion",
      "created": 1637679255,
      "upvotes": 1,
      "replies": {}
    },
    "hlqhdaj": {
      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hlqhdaj/",
      "text": "Extra time on its own is often unhelpful unfortunately (unless there is sufficient panic - maybe that’s just me!)\n\nCould you get an accommodation enabling you to give shorter answers/bullet points (for the short essay) and/or fewer questions to answer (for the quiz)? \n\nAlthough it’s aimed at accommodations in the context of employment you might find some possibilities from this site: [JAN accommodations](https://askjan.org/disabilities/Attention-Deficit-Hyperactivity-Disorder-AD-HD.cfm?) that you could suggest to your professor - they might find the site useful to share with other students too",
      "author": "mockery_101",
      "created": 1637645108,
      "upvotes": 0,
      "replies": {}
    },
    "hls4ea2": {
      "link": "/r/AskAcademia/comments/r01t24/adhd_student_that_has_miserably_dropped_the_ball/hls4ea2/",
      "text": "What a bitch can't even do short sentences 😂cry more",
      "author": "honeybadgeronreddit",
      "created": 1637683384,
      "upvotes": 0,
      "replies": {}
    }
  }
}