{
  "sid": "gfp87y",
  "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/",
  "title:": "Do you find that many people in academia have \"tunnel vision\" where they are excessively preoccupied with their field of study and that critical thinking doesn't transfer to other domains?",
  "text": "It would appear at first glance that the skills of reading a technical paper and logically critiquing it would generalize to thinking rationally in other areas of life as well. However, I've increasingly seen that many professors are often able to be brilliant in their own field, while having silly opinions in real life, apparently without experiencing much cognitive dissonance (of course, this is a generalization...). The kinds of arguments that they advance for their opinions in real life would get them laughed out of the park if they were applied to their own field of scientific inquiry. I have a strong suspicion that academia self-selects for those people who are highly intelligent but have \"tunnel vision\" in the sense of having singular interests (or very narrow interests) and are rather conformist in their beliefs otherwise.\n\nIs it just me? What has been your experience? Have you felt the same way?\n\n(For my background: I'm a STEM masters student, and this came up quite often in a group consisting of masters and PhD students.)",
  "author": "nazgul_123",
  "created": 1588926378,
  "updated": 1634080316,
  "over_18": false,
  "upvotes": 281,
  "upvote_ratio": 0.96,
  "comments": {
    "fpvaw5o": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvaw5o/",
      "text": "[Relevant comic.](https://www.smbc-comics.com/comic/2012-03-21)",
      "author": "Pyrogenesis",
      "created": 1588940360,
      "upvotes": 83,
      "replies": {}
    },
    "fpv2q1v": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpv2q1v/",
      "text": "Honestly, that hasn’t been my experience at all.  I find that the same critical thinking skills my colleagues have tend to transfer to other arenas outside of our tiny speciality areas.  \n\nOf course some academic folks have some views that are “out there” or seem ridiculous.  But that occurs across all populations.  \n\nFor example:  I’m a criminologist.  Everybody has opinions about crime (and most are wrong).  When I speak with other academics about issues related to crime, nearly all the time, they get it.  Or, at the very least, they are able to view the issue from angles outside of their own opinion.  But when I talk about it among non-academics, I find that many people can’t get past their own views to analytically think about the topic.",
      "author": "tmodoc",
      "created": 1588932758,
      "upvotes": 130,
      "replies": {
        "fpv8wfj": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpv8wfj/",
          "text": ">Everybody has opinions about crime (and most are wrong)\n\nNeuro/pharm here. I relate to this way too much. No Janice, that guava extract won't unlock your third eye.",
          "author": "FrenchLlamas",
          "created": 1588938737,
          "upvotes": 82,
          "replies": {
            "fpvywrr": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvywrr/",
              "text": "My PhD is in public health. I'm going nuts right now.",
              "author": "roseofjuly",
              "created": 1588954313,
              "upvotes": 31,
              "replies": {
                "fpvz5l3": {
                  "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvz5l3/",
                  "text": "You want to pop an aneurysm? [This article has been making the rounds](https://summit.news/2020/05/05/south-african-data-analysts-lockdown-will-lead-to-29-times-more-deaths-than-coronavirus/). Granted it is from an extreme right conspiracy website akin to infowars but I've seen it shared around a bit.",
                  "author": "FrenchLlamas",
                  "created": 1588954437,
                  "upvotes": 7,
                  "replies": {
                    "fpyhd5c": {
                      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpyhd5c/",
                      "text": "noooooooooo",
                      "author": "roseofjuly",
                      "created": 1589003894,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fpvld3q": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvld3q/",
          "text": "I agree. It is my experience that the large majority of people with PhDs I know (a group that skews heavily--but not exclusively--to the humanities, especially art history, history, and various literatures) are sharp critical thinkers across a broad range of subjects.",
          "author": "pipkin42",
          "created": 1588947107,
          "upvotes": 27,
          "replies": {}
        },
        "fpvnptf": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvnptf/",
          "text": "I second this. And I think we need to correct for our expectations as well. Everyone is going to have a more instinctive or emotional response to some things, no one is completely analytical about everything, we are not robots. However, when someone who does think more analytically about a subject encounters someone who doesn't, they can think, \"wow, such a good scientist at work, but really out-to-lunch otherwise,\" when they are over-extrapolating and ignoring their own blind spots.",
          "author": "survivalothefittest",
          "created": 1588948398,
          "upvotes": 12,
          "replies": {}
        },
        "fpvkcwf": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvkcwf/",
          "text": "It's been my experience that they are slightly more receptive to ideas than the general population, but not by as much as you would expect. They are usually receptive to ideas if they don't conflict with anything they believe in. But once it comes to something which they believe in, they seem to be about as likely to be blinded by ideology or some other beliefs they have as everyone else (or at least, not much less likely). \n\nIt's like they can get by looking at the trees in such detail that they forget entirely about the forest. They unquestionably have expertise in the tree in front of them, but they miss the fact that the forest is burning. If someone points it out, they can get defensive because they apparently know a lot about the forest, but their actual expertise is in the tree. They often get the implicit assumptions wrong or fail to realize that they have those assumptions in the first place. (This is the point about lacking rationality.) However, once the assumptions are set in place, they are extremely good at deductive reasoning, or otherwise working within the system.",
          "author": "nazgul_123",
          "created": 1588946536,
          "upvotes": 9,
          "replies": {
            "fpvou41": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvou41/",
              "text": "How long have you been in science and how extensive is your experience? Have you been at many universities or research institutes for a long time? Sometimes you can fall in with a set of colleagues that are bit out of it when it comes to the real world, but I don't think it's the rule at all.\n\nAlso, we need to correct for our expectations. Everyone is going to have a more instinctive or emotional response to some things, no one is completely analytical about everything, we are not robots. However, when someone who does think more analytically about a subject encounters someone who doesn't they can think, \"wow, such a good scientist at work, but really out-to-lunch otherwise.\" \n\nAnd remember, everyone thinks they are more open-minded, analytical, and reasonable than they really are while often judging others too harshly in the other direction.",
              "author": "survivalothefittest",
              "created": 1588949047,
              "upvotes": 12,
              "replies": {
                "fpvthy3": {
                  "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvthy3/",
                  "text": "My parents were researchers, so many people who used to visit were as well. Later on, I studied at a highly ranked math undergraduate program, followed by a CS grad program at another university. I worked with a few professors for my thesis as well as other projects, attended a conference, and generally had substantial interaction with the grad students.\n\nI don't dispute that researchers are more rational and analytical than the average person. My point is that it's often not nearly as much as one might assume looking at their domain-specific expertise and the critical thinking involved. To give a concrete value, if you had a good psychometric measure of rationality vs domain expertise, I would guess the correlation to be something mildly positive (like 0.2-0.3) and not 0.8 or so, which you would expect if the critical thinking transferred substantially.",
                  "author": "nazgul_123",
                  "created": 1588951546,
                  "upvotes": 4,
                  "replies": {
                    "fpwu8au": {
                      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwu8au/",
                      "text": "Interesting... have you spent much time with people who are outside of academia then? I don't think the supposition in the OP is wrong per say, but I do think that it's all too easy to forget just how thoughtless the average person is. (*cough* *cough* politics...)",
                      "author": "plasticpots",
                      "created": 1588970067,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fpvwofd": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvwofd/",
              "text": "You speak in generalities and metaphors here. Give an example.",
              "author": "chroniclerofblarney",
              "created": 1588953179,
              "upvotes": 5,
              "replies": {}
            },
            "fpvqmto": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvqmto/",
              "text": "“They are usually receptive to ideas if they don't conflict with anything they believe in.”\n\nHow is that any different with non-academics?",
              "author": "dr_exercise",
              "created": 1588950029,
              "upvotes": 1,
              "replies": {
                "fpvsbbj": {
                  "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvsbbj/",
                  "text": "> How is that any different with non-academics? \n\nIt isn't, which is the point I was trying to convey.",
                  "author": "nazgul_123",
                  "created": 1588950932,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fpvdcil": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvdcil/",
      "text": "There is a discussion of this topic in the book *Why People Believe Weird Things* by Michael Shermer. He argued that smart people believe weird things because they are good at defending their beliefs that they came to for not-smart reasons. \n\nHe defines a \"weird thing\" as anything not supportable by scientific evidence: young-Earth creationism, Holocaust denial, alien abductions, Bigfoot, psychics, etc.",
      "author": "mizboring",
      "created": 1588942169,
      "upvotes": 23,
      "replies": {
        "fpvitvm": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvitvm/",
          "text": "It makes sense that smart people are better at rationalizing their beliefs. Usually, debating with them is next to impossible because even if you have an effective counterargument, it would take you fifteen minutes to dismantle all of the subtle logical fallacies, and by that point they have lost track of the whole argument.",
          "author": "nazgul_123",
          "created": 1588945663,
          "upvotes": 6,
          "replies": {}
        },
        "fpveoq1": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpveoq1/",
          "text": "[removed]",
          "author": null,
          "created": 1588943082,
          "upvotes": -31,
          "replies": {
            "fpvf480": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvf480/",
              "text": "Found one.",
              "author": "Lionstigersandtears",
              "created": 1588943368,
              "upvotes": 16,
              "replies": {}
            },
            "fpvhkx6": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvhkx6/",
              "text": "Is this meant to be an illustration or are you serious?",
              "author": "rkgk13",
              "created": 1588944930,
              "upvotes": 13,
              "replies": {
                "fpvlpbg": {
                  "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvlpbg/",
                  "text": "Both.  It is a common misleading fallacy to lump several controversial topics as ‘the wrong things’\n\nLike shitty countries are China, Russia, Iran and France when I intentionally wish to label France as shitty",
                  "author": "Brroh",
                  "created": 1588947293,
                  "upvotes": -10,
                  "replies": {}
                }
              }
            },
            "fpw93ih": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpw93ih/",
              "text": ">  Maybe all of our carbon dating and archeological evidence is off by million of years and earth’s age is in the millions not billions.\n\nbruh",
              "author": "semipalmated_plover",
              "created": 1588959363,
              "upvotes": 12,
              "replies": {
                "fpwfwqh": {
                  "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwfwqh/",
                  "text": "Bruh prove me wrong or even right - it is mostly guessing",
                  "author": "Brroh",
                  "created": 1588962743,
                  "upvotes": -5,
                  "replies": {
                    "fpwqon3": {
                      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwqon3/",
                      "text": "the onus is on you to upend decades of research methods, not me to show you why they aren't \"mostly guessing.\"",
                      "author": "semipalmated_plover",
                      "created": 1588968209,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fpvbf0w": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvbf0w/",
      "text": "100%. This is an opinion of industrial RnD but the trend probably still applies outside of it. I work at a company with lots of chemistry PhDs but unfortunately (all of these guys tend to be retirement age boomers) a good chunk don’t believe in climate change, even though our company’s entire long term business strategy is structured around climate change.",
      "author": "ColickingSeahorse",
      "created": 1588940763,
      "upvotes": 24,
      "replies": {
        "fpvkebg": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvkebg/",
          "text": "Wow, that is insane.",
          "author": "nazgul_123",
          "created": 1588946558,
          "upvotes": 8,
          "replies": {}
        },
        "fpvq2uj": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvq2uj/",
          "text": "[deleted]",
          "author": null,
          "created": 1588949732,
          "upvotes": 2,
          "replies": {
            "fpvyv2o": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvyv2o/",
              "text": "[Imagine thinking that neuroscience was the correct domain for discussing free will.](https://books.google.ca/books?id=3LAiBAAAQBAJ&printsec=frontcover&dq=why+neuroscience+does+not+disprove+free+will&hl=en&sa=X&ved=0ahUKEwjT86O006TpAhVpUN8KHRopBC0Q6AEIKDAA#v=onepage&q=why%20neuroscience%20does%20not%20disprove%20free%20will&f=false)  As if it was something that was supposed to show up on an MRI.",
              "author": "willbell",
              "created": 1588954289,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "fpv2h06": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpv2h06/",
      "text": "The domain transfer fallacy is real. Just because you have a Ph.D in Industrial Engineering does not mean you have expertise or even good sense about anything else. You might...but there is no guarantee. I can’t remember who it was but someone made a comment decades ago that each Ph.D degree should have an footnote that notes “the holder of this degree is certified to be knowledgeable only on the topic of the dissertation and closely related areas.”\n\nEdit: Typo",
      "author": "DavidDPerlmutter",
      "created": 1588932494,
      "upvotes": 90,
      "replies": {
        "fpvp862": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvp862/",
          "text": "I don't know how many working scientists subscribe to that fallacy. The ones I know are so irritated by this trope in movies, how as long as someone is a scientist in some area, they have some high-level of expertise in all areas. \n\nThere are some disciplines, like some in biology, that do require a fair level of mastery over math, chemistry, and physics as well. And some people who are scientists just love science in general and make an effort to keep up in all areas - journals like *Science* and *Nature* are targetted at exactly these people. So, it's not outrageous to find a scientist in one area to be quite conversant in other ones, but I think the expectation of scientists to be masters of all areas of the discipline mostly comes from the outside. I think every one of us as a story of a friend or relative asking us an opinion on an idea they have or something they read about when it is nowhere near our field of expertise. I don't have any friends who are scientists doing that.",
          "author": "survivalothefittest",
          "created": 1588949266,
          "upvotes": 21,
          "replies": {
            "fpw0wy9": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpw0wy9/",
              "text": "I’m a nurse. My clinical background is in cardiac, vascular, and pulmonary disease. My PhD research is on harm reduction for improving health and quality of life in injection drug users...my friend gave her my mom my number and she called to ask me to run her through the expected course of treatment for her chemo. Beyond accessing her chemo port, I literally could  not tell you a thing about what she should expect. I have never managed an oncology patient or even touched a dose of chemo. She couldn’t believe I didn’t know all about it.",
              "author": "aislinnanne",
              "created": 1588955327,
              "upvotes": 16,
              "replies": {}
            },
            "fpvvc2c": {
              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvvc2c/",
              "text": "The fallacy is common enough among natural scientists regarding social science that there are papers written and published pleading with natural scientists to chill. This is extraordinarily common in environmental fields. I don't know how many times I've talked to ecologists who thought they were policy scholars on the side, or human geographers, or sociologists, etc. The problem is the only people who actually notice are social scientists, so the practice of natural scientists \"doing\" and publishing social science persists -- it happens all within their own circles, reviewers and editors in their own disciplines, for the most part. Journals like Science, Nature, conservation journals, etc. are rife with shitty social science done by people in other fields. There's a growing recognition of the problem but it persists.",
              "author": "a_large_plant",
              "created": 1588952496,
              "upvotes": 10,
              "replies": {
                "fpvxmns": {
                  "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvxmns/",
                  "text": "I don't know how pervasive it is in the natural sciences, I don't think I have every met a single colleague with any interest in wading into the social sciences in any academic way without a collaborator who is specifically in that field to guide them. \n\nThere may be some people who overstep, of course, but I don't think it's common. And, if these people are getting their papers published in peer-reviewed social science journals, then I think it's the editors and the reviewers that are to blame. If they just publish in their own very small sub-disciplinary journals, it likely won't affect the field much and just stays within its own small circle of thinkers. I would think it would be impossible to publish in a larger journal. (We had a similar issue in evolutionary theory with some poorly informed physicists getting a bit crack-pot-y with us, but their publications never made out of their own sphere and we just had to tolerate them being a bit bombastic and bizarre at our talks. It was very few however.)\n\nIn summary, don't let a few kooks color a whole field of academia. There are probably people in other disciplines complaining about the social scientist trying to wade in with their under-informed ideas and opinions.",
                  "author": "survivalothefittest",
                  "created": 1588953660,
                  "upvotes": 5,
                  "replies": {
                    "fpvzvzq": {
                      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvzvzq/",
                      "text": "I have to disagree. It isn't just a few kooks. It's very common. It's even more common for ecology and conservation papers to end with \"policy and management recommendations,\" without any reflection on the fact that their are *entire fields* dedicated to studying environmental policy and management. Then these studies and recommendations are recirculated, re-cited, etc., all within those disciplines, which have little to no awareness that they are overstepping and presenting bad work. Or old, outdated ideas that social scientists have examined, critiqued, and improved on. Sometimes literally decades ago. And this work ends up being very influential, in terms of actual management practice and policymaking. But it's missing half the story half the time.\n\nIt's the equivalent of me, as a soc scientist, just off the cuff using my topical experience to make ecological claims; publish a scientific \"study\" that uses anecdotal data, outdated methods, and showcases my limited knowledge of the literature; or suggest new research directions in a field I have no actual training in.\n\nWhile it's easy to say the opposite probably exists -- social scientists overstepping their bounds -- I'd argue in my experience this is far less common l, at least in the enviro realm. And it has to do with the power dynamics of the environmental field genrerally, which has long been steered by ecologists and other natural scientists, who've allowed themselves to creep into other disciplines like the social sciences. It would be outlandish for me to send some sort of lab or field ecology study to Science, so why is the opposite not only OK, but a regular occurrence?",
                      "author": "a_large_plant",
                      "created": 1588954813,
                      "upvotes": 5,
                      "replies": {
                        "fpw1yvm": {
                          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpw1yvm/",
                          "text": "I can only speculate from what you are saying, but to more general journals in particular, I think all scientists are expected to put in the discussion something about how their work is applicable to other fields and has practical applications. I am a computational biologist and a geneticist. My field is 100% basic science, but I and all of my colleagues will always start and end a paper that is not in a journal for out specific discipline with applications to the \"real world,\" which for us is usually medicine. These suppositions likely seem far-fetched to medical scientists (I also work in more applied areas of the field and with medical scientists), but they are not meant to be taken literally without more translational work. \n\nAs an evolutionary biologist, I work with many ecologists all of whom do feel very passionately about environmental policy, and it is what motivates their work. If people in environmental policy take the recommendations of abstracted discussion sections of their papers, then I think may be the issue with is policy as a field. If they keep taking these recommendations literally, it will only encourage them more.\n\nEven if this is an issue entirely the fault of some ecologists, I still don't think it should be used to color all of the natural sciences as riddled with self-important and under-informed people who want to overstep into other fields.",
                          "author": "survivalothefittest",
                          "created": 1588955855,
                          "upvotes": 10,
                          "replies": {
                            "fpxa0x4": {
                              "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpxa0x4/",
                              "text": "As an ecologist, I agree with you. Most of us finish our discussions with management or policy implications as well as the science, because often it reflects the nature of the work (less and less ecology papers are \"blue-sky\" science and more publications tend to be linked to issues like climate change, invasive species, resource management etc.). Journals, funding bodies, examiners will criticise you if you don't state how your science has applications in the \"real-world\" beyond learning a new cool fact. That's not even limited to ecology, either. Unless your research is purely theoretical, my understanding is that more applied fields push for research to discuss wider applications.\n\nYes, a few ecologists/scientists will pander to the management/policy/social aspect too much without being in those fields themselves, or completely overreach what those implications are. I will admit that researchers will try to state how implications are global so they can get into higher impact factor journals while no policy or management changes are made from their study whatsoever. That annoys me, personally. But for the most part, ecologists are willing to step aside and let those in environmental policy, management etc. take the lead on those topics. And it's becoming more common place that we're collaborating with those outside our fields too.\n\nMaking a few policy/management *recommendations* at the end of a paper (which are expected) does not mean the scientist is trying to speak entirely for politicians/managers, which is what the OP almost implied.",
                              "author": "Neyface",
                              "created": 1588978565,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        },
                        "fpzz5ti": {
                          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpzz5ti/",
                          "text": "There is also a flip side. Fields that study the \"policy making\" might have absolutely no idea what the science is behind what the policies are about.\n\nI work with AI and there are exactly 0 philosophers, lawmakers, lawyers etc. that actually know what the fuck are they talking about. It results in some hilarious misconceptions, even dangerous ones. Even things like ISO standards are way off from the truth and following an ISO standard is going to result in complete failure.\n\nCybersecurity is another one. The soft sciences related to cybersecurity don't have the slightest idea how the math and technology actually works so following a standard or a written policy is guaranteed to give you false sense of security and open you up to more attacks compared to just leaving everything as is and using common sense.",
                          "author": null,
                          "created": 1589025803,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fq2z795": {
                  "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fq2z795/",
                  "text": "It gets worse. I am a communications professor. We really do actual research in our field; I mean thousands and thousands of papers doing real research. And yet I will meet folks who have a degree in something else immediately spouting theories of communication while never having actually read any research in it whatsoever. I’m not blaming them. I’m just saying that it’s pretty common to assume that knowledge in another field is self evident or intuitive.",
                  "author": "DavidDPerlmutter",
                  "created": 1589061549,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fpvar8b": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvar8b/",
      "text": "I've noticed this quite often. I admit that I am this way too. For me, I try to have hobbies and do activities unrelated to my field of study. For instance, I study earth sciences, but I've been reading some Greek mythology and philosophy lately. I think that opens the mind up to different ways of thinking. \n\nBut yes, over the years, I've experienced some people, from postdocs to professors, who spend their whole life doing one thing - their work - and don't really have any life outside of that, and it's difficult to carry on conversations with them about anything other than work. Some just don't want to talk about anything other than work, even when we're having beer in the evening after a conference, they still talk about nothing but their research.",
      "author": "ThePurpleHyacinth",
      "created": 1588940254,
      "upvotes": 13,
      "replies": {}
    },
    "fpv8jsf": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpv8jsf/",
      "text": "Judging from:\n \n* my one colleague insisting that artificial sweeteners \"give you cancer\" \n\n* my colleagues that ignore decades of evidence-based educational knowledge in the design of their courses\n\n* my colleagues utterly incapable of seeing the relative merits of  methodological approaches from other domains\n\n\nI'd say... yeah.",
      "author": "100011101011",
      "created": 1588938434,
      "upvotes": 36,
      "replies": {
        "fpvo6tg": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvo6tg/",
          "text": ">my colleagues that ignore decades of evidence-based educational knowledge in the design of their courses\n\nStory?",
          "author": "42gauge",
          "created": 1588948669,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fpvwakv": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvwakv/",
      "text": "Certainly some people suffer this. Actually, I think an even more significant and equally common problem is when folks think their expertise transfers to other tangential fields. We often say that the least qualified are the most sure of themselves, but I've found that some of those with the most diehard opinions are actually renowned experts in allied fields.\n\nI work in epidemiology, the pandemic gives us an excellent example. You see dozens of papers on medrixv by data scientists, machine learning folks, engineering modelers, economists, and physicists, who have never touched the field of epidemic modeling*. They're legitimately excellent at modeling their own field, so it is easy to assume this knowlege transfers. But in truth some domain expertise and context is important, and it's easy to go wrong without it. \n\n* There are some who do both, have significant experience in the field, and are excellent at it. In this case I specifically refer to those who never touched the subject before March and now are trying to publish on it without any collaborators in the field.\n\nAnother excellent example is John Sununu, the adviser who convinced President Bush (41) that climate change was a farce. He was a brilliant guy. A PhD from MIT, and a known engineering modeler. He felt his modeling expertise was sufficient to evaluate NASA climatologist James Hansen's models, and he decided they were bullocks. Until this point the entire focus of the debate was \"*how much economic growth will we sacrifice to deal with this problem?*\" But Sununu's criticism gave the deniers new life and credibility. After Sununu publicly denounced Hansen and convinced President Bush to abandon any greenhouse gas regulating treaties the US was entertaining, the entire debate shifted to \"*is it a hoax or not a hoax*\". We've been fighting that once since then. The entire world changed because one brilliant guy decided his admittedly impressive expertise translated to another field he didn't understand well. The relevant GRE word of the day is: ultracrepidarianism!",
      "author": "Ut_Prosim",
      "created": 1588952983,
      "upvotes": 9,
      "replies": {}
    },
    "fpvcqw8": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvcqw8/",
      "text": "In my experience these kinds of academics will end up maybe in a lecturer position or possibly a professorship, but won’t end up in leadership positions, even within their field. Sure a professor is a leader of sorts (e.g. in a PI capacity), but those who gain influence above that capacity (e.g. directors, heads of departments, international recognition) usually are those who exhibit much more open-mindedness and well-roundedness. They realise the limits of their expertise and don’t try to hide it. Rather, they are open to learning from everyone. I think that’s what distinguishes a successful academic from a leader.",
      "author": "alix992",
      "created": 1588941745,
      "upvotes": 8,
      "replies": {}
    },
    "fpv8w51": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpv8w51/",
      "text": "\"\\[T\\]he typical citizen drops down to a lower level of mental performance as soon as he enters the political field.  He argues and analyzes in a way which he would readily recognize as infantile within the sphere of his real interests.  He becomes a primitive again.\"\n\n\\- Joseph Schumpeter, *Capitalism, Socialism and Democracy* (1942)",
      "author": "EphusPitch",
      "created": 1588938730,
      "upvotes": 22,
      "replies": {}
    },
    "fpvmfof": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvmfof/",
      "text": "We can suffer from Dunning-Krueger effect like anyone else. One might be knowledgeable in one field of science, but be so ignorant at another enough to not even know how ignorant they are. \n\nAnd the fact that we might be brilliant in one of them can contribute to the general arrogance of assuming to be able to understand another. \n\nIt’s kinda sad to see, but none of us is immune. Being exposed to the scientific method, I am open to having an expert from another field explain to me why I am being ignorant, and change my mind. But that doesn’t mean I have time to read stuff about everything, and be knowledgeable about all subjects, so yeah I might say dumb stuff once in a while. I just won’t assume that I’m right.",
      "author": null,
      "created": 1588947698,
      "upvotes": 6,
      "replies": {}
    },
    "fpvmpr3": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvmpr3/",
      "text": "Yes.  Beyond ignoring best practices of teaching as though there's never been any research there (as one poster pointed out), I've been in so many faculty meetings where they can't grasp the completely obvious.  Then one of two things happen:  a) later in the meeting someone will bring up the same point and many will say, Oh, wow, good point, but by then they've already passed the motion at hand or b) they pass some idiotic motion because they didn't think through what a few faculty had brought up, and then months down the road they realize how what they passed is detrimental to what they do. \n\nSometimes I think that faculty fall in line with Mestrovic's idea that today people are either nice or indignant, and therefore they try to act that way (nice with colleagues, indignant against senior administration) or they try to pigeon hole other faculty into those roles.  So, anyone who offers real critical views on something must be an indignant problem creator and so the nice people collude with other faculty, and with admin, to label and  marginalize that critical faculty member on those grounds. \n\nEven more generally I think the lens of domain expertise links with a lens of agenda and blinds many to what they actually ask from their students: to be open to other ways of doing and thinking.",
      "author": "gutfounderedgal",
      "created": 1588947851,
      "upvotes": 5,
      "replies": {}
    },
    "fpvnovb": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvnovb/",
      "text": "I find the opposite - where people over apply the logic of their field to the world around them. Is there a word for reverse anthropormophizing?\n\nI first heard this years ago about dog trainers basically being assholes because they treat people like a pack of dogs. It turns out that it's generally true.",
      "author": "joejimbobjones",
      "created": 1588948384,
      "upvotes": 4,
      "replies": {}
    },
    "fpvda8v": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvda8v/",
      "text": "As a physician in training, my experience with lots of my professors was, yes. Absolutely yes. There are some exceptions but most of them are, oh god...",
      "author": "Flince",
      "created": 1588942126,
      "upvotes": 5,
      "replies": {}
    },
    "fpvhbcb": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvhbcb/",
      "text": "Yes and no.\n\nThe \"ability\" to solve a problem is definitely transferable and is not impacted by the domain. However, the capability to recognize or ideate might not be.\n\n\nFor example, if you are a CS PhD moving to say biotechnology or biomed. The way experiments are done is very very different. CS research is mostly program oriented and so you can scale an idea quickly and depending on how smart you are you can obtain results fairly quickly. But in biomed, if your experiments involve observing cell division then you have to wait for the cell to divide. \n\nSo in my opinion, if you are a PhD grad and someone presents you with a problem from their discipline you would be able to attempt a solution. On the other hand, you might not be able to come up with an interesting problem in their domain.",
      "author": "a220599",
      "created": 1588944766,
      "upvotes": 4,
      "replies": {}
    },
    "fpw5gbp": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpw5gbp/",
      "text": "A lot of people are saying here that the issue isn't more prominent than in the general population, but I think the level of arrogance in academia might be an aggravating factor here. It might also be worse in STEM fields where some people have been told all their lives they were geniuses. Here are some things I have witnessed, by the way none of those were by students:\n\n* I have seen a great physicist improvising himself as a biologist and an epidemiologist with the stupidest correlation=causation conclusions in his papers. He also wears jewelry that is sold for it's \"antioxidant properties\"... \n* I have also lost quite a bit of respect for a PI who told me \"Poor people are poor because they make poor choices\". That same PI who bought a house on the beach in a very high risk zone. \n* A PI was extremely intrigued by what the tractors do on the beach and had multiple conversations about it to try to solve what he believed was a mystery. (spoiler: They are scraping the sand!). \n* I have been asked by a STEM PI how to use a beaker. \n* I have also been surprised at the beliefs research groups seem to hold. I thought scientists did not *believe*! In my STEM field, there were two \"gangs\" that had different views on a reality that had not been observed yet. Working for a PI in either one meant you adhered to their belief. I was confused by that, aren't scientists supposed to be looking for truth, no matter what it is? \n* Also sitting on any committee, even prestigious ones, as someone with minimal management training is torture. Scientists are completely unaware about all the management tools that exist to help decision taking and project management. They also don't care and don't trust them when they are presented to them. It could save so much time! It's like they believe that they know everything already and that it surely won't be something coming from \"soft\" sciences that will help them.\n\nOf course these are just anecdotes, but it would be pretty interesting to see an actual study on the subject. I suspect it would calm down some of our know-it-alls.",
      "author": "splashingseal",
      "created": 1588957583,
      "upvotes": 4,
      "replies": {
        "fpxzgsh": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpxzgsh/",
          "text": "What are some of these decision and project management tools?",
          "author": "schizontastic",
          "created": 1588992760,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fpvctqw": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvctqw/",
      "text": "I think so, although I can't recall a specific academic instance of this.  My observation is my cousin: when he had his IQ and academic skills tested, he tested off-the-charts genius.  He's amazingly smart.  But you literally cannot hold a conversation with him; he has no bearing on social matters at all.  \n\nAnother observation is this, although with my lack of expertise in the field I hate to bring it up: I wonder how many master's or PhD students might have a form of undiagnosed autism.  That's a huge generalization; but if you think about it, some of the classic signs might match up: small, specific interest in a very specific thing, perhaps a lack of understanding in other areas, etc. Again I'll say: obviously this would be a case-by-case thing and I don't know of any statistics to support this, it's just my observation.",
      "author": null,
      "created": 1588941801,
      "upvotes": 8,
      "replies": {
        "fpvpvq6": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvpvq6/",
          "text": "I do wonder a lot if I'm just slightly autistic and nobody has the heart to tell me to get a job",
          "author": "greenscientist40",
          "created": 1588949624,
          "upvotes": 3,
          "replies": {}
        },
        "fpvkmb4": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvkmb4/",
          "text": ">  But you literally cannot hold a conversation with him; he has no bearing on social matters at all. \n\nDo you mean that he is irrational and defends nonsense ideas in some way, or just that he is absorbed in his own ideas and social graces don't come naturally to him?",
          "author": "nazgul_123",
          "created": 1588946688,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fpvgit6": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvgit6/",
      "text": "Yes, had a friend who was working on developing prosthetics. He was super happy that he could develop them at a percentage of the \"cost\" that the current manufacturer did. One minute after I shared it with a group, marketing prof asked, \"did he account for how much the insurance will be on these items? Medical stuff has high insurance costs.\" Dude never realized it. Now, that I think about it he may have been comparing production costs (no other costs included) vs. retail price. Completely different things. \n\nBut yeah, it could happen in any discipline.\n\nAlso, ask them about their profession and you will find that they think they are the only ones who face a tough job market, a gig economy, stagnant salaries, more work for the same pay, etc.",
      "author": "ThatProfessor3301",
      "created": 1588944270,
      "upvotes": 3,
      "replies": {}
    },
    "fpvph4w": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvph4w/",
      "text": "I think that's just people, dawg. You can take the caveman out of the cave and give him a shower and teach him big words but at the end of the day he's just Sam the caveman",
      "author": "greenscientist40",
      "created": 1588949404,
      "upvotes": 3,
      "replies": {}
    },
    "fpvu95k": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvu95k/",
      "text": "There's a few too many people in my department that huddle over astrology charts and predictions. And they use the field itself to defend it.",
      "author": "SuperSaiyan4Godzilla",
      "created": 1588951940,
      "upvotes": 3,
      "replies": {}
    },
    "fpvx6aj": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvx6aj/",
      "text": "It definitely exists. I've seen academics who could do brilliant things in their specialty, but probably couldn't tell you what were any of the biggest stories in the news that week. It's anecdotal, but what I see is they love what they do so much they simply don't want to focus on anything else. They're happy devoting their energy to their topics. I'm breaking into academia and while I recognize there is more than one good way to be an academic, this isn't how I would want to approach things. I recognize the need to have an established  specialty as a prerequisite to success, but I always want to be well rounded and at least be able to discuss the big ideas to a reasonable standard.",
      "author": "iamprofessorhorse",
      "created": 1588953430,
      "upvotes": 3,
      "replies": {}
    },
    "fpwtai6": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwtai6/",
      "text": "Unfortunately, as a grad student in a physics lab, I've had this experience that OP mentions way too many times. Most recent example: at least one holder of a PhD (in physics....) was telling me that COVID-19 is \"just like the flu, **even milder**\" and mocking me for being afraid that it will get to the US soon. This was in early-mid February. It wasn't that hard to see for anyone with any idea of how math (and like, simple biology) works, yet... \\*rolls eyes",
      "author": "SnowOnCinders",
      "created": 1588969577,
      "upvotes": 3,
      "replies": {}
    },
    "fpwxvxy": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwxvxy/",
      "text": "I've noticed this as well. Heck, in my field it's pretty much a cliche that all physicists are like this.  I've worked with students of very famous scientists (actually the  most famous but they will go nameless) who informed me that despite their brilliant reputation that they were like a petulant child when it came to interpersonal conflict.  My theory about it goes like this.  Analytic skills are not passive (something you have or don't have) but rather more  like a muscle that can be flexed, but also it can be exhausted if you use it too much.  If I spend all day doing high level analysis then, yes, I want to relax and pretend the rest of life is easy, even trivial, even if it means I look naive and simple-minded to others.  For example, during the quarentine I downloaded a Linux game that involved \"hit rate\" probabilities  and terrain penalties for various characters.  I wanted to distract myself from all the stress work, and yet here it is tacitly nudging me to solve expectation values during my break.  So I promptly uninstalled it.  I can do that kind of math all day but sometimes I just want to do anything but analysis.",
      "author": "gull_faxi",
      "created": 1588971974,
      "upvotes": 3,
      "replies": {
        "fpx49ly": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpx49ly/",
          "text": "Thank you for your reply! Yes, I think this may be the reason. I think that going on for 12 hours a day, 7 days a week, analyzing a very specific phenomenon (bonus points if it's theoretical) must require a particular type of person. And it makes perfect sense that someone doing that would unwind by shutting their brain off for the rest of the time. This is what I was referring to in the \"self-selection\" bit. I think that, by and large, people who don't have that \"madness\" won't decide to join academia, given its current state. I know I wouldn't if that was the price I needed to pay. So, you self-select for a narrower kind of intelligence, or a person willing to spend their time thinking about a narrow field of inquiry to the exclusion of everything else. (To be fair, given the highly specialized world today, such a \"narrow\" kind of intelligence seems ideal to be in the workforce in pretty much any industry.)",
          "author": "nazgul_123",
          "created": 1588975372,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fpv6ooe": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpv6ooe/",
      "text": "I see you've met my MIL.",
      "author": "printsinthestone",
      "created": 1588936741,
      "upvotes": 4,
      "replies": {}
    },
    "fpvmtu2": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvmtu2/",
      "text": "An interesting question as I’ve noticed my level of critical thinking tends to at least be partially “trained” for a specific topic. \n\nCognitively I don’t know why this is, perhaps simply the way that skill development or memory works via association\n\nIn some areas I tend to be overly critical to the point where I’m reluctant to make any firm conclusions, out of habit, others with the opposite problem.\n\nI’d imagine there is some level of general critical skills overlapping, or perhaps what overlaps is the potential to gain the insights necessary to apply those critical thinking skills to each topic, which would correlate with intelligence but probably also requires the cognitive effort be made in that specific area or topic in the first place. Perhaps the effort simply is not ever made by some for some topics, which could explain this narrow minded effect\n\nI’d also imagine some people with a certain personality type would seek to put this into practice in all areas and this rule of thumb would not hold for them either, but it would require more intellectual effort",
      "author": "mpbarry46",
      "created": 1588947913,
      "upvotes": 2,
      "replies": {}
    },
    "fpvqdst": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvqdst/",
      "text": "I think that is definitely the case for a lot of academics. But I would say that it's not exclusively limited to academia. People in all realms of life are super critical and rational in their own line of work but don't apply it to anything else.",
      "author": "ArsenalWillBeBack",
      "created": 1588949895,
      "upvotes": 2,
      "replies": {}
    },
    "fpw6lq7": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpw6lq7/",
      "text": "Well of course but everyone, even non-academics, is the same.",
      "author": "bennyandthef16s",
      "created": 1588958151,
      "upvotes": 2,
      "replies": {}
    },
    "fpwnebv": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwnebv/",
      "text": "If your standard for critical thinking is the level of people brilliant in their own fields, then yes.\n\nIf you're also considering people who might try plastic bags as masks, then no.",
      "author": "beanfilledwhackbonk",
      "created": 1588966515,
      "upvotes": 2,
      "replies": {}
    },
    "fpwol5n": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwol5n/",
      "text": "Congratulations, you have reached the highest level of human learning and discovered that it is populated by... humans!\n\nScientists believe stupid things when they have not properly evaluated their received beliefs. Even within a field, this happens. Great scientific discoveries often happen when scientists prove long-standing beliefs wrong. And old scientists are never very receptive to that (see Kuhn, and the comic ITT.)\n\nIn short, this is why peer review is important.",
      "author": "pressed",
      "created": 1588967126,
      "upvotes": 2,
      "replies": {}
    },
    "fpwotn8": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwotn8/",
      "text": "Like when medical doctors every so often [rediscover calculus](https://academia.stackexchange.com/questions/9602/rediscovery-of-calculus-in-1994-what-should-have-happened-to-that-paper)?",
      "author": "Frankie_Bow",
      "created": 1588967249,
      "upvotes": 2,
      "replies": {}
    },
    "fpxee2p": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpxee2p/",
      "text": "In my experience, I've seen my colleagues most often get tunnel vision with things that are politically charged. Part of my work is in optimization related to sustainability, for example controlling smart grids or energy distribution networks. This is a very multidisciplinary field, and it leads to my colleagues who are experts in one area having strong opinions on other related topics that they come across. Unfortunately, they often parrot common misconceptions that are nothing more than political talking points, because they haven't done their homework in understanding these other topics.",
      "author": "notadoctor123",
      "created": 1588981056,
      "upvotes": 2,
      "replies": {}
    },
    "fpy8pn4": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpy8pn4/",
      "text": "100%.\n\nIt seems that the fact that you have a Ph.D. doesn't stop you from becoming a dumbfuck when it comes to other topics.\n\nFor example, my own father has a Ph.D. in accounting but still manages to annoy me with his alternative medicine bullshit and believes in ghosts and spirits, apparently.",
      "author": "Almer113",
      "created": 1588998514,
      "upvotes": 2,
      "replies": {
        "fpymu8h": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpymu8h/",
          "text": "Yes, this has pretty much exactly been my experience as well.",
          "author": "nazgul_123",
          "created": 1589006466,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fpvmgye": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvmgye/",
      "text": "Yes, I feel this a lot with the pre medical and medical students. They might be great at what they do, but sometimes you’re like “How did you get into medical school” 🤣",
      "author": "Bekah_grace96",
      "created": 1588947717,
      "upvotes": 1,
      "replies": {}
    },
    "fpvr0cq": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvr0cq/",
      "text": "you're right; for many, a doctorate is simply a license to do a particular job...it isn't a certificate of grand thinking",
      "author": "patriotto",
      "created": 1588950234,
      "upvotes": 1,
      "replies": {}
    },
    "fpvt3di": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvt3di/",
      "text": "[deleted]",
      "author": null,
      "created": 1588951337,
      "upvotes": 1,
      "replies": {
        "fpvuggm": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvuggm/",
          "text": "I don't have an agenda. It's something which I noticed, and several of my peers agreed with. Just wanted to hear what other people had to say about it.",
          "author": "nazgul_123",
          "created": 1588952046,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fpvxpaz": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvxpaz/",
      "text": "I've noticed this a bit.  My opinion is that, a lot of academics have a complicated relationship with being smart.  Sometimes it might be that they are well-versed in their field, sometimes it might be that they teach and spend most of their interactions teaching those who are less knowledgeable, or sometimes it might be that they were the smartest person in the room at some point in their lives, maybe in high school or college, and miss that feeling.  \n\nSo when the conversation goes to other fields, there's a tendency to take shortcuts to understanding.  On one hand, they don't have the time to dedicate their lives to other fields like they do to their own.  But on the other hand, having conversations about things you don't know about can be intimidating.  So having weird beliefs is a way to get around that.\n\nI used to be confused because of course, academics often have conversations about research where usually you don't know the answers.  But there's a difference between, not knowing something because no one knows, versus not knowing something that a lot of other people know.",
      "author": "arthurmerlin",
      "created": 1588953698,
      "upvotes": 1,
      "replies": {
        "fpx9xkt": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpx9xkt/",
          "text": "There's also miss trust between fields. For example, wrong conclusions based on miss understanding  of quantum physics are often put forward by philosophers of mind. Psychology had a well known replicability crisis. Theology is still a field of study, however it's hard for most people in STEM to see that field as anything other than a subset of literature analysis...  \n\n\nSo it's not just the Dunning Krueger effect (which is what you allude to), but also that people in certain fields have reasons to distrust conclusions in fields other than their own.",
          "author": "camilo16",
          "created": 1588978513,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fpvzgu2": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvzgu2/",
      "text": "There's very specific areas where, especially graduate students, tend to have very stupid opinions, and it is usually related to their subject-matter and some specific other field.  E.g. neuroscientists tend to think their opinions on the free will debate matter, physicists tend to think their opinions on everything matter, my first year chemistry profs thought his knowledge regarding the melting point of steel beams was relevant to 9/11, etc.",
      "author": "willbell",
      "created": 1588954598,
      "upvotes": 1,
      "replies": {}
    },
    "fpwe4nu": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwe4nu/",
      "text": "Yes.",
      "author": "t-stor",
      "created": 1588961849,
      "upvotes": 1,
      "replies": {}
    },
    "fpwywus": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpwywus/",
      "text": "I had a brilliant chemistry professor who would occasionally tell us about how he remembered his past life as a Roman soldier. It always seemed kind of contradictory. \nBut then I guess, why do we assume that a chemistry professor shouldn't believe in past lives?",
      "author": "Philieselphy",
      "created": 1588972514,
      "upvotes": 1,
      "replies": {}
    },
    "fpviwtk": {
      "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpviwtk/",
      "text": " I’ve found that most academics do not”do” critical thinking, period, inside their field or out of it. \n\nThink about all those unquestioned assumptions imported right into the research questions ...",
      "author": "lashend",
      "created": 1588945710,
      "upvotes": 0,
      "replies": {
        "fpvj7z1": {
          "link": "/r/AskAcademia/comments/gfp87y/do_you_find_that_many_people_in_academia_have/fpvj7z1/",
          "text": "I think I would agree with you there. It's kind of weird that as a \"layman\" one can point out so many obvious unquestioned assumptions, but the professors themselves seem to be unaware about them. Makes you wonder...\n\nETA. I don't mean that laymen are better, just that professors don't seem to be significantly better than laymen when it comes to things outside of their field.",
          "author": "nazgul_123",
          "created": 1588945888,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}