{
  "sid": "f36wyx",
  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/",
  "title:": "Struggling to start my postdoctoral career due to disastrous PhD",
  "text": "I have a PhD in Cell Biology from an Australian institution, but the journey wasn't the most ideal. \n\nTook 4 years longer than the norm due to many seen and unforeseen circumstances. Talking about this still brings back demons from the past. I never really talked about this to anyone let alone put these thoughts online. Just to summarize my PhD: Project changes, ostracized in a collaborators lab, personal issues, problems within the advisory team, overworking and not sleeping enough. Gradually snowballed into long periods of self doubt and defeat. Converted my PhD to part time, spent a few years adrift doing anything but science or research, and finally conjured up the energy to cross the line and submit my thesis. \n\nFast forward to my job search. I have regained my passion for science and research, and would like to remain in academia or some capacity of scientific research. I actually miss going into the lab, leading an interesting scientific project, develop new techniques, and publish more papers.\n\nSpent the past 1 year applying for research positions, from postdoctoral positions to research assistants, research technicians and research officer roles at various Australian universities and industry. 95% of the applications failed to make it past the first stage, 5% made it into interviews but always ended up unsuccessful. Some of the frequently asked questions included \"Why did you spend so long completing your PhD\", \"What is your motivation like\", \"Why are there gaps in your resume\", \"How do we trust you to finish our projects in time\", \"We need someone who can work hard\". \n\nI really don't want to use my personal failures as excuses for myself. I should have pushed myself over the line earlier. But what happened has happened. I just want to find a way to dig myself out of this hole.\n\nDo I still have a chance in academia? Do you think there will be principle investigators out there willing to give me a chance?",
  "author": "niwrowyddonydd",
  "created": 1581582234,
  "updated": 1634081984,
  "over_18": false,
  "upvotes": 102,
  "upvote_ratio": 0.98,
  "comments": {
    "fhgzwly": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhgzwly/",
      "text": "It's a fine line when you acknowledge career interruptions. I once heard a professor talking about rejecting someone from a fellowship because she had this long sob story about how she had 3 kids and an elderly mother to take care of and that's why she had no publications recently. I thought it was totally unfair that he rejected her for that, and he explained that it's about how you frame it. He said he'd seen someone else get funding who had framed it like \"I had a baby and went on maternity leave for x months. I published one paper after that. If I had been full time with no babies that level of productivity would have equalled 3 papers. In my field the top scholars are publishing on average 3.2 papers. I'm amazing\"\n\nI don't know if that helps you, it's tough out there! Chin up.",
      "author": "Philieselphy",
      "created": 1581587076,
      "upvotes": 127,
      "replies": {
        "fhib3jr": {
          "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhib3jr/",
          "text": "I’d really like to work for someone who reduces my life’s complexity into an optimized publication input/output function. Sounds like a pretty cool person.",
          "author": "Mythsterious",
          "created": 1581621287,
          "upvotes": 21,
          "replies": {
            "fhjijo3": {
              "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhjijo3/",
              "text": "No one is ever going to hire you just because you're nice. Someone needs to know you can do the work. In academia, the unit of \"work\"/end product is a publication. Most people won't hiring strictly on that, but it's an honest question if you have dramatically fewer than people at your same stage.",
              "author": "mediocre-spice",
              "created": 1581647078,
              "upvotes": 3,
              "replies": {}
            },
            "fhidfwe": {
              "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhidfwe/",
              "text": "[deleted]",
              "author": null,
              "created": 1581622590,
              "upvotes": 5,
              "replies": {
                "fhijlbu": {
                  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhijlbu/",
                  "text": "That’s a fun perspective on life that I happen not to share.",
                  "author": "Mythsterious",
                  "created": 1581626018,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "fhheyog": {
          "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhheyog/",
          "text": "Jesus how toxic. Fuck that guy.",
          "author": "Oppqrx",
          "created": 1581602558,
          "upvotes": 75,
          "replies": {
            "fhiby35": {
              "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhiby35/",
              "text": "I don’t agree at all.\n\nHow you frame a matter says tons about your perspective.\n\nI, obviously, wasn’t there, but taking the story as it’s told a “long sob story” implies it was framed in terms of their hardships rather than their accomplishments and own behavior.\n\n*Everyone* has and will have really tough shit. Most of it we *will never know about*.  If someone goes on about how hard they have it rather than what they do and how they do it I too am dubious of having them as a colleague to rely on.\n\nAgain, I wasn’t there, but reading as written nothing suggests the professor is necessarily toxic to me.\n(And flip the the story for a bit—accept everyone who didn’t accomplish much, but have a story about hardships they faced.  How do you really think that will work as hiring criteria?  How many people do you think can’t tell a hardship story if they tried.  Especially since these things are functionally unverifiable.)",
              "author": "OphioukhosUnbound",
              "created": 1581621767,
              "upvotes": 34,
              "replies": {
                "fhj2ar8": {
                  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhj2ar8/",
                  "text": "It’s the same approach a hiring committee would take outside of academia. When looking for a job, or perhaps a raise, it’s typically wise to leave personal matters out of the equation. You may well feel you deserve it because you’ve had a rough go, expenses have gone up, and your partner left you, but that certainly isn’t a good way to sell yourself when facing stiff competition. Nothing toxic (necessarily) about doing your job, which in this case entails making the best possible choice to increase productivity, and amplify research potential.",
                  "author": "GearAffinity",
                  "created": 1581636740,
                  "upvotes": 8,
                  "replies": {}
                },
                "fhiiyo1": {
                  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhiiyo1/",
                  "text": "Yeesh. That's a lot of uncritiqued ideology.",
                  "author": "Oppqrx",
                  "created": 1581625667,
                  "upvotes": -13,
                  "replies": {}
                }
              }
            }
          }
        },
        "fhhkk3y": {
          "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhkk3y/",
          "text": "while I don't doubt the  Prof said that,   the major point would be that there is enormous risk in hiring a person who will not be able to do the required work.   The issues that caused this person to not get work done,  are still present and likely to appear again (perhaps even more likely with an elderly mother). \n\nI'd suggest to OP to definitely not give the sob story.   Perhaps explain briefly why there were such gaps,  and importantly \"what you have done to resolve them, and how you can assure that they will not occur again\".",
          "author": "arachnidtree",
          "created": 1581606275,
          "upvotes": 28,
          "replies": {
            "fhhlkv1": {
              "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhlkv1/",
              "text": "You could make the same argument for a blanket ban on hiring anyone with a functional uterus.",
              "author": "Philieselphy",
              "created": 1581606894,
              "upvotes": 36,
              "replies": {
                "fhi39nf": {
                  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhi39nf/",
                  "text": "Men can have 3 kids and an elderly mother too.",
                  "author": "IIIIllllllIIIll",
                  "created": 1581616959,
                  "upvotes": 18,
                  "replies": {}
                },
                "fhhopyw": {
                  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhopyw/",
                  "text": "You can definitely make that argument. But when it is a short-term job, funded through a term-limited grant, you need some assurance that the person you hire is going to be able to focus on the job you hired them for. Otherwise you waste funding, and risk your ability to get future funding. I view it as more of a structural problem than an issue of 'this person is sexist.' There are a complex set of motivations and forces here, which I really don't think is helpful to reduce down to sexism.",
                  "author": "Peninj",
                  "created": 1581608718,
                  "upvotes": 6,
                  "replies": {
                    "fhhtylv": {
                      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhtylv/",
                      "text": "Indeed, it's almost like there's sexism *baked in* to the structural forces at play...",
                      "author": "cakebyte",
                      "created": 1581611704,
                      "upvotes": 30,
                      "replies": {
                        "fhi0sa1": {
                          "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhi0sa1/",
                          "text": "Yes I agree. And I do not want to excuse it, but I do not see how a single individual acting alone can overcome this problem by simply altering their hiring practices. Further, if they are the only one who alters the hiring practice to accommodate someone with a less than stellar track-record of productivity over someone with a better record of being productive (regardless of the reasons for the lack of productivity), then the PI doing the hiring is at a disadvantage and may be undermining their ability to continue to fund their varied projects. \n\n\nIf we as a community are serious about these structural sexism and racism issues—which I wish we did more than just pay lip service to—then we need to address how funding is allocated. I think pointing out something as being sexist is the first step in the process, but unless you follow it up with something helpful, or provide a better analysis of the situation then there is little to build on. \n\n\nIf, for example, NSF or NIH, had provisions in the way they awarded funding which says something like \"in the event of a serious medical/personal/etc. situation involving the lost productivity of a postdoc, a PI can request an extension, or supplement to funding to accommodate lost time and productivity.\"\nI think this may ease some PI's worries about hiring someone with a limited track-record of productivity if it can be explained as the poster above was talking about. But again, if you want to fix the structural problems which coerce PIs into making sexist-tinged decisions, lets talk about ways of doing that rather than assuming the worst of intentions in our peers and colleagues.",
                          "author": "Peninj",
                          "created": 1581615561,
                          "upvotes": 8,
                          "replies": {
                            "fhif2gx": {
                              "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhif2gx/",
                              "text": "> but I do not see how a single individual acting alone can overcome this problem by simply altering their hiring practices.   \n\nThis is a convenient excuse, and often trotted out for climate change too. If we all think like this, things will never ever change. But if 5% of people buck this trend, and things become visible, and people see others making the effort, then we can change the system by our individual actions.",
                              "author": "ardbeg",
                              "created": 1581623494,
                              "upvotes": 14,
                              "replies": {
                                "fhjfb0n": {
                                  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhjfb0n/",
                                  "text": "Hey, sure. I’d be interested interested in bucking the trend but unfortunately I’m in a precarious social and economic position. So unless I can have some assurances that I will be joined in solidarity in a way in which I won’t be singled out and punished, then yes. I would absolutely join such a trend. But at the moment I don’t see such a coalition forming. Nor do I see a particularly cautious and open minded discussion happening to foster such a coalition.",
                                  "author": "Peninj",
                                  "created": 1581644779,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "fhjeczd": {
                              "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhjeczd/",
                              "text": "The NIH, along with many other funding agencies, do indeed provide supplemental compensation for PIs with trainees who go on medical leaves (including maternity leaves)",
                              "author": "barrhavenite",
                              "created": 1581644104,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fhhp7gd": {
                  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhp7gd/",
                  "text": "I don't follow.\n\nHaving a uterus doesn't mean one will take 4 years longer to complete a PhD,  and it doesn't mean they will just be gone for 2 years.",
                  "author": "arachnidtree",
                  "created": 1581608992,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            },
            "fhhlr0w": {
              "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhlr0w/",
              "text": "This!",
              "author": "Smiadpades",
              "created": 1581606997,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "fhhej42": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhej42/",
      "text": "Honestly, you'll have to consider leaving Australia.",
      "author": "mahler004",
      "created": 1581602250,
      "upvotes": 26,
      "replies": {
        "fhjaw3v": {
          "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhjaw3v/",
          "text": "Why?",
          "author": "ElizaCaterpillar",
          "created": 1581641694,
          "upvotes": 1,
          "replies": {
            "fhjc4ln": {
              "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhjc4ln/",
              "text": "A few reasons. Postdoc-driven labs which are populated mostly by postdocs are pretty uncommon in Australia. Most labs - even reasonably large labs - will only have a handful of postdocs, with much of the research driven by RAs and PhD students. In practise, this means positions are pretty competitive, especially as the high salary, high calibre of research and lifestyle attracts international researchers, and postdoc positions will often go to Australians that have spent some time overseas returning home.\n\nThe funding situation for ECRs in Australia is nightmarish as well, so it's very hard to attract your own fellowship funding.\n\nThere's also a philosophical difference in how postdocs are seen between the US and Australia/Europe. In the US, postdocs are seen as further training - so people are usually more willing to take the time and risk on training someone more inexperienced in a lab's core techniques. The salary and status (trainee vs employee) generally reflects this. Fellowship funding is generally a bit more available (even for non-Americans). In Australia, a postdoc is seen as a job, so people are less willing to take the time to train someone who's inexperienced in a lab's core techniques.\n\nThis all isn't to say that it's impossible as an Australian PhD student to get a postdoc position in Australia immediately after your PhD, it's actually getting more common. These positions are competitive, usually found via networks, and require you to have skills that the lab needs.",
              "author": "mahler004",
              "created": 1581642519,
              "upvotes": 10,
              "replies": {
                "fhjet3l": {
                  "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhjet3l/",
                  "text": "Cool background info! How long do most Australians hold post docs for before becoming independent researchers? In North America, it’s very common to have done two or three postdocs before a PI position.",
                  "author": "barrhavenite",
                  "created": 1581644426,
                  "upvotes": 3,
                  "replies": {
                    "fhk0slx": {
                      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhk0slx/",
                      "text": "There's not really a rule (is there ever?) but thinking of newer lab heads in my department, must have done a 3-4 year stint overseas following their PhD, then a shorter postdoc in Australia that allows them to apply for their own funding, then applying for a PI job/setting up their lab with this funding. Some people skip the second postdoc and get the grant while overseas, although this is not super common (although not exactly uncommon). It's also becoming increasingly common for people to spend their whole career (PhD->postdoc->PI) in Australia.",
                      "author": "mahler004",
                      "created": 1581662050,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fhhhvqb": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhhvqb/",
      "text": "The fact that you’re getting some interviews means that some people are willing to look past any perceived flaws in your CV.  You may have to just keep trying to find the right fit.  \n\nIf you think there’s a problem with your interviewing skills, maybe you could do some mock interviews with colleagues or acquaintances and ask them for their honest feedback.  \n\nGood luck!",
      "author": "parrotlunaire",
      "created": 1581604576,
      "upvotes": 27,
      "replies": {}
    },
    "fhgzo61": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhgzo61/",
      "text": "Well, this was more or less my situation as well. Five year PhD, with the last two years, as you put it, part time. Then came a two-year gap, in which I sent out lots of applications for a postdoc. Got only 4 interviews, but finally landed a position in Germany. My postdoc basically feels like a second PhD, which is a bit tough, because now I'm older and competing with more experienced researchers, but all in all, I'd say worth it. I wanted to stick to academia, and it worked out. I believe you'd be okay too. Just don't give up, and accept that your path might be a bit more difficult than the average.",
      "author": "footyshooty",
      "created": 1581586740,
      "upvotes": 21,
      "replies": {
        "fhxfpvn": {
          "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhxfpvn/",
          "text": "For those of us doing (biology) PhDs in North America, it's quite amusing that there are places in the world where a 5 year PhD raises red flags... ;-) (Mine will probably be around 7, full time -- a bit on the upper end but very far from concerning)",
          "author": "Hemimastix",
          "created": 1581953305,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fhhgdu9": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhgdu9/",
      "text": "It sounds like those questions are actually an opportunity for you to explain a potentially negative part of your CV.",
      "author": "shim12",
      "created": 1581603570,
      "upvotes": 16,
      "replies": {}
    },
    "fhhpri0": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhpri0/",
      "text": "I've recently had to leave my previous job to find another, took me over 6 months. During that time, I was lucky to have a paid consultant to guide me through that process. It was truly priceless for the amount of things I was just oblivious too up until she told me, and I saw happening. I can't summarize everything I learned, but I'll try. Meanwhile, do look online for job application websites, there are many with a lot of really useful information. Practice, learn, adapt.\n\nThis said, think of job hunting as a 6 month graduation course. You have to learn it's own procedures, language, strategies, and apply them to your advantage. \n\n###1.Understand the role of the people offering the position: they want to find the most qualified person, with minimum time and money investment, and most importantly risk. Most qualified doesn't mean having the most gold stars on your CV. It's a shortcut for an autonomous, competent person, who will be ready to start working as quickly as possible, efficiently, and require minimum \"maintenance\".\n\nOne of the worst possible mistakes one can do as a supervisor is dealing with an awful collaborator that you hired. Every day that passes you pay for a person who is incapable or unwilling to do their job, plus the missed opportunity for another more competent person, plus you have to either do their job for them, or worst even, constantly running around putting out fires they started. It's frustrating for you, for the team, for the department, and for everyone including that person. \n\nYou job as an applicant is, first of all, to address these concerns throughout your application, directly or indirectly. \nSecondly, it is to address these concerns. \nIdem.\nOnly after, should focus on standing out as the better option for that position out of the pool of applicants. \n\n###2.Each step of the application counts, and has it's own very specific goal\n\n- search for offers: \n\nefficiency in selecting and applying\n\n- research the position, the supervisor, the lab, their work\n\ngather every bit of information to help you tailor your application, gather contact list, decide if it truly is interesting or not\n\n- networking: \n\ncall people who may be familiar with anyone relate with the position/lab/department/university. gather a list of references, gather more info on the position, etc to tailor application\n \n- individually adapt CV to offer\n\nThe role of the CV is to get you n interview. To do that you have to show off your skills/compatibility for the position while indirectly addressing the concerns of the people reading it.\nCall the supervisor directly, ask if they had time to review your CV and if they have any questions. If not, express your interest and motivation in a 1 min pitch, and make yourself available to answer any questions they may have. Follow up by email after one week.  \n\n- prepare for the interview\n\nMain goal is to reassure the person in front of you about the concerns mentioned in 1. \nPractice beforehand, as much as possible, telling your professional story, why the offer motivates you and what you can contribute for the project. \n\n\n\n### your specific case \nThis structured approach allows not only to look for a position efficiently, but also to diagnose and correct potential issues. If you're consistently getting stuck at either one of these stages, then you know what the issue is. \n\nSo it took you way longer than usual to finish your PhD. You had a terrible experience, but finished. You also say you're getting interviews. Let's analyse the situation.\n\nYour weak point is the time spend finishing your PhD that may stand out in your CV. From their perspective this may be a red flag. You should address it, and minimize its impact. First, *come up with a \"story\" that describes your experience in the most optimistic way possible.* It's not about lying, it's about seeing things from an impeccably rose-colored glasses. Don't lie, don't shift blame, don't mention any shortcomings. \"It was a difficult situation, but you dealt the best you could to cause the least impact to the project, and learned a lot from it. You're happy you had that experience because now you are 100% focused on this exciting new opportunity.\"\n\nAlso, if this time gap in you CV really is limiting your options, you should rely even more on the other strategies: improvin your CV with compatible keywords, networking, references, direct contact, etc.\n\nHowever, if you're getting interviews, this may not as serious as you may thing. \nThey read your CV, and are interested. But they need to be reassured. It is perfectly normal that they ask about that period and why it took so long. After all it is the elephant in the room and it would be honestly unprofessional of their part if they didn't. It's not an attack on you, it's a defense of theirs. Roll out your 2 min story about what happened, smile, don't point fingers, and finish strong with how that has made you an even better candidate, and finally your other strengths (maturity, experience, publications?, supervision?...).\n\nBest of luck!",
      "author": "_whatevs_",
      "created": 1581609308,
      "upvotes": 15,
      "replies": {}
    },
    "fhio74i": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhio74i/",
      "text": "As an Australian PhD in an adjacent field - have you tried looking for postdoc positions overseas? Australian PhDs doing postdocs in Australia are not even particularly advisable. (Unless it is a 2nd or 3rd postdoc).",
      "author": "zero2hero2017",
      "created": 1581628576,
      "upvotes": 3,
      "replies": {}
    },
    "fhhcsww": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhcsww/",
      "text": "I agree, you can make it. I'd say maybe look at some non-standard postdocs, maybe ones involved in public outreach or private-public fusions.",
      "author": "Bubba10000",
      "created": 1581601002,
      "upvotes": 5,
      "replies": {}
    },
    "fhh1c5a": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhh1c5a/",
      "text": "You miss 100% of the shots you don't take.  Keep applying.  You will likely fit someone's bill at some point.",
      "author": "Life_time_learner",
      "created": 1581589122,
      "upvotes": 5,
      "replies": {}
    },
    "fhhqvaf": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhhqvaf/",
      "text": "Crap. Sorry, I do not have useful advice, but this is a bit too close to home. Congrats on finishing your PhD though. I could not.",
      "author": "jane_avril",
      "created": 1581609937,
      "upvotes": 2,
      "replies": {}
    },
    "fhj0laj": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhj0laj/",
      "text": "Two things you need to do in a situation like this.\nFirst, practice accountability and take responsibility. There is a fine line between making excuses for a gap or giving reasons for a gap in your career. Tell them straight up why it took longer than expected to graduate. Of course you can avoid mentioning some less than admirable parts of it. But do not dress it as an excuse. Don't go on and on about how hard life hit you. Briefly explain what happened and what you did to get over the issues. How did you solve the problems that kept you from finishing? What did you learn from that experience? Take responsibility for the mistakes that resulted in delayed graduation. Be accountable.\nSecond, focus on your strengths. Longer PhD studies can mean longer exposure to various methods. List them, talk about them. Give examples to various skills you learned and utilized. Is there a skill highly desired in your field that most people don't have but you do? Focus on those kind of skills.\n\nI finished my PhD in 6.5 years. Most people finish in 4 years in north America. But I have developed a shit ton of hands on skills. Way more than anyone I have seen around me. I have used this to my advantage and it has been working so far.",
      "author": "stdoggy",
      "created": 1581635685,
      "upvotes": 1,
      "replies": {}
    },
    "fhjqlu7": {
      "link": "/r/AskAcademia/comments/f36wyx/struggling_to_start_my_postdoctoral_career_due_to/fhjqlu7/",
      "text": "I agree it’s how you frame it. Hiccups happen! I would acknowledge there were interruptions, but they ultimately didn’t stop you from keeping on keeping on! Use your long road as an asset not a setback. I would emphasize the dedication and commitment that it took to complete you PhD amidst the hiccups. But just a suggestion!!",
      "author": "pennsylaina",
      "created": 1581652870,
      "upvotes": 1,
      "replies": {}
    }
  }
}