{
  "sid": "lmb526",
  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/",
  "title:": "Vent: In this episode of weird things that happen during virtual TT interviews on Zoom...",
  "text": "Thanks for all the good discussion! \n\nGood luck to everyone who is dealing with these searches in a pandemic. And thank you to all the committees who are working hard to make these virtual visits happen.",
  "author": null,
  "created": 1613614291,
  "updated": 1634080137,
  "over_18": false,
  "upvotes": 339,
  "upvote_ratio": 0.97,
  "comments": {
    "gnuahif": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuahif/",
      "text": "Yes. I had a guy talk to me about his shoes the whole time in a 1:1. I didn’t get a pee break the whole day (this was a little before covid) and they didn’t have a schedule for me. Plot twist. I was hired and love it here.",
      "author": "drpicoloco",
      "created": 1613615694,
      "upvotes": 214,
      "replies": {
        "gnudom3": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnudom3/",
          "text": "A tip for future candidates if in person visits return:  Ask to use the bathroom. \n\nThis was actually something we were explicitly told when prepping for the market.",
          "author": "Adultarescence",
          "created": 1613617284,
          "upvotes": 101,
          "replies": {
            "gnuuek5": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuuek5/",
              "text": "I'm that committee member that lets people know what is okay by doing it myself. \"Hey wait a second before starting this I gotta pee,\" \"I really love the riesling here,\" etc.",
              "author": "phoenix-corn",
              "created": 1613626652,
              "upvotes": 26,
              "replies": {}
            },
            "gnvlnj7": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvlnj7/",
              "text": "Good tip. I told the admin assistant who helped set up the logistics of my campus visit that I’ve got some moderate social anxiety, so if it seems like I’m going to the bathroom a lot, it’s mostly just to center myself throughout a long day of being around people. She was so sweet and made sure there were plenty of breaks between scheduled meetings for me to nip off and do a quick meditation. It was really lovely and showed a lot of care on their part. I’m now happily employed with that university and loving it.",
              "author": "PirateBushy",
              "created": 1613649966,
              "upvotes": 27,
              "replies": {}
            },
            "gnufrr3": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnufrr3/",
              "text": "wait really? why?",
              "author": "PM_me_ur_floof",
              "created": 1613618353,
              "upvotes": 17,
              "replies": {
                "gnugbot": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnugbot/",
                  "text": "Because the search committee thinks candidates are secretly robots ;) Just kidding. Probably because it’s expected that we are all colleagues and don’t really need to ask permission for something like that...at least that’s what I assume. Pre scheduled restroom breaks would be a little odd.",
                  "author": null,
                  "created": 1613618638,
                  "upvotes": 74,
                  "replies": {
                    "gnugjwv": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnugjwv/",
                      "text": "MAY I, A HUMAN, USE THE TOILET PLEASE?",
                      "author": "PM_me_ur_floof",
                      "created": 1613618756,
                      "upvotes": 72,
                      "replies": {
                        "gnuqflx": {
                          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuqflx/",
                          "text": "MY URINARY ORGANS, WHICH ARE SOFT AND FLESHY MIND YOU, NEED DRAINING",
                          "author": "fuckwatergivemewine",
                          "created": 1613624178,
                          "upvotes": 48,
                          "replies": {
                            "gnvhg0g": {
                              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvhg0g/",
                              "text": "r/totallynotrobots is leaking again.",
                              "author": "slap_my_MEDIC",
                              "created": 1613646375,
                              "upvotes": 10,
                              "replies": {
                                "gnviohw": {
                                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnviohw/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1613647488,
                                  "upvotes": 11,
                                  "replies": {
                                    "gnwwrzb": {
                                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnwwrzb/",
                                      "text": "WE WERE TOLD NOT TO DRAIN WHILE CONVERSING WITH OTHER ROBOTS I MEAN HUMANS",
                                      "author": "imhereforthevotes",
                                      "created": 1613672941,
                                      "upvotes": 3,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gnuo1sb": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuo1sb/",
                      "text": "Both of my campus visits included two 15 minute \"down time\" in between 1 on 1s. I think it really depends on who is doing the scheduling.",
                      "author": "LadyTanizaki",
                      "created": 1613622807,
                      "upvotes": 18,
                      "replies": {}
                    },
                    "gnurcjc": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnurcjc/",
                      "text": "They actually  scheduled bathroom breaks, but those never happened. It was probably listed as downtime like the Redditor below mentioned. I was so focused on peeing so I saw those as my pee break. 😢",
                      "author": "drpicoloco",
                      "created": 1613624721,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "gnw30cz": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnw30cz/",
                      "text": "> Pre scheduled restroom breaks would be a little odd.\n\nThey don't need to be called restroom breaks. If it's a day-long interview, it's a good idea to schedule 10-15 minute breaks between sessions where both the candidate and the committee can, yes, go to the bathroom, or get a snack/drink, have a smoking break, make a phone call, or whatever they need to do. A full day where you need to be on without any breaks whatsoever is really difficult, especially if you're in a stressful situation of being interviewed. At places where day-long interviews are done regularly, this is an expected practice; the only reason I can think of that this doesn't happen at some departments is that they don't hire/interview very often, so they simply don't realize that this is something they should do.\n\nOn the subject of bathrooms, btw, it's a good idea to have mandated breaks rather than impromptu ones because some people need (significantly) more time in the bathroom than normal, e.g. because of a medical condition, and that's obviously an awkward thing to explain to a prospective employer - but you also don't want to just ditch the prospective employer for a length of time with no explanation.",
                      "author": "thegreenaquarium",
                      "created": 1613660319,
                      "upvotes": 8,
                      "replies": {
                        "gnw46x8": {
                          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnw46x8/",
                          "text": "I honestly never said there should be no pre scheduled breaks! All I meant by that is sometimes when you’re walking back from lunch I think it’s completely acceptable to say “I need to take some time to freshen up.” Even if that is unscheduled. Sometimes you have an urgent need to excuse yourself right away and so a prescheduled break wouldn’t accommodate that. \n\nI completely see all of your points. I wasn’t arguing against them.",
                          "author": null,
                          "created": 1613660878,
                          "upvotes": 2,
                          "replies": {
                            "gnw9btt": {
                              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnw9btt/",
                              "text": "I wasn't arguing either, and I don't believe that I wrote my comment in an argumentative tone (let me know if you disagree), which is why I'm a bit puzzled by the defensiveness of your comment.\n\nYou seemed to claim that pre-scheduled bathroom breaks aren't necessary because \n\n> Probably because it’s expected that we are all colleagues and don’t really need to ask permission for something like that\n\nso I wanted to point out that, if you are someone for whom going to the bathroom is a Big Deal, that 1) may be something that you do need to apprise people of, if not exactly \"ask for permission\", 2) it may be something that is awkward for you to do in a job interview situation. I then also added that small breaks are important/useful for virtually everybody, since from your wording it wasn't clear whether you realized that said breaks could be used for non-bathroom things.\n\n> when you’re walking back from lunch\n\n> Sometimes you have an urgent need\n\nand sometimes you have a non-urgent need that is not around lunchtime, and it would be good to have a 15 minute interval between the 9 am and 11 am session in which you can attend to that need. \n\nLike, having small scheduled breaks is a medical necessity for people with all sorts of medical conditions who maybe don't want to disclose their health status to a prospective employer. Somebody isn't a bad person if they didn't realize that; I wrote my comment not to make anybody feel like a bad person, but because I think the needs of people who have said medical conditions need to be considered in this conversation, by whoever is participating in the conversation. Maybe everybody is already considering these needs, but I didn't think there'd be any harm in stating this out loud.",
                              "author": "thegreenaquarium",
                              "created": 1613663210,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gnw4pbe": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnw4pbe/",
                      "text": ">Pre scheduled restroom breaks would be a little odd.\n\nI disagree! Without them, every meeting runs over and then WHOOPS you're being hustled from one place to the next and oh shit! I can't ask to stop at the bathroom now or else I'll be late for \\[meeting with important person\\].",
                      "author": "domesticbeaver2",
                      "created": 1613661117,
                      "upvotes": 4,
                      "replies": {
                        "gnw71tt": {
                          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnw71tt/",
                          "text": "Definitely not saying that you shouldn’t preschedule ANY breaks, but telling someone they can only use the restroom at x time on the schedule is a bit much when we are all adults. I’m not against prescheduled breaks, but if they didn’t give me the opportunity to use the restroom I would take one anyway. That is legitimately not ok to do to a candidate.",
                          "author": null,
                          "created": 1613662195,
                          "upvotes": -1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gnupv89": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnupv89/",
                  "text": "Too many people only think about their time with the candidate (say, in a 1-hr window) and the schedule organizer can forget about bathroom times in their efforts to maneuver the candidate from meeting X to meeting Y.",
                  "author": "herennius",
                  "created": 1613623851,
                  "upvotes": 12,
                  "replies": {
                    "gnwgmor": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnwgmor/",
                      "text": "For ours the candidate gets the schedule ahead of time .  If it looks not doable to you, it is up to you to ask for something different.\n\nLike if you want 3 hrs off that won't work, but if you ask for a 10 or 15 min change that is on you.  \n\nIf you are a TT candidate you are going to have to put some big boy pants on.",
                      "author": "PersephoneIsNotHome",
                      "created": 1613666401,
                      "upvotes": 0,
                      "replies": {
                        "gnwyany": {
                          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnwyany/",
                          "text": "Yeah, not every place does that. Nor does every candidate in a precarious position want to rock the boat.",
                          "author": "herennius",
                          "created": 1613673528,
                          "upvotes": 2,
                          "replies": {
                            "gnx6sab": {
                              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnx6sab/",
                              "text": "Where does a job candidate not get a schedule. You guys go, surprise do a seminar.  Surprise, talk to the chair. Surprise meet with students?",
                              "author": "PersephoneIsNotHome",
                              "created": 1613677015,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gnuhg9k": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuhg9k/",
                  "text": "If there's no pee break and you need to pee, then ask to use the restroom instead of just not peeing.  It's a perfectly normal request!  No need to hold it or be uncomfortable.",
                  "author": "Adultarescence",
                  "created": 1613619217,
                  "upvotes": 25,
                  "replies": {
                    "gnurl1i": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnurl1i/",
                      "text": "Yes, that makes sense. My fear as a Ph.D. student and anxiety though... made me think differently.",
                      "author": "drpicoloco",
                      "created": 1613624867,
                      "upvotes": 10,
                      "replies": {
                        "go0ybps": {
                          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/go0ybps/",
                          "text": "I can understand that. However, you are not a Ph.D. student (even if you are interviewing ABD). You are a future colleague. You are entitled to ask for what you need. Maybe I'm too bold but I am not going to make myself miserable for an interview. I am a human with biological needs.",
                          "author": null,
                          "created": 1613755293,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gnur4oa": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnur4oa/",
                  "text": "We use it to screen for robots 🤖",
                  "author": "Stranger-Sufficient",
                  "created": 1613624590,
                  "upvotes": 10,
                  "replies": {}
                },
                "gnwxrej": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnwxrej/",
                  "text": "A candidate search visit usually involves various people passing a candidate from one person to another throughout the day. Meet with this Dean, meet with this prof, give us a little talk, come to another meeting, have lunch with us, etc. Nobody in there is usually thinking about the \"whole schedule\" and it's usually very packed. (We always try to schedule some \"down time\" for the candidate, but it can be hard to fit it in with everyone else's schedules.)\n\nAdd to it that the candidate is usually quite nervous, eager to please, and not wanting to seem in the slightest difficult or troublesome (much less deviate from the schedule) and you have the recipe for a very uncomfortable candidate if they don't speak up.",
                  "author": "restricteddata",
                  "created": 1613673313,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gnuu6a2": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuu6a2/",
          "text": "One school didn't feed me for over 24 hours and then tried to find out if I had a neuro disorder when my hands started shaking while eating gazpacho--the only food during the entire goddamn process. I know they couldn't know that I left from work, hadn't been able to take a lunch break, and was super surprised to find their town utterly bereft of something so basic as a 24 hour mcdonalds and staying in a hotel with no snack machine. After that I always packed snacks....",
          "author": "phoenix-corn",
          "created": 1613626501,
          "upvotes": 34,
          "replies": {
            "gnuvqbk": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuvqbk/",
              "text": "Yes! Snacks are important.",
              "author": "drpicoloco",
              "created": 1613627530,
              "upvotes": 12,
              "replies": {
                "gnuw2gg": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuw2gg/",
                  "text": "So important, but also I make sure we don't do that to any candidate ever for any reason. We actually have them rent a car to get here from the airport (which was always the rule here) and if I sense somebody is a little put off by that I always tell them my gazpacho story over dinner or lunch. I really learned to appreciate being left a little autonomy on campus visits to check out the local area, get my own food when I get into town, be able to go to the store if I need anything private like immodium or tampons (I have IBS so I'm usually prepare but shit literally sometimes happens). \n\nAnyway, during the no food campus visit when I was dropped off at the airport I was SO EXCITED that Chipotle was open at 9 am for international travelers. It was the best damn burrito of my life, lol, and I'm not usually a Chipotle person.",
                  "author": "phoenix-corn",
                  "created": 1613627758,
                  "upvotes": 17,
                  "replies": {}
                }
              }
            }
          }
        },
        "gnuaqhi": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuaqhi/",
          "text": "You are incredible. There is no way I could go an entire day without at least one restroom break. I’m so glad it worked out for you! :)",
          "author": null,
          "created": 1613615819,
          "upvotes": 10,
          "replies": {
            "gnurn44": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnurn44/",
              "text": "Thanks!",
              "author": "drpicoloco",
              "created": 1613624901,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gnuapjm": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuapjm/",
          "text": "So... what's up with the shoe guy?",
          "author": "failuretobloom",
          "created": 1613615806,
          "upvotes": 16,
          "replies": {
            "gnugp5t": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnugp5t/",
              "text": "I’m so curious what these shoes are all about 😂 I’m invested in this now!",
              "author": null,
              "created": 1613618829,
              "upvotes": 10,
              "replies": {
                "gnur4rd": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnur4rd/",
                  "text": "Yeah, I'm not sure what that was about. He had minimalist running shoes on. I asked him if he was a minimalist runner/zero drop runner and he said no. But he proceeded to talk about the benefits of these types of shoes. I should have brought the conversation back to research... but I didn't 🤷‍♂️.",
                  "author": "drpicoloco",
                  "created": 1613624591,
                  "upvotes": 15,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gnvzx6b": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvzx6b/",
      "text": "The job I have now started out with a breakfast meeting where the faculty member told me he didn't like me or any of the other candidates and didn't think we belonged in the department. He did, however, like the man who interviewed for the other position because he \"looked like a forester\" whereas I didn't. Aka I have a vagina. That guy retired shortly after I started though and things have been great. Try to take those things with a tablespoon of salt. People are just weird.",
      "author": "bugnerd87",
      "created": 1613658817,
      "upvotes": 21,
      "replies": {
        "gnw5raa": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnw5raa/",
          "text": "I’m so glad it ended up working out for you, that’s awesome :)",
          "author": null,
          "created": 1613661605,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gnugxk2": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnugxk2/",
      "text": "Allow me to offer another perspective: the person who was eating likely gave up their lunch break to talk with you. The person in the bathroom likely had to choose between canceling your meeting due to unforeseen circumstances or taking it in the damned bathroom. \n\nBoth of them chose to talk with you.",
      "author": "ccots",
      "created": 1613618949,
      "upvotes": 169,
      "replies": {
        "gnus2va": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnus2va/",
          "text": "This is a great perspective!\n\nBased on OP's last line, I believe the concern is also about the potential double standard on how things might be different if the tables were turned. For example, if OP (or another candidate) was the one eating their sandwich or interviewing from the bathroom. How understanding would the interviewers be in that situation towards their candidates?",
          "author": "SufficientSet",
          "created": 1613625174,
          "upvotes": 57,
          "replies": {
            "gnuxrwe": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuxrwe/",
              "text": "I would be totally understanding and I think most people would.  \n\nWe all just want to find a candidate we want to join our dept. Eating a sandwich or meeting from a bathroom doesn't really changed anything about that judgement",
              "author": "ProfOnTheMove",
              "created": 1613628967,
              "upvotes": 9,
              "replies": {
                "gnv54xw": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnv54xw/",
                  "text": "Unfortunately most committees wouldn’t be ok with it. You and your department sound amazing, which I appreciate! But this sounds more like the exception than the rule.",
                  "author": null,
                  "created": 1613634914,
                  "upvotes": 28,
                  "replies": {}
                }
              }
            }
          }
        },
        "gnuheyt": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuheyt/",
          "text": "I understand. I have a full-time job with a bunch of other responsibilities and I took off the day to spend it talking to them as well. \n\nI definitely appreciate the perspective but it also feels like it’s a sham search in some situations. I also would understand if someone needed to cancel the interview for personal reasons. I also would be fine with cutting the interview short so they could eat lunch. I’m not high-maintenance.",
          "author": null,
          "created": 1613619198,
          "upvotes": 36,
          "replies": {
            "gnujmpa": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnujmpa/",
              "text": "They are choosing a future colleague. And since you’ve made it this far, they are probably excited to talk to you, and don’t want to short-change you on time to make an impression or to assess you fairly for the position. These are strange times, as you say. For everyone. \n\nI’d expect most people would be offended if someone cut their meeting short to go to lunch. \n\nAll that said, if you get bad vibes from your interactions, walking away is always an option.",
              "author": "ccots",
              "created": 1613620363,
              "upvotes": 25,
              "replies": {
                "gnv5co8": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnv5co8/",
                  "text": "I’m not trying to argue. These are very valid points if they are true. But you can tell when people really don’t want to be there and that was the case both of these times. \n\nIt’s not a good sign when the people hiring you have no interest in even listening to your responses to questions or act completely disengaged or work the entire time. I’m not the one who chose the schedule and I was completely accommodating to their time. That’s why I took off work so they could schedule when it was convenient for them. That’s why this feels so fake because I took time off specifically for this and I was willing to accommodate on very short notice. I am understanding and flexible. But there’s definitely no excuse for working throughout an entire interview unless you just don’t care about that person’s time.",
                  "author": null,
                  "created": 1613635107,
                  "upvotes": 15,
                  "replies": {
                    "gnvomtp": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvomtp/",
                      "text": "As you say, definitely not a good sign. If you are convinced - and it sounds like you are - then you can back out of the process and spare yourself the stress.",
                      "author": "ccots",
                      "created": 1613652199,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gnuxuij": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuxuij/",
              "text": "But maybe they don't want to cancel the interview or cut it short because they want to participate in the decision",
              "author": "ProfOnTheMove",
              "created": 1613629022,
              "upvotes": 3,
              "replies": {
                "gnv5gvj": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnv5gvj/",
                  "text": "Absolutely valid if true. In this particular case they were so disengaged in the conversation I would have rather rescheduled for a better time instead of awkwardly trying to make this work.",
                  "author": null,
                  "created": 1613635210,
                  "upvotes": 5,
                  "replies": {
                    "gnvf4o5": {
                      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvf4o5/",
                      "text": "And regardless of that; you're entirely right.\n\nThis \"perspective\" means little once you realise that if an applicant did the equivalent (calling from the bathroom, talking to people whilst in the middle of a call) it would be seen as a horrible faux pas, and would designate you as unprofessional.\nI'm not sure why people on this sub seem so keen on defending these gatekeepers that are clearly rude and unbecoming.",
                      "author": "basinchampagne",
                      "created": 1613644247,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gnvwiev": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvwiev/",
      "text": "Here's the thing, though. **Nobody expects candidates to be perfect.** You're putting that expectation on yourself. Nobody is perfect. No job talk is perfect. No interview is perfect. None. Yes, you do have to compete with 3 other candidates (because we can only hire one even if they're all awesome) and the person on the other side doesn't (because they already have a job), so there **is** an imbalance in general expectations. But, the other 3 candidates aren't going to be perfect either.\n\nA faculty search is choosing a new colleague. All my colleagues are unique. All have idiosyncrasies. The question when interviewing a candidate is not whether they're perfect, but whether this is (a) someone I'm excited about working with for the next at least 6 years, (b) someone I'm ok with for at least the next 6 years, or (c) someone who I can't see being a member of this department. The answer is basically never (c) because we tend to screen those people out in the first round interviews. If you made it to the final interview you are at least in position (b) for most if not all of the department's faculty and you are in position (a) for at least someone influential.",
      "author": "DeskAccepted",
      "created": 1613657022,
      "upvotes": 8,
      "replies": {
        "gnvxsqa": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvxsqa/",
          "text": "I don’t mean that committees literally expect perfection. There is no perfect college, university, department, colleagues, or students. Everything is a tradeoff. \n\nI honestly don’t understand how any of what I said takes away from your points? I don’t think anyone is arguing against them. I’m not. \n\nThe thing about this is the balance of power is so unfair in some situations that committees don’t even extend basic respect to the candidate. And that is a major problem.\n\nWe also have to ask ourselves the question, do I want to work with these people for 6 years? Do I want to work with someone who doesn’t even have time for a 30-40 minute conversation with me when they are allegedly supposed to at least make an effort? Do I want to work in a department that is so busy that the search tanks everyone to the point of ignoring that the candidate is checking for fit too?",
          "author": null,
          "created": 1613657719,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gnuav63": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnuav63/",
      "text": "Isn’t this always the interview strategy (one plays overly aggressive, another distracted, another the questioner...)? Now it’s just even more surreal because it’s filtered though video chat. \n\nBest of luck and hopefully some of your interviews aren’t so absurd.",
      "author": "masstransience",
      "created": 1613615884,
      "upvotes": 18,
      "replies": {
        "gnudd4j": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnudd4j/",
          "text": "Wait, is this how I'm supposed to interview candidates? Nobody told me which role I should play. Dammit I've just been sincere this whole time and I've probably confused a lot of candidates. :)",
          "author": "tenodera",
          "created": 1613617126,
          "upvotes": 48,
          "replies": {
            "gnufs7l": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnufs7l/",
              "text": "I must have missed the memo too. I just try and figure out if they are cool people to have working down the corridor for thirty years.",
              "author": "ccots",
              "created": 1613618359,
              "upvotes": 21,
              "replies": {
                "gnug25n": {
                  "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnug25n/",
                  "text": "It is so hard to do this over Zoom. For both parties. :( I feel like I’m talking to a wall. I know it’s also really hard for the search committee to see if we are a good fit too. Virtual campus visits are not ideal.",
                  "author": null,
                  "created": 1613618500,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "gnubmrv": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnubmrv/",
          "text": "Thank you! You’re probably right, it just seems so much more bizarre and almost cartoonish over Zoom. \n\nFor example if he had been eating like that (in person) when we actually were in the middle of a lunch interview, it wouldn’t be AS weird. But over Zoom made it hilariously strange. I just have to laugh!",
          "author": null,
          "created": 1613616260,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "gnvo2q0": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvo2q0/",
      "text": "I’ve also have weird zoom (long) interviews. Distracted folks, talking to family, weird locations, Interrupting my answer to a question to leave and take care of food they were cooking in the kitchen, someone in pajamas. From my perspective, working from home is hard, I get it. Then I found out later they already had another candidate in mind. Guess how that made me feel.",
      "author": "zabulon_",
      "created": 1613651807,
      "upvotes": 3,
      "replies": {
        "gnvyvx1": {
          "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnvyvx1/",
          "text": "That’s exactly how I perceived this to be my situation. They put no effort in because they already had a candidate. I’m sorry you had to go through this too. :(",
          "author": null,
          "created": 1613658288,
          "upvotes": 2,
          "replies": {
            "go020m4": {
              "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/go020m4/",
              "text": "Faculty interviews are terrible and soul crushing. I can’t wait for this to be over.",
              "author": "zabulon_",
              "created": 1613739273,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gnw79qc": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnw79qc/",
      "text": "Before covid hit I had an in-person interview with one committee member skyping in while asleep, in their bed.",
      "author": "Here4plantID",
      "created": 1613662293,
      "upvotes": 3,
      "replies": {}
    },
    "gnwhr01": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnwhr01/",
      "text": ">I just have to vent because candidates are expected to be perfect and then this weird stuff happens...\n\nCandidates are proving they are more worthy of being hired than the other applicants and are getting a job out of it , potentially.\n\nIn contrast , I spend X amount of time to vet you, and often not at my convenience .  This is one of the more labor intensive  of the committees.\n\nI had to interview someone from a closet beause my university lost power by my house didn't and we didn't want to make the candidate reschedule. \n\n\nSome of the people in the interview are there for the express purpose of taking notes, which would be done on the computer typically.\n\nNot sure that someone eating lunch is weird",
      "author": "PersephoneIsNotHome",
      "created": 1613666874,
      "upvotes": 3,
      "replies": {}
    },
    "go1lf76": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/go1lf76/",
      "text": "What's with the audio only zoom calls? I feel like I'm in a dark room with a lamp over me with some indistinguishable person hurling questions at me.",
      "author": "zombie_barbarossa",
      "created": 1613765580,
      "upvotes": 3,
      "replies": {}
    },
    "gnwxidj": {
      "link": "/r/AskAcademia/comments/lmb526/vent_in_this_episode_of_weird_things_that_happen/gnwxidj/",
      "text": "FWIW, eating lunch through the interview happens for in person ones as well",
      "author": "redredtior",
      "created": 1613673219,
      "upvotes": 2,
      "replies": {}
    }
  }
}