{
  "sid": "ovmab4",
  "link": "/r/AskAcademia/comments/ovmab4/is_applying_to_top_us_phd_programs_without_a/",
  "title:": "Is applying to top US PhD programs without a masters a waste of time?",
  "text": "I’m in Canada and Ill be applying for PhD public health sciences/epidemiology in the US. I have 2 third author publications, a few years as an unpaid research assistant for a med student, and a summer of paid research working in a professors lab. But if I want to get into a great school, will my application be seriously considered if I don’t have a masters? I know it’s not required but I’m trying to get an understanding of my chances.",
  "author": "Available_Reserve_77",
  "created": 1627794981,
  "updated": 1634082379,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "h7avwjp": {
      "link": "/r/AskAcademia/comments/ovmab4/is_applying_to_top_us_phd_programs_without_a/h7avwjp/",
      "text": "While I am not in epidemiology, I would say that it is not a waste of time. The vast majority of people that I know from my program (biomedical science) did not have a masters. However, if you want to get into an ivy league program, then you might need to get one to really stand out (assuming you do really well), but I would still apply without and see what happens.",
      "author": "kirby726",
      "created": 1627816241,
      "upvotes": 5,
      "replies": {}
    },
    "h7aqp1x": {
      "link": "/r/AskAcademia/comments/ovmab4/is_applying_to_top_us_phd_programs_without_a/h7aqp1x/",
      "text": "If you also have great undergrad marks, then it sounds like you can make a very compelling application without a master's. But this is not my field so I can't be any more specific.",
      "author": "Vievite",
      "created": 1627811670,
      "upvotes": 3,
      "replies": {}
    },
    "h7bf6be": {
      "link": "/r/AskAcademia/comments/ovmab4/is_applying_to_top_us_phd_programs_without_a/h7bf6be/",
      "text": "It's going to vary by degree field, institution, and even individual PI preference. There's no way for us to tell.",
      "author": "r3dl3g",
      "created": 1627828350,
      "upvotes": 0,
      "replies": {}
    }
  }
}