{
  "sid": "hyhks6",
  "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/",
  "title:": "Are Coursera and edX certificates worth paying for?",
  "text": "I have a Master's degree in Criminal Justice and am pursuing a second in Psychology, with the eventual intent of getting a Ph.D. in CJ. That said, in my spare time, I like to audit Coursera and edX classes to learn for learning's sake (it's fun). I usually take courses unrelated to my major, such as in medieval studies or writing. I noticed today that certificates for the classes are only $49 in some cases, or similar.\n\nI know MOOCs aren't as \"prestigious\" as, say, a university, but I find no discernible difference in the quality of instruction and materials than in my brick and mortar and online graduate-level courses. In some cases, the instruction is better.\n\nDo you think getting these certificates would be worthwhile? If I got some, would they be worth putting on a CV? I'm sure they wouldn't, but if I could just keep taking classes in anything forever, I would. I find structured learning a lot more enjoyable than reading on my own.\n\nThank you!\n\nUpdate: also, is there any value in taking the courses they offer related to data science, R, and Python if you intend to be a researcher?",
  "author": "MotherHolle",
  "created": 1595807652,
  "updated": 1634081865,
  "over_18": false,
  "upvotes": 106,
  "upvote_ratio": 0.95,
  "comments": {
    "fzd2yjx": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzd2yjx/",
      "text": "Depends entirely on what you intend to do with them. I know many small schools in developing countries that allow students to take those classes and apply the certificates towards progress in their degrees (quite a cost-effective solution for the schools if you think about it). On the flip side, I know some professionals that get the certificates in the hope of changing careers, with the certificates acting as a gatekeeper to jobs in startups, for example.\n\nI'd say that once you have a PhD however, virtually nobody cares what classes you took (and you should be careful about those that do). A PhD implies that you are trained to be an independent scholar and, within reason, you can teach yourself anything that you need to learn. You don't need a certificate to prove that, your PhD does it. And you should not be listing coursework on a CV, in general.\n\nAs an aside, when I was a grad student, $49 to me was actually \"lunch and probably dinner for a whole week!\" lol. Naturally your circumstances might be different, but if you're going to be the typical graduate student, you'll probably want to save every dollar.\n\nEdit: In reply to your edit, depends again if you plan to use those tools for research. I know people in the social sciences that have found Python and R useful, but it was a niche research area.",
      "author": null,
      "created": 1595815452,
      "upvotes": 77,
      "replies": {
        "fzdhj07": {
          "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdhj07/",
          "text": "Yeah, if I was reviewing a CV and was looking for a particular skill, I'd view \"Audited Course X\" as exactly equivalent to \"Paid for a certificate in course X\", but I'd probably just put it under a \"Applicable Skills\" myself.",
          "author": "rlrl",
          "created": 1595825117,
          "upvotes": 19,
          "replies": {}
        },
        "fzeeg7f": {
          "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzeeg7f/",
          "text": "PhDs can learn anything *except* how to teach online courses according to my university.",
          "author": "Manidest",
          "created": 1595854871,
          "upvotes": 12,
          "replies": {}
        },
        "fzfo99j": {
          "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzfo99j/",
          "text": "> A PhD implies that you are trained to be an independent scholar and, within reason, you can teach yourself anything that you need to learn\n\nHonestly, I think even a Masters shows this, at least in terms of the type of learning you do in a Coursera or edX MOOC.",
          "author": "ProbabilisticWorld",
          "created": 1595877790,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "fzd9ksi": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzd9ksi/",
      "text": "If you need the specific credentials, maybe. For example, I was a lab tech applying for a PhD in informatics even though I took no programming classes in undergrad. I took a bunch of programming classes on Coursera, and I think having those helped me get in to grad school. Without that, I had no evidence that I really knew how to program.\n\nOne person mentioned in my interview that he seeks out people who can teach themselves, so he actually valued the Coursera stuff especially. He saw my time as a tech in research + study on Coursera as a \"self-masters.\"",
      "author": "myristicae",
      "created": 1595819581,
      "upvotes": 36,
      "replies": {
        "fzdg3o5": {
          "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdg3o5/",
          "text": "Bro, I'm verry happy knowing your story. I'm doing Coursera's and Edx's courses because of what u told, assuming they count that \"skill\". So now im more motivated than ever haha.",
          "author": "Aguiberg",
          "created": 1595824054,
          "upvotes": 11,
          "replies": {
            "fzjg0xl": {
              "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzjg0xl/",
              "text": "Thanks! I wouldn't expect my experience to be the norm, though. If you're trying to get into a specific program, you may want to contact them to see how they view it.",
              "author": "myristicae",
              "created": 1595962011,
              "upvotes": 3,
              "replies": {
                "fzl3bc6": {
                  "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzl3bc6/",
                  "text": "Ooh hahaha. Actually, I have no idea what program and university should I take. I just want to be doing social science research in my future and as I know, Phd's are the path.\n\n(And I am REALLY lost looking univeristies and programs, literally I'm only googling \"phd computational social science\" lmao)",
                  "author": "Aguiberg",
                  "created": 1595993224,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fzd36nd": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzd36nd/",
      "text": "If I’m not wrong, Coursera currently offers 1 free course (with certificate). If you are currently a university student (post-grad), you may want to check out if your institution has sponsored Coursera courses (meaning you can take unlimited courses for free, with certificates after completion of the MOOC courses). Just sign in with your institution email and check. \nEdx courses are usually pretty pricey, so I’ve only audited them. I guess what’s more important is the learning experience, and whether you can apply these concepts to your future works. I feel that building your personal projects would be a better testament of your abilities than just certificates.\nIf you feel that getting a certificate can beef up your portfolio, and is useful/relevant for your future career, then perhaps you should!\nCheers!",
      "author": "curlybulat",
      "created": 1595815591,
      "upvotes": 15,
      "replies": {}
    },
    "fzd3c0u": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzd3c0u/",
      "text": "I don’t think so especially as it relates to getting a PhD (I’m a PhD student). But nothing wrong with continual learning.",
      "author": "wh0datnati0n",
      "created": 1595815684,
      "upvotes": 13,
      "replies": {
        "g0ttwqj": {
          "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/g0ttwqj/",
          "text": "Jobs don't care for degrees anymore. They want to know if you can do the work. Unless the job requires one for insurance reasons but I'm sure that will all change in this new world we are living in",
          "author": "texasbredmj",
          "created": 1596922325,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzd8ull": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzd8ull/",
      "text": "why not try for professional development certificates directly through the institution? it's more money but honestly i feel better about it. i'm doing one from cornell on data visualization. and a 3 day certificate from harvard continuing education on behavioral decision making in the falll",
      "author": "Sea_Explorer2743",
      "created": 1595819112,
      "upvotes": 12,
      "replies": {}
    },
    "fzd2ce0": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzd2ce0/",
      "text": "dont think so unfortunately",
      "author": "lochnessa_",
      "created": 1595815076,
      "upvotes": 38,
      "replies": {}
    },
    "fzdqocw": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdqocw/",
      "text": "[deleted]",
      "author": null,
      "created": 1595832842,
      "upvotes": 20,
      "replies": {
        "fzf1aae": {
          "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzf1aae/",
          "text": "How did you list them on your resume? Did you say \"I took this course and passed\" or something like that? Did you get a certificate from the course?",
          "author": "I_got_many_questions",
          "created": 1595866921,
          "upvotes": 2,
          "replies": {
            "fzhqylv": {
              "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzhqylv/",
              "text": "[deleted]",
              "author": null,
              "created": 1595922922,
              "upvotes": 1,
              "replies": {
                "fzj1k5i": {
                  "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzj1k5i/",
                  "text": "I see. Thank you for your response. Yeah I do think that nowadays you have to pay for a certificate though, kind of a bummer.",
                  "author": "I_got_many_questions",
                  "created": 1595955170,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fziua9o": {
          "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fziua9o/",
          "text": "[deleted]",
          "author": null,
          "created": 1595951643,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fze5lrc": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fze5lrc/",
      "text": "If you want to show that you know how to do data science, R, Python, etc then this is better done by having a small project that you did on github rather than a MOOC. You might take the MOOC to learn enough to do the project but it is the actual public code that matters.\n\nHaving coding experience is often valued, so if you have it then show it.",
      "author": "DevFRus",
      "created": 1595847888,
      "upvotes": 8,
      "replies": {}
    },
    "fze3329": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fze3329/",
      "text": "I’ve done some advanced language certificates on both platforms. They’ve been useful trying to get a job in Europe as an American.",
      "author": "dewitt72",
      "created": 1595845417,
      "upvotes": 5,
      "replies": {}
    },
    "fzdezj2": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdezj2/",
      "text": "I’d say no too. If you hope those certs help you stand out, I think emphasising those in ur CV and Cover Letter is enough because that really shows motivation. You can also list it on LinkedIn cuz I’ve seen professionals do that. EdX courses are really great and legit - I’m surprised with the quality considering  that most people probably audited the courses. Maybe focus on EdX first.",
      "author": "nixeij",
      "created": 1595823242,
      "upvotes": 7,
      "replies": {}
    },
    "fzdzfjk": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdzfjk/",
      "text": "I had coursera certificates on my linkedin when I first started the PhD. I only had the ones from good institutions and that were relevant for my career. Other (more mature) PhDs told me they made me look even more inexperienced.",
      "author": "sollinatri",
      "created": 1595841651,
      "upvotes": 4,
      "replies": {}
    },
    "fzeidk0": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzeidk0/",
      "text": "Not in your field, but if I were on a hiring committee and saw Coursera or EdX under a \"related professional development\" type heading on a CV, I'd be positively disposed, especially if it were a specific skill, like teaching online, or data visualization. To me, it shows you're curious and interested in growth, challenges, etc.",
      "author": "plentypk",
      "created": 1595857231,
      "upvotes": 6,
      "replies": {}
    },
    "fzdkqen": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdkqen/",
      "text": "To your update: Sure!  They can be a great way to learn skills and they help you set a schedule you have to keep.  But you dont need to.  You could just start working on your project with some python, watch youtube videos, and kinda spaghetti code your thing together.  Less time on random projects they course sets and more time on your own data.  Whatever helps you learn the skills and apply them to your own work as fast as possible.",
      "author": "bjos144",
      "created": 1595827622,
      "upvotes": 3,
      "replies": {}
    },
    "fzdo212": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdo212/",
      "text": "In my experience, a certificate or not hasn't made a difference, though I have used/mentioned them in certain circumstances to show that I've completed them. They're not on my CV by default or anything but I could imagine a lot of circumstances where they might come up. On a personal note many of them are also just useful and relatively easy/free ways to upskill.",
      "author": "Jacqland",
      "created": 1595830431,
      "upvotes": 3,
      "replies": {}
    },
    "fzedimf": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzedimf/",
      "text": "So I would actually recommend [DataCamp](https://www.datacamp.com/) over Coursera or edx. I've used all 3 platforms, and I prefer DataCamp. I've become much more proficient at data processing and visualization. I really like their course structure and the in-browser coding environment.\n\nLike many other responses here, if you're getting a PhD you don't need to 'prove' your proficiencies using a certificate. DataCamp does have those, but it's more of a subscription service. I would say that learning how to process data is critical for researchers, no matter what field you are in.",
      "author": "SpetsnazCyclist",
      "created": 1595854245,
      "upvotes": 3,
      "replies": {}
    },
    "fzft06s": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzft06s/",
      "text": "Within academia, especially in pursuit of a PhD, these courses have no value. This is because **there is no nationally recognized, outside governing body that defines, oversees, and periodically reviews** the qualifications of the instructors/students, the content covered, the standards of instruction, the evaluative procedures, the outcomes of such programs, etc. \n\nThe second reason they have no value is because **you essentially get a certificate as long as you pay for it.** (That's also why for-profit \"universities\" are predatory and remain unaccredited.) This is why universities don't generally accept them through credit transfers. But these sites state upfront that their courses don't qualify.\n\nBut, regarding your specific update, since programming is a specific skill set meant to ***complement*** your formal studies in criminal justice, then yes, listing it under \"applicable skills\" or \"professional development\" is fine. In that case, I agree with /u/myristicae\n\nTaking these courses to show your investment in a very clear-cut, limited **skill** (i.e. a specific  programming language like Python) is very different than asking if these courses demonstrate or prove facility within a larger and complex discipline (i.e. Physics, Philosophy, Anthropology, Computer Science, literally any research field).\n\nOn the surface, the distinction between online and in-person education seems like it's about prestige, but it's actually about having secure internal and external mechanisms that regulate and maintain specific standards for each discipline. This ensures that our research is actually rigorous enough to produce new knowledge. (But having standards doesn't excuse all the elitism built into academia.) I also think it's easier to understand this distinction if you've had experienced teaching in both contexts. It's seriously night and day.\n\nOutside of academia, listing a few relevant courses on a resume may demonstrate diligence, curiosity, etc.\n\nHope this helps!",
      "author": "synthesis-synthesis",
      "created": 1595880007,
      "upvotes": 3,
      "replies": {}
    },
    "fzdgg0f": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdgg0f/",
      "text": "As much as people say it's not worth it, I personally enjoy to. I mean, it's like maximum $100 for a certificate that you get to display on your LinkedIn profile. Obviously, this is under the assumption that you can afford that. If not then there are a lot of great free options available (e.g., Stanford, MIT, CMU courses on YouTube).\n\nRegarding being a researcher, asking if these are worth taking to be a researcher is like asking does it help to lift weights to become a better basketball player? There is obvious value since if you're doing research you're going to be needing these tools, and the better you are at them the better your research will be (\"better\" in the sense that it'll be more efficient, not higher quality). I'm a MSCS student right now doing ML research, and people at my lab do study group sessions for those courses all the time.",
      "author": "Seankala",
      "created": 1595824304,
      "upvotes": 3,
      "replies": {}
    },
    "fzdx3t2": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdx3t2/",
      "text": "Nothing earned outside the university system will be taken seriously inside a university. There is no formal assessment of the teaching or awarding processes. For all anyone knows, you can get a certificate from Coursera just by logging in enough times. In very rare cases where a university has an official policy recognizing one of these, none of the academic staff will take them seriously.",
      "author": "IrishShaman1",
      "created": 1595839230,
      "upvotes": 2,
      "replies": {
        "fzf1srp": {
          "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzf1srp/",
          "text": "Not sure about STEM.. Many universities now provide free access to entire Coursera catalog for free and even has option to earn credits (my university has one).  Covid19 will certainly accelerate this trend towards online learning.",
          "author": "Conscious-Elk",
          "created": 1595867166,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzdxwlx": {
      "link": "/r/AskAcademia/comments/hyhks6/are_coursera_and_edx_certificates_worth_paying_for/fzdxwlx/",
      "text": "I’m getting one right now and I think it’s worth it. It’s so helpful to learn more without paying thousands and technically get a cert from a good school",
      "author": "margopolo95",
      "created": 1595840069,
      "upvotes": 1,
      "replies": {}
    }
  }
}