{
  "sid": "oujs6i",
  "link": "/r/AskAcademia/comments/oujs6i/what_are_the_prospective_positions_one_can_try/",
  "title:": "What are the prospective positions one can try for research experience in astronomy before starting PhD? Are RA positions or longer internships common in Astronomy?",
  "text": "I am from India and will be graduating with my Master's in Physics next year. I want to apply for PhD in Astronomy abroad. I am trying to consider all options before I make a decision. I was contemplating taking a year break before PhD so that I can get some rest and work through the consequences of the pandemic on my mental health. But I would like to gain relevant experience instead of doing something unrelated.\n\nI need advice on research assistant positions. Due to the pandemic, most summer internships were online. I do have some relevant research experience but it would be good to gain more experience if I decide to take a break. I was wondering if I professors are open to longer internships. Maybe 6 months or 8-10 months. Will cold emailing help? What are some other things I could try?\n\nEdit: Not sure why someone down voted. I was really hoping for help and insight. Who else to ask than people with experience in academia?",
  "author": "mcfrazzled",
  "created": 1627648653,
  "updated": 1634082390,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "h77vi6q": {
      "link": "/r/AskAcademia/comments/oujs6i/what_are_the_prospective_positions_one_can_try/h77vi6q/",
      "text": "(I'm not in astronomy specifically, but I'm in a related physics field and have had several astro friends and colleagues over the years)\n\nIn the U.S. astro/physics field at least, it's not too uncommon in to get an RA position lasting 6-12 months without being an enrolled PhD student. I've known several people who have done this during their \"gap year\" between BS and PhD (MS is less common in the U.S.). The availability of this option depends on the university's bureaucracy structure and the PI's funding situation.\n\nCold emailing will be the way to find this kind of position, but you will have to be very careful in constructing those emails. Professors get inquiries like this every single day, and generally only have time to read and respond to the messages that are very concise and show real interest in working hard and engaging with the research topic. They see right through the typical form message that just lists the names of some of their papers. So put time into reading each professor's work before writing to them and try to identify the procedures and topics that sound most interesting to you.\n\nFinally, to your fundamental question: a long-term RA lasting >6 months is generally much more preferable to a PI than a short-term RA. That will give the PI time to actually teach you things *and* help you through analyzing results! So make sure to mention in your inquiries that you are looking for a 6-10 month position, that will help.",
      "author": "pb-pretzels",
      "created": 1627749927,
      "upvotes": 2,
      "replies": {
        "h7agx0r": {
          "link": "/r/AskAcademia/comments/oujs6i/what_are_the_prospective_positions_one_can_try/h7agx0r/",
          "text": "Thank you for your response! This helps a lot. I was wondering how being an international student could affect this. I am willing to work remotely as well. \n\nAlso, when would be the right time to mail? I guess it's too early to mail now when I might start in June-July? If you could help me connect with anyone in the filed to ask doubts, I'd be very grateful. Thanks a lot!",
          "author": "mcfrazzled",
          "created": 1627802907,
          "upvotes": 1,
          "replies": {
            "h7bt2fh": {
              "link": "/r/AskAcademia/comments/oujs6i/what_are_the_prospective_positions_one_can_try/h7bt2fh/",
              "text": "Truthfully, I too don't know how being an international student will affect things, especially if you have to stay in India for now. Most PIs will not care if you are doing research remotely as long as you communicate well, but different universities have different rules about whether they can pay you while you're working in another country.\n\nFor starting next June/July, right now is likely a bit early. Most PIs will have too many variables in their funding/time situation to say if they can take on a student 1 year from now. The best time to write might be early December -- ideally between when classes and Christmas time (after holidays is prep time for the winter AAS meeting, so too busy). \n\nDecember will still be too early for many to know their funding/time situation for June, but it's not so far in advance that they'll skip reading your message. If they're interested in your profile and just don't know if they'll have the money/time, they'll tell you to write again in April/May. Which is good! Now your second message in the spring won't be quite as tough as true cold-calling.",
              "author": "pb-pretzels",
              "created": 1627834832,
              "upvotes": 2,
              "replies": {
                "h7e2x1g": {
                  "link": "/r/AskAcademia/comments/oujs6i/what_are_the_prospective_positions_one_can_try/h7e2x1g/",
                  "text": "Thank you for your insight. This helps a lot!",
                  "author": "mcfrazzled",
                  "created": 1627875883,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}