{
  "sid": "ne4yc7",
  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/",
  "title:": "Anyone feel like they are left out of research work because you are not in the clique?",
  "text": "I work in an academic research institute where everyone has some type of STEM PhD.  I am typically the \"get shit done person\" (engineering), but left out of the initial decision making process when grants are written because Im not mathy / physicsy enough.  Normally not a concern for me, but projects end up being a cluster because the grants are based in theory and implementation is somewhat of an after thought.  Additionally, coworkers speak a lot of jargin and/or highly specific language which I am not versed in and eyes get rolled whenever I try to offer constructive criticism.   Best analogy I can give is a restaurant owner giving a chef a bunch of tv dinners and telling him to make Michelin star quality food.   Just venting I suppose...Anyone else have similar experiences?",
  "author": "meowcat187",
  "created": 1621220232,
  "updated": 1634080680,
  "over_18": false,
  "upvotes": 205,
  "upvote_ratio": 0.95,
  "comments": {
    "gyevslp": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyevslp/",
      "text": "Im a chemist working with biologists. So i kinda know how you feel. My advice is to learn their jargon. Afterall.. you are in research. In research because it is in the cutting edge, it would be a disservice to yourself if you keep yourself to a bottle \"engineer\". You are a scientist. Period. To be relevant, you need to understand their theories and provide them that link if they cant provide that link to you. Build the bridge. Explain to them the limitations of certain theories in application science. Then brainstorm. :) you can do it. And believe me.. when you show you are useful to them..youd be flooded with meetings of people wanting to hear your opinion on things.",
      "author": "Anneeye",
      "created": 1621229624,
      "upvotes": 95,
      "replies": {
        "gyfspjp": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfspjp/",
          "text": ">understand their theories \n\nThats one issue Ive been dealing with.  I will ask them to explain it, but I get a jargin filled explanation, or an explanation that someone in their particular field would know.  \n\n\"No, I dont know what a florbin-dur hypercube decomposition algorithm is, can you explain it?\"\n\n\"Sure, you just take a weasel-doo updunk search algorithm and modify the bounds.\"\n\n\"Well whats a weasel-doo updunk?\"\n\n\"Well its a core-competency everyone should know, I can give you a text book to read.\" (with an eye roll)\n\nEtc.",
          "author": "meowcat187",
          "created": 1621255285,
          "upvotes": 22,
          "replies": {
            "gyfwab1": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfwab1/",
              "text": "TBH, most people who can’t explain this without using a little less jargon don’t really know what they are talking about.\n\nThe onus is on both sides to communicate.\n\nIt is not reasonable for you to get a PHD in that field, nor them to get an engineering degree, that is why there are 2 of you.",
              "author": "PersephoneIsNotHome",
              "created": 1621257245,
              "upvotes": 45,
              "replies": {
                "gyfxj2a": {
                  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfxj2a/",
                  "text": "Didn't Richard Feynman say something about this, like if you can't explain it in simple terms anyone can understand, then you don't understand it yourself?",
                  "author": "tonydid",
                  "created": 1621257885,
                  "upvotes": 18,
                  "replies": {
                    "gyg1qtz": {
                      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyg1qtz/",
                      "text": "Lots of people have that quote attributed to them.\n\nIf you cant explain what you are doing to a credentialed colleague who is trying to understand it, then you are not explaining it well.\n\nIf you are at a scheduled meeting and there is limited time, you speak with that other critical human  some other time so that the project moves forward efficiently and effectively",
                      "author": "PersephoneIsNotHome",
                      "created": 1621259926,
                      "upvotes": 15,
                      "replies": {}
                    }
                  }
                },
                "gyfyged": {
                  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfyged/",
                  "text": ">It is not reasonable for you to get a PHD in that field, nor them to get an engineering degree, that is why there are 2 of you.\n\nWell said.",
                  "author": "meowcat187",
                  "created": 1621258356,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "gyfuoh4": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfuoh4/",
              "text": "This gave me a good laugh",
              "author": "BoJacob",
              "created": 1621256384,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gyenf5s": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyenf5s/",
      "text": "Doesn’t sound like good colleagues. If you’ve worked there long enough, might be time for a change",
      "author": "docdany",
      "created": 1621224093,
      "upvotes": 74,
      "replies": {
        "gyfhmuo": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfhmuo/",
          "text": "Some of them are good, but it's very predatory at the top I feel.  If I want to get my own projects and have a better team, I have to become predatory to get the $$.",
          "author": "meowcat187",
          "created": 1621247778,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "gyesrxo": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyesrxo/",
      "text": "[deleted]",
      "author": null,
      "created": 1621227523,
      "upvotes": 23,
      "replies": {
        "gyfkb8a": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfkb8a/",
          "text": "Everyone is equal pretty much.  We have to form teams to get grants, so you pick and choose who you work with based on the grant.",
          "author": "meowcat187",
          "created": 1621249817,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gyers1d": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyers1d/",
      "text": "10000000%. there’s an old guard that’s all about gatekeeping, and they act like assholes because they can. The good news is you have a lot more control over your career than you think. Dont worry about these kinds of people and just keep doing you. Eventually you’ll find people like yourself with similar interests. I’ve worked with a lot more people internationally than I have within the states. Fuck em.",
      "author": "yourmomdotbiz",
      "created": 1621226844,
      "upvotes": 19,
      "replies": {
        "gyg51vu": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyg51vu/",
          "text": "Same here. I have a shadow network of enthusiastic and competent people all over the world.",
          "author": "radionul",
          "created": 1621261417,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gyex3r6": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyex3r6/",
      "text": "It is not clear if you have a PhD or not but this part stood out a bit:\n\n> but left out of the initial decision making process when grants are written because Im not mathy / physicsy enough\n\nIf you don't have a PhD, why would you be part of the decision making process? Surely you can contribute like hundreds of grad students do when their advisors ask them to write up a proposal but the decision making solely rests with PIs and Co-PIs, both of whom need to have terminal degrees.\n\nSorry but that's how it is. PIs and Co-PIs are primarily responsible for achieving whatever goals they say the grant is supposed to work towards. You are absolutely right in that there are pragmatic issues or constructive criticism that can be raised during the brainstorming/writing process but for many researchers that is the \"application\" phase and not the pure exploratory phase where a lot of work is honestly improvisational and has to be left a bit vague for room to maneuver during actual research.\n\nIf you already have a PhD then ignore everything. Sorry your colleagues are shitheads. Maybe you can talk to your group manager?\n\n> highly specific language which I am not versed in\n\nAgain, this is a \"you\" problem. Depending on how long you've been at the institute, this should not be a hurdle whatsoever. If you've joined within the past year, that's ok, you can work towards addressing this. But then that would also explain why you're left out of the grant writing process. It takes time to demonstrate expertise when it comes to writing a grant which is already a stressful process for everyone involved.\n\nYou can entertain all sorts of pithy, anecdotal comments like \"Jargon is big in the USA\" and that \"people overstate what they're doing\" but jargon is useful because if everyone has the same starting point, you can get ideas across very easily and context is already established. I'm not saying that people who intentionally obfuscate their work don't exist, but you can't assume that a majority of people who speak using terms particular to their area of research are doing it intentionally.\n\nEdit: pasting my same comment below on \"big names getting grants and not worrying about details\"\n\nIts not exactly unique to academia...\n\nThat's why you have CEOs and Directors and so on. Someone has to focus on the big picture and not get bogged down by details. Someone else has to worry about the details and not let details derail the long term goal. Unfortunately, one of those roles is not as attractive as the other. That's life.",
      "author": "awhead",
      "created": 1621230575,
      "upvotes": 39,
      "replies": {
        "gyfjb61": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfjb61/",
          "text": "Have a PhD and a lot of experience, which causes me to be more pragmatic and less idealistic.  However, I appreciate everything you are saying.  And yes, it is totally a me problem.  I have a really hard time overselling and speaking the lingo.  I've brought this up to one of my colleagues who is particularly good at getting grants and always speaks in jargin/big words all the time. This particular colleague says flat out it's a coping mechanism to get by.  Colleague is also very hands off on project execution and doesn't understand a lot of the day to day.  But boy does he have grant $$ flowing out of his ears.  \n\nIs this how it is everywhere?",
          "author": "meowcat187",
          "created": 1621249064,
          "upvotes": 11,
          "replies": {
            "gyger6u": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyger6u/",
              "text": "Yes, it’s like this all over. Big names bring in big grants based on vague promises, and leave the actual work and implementation to students and postdocs.\n\nFor the Big Name, it’s about using the right terms to get the right grants. That’s their skill set. They don’t have room in their heads for what comes later.",
              "author": "Greenmantle22",
              "created": 1621265569,
              "upvotes": 4,
              "replies": {
                "gyh4jr6": {
                  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyh4jr6/",
                  "text": ">For the Big Name, it’s about using the right terms to get the right grants. That’s their skill set. They don’t have room in their heads for what comes later.\n\nLaughing out load for real at that.",
                  "author": "meowcat187",
                  "created": 1621276206,
                  "upvotes": 2,
                  "replies": {
                    "gyh4rgs": {
                      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyh4rgs/",
                      "text": "It's a genuine issue. Learning how to write good grants is a skillset all its own, and even smart people can forget things they don't use in a while as new information pushes the old stuff out of their brain. \n\nLike when you take a home wine-making class, and forget how to drive. Or maybe that was because you were drunk.",
                      "author": "Greenmantle22",
                      "created": 1621276297,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "gyhh2nu": {
                      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyhh2nu/",
                      "text": "Its not exactly unique to academia...\n\nThat's why you have CEOs and Directors and so on. Someone has to focus on the big picture and not get bogged down by details. Someone else has to worry about the details and not let details derail the long term goal. Unfortunately, one of those roles is not as attractive as the other.",
                      "author": "awhead",
                      "created": 1621281462,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gyemdlr": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyemdlr/",
      "text": "Jargon is big in USA, I’ve heard, where talk is valued very highly and people overstate what they’ve done or what they’re doing.",
      "author": "ImeldasManolos",
      "created": 1621223599,
      "upvotes": 42,
      "replies": {
        "gyfcrkl": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfcrkl/",
          "text": "It's also big in every technical field.\n\nPartially for the reasons you've said, and partially because e.g. if you work in cell biology you need to know what transcription is, and people don't have time to go round explaining every standard concept like they're talking to an intelligent person that's never worked in this field before.",
          "author": "DoorsofPerceptron",
          "created": 1621243594,
          "upvotes": 23,
          "replies": {
            "gyfwpb0": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfwpb0/",
              "text": "Nor do you need to.  You want to test how the brain looks in an MRI when you did something to it, you tell me what you did.  We made less of this receptor ina specific cell type.  We think it is going to make some regions more excitable and some less.  Dont start with your breeding protocol and how you made the conditional KO.",
              "author": "PersephoneIsNotHome",
              "created": 1621257466,
              "upvotes": 3,
              "replies": {
                "gyfycl4": {
                  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfycl4/",
                  "text": ">We think it is going to make some regions more excitable and some less\n\nThat's difficult to say if you can't use the names of the regions.\n\nThere's a reason for the existence of the jargon. Just not talking to people about the less relevant areas of what you're doing will only take you so far.",
                  "author": "DoorsofPerceptron",
                  "created": 1621258302,
                  "upvotes": 6,
                  "replies": {
                    "gyg2axc": {
                      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyg2axc/",
                      "text": "FIne, but that is where you start.  And actually for MRI sometime the anatomical regions do not behave as functional groups,  But when I explain the data to you, I don’t start with what a Fourier analysis is.\n\nBTW, I don’t do MRI, it was just an example.\n\nYou can say, this here is where the visual info first enters the brain, and this here is where it is relayed to the control center, and this here is where you figure out if it is nice or nasty.\n\nThen you can start labeling things.\n\nReally for people who have a primary job responsibility of teaching, this should not be an impossible ask.",
                      "author": "PersephoneIsNotHome",
                      "created": 1621260186,
                      "upvotes": 1,
                      "replies": {
                        "gyg9038": {
                          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyg9038/",
                          "text": "Yes, that's how you talk to a bright person that doesn't work in the field. However,\n\nA. The real problem with not talking about the underlying science is it means that the engineers in the room will always be second class citizens in the grant writing because they will never understand why things are being done. \n\nB. The intended audience for the conversation is probably the other scientists rather than this guy. Otherwise someone would have noticed he doesn't get it.\n\nC. Someone that is technically competent i.e. has a PhD should be able to pick up the words basically by doing the work and background osmosis. Reading papers, attending reading groups and seminars, and attending technical meetings. Yes, questions need asking and answering, but working in a field for years and still not understanding most of what people are said is weird. After all, that's how we all learnt our own disciplines.",
                          "author": "DoorsofPerceptron",
                          "created": 1621263133,
                          "upvotes": 3,
                          "replies": {
                            "gygh3f9": {
                              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gygh3f9/",
                              "text": "I didn't say you can't talk about the underlying science.  I said you do it reasonably.  I interface with medical doctors all the time for clinical trials.  I didn't go to med school and they didn't learn any stats or experimental design or some of what I know.    They aren't going to get a phd in stats and if we are going to have useful collaboration between experts who know HPLC and cancer and brain  stuff, then people have to talk to each other.\n\nIf you need something to actually work, presumably why there is an engineer on the team, then it is as incumbent on you to learn that stuff as it is on them to learn yours.",
                              "author": "PersephoneIsNotHome",
                              "created": 1621266527,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gyfhtns": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfhtns/",
              "text": "Yep but there’s a difference between talking transcription or referring to cell cycle stages or even bringing up well known genes like p53, and chucking around TLAs at each step (which Americans are known for) and making up lame ‘catchy’ terms for dumb stuff that was invented in the 80s but that you want to claim as totally new so you can justify your mate at science publishing it as a great new technique.",
              "author": "ImeldasManolos",
              "created": 1621247923,
              "upvotes": 5,
              "replies": {}
            },
            "gyfta4e": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfta4e/",
              "text": ">if you work in cell biology you need to know what transcription is\n\nAbsolutely.  When speaking with someone in your field, terminology can definitely accelerate conversation.  However, in a cross functional team, if you are relying on a nano engineer to build you a transcription sensor, they need to be able to understand what is going on.",
              "author": "meowcat187",
              "created": 1621255611,
              "upvotes": 1,
              "replies": {
                "gyfuhxh": {
                  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfuhxh/",
                  "text": "To begin with, yes.\n\nHowever, if after several months they still didn't know what transcription is, I'd assume that they just don't give a shit.",
                  "author": "DoorsofPerceptron",
                  "created": 1621256288,
                  "upvotes": 4,
                  "replies": {}
                },
                "gygebew": {
                  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gygebew/",
                  "text": "And you should also accept criticism from other members of your team.\n\nIf you’re a computer scientist designing a smartphone app for blind people to navigate the airport, and a disability studies co-PI tells you all the ways the target population will not use your app, listen to them!",
                  "author": "Greenmantle22",
                  "created": 1621265385,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gyfhxhh": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfhxhh/",
          "text": "This right here is what happens a lot.",
          "author": "meowcat187",
          "created": 1621248005,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gyey20k": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyey20k/",
      "text": "Yes, 100% been in your position. I was physics-turned-engineering but doing research in an experimental physics lab. For the most part, the PI enabled the very behavior you're describing. Implementation was always an afterthought, as well as realistic timelines, and they always had a knack to oversell the projects they were writing grants to the point that there was no clear objective. \n\nI did what a couple other commenters are saying (ie learn the jargon, build a bridge, show my usefulness, etc.), but it was hurting my mental health more than it was worth. I eventually left the lab to work somewhere else to save my sanity and found out that they still had not made progress since. Sometimes you just have to cut your losses and move on ¯\\\\\\_(ツ)\\_/¯",
      "author": "bbv27",
      "created": 1621231286,
      "upvotes": 6,
      "replies": {
        "gyfjx05": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfjx05/",
          "text": "Arggggh. Well I appreciate that it is not just me then. My mental health is definitely deteriorating.  So where did you go when you left?  I've been looking for jobs but can't really find a good fit.  Not sure I'd make it in industry, and fear I'm going to end up right back where I am with a new research institute.",
          "author": "meowcat187",
          "created": 1621249521,
          "upvotes": 3,
          "replies": {
            "gygsux0": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gygsux0/",
              "text": "So, I actually took a risk. Left around September and applied to jobs, but also grad school programs. Got into a program, so I'm just waiting until I can start. I built up enough of a financial safety net to stay afloat to hold me over and have been \"recovering\"/working on my mental health since.\n\nIf you're still at your job, I would apply far and wide to positions that is remotely interesting to you or you have a few of the qualifications for. I didn't get a callback for interviews until March/April and I applied in Sept/Oct/Nov/Dec. Usually hiring season usually cycles around graduation cycles. So a lot more opportunities start popping up around April/May/June and then Sept/Oct/Nov. So, if you can hang on, stay at your job until you've got a start date for the newer job.\n\nAlso, idk about your qualification, but don't count yourself out before you actually begun! You say you're not sure if you'll make it in industry, **but** what if you do? You'll never know if you don't try and when applying, the worse thing that could happen is that they say no. And that \"no\" isn't a \"no\" forever. It's a \"no\" for right now. Bet on yourself OP!\n\n&#x200B;\n\nedit: Also, network! With covid going on its harder, but linkedin is your friend. If you find a recruiter for a company you're interested in, don't be afraid to send them a message or an email! They're always looking for talent and in my experiences, have helped find a place/position in a company. Just make sure you've refreshed your linkedin and resume/cv to be ready to hand over when asked.",
              "author": "bbv27",
              "created": 1621271383,
              "upvotes": 1,
              "replies": {
                "gyh4vhn": {
                  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyh4vhn/",
                  "text": ">You say you're not sure if you'll make it in industry\n\nTechnically I can but mentally it might not be in me.  Making widgets for capitalism, etc.  :D",
                  "author": "meowcat187",
                  "created": 1621276343,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gyfjxi5": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfjxi5/",
              "text": "Ahoy meowcat187! Nay bad but me wasn't convinced. Give this a sail:\n\nArggggh. Well me appreciate that it be nay just me then. Me mental health be definitely deteriorating.  So where did ye sail when ye port?  I've been looking fer jobs but can't verily find a jolly good fit.  Nay sure I'd make it in industry, n' fear I be going t' end up starboard back where me be wit' a new research institute.",
              "author": "I-AM-PIRATE",
              "created": 1621249532,
              "upvotes": -3,
              "replies": {}
            }
          }
        }
      }
    },
    "gyfes3y": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfes3y/",
      "text": "Hey, I think with your experience you can try Searching for a company where you can actually be happy, because Ultimately that's important rest keep taking experience here but if there's a better package out there for u why not find and take it.\nBecause I have faced this and it's definitely not fun",
      "author": "Positive-Ad-3882",
      "created": 1621245388,
      "upvotes": 2,
      "replies": {
        "gyfjzh5": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfjzh5/",
          "text": "Thank you for the positivity.  Where did you go?",
          "author": "meowcat187",
          "created": 1621249573,
          "upvotes": 1,
          "replies": {
            "gyfkcbm": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfkcbm/",
              "text": "I am not in the Same feild but thankfully that was a internship for me so I was able to leave earlier and move on to better companies.",
              "author": "Positive-Ad-3882",
              "created": 1621249839,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gyfvw4z": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfvw4z/",
      "text": "Yes -all the time.  People who dont work with MRI for example have some kind of aim that looks like it might have been from Star Trek and when the imaging people go , in is and MRI not a crystal ball, then it is too late.\n\nSmart people are stupid in spectacular ways.",
      "author": "PersephoneIsNotHome",
      "created": 1621257034,
      "upvotes": 2,
      "replies": {}
    },
    "gyg2do0": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyg2do0/",
      "text": "I have this issue as a PhD student (electrical engineering) but professors I work with come from math and physics backgrounds mainly. It's a little overwhelming at first, but they always seem happy enough to give a quick intro to the jargon and recommend some resources. Of course, as a student, it's probably easier for me to appear to be totally clueless and get away with it.",
      "author": null,
      "created": 1621260220,
      "upvotes": 2,
      "replies": {}
    },
    "gyfww3o": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfww3o/",
      "text": "I've never had a lot of problems with interdisciplinary work. Intradisciplinary work however has had a lot of this.\n\nOur program had a regular problem set where everyone in the department would spend a lunch going over a recent publication. It became a dick-measuring contest rather than a learning exercise where the people who knew the answers would take over the conversations. It wasn't until my last year I started being able to field the questions, but by then I already had the reputation of not being in the smart club.\n\nI've also seen issues with cliques non-English speakers  not wanting to include native English speakers in their discussions, so far as having informal group meetings to discuss research.",
      "author": "hdorsettcase",
      "created": 1621257564,
      "upvotes": 1,
      "replies": {
        "gyfzsw8": {
          "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyfzsw8/",
          "text": ">It became a dick-measuring contest rather than a learning exercise where the people who knew the answers would take over the conversations.\n\nThat sucks.  I am realizing that if I want to be heard here I have to do the same (take over conversations, interrupt, etc.) It is one of my top pet peeves because its dismissive.  But is that what you have to do survive?",
          "author": "meowcat187",
          "created": 1621259015,
          "upvotes": 0,
          "replies": {
            "gyg2m7b": {
              "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyg2m7b/",
              "text": "I realized I wasn't good at sit-down-you-have-an-hour-to-figure-this-out-type problems. I take about a week to review a paper, read through its references, and learn the science behind it. I stopped trying to have a voice where I wasn't being heard and started posting stuff online. Eventually I didn't have to 'prove' myself to others, I could point to my website and LinkedIn with months of activity to show that I was engaging with the material. They key is to stop playing a game you're not winning and start playing your own game.",
              "author": "hdorsettcase",
              "created": 1621260328,
              "upvotes": 1,
              "replies": {
                "gyg55ha": {
                  "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyg55ha/",
                  "text": "Good advice.  I too am not a sit-down-you-have-an-hour-to-figure-this-out-type problem person.",
                  "author": "meowcat187",
                  "created": 1621261462,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gyg4uiw": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gyg4uiw/",
      "text": "all the time\n\nacademia is clique central",
      "author": "radionul",
      "created": 1621261327,
      "upvotes": 1,
      "replies": {}
    },
    "gygdpsg": {
      "link": "/r/AskAcademia/comments/ne4yc7/anyone_feel_like_they_are_left_out_of_research/gygdpsg/",
      "text": "Sounds like the existing clique is missing a very important type of thinker.\n\nEvery gang of drunks needs someone to drive them home, and every group of show pony theorists needs a practical workhorse who steers their ideas through implementation.\n\nAgree with others that you should try to approach them on their terms. Learn their stuff and their unmet goals, and suggest you can help the group to meet those.",
      "author": "Greenmantle22",
      "created": 1621265132,
      "upvotes": 1,
      "replies": {}
    }
  }
}