{
  "sid": "qrcvl6",
  "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/",
  "title:": "Using a lab computer at home",
  "text": "Is it bad if I (research assistant) take a lab laptop home to work from home, but also use it to watch Netflix/check Facebook when I’m not working? I don’t have a reliable computer at home",
  "author": "biogal06918",
  "created": 1636605098,
  "updated": 1637382420,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hk5ymh8": {
      "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk5ymh8/",
      "text": "This would be a huge no in my lab. Too much chance of potential malware on expensive equipment. \n\nIf you’re unsure, you should ask.",
      "author": "Eigengrad",
      "created": 1636605490,
      "upvotes": 10,
      "replies": {}
    },
    "hk6mgqc": {
      "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk6mgqc/",
      "text": "It depends on the rules at the lab/uni.\n\nI might do it regardless, but let's say it gets stolen on the subway or something, how much trouble will you be in for taking it home?",
      "author": "molobodd",
      "created": 1636622463,
      "upvotes": 2,
      "replies": {}
    },
    "hk5ykx1": {
      "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk5ykx1/",
      "text": "It's fine. The laptop was given so that you can do your work. As long as you do your duty, using it for leisure is not an issue.",
      "author": "MarkZelVitch",
      "created": 1636605465,
      "upvotes": 4,
      "replies": {}
    },
    "hk5yrqi": {
      "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk5yrqi/",
      "text": "I don’t think you should but I don’t think it’s a big deal unless you lead to some data breach or hacking of important information, which again I think is unlikely because you have been allowed to take the laptop home. So probably you are not working on sensitive information.",
      "author": "Tchochkie_Schmear",
      "created": 1636605571,
      "upvotes": 1,
      "replies": {
        "hk60m7z": {
          "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk60m7z/",
          "text": "It’s insect data, important for the MS I’m writing but pretty much nothing else. Essentially just counts of bug offspring and graphs of those counts.\n\n I don’t mean that in a sarcastic way, I’ve just seen laptops bought for grad students or techs who don’t have a computer at home, and some of them take them home so I was wondering where the line is drawn for academia, in general? Personally, I have a $200 basic laptop (yes I regret it now that I’ve worked with the computers my boss bought through grants and not my personal money😅). LOVE that my lab lets me borrow the laptop when I work from home, they’re amazing for that. \n\nIs it really that bad to use a work computer to do personal stuff? I have my personal email linked to my work desktop, and my boss told me it was ok to watch Netflix on the lab iPad while doing insect stocks (they take a full day of mindless insect maintenance).",
          "author": "biogal06918",
          "created": 1636606605,
          "upvotes": 3,
          "replies": {
            "hk61p5i": {
              "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk61p5i/",
              "text": "I think you should be fine. Still be safe use incognito. Clear browser histories and possibly even user tor browser for anyone anonymity. Good luck. Have fun !",
              "author": "Tchochkie_Schmear",
              "created": 1636607215,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk6dgqq": {
      "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk6dgqq/",
      "text": "I think in academia it’s fine I did. it the other way using private computer for doing work. However where I work now it’s a huge no Andy company issued laptop can only be used for work. And for each software you want to install you need permission.\nHowever, I would always ask if it’s ok.",
      "author": "CreepyBumblebee31",
      "created": 1636614962,
      "upvotes": 1,
      "replies": {}
    },
    "hk84ro7": {
      "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk84ro7/",
      "text": "It's highly dependent on the terms and conditions under which you're able to use the laptop, but broadly...*eh*? Some degree of personal use is to be expected, and Facebook, Netflix, and your own email account (probably) aren't going to raise any eyebrows.",
      "author": "r3dl3g",
      "created": 1636651881,
      "upvotes": 1,
      "replies": {}
    },
    "hkau4o5": {
      "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hkau4o5/",
      "text": "I agree with the comments that say this is very lab/organization specific, so you are best to check.  There may even be formal regulations on such use, and you do not want to inadvertently break those.\n\n&#x200B;\n\nPersonally, would not care.",
      "author": "Life_time_learner",
      "created": 1636695712,
      "upvotes": 2,
      "replies": {}
    },
    "hk8vze7": {
      "link": "/r/AskAcademia/comments/qrcvl6/using_a_lab_computer_at_home/hk8vze7/",
      "text": "I would ask your PI and/or IT team. Random Reddit people don't know your organisation's acceptable use policy or what data could be accessed from your laptop. \n\nI use my work laptop for Netflix etc because I travel a lot (or did before the end of days) and it's nice to unwind in the hotel room at the end of a long day, but I checked with IT when they gave me my laptop.",
      "author": "ACatGod",
      "created": 1636662840,
      "upvotes": 1,
      "replies": {}
    }
  }
}