{
  "sid": "qrns8u",
  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/",
  "title:": "Why is an European PhD considered shorter than an American PhD when an American PhD is really a Masters + PhD?",
  "text": "Most European PhD programs require a Master's degree, which takes 1-3 years, whereas an American PhD can be started after a Bachelor's degree. So even if an American PhD is typically 5 years, shouldn't it be regarded as 2+3 years, thus essentially being the same in length as a 3-year European PhD? But why do so many people perceive European programs as shorter?",
  "author": "bahasasastra",
  "created": 1636644687,
  "updated": 1637384316,
  "over_18": false,
  "upvotes": 30,
  "upvote_ratio": 0.82,
  "comments": {
    "hk7rqex": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7rqex/",
      "text": "Because in the US if you do a Masters' and a PhD you are still expected to take 4+ years to do your PhD. And the \"MSc+PhD\" is often 6+ years long.\n\nSo any way you cut it it tends to be longer than in europe.",
      "author": "ThePhysicistIsIn",
      "created": 1636646684,
      "upvotes": 45,
      "replies": {
        "hk7trkk": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7trkk/",
          "text": "This is super field dependent. I know a lot more people who did it in 4 years straight from undergrad than 6+.",
          "author": "mediocre-spice",
          "created": 1636647525,
          "upvotes": 5,
          "replies": {
            "hk7v14c": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7v14c/",
              "text": "Maybe. I dunno, it takes time to churn out a bunch of papers and acquire the experience you need to be competitive on the job market. There's no shortcut for that.\n\nI guess some people just move that experience into the postdoc instead.",
              "author": "ThePhysicistIsIn",
              "created": 1636648034,
              "upvotes": 6,
              "replies": {
                "hk7zjma": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7zjma/",
                  "text": "Sure, but people are saying that 3 years is plenty, so 4 certainly is. I do think 5 is kind of sweet spot where you can take on some bigger/more ambitious projects though, at least in my field.",
                  "author": "mediocre-spice",
                  "created": 1636649806,
                  "upvotes": 4,
                  "replies": {
                    "hk80dee": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk80dee/",
                      "text": "European PhDs don't come out at 3 years the same as Americans do, though. It's \"plenty\" in the European context, less so in the American one, but nothing a postdoc can't fix. \n\nThere's just different expectations on both sides of the pond.",
                      "author": "ThePhysicistIsIn",
                      "created": 1636650133,
                      "upvotes": 2,
                      "replies": {
                        "hk9st59": {
                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9st59/",
                          "text": "True, we come out with more money / no debt.\n\nHaven't personally noticed any structural differences in knowledge, scientific maturity, quality of work, etc.\n\nEdit: typical length is 4 years btw, except for a few countries such as the UK.",
                          "author": "Scientist_Kris",
                          "created": 1636677428,
                          "upvotes": -4,
                          "replies": {
                            "hkcavj0": {
                              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkcavj0/",
                              "text": "All I do know is that the people from the UK I know come out with fewer papers than the people from the US, and we count papers. I wouldn't know about the rest.",
                              "author": "ThePhysicistIsIn",
                              "created": 1636730638,
                              "upvotes": 0,
                              "replies": {
                                "hkcqwoq": {
                                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkcqwoq/",
                                  "text": "If you don't know about the rest it would be nice if you wouldn't comment on all of Europe. As a lot of people have said already, it's very field-specific, but most PhDs in psychology or medicine in the Netherlands finish with 4+ papers, often 5 or 6. That's not different from what I've seen with people joining from the US. UK PhD programmes are often shorter (3 years) and without teaching responsibilities, but in my experience the quality is just fine. \n\nI feel like this discussion quickly turns into 'who is better' but I honestly think the differences in system between countries are so big, it'd be hard to judge that (and I don't think we should).",
                                  "author": "Scientist_Kris",
                                  "created": 1636737152,
                                  "upvotes": 0,
                                  "replies": {
                                    "hkcshaa": {
                                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkcshaa/",
                                      "text": "But dutch programs are not shorter than US programs, so they’re not the topic of discussion.",
                                      "author": "ThePhysicistIsIn",
                                      "created": 1636737783,
                                      "upvotes": 0,
                                      "replies": {
                                        "hkcu4e5": {
                                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkcu4e5/",
                                          "text": "OP asks about European programmes, so I'd think all of them are relevant here. As there are too many differences between European countries (as can also be seen in the comments), its useful to discuss them, I'd say.\n\nBefore I started my PhDs, I didn't know how much PhD programmes differed between countries or even universities or faculties, so I think all the distinctions being made in this thread are very interesting and valuable.",
                                          "author": "Scientist_Kris",
                                          "created": 1636738446,
                                          "upvotes": 1,
                                          "replies": {
                                            "hkcudu3": {
                                              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkcudu3/",
                                              "text": "OP is asking about 3-year PhDs. Clearly longer PhDs are longer.",
                                              "author": "ThePhysicistIsIn",
                                              "created": 1636738551,
                                              "upvotes": 0,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hk9i76h": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9i76h/",
                  "text": "This too is very field specific. It is actually unusual for humanities PhD students to publish papers while in their grad program. In fact, I recall a history faculty member once emphasizing that she dissuades PhD students from trying to publish articles because she's encountered academics who have regretted the work they put out into the world before reaching \"scholarly maturity,\" so to speak.",
                  "author": "Durendal_et_Joyeuse",
                  "created": 1636672222,
                  "upvotes": 19,
                  "replies": {
                    "hk9jzau": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9jzau/",
                      "text": "Fascinating. How are history phds evaluated on their output then?",
                      "author": "ThePhysicistIsIn",
                      "created": 1636673030,
                      "upvotes": 7,
                      "replies": {
                        "hk9o5ly": {
                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9o5ly/",
                          "text": "The volume of publications for historians is typically much lower than STEM academics. Co-authored papers are relatively rare, and historians are usually hired on the basis of their dissertations, the projected book adaptation of their dissertations, vague plans for future books, and possibly a small number of articles they write during a postdoc. It’s not absolutely unheard of for historians to have published during their PhDs, but it’s not typical. I know some junior scholars hired tenure track at small instituons with 0 publications under their belts.\n\nThen there is the question of tenure, which nowadays is becoming increasingly contingent upon the publication of a second book, among other factors.",
                          "author": "Durendal_et_Joyeuse",
                          "created": 1636675190,
                          "upvotes": 8,
                          "replies": {}
                        }
                      }
                    },
                    "hkagjpp": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkagjpp/",
                      "text": "That advice is about 20 years old. Most successful historians have a strong publication record by the time they are on the job market. There are still some faculty that advise their graduate students to avoid publication and focus on the dissertation alone, but they are frankly out of touch.",
                      "author": "TheProfessorsCat",
                      "created": 1636688513,
                      "upvotes": 6,
                      "replies": {
                        "hkakmi2": {
                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkakmi2/",
                          "text": "Rewriting my response because my last one missed the mark with what you said. You’re definitely right that junior historians on the job market are better off publishing more. I don’t necessarily agree with that faculty member’s advice; just shared it to give some insight into how publishing norms are different from STEM fields.\n\nEither way, unlike many STEM fields, it’s not typical for history PhD students to publish anything before defending their dissertations, and if they do, it’s often maybe just 1 article or possibly a chapter contribution. Still, I’m ABD in a top history program, and I can only think of a handful of peers who have done that.",
                          "author": "Durendal_et_Joyeuse",
                          "created": 1636690483,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hkac9uj": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkac9uj/",
              "text": "Yep, very field dependent. For physics PhD's in the US for 2017-18 [the median was 6 years and only 4% finished in 4](https://www.aip.org/sites/default/files/statistics/graduate/phdtrends-yearsofgsstudy-fig5.png). Meanwhile, 16% took 8+ years.",
              "author": "First_Approximation",
              "created": 1636686483,
              "upvotes": 10,
              "replies": {}
            },
            "hk90s5l": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk90s5l/",
              "text": "I would back this up for the field I am in (geography).\n\nIt is typical in the field that an MA or MS is required for PhD applications. But as a result, PhDs are typically shorter than other degrees which are Masters + PhD by at least a year.",
              "author": "the_Q_spice",
              "created": 1636664814,
              "upvotes": 7,
              "replies": {}
            },
            "hk8xnjr": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8xnjr/",
              "text": "Really? Which fields were your friends ( 4 year PhD right out of undergrad) in? Did they get academic positions after the degree or did they do post docs or did they join industry/equivalent?",
              "author": "Wookiemom",
              "created": 1636663528,
              "upvotes": 5,
              "replies": {
                "hk92n6o": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk92n6o/",
                  "text": "Life sciences broadly. All went to industry after, which I think is part of it. They were focused on what research do I need to get down to get out of here and weren't thinking about applying to grants, teaching exp, high impact publications, any skill that wouldn't be transferable, etc, etc.",
                  "author": "mediocre-spice",
                  "created": 1636665571,
                  "upvotes": 3,
                  "replies": {
                    "hkb4wk4": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkb4wk4/",
                      "text": "Life sciences is kind of special in that regard because many industry jobs require a PhD and so a very large proportion of the graduates go for it .",
                      "author": "futurespice",
                      "created": 1636703398,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hk8rfbn": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8rfbn/",
              "text": "agreed, 6+ years for a phd in the us is ridiculous in stem. maybe normal for humanities",
              "author": "VanillaRaccoon",
              "created": 1636660961,
              "upvotes": -14,
              "replies": {
                "hk9508l": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9508l/",
                  "text": "What? The average for biomedical science at my university is 5.5. I don’t think 6 is that absurd.",
                  "author": "trevorefg",
                  "created": 1636666553,
                  "upvotes": 13,
                  "replies": {
                    "hk9drx8": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9drx8/",
                      "text": "lol in my program you are placed in bad academic standing if you are still here after 5 years. ive worked with several people who graduated in 3 years straight from BS. yes, it depends on the nature of your work and your PI, i dont have to work with living things. according to acs mean time for chemistry is 5.0 years. i see these surveys that say mean time is over five years but i have met zero serious students that took that long. only people who spend way too much time on TAing or work 5 hours a day.",
                      "author": "VanillaRaccoon",
                      "created": 1636670275,
                      "upvotes": -9,
                      "replies": {
                        "hk9ha68": {
                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9ha68/",
                          "text": "It's because it's a mean. There's enough people who ended up ABD, ran out of money (we only get 5 years), take another job and tried to finish their dissertation part time over years, things like that, that increase the average.",
                          "author": "mediocre-spice",
                          "created": 1636671814,
                          "upvotes": 3,
                          "replies": {
                            "hk9lcax": {
                              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9lcax/",
                              "text": "I thought the same but all the distributions of frequency vs time-to-completion I've found appear pretty darn normal. i don't think the median is going to be much different.",
                              "author": "VanillaRaccoon",
                              "created": 1636673687,
                              "upvotes": -1,
                              "replies": {}
                            }
                          }
                        },
                        "hk9ib09": {
                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9ib09/",
                          "text": "Does your university fully find you for that entire time? We are encouraged to either procure our own funding or our PI must fully fund after year 1. May explain the coercion to get y’all out the door ASAP.\n\nAlso I know literally no one who finished in under 4 years… that just sounds to me like you didn’t do enough to make your dissertation a complete “story”. We aren’t required to TA, so I’m certain that’s not affecting time to graduation.",
                          "author": "trevorefg",
                          "created": 1636672270,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hk94c75": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk94c75/",
                  "text": "No it's not. The average physics PhD in the US takes 6.2 years.\n\nhttps://www.aip.org/statistics/reports/trends-physics-phds-171819",
                  "author": "geosynchronousorbit",
                  "created": 1636666273,
                  "upvotes": 13,
                  "replies": {}
                },
                "hk8u34h": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8u34h/",
                  "text": "It's definitely unusual. Everyone I know that went over 5 had something, usually multiple somethings, go wrong (pandemic, switching advisors, just awful luck with experiments, shitty advising, funding issues, health issues)",
                  "author": "mediocre-spice",
                  "created": 1636662054,
                  "upvotes": -4,
                  "replies": {}
                }
              }
            },
            "hkb8doy": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkb8doy/",
              "text": "In biology 6-7 is pretty typical in the past 10 years. I only know one person who finished in 5 since I’ve been in school",
              "author": "Skarksarecool",
              "created": 1636706276,
              "upvotes": 1,
              "replies": {}
            },
            "hkcefn2": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkcefn2/",
              "text": "Definitely field-dependent. Conversely, all the rhetoric PhD programs I know require a MA for admission.",
              "author": "elizzybeth",
              "created": 1636732108,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hk7rzik": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7rzik/",
          "text": "I'm aware of people doing a terminal Master's and then starting \"another Master's\" within a PhD program, but isn't that essentially optional, equivalent to doing two Master's before a European PhD?",
          "author": "bahasasastra",
          "created": 1636646790,
          "upvotes": -9,
          "replies": {
            "hk7sfh7": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7sfh7/",
              "text": "The masters part of a US PhD is usually 2 years of classes and rotating to find your lab (in life sciences). Even if you come in with a master's, the PhD program requires those specific classes at that specific university, so you can't really skip it. It definitely isn't necessary to get the separate master's first.",
              "author": "bacon_music_love",
              "created": 1636646975,
              "upvotes": 15,
              "replies": {}
            },
            "hk7v6pl": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7v6pl/",
              "text": ">isn't that essentially optional\n\nIf you do a Master's somewhere, then decide to do a PhD somewhere else (either later on in life or due to funding or wanting a certain adviser/project) the only thing potentially shortening the PhD is the fact that you have some background knowledge on how to do research + whatever literature reviews might be helpful from your Masters work.",
              "author": "RagePoop",
              "created": 1636648096,
              "upvotes": 10,
              "replies": {
                "hk7y9nu": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7y9nu/",
                  "text": "In my program having a master's already shaved a year off my three years of coursework. Still a lot longer than in Europe.",
                  "author": "pipkin42",
                  "created": 1636649308,
                  "upvotes": 7,
                  "replies": {}
                },
                "hk7w2ta": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7w2ta/",
                  "text": "Well, you usually have *some* courses waived, in my experience. Not all of them though.",
                  "author": "ThePhysicistIsIn",
                  "created": 1636648446,
                  "upvotes": 6,
                  "replies": {
                    "hk7wy2w": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7wy2w/",
                      "text": "Yeah you're right, the institution I went to waived an entire 3 credits, lol",
                      "author": "RagePoop",
                      "created": 1636648788,
                      "upvotes": 4,
                      "replies": {
                        "hk7y3d3": {
                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7y3d3/",
                          "text": "Me it was 9. Out of like, 30 or somesuch.",
                          "author": "ThePhysicistIsIn",
                          "created": 1636649239,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "hk7y6fi": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7y6fi/",
                      "text": "In my experience, the max I have ever seen is 12 hours waived, and usually it is only 3 to 6.  I have also seen that they still have you take the same hours, but have you take more advanced coursework instead (e.g., you took basic statistical analysis in your masters, so the PhD program will instead have you take a more advanced stats class that is normally an elective).",
                      "author": "manova",
                      "created": 1636649273,
                      "upvotes": 3,
                      "replies": {
                        "hk7yb86": {
                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7yb86/",
                          "text": "Right, exactly. Some courses are waived, usually, and your mileage will vary tremendously.",
                          "author": "ThePhysicistIsIn",
                          "created": 1636649325,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hk85o3h": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk85o3h/",
                  "text": "You may also be to reduce the post-coursework component significantly. Definitely field-dependent, but when I was in grad school, there was someone who came in with an MA, knew exactly what he wanted to do, and started working on his dissertation from day one. So he was able to finish the PhD program about a year after he finished coursework. \n\nThat’s obviously incredibly uncommon, but if your Master’s prepares you enough, it can shorten that latter portion significantly.",
                  "author": "EconGuy82",
                  "created": 1636652237,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hk7s8id": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7s8id/",
              "text": "This depends. Let's say you studied something else in undergrad and obtained a Master's to build a foundation and improve your grades. In Europe, I would not have to obtain an additional Master's for a PhD. In the US, I would have to do another Master's even though I have no actual interest in doing so (but without my current Master's I wouldn't have much of a chance).",
              "author": "figuringthingsout--",
              "created": 1636646895,
              "upvotes": 3,
              "replies": {}
            },
            "hk7wg1t": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7wg1t/",
              "text": "It's not optional though.\n\nI did a Master's in one institution, and a PhD in another, mainly because I discovered that my Master's was not certified in the field I wanted to enter, and that certification, while not absolutely not necessary, was an asset. \n\nI was waived some courses, but still had to do most of them. I think out of, say, 6 subfield-specific classes+2 general classes+all the scientific speaking/writing seminars, I got 3 waived. \n\nI finished in about 4 years, because I had already learned a lot of this and I was just a little bit more efficient. People doing their PhD straight from undergrad would have taken 5.",
              "author": "ThePhysicistIsIn",
              "created": 1636648591,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk7yqks": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7yqks/",
      "text": "Thats because the US still largely sticks to the traditional PhD method, while European universities have truncated their PhDs, and especially their humanities PhDs, to focus more on research and less on coursework. The US system currently is much closer to the old German imperial university system (perhaps thats why Humanities PhDs in the US are still so brutal? Damn Prussians....) where comprehensive examinations were a much bigger deal. \n\nThe biggest difference between a US PhD and a European one is that European PhDs dont have to go through as exhaustive a comps process as we do in the US. PhD coursework establishes the reading foundation required to *begin* the comps process, and then many programs extend extra course free time to complete the comps process. In my program I did two years of course work getting down the foundational concepts of my fields, then had an entire extra year to just read for comps. Covid fucked that up a bit and I ended up slipping into a third semester, so for me it was even more time. I was in my fourth year before I ever even moved to candidacy. If I'd done my degree in Europe I would have taken four extra years to end up where most Europeans *start*. \n\nWhy is it like this? Well the intellectual defense of the US process is that it makes better researchers and teachers as each PhD has a very strong grounding the field's literature. I have a very broad and deep grounding in the big questions of my fields, I have read extensively in areas which I hope to teach, and I personally feel that I can teach in many areas outside my direct field because of it. Thats better for me professionally, as it makes me more employable, it makes me a better researcher because I am not so narrowly focused that I cant draw in other literature, and it helps my students because I can develop classes that expose them to a variety of ideas. At least thats the theory. Another big part of it I think is tradition and academic hazing. This is the process that my profs went through, and so I have to do it because they had to do it. They suffered and so now I must also suffer. There is an expectation of suffering and so to avoid or mitigate is is to 'soften' the program. Combined with the bleak jobs market, I think many profs have an implicit attitude that if a PhD isn't willing to suffer a bit to get through then they might as well just not be in academia to begin with. \n\nBut things are going to change in the US. My program is very traditional, and the long length is apart of that. A friend of mine in another state did their comps in 3 years mainly because their exam process was much easier. Given how state and university budgets are going, I dont see humanities maintaining a 7+ year PhD system. My university *already* places conditions on funding based on the national average for STEM PhDs, not humanities. IMO there is going to increasingly be huge pressure on programs to truncate their programs and bring them in line with STEM PhDs. Universities are just not interested paying their students any more than that. \n\nAlso I dont know *any* PhD students currently who jumped straight from Bachelors to PhD. That to me would be pretty unusual. I have heard of students who start in the department's MA program and then graduate into the PhD program, but they still do the two year MA first. Maybe its different for a STEM degree I wouldn't know, but in humanities that seems to be the common route.",
      "author": "BeondTheGrave",
      "created": 1636649491,
      "upvotes": 19,
      "replies": {
        "hk87u7t": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk87u7t/",
          "text": ">Also I dont know any PhD students currently who jumped straight from Bachelors to PhD. That to me would be pretty unusual. I have heard of students who start in the department's MA program and then graduate into the PhD program, but they still do the two year MA first. Maybe its different for a STEM degree I wouldn't know, but in humanities that seems to be the common route.\n\nI am in the humanities and did this (accepted to PhD at an Ivy in my senior year of undergrad at a SLAC). I would not recommend it, though. I did very well in my program, but had to bust my ass to catch up. Because I was going in at 23, I simply had not had enough time to read as others in my cohort who were in their late 20s/early 30s and came in with a MA (sometimes multiple). That meant I spent the first three years of my program reading in overdrive while taking courses and teaching. Then I wrote my diss in two years and graduated at the end of year 5, when my guaranteed funding was ending. Students who came in with a MA had more time to publish (if they managed their time well) or simply completed the program at a more relaxed pace.",
          "author": "jmgbam21",
          "created": 1636653071,
          "upvotes": 3,
          "replies": {
            "hk8phzz": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8phzz/",
              "text": "I mean jumping from a Bachelors to a PhD @ an Ivy like that is super impressive. Thats a huge step forward. But I could also see why it would have been a hard adjustment. TBH I dont feel like I could have made the jump to PhD myself. I needed to learn a lot in my MA program, not just about my field but about being an adult.",
              "author": "BeondTheGrave",
              "created": 1636660173,
              "upvotes": 8,
              "replies": {
                "hk91r75": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk91r75/",
                  "text": "Being admitted directly into the PhD program from a BS is pretty common, at least in STEM fields. In part, that's because excellent undergraduates can take graduate level classes in their junior and senior years. It was common at my undergraduate alma mater for math majors to take abstract algebra their freshman year, using Dummit and Foote, and our junior level physics classes were also typically filled with first year graduate students.",
                  "author": "mleok",
                  "created": 1636665204,
                  "upvotes": 9,
                  "replies": {}
                },
                "hk8zze1": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8zze1/",
                  "text": "To be honest, I'm not sure I would have made it through my first year had it not been for my very supportive adviser.",
                  "author": "jmgbam21",
                  "created": 1636664487,
                  "upvotes": 3,
                  "replies": {
                    "hk9c9pe": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9c9pe/",
                      "text": "I didnt have that, my advisor was on sabbatical all my first year year. I saw him three times in a year and a half, including my applications interview lol.",
                      "author": "BeondTheGrave",
                      "created": 1636669614,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hk8v2lt": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8v2lt/",
          "text": "I went straight from my bachelors to PhD. In clinical psychology, it can be a disadvantage to have a masters first. This is pretty field dependent.",
          "author": "adorationn01",
          "created": 1636662464,
          "upvotes": 5,
          "replies": {}
        },
        "hk945gy": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk945gy/",
          "text": "Wouldn't, for the continental system, a Research Masters cover the familiarization with the field at large?",
          "author": "Hoihe",
          "created": 1636666193,
          "upvotes": 2,
          "replies": {
            "hk9cqi5": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9cqi5/",
              "text": "Familiarization is a very broad thing though. The goal of the prolonged reading process isnt about creating a familiarity of a field, but a total mastery of it. Its something a bit more extreme than that. \n\nBut grain of salt, I'm in a reading heavy humanities field.",
              "author": "BeondTheGrave",
              "created": 1636669820,
              "upvotes": 3,
              "replies": {
                "hk9i042": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9i042/",
                  "text": "I guess humanities vs natural sciences may lead to a strong difference there.\n\nI'm still just an undergrad in my own theoretical lab, but the PhD student labmate seems rather laser focused on just his own project.",
                  "author": "Hoihe",
                  "created": 1636672139,
                  "upvotes": 2,
                  "replies": {
                    "hk9mtqz": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9mtqz/",
                      "text": "Its my understanding that the European humanities PhD is closer to the experience youre familiar with. Less readings, more focus on your topic.",
                      "author": "BeondTheGrave",
                      "created": 1636674399,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hk9apj6": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9apj6/",
          "text": "They gave you a YEAR off to study for comps???! I took one week of vacation this year and I won't be taking any more until next year. I was told to start writing my proposal in August of this year to begin the comps process. I submitted my proposal on Monday, and now I get to start studying-studying for my oral comps which will happen in about a month from now. I don't get any time off of class or research before my oral exam. In fact, this month and next month will be the busiest months of research so far. So in total, from when we first decided on my project until my oral comp, is only like 4 months. 4 months of class and 80hr/week research. Bruh I had to BEG to get the Friday after Thanksgiving off.",
          "author": "garakthegardener",
          "created": 1636668938,
          "upvotes": 2,
          "replies": {
            "hk9c1qv": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9c1qv/",
              "text": "Yeah but I also had like 600 books to read. It was full time work. Im not saying it was a good way to spend a year of my assistantship and waiver, in fact I would rather cut it down only a single semester as many universities do. But that would probably require cutting the book list in half, and simply many professors here wont go for that. Its part of the rite of passage.",
              "author": "BeondTheGrave",
              "created": 1636669515,
              "upvotes": 5,
              "replies": {
                "hk9c7d2": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9c7d2/",
                  "text": "Ohhhhhh you're humanities",
                  "author": "garakthegardener",
                  "created": 1636669584,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk9hyef": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9hyef/",
          "text": "Im in STEM, so our situation is completely different. But just out of curiosity, how exactly are the European PhDs different? You said theyre more research based, so that means they read and study less, and write more?",
          "author": "Default_Dragon",
          "created": 1636672117,
          "upvotes": 2,
          "replies": {
            "hk9qdyy": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9qdyy/",
              "text": "I’m doing a PhD in the US, so grain of salt. But I do have a few friends who have done, or at least started, PhDs un Europe in similar fields. \n\nMy understanding is that a European Humanities PhD is more in line with the STEM experience. So a Masters that focuses on reading and coursework, followed by a PhD that emphasizes pure research. My friend doing a PhD in Germany didn’t even have to do Comps like I did. Getting the MA is seen as ‘good enough.’ But obviously that doesn’t mean they’re easier. There is still a lot of reading to cover the material you need to know to do your work. It’s more self directed and at need. Versus the US system which emphasizes the broad ground required to teach many different classes. \n\nPersonally I think the reading grounding is a strength, as is preparation for teaching, because it forces you to place things in different contexts. But it’s just not the economically viable model.",
              "author": "BeondTheGrave",
              "created": 1636676281,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk7pmye": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7pmye/",
      "text": "A few reasons that I can think of:\n\n\\- In many European countries, a PhD had a deadline. It's 3, sometimes 4 years. But the date is set from the beginning. In the US, your supervisor decides when they want to let you graduate. That usually doesn't happen in Europe in my experience.\n\n\\- Depending on if you count the UK as 'European', they can also go straight from undergrad to PhD, and still only have a 3 years PhD.\n\n\\- If you do a 1-year Masters, followed by a 3-year PhD, that is still much shorter than the average US PhD.",
      "author": "Cell_Division",
      "created": 1636645784,
      "upvotes": 24,
      "replies": {
        "hk7tw82": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7tw82/",
          "text": "Just want to clarify in the US your supervisor does decide when you can present but there are statutes of limitations.  For example most courses cannot be used if they are more than 6 years old. So typically a PhD candidate will be forced to graduate in 6 years or start retaking classes.",
          "author": "HSDropoutJK",
          "created": 1636647576,
          "upvotes": 5,
          "replies": {
            "hk80l22": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk80l22/",
              "text": "Even this is highly dependent on how you do your various examinations over the course of a PhD. I.e. you have to take all of your coursework within X years of your qual/comp exam(s), but after that there's no issue.\n\nAnd, alternatively, many schools will just say \"you've got 8 years, GLHF.\"",
              "author": "r3dl3g",
              "created": 1636650218,
              "upvotes": 3,
              "replies": {}
            },
            "hk90jg0": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk90jg0/",
              "text": "There is nothing typical about US PhD programs, they vary so greatly. In particular, I've never been at a US institution which had a 6 year limit on how long graduate course credits are valid for.",
              "author": "mleok",
              "created": 1636664717,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "hk7vrsj": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7vrsj/",
          "text": ">\\- In many European countries, a PhD had a deadline. It's 3, sometimes 4 years. But the date is set from the beginning. In the US, your supervisor decides when they want to let you graduate. That usually doesn't happen in Europe in my experience.\n\nYep, exactly. My supervisor told me that I had to finish by a certain date. So I set a very strict agenda (and yes I was very stressed). However when you submit your dissertation to external reviewers, they might suggest that you take more time to work on it.  A colleague in my cohort was supposed to graduate in March 2021, but reviewers suggested  major revisions for her dissertation, so she's actually graduating in March 2022 now, meaning that her PhD actually lasted four years.\n\nAlso at least in Italy for example, you \\*can't\\* take teaching contracts during your PhD. You might assist your PI with teaching, but it's not going to be a contract or something like that. Makes sense when your PhD has a deadline.",
          "author": "Normal_Kaleidoscope",
          "created": 1636648327,
          "upvotes": 2,
          "replies": {
            "hk8hiaw": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8hiaw/",
              "text": "In Sweden it's common to have up to 20% of your duties consist of teaching (no lecturing etc, but you'd usually be expected to TA a couple courses a year).",
              "author": "Herranee",
              "created": 1636656906,
              "upvotes": 11,
              "replies": {
                "hk8n185": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8n185/",
                  "text": "I've heard of that. In Italy you can only be an unofficial TA.  My PI never required us to do some TA, we'd only substitute them in case they were sick. However I think there is also a cultural dimension to this. In Italy being given responsibilities usually correlates with older age. I'm not saying everyone is like this, but I've often seen that important duties are never given to young people.",
                  "author": "Normal_Kaleidoscope",
                  "created": 1636659158,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk7tuj3": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7tuj3/",
          "text": ">\\- Depending on if you count the UK as 'European', they can also go straight from undergrad to PhD, and still only have a 3 years PhD.\n\nThis is relatively rare in my experience, but not unheard of\n\nMost do a masters first, though a UK masters is only 1 year, and in science often integrated with the bachelor, so you get a masters degree after 4 years of study.\n\nUK PhDs are typically 3, 3.5 or 4 years, no longer.",
          "author": "nickbob00",
          "created": 1636647558,
          "upvotes": 2,
          "replies": {
            "hk8lwyx": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8lwyx/",
              "text": "There’s a few subjects where two years full time is standard for masters.",
              "author": "AntDogFan",
              "created": 1636658695,
              "upvotes": 1,
              "replies": {}
            },
            "hkbb8qp": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbb8qp/",
              "text": "I’m just finishing up my PhD now, and my cohort was 50/50 on having a masters or not. But those who didn’t typically had a clinical degree or some pretty amazing RA experience and like a double/triple starred first.",
              "author": "ayeayefitlike",
              "created": 1636708825,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hk7wfhn": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7wfhn/",
          "text": "> - In many European countries, a PhD had a deadline. It's 3, sometimes 4 years. But the date is set from the beginning. In the US, your supervisor decides when they want to let you graduate. That usually doesn't happen in Europe in my experience.\n\nThis doesn't mean you can just graduate after the time is passed though - this just means the funding may stop. Each country is different.\n\nThe PhD program I'm in in Europe is set at 5 years (where the funding is guaranteed). The vast majority aren't in a position to graduate after this time, so the options are: 1, leave without a PhD - well, leave with nothing essentially as the option of \"master out\" isn't there. You can do a sort of degree, but it's not really valid in any other country. 2, continue the program with no income or 3, you're lucky your PI has external funding to keep paying you.",
          "author": "AgXrn1",
          "created": 1636648585,
          "upvotes": 2,
          "replies": {}
        },
        "hk8dgb8": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8dgb8/",
          "text": "> In many European countries, a PhD had a deadline.  In the US, your supervisor decides when they want to let you graduate.\n\nDo Americans think that this is a good or a bad thing? I guess the positive thing about having a deadline is that you don't end up in a neverending PhD hell for years, but as a third-year European PhD student with a deadline that is waaaay too close for comfort, I'm bricking it...",
          "author": "Chlorophilia",
          "created": 1636655287,
          "upvotes": 3,
          "replies": {
            "hk8u0og": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8u0og/",
              "text": ">Do Americans think that this is a good or a bad thing?\n\nIt's *overwhelmingly* a good thing ***if*** your advisor isn't a slave driver, which is why it's critically important to be careful when choosing advisors in grad programs in the US.\n\nMy advisor decided when the stages of my PhD were done, and as a result I sailed through my quals, comps, and defenses, entirely because his standards were higher than that of the department.",
              "author": "r3dl3g",
              "created": 1636662027,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "hk8m5jj": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8m5jj/",
          "text": "I’m uk based and my PhD has been five years full time with full funding for the whole period. The deadline is usually (in my experience) one of funding rather than submission. Most people I know submitted around 3.5 to 4.5 years. My funding body has a model which funds 4.5 years as standard.\n\nAlso to add I don’t know anyone who didn’t do a masters. Obviously all of this might be subject dependent as my experience is entirely in the humanities.",
          "author": "AntDogFan",
          "created": 1636658793,
          "upvotes": 1,
          "replies": {
            "hk8p4o5": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8p4o5/",
              "text": "There might be differences between sciences and humanities then. I come from a scientific degree, and we all had strict deadlines. We all started and finished more or less at the same time.",
              "author": "Cell_Division",
              "created": 1636660022,
              "upvotes": 3,
              "replies": {}
            },
            "hk90qwo": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk90qwo/",
              "text": "In talking with my STEM colleagues in the UK, my impression was that the funding agencies penalized future applications from PIs whose students took more than 4 years to complete their degree.",
              "author": "mleok",
              "created": 1636664800,
              "upvotes": 3,
              "replies": {
                "hk9hldc": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9hldc/",
                  "text": "We have a lot of pressure in the UK to get our PhD researchers to finish “on time” because of the Research Excellence Framework (national research quality review). The REF requires you to show what percentage of PhDs in your department finished within 3 years. Promotion applications also usually ask us the dates our supervisees started and finished. \n\nI’ve never heard of the research councils penalizing PIs though. Usually the funding is out when the funding is out and then the onus is out on the PhD researcher to cover tuition for the extra time needed.",
                  "author": "TheSeaSociety",
                  "created": 1636671955,
                  "upvotes": 1,
                  "replies": {
                    "hk9qmn4": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9qmn4/",
                      "text": "They might have been referring to the REF as opposed to EPSRC.",
                      "author": "mleok",
                      "created": 1636676396,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hkbh2se": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbh2se/",
                  "text": "It's not specific to PIs but universities as a whole. There is a particular benchmark for completion rate within 4 years (of full time study) which must be met. Most universities avoid getting anywhere near the benchmark so won't let people continue past 4 years without a good reason, but it's possible that OP's university is more lenient or the 4.5 year mark is largely due to covid delays.",
                  "author": "HW90",
                  "created": 1636713967,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk850k7": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk850k7/",
      "text": "Because an American PhD being a Masters+PhD is a myth the internet created to make the two seem equal. The vast majority of the Americans spend more than 4 years in full research mode and are only half time classes in the class years.",
      "author": "Mezmorizor",
      "created": 1636651979,
      "upvotes": 3,
      "replies": {
        "hk86kfn": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk86kfn/",
          "text": "Maybe this varies by field, but four years post-coursework as an *average* sounds insane. Most of the programs I know of in the social sciences provide 4–5 years of funding.  That’s not to say that some people don’t stick around longer and pay out of pocket, but there’s a strong incentive to finish that dissertation 2–3 years after your coursework ends.",
          "author": "EconGuy82",
          "created": 1636652583,
          "upvotes": 0,
          "replies": {
            "hk8bh8l": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8bh8l/",
              "text": "[Average PhD takes 5.8 years in the USA](https://www.usnews.com/education/best-graduate-schools/articles/2019-08-12/how-long-does-it-take-to-get-a-phd-degree-and-should-you-get-one). Some other surveys found even longer average times — 8 years total. \n\n(When I was in grad school, in the humanities, finishing \"quickly\" meant finishing in 5, most people were 6-7, some were 8 and up.) \n\nYes, there are incentives to finish more quickly. No, that doesn't mean that people do...",
              "author": "restricteddata",
              "created": 1636654501,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk7qrah": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7qrah/",
      "text": "I think it's because 2+3>3.",
      "author": "ndrsng",
      "created": 1636646273,
      "upvotes": 9,
      "replies": {
        "hk7rc0c": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7rc0c/",
          "text": "Hmmmm......",
          "author": "tomatoesonpizza",
          "created": 1636646517,
          "upvotes": 3,
          "replies": {}
        },
        "hk8kwut": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8kwut/",
          "text": "2 + FALSE = 2",
          "author": "--MCMC--",
          "created": 1636658285,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hk7pgll": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7pgll/",
      "text": "Probably because many Americans are used to their system and don’t know how European universities work. The only people I have seen claiming European PhDs are shorter were either from USA or Canada.",
      "author": "3ducklings",
      "created": 1636645710,
      "upvotes": 9,
      "replies": {
        "hk7vl4s": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7vl4s/",
          "text": "Wait, how is it not shorter?\n\nA US PhD generally take 5-6 years. As opposed to ~4 in Europe (including the masters). What am I missing here?",
          "author": "RagePoop",
          "created": 1636648253,
          "upvotes": 4,
          "replies": {
            "hk7xtjz": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7xtjz/",
              "text": "Masters in Europe is usually 2 years (as per the Bologna process) + at least 3 years PhD.",
              "author": "3ducklings",
              "created": 1636649131,
              "upvotes": 5,
              "replies": {}
            },
            "hk7z0rs": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7z0rs/",
              "text": "Getting into a PhD program with 1 year master isn't a thing afaik. You will need a 2 years master as you are required to have at least 300 ECTS (180 from Bachelor and 120 from the 2 years Masters).\n\nAlso, depending on the country, PhD duration is different. For example in Sweden, it is 4 years (+ 5 years of Bachelor/Masters).",
              "author": "ddeeppiixx",
              "created": 1636649601,
              "upvotes": 2,
              "replies": {
                "hk838ln": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk838ln/",
                  "text": ">Getting into a PhD program with 1 year master isn't a thing afaik\n\nDepends on the country and field. In the uk, 1 year master (course + a thesis at the end) are very popular in engineering at least. Then most PhDs are 3-4 years there, so you either get a master and PhD in 4 or 5 years. Can even be 3 years if you are a good student and skip the master directly to the PhD. That's the main reason most of my peers who decided to do a PhD went to the UK from Canada/US.",
                  "author": "methomz",
                  "created": 1636651280,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hk7xq5a": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7xq5a/",
              "text": "It's 3-4 years excluding the masters (which is 1-2 years).",
              "author": "bahasasastra",
              "created": 1636649094,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hk7vrjx": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7vrjx/",
          "text": "In the UK, your undergrad is only 3 years, 1 year MS, 3 - 4 year PhD. That is overall shorter by \\~2 years than the US system. Many STEM undergrads take on average \\~4 years undergrad, 2 years MS, \\~4 years PhD.   \nI've seen in Germany that it is 4 year undergrad, 1 year MS, 3-4 years PhD, which is still 1 to 2 years shorter than the time it takes for a US student to get their PhD. \n\nI think if you include the BS and MS times, it becomes more apparent that US students are in school longer overall, however they aren't expected to do a decade of being postdoc either so a couple years may be worth it.",
          "author": "rosealyd",
          "created": 1636648324,
          "upvotes": 5,
          "replies": {
            "hk7yrnd": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7yrnd/",
              "text": "Most programs in Europe follow the EU's Bologna process, which more or less standardized the length of education on 3 years for bachelors, 2 years for masters and 3-4 years for PhD.",
              "author": "3ducklings",
              "created": 1636649502,
              "upvotes": 3,
              "replies": {
                "hk87544": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk87544/",
                  "text": "Which is shorter than the typical US system of 4.5-5 years bachelors and 5-7 year PhD. I know like...3 people who did their PhD in 4.25 years. They happened to go to small schools with enough classes to make 4 year bachelors possible. They only finished the PhD that quickly because their PI runs an assembly line group that dictates projects from day 1, expects 4.25 years, and pulls funding after ~4.75 years. 6-7 years is a much better typical US PhD estimate. 5.5 or 5 years only happens if your PI thinks you're industry bound and you don't have setbacks.\n\nThere are also plenty of US fields where a masters is expected before the PhD which doesn't shorten the PhD process at all. The hard sciences don't do that, but it's not uncommon.",
                  "author": "Mezmorizor",
                  "created": 1636652802,
                  "upvotes": 3,
                  "replies": {
                    "hk8deue": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8deue/",
                      "text": "I was talking about minimum time required. Obviously, many people need more.",
                      "author": "3ducklings",
                      "created": 1636655270,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hk7ymhe": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7ymhe/",
              "text": "Dunno about MS but MA tends to be 2 years in Germany.",
              "author": "bahasasastra",
              "created": 1636649447,
              "upvotes": 1,
              "replies": {}
            },
            "hkbgiky": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbgiky/",
              "text": "You're missing that US students spend less time in school before university (12 years in the US vs 13 in the UK) and that 1 year master's are really 3 semesters so equivalent to 1.5 years. Using the standard timelines it's only half a year difference of time spent in school, but yes about 2 years later in terms of finishing age.",
              "author": "HW90",
              "created": 1636713488,
              "upvotes": 1,
              "replies": {
                "hkbsov6": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbsov6/",
                  "text": "1 year masters UK is just less than one actual calendar year, not 1.5 years. If you go by weeks of learning, (3 semesters, 10/8 weeks each vs. 4 semesters, 18 weeks each) it is also less. If you go by weeks actually writing thesis, it is still less (start MS after Christmas, have draft finished before Easter vs. one whole academic year to write thesis)\n\nAnd US kids spend the same amount of time in school as UK kids. Maybe some kids don't do pre-k, but are you saying missing 1 year of pre-k is equivalent to 1 year of college education?",
                  "author": "rosealyd",
                  "created": 1636721975,
                  "upvotes": 1,
                  "replies": {
                    "hkbts18": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbts18/",
                      "text": "You've missed the point and quoted incorrect info to back it up.\n\nUK and US semester lengths are both the same at 15 weeks. 18 weeks in the US is unusual, 8/10 weeks are only used by Oxbridge in the UK. A UK master's is typically 2x15 weeks for taught semesters plus 12 weeks over the summer for thesis writing, 42 weeks in total or pretty much 1.5 years equivalent where a US year is considered to be 30 weeks.\n\nUS kids do not spend the same amount of time in school as UK kids, with US kids starting at 5-6 and UK kids starting at 4-5. Yes it does make a difference, there's a reason why A levels grant advanced credit for entrance to US universities.",
                      "author": "HW90",
                      "created": 1636722580,
                      "upvotes": 2,
                      "replies": {
                        "hkc7esv": {
                          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkc7esv/",
                          "text": "US kids start school at 4-5 for pre-k\n\nA levels are granted credit at some universities. So are AP and IB classes, which I think are better suited for preparing a student for university level work compared to A levels. That is also why the IB system is starting to become more popular in the UK.\n\nUK semesters are on average 10 weeks. Oxbridge: 8 weeks, Manchester: 12 weeks, Edinburgh: 11 weeks. In the US you start at 16 weeks and go to 18 weeks as the average. \n\n  \nIf you do a UK MS, according to your math, you would do 30 weeks of taught classes, 12 weeks of summer writing. If you do a US MS, you would do 64 weeks of taught classes, 24 weeks of summer writing at least over two years. The extra year makes a huge difference along with the longer term times. On top of that, you would have an extra 32 weeks of taught undergraduate classes going into your MS.",
                          "author": "rosealyd",
                          "created": 1636729142,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk7zqtf": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7zqtf/",
      "text": "1) European PhDs (and Masters degrees as well, from what I've seen) follow a pretty strict timetable dictated by the Universities themselves. There's no such timetable in the US; it's not *that* uncommon for a Masters to take longer than 2 years.\n\n2) American PhDs come with class requirements that European PhDs don't, thus there's a certain amount of extra time that has to be included in an American PhD to account for the coursework. This is important because;\n\n3) European PhDs seem to stick to tracks much better than American ones do, i.e. your PhD is largely limited by what your undergrad and/or masters degree(s) were in. This isn't strictly true in the US, thus a lot of US PhD programs will also include padding from remedial courses to get the PhD student up to par.\n\n4) There's no guarantee that Master's students will have all of the \"correct\" coursework for their doctorate, particularly if they didn't consider getting a doctorate until after they had finished their Masters. Thus, some of their coursework doesn't always necessarily translate over.\n\n5) Some US grad programs involve a sort of \"forced\" lab rotation, where you have to try out a couple labs before settling into the one you actually want. This model is broadly going away (as it honestly is a waste of time for most students), but it still exists, and it still adds time to completion on PhD programs that Europe doesn't seem to have.\n\nGranted, an intelligently planned US PhD program will be, broadly, the same length as a European PhD program, and it can hypothetically be shorter. But the upper bound for US PhD programs is *considerably* longer, which moves the average time-to-completion up.\n\nThus, on average, a US MS-PhD or PhD program will (broadly) be a year or two longer than an equivalent European MS-PhD track.",
      "author": "r3dl3g",
      "created": 1636649885,
      "upvotes": 4,
      "replies": {
        "hk8s8ws": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8s8ws/",
          "text": "1) is absolutely not the case here, there is no time limit at all.  Usually the 3 years is for \\*funding\\* only. I know people who have been writing their thesis for 7-8 years. Also there is no timetable for the masters degree, you can take all courses whenever you want, even do it while working fulltime.\n\n2) My university requires coursework, however you can choose freely from a wide catalogue of topics related to your field of study.\n\ngenerally there is no \"European\" PhD since systems vary between country, state and even the University itself.",
          "author": "da_longe",
          "created": 1636661296,
          "upvotes": -1,
          "replies": {
            "hk9jmhl": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9jmhl/",
              "text": "As you said, Europe is big so we cant generalize too much, but I know here in France (Sorbonne, STEM) they are quite strict about finishing your PhD in under 5 years. We very much indeed have this idea of a time limit outside of just funding.",
              "author": "Default_Dragon",
              "created": 1636672868,
              "upvotes": 3,
              "replies": {
                "hkb5efj": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkb5efj/",
                  "text": "Switzerland here and there is often pressure put by the university to have people not go over four years (in stem). The research grants tend to run out. It's always a little specific to each field though",
                  "author": "futurespice",
                  "created": 1636703788,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk7ucm1": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7ucm1/",
      "text": "In my field, it is very rare to go from Bachelor's straight into PhD. Even for people who get accepted right out of undergrad, it is often an MS+PhD.",
      "author": "DrKimberlyR",
      "created": 1636647759,
      "upvotes": 2,
      "replies": {}
    },
    "hk84b9s": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk84b9s/",
      "text": "It's not just EU PhDs.. Canadians PhDs too. Basically almost only the US has hidden master requirements in their PhD programs because they commonly allow students to be admitted directly from undergrad and are trying to compensate for it. In any ways you try to turn it, it's longer in the US even if other countries have a master requirements. Outside the US, it takes you on average 4-6 years to get not only your PhD (3-4 years on average) but also your master (1-2 years on average) while in the US, it's 5-7 years to get only a PhD (most PhD programs do not give a master along the way). Moreover, because there's no hidden requirements inside the PhD programs outside the US, very good students can truly skip the hidden/required master part and end up with a PhD 3-4 years after their bachelor.\n\nThere are some professional degrees or terminal degrees too but those work differently.",
      "author": "methomz",
      "created": 1636651702,
      "upvotes": 1,
      "replies": {}
    },
    "hk8b9c2": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8b9c2/",
      "text": "In a lot of fields, 4 years for the research and writing process is normal, which adds to 7 years when you include the 3 years of coursework, MA/MS project, and comprehensive exams.\n\nMost historians or anthropologists in the US take at least 7 years, but 8 or 9 is not uncommon. Many scientists take between 7 and 8 years, too. And it's important to understand that this time to completion actually looks better than a 6 year program if the scholar secured several major grants along the way.\n\nThis is why European PhDs need a good postdoc to be competitive in the US. A strong US applicant will have 2-3 years of major external fellowships under their belt by graduation.",
      "author": "TheProfessorsCat",
      "created": 1636654412,
      "upvotes": 1,
      "replies": {}
    },
    "hk8xh87": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8xh87/",
      "text": "In the UK a masters is only 1 year, and you don't necessarily need to do a masters to do a PhD. I didn't do a masters and my PhD program was a 3.5 year training program, so if covid hadn't happened it would have only taken me 3.5 years vs the 5+ it would take in the UD.",
      "author": "UsernamesAreHard2684",
      "created": 1636663456,
      "upvotes": 11,
      "replies": {
        "hk9ip4d": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9ip4d/",
          "text": "From what Ive heard, the UK PhD system is the most different compared to America and the continent (ironic of course, since the UK is often seen as a bridge between the two). \n\nIve been told that in the UK you're discouraged from publishing before the end of your thesis, since the thesis is expected to be entirely original work.",
          "author": "Default_Dragon",
          "created": 1636672445,
          "upvotes": 3,
          "replies": {
            "hkb52qw": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkb52qw/",
              "text": "Not at all! You are definitely still encouraged to publish as much as you can, it's just not a requirement to pass. You can't use work from your masters or undergrad in your thesis, it has to be original work that you have done during the PhD, but it absolutely can be published work. You can still do the thesis by publication here too where you don't even need to write a thesis if you have enough papers, it's just not very common as the projects are quite short.",
              "author": "UsernamesAreHard2684",
              "created": 1636703532,
              "upvotes": 1,
              "replies": {}
            },
            "hkbbf9m": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbbf9m/",
              "text": "To add to the other comment, if anything publishing gives you a solid demonstration that your work meets the originality/novelty criteria because you’ve managed to publish it in a peer reviewed journal.",
              "author": "ayeayefitlike",
              "created": 1636708988,
              "upvotes": 1,
              "replies": {}
            },
            "hkbgmfh": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbgmfh/",
              "text": "> Ive been told that in the UK you're discouraged from publishing before the end of your thesis, since the thesis is expected to be entirely original work.\n\nThis is not true. It is significantly easier to the point of trivial to defend a thesis if the majority of the material is published. You simply have to disclose what parts of the thesis are based on previously published work. In fact it is perfectly acceptable to copy and paste everything from a published paper into your thesis (with of course rewording to make the thesis flow as a single document).",
              "author": "dukesdj",
              "created": 1636713583,
              "upvotes": 1,
              "replies": {
                "hkbxc9b": {
                  "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbxc9b/",
                  "text": "Interesting. I’m in France, and this is what we do. But I was explicitly told by a British friend the opposite (ie that in the UK your thesis has to be entirely original). Perhaps she’s misinformed or perhaps it varies by institution (she was at UCL)",
                  "author": "Default_Dragon",
                  "created": 1636724451,
                  "upvotes": 1,
                  "replies": {
                    "hkceobd": {
                      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkceobd/",
                      "text": "I would find that quite strange if that were the case at UCL! The originality has to be in the work and what it should be interpreted as is that the work should be original enough to be published. If it is actually published then this has demonstrated that it is indeed original (unless the reviewers did a poor job!). \n\nI think \"originality\" gets confused with \"never seen before\".",
                      "author": "dukesdj",
                      "created": 1636732207,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hkabqm8": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkabqm8/",
      "text": "An American PhD is not a MA + PhD. Some programs can be, but that is not the rule. So, the question is not accurate.",
      "author": "phenomenologist83",
      "created": 1636686232,
      "upvotes": 6,
      "replies": {}
    },
    "hk8dga9": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8dga9/",
      "text": "That is a misinformation. Not all the European PhD degrees take 3 years to be finished (that is min duration btw),  that is only possible in the UK, Germany, France and Italy but not other countries. For ex. In Sweden it takes 4-5 years to finish your PhD degree, you still need to have a two years Master degree before getting into a PhD project. During PhD, you don't teach or take any lectures, there is no prof efficiency exam, there is no proper graduate school etc.",
      "author": "earthsea_wizard",
      "created": 1636655287,
      "upvotes": 23,
      "replies": {
        "hk9jmue": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9jmue/",
          "text": "My German program in Neuroscience officially takes three years with the option to extend twice for half a year if you have a good reason. Further extensions are only granted in very rare special cases (say you were severely sick for an extended period).  \nLong story short, I barely know anyone who actually only took four years. What happens is people start working with their PI on the project before applying to the grad school. It's officially not allowed but there's of course an easily abused grey area if you worked with your PI on something unrelated before \"officially\" starting your PhD.",
          "author": "LittlePrimate",
          "created": 1636672873,
          "upvotes": 3,
          "replies": {}
        },
        "hkb73xx": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkb73xx/",
          "text": "[deleted]",
          "author": null,
          "created": 1636705194,
          "upvotes": 4,
          "replies": {
            "hkdcelg": {
              "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkdcelg/",
              "text": "No I'm not. I studied in Germany, perhaps you are the one generalizing. I've never seen any teaching or research assistant, no pro efficiency exam either. It isn't anything like the graduate system in the US. It is very project and research based system. I don't talk about doktorand degrees obviously, don't mix up that with PhD degrees.",
              "author": "earthsea_wizard",
              "created": 1636746078,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk9jm2k": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9jm2k/",
      "text": "Two words: course work.\nI entered my doctoral studies with TWO masters degrees and was still required to complete 36 hours of course work, at a major US research institution. That’s right, 36, after doing ~42 hours of grad school course work in the years preceding. This might account for the extra time…",
      "author": "DoctorRosenke",
      "created": 1636672863,
      "upvotes": 4,
      "replies": {}
    },
    "hk9u2c8": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9u2c8/",
      "text": "In Australia, PhDs are usually 3.5 years, although 4 is common too. Only need to have done undergrad (and usually honours) to undertake a PhD in my field (social sciences)",
      "author": "Prime255",
      "created": 1636678012,
      "upvotes": 2,
      "replies": {}
    },
    "hk97e5n": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk97e5n/",
      "text": "Because US PhDs are teaching and lab slaves.",
      "author": "radionul",
      "created": 1636667536,
      "upvotes": 2,
      "replies": {}
    },
    "hk91d8k": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk91d8k/",
      "text": "To start doctorate degree (phd) program in europe it takes either 4 or 6 years depending on region. Doctorate studies take 4 years (at least in Lithuania). So in total you spend around 10 years of studying and researching in university to get your doctorate diploma. \n\nNot quite sure how americans can begin phd program right after bachelor studies, since bachelor is just basic training on the subject.",
      "author": "Inccubus99",
      "created": 1636665048,
      "upvotes": 1,
      "replies": {}
    },
    "hk8v95u": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8v95u/",
      "text": "Because people aren’t aware that an American PhD is a European MS+PhD.",
      "author": "TakeOffYourMask",
      "created": 1636662538,
      "upvotes": 0,
      "replies": {}
    },
    "hk8s7m5": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8s7m5/",
      "text": "Because the US PhD is just a PhD + Masters combined. SInce the end result isn't a Masters, you just gain the Masters in process of the PhD.",
      "author": "bttrflyr",
      "created": 1636661280,
      "upvotes": 0,
      "replies": {}
    },
    "hk7y9w5": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk7y9w5/",
      "text": "[removed]",
      "author": null,
      "created": 1636649310,
      "upvotes": -6,
      "replies": {
        "hkaux18": {
          "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkaux18/",
          "text": "Lmao cope",
          "author": "oklmao21",
          "created": 1636696188,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk8xfmg": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk8xfmg/",
      "text": "I took 7 years total for Master's + PhD, same institution. That was a while ago now, and I think time to degree is now 5-6 years. It really rushes the diss. I also know European dissertators who've gone on for years and years and years. It depends.",
      "author": "raspberry-squirrel",
      "created": 1636663437,
      "upvotes": 1,
      "replies": {}
    },
    "hk91x92": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk91x92/",
      "text": "In Canada we need a master degree ( usually 2 years) to access PhD programs, which are 4-6 years",
      "author": "TarraReid",
      "created": 1636665272,
      "upvotes": 1,
      "replies": {}
    },
    "hk9pov3": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9pov3/",
      "text": "Becase in the US, even if you have a masters, you still have to do anywhere feom 3 to 10 courses, then pass comprehensive/qualifying exams and then, after those 2-3years are you allowed to begin writing your thesis, which can take anywhere from 2 to 5 years.",
      "author": "arok9",
      "created": 1636675954,
      "upvotes": 1,
      "replies": {}
    },
    "hkadzfm": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkadzfm/",
      "text": "It took me 7 years to finish.",
      "author": "BronzeSpoon89",
      "created": 1636687292,
      "upvotes": 1,
      "replies": {}
    },
    "hkb2chu": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkb2chu/",
      "text": "The statement that European PhDs are shorter is non-sensical because European PhDs differ significantly between countries. In some it's not a \"program\", one can do the PhD without being enrolled as a student. The length differs between countries as well, between 3 years in the UK and 5 years in Nordic countries, for example.",
      "author": "ColourlessGreenIdeas",
      "created": 1636701389,
      "upvotes": 1,
      "replies": {}
    },
    "hkb4qoi": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkb4qoi/",
      "text": "In the UK a masters is 1 year and a PhD is 3 and some change, totalling 4 years...",
      "author": "Buffy_and_the_key",
      "created": 1636703273,
      "upvotes": 1,
      "replies": {}
    },
    "hkbe484": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbe484/",
      "text": "Traditionally UK PhDs are 1+2. Your first year is essentially a Masters and then at the end of year one - after passing a review - you are \"Transferred\" to a PhD and complete in a total of 3 years.\n\nSo it's common to get into a PhD straight after a BSc which is 3+3. However, there is an increase in 4 year undergrad degrees often called MSc.\n\nThere is no requirement for a Master's to enter a PhD. UK degrees are classified as 1st, upper second, lower second and third class. If you have a 1st or upper second class UG degree then you can do direct entry. If you have a lower second, a Master's will be required.",
      "author": "Kiss_It_Goodbyeee",
      "created": 1636711414,
      "upvotes": 1,
      "replies": {}
    },
    "hkbgvmd": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkbgvmd/",
      "text": "Don’t you have courses to do in the first years of an American PhD program?\n\nThat’s what an honours program is before you do a PhD.",
      "author": "the6thReplicant",
      "created": 1636713798,
      "upvotes": 1,
      "replies": {}
    },
    "hkcnbku": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkcnbku/",
      "text": "European PhDs are way less rigorous",
      "author": "kakeman69",
      "created": 1636735708,
      "upvotes": 1,
      "replies": {}
    },
    "hk9dt9g": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hk9dt9g/",
      "text": "Because America doesn't make sense",
      "author": "av1652",
      "created": 1636670291,
      "upvotes": -2,
      "replies": {}
    },
    "hkaldcy": {
      "link": "/r/AskAcademia/comments/qrns8u/why_is_an_european_phd_considered_shorter_than_an/hkaldcy/",
      "text": "In Europe, they don't have Bachelors, instead, they have a thing called Licence which is 3 Years.\nEurope:\nLicence : 3 Years\nMaster : 2 years\nPhD: 3 years\nUSA: \nBachelor: 4 years\nPhD: 5 years",
      "author": "pkengnen",
      "created": 1636690851,
      "upvotes": -2,
      "replies": {}
    }
  }
}