{
  "sid": "jhd6ji",
  "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/",
  "title:": "Totally bombed my first TT job interview; advice from those who’ve been there?",
  "text": "I didn’t expect to get this interview and it was super last minute. Usually I interview pretty well but it was like the link between my brain and mouth was severed, and also all my neurotransmitters were replaced with molasses. Any tips for moving on? I do have another interview in a couple weeks and I’m feeling a lot more prepared for that one at least...",
  "author": "womanaction",
  "created": 1603561509,
  "updated": 1634080831,
  "over_18": false,
  "upvotes": 174,
  "upvote_ratio": 0.98,
  "comments": {
    "g9xpfbj": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9xpfbj/",
      "text": "It gets easier after the first one. \n\nCongrats on getting interviews! It's trickier to do this via zoom, but if you come away excited or unsure, listen to those feelings. I hope the next round is a good one!",
      "author": null,
      "created": 1603564000,
      "upvotes": 129,
      "replies": {}
    },
    "g9xslqg": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9xslqg/",
      "text": "Not a TT position, but a Lead Scientist position at a govt lab. I spent months prepping a perfect application package and then job-talk, and it went so terribly-bad on interview day... The job was in a city that my wife really wanted to live, letting her down was actually harder than not getting the job.\n\nI did eventually get a similar job in the same city and now interact with the group that didn't hire me and I actively collaborate with the person they hired. Through that collaboration, I've realized the second job (the one I got) is way better than the first, better group of scientists, better supervisor, and I've made huge advancements in my research and career because of opportunities I've had through my current job that I wouldn't have had in the first.\n\nLong story short, I've never been a fan of the \"everything happens for a reason\" aphorism. But sometimes things really do turn out for the better, even when the process is debilitatingly painful.\n\nStick with it, and have whiskey/wine/beer on hand for when self-administered platitudes don't seem to be working any more.",
      "author": null,
      "created": 1603565635,
      "upvotes": 63,
      "replies": {}
    },
    "g9xtmzd": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9xtmzd/",
      "text": "Echoing everything said here. My first Skype interview was for a TT position at a dream school with a long prolific history in my field. Literal MacArthur Genius recipient among the faculty interviewing me. I fucking BOMBED. Rambling, incoherent, trying too hard, intimidated, etc. I wanted to cry the moment I ended the call because I knew I fucked up. AND it was my birthday. I’m serious.\n\nHowever, I’ve since had a few more Skype interviews and on campus interviews. In fact, the dream school invited me back two years later for an on campus interview for another TT position. I didn’t get it, but I was able to land a TT offer during that same cycle and I’m now an Assistant Prof at an R1.\n\nFirst, as others have said, congratulations on getting interviews. You’ve done, and are doing, something right.\n\nSecond, everybody seems to go through this because we get very little training here. Virtual meetings are harder and will take some getting used to. They will get easier. Just keeping going — you will learn from this and get better.\n\nI would recommend that you try to anticipate what the search committee checklist includes. They need to know you’re sane and that you can express yourself clearly. They’re probably always going to ask about your research, what courses you would teach, how your teaching is inclusive, what projects or grants are upcoming, etc. They are just vetting you to see if you’re legit. And you are because you got the interview. Have canned (or semi-canned) responses with an eye toward what’s in it for them. For example, they usually ask about what courses you can teach and how you can incorporate undergrads into research because they are trying to increase course enrollment and majors. Greater enrollment and major numbers is financially (and otherwise) beneficial for them from a college and university perspective. They don’t actually personally care about your courses or research (some might)! Just remember that it’s really about THEM and what you bring to their department. That will take a little digging on your part to learn about their history, what they’ve done, and maybe what they’d like to do, sort of in a bigger picture departmental or college “mission” kind of way. That seems like a big task at face value but it’s really not. Did somebody just retire and they’re looking to fill that teaching void? Can they do that and also get a badass new faculty member? Bingo! Just try to find ways that you naturally check off as many boxes as possible.\n\nAnyway, I know this sucks and feels bad. Many of us have been there. But you can and will learn from this. It’s so awesome that you’re getting interviews. My mantra lately has been “just keep going.” Manuscript or grant proposal rejections, bad teaching days, etc. Tenacity seems to be a bigger predictor of success than entirely avoiding failure by giving up. I hope this helps somehow. Good luck! You got this 👍",
      "author": "northamrec",
      "created": 1603566179,
      "upvotes": 43,
      "replies": {}
    },
    "g9xrchj": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9xrchj/",
      "text": "It gets easier. Everyone I know bombed their first phone interview, myself included. Make sure you do something to celebrate getting through it- getting interviews is a big achievement.",
      "author": "kytai",
      "created": 1603564982,
      "upvotes": 55,
      "replies": {
        "g9y8c4f": {
          "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9y8c4f/",
          "text": "Same here. I bombed mine too last year - and hoping I get more this year. I was asked how much startup grants I would need and what equipments I would be looking to get with them. I had rough numbers, but what was required at that point was practiced details which I didn't have.",
          "author": "N1H1L",
          "created": 1603573110,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "g9xrk43": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9xrk43/",
      "text": "Reflect on the experience and use it to improve. I bombed my first TT interview - so I figured out what went wrong and how to make it better.  There were some additional weird things that happened there that haven't happened since so I'm thankful for the experience even if it wasn't the best. I would probably think about it more if I ever ran into those people, but it's on the other side of the country and I haven't seen any of the names/faces again in my professional life thus far!",
      "author": "apple-jacks",
      "created": 1603565093,
      "upvotes": 19,
      "replies": {}
    },
    "g9xzd98": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9xzd98/",
      "text": "Congrats on lading an interview. I totally fucked my first interview. After that, each subsequent interview got easier and now I’m in a TT position.\n\nI check out The Professor Is In’s interview prep content if you haven’t. It was a huge help.",
      "author": "Mtt76812",
      "created": 1603569250,
      "upvotes": 12,
      "replies": {}
    },
    "g9y90d6": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9y90d6/",
      "text": "I felt that way after my first TT interview. It was online and I had tech problems during my teaching demo and I felt like I asked the wrong questions at the end; the committee seemed annoyed with my questions. I didn’t get the job,  but actually a year later they posted the same job and I thought it was probably a waste of time but I wrote a cover letter explaining my continued interest and how I had further strengthened my experience. The chair wrote and said they were happy to see my name again and invited me for another interview.\n\nAlthough in the meantime I had a couple other interviews and found a different school that was the perfect fit and I nailed that interview. So I was know everything worked out the right way.",
      "author": "UniversityUnlikely22",
      "created": 1603573367,
      "upvotes": 11,
      "replies": {}
    },
    "g9y91e8": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9y91e8/",
      "text": "I’m a tenured faculty member. Been doing this a long time. I’m really good at my job. \n\nIn the past three years, I’ve bombed two interviews that I was head hunted for. Whoops. \n\nGood candidates have bad days. Don’t let it get you down.",
      "author": "dr_police",
      "created": 1603573378,
      "upvotes": 12,
      "replies": {}
    },
    "g9y51i7": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9y51i7/",
      "text": "Advice from the other side of the table / Zoom screen:\n\n1. It’s never as bad as you think.\n2. The panel aren’t really listening and are thinking about Netflix / dinner / their next Netflix and chill\n3. They probably already have a candidate in mind\n\nSo don’t sweat it. Have a think why maybe it didn’t go so well this time and maybe jot down a few notes. It gets easier.",
      "author": "reversechinlock",
      "created": 1603571749,
      "upvotes": 21,
      "replies": {
        "g9yty4p": {
          "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9yty4p/",
          "text": ">Advice from the other side of the table / Zoom screen:  \n>  \n>It’s never as bad as you think.\n\nI'm with you on #1 entirely. But I would be appalled if my colleagues were not taking their roles in search committees seriously. I've served on a couple dozen over the years and thankfully have never once seen that happen.\n\nThat said, the converse of #1 is true also: it's rarely as *good* as candidates seem to think either. I've had lots of experiences with cocky candidates who come in thinking the job offer is a sure thing and they are the shit...who often end up a distant third place to candidates who weren't cocky. But that's probably a function of the SLAC market, where we occasionally get someone who thinks they are slumming by interviewing outside of the R1s.",
          "author": "SnowblindAlbino",
          "created": 1603580747,
          "upvotes": 11,
          "replies": {
            "ga1ejje": {
              "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/ga1ejje/",
              "text": "Regarding colleagues not taking their roles seriously, the point is that candidates think that panelists are hanging on their every word. We are not. I was trying to play down how perfect a candidate needs to be. We are human and concentration wavers. Especially towards the end of the week.",
              "author": "reversechinlock",
              "created": 1603621237,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "g9y1t8i": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9y1t8i/",
      "text": "I also didn't do as well as I'd hoped on my first TT interview.  I actually began getting a migraine with aura with about 4 hours (including my teaching demo) remaining.  I did my best to power though, but I suspect I came across as impatient and perhaps a little drunk? \n\nMy second and third interviews were better. My fourth interview likely the best. \n\nTake a bit of time to write down what you can remember about what they asked you, its all likely to come up again. You can practice answers versions of those questions for yourself, either in writing, or aloud to yourself/pet/partner/friend.  I found that once I had confidence in what I saw saying I could think on my feet a bit better. \n\nI also spent sometime wearing my interview outfits around so I didn't feel totally non-myself while wearing them. I know that sounds odd. But, I think that made me feel more comfortable with the version of myself I needed to present, and it really helped with my confidence.",
      "author": "TourmalineTart",
      "created": 1603570344,
      "upvotes": 7,
      "replies": {}
    },
    "g9zl4rn": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9zl4rn/",
      "text": "I thought I bombed my first one too. I was scared shitless, in a new state, at a big school. I didn’t get the job. Thankfully it wasn’t my dream job and I had a much better experience in the next interview. Learn from it and move on!\n\nAnd honestly, interviewing or doing any presentations over zoom is hard. So congrats on getting the interview and good luck on the next one!",
      "author": "zabulon_",
      "created": 1603590864,
      "upvotes": 4,
      "replies": {}
    },
    "g9y2dum": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9y2dum/",
      "text": "Look up the tenure requirements so you can talk about them.\n\nBe able to lay out your research agenda in short sound bites- both what you are working on now and how that will build over the 1st six years.\n\nAlso sound bites on teaching. Of course you’ll take on the huge intro classes, and this is how I plan to make them interesting. But I also see that no one is teaching such and such, and I would like to build a class or classes in that area.\n\nStudents need to see how your subject area connects to the real world. Will you bring people in, include UGs in research, help them get internships... or whatever works best in your field.\n\nIf you do a demo class, PRACTICE!\n\nLastly, have the idea in your head that you are interviewing them. Make sure it’s a good fit for you.",
      "author": "zastrozzischild",
      "created": 1603570599,
      "upvotes": 6,
      "replies": {}
    },
    "g9y404g": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9y404g/",
      "text": "Agree with others here. I said some stupid shit during my first TT interview.",
      "author": "gone_to_plaid",
      "created": 1603571295,
      "upvotes": 3,
      "replies": {}
    },
    "ga0q9uv": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/ga0q9uv/",
      "text": "Before your 2nd interview, find people to practice with. Answer questions, give the job talk, the chalk talk - whatever your format is. Maybe even look at this sub, or at r/Professors :) Ask for volunteers who would donate some time to listen to your story, and provide some advice. General advice is, just that, too general. Like, I don't even quite know your field, for example, and it may matter; as well as the type of institutions you are applying for.",
      "author": "ampanmdagaba",
      "created": 1603608049,
      "upvotes": 3,
      "replies": {}
    },
    "g9y0j9y": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9y0j9y/",
      "text": "I've never been invited for a TT interview",
      "author": "radionul",
      "created": 1603569771,
      "upvotes": 4,
      "replies": {}
    },
    "ga04c3f": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/ga04c3f/",
      "text": "That’s tough and I appreciate the special feeling of misery when it seems like your actions were to blame’; my first interview for grad school went like what you described. Assume it happened for a reason. For instance even though I wasn’t offered the position in grad school where I bombed the interview, it was in a snowy small town I would have HATED to live in. Somehow, that must have come through in my interviewing even if unconsciously. But only now with time and better self-perspective can I see that clearly. On the flip side, I thought I rocked my first TT interview and they still went with someone else so your performance is only ever only part of the equation. Same advice applies. Assume it happened for a reason. In my case not getting that job was the incentive I needed to find the current new job I have at a prestigious institution in a cool city more aligned with my lifestyle priorities but it never would have happen if the first place had accepted me. It stings now but use this as information and keep at it when you are ready. Good things are coming your way, that I am absolutely sure of.",
      "author": "ScientistLiz",
      "created": 1603598095,
      "upvotes": 2,
      "replies": {}
    },
    "g9zrkii": {
      "link": "/r/AskAcademia/comments/jhd6ji/totally_bombed_my_first_tt_job_interview_advice/g9zrkii/",
      "text": "What does TT mean? The guy you race against in Diddy Kong Racing?",
      "author": "Blindfide",
      "created": 1603593274,
      "upvotes": -6,
      "replies": {}
    }
  }
}