{
  "sid": "qceff9",
  "link": "/r/AskAcademia/comments/qceff9/are_online_resources_like_jstor_and_zlibrary/",
  "title:": "Are online resources like JSTOR and z-library sufficient to keep up with current knowledge in humanities fields?",
  "text": "I studied history at undergrad, and graduated last year with a good but not spectacular grade. With all the uncertainty about how degrees would be managed during covid, and because I found other work and would like to travel / improve some foreign languages I speak, I've decided that I don't immediately want to do a postgrad. I figure it's not a bad thing to take ~3 years off in-between, but a ~10 year gap would probably be a real issue if I wanted to get a PhD and work in academia. \n\nAlthough I was a touch burned out after graduating, I've recently began doing quite a lot of academic reading online, and it makes me wonder if I could continue doing so as a hobby for an extended period then jump back in where I left off.\n\nIn your opinions, is it possible to stay up to date with current scholarly knowledge in a field without access to a university library, an academic mentor etc? Are there any potential problems I should consider?",
  "author": "crossbowthemessenger",
  "created": 1634773947,
  "updated": 1634849156,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hhfr8jt": {
      "link": "/r/AskAcademia/comments/qceff9/are_online_resources_like_jstor_and_zlibrary/hhfr8jt/",
      "text": "Personally, I would enroll as a non-degree-seeking student in elective courses you are interested in but will not find bothersome to attend (such as yoga, weightlifting, drawing 1, etc.) at a nearby university just to have access to the databases if this is your intent. Pay a minimal fee each semester to keep doing research while also getting some of your side interests fed without having to worry too much about grades.",
      "author": "biglybiglytremendous",
      "created": 1634779155,
      "upvotes": 5,
      "replies": {
        "hhhk9d8": {
          "link": "/r/AskAcademia/comments/qceff9/are_online_resources_like_jstor_and_zlibrary/hhhk9d8/",
          "text": "I will add that collaborating in a lab even if súper part time will help you getting published. I have seen people get a post doc after 8 year of being outside of academia by collaborating 5-8 hours a week and getting published",
          "author": "quemacuenta",
          "created": 1634822377,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}