{
  "sid": "i5mwmn",
  "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/",
  "title:": "Filing a complaint against PI for mistreatments of employees",
  "text": "In past I worked for a bad PI. I left the lab without asking for her recommendation. A year later, I am witnessing another employee (a technician) of hers leave the lab after working for 2 years. He asked for her recommendation and she is saying negative things about his work ethics. She is lying. She has lied on multiple occasions in past, for petty things to very serious matters. Should he complain to HR about her in his exit interview? Or is it not worth it? Do they every take any action against PIs? I left without complaining but I want to do so now, so future employees don’t suffer. It’s been an year since I left. Should I file a complaint?",
  "author": "worm1010",
  "created": 1596836975,
  "updated": 1634081981,
  "over_18": false,
  "upvotes": 96,
  "upvote_ratio": 0.96,
  "comments": {
    "g0qkay5": {
      "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/g0qkay5/",
      "text": "Speaking as a senior administrator, yes, you should complain.  You will get zero satisfaction in the sense that you will never see the impact of your complaints, but good institutions have memory and when the opportunity comes, repeat offenders will be kept from positions of authority and/or pushed out altogether.",
      "author": "bigrottentuna",
      "created": 1596844426,
      "upvotes": 98,
      "replies": {}
    },
    "g0qpjq2": {
      "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/g0qpjq2/",
      "text": "You need him to start a paper trail about this person. It is highly likely that they will continue to abuse future employees. I have heard of strong and detailed complaints in exit interviews being brought to powerful peoples attention, resulting in more limited opportunities for that PI to get future student employees. It is worth it, but you have to be frank.",
      "author": "Thumbeleena",
      "created": 1596847330,
      "upvotes": 29,
      "replies": {}
    },
    "g0r4myl": {
      "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/g0r4myl/",
      "text": "There may not be anything from this complaint.\n\nOn the other hand, if nobody reports it, there won't be a trend of complaints, either.",
      "author": "ph0rk",
      "created": 1596855975,
      "upvotes": 7,
      "replies": {
        "g0rnvsa": {
          "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/g0rnvsa/",
          "text": "This is exactly my thought. It makes me very angry. But I need to put my emotions aside and write down my complaint objectively with a calm mind. It will take time, but I sooner or later I will do it.",
          "author": "worm1010",
          "created": 1596870146,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g0qazuz": {
      "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/g0qazuz/",
      "text": "If this person is tenured, it would take more than your word for anything to happen to her. Honestly, students don’t have much power in a situation like this.\n\nAdded: I can give you an even more serious example from a professor on an exit interview. Professor A didn’t get tenure. On her exit interview, she mentioned that professor B harassed her in various ways (not sexual) and that professor B also harassed me (professor C) by calling me a lesbian.\n\nI found out about this when HR called me to get my side of the story. I told them I don’t find the word lesbian offensive so I would not consider it harassment. \n\nThis is different but it had the potential of going somewhere ( 2 junior professors vs. senior professor). Your issue is likely to go nowhere unless you get more facts in writing and with other students involved.",
      "author": "ThatProfessor3301",
      "created": 1596839437,
      "upvotes": 26,
      "replies": {}
    },
    "g0rzagp": {
      "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/g0rzagp/",
      "text": "My former lab had a lot of complaints of harassment and nepotism. We had ONE person complain and HR of the department got involved and asked to interview a few people or to have people come to their office anonymously. You’d be surprised because one little complaint can lead to a full blown investigation b/c people are more likely to come forward when its anonymous and they don’t have to start it. If you feel comfortable and safe doing so, being that whistleblower might be worth it. Our lab went through some serious investigations that led to mandatory re-orientations on sexual harassment, racial targeting, and nepotism (in my example). \n\nI think it definitely changed the PI’s outlook/they were more accommodating so nothing like this would happen again. They tiptoed around us and essentially gave us anything we needed because they now knew we collectively held the power to shut them down with another complaint. Just make sure you stay anonymous to avoid retaliation and so the situation doesn’t escalate. \n\nSo at least in my experience, yes. HR did take it VERY seriously and the PIs (since they RUN the lab) were definitely the ones in trouble, not us. Good luck! I hope my example helped!!",
      "author": "helluvaresearcher",
      "created": 1596881635,
      "upvotes": 4,
      "replies": {}
    },
    "g0qzkfp": {
      "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/g0qzkfp/",
      "text": "I think that if you feel safe doing so and are able to, you should file a complaint. I've been in similar situations and it sucks.\n\nA tech I worked with wanted to file a complaint against a PI . The PI was very intimidating so other past employees who had experienced his abuse were afraid to speak up. The tech didn't file a complaint because they had little support. They were afraid of the PI \"coming after them\" with it being their word against the \"well-respected\" PI. \n\nYou might not get anything out of it, and honestly, in my experience, HR often doesn't do anything about it. However, I think this can be helpful for future employees if they need to file a complaint. It just gives them support and is evidence of the PI's history of maltreatment.",
      "author": "memsies",
      "created": 1596853028,
      "upvotes": 3,
      "replies": {}
    },
    "g0rjoy7": {
      "link": "/r/AskAcademia/comments/i5mwmn/filing_a_complaint_against_pi_for_mistreatments/g0rjoy7/",
      "text": "Not a professor, I’ll just say any bad boss deserves to be booted. You don’t stay on top by pushing others down.",
      "author": "MinotaurOnLucy",
      "created": 1596866452,
      "upvotes": 2,
      "replies": {}
    }
  }
}