{
  "sid": "cy6eus",
  "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/",
  "title:": "PhD advisor published my work without my knowledge after I left academia",
  "text": "Throwaway account for obvious reasons...\n\nI finished my Ph.D. in 2019 and left academia for a career in tech. \n\nTonight I just discovered that my PhD advisor published work from my dissertation without adding me as a co-author or mentioning me in the acknowledgments. \n\nI actually knew about this paper a few months ago, but I didn’t realize it actually got published. In my gmail history, the last message about the manuscript left off with me asking if my advisor had any questions about the paper and included the paper as an attachment. In the original draft, both of our names were on the paper with my name listed first — since the work came from my dissertation. \n\nAt first I thought, “hey, maybe this paper is completely different from the earlier draft.” But full sentences were lifted from the original draft and from my dissertation. \n\nSince I left academia, this doesn’t affect my now non-existent academic career. But I’m still kinda bothered that my advisor published from my dissertation without mentioning me at all in the paper. \n\nTIL; I left academia and later found out my PhD advisor published from my dissertation without including me as co-author or adding me to the acknowledgements. \n\nAny advice?\n\n—\nUpdates:\n\nSo I decided to go ahead an email my advisor. Maybe this was an oversight (albeit a pretty large oversight) and by reaching out to my advisor it can be resolved quickly. \n\nThis paper is part of a book. I reached out to a couple colleagues who also published in the book. They said that the editor mentioned I was no longer interested in being a co-author since I left academia. I am awaiting a paper trail of this conversation. Since the original drafts had me listed as a co-author, I’m not sure at what point in time I allegedly gave up authorship.",
  "author": "dsci482712",
  "created": 1567317453,
  "updated": 1634080421,
  "over_18": false,
  "upvotes": 268,
  "upvote_ratio": 0.99,
  "comments": {
    "eyqnzxb": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqnzxb/",
      "text": "This is a serious instance of academic misconduct and you should report it to the campus Research Integrity Officer, typically the Vice President for Research (I am that person for my university).  Department Chairs generally will not know what to do with such a report.",
      "author": "bigrottentuna",
      "created": 1567348947,
      "upvotes": 218,
      "replies": {
        "eyr74gt": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyr74gt/",
          "text": "This. Your advisor is engaging is some serious integrity misconduct and a full investigation by the university (NOT your department or college) is warranted.",
          "author": "middledeck",
          "created": 1567362011,
          "upvotes": 53,
          "replies": {}
        },
        "eyrcd4z": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyrcd4z/",
          "text": "This. Over burden the RIO with evidence. Emails, drafts, etc. They need to act on this shady act\n   Edited a fat finger type and removed a word.",
          "author": "dgreen85",
          "created": 1567365032,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "eyqlyd0": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqlyd0/",
      "text": "What you have described is plagiarism. Dissertations are often indexed and searchable, so it's likely not a hard case to prove if it occurred as you described.\n\nContact your former department's chair with this information. If they do not move forward with it, contact the editor of the journal in question. Be polite, but firm. If what you described occured (entire sentences lifted, etc.), this is not ok.",
      "author": "WrestlingStuffGuy",
      "created": 1567347304,
      "upvotes": 129,
      "replies": {
        "eyqs22f": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqs22f/",
          "text": "I worked as an assistant to an academic journal editor for a short period of time, and if I were in your position, I would contact the dept. chair and the editor simultaneously. This is clearly a case of plagiarism, and it is up to those two parties to work out the details. You could even make the report anonymously. I am not a lawyer, but it is likely that the university’s lawyers will be in on the discussions. If they are smart, they will offer you an “apology for the oversight” to avoid prosecution. Don’t sign anything without a lawyer looking over the paperwork. \n\nThere is no guarantee that you won’t want to return to academia in the future, and it’s better for your career to claim your accomplishments now than to roll over and play dead.",
          "author": "MILeft",
          "created": 1567352092,
          "upvotes": 67,
          "replies": {
            "eyqutnu": {
              "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqutnu/",
              "text": "This I great advice, thanks!",
              "author": "dsci482712",
              "created": 1567354132,
              "upvotes": 16,
              "replies": {
                "eyqv1tp": {
                  "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqv1tp/",
                  "text": "Post the update for us later. \nWishing you all the best.",
                  "author": "MILeft",
                  "created": 1567354288,
                  "upvotes": 17,
                  "replies": {}
                }
              }
            },
            "eyr5ac8": {
              "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyr5ac8/",
              "text": "Skip the department chair, bring the evidence higher up the hierarchy, for example, my institute has an Office of Research Integrity. The journal editors are a good idea of course. Present the case calmly and don't give up, keep up the attack if they don't respond at first. Hopefully, the thief loses his job.",
              "author": "ARealRichardHead",
              "created": 1567361062,
              "upvotes": 14,
              "replies": {}
            },
            "eyraenj": {
              "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyraenj/",
              "text": ">This is clearly a case of plagiarism, and it is up to those two parties to work out the details.\n\nI've been through this with work published in my Dissertation. After it was published by my former lab without my knowledge, the journal editor said \"contact the University, not our problem and out of our control\" and the University said \"the researcher has moved to another institution, contact their new employer\". The new institution said they wouldn't do anything. I also had a lawyer send a letter, but it got nowhere.\n\nSo at least in my case, there were no penalties for the plagiarism. Of course that was long ago, maybe social media and the internet can help to shame some of these people into doing the right thing. But the bottom line is it comes down to $$$, if the researcher is bringing in million dollar grants, the institutions aren't going to sanction them, withdraw a publication, or fire them because a former colleague was left off a paper.",
              "author": "bobzor",
              "created": 1567363843,
              "upvotes": 7,
              "replies": {
                "eyrdmci": {
                  "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyrdmci/",
                  "text": "I would consider taking that to something like the chronical for a call out of the journal",
                  "author": "PBandJammm",
                  "created": 1567365914,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "eyseqbf": {
              "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyseqbf/",
              "text": "Think you replied to the wrong person. :)",
              "author": "WrestlingStuffGuy",
              "created": 1567395705,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "eyr3ac9": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyr3ac9/",
      "text": "\"No longer interested in being a co-author since I left academia\"\n\nUh... that's not how it works.",
      "author": null,
      "created": 1567360084,
      "upvotes": 55,
      "replies": {}
    },
    "eyqx06k": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqx06k/",
      "text": "Don’t let that professor get away! He will do it again!",
      "author": "Bhopali2",
      "created": 1567355692,
      "upvotes": 17,
      "replies": {}
    },
    "eyqyihd": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqyihd/",
      "text": "OP, I saw your update.  If it's a book, is it already in print?  You should contact the editors ASAP and let them know.  A book with a plagiarised section is a serious fuck up, and if they are making money off the book (unlikely) you may be due some compensation.  I don't think you should drop it.  I feel next to falsifying data, plagiarism is the most serious professional misconduct in academia.  I've heard of this happening before and it always strikes me as so easy to fix: all he had to do was put your name on it.\n\nAlso consider posting this on r/legaladvice",
      "author": "preacher37",
      "created": 1567356797,
      "upvotes": 26,
      "replies": {
        "eyt07k4": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyt07k4/",
          "text": "He was just trying to up his own citation count and build clout for himself with a successful solo work, and clearly did so since he thought he could get away with it given OP had left academia.\n\nIt sounds like, per my understanding, the editors were aware and accepted the bogus excuse that OP didn't want a citation and so it was ok to not give him credit. I agree this is some obscene plagiarism, but the misconduct seems to reach beyond just OP's advisor being a little punk. \n\nIdk about legal advice, I would reach out to the University. They seem like the most likely party to swiftly take action. Such a flagrant and obviously malicious case of academic misconduct being traced back to their school, impacting their recruitment, enrollment, retention, how their research programs are perceived in the academic community, and most of all their funding? Nope.",
          "author": null,
          "created": 1567418492,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "eypzlia": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eypzlia/",
      "text": "You could send a complaint to the person's department, but have you considered first reaching out to your supervisor and asking what's up? If this was a submitted dissertation, even if unpublished, it should have been cited in the paper published.",
      "author": "boringhistoryfan",
      "created": 1567317616,
      "upvotes": 54,
      "replies": {
        "eypzsd4": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eypzsd4/",
          "text": "Yeah, I could reach out to my advisor. But after working with them for 6 years, I’m fairly certain their reaction wouldn’t lead to a quick resolution of the issue",
          "author": "dsci482712",
          "created": 1567317866,
          "upvotes": 39,
          "replies": {
            "eypzyie": {
              "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eypzyie/",
              "text": "It might give you an explanation though. If you don't like what they have to say, feel free to reach out to their superiors. You can either write to the department head or bypass them entirely and reach out to the university directly. You can independently write to the journal alleging plagiarism.\n\nIf you're really eager to raise hell, find out if you can issue DMCA notice against the paper.",
              "author": "boringhistoryfan",
              "created": 1567318089,
              "upvotes": 14,
              "replies": {
                "eyqf6ms": {
                  "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqf6ms/",
                  "text": "What possible explanation can there be?\n\nYou know how buddy will react to \"hey did you steal my work?\" It won't be pretty.",
                  "author": "ThePhysicistIsIn",
                  "created": 1567340740,
                  "upvotes": 27,
                  "replies": {}
                },
                "eyqci7r": {
                  "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqci7r/",
                  "text": "The problem with reaching out to the supervisor first is you give the person a warning to start covering their tracks and concocting an explanation. I’d figure out what kind of resolution you’re aiming for before you make your first move.",
                  "author": "Ronnie_Pudding",
                  "created": 1567337344,
                  "upvotes": 33,
                  "replies": {
                    "eyqxlwq": {
                      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqxlwq/",
                      "text": "Sweet summer child, why would you give an advisor a head start in fucking you over?",
                      "author": "kinderdemon",
                      "created": 1567356138,
                      "upvotes": 18,
                      "replies": {}
                    },
                    "eyqugrp": {
                      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqugrp/",
                      "text": "I'm not sure what they could successfully hide though if OP has an email trail of this copy being sent, a copy of the dissertation, and a copy of the published paper. They're banking on OP not caring.",
                      "author": "mediocre-spice",
                      "created": 1567353867,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eyrfjq4": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyrfjq4/",
      "text": ">  They said that the editor mentioned I was no longer interested in being a co-author since I left academia.\n\nLOL how could that ever be used as a justification what a joke. If you find that paper trail it's going to be great material for an Responsible Conduct in Research training session.",
      "author": "pastaandpizza",
      "created": 1567367319,
      "upvotes": 14,
      "replies": {}
    },
    "eyqssfv": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqssfv/",
      "text": "To be honest, I would probably contact someone at the journal the article was published in first. Then I'd contact the department chair. To me, it wouldn't matter if you left for industry because it's still your work that was plagiarized. To add that you were not even credited as co-author is icing on the cake. That should have been the bare minimum. Given my own history of how department chairs protect their own, I wouldn't expect much to happen on that front but you never know.",
      "author": "FolkMetalWarrior",
      "created": 1567352630,
      "upvotes": 17,
      "replies": {}
    },
    "eyrqkwr": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyrqkwr/",
      "text": "This is honestly worth ending an academic's public reputation and, if possible, career over, it is that egregious. Since you are no longer in academia and therefore should have no fear of retaliation, you would do a service to the academy, to students in your previous department, to your previous discipline and to your alma mater to publish his/her name online, possibly in a letter to the Chronicle of Higher Education.\n\nPublishing a PhD advisee's work without permission, let alone without attribution, is the worst kind of copyright theft and a fundamental breach of trust. It is far worse than ordinary plagiarism. This professor should not be permitted to teach.",
      "author": "critropolitan",
      "created": 1567375555,
      "upvotes": 9,
      "replies": {}
    },
    "eyr81tu": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyr81tu/",
      "text": "He definitely crossed a red line here. You should act. No matter what are your personal interests, I am pretty confident that having your merit stolen is not one of them.",
      "author": "chiesazord",
      "created": 1567362538,
      "upvotes": 4,
      "replies": {}
    },
    "eyqijnc": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqijnc/",
      "text": "Something similar happened to me though not quite as bad. I contributed data to a paper that ended up in a top journal in chemistry. The figure and accompanying text I had provided were still in there but my name wasn't. Whether or not it was by mistake, it did bother me a little. Particularly as this came shortly after another article from my former group was published with the entire story changed based on my input to that paper. I wasn't even acknowledged on the second.\n\nIn the interest of transparency, I did not contribute any data to the second paper apart from teaching someone to run some basic analysis and telling them based on that analysis that their story didn't make sense to me and eventually working out what the issue was from coming across some literature in another context, which led to the paper being totally changed to what I suggested might be happening. \n\nUltimately, I decided it wasn't worth my time because it struck me that ultimately this had such little influence on my career going forward that I could not be bothered chasing this up or kicking up a fuss.",
      "author": "Confuseyus",
      "created": 1567344254,
      "upvotes": 12,
      "replies": {}
    },
    "eyrxqc1": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyrxqc1/",
      "text": "Sounds like your old advisor fucked up. \n\nAn update once it’s all said and done would be nice!",
      "author": "nas_deferens",
      "created": 1567381309,
      "upvotes": 2,
      "replies": {}
    },
    "eyqnl3m": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqnl3m/",
      "text": "This is plagiarism as another person stated.  With that said, we are going to start including language in our handbook that an advisor is allowed to publish work if a student doesn't after some time had elapsed as long as the student is made a co author.  It's not entirely fair to the advisor to put the time and resources into a research project only to have it never see the light of day because the student moves on and can't be bothered to publish.",
      "author": "preacher37",
      "created": 1567348639,
      "upvotes": 7,
      "replies": {
        "eyqqo1k": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqqo1k/",
          "text": "This is fair.  My first thought when I read the title was how long have you been gone.  But when I saw 2019, well that is unacceptable.  \n\nBut I have had former graduate students completely disappear after finishing, so after some time, I should be able to get a publication out of our work.",
          "author": "manova",
          "created": 1567351028,
          "upvotes": 14,
          "replies": {
            "eyqxgod": {
              "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqxgod/",
              "text": "I mean, in this case the year is irrelevant, it's a clear cut case of plagiarism no matter how much time had elapsed.  The senior author should have just put OPs name on it and saved any headache that is now likely headed their way.  The advisor of OP may very well have just ruined their career.",
              "author": "preacher37",
              "created": 1567356029,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "eyse0mj": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyse0mj/",
      "text": "Can you sue them? Someone needs to close the academia!",
      "author": "kokobannana",
      "created": 1567395033,
      "upvotes": 1,
      "replies": {}
    },
    "ezewn5u": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/ezewn5u/",
      "text": "Update?",
      "author": "pthieb",
      "created": 1567869786,
      "upvotes": 1,
      "replies": {}
    },
    "eyqqsw8": {
      "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqqsw8/",
      "text": "Theoretically, this is plagiarism. Realistically, from what I've seen in academia, this kind of thing happens. Who's on a paper sometimes does have to do with politics.\n\nMy advice to you is to sit and think about whether this is worth your time. It seems like you left on bad terms. do you need this publication to advance your career? If not, I'd say let it go. It's probably not worth your time to try to figure this out.",
      "author": null,
      "created": 1567351135,
      "upvotes": -14,
      "replies": {
        "eyqyr6y": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqyr6y/",
          "text": "I have to disagree with you.  This is not \"theoretically\" plagiarism, it is unquestionably plagiarism, and is one of the most serious cases of misconduct an academic can commit without getting arrested.  I also feel like if someone is willing to do this once, they are likely to do it again.  I think OP has a responsibility to at least report this to the professor's chair and/or Dean, as well as the editors of the book.",
          "author": "preacher37",
          "created": 1567356972,
          "upvotes": 13,
          "replies": {}
        },
        "eyqv0qd": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqv0qd/",
          "text": "I didn’t entirely leave on bad terms. I just decided that I’d rather work in tech than work in academia. \n\nThe main reason why this bugs me is because this work is from my dissertation. I spent a lot of mental and emotional energy on the dissertation, and it would be great if I could have credit for my work. \n\nI have an earlier draft of the paper in an email thread with me listed as first author",
          "author": "dsci482712",
          "created": 1567354268,
          "upvotes": 11,
          "replies": {}
        },
        "eyr7iky": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyr7iky/",
          "text": ">entire sentences lifted from my dissertation. \n\n\n>theoretically this is plagiarism. \n\nI sincerely hope you're not actively working in academia, because if you are, you somehow missed the plagiarism lecture that all undergrads get on the first day of every semester.\n\nIf its it's not your idea/words and you don't credit the originator its fucking plagiarism. Full stop.",
          "author": "middledeck",
          "created": 1567362234,
          "upvotes": 8,
          "replies": {}
        },
        "eyqyvlt": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyqyvlt/",
          "text": "People in academia get away with plagiarism all the time. This has to stop and nothing will change if everyone just stays silent. Maybe more people will at least speak out if they read about others who did.",
          "author": "Lady_of_Ironrath",
          "created": 1567357060,
          "upvotes": 7,
          "replies": {}
        },
        "eyr4gvx": {
          "link": "/r/AskAcademia/comments/cy6eus/phd_advisor_published_my_work_without_my/eyr4gvx/",
          "text": "This is as clear cut obvious plagiarism and unethical as one can get, and I cannot believe the advisor was actually that stupid enough to think they would get away with it considering the fact that everything is already technically published in a dissertation with OP's name on it AND there is an electronic paper trail of the exchange.\n\n>this kind of thing happens\n\nYes because of suggested advice like \n\n> I'd say let it go. It's probably not worth your time to try to figure this out.",
          "author": "Minny7",
          "created": 1567360645,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  }
}