{
  "sid": "qmyekr",
  "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/",
  "title:": "Is it worth it?",
  "text": "Academia people of Reddit, I have a few things I want to see if you can clear up:\n\n1. If you have to pay for a PhD, you’re doing it wrong and nobody is going to take it seriously. Good luck teaching at a university. Is this true? \n\n2. What is the purpose of a Doctorate and is it worth studying for? For example, Purdue University has a new online Doctor of Technology program.\n\nhttps://polytechnic.purdue.edu/degrees/doctor-of-technology\n\nIs this program something even worth spending time to complete? What does a “professional doctorate” offer to a modern worker? \n\n3. If you don’t want to teach for a living, is a PhD worth the time away from your family and the detriment on your mental health? \n\nAlso…\n\nThere are a lot of PhD programs that I have seen advertised to active duty military that are cheap and “affordable” for the GI Bill, etc. \nThe veterans take them seriously, but I don’t have the heart to tell them what I’ve seen on this subreddit. I’m also active duty. Depending on the responses to this post, I plan to stop my academic career at a masters. (I don’t want to teach)",
  "author": "JulietBravo4",
  "created": 1636070512,
  "updated": 1636172231,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjd93ug": {
      "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjd93ug/",
      "text": "1. If you are paying for a PhD you are *probably* doing it wrong, but not necessarily. If you're paying for a Ph.D. in a lab science you are definitely doing it wrong. \n\nI only know one person who paid tuition for a PhD that was from a reputable program, but it was 30 years ago and he had very specific reasons for doing it, and reasons it worked out, that don't apply to most people\n\n&#x200B;\n\n2.  Since this question starts off super-broad, the \"purpose\" of a doctorate is to learn stuff and let other people know you know stuff. Specific kinds of doctorates have other \"specific\" purposes. \n\nPurdue is making a sharp turn towards money-grabs as opposed to actually rigorous and valuable programs since Mitch Daniels took over, so without spending my time looking into this program in detail I'd guess it's probably trash. Most \"professional doctorates\" are considered garbage/resume fluff by people with PhDs unless it's in a program with rigorous external evaluation, like many health-related programs.\n\n&#x200B;\n\n3. Big assumption that a PhD will be a \"detriment on your mental health\". It can be, but most people get through without thinking it's traumatic. Whether it's \"worth the time\" depends so much on what the degree is in and what you want to do with it that it's pointless to ask without more specifics.",
      "author": "WoodwardHoffmannRule",
      "created": 1636079568,
      "upvotes": 8,
      "replies": {
        "hjdjlv8": {
          "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjdjlv8/",
          "text": "Is it possible to ask what this person that paid for the PhD was doing?",
          "author": "camilo16",
          "created": 1636084946,
          "upvotes": 3,
          "replies": {
            "hjdn3m8": {
              "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjdn3m8/",
              "text": "PhD in a lab science. Generally, lab science grad students get paid/free tuition for teaching lab courses or working on their PIs projects as a research assistant in addition to their own dissertation project. \n\nSo this guy paid his own tuition so that he only had to do his own dissertation project to graduate faster. It was more complicated than this, but that’s the gist.\n\nIn my field at least, it wouldn’t work these days because every grad student works on their PI’s projects anyway in addition to their dissertation project, or they make a dissertation proposal and defend it early in the PhD program but with no intention of following through and just work on their PI’s projects and write the dissertation based on that.",
              "author": "WoodwardHoffmannRule",
              "created": 1636087042,
              "upvotes": 3,
              "replies": {
                "hjeydzb": {
                  "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjeydzb/",
                  "text": "I don’t understand between “the PI’s projects” and their dissertation project. Didn’t they pick the PI’s projects as a dissertation topic? Don’t people just staple 3-4 articles loosely bound in a tenuous narrative as a dissertation anyway?",
                  "author": "ThePhysicistIsIn",
                  "created": 1636120508,
                  "upvotes": 1,
                  "replies": {
                    "hjfqge7": {
                      "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjfqge7/",
                      "text": "You’re describing a really common practice, but of the 6 schools that I have pretty detailed information about how their grad programs work in chemistry there’s a significant amount of variation in terms of how much independence grad student have with research, both between school and between faculty in the same department.",
                      "author": "WoodwardHoffmannRule",
                      "created": 1636131609,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hje4b4h": {
      "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hje4b4h/",
      "text": ">If you have to pay for a PhD, you’re doing it wrong and nobody is going to take it seriously. Good luck teaching at a university. Is this true?\n\nThe best advice I was ever given as a final year undergraduate student is that if you're good enough to go to graduate school, somebody will pay you to do it. This turns out to be 100% true. \n\nIt's also true that you list not only info on your degrees earned but also info on your funding  history on your CV. So it's not going to be a secret if you paid for a PhD vs. received some sort of scholarship or funding. A funded PhD on your CV will simply carry more weight if it's being read by an academic or anyone with knowledge of academia (it's possible that a non-academic looking at your CV would not grasp these nuances).\n\nI am in a humanities discipline. I can tell you for sure  that any of my current colleagues with permanent jobs who are under the age of 50 or so had funded PhDs (I'm less sure about the 50+ cohort, but it's entirely possible they all did too).\n\n&#x200B;\n\n>If you don’t want to teach for a living, is a PhD worth the time away from your family and the detriment on your mental health?\n\nNot unless you're in a field where industry specifically prizes and rewards PhDs. Most of the time, holding a PhD will make your non-academic job search tougher.",
      "author": "LookingOutFromDia",
      "created": 1636100719,
      "upvotes": 3,
      "replies": {
        "hjfdwux": {
          "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjfdwux/",
          "text": "Why would it make non academic job searching harder? Is it because companies expect you to ask for more pay?",
          "author": "JulietBravo4",
          "created": 1636126787,
          "upvotes": 1,
          "replies": {
            "hjfp4bh": {
              "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjfp4bh/",
              "text": "That's part of it. But a lot of PhDs report other difficulties with non-academic job searches, too. Non-academic employers who prefer PhD graduates are far more rare than non-academic employers who find PhDs perplexing.\n\n[https://www.science.org/content/article/when-phd-stands-problematic-hiring-detriment](https://www.science.org/content/article/when-phd-stands-problematic-hiring-detriment)\n\n[https://thesiswhisperer.com/2019/03/13/anti-phd/](https://thesiswhisperer.com/2019/03/13/anti-phd/)",
              "author": "LookingOutFromDia",
              "created": 1636131089,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hje8sdp": {
      "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hje8sdp/",
      "text": "Boy would I stay away from this.\n\n1.) From wikipedia entry \"Doctor of technology\"\n\n>In the United States, the Doctor of Industrial Technology (D.I.T.) degree was recognized by the National Science Foundation (NSF) as equivalent to the Ph.D.  degree until 2008, when it was determined that it had moved to a more   \nprofessional orientation and no longer met the NSF criteria for a   \nresearch doctorate.\n\n2.) They have to take 90 credits of courses to get your degree, at over $1,000 per credit. This is very different from a doctorate in which you work in your own on a very specific topic, not consuming courses.\n\nSo it is very expensive (while most people will get paid to do a PhD in STEM), does not officially qualify as a PhD, and does not offer the research experience of a PhD. It is also 100% online, so there can't be any practical experience.",
      "author": "territrades",
      "created": 1636104840,
      "upvotes": 3,
      "replies": {
        "hjfebwe": {
          "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjfebwe/",
          "text": "So this is just a resume fluffer and at best a waste of time?",
          "author": "JulietBravo4",
          "created": 1636126950,
          "upvotes": 1,
          "replies": {}
        },
        "hjheok0": {
          "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjheok0/",
          "text": ">It is also 100% online, so there can't be any practical experience.\n\nAt least theoretically, you could gain practical experience in Technology in an online program, although I have no idea if that's the case for this degree. Lots of people have worked on research and practical work for the last year and half 100% online due to COVID.",
          "author": "Ford-Fulkerson",
          "created": 1636154868,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjd82c4": {
      "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjd82c4/",
      "text": "On the first question, there are a few possibilities. One is that you’re doing this at a school where everyone pays, meaning it’s either very low-ranked or it’s a for-profit place. In either of those cases, yes. Good luck teaching at a university. \n\nAlternatively, you may go to a place where funding is competitive. The department not offering you funding is a signal to you of how they view you. Sometimes you can work your way onto funding if you outperform expectations (I have a student like that). But still, if your department isn’t funding everyone, it’s probably mid-tier at best. And that makes it hard to find a job in academia (at least in my field). I would never advise a student who wanted to go into academia to accept an unfunded offer. \n\nFor your second question, I think it depends. I don’t know anything about the doctor of technology degree you mention. I’d get information about where their students get placed, and ideally talk to someone who’s done it. I have friends who did PhDs and placed in industry. It just means you have greater specialization in your given area. \n\nAs for your final question, this probably depends too. My guess would be that the marginal value of the PhD probably isn’t worth it when you compare it to the Master’s plus the experience you could get during that time. It’s a personal accomplishment, though. So if that’s meaningful to you, then it might be worth it. Personally I didn’t feel like the PhD took time away from my wife (I didn’t have kids at the time) or was detrimental to my mental health. Not everyone feels that way.",
      "author": "EconGuy82",
      "created": 1636079084,
      "upvotes": 2,
      "replies": {}
    },
    "hjdsxbh": {
      "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjdsxbh/",
      "text": "1) As others have said, this depends a lot on why you are paying for the PhD. If it's because you are going to a for-profit university or a lower-tier program that doesn't fund its students, then yes, you'd have a hard time finding an academic position (at least on the tenure-track).\n\nIf you're doing it because you lost funding, are in between funding, or have to earn your way into funding - then that's something that I personally  wouldn't advise, but if done at the right university could theoretically keep you competitive. (In practice, I think students who fund their own way are more likely to drop out.)\n\n2) Well, a PhD is a research degree. It's supposed to teach you how to do research in your field of interest, and the foundational content and theoretical knowledge you need to pursue that.\n\nI think a doctoral degree, more generally, is about demonstrating mastery at the highest level in one's (sub)field. I can't answer whether it's worth spending time on the [D.Tech](https://D.Tech) from Purdue, as \"worth\" is going to vary from person to person. However, I will say that I don't think the degree would be regarded as highly as doing a more traditional doctoral program when looking for jobs.\n\n3) PhD holders do more than just teach - in fact, the PhD is a research degree, not a teaching one. I work in industry and a PhD was practically a requirement to get my job; I don't teach.\n\nIf you don't want to go into academia, a PhD is only worth in my opinion if your field has a relatively clear path to other kinds of jobs that require a PhD, or for which a PhD is very useful. For example, if you wanted to work as a researcher at the CDC or SAMHSA or another health agency for the government, having a PhD is a necessity of those jobs even though they are outside academia. Or perhaps you want to go into R&D at a pharmaceutical company or technology company.",
      "author": "roseofjuly",
      "created": 1636090994,
      "upvotes": 2,
      "replies": {
        "hjfd2no": {
          "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjfd2no/",
          "text": "My career field is in IT. I am not personally sure what a PhD would fulfill in the IT field outside of teaching. Most IT leadership positions are fulfilled by bachelors and masters degree holders.",
          "author": "JulietBravo4",
          "created": 1636126460,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjcpuro": {
      "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjcpuro/",
      "text": ">If you have to pay for a PhD, you’re doing it wrong and nobody is going to take it seriously.\n\nI mean, a PhD is a PhD; nobody knows (or will ever care to ask) how you were funded if you have the letters.\n\nBut at the same time; you generally shouldn't be paying for a PhD.\n\n>What is the purpose of a Doctorate and is it worth studying for? For example, Purdue University has a new online Doctor of Technology program.\n\nA Doctorate of Technology is not a PhD. It's still a very high-end degree, and a difficult one to achieve, and one that most (if not all) agree will grant you the title of \"Doctor\", but it's fundamentally not going to be a PhD.\n\nFurther; almost none of the Professional Doctorates (e.g. any Doctorate who's formal title isn't \"Doctor of the Philosophy of [insert field]\") end up teaching, except as either Professors of Practice, or at the CC level. The point of the professional doctorates is entirely to work in industry-related fields.\n\n>If you don’t want to teach for a living, is a PhD worth the time away from your family and the detriment on your mental health?\n\nI mean, most PhD's don't end up teaching, although in my field that's largely because PhD's are highly sought after in industry.\n\nEdit: I should also note that professional doctorates (other than the obvious JD and MD) are *reaaaaaally* hit or miss. Buyer beware.",
      "author": "r3dl3g",
      "created": 1636070929,
      "upvotes": 2,
      "replies": {
        "hjd6vgj": {
          "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjd6vgj/",
          "text": "This is not entirely correct. If you are trying to go into an industry field where hiring supervisors are well-versed, a ‘PhD is not a PhD’…the PhD from online tech whatever is not going to be considered the same as a PhD from a reputable R1 university. And a ‘doctor of technology’ does not compare.\n\nThat being said, there are plenty of jobs in R and D that are suitable for PhDs but do not require teaching. In STEM, in the USA at least, the graduate student generally does not pay but in fact receives a stipend to do the PhD work (and a waiver for tuition fees as well).",
          "author": "ohnoyoudin",
          "created": 1636078519,
          "upvotes": 2,
          "replies": {}
        },
        "hjdh46e": {
          "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjdh46e/",
          "text": "When you say \"end up teaching, except as either professor or cc\" are you referring to strictly K-12?   I'll chime in as a middle school teacher who works with several Ed.D. holders. On most public school salary scales, ANY accredited doctorate will earn a K-12 educator the highest level pay step.",
          "author": "Moscowmule21",
          "created": 1636083573,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjf0hzl": {
      "link": "/r/AskAcademia/comments/qmyekr/is_it_worth_it/hjf0hzl/",
      "text": ">If you have to pay for a PhD, you’re doing it wrong and nobody is going to take it seriously. Good luck teaching at a university. Is this true?\n\nMost strong programs have funding. I think the more important rule is cost-benefit analysis. A Ph.D. program is 5+ years and so to be paying tuition plus not making income is financially difficult. If you are going to make a lot of money with your degree, that could be worth it (see: debt from professional degrees like a medical degree). But usually, a person with a Ph.D. does not make the kind of money to justify the expenses.\n\nNobody will know if you paid tuition for your Ph.D. in all likelihood, and I'm aware of people who did pay tuition and have done well for themselves as professionals in academia and in applied settings.\n\n>What is the purpose of a Doctorate and is it worth studying for? For example, Purdue University has a new online Doctor of Technology program. Is this program something even worth spending time to complete? What does a “professional doctorate” offer to a modern worker?\n\nWhen I hear \"online doctorate program,\" my first thoughts are \"red flag, run away, money grab.\" Obviously, there's some nuance (after all, most Ph.D. students just completed some version of an online doctorate program thanks to COVID), but I suspect that the mentorship and other kinds of opportunities you have in person would be difficult to replicate in an online environment.\n\n>If you don’t want to teach for a living, is a PhD worth the time away from your family and the detriment on your mental health?\n\nMany people with a Ph.D. will go into research and industry careers. As far as the tradeoff, that is a personal decision, and while grad school isn't exactly known to promote mental well-being, I would discourage someone from entering a situation they believed would be detrimental to their mental health.\n\n>There are a lot of PhD programs that I have seen advertised to active duty military that are cheap and “affordable” for the GI Bill, etc. The veterans take them seriously, but I don’t have the heart to tell them what I’ve seen on this subreddit. I’m also active duty. Depending on the responses to this post, I plan to stop my academic career at a masters. (I don’t want to teach)\n\nIf a grad student can get a Ph.D. program mostly or all paid for through their GI Bill benefits, then that changes the calculus. The issue, as I described above, with unfunded programs is not necessarily that they're a bad program, but that the cost-benefit analysis makes it such that the debt incurred is typically not worth it. If a student brings in their own funding in the form of GI Bill benefits so that they're not going into debt, a Ph.D. program may very well be worth it. (Of course, that doesn't mean that all Ph.D. programs will be worth it, and it's good to beware of programs targeting veterans for their GI Bill money so that they can get full tuition for graduate programs of questionable value to the student.)",
      "author": "jogam",
      "created": 1636121428,
      "upvotes": 1,
      "replies": {}
    }
  }
}