{
  "sid": "f1qo1q",
  "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/",
  "title:": "What are the pros about getting a PhD degree?",
  "text": "I’m tired about hearing the cons. Thank you.",
  "author": "swear2gawd",
  "created": 1581343161,
  "updated": 1634081779,
  "over_18": false,
  "upvotes": 121,
  "upvote_ratio": 0.96,
  "comments": {
    "fh7vaja": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh7vaja/",
      "text": "1.\tLearning is fun. \n2.\tTeaching is fun. \n3.\tWhile I do have to actually work, I mostly get to choose what I do and how I do it.\n\nETA: at least, those are the pros of *being a professor*. The pros of getting a PhD are mostly the same.",
      "author": "dr_police",
      "created": 1581345649,
      "upvotes": 133,
      "replies": {}
    },
    "fh7zwtl": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh7zwtl/",
      "text": "Every appointment now becomes a doctors appointment.",
      "author": "tpm319",
      "created": 1581348879,
      "upvotes": 96,
      "replies": {}
    },
    "fh7vr56": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh7vr56/",
      "text": "I’m in the middle of my PhD after 10 years in the workforce.  I love that my job is basically to learn, ask questions, try to answer those questions, and teach.  My topics were 100% my choice.\n\nAt the end, hypothetically I’ll have a PhD and notionally be “an expert” in the field.  Converting that to a paying job is of course nontrivial.",
      "author": "Decisionsota",
      "created": 1581345992,
      "upvotes": 48,
      "replies": {}
    },
    "fh7sipj": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh7sipj/",
      "text": "You get to be in a space where people are interested in ideas. It is uneven but it is definitely better than in other situations where ideas only are interesting if it does x or y for the company. That's the first. You also get to ask a question you find interesting and pursue work to explore that for several years. In no other position is that allowed. Professors only pursue a question in as much as it aligns with potential publications. That is the second.",
      "author": "ShakilR",
      "created": 1581343521,
      "upvotes": 121,
      "replies": {
        "fh92itm": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh92itm/",
          "text": "This isn't even true though. You only get to pursue ideas that are fundable by the professor you work under, and which are approved by that professor. Those ideas are contingent upon funding and recognition by agencies in the long term, and convincing those agencies of their importance, which takes a long time.",
          "author": "ub_biology",
          "created": 1581372312,
          "upvotes": 18,
          "replies": {
            "fh97rgi": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh97rgi/",
              "text": "I did my PhD at UB as well. While its true that you can only do *in depth* investigations on things related to your research, it is an environment where you're surrounded by mostly-smart people who will talk to you about ideas. \n\nIn my experience if you're working in a typical office job the range of things you get to talk about to your co-workers is pretty limited (sports, relationship gossip, politics, hobbies), and you won't have a lot of people who'll want to debate philosophy, discuss math, or whatever is interesting you that day.",
              "author": "fleemfleemfleemfleem",
              "created": 1581375025,
              "upvotes": 7,
              "replies": {
                "fh9d4e1": {
                  "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9d4e1/",
                  "text": "Best part of my job, arguing with fellow omg professors about a wide variety of intellectual things.",
                  "author": "leestitzel",
                  "created": 1581378500,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fh7vmc0": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh7vmc0/",
      "text": "There are tons of pros!  Here are a few personal and professional pros:\n\nI have complete autonomy over about 80 percent of my schedule.  \n\nI get to research anything I am interested in and/or believe is important.\n\nI have the opportunity to work with and mentor as many (or as few) students as I want.\n\nThere are numerous opportunities to present research, give talks, and do community outreach.  People tend to have an interest is what I have to say (although, to be fair, our work is relatively low impact all in all).\n\nI am able to serve the university in ways I think are important.\n\nI can work as little or as much as I want to.\n\nIf I want extra money, I can apply for a grant or teach extra classes.  If I don’t, I get 3 months off every year over summer.",
      "author": "tmodoc",
      "created": 1581345892,
      "upvotes": 74,
      "replies": {
        "fh8pmm2": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8pmm2/",
          "text": "> If I want extra money, I can apply for a grant or teach extra classes. If I don’t, I get 3 months off every year over summer.\n\nWhaaat? I guess this is an American thing? And do most people usually end up using those 3 months to do research anyway?",
          "author": "Doofangoodle",
          "created": 1581364756,
          "upvotes": 9,
          "replies": {
            "fh92p73": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh92p73/",
              "text": "Virtually everyone uses it to do research anyway.",
              "author": "ub_biology",
              "created": 1581372395,
              "upvotes": 21,
              "replies": {}
            },
            "fh9b895": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9b895/",
              "text": "I disagree with the other poster.  I’d say 90 percent of the other academics I know across numerous fields will do some research over the summer, but not much research.  And especially folks that already have tenure - summer is for vacation!",
              "author": "tmodoc",
              "created": 1581377248,
              "upvotes": 10,
              "replies": {
                "fh9bbf0": {
                  "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9bbf0/",
                  "text": "Crazy. Do they get paid during those three months?",
                  "author": "Doofangoodle",
                  "created": 1581377307,
                  "upvotes": 6,
                  "replies": {
                    "fh9bg5t": {
                      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9bg5t/",
                      "text": "No.  And that’s why most of the academics I know really don’t do much over the summer.  We don’t get paid for it (unless we get a grant and then fund our own summer contracts).",
                      "author": "tmodoc",
                      "created": 1581377392,
                      "upvotes": 8,
                      "replies": {
                        "fh9bu7p": {
                          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9bu7p/",
                          "text": "Ah right. Oh man that must suck only getting paid 9 months a year!",
                          "author": "Doofangoodle",
                          "created": 1581377650,
                          "upvotes": 1,
                          "replies": {
                            "fh9d4k1": {
                              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9d4k1/",
                              "text": "I can’t complain!  My salary is good and I get it spread out over 12 months.  I can always teach in the summer if I wanted to for some income, but never felt like I needed to",
                              "author": "tmodoc",
                              "created": 1581378504,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fh7z1gx": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh7z1gx/",
          "text": "Undergrad here curious about a couple points:\n\n> I have complete autonomy over about 80 percent of my schedule.\n\n> I get to research anything I am interested in and/or believe is important.\n\nAre there any factors that go into this like size of lab or program? Is this still the case if your PI isn’t in expert in your proposed project but its in their general discipline?",
          "author": "psdanielxu",
          "created": 1581348297,
          "upvotes": 6,
          "replies": {
            "fh83mwc": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh83mwc/",
              "text": "If you’re talking about at the doctoral student level, yes, there are some constraints if your PI studies something quite different (depending on the lab). And at all levels there are resource limitations - at a small liberal arts college, e.g., you might not have access to the types of equipment or other resources (such as time, if teaching load is heavier) needed. There’s always grants, but those also take time, and success can be greatly facilitated by institutional support.\n\nOverall, though, the autonomy is still quite high compared to many other professions, and even at the student level there is often (but not always) a high degree of schedule-setting and independent research. The goal of a PhD program in most cases is to prepare you for an independent research career, so good labs/schools/programs should increasingly allow greater autonomy over schedule and projects as you become more capable.",
              "author": "womanaction",
              "created": 1581351297,
              "upvotes": 6,
              "replies": {}
            },
            "fh7zgy6": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh7zgy6/",
              "text": " Not sure I follow completely, but I’ll try and clarify.\n\nI teach just over 4 hours total every week.  Beyond that, I can do anything I want - complete control over everything else.  I am sure it varies a great deal by program and discipline.  I am in a research intensive department.  Other departments probably have much more teaching and service requirements.\n\nIn terms of research, everyone in my department has the ability to research anything they want.  Doesn’t matter if they are regarded as an expert in a given area or not.",
              "author": "tmodoc",
              "created": 1581348583,
              "upvotes": 9,
              "replies": {
                "fh92mor": {
                  "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh92mor/",
                  "text": "How do you pay for stuff?",
                  "author": "ub_biology",
                  "created": 1581372362,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fh8kjqb": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8kjqb/",
      "text": "I did mine for the silly hat",
      "author": "liedra",
      "created": 1581361694,
      "upvotes": 35,
      "replies": {}
    },
    "fh7zyuv": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh7zyuv/",
      "text": "I agree with the responses that have been given here about learning, time management, curiosity, and teaching, but since people have already mentioned these, I will focus on the pros on the long term, the ones you can take away even when the PhD finishes.\n\n&#x200B;\n\n1. Data Analysis: This is a very useful skill nowadays, and when you do a PhD, specially in STEM, Economics, and even some social sciences, you will have to filter, analyze, understand, extrapolate and present lots of data in order to validate you theories. \n2. Project Management: Your Phd is your own project, and you will learn how to manage your timelines, deadlines, constraints, responsibilities, prioritize\n3. Traveling: You can go to many conferences, and share your research with lots of people abroad.",
      "author": "GugaAcevedo",
      "created": 1581348918,
      "upvotes": 26,
      "replies": {
        "fh88sc0": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh88sc0/",
          "text": "Still in the process (nearing the end though), but adding to this:\n\n\n- in addition to travelling, you can get real international work experience by working with colleagues with all over the world, as equals, and navigating all sorts of cultural differences along the way. Personally, I love it, but it's also a real skill that has value in the \"outer world\"\n\n\n- as a researcher, you are by definition proficient in learning new skills and topics, rather independently, as you have to do it all the time. Many people hate arriving at a new job and having to learn the ropes (usually my favourite part of a job, oddly enough), and feel uncomfortable not knowing things. During a PhD, you generally have to either enjoy that feeling or find a way to make peace with it.\n\n\n- for women: we don't have to spend absurd time and money on personal appearance in academia if we don't want to. Recently realised that owning no make-up and no dresses would not fly in many private sector jobs, and the corporate world especially. Small thing, but I feel grateful for it. Still plenty of room for improvement for women's rights in academia, but it's actually not too bad compared to some other professions. (economic issues really need work though, way too much supporting your job out of pocket in academia, which is brutal for lower-income people)\n\n\n- lastly, freedom to build your own career, if you're into that. Not an easy path, but you can create your own job, with whatever mix of research, teaching, mentorship, outreach, industry involvement, government/policy work, art, writing, curriculum design, ??? you desire. Not without unpleasant elements, of course, but that's every job!",
          "author": "Hemimastix",
          "created": 1581354528,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fh85337": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh85337/",
      "text": "Being called Dr when you check into a hotel.",
      "author": "knightmare9zulu",
      "created": 1581352211,
      "upvotes": 24,
      "replies": {
        "fh8ljud": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8ljud/",
          "text": "I've always been worried to use my Doctor title outside of campus. A colleague (in business faculty) used to use it all the time and once on a plane he got asked to aid a fellow passenger in medical distress because he was a doctor.  He was mortified! This is my worry!",
          "author": "AnubisAnew",
          "created": 1581362303,
          "upvotes": 21,
          "replies": {
            "fh8pzla": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8pzla/",
              "text": "[deleted]",
              "author": null,
              "created": 1581364973,
              "upvotes": 12,
              "replies": {
                "fh9lkhj": {
                  "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9lkhj/",
                  "text": "I believe the airline did make an announcement about the need for a doctor on board. But when no one presented themselves, they went through the passenger manifest and came to him.   They asked if he would be willing to render medical aid and then he had to say that he's a PhD not medical doctor.  I fear this may happen to me so I almost never use my doctor title.  (Although I tried to make my daughter call me \"Doctor Daddy\" and even that failed.)",
                  "author": "AnubisAnew",
                  "created": 1581384135,
                  "upvotes": 7,
                  "replies": {}
                },
                "fh98358": {
                  "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh98358/",
                  "text": "Unless they have an MD-PhD or somehow have actual clinical experience, even those who worked in medical research won't be much help in a medical emergency.",
                  "author": "hyperblaster",
                  "created": 1581375230,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "fh8pqan": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8pqan/",
              "text": "I think a lot of people only use in in an academic setting",
              "author": "Doofangoodle",
              "created": 1581364818,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "fh8jslp": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8jslp/",
          "text": "Or a restaurant.",
          "author": "DarkwingDoctor",
          "created": 1581361233,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fh8fpzl": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8fpzl/",
      "text": "The super simplified answer I give when excited: you finally get the answer to a question you wanted a legitimate answer to, but nobody knew the answer yet. \n\nOr: one day I hope to know a thing, and find out other stuff along the way.",
      "author": "Jimlish",
      "created": 1581358768,
      "upvotes": 16,
      "replies": {}
    },
    "fh8lp4o": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8lp4o/",
      "text": "Got to university that guarantees funding (or apply for external funding in advance) and then you are basically paid to learn, grow, think, and (most often) hang around really interesting people.",
      "author": "AnubisAnew",
      "created": 1581362392,
      "upvotes": 8,
      "replies": {}
    },
    "fh8mklo": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8mklo/",
      "text": "You're put in a category of the workforce that is truly advanced. Everyone here is talking about the day to day autonomy, which is true for some academic positions, but no matter what room your in, those letter PhD hold weight. It can open doors, it can cause people to actually answer your emails, it can prop up that first impression. No matter what, even if you yourself don't think your degree matters or is a trivial topic (probably because we all go through those phases) it gives you a view on the world that really cannot be reproduced.",
      "author": "Chem_at_me_bro",
      "created": 1581362918,
      "upvotes": 8,
      "replies": {
        "fh8oi46": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8oi46/",
          "text": "[deleted]",
          "author": null,
          "created": 1581364084,
          "upvotes": 1,
          "replies": {
            "fh8rq42": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8rq42/",
              "text": "It is if you frame it in a negative light. \n\nSure you can say you are highly specialized and lack a broad scope, OR you can market yourself as a problem solver who, no matter what is thrown you, will be able to figure it out. \n\nI used to think that as well, however, we also have incredible tunnel vision to the rest of the workforce. From what I've found, unless you're being interviewed by a fellow PhD, you need to do a lot of selling of the soft skills. How project management and disseminating complicated concepts into small bite-sized pieces is a specialty of nearly all grad programs.",
              "author": "Chem_at_me_bro",
              "created": 1581366008,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fh93ktc": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh93ktc/",
      "text": "After reading subs like /r/MaliciousCompliance , it's obvious to me that we in academia deal with much much less inane bullshit than people in private industry.  Fewer pointless meetings, less petty office/lab politics, etc.  Not to say that there aren't horror stories from academia, but it's a different ballpark.",
      "author": "TurnsOutImAScientist",
      "created": 1581372812,
      "upvotes": 9,
      "replies": {}
    },
    "fh8uia8": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8uia8/",
      "text": "Once you have it, you have a different kind of confidence that other more structured degrees give.  It's a trial by fire against the capricious whims of Mother Nature, and you come out of it having extracted something original and valuable to at least a few people.  You walk the Earth for the rest of your days knowing you triumphed over an unpredictable and stubborn adversary.\n\nPart of what makes it hard is what makes it great.  A degree like a BS is mostly a structured tutorial in learning where the answers are already known by the human race, and can often times be found in the back of the book.  A PhD is a live fire battle with the unknown. You vs the wolves.  If you graduate, you at least scored a blow for humanity.  The sense of self you can get is indescribable.  It lasts a lifetime.",
      "author": "bjos144",
      "created": 1581367641,
      "upvotes": 7,
      "replies": {}
    },
    "fh8qj4j": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8qj4j/",
      "text": "1. You'll be called Dr for the rest of your life. Nobody can take your title away from you, no need to reapply for your title periodically, it's yours for life.\n\n2. You'll immerse yourself in a single subject for a few years, emerging at the end as a recognised expert in that tiny little domain.\n\n3. During your viva, you'll be sat across from two experienced experts in the same field, who will devote at least 2 hours of their time to discussing the project that has swallowed up all of your attention, thoughts, passion and feelings for the previous years. You'll never ever have an opportunity like that again to discuss your passion at such length with such knowledgeable company.\n\n4. Your published work(s) will make a permanent contribution to your chosen field. Even if you deviate from that field after graduation, your mark will still have been made on that subject.\n\nThere are plenty of other pleasantries too. Do you want to become a nocturnal worker? Your supervisor might be happy with that, if you're prepared to put the work in. Do you fancy skipping the office on Wednesday, making up for it another day? Go ahead, your working time is 100% flexible during the course.\n\nIt's also hard work, it's not a qualification given out for free, but when you come out at the other side you'll potentially have far more to contribute to society than when you went in.",
      "author": "TheFlyingMunkey",
      "created": 1581365300,
      "upvotes": 14,
      "replies": {}
    },
    "fh8d8ql": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8d8ql/",
      "text": "Crazy deep knowledge about a very specific topic, the discipline to stick with a project for longer than just a few seconds (i.e., for years), the ability to skillfully express your argument in writing, the possibility to just think and write, getting to know the giants in your field (at conferences, discussions, drinks), and sometimes the luck to collaborate with them, last but not least being called 'doctor' (and sometimes having to explain that your are not 'that kind' of doctor), and a certain status that comes with it are fun too, but shouldn't be your primary reason to pursue a PhD.",
      "author": "Phreakasa",
      "created": 1581357269,
      "upvotes": 6,
      "replies": {}
    },
    "fh8pkpv": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8pkpv/",
      "text": "I don't have much to add that hasn't already been said, so I'll throw in a funny one - my partner now calls me Dr. Baby",
      "author": "kittymeowss",
      "created": 1581364724,
      "upvotes": 7,
      "replies": {}
    },
    "fh8q0vs": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8q0vs/",
      "text": "You learn independence. I've learned to rely on my research abilities rather than asking everyone for help/advice. I'm much more efficient with my work and my teaching as a result.",
      "author": null,
      "created": 1581364995,
      "upvotes": 7,
      "replies": {}
    },
    "fh8uol0": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8uol0/",
      "text": "You get to make an original contribution to human knowledge, small though it might (or might not!) be. I really like the idea of making some small discovery and thinking \"I found that. That is a thing humans get to know now, and it's because of me!\"\n\nAnother cool thing is traveling for field work, if your project requires/allows it. I went observing on remote mountain tops a lot in grad school, and I had several friends who did things like go to national labs or did on-site interviews with indigenous peoples.",
      "author": "zuul01",
      "created": 1581367744,
      "upvotes": 4,
      "replies": {}
    },
    "fh93ywk": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh93ywk/",
      "text": "You can continue to avail of student discounts. My local burrito places 10% off for students and as I'm coming to the end of my PhD I'm going to be sad to see my student card expire. Also trains, cheap burritos and trains 👌",
      "author": "Diddly_eyed_Dipshite",
      "created": 1581372997,
      "upvotes": 4,
      "replies": {}
    },
    "fh92kl3": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh92kl3/",
      "text": "I get paid to read books. I love reading books. I don't get paid *a lot*, but I do get paid to read books.",
      "author": "TheApiary",
      "created": 1581372334,
      "upvotes": 3,
      "replies": {
        "fhadvil": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fhadvil/",
          "text": "what's your job? Guessing youre not a professor given u dont get paid \"a lot\"",
          "author": "autostart17",
          "created": 1581406094,
          "upvotes": 1,
          "replies": {
            "fhb49gg": {
              "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fhb49gg/",
              "text": "PhD student!",
              "author": "TheApiary",
              "created": 1581434450,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fh8t6c6": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8t6c6/",
      "text": "1) You get to specialize in something so inane, only you and a couple other people even care about it. \n\n2) you can make all the adjuncts call you Dr. Swear2gawd\n\n3) You can put , P.h.D. after your name on linkedIn.",
      "author": "AaronKClark",
      "created": 1581366857,
      "upvotes": 5,
      "replies": {}
    },
    "fh8yugv": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8yugv/",
      "text": "I started my PhD a week ago...but the best part so far is that I get to mostly choose my schedule, and importantly I get to choose to not get up early.",
      "author": "HolidayWallaby",
      "created": 1581370183,
      "upvotes": 2,
      "replies": {}
    },
    "fh9fssg": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9fssg/",
      "text": "I spend all day working on questions I think are really cool. I’m getting paid to get a degree, but unlike most jobs no one cares when I show up, when I leave, or what I wear as long as the work gets done.",
      "author": "mediocre-spice",
      "created": 1581380300,
      "upvotes": 1,
      "replies": {}
    },
    "fhaqvt4": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fhaqvt4/",
      "text": "I get paid to read books.",
      "author": "associsteprofessor",
      "created": 1581423904,
      "upvotes": 1,
      "replies": {}
    },
    "fh8x5r1": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8x5r1/",
      "text": "You can be called Dr",
      "author": "superhero_io",
      "created": 1581369190,
      "upvotes": 1,
      "replies": {}
    },
    "fh8q6ge": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh8q6ge/",
      "text": "Do yourself a big favor and Google, \"Graduate student mental health crisis.\" Most of the research centers on PhDs. And half of PhDs drop out of school.",
      "author": "whereismystarship",
      "created": 1581365089,
      "upvotes": -4,
      "replies": {}
    },
    "fh96vdc": {
      "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh96vdc/",
      "text": "The basic qualification for a research job is a PhD, so if you want to work in R&D, get one.\n\nI also did a basic back-of-the-envelope calculation about the average net value of a PhD (above that of a MSc working in comparable positions), and I got a figure of about $90,000.\n\nEDIT: This is for *my* degree specifically where I work. YMMV.",
      "author": "RRautamaa",
      "created": 1581374470,
      "upvotes": -2,
      "replies": {
        "fh9n5hv": {
          "link": "/r/AskAcademia/comments/f1qo1q/what_are_the_pros_about_getting_a_phd_degree/fh9n5hv/",
          "text": "This has to depend on the field",
          "author": "camilo16",
          "created": 1581385151,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}