{
  "sid": "pyu85v",
  "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/",
  "title:": "Feeling lost - I don't know what to do after my PhD, but I know I don't want to stay in academia or my field",
  "text": "I'm currently writing my thesis, planning to submit in half a year. I have no idea what I want to do afterwards but I know I don't want a future in academia. My lab has offered me a 1 year post doc position, which I was considering taking as it would allow me some time to figure out my career path. However, I know that I would not enjoy it at all and I feel like it would be a waste of time in the end as I don't plan to stay in academia. \n\nI'm feeling quite lost and scared as I have no idea what I want or can have as a career, as my field is rather niche (comparative psychology) and I don't think it's given me many transferable skills. I have very limited experience in stats and programming languages, but that's about it. I'm now in my mid-20s and has no real job experience and I feel like I'm falling behind in life. \n\nHas anyone here finished their PhD and then went into industry in a completely different field to their PhD? Would companies even hire someone like me? I'm worried I would be considered over-qualified even though I'm clearly not. My dream job would be a 9-5 one that involves some analytical and critical thinking but not so much that it would exterminate all my remaining brain cells. \n\nWould be grateful for any help and advice, thanks!",
  "author": "majestic_meringue",
  "created": 1633040088,
  "updated": 1634078797,
  "over_18": false,
  "upvotes": 26,
  "upvote_ratio": 1.0,
  "comments": {
    "hewnu0h": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/hewnu0h/",
      "text": "There are a lot of research gigs (in industry) out there that would value your insights. Are you interested in research oriented roles? Tech (and other industries) tends to hire PhDs for UX research. \n\nWhen I was an undergrad, I also met a few folks working in academia admin post-PhD. They knew they liked the feel of being on a campus but either didn't want to seek an academic post or couldn't secure one.",
      "author": "failuretobloom",
      "created": 1633041314,
      "upvotes": 14,
      "replies": {}
    },
    "hey5syu": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/hey5syu/",
      "text": "It's a big wide world out there. There's lots of jobs that like PhDs:\n\n- portfolio managers at foundations/funders/research charities. These look after a portfolio of work being funded by the organisation. Often engaged with the researchers especially the big projects, very interesting role.\n\n- sci Comms - funders/charities/universities/more - doing Comms work often writing about the science, doing your own pieces \n\nPublic engagement\n\nPolicy - this is massive area and Jon's are in pretty much all the sectors in various forms, from think tanks to government, from analyst to lobbyist. \n\nGrants management\n\nRandom funder initiatives - whatevers hot right now, be it equality and diversity or open access they need people\n\nProgram management - universities and other orgs running big research projects need people who understand the mechanics of research to look after the project \n\nConsultancy - consultants/think tanks - like people with research and analytical skills\n\nCivil service - lots of ways in whatever country you're in - like PhDs\n\nIntergovernmental organisations/NGOs - often have ties to research and like PhDs for roles working with the research. \n\nHave a look around and don't fall for the idea you have to get it right first time. You might get it right now and in 10 years time decide to change to something different. That's totally ok. \n\nGood luck",
      "author": "ACatGod",
      "created": 1633071363,
      "upvotes": 12,
      "replies": {
        "heyjixu": {
          "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/heyjixu/",
          "text": "Thanks so much for your advice! I feel a lot better now and actually quite excited about all the possibilities. \n\nI had a quick look at your comment history (not a stalker, just wanted to see where you're based) and saw that you're also in the UK? I don't suppose you know anything about the Fast Stream? I've been doing some research and the government social research and statistical service schemes really stood out to me. \n\nThanks again for your help, it's really good to know I have so many options!",
          "author": "majestic_meringue",
          "created": 1633083818,
          "upvotes": 2,
          "replies": {
            "heyoo6b": {
              "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/heyoo6b/",
              "text": "No worries.\n\nI don't know much about it I'm afraid except I did consider it when I switched careers and I also know people who came through that route and they seem happy and successful. I didn't do it because I was overseas and the test schedule just wasn't going to work, but my decision had nothing to do with the scheme itself.",
              "author": "ACatGod",
              "created": 1633087728,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hewljay": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/hewljay/",
      "text": "use your program/immediate resources to start building a network and looking for any opportunities you might like. start your search earlier and youll panic less as the final draft gets closer",
      "author": "relevant42",
      "created": 1633040236,
      "upvotes": 10,
      "replies": {}
    },
    "heym8lj": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/heym8lj/",
      "text": "1. Don't panic\n\n2. If you're sure that you're done with your field, do what you need to dissertate  but concentrate your energies on discovering fields you might be interested in and developing contacts outside the academy\n\n3. Reach out to people for informational interviews. Where appropriate, ask them the question you ask here.\n\n4. If you land on a particularly competitive field (which is most branches of policy, some branches of civil service, anything to do with international organizations, many professional jobs where you don't have a relevant background), be prepared that you might need to do an internship or two\n\n5. If you can, do an internship or work placement while you are still in the PhD program.",
      "author": "thegreenaquarium",
      "created": 1633085969,
      "upvotes": 5,
      "replies": {}
    },
    "heyolne": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/heyolne/",
      "text": "As others have said, there's lots out there if you have generalizable skills, and you do, also not just the obvious ones like data analysis/statistics/experiment design, also stuff I think we're kind of embarrassed about or blind to - prioritizing, multitasking, time-keeping, organization, ... One thing you could do is have a good rummage on LinkedIn - try out different search terms - and see whether you might be able to use the one-year post-doc to have an income and upskill if you notice you're missing things (and also maybe you'd get more out of it than you think - don't know how likely that is of course).\n\nBe very careful about even thinking the word \"overqualified\" though. You have skills to own but also potentially (interviewers having a perception you have) a totally dysfunctional academic attitude (e.g., on timescales) and lack of business awareness. It's neither all bad nor all good.",
      "author": "waterless2",
      "created": 1633087682,
      "upvotes": 3,
      "replies": {}
    },
    "hf0lrr7": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/hf0lrr7/",
      "text": "I was in the same boat. When I was going through my PhD program, I felt like everyone gears you up for a faculty position at a University. I realize that wasn't what I want to do and I felt really lost. During my time in my graduate program, I learned about Cooperative Extension and got experiences in it and grew to really like the work. It's basically bridging research to practice (e.g., curriculum, policies, programs). I get to do applied research and also to connect with the community through programs implementation, evaluation, etc. After I graduated, I got an academic position in Cooperative Extension where I get to develop my own program and work and do everything I listed above. I work in the local community/county as a representative of the University and also work with statewide and nationwide colleagues on research projects. The position is also a tenured position (we call it indefinite status but similar concept). So yes, there are definitely options to look into depending on your field and what kind of work you enjoy. I know how it feels like and I wish you all the best!",
      "author": "PixiePyxis",
      "created": 1633119807,
      "upvotes": 2,
      "replies": {}
    },
    "hewofww": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/hewofww/",
      "text": "Take a year off and go do something random like drive for FedEx or Uber, while you think about it. You may find you miss your field.",
      "author": "ostrogotha",
      "created": 1633041596,
      "upvotes": -5,
      "replies": {}
    },
    "hexv9nr": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/hexv9nr/",
      "text": "Learn stats and fast",
      "author": "ohnoyoudin",
      "created": 1633063418,
      "upvotes": -1,
      "replies": {}
    },
    "heznpzz": {
      "link": "/r/AskAcademia/comments/pyu85v/feeling_lost_i_dont_know_what_to_do_after_my_phd/heznpzz/",
      "text": "Firstly, you will be fine. Whenever we go into something new we imagine the scope of this new terrain to be as narrow as the set of experiences we had before it. But trust me, there are so many things you can do you just need to work on how you are going to pitch yourself in whatever field you choose. Stay calm and just enjoy searching. You are not as old as you think you are not falling behind. You may have 3, 4, 5 or more different careers before you retire.",
      "author": "boolew",
      "created": 1633104919,
      "upvotes": 1,
      "replies": {}
    }
  }
}