{
  "sid": "q21t9m",
  "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/",
  "title:": "PhD student financial advice",
  "text": "My supervisor sent my paper to an open access journal without asking me, the paper has been published and i am the first othor, now i should pay 1150$ to Hindawi invoicing. I have no funds to pay this amount. I tell that to Hindawi invoicing. But they still telling us that we will be added to a BAD DEBT LIST. Means that my supervisor can not publish or review with all Hindawi journals. I don't know what to do. My supervisor continue to push me to pay. Do i must pay the APC fees ? It's my first paper, it's already published, it's a Q1 journal but 1150$ stay to much for a PhD student in Morocco.",
  "author": "mamamiya12345",
  "created": 1633456536,
  "updated": 1634078758,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hfibvvr": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfibvvr/",
      "text": "The lab should pay to have the paper published with LAB  funds.",
      "author": "BronzeSpoon89",
      "created": 1633458276,
      "upvotes": 22,
      "replies": {}
    },
    "hfiic17": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfiic17/",
      "text": "There is no such rule that the 1-st author should pay. Usually it is paid by the lab from grant fundings. \n1150$ is a lot of money. All papers I published were covered by grants / university and I never paid for it from my pocket.\nAt least split the bill among all coauthors.",
      "author": "MrBacterioPhage",
      "created": 1633461059,
      "upvotes": 16,
      "replies": {
        "hfj8br9": {
          "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfj8br9/",
          "text": "If there was a rule it would be last author should pay - not out of pocket but out of his/her lab funds.",
          "author": "tryatriassic",
          "created": 1633472219,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hfilg7e": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfilg7e/",
      "text": "No one should be paying for journal fees out of their own pockets and your PI is an ass. This should be paid for out of lab funds. \n\nI suggest you contact the editor and let them know you have no funds for publishing and ask if they can waive fees. A lot of journals will waive fees for researchers in LMICs. \n\nI also think you need to consider your future with this guy. He's exploiting you and showing a lot of bad practice and ethics. This is bordering on academic misconduct and you need to give thought to how you can protect yourself. Is there anyone in your department you can speak to?",
      "author": "ACatGod",
      "created": 1633462324,
      "upvotes": 11,
      "replies": {}
    },
    "hfiae17": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfiae17/",
      "text": "I would request that the paper be retracted. Did you give permission to have it published? And you certainly should not pay, since you did not submit it in tje first place! If anyone should pay, its your advisor.",
      "author": "hartfordmove",
      "created": 1633457701,
      "upvotes": 7,
      "replies": {}
    },
    "hfj87dq": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfj87dq/",
      "text": "Did you sign anything and / or provide consent to pay? If not, it's an empty threat to try and get you to pay, they can't legally do anything.  \n  \nThere is no such thing as a 'BAD DEBT LIST'.   \n  \nAlso your supervisor is an asshole - no ethical human would try to force a student to pay publication fees, *especially* after submitting without consent.",
      "author": "tryatriassic",
      "created": 1633472163,
      "upvotes": 8,
      "replies": {}
    },
    "hfk180p": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfk180p/",
      "text": "The senior author should pay. There have been cases where the prof cannot pay and the department will cover it or part of it. Under no circumstances should a student be using their personal funds to cover journal fees. \n\nOn a happier note, congratulations that your paper was accepted.",
      "author": "professorbix",
      "created": 1633486413,
      "upvotes": 7,
      "replies": {}
    },
    "hfjrmln": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfjrmln/",
      "text": "The journal needs your consent to publish the paper and you do not owe them any money. If your supervisor sent them the paper and you agree to publish it there, your supervisor can pay the fee.",
      "author": "bigrottentuna",
      "created": 1633481450,
      "upvotes": 4,
      "replies": {}
    },
    "hfkihn7": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfkihn7/",
      "text": "Retract the paper and change your advisor.... Better to do it now then later.. advisors become future colleagues and co-authors. You don't know untrustworthy collaborators.",
      "author": "lawsofsan",
      "created": 1633495883,
      "upvotes": 3,
      "replies": {
        "hfkiogt": {
          "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfkiogt/",
          "text": "General tip: Also be aware, quantity of papers doesn't fly everywhere.. lower quality journal publication is like shooting yourself in the foot in terms of your career prospects...",
          "author": "lawsofsan",
          "created": 1633496008,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfiwary": {
      "link": "/r/AskAcademia/comments/q21t9m/phd_student_financial_advice/hfiwary/",
      "text": "Report it to the department chair and dean and university ethics",
      "author": "PolarCredenza",
      "created": 1633466887,
      "upvotes": 2,
      "replies": {}
    }
  }
}