{
  "sid": "k5b5jj",
  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/",
  "title:": "Now that you're in academia, do you really think grades matter?",
  "text": "Out of curiosity! I once worked with the head of a PhD program who casually mentioned that the University's grade cutoffs for candidates sometimes leaves them with people who are great at coursework but have no research experience (implied: they drop out too). That's why he's not a fan of the cut-offs but it's the policy... and I'm also wondering if you choose RAs or TAs based wholly on their grades?",
  "author": "alternativepost",
  "created": 1606922524,
  "updated": 1634080562,
  "over_18": false,
  "upvotes": 249,
  "upvote_ratio": 0.98,
  "comments": {
    "gedljrh": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedljrh/",
      "text": "In my time as a graduate student, postdoc, and professor, I have found nearly no correlation with undergraduate GPA and ability as an experimental researcher. \n\nYou might find this paper interesting: [environment is more important than perceived academic ability for \"successful\" PhDs.](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0236327)\n\nAs for grad course grades, I care only insomuch that the student is not at risk of dropping out of grad school.",
      "author": "DrSomewhatEvil",
      "created": 1606922973,
      "upvotes": 305,
      "replies": {
        "gee32xn": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee32xn/",
          "text": "Is this including students who have below a 2.0? In my experience those students also don’t show up to meetings and are unreliable when they volunteer for things.",
          "author": "Maddprofessor",
          "created": 1606930068,
          "upvotes": 50,
          "replies": {
            "gee9mql": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee9mql/",
              "text": "I have found students (with excellent GPAs) to be unreliable, as well. \n\nWhen I became an assistant professor, I found it a source of bemusement / slight irritation that with years of data (student outcomes) and corresponding admissions data, we *still* hadn't figured out what makes for a successful graduate student. I think there's a lot of agreement that the current measures (GPA, GRE scores, LORs) are unreliable indicators, at best. What, then, make for a good graduate student?\n\nI truly do believe graduate student success as a researcher comes down to a combination of personality traits, once you've broached the floor of being able to succeed in graduate school course (which I believe 50-70% of our applicants do). These traits are not as well-formed as I'd like, but descriptively they are:\n\n1. **Conscientiousness**: So much of a graduate student's success depends on their reliability, both in and outside the lab (and this also speaks to your point about showing to meetings, etc.). Follow through is *so* important in academia when it comes to completing experiments and writing papers. \n2. **Emotional Tenacity**: A tendency I've noticed of students at fairly well-known institutions: their *utter* inability to deal with failures, perceived or real. I understand it's my job to mentor my students academically and nurture them emotionally, but I've found far more success with students that bounce back and try even harder. Maybe this speaks to my mentoring style.\n3. **Risk-management skills**: Researchers, by and large, are venturing out into the unknown. Whether that means trying a new technique or formulating a new experimental paradigm, that means a certain amount of risk involved (both in terms of time and money). However, I've seen some students take this *too* far, without factoring their own abilities and experimental logistics. So this is a tough one... I'm still learning it myself!\n\nIf you could guarantee me a quantitative metric that assesses all three of these plus the requisite academic ability to pass graduate courses, I'll send you a box of whatever beverage you'd like. Until then, it's parsing it out from interviews, letters, and all the other indicators we currently have available.\n\nEdit: typo",
              "author": "DrSomewhatEvil",
              "created": 1606932695,
              "upvotes": 133,
              "replies": {
                "geeh6ri": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeh6ri/",
                  "text": "I think my undergrad institution had/has a really good way of doing grades. You get an A, B, C, or \"No Record\" on your transcript. There are no +/- grades, and an \"F\" doesn't affect your GPA in any way (you just have to retake the class if it's one that's required for graduation). I think part of the reason for this was that we have 7-week quarters rather than semesters, so it's hard to make up a poor grade. To get good grades required conscientiousness and tenacity, because if your grade slipped it often fell into a death spiral. So between the larger \"buckets\" (which are probably more accurate) and the shorter time period for each course, plus a substantial project requirement, a lot of employers in the community knew that they were going to be hiring reliable engineers out of this institution.",
                  "author": "Kittens-and-Vinyl",
                  "created": 1606935663,
                  "upvotes": 26,
                  "replies": {
                    "gef4cj2": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef4cj2/",
                      "text": "While I see how this might be helpful for measuring, as a PhD student I've been teaching and TAing at an institution that uses this grading system for (far too many) years now, and it drives me crazy, as an 81 and an 89 are the same grade, with no distinctions, and it becomes my problem (especially as a TA) because every student complains. I've even heard from students \"but I did so much better than \\[my friend\\] who got an 82 and I got an 89! It isn't fair!\"\n\nIt really made me annoyed fairly quickly with both the students and the system that didn't let me distinguish between the \"almost a C\" and \"almost an A\" students.\n\nThe \"failure has no consequences\" thing I was very behind in theory, until I discovered that it so often resulted in people retaking the same class 2 or 3 times, or people just stopping to come as soon as their average dropped into the C-range because \"an F is better than a C.\" It was their choice, but when they did this in the middle of the semester after I'd been working with and helping them... it also drove me crazy.\n\nWe're on a semester system though; I actually would imagine both of my complaints would be much reduced with a shorter course period. Thank you for listening to my rant. :)",
                      "author": "Morkskittar",
                      "created": 1606945872,
                      "upvotes": 14,
                      "replies": {
                        "gef6zjg": {
                          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef6zjg/",
                          "text": "I do agree that the lack of +/- can be wearing if you're using strict cutoffs. Most professors at my school chose cutoffs based on class performance; one computer science professor in particular showed that in his classes, students almost always perfectly fell into three clusters each term, which made assigning grades easy. The shorter terms also helped. \n\nThe thing about the \"No Record\" failure system was that failure didn't have no consequences--the consequence was having to retake the class, which meant either \"overloading\" (taking 12 credits a quarter instead of 9, which carried an extra fee), taking the class over the summer (which cost an extra semester's tuition), or extending your time to degree. Many scholarships also required that students pass all the courses they took. So the consequence was financial rather than messing up your GPA for all time. I totally understand the frustration of someone just stopping a class in the middle of the term, though.",
                          "author": "Kittens-and-Vinyl",
                          "created": 1606947064,
                          "upvotes": 9,
                          "replies": {
                            "gefekpa": {
                              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefekpa/",
                              "text": "I imagine part of my problem too might have been working under professors who treated grading just like they would have at any other institution, and then dropping the +/-'s. So many of my frustrations may just have been with professors who refused to adapt to the system. A not uncommon problem...",
                              "author": "Morkskittar",
                              "created": 1606950711,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gef56co": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef56co/",
                  "text": "Reading this made me feel really smug because today I sent out an application for a graduate course that asked \"why do you think you're a good student?\" (and other questions along those lines) \nand what you wrote were pretty much my answers.\n\nI said that the 3 most important qualities to have are determination, patience and resilience and also mentioned that I believe that planning everything ahead and avoiding procrastination is essential to maintain a healthy work-life balance.\nI also said that research is riddled with setbacks and you have to be able to pick yourself up and use it as an opportunity to grow.\n\n\nMaybe asking them to write you an essay about this would be useful for selection?\nGive them a 500 word limit and ask \"what do you think are the most important qualities for a successful student to have, and why do you believe that you have those?\n\nIt would simultaneously work great to filter out the people who think it's all fun and games and who aren't expecting a certain level of frustration/suffering.",
                  "author": "idk7643",
                  "created": 1606946236,
                  "upvotes": 6,
                  "replies": {}
                },
                "geeanny": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeanny/",
                  "text": "Very insightful, and totally agree! Thanks for sharing",
                  "author": "d3lilley",
                  "created": 1606933090,
                  "upvotes": 4,
                  "replies": {}
                },
                "geg5yhd": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg5yhd/",
                  "text": "Emotional tenacity is def a make or break trait. So if you ever gonna make a matrix, add this one to the tol. \nThat trait alone changed me from a 2.7/4 GPA party animal to a postdoc at a highly prestigious institute under a field leading researcher. And I still do my partying. \nOnce I start on a task, I cannot stop until I figure it out. It is like a tunnel vision. Learning how to control it took me to the next level of efficiency. Now I can focus infinitely on a task and still manage to stop before I end up spinning in circles.",
                  "author": "stdoggy",
                  "created": 1606964620,
                  "upvotes": 4,
                  "replies": {}
                },
                "geeaoap": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeaoap/",
                  "text": "Do you teach your grad students these skills?",
                  "author": "noneofmybeesknees",
                  "created": 1606933096,
                  "upvotes": 4,
                  "replies": {
                    "gef7xck": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef7xck/",
                      "text": "While risk-management skills are certainly teachable through experiences, I’m afraid conscientiousness and emotional tenacity are not. Although I may be wrong, my feeling is that these personal traits are either inculcated throughout adolescence or something rather acutely dramatic has to happen for these traits to really take. And I certainly don’t want to run a lab where the latter has to happen on a regular basis.",
                      "author": "DrSomewhatEvil",
                      "created": 1606947499,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "geej3vx": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geej3vx/",
              "text": "In my experience grades do not correlate with success for students with grades in the 50-95 percentiles. The very top do well and the bottom half tend to struggle.",
              "author": "rlrl",
              "created": 1606936566,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "geede55": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geede55/",
          "text": "[deleted]",
          "author": null,
          "created": 1606934144,
          "upvotes": 27,
          "replies": {
            "gefeqi3": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefeqi3/",
              "text": "Reach out to potential PIs early, like months in advance. And if you are better in person ask if they have time to meet in person or via zoom.  Getting a faculty member to want you as a student is key. I'm sorry that programs aren't seeing your worth. If you already have publications you should be a desirable candidate.",
              "author": "cookiegirl",
              "created": 1606950793,
              "upvotes": 6,
              "replies": {}
            },
            "gef31va": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef31va/",
              "text": "Are you applying in one country only though?",
              "author": "RRautamaa",
              "created": 1606945284,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gedx2sk": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedx2sk/",
          "text": "I have found a direct correlation between students who seek help early on in the semester and students who receive A's.",
          "author": "Horace_P_Mctits",
          "created": 1606927709,
          "upvotes": 43,
          "replies": {}
        },
        "geg1s3k": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg1s3k/",
          "text": ">In my time as a graduate student, postdoc, and professor, I have found nearly no correlation with undergraduate GPA\n\nIn each of those capacities, you are dealing with students at a particular institution. They have already been pre-screened based on GPA as well as other factors. Those with substantially better GPAs chose better schools and those with worse GPAs did not get in.\n\nIf you still want to draw correlations, those with lower GPAs were probably better because their applications were screened more carefully.",
          "author": "foradil",
          "created": 1606962291,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gedt5rr": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedt5rr/",
      "text": "I had a 2.4 in undergrad, and now am in a TT position at an R1. I was successful in grad school. \n\nBecause of this, I push my department on admissions to look past the GPA of a student, and at everything else. Courses are (at least in my experience), SO DIFFERENT at the graduate level, that they tend to lend themselves to students differently.",
      "author": "FemmeLightning",
      "created": 1606926136,
      "upvotes": 93,
      "replies": {
        "gee968z": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee968z/",
          "text": "I wanna say you’re such an inspiration to someone like me! I also have a low undergrad GPA (2.8) and not a whole lot of research experience (senior thesis - 8 months). I studied physics at the undergrad level, now I’m looking to enter the MechE world via an MSME and then eventually a PhD. How can I go about convincing future supervisors to take on someone like me (who also doesn’t have much experience in ME)?",
          "author": "JoeyLing",
          "created": 1606932517,
          "upvotes": 26,
          "replies": {
            "geefr7l": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geefr7l/",
              "text": "What worked for me was sitting down with potential supervisors and being open about the fact that I didn’t push myself in undergrad, and that my grades suffered for it. I then outlined my plan for how I could be successful in grad school.  \n\nI did end up beginning my first semester with no funding and on academic probation, but by halfway through the semester I had obtained an assistantship and maintained one through graduation.",
              "author": "FemmeLightning",
              "created": 1606935053,
              "upvotes": 28,
              "replies": {
                "geehjk1": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geehjk1/",
                  "text": "Were you able to get into a direct PhD program or did you do an MS first? I think the problem for me (in Canada) is that profs ask for transcript first and then just seeing that alone reject me without giving me a chance to speak.",
                  "author": "JoeyLing",
                  "created": 1606935832,
                  "upvotes": 7,
                  "replies": {
                    "geeo8b2": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeo8b2/",
                      "text": "I chose a program that offered Masters, Doctoral, and combination programs. I started with applying to the masters, and then a year in applied to the doc program so that I could be in the combo.",
                      "author": "FemmeLightning",
                      "created": 1606938776,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "geelyre": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geelyre/",
          "text": "Hey I also have a low GPA, but I’ve been working undergrad research assistant positions since I started college, I even had one in high school. I’m going to be applying for grad schools next year, how did you manage to explain your low GPA, or do you just not put any emphasis on it?",
          "author": "UNTDuderino",
          "created": 1606937858,
          "upvotes": 4,
          "replies": {}
        },
        "geejoew": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geejoew/",
          "text": "This makes me really happy to read. Bravo!",
          "author": "yourmomdotbiz",
          "created": 1606936823,
          "upvotes": 3,
          "replies": {}
        },
        "gedwdr5": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedwdr5/",
          "text": "Okay, but you are arguably an exception. Undergrads that I knew with a 2.5 or under were bad students and not only never wanted to go grad school, but they wouldn't have succeeded anyway. You were successful in grad school, but you were not in undergrad. That's just a fact. \n\nGPA can tell a lot about a student. I wonder how many other TT professors at your R1 had 2.5 or under GPA's in undergrad? I bet none.",
          "author": null,
          "created": 1606927429,
          "upvotes": 11,
          "replies": {
            "geeizmf": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeizmf/",
              "text": "Hi, TT prof @ R2 here – my undergrad GPA was 2.7. \n\nThis was mostly from disinterest in core curriculum courses and focusing on other interests outside of uni.  My grad school GPAs were 3.95 and 3.90. Totally different world. Congrats FemmeLightning!",
              "author": "grape_freezie",
              "created": 1606936509,
              "upvotes": 18,
              "replies": {
                "geeogro": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeogro/",
                  "text": "Congratulations to you as well! I agree that grad school is a totally different world - my GPAs ended up being 4.0 and 3.8, when parsed out for masters and PhD (I was in a combination program to get both). \n\nIt is SO DIFFERENT when you actually care about the course work!",
                  "author": "FemmeLightning",
                  "created": 1606938868,
                  "upvotes": 11,
                  "replies": {
                    "geetn18": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geetn18/",
                      "text": "Agreed. My focus in grad school and what I teach now is a subject I got D's and C's in during undergrad. Did not connect with UG instructor / methodology / delivery / focus.",
                      "author": "grape_freezie",
                      "created": 1606941032,
                      "upvotes": 3,
                      "replies": {
                        "gegekjc": {
                          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gegekjc/",
                          "text": "I also found that UG was soooo focused on testing, whereas grad school utilized so many more performance assessments. I’m a shit test taker.",
                          "author": "FemmeLightning",
                          "created": 1606969720,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gegdppf": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gegdppf/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1606969189,
                  "upvotes": 3,
                  "replies": {
                    "gehrxok": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gehrxok/",
                      "text": "My first grad school experience was thankfully at my home institution. Professors knew me well and probably knew I would succeed in their graduate program despite ~~some~~ many poor grades. Without saying too much, I was top of my class in one aspect of my field, but certainly forgettable in the others. I'm glad they saw past my failures and poor decisions (at times)! It led to an award and the smallest of publications of my work. My next graduate degree admission was probably easier given this.",
                      "author": "grape_freezie",
                      "created": 1607009520,
                      "upvotes": 3,
                      "replies": {
                        "gehsr95": {
                          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gehsr95/",
                          "text": "[removed]",
                          "author": null,
                          "created": 1607009935,
                          "upvotes": 1,
                          "replies": {
                            "gemev95": {
                              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gemev95/",
                              "text": "I think the letters were definitely positive! Pub was an article in a journal.",
                              "author": "grape_freezie",
                              "created": 1607107706,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gedyrih": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedyrih/",
              "text": "Sure, I’m an exception, but I was thankful to be given a chance to prove myself after failing in undergrad. I see no problem with letting others try to prove themselves.",
              "author": "FemmeLightning",
              "created": 1606928369,
              "upvotes": 30,
              "replies": {}
            },
            "gefik8w": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefik8w/",
              "text": "I've helped a couple students with two point somethings get into grad school. Both were successful (one I recommended, the other I helped with revisions to his personal statement). Basically, I think if a student is interested in grad school and can gather recommendations with that sort of GPA, profs are seeing something in them that suggests success. We can probably speak even more precisely to why they'd be a good candidate. I have felt less confident about the success of people with high GPAs that I've recommended. I'm not going to put my name on somebody with a 2.0 unless I know they're going to make it and do great.",
              "author": "phoenix-corn",
              "created": 1606952569,
              "upvotes": 3,
              "replies": {}
            },
            "gegxsne": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gegxsne/",
              "text": "I'm nearly tenured, too, and my undergrad GPA was shitty--about 2.8 as well.\n\nEdit for context: I should say, I was a bit lazy and out of my element as an undergrad, but I found a passion for my field, applied linguistics, thereafter. I read a ton and studied on my own before grad school. After my MA, I had some practical experience so when I went back to grad school again to do PhD research I was able to actually thrive for my first time as a student.",
              "author": "sleepfuriousidea",
              "created": 1606985341,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gegaepw": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gegaepw/",
          "text": "When I was in grad school my lab manager was applying to grad schools. She had a 2.7 GPA. She applied to my graduate program, among several others at my university, when I was on the admissions committee. It was never a conflict of interest because the Office of Graduate Studies will not accept applicants with a GPA of less than 3.0 except with a special appeal submitted for review. However, the programs are so competitive that no one is going to bother with submitting that appeal. \n\nHowever, she did get into a really good grad program on the east coast. She spent some time interviewing at 2 or 3 labs to present on her post-grad work, and got endorsement from profs at those universities. Since those programs place more weight on prof input and willingness to accept a student than GPA, she was admitted.",
          "author": "alexa-488",
          "created": 1606967181,
          "upvotes": 1,
          "replies": {}
        },
        "geewa08": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geewa08/",
          "text": "Low undergrad GPA gang represent. I also have a C from my grad school by the way.",
          "author": "N1H1L",
          "created": 1606942235,
          "upvotes": 1,
          "replies": {
            "gefwreq": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefwreq/",
              "text": "What do you do now?",
              "author": "JoeyLing",
              "created": 1606959557,
              "upvotes": 1,
              "replies": {
                "geg315u": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg315u/",
                  "text": "Postdoc transitioning to a staff scientist.",
                  "author": "N1H1L",
                  "created": 1606962988,
                  "upvotes": 1,
                  "replies": {
                    "geg37xl": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg37xl/",
                      "text": "Damn! Share your story please",
                      "author": "JoeyLing",
                      "created": 1606963093,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gedpbqv": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedpbqv/",
      "text": "[deleted]",
      "author": null,
      "created": 1606924536,
      "upvotes": 225,
      "replies": {
        "geeavtb": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeavtb/",
          "text": "I frequently tell my students on the first day of class that one of the best things that happened to me as a college student was getting an \"F\" on a paper within my first year. I was one of those smartass kids who thought they knew everything, and this just knocked some sense into me. \n\nSince I deal primarily with first-year students, I find it important that students be okay with making mistakes and learning how to learn from those mistakes.",
          "author": "unknownkoger",
          "created": 1606933177,
          "upvotes": 49,
          "replies": {}
        },
        "gedsltl": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedsltl/",
          "text": "You’re right. Every undergrad with a 4.0 I’ve ever mentored while working on my PhD has broken down because they expect every experiment to be perfect and work in their favour (STEM field, btw). In my experience they also tend to be the most combative and spend their time looking for shortcuts instead of doing things the tight way the first time. Don’t get me wrong, sometimes shortcuts are great, but not when you’re learning to do things for the first time. \nI also find that those who have outside work experience seem to be able manage their time better and can handle failure and feedback pretty well.",
          "author": "frustratedstudent99",
          "created": 1606925912,
          "upvotes": 83,
          "replies": {
            "geea1zc": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geea1zc/",
              "text": "Grad school was so humbling for me, toxic environment nonwithstanding. I was top of my class in undergrad, but there were folks in my cohort in graduate school who were way more knowledgeable than me (I switched disciplines) and none of the coursework came easy to me. I had to work my ass off, and honestly I am more proud of pushing through and learning that it's okay (and normal!) to not be the best at everything. It's okay to ask for help from those who know a subject area more.",
              "author": null,
              "created": 1606932859,
              "upvotes": 26,
              "replies": {}
            }
          }
        },
        "gefhu3u": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefhu3u/",
          "text": "I did poorly in a couple classes in undergrad... but the first time I had to revise something (and not just finish it) was my Master's thesis. That was not a good time.",
          "author": "phoenix-corn",
          "created": 1606952200,
          "upvotes": 5,
          "replies": {}
        },
        "gegt3b8": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gegt3b8/",
          "text": "This comment reminds of [this popular post](https://www.reddit.com/r/WhitePeopleTwitter/comments/k20bm3/personally_attacked_rn/) from a few days ago",
          "author": "PlanetaryPeach",
          "created": 1606980788,
          "upvotes": 1,
          "replies": {}
        },
        "gee9get": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee9get/",
          "text": "This is why the participation trophy mentality hurts people, they don't learn how to fail early on, and learn from their failures.",
          "author": "orangeblackteal",
          "created": 1606932627,
          "upvotes": -14,
          "replies": {
            "geecfbc": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geecfbc/",
              "text": "Feeling okay about trying even if you didn't win is pretty much the key to success. A participation trophy rewards effort, not outcome. \n\nIf you keep showing up and patting yourself on the back for trying, (not chastising yourself for not being perfect), that is pretty much the road to success. The road to failure involves letting short-term failures get you down, and seeing anything but the best as a failure.",
              "author": "fiftycamelsworth",
              "created": 1606933769,
              "upvotes": 29,
              "replies": {
                "geenc1z": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geenc1z/",
                  "text": "\"Effort\" is relative...rewarding one for simple participation disincentivizes actual work ethic and rewards mediocrity.",
                  "author": "orangeblackteal",
                  "created": 1606938427,
                  "upvotes": 2,
                  "replies": {
                    "gefo4f4": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefo4f4/",
                      "text": "I see your point. I personally subscribe to the woody allen view that 90% of success is just showing up. \n\n This is just my experience, but the key to success in grad school seems to be to keep moving forward despite mediocrity, and then improving along the way. In fact, I'd go so far to say that learning to do things mediocrely can be a great strength, since there is SO much to do that sinking extra time in to perfect things and overthinking can really slow you down. It seems like the key is just continuing to show up and do something, day in and day out.  Especially since so much of it is drudgery that doesn't require perfection.",
                      "author": "fiftycamelsworth",
                      "created": 1606955269,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "geeoaci": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeoaci/",
              "text": "I kinda disagree with this. I think, particularly with kids, it teaches that failure as a result doesn't mean the activity wasn't worth doing. \n\nIf anything, it's the ridged, and largely false, dichotomy between complete success and total failure that causes kids to avoid circumstances in which they could face defeat and only take on tasks they're sure they can complete.",
              "author": "Wareve",
              "created": 1606938799,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "gee21ml": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee21ml/",
      "text": "I think it depends on the discipline. There are some disciplines where the coursework poorly reflects the actual demands of the job (e.g. apparently lab-based research), and disciplines where the coursework is a reasonable proxy for what you will be doing in the PhD (e.g. pure math). I find that people coming from the former background tend to argue that grades are not an indicator of future success, whereas people from the latter background see grades as a predictor. \n\nI also think this conversation tends to compare 4.0s to 2.0s, which is kind of missing the point. Like, of course you don't need a 4.0 to succeed in grad school. But I also don't think a C average tells us nothing and I get why many programs are reluctant to take a chance on someone with that background. Ceteris paribus, a person with a 3.5 is probably more likely to succeed in grad school than a person with a 2.0. I'm sure some people with a 2.0 could be fine scientists, but I think it's fair that they need to distinguish themselves from their brethren who don't care about school or don't have the chops.",
      "author": "thegreenaquarium",
      "created": 1606929668,
      "upvotes": 26,
      "replies": {}
    },
    "gedp30h": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedp30h/",
      "text": "[deleted]",
      "author": null,
      "created": 1606924437,
      "upvotes": 67,
      "replies": {
        "gee2zlh": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee2zlh/",
          "text": "I’m a first gen undergrad student in stem and it may seem odd but your comment has inspired me to believe that I can do it. “It” being grad school/academia. It’s a big goal of mine but I’m definitely not a star student which has led to a lot of self doubt. Fingers crossed that I keep pushing forward and will get to do all of those cool things that you’ve mentioned.",
          "author": "uoftisboring",
          "created": 1606930037,
          "upvotes": 25,
          "replies": {
            "gefpvbl": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefpvbl/",
              "text": "[deleted]",
              "author": null,
              "created": 1606955929,
              "upvotes": 4,
              "replies": {
                "gefpwjz": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefpwjz/",
                  "text": "They all told me \"No\" and forbid me to do it\n\n But laying up in bed I decided \"well screw it\"\n\n I hopped on my bike and flew just like a bird\n\n But clipped a loose rock and smashed my brains on the curb\n\n___\n\n^^^You ^^^have ^^^been ^^^visited ^^^by ^^^the ^^^magical ^^^Barfturd ^^^bot. ^^^It's ^^^your ^^^lucky ^^^day. ^^^You ^^^used ^^^the ^^^words:  ^^^\"*to*  ^^^*do*  ^^^*it*  ^^^*but*\",  ^^^an ^^^excerpt ^^^from ^^^[barfturd.com](http://www.barfturd.com) ^^^poem ^^^[#45](http://www.barfturd.com/?id=45). ^^^Enjoy!",
                  "author": "barfturdbot",
                  "created": 1606955941,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gegr5v7": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gegr5v7/",
              "text": "First gen here too in STEM: Started at CC while trying to make it as a semi pro cyclist, flunked a few courses (took calc 2 and diff EQ twice!), but eventually got my shit together. Transferred to local state school after 4 years in CC (no joke) and did well, graduating w/honors despite my CC record. MS and PhD at R1, brief stint in industry, PD, and now staff scientist at the most desirable Nat Lab (for me at least). \n\nIt's easy too look around and be discouraged by everyone around you having it 'easy'. Truth is, everyone has some barrier to overcome. Make your career path, in academia or otherwise, what you want it to be. YOU CAN DO IT!!",
              "author": "PoorHungryDocter",
              "created": 1606979061,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gee3gp4": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee3gp4/",
          "text": ">I am one of those people with low GPAs and, by a mix of talent, hard work and some luck I managed to be in academia.\n\nSame, and also same regarding having more publications than others at my stage now.",
          "author": "kodakrat74",
          "created": 1606930215,
          "upvotes": 5,
          "replies": {}
        },
        "gees6uz": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gees6uz/",
          "text": "I’m first gen too! PhD candidate. Thank you for this writing inspo/motivation.",
          "author": "mooralli",
          "created": 1606940380,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gedoyyi": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedoyyi/",
      "text": "They matter to the extent you're unlikely\\* to succeed in academia if you don't have the ability\\*\\* to get good (or at least decent) grades, but with all sorts of caveats. In particular, the converse clearly isn't true, i.e., students who are good at exams aren't necessarily good at research.\n\n(There's also a restriction of range thing - within the set of people who go into research, I can imagine grades matter less; while your typical D, C student isn't going to be in that set in the first place.)\n\nCut-offs are a particularly blunt measure but given a presumable over-supply of candidates I do get it.\n\n\\* Pre-empting - unlikely, not impossible.\n\n\\*\\* Mainly, you could think of students who are just weak cognitively, but even, in all its unfairness, if it's environmental, that's still going to be predictive.",
      "author": "waterless2",
      "created": 1606924391,
      "upvotes": 34,
      "replies": {}
    },
    "gedtt74": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedtt74/",
      "text": "Disclaimer: I'm a current PhD student in genetics\n\nMy first time applying to work in a research lab as an undergraduate, the professor sent me a form to fill out for the application. The questions were just a bunch of stuff like \"what's your favorite book?\" and \"what are your hobbies?\" He explained that he hadn't yet found a reliable way to determine if an undergrad would be any good at research. From what I could tell, the only criteria he actually used to filter candidates was their current course schedule to see if they could make it to lab meeting.",
      "author": "bioinfx",
      "created": 1606926399,
      "upvotes": 28,
      "replies": {
        "gefiosy": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefiosy/",
          "text": "Honestly they might have been looking for personality fit as well--would you work well with the people who were already there? It matters just as much for success as GPA....",
          "author": "phoenix-corn",
          "created": 1606952634,
          "upvotes": 6,
          "replies": {
            "ges40eb": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/ges40eb/",
              "text": "Yes it sounds like he was looking at fit",
              "author": "VictoriaSobocki",
              "created": 1607229890,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gefk2ap": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefk2ap/",
          "text": "They may have also decided that if they cannot determine a way to isolate better researchers, they might as well have people they like to be around in the lab.",
          "author": "stolid_agnostic",
          "created": 1606953169,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gedr2x6": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedr2x6/",
      "text": "In my area of bench science, I'd say there are four weakly interacting components, raw intellect, applied effort, environment and luck, probably in ascending order.\n\nIn so far as raw intellect and applied effort feed into grades, they assist in getting into good environments. That said, most school and undergraduate grading systems are designed to weed out under-performers, not highlight high achievers, so I don't find grades particularly predictive, and a period of failure to apply effort is often a case of personal circumstances / stress / mental health, rather than the historical assumption of laziness.\n\nI'd imagine that this is less the case in theoretical fields with a wider spread on the grading curve.",
      "author": "Hasefet",
      "created": 1606925258,
      "upvotes": 12,
      "replies": {}
    },
    "gee0g2f": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee0g2f/",
      "text": "There's a difference between not having a perfect 4.0 GPA, and having a really poor one.\n\nIn my experience, watching my undergraduate colleagues, my grad school colleagues, and seeing where everyone goes, there was certainly correlation between the people who had the drive and the facility of learning that allowed them to get great grades, and those that went on to do graduate school.\n\nI knew others who were slow starters, who struggled, got by with lower GPAs, still went to grad school. They stumbled a lot, and went into industry.\n\nIt also wasn't purely causative. The guy from my undergrad who had the best GPA who we all thought would have the next Nobel dropped out of his PhD to become a weather technician. But, the next top two are now professors (and the only from that year), and the top of the following year is also a professor, while no one else is.\n\nSame goes for grad school. I was in a fairly large cohort, and only the top two of the class went on to become faculty. The rest are in industry/languishing in postdocs somewhere.\n\nSo, in my anecdotal experience, yeah GPA correlates with success. If you're a driven, ambitious, flexible individual who can quickly learn and apply new concepts, you'll have good grades. Good grades aren't enough, of course, but they seem to correlate well with success.",
      "author": "ThePhysicistIsIn",
      "created": 1606929037,
      "upvotes": 26,
      "replies": {
        "geh8kae": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geh8kae/",
          "text": "Just curious, what would you consider a \"poor\" GPA? My UGPA is around 3.1X (it's actually 2.9X if you only count major courses) and I consider mine to be pretty horrendous.",
          "author": "Seankala",
          "created": 1606996886,
          "upvotes": 1,
          "replies": {
            "gehi6nw": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gehi6nw/",
              "text": "Well it depends on the context. 3.1 is great if you’re not trying to get to grad school, it’s a bit low if you are, and if you already are in grad school, it’s a failing GPA.\n\nI have friends with 3.1 GPAs who went to grad school, they just had a rougher go at it, and didn’t pursue academia. One of them is in industry, the other is that person that takes care of the labs but isnt a professor in your physics classes",
              "author": "ThePhysicistIsIn",
              "created": 1607004132,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "geduvf0": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geduvf0/",
      "text": "If grades don't matter, standardized scores don't matter, and recs don't matter, by what replicable and defensible criteria should we select students?\n\nOf course, when I ask my colleagues this question, they ramble for a bit and push forward the same set of candidates that falls down on two or three of the above. One? No big deal. All? Come on.",
      "author": "ph0rk",
      "created": 1606926826,
      "upvotes": 30,
      "replies": {
        "gee4xvw": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee4xvw/",
          "text": "Perhaps part of this is recognizing that there is no meritocratic system that collects everyone who 'deserves' it and is the 'best' because such a thing doesn't really exist. You can prioritize replicability in your system of choosing students but that doesn't make it ultimately fair or good for society.  I don't have an answer but not having a better system doesn't preclude critique of the current system.",
          "author": "drgledagain",
          "created": 1606930837,
          "upvotes": 12,
          "replies": {
            "gee6d1n": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee6d1n/",
              "text": "> that doesn't make it ultimately fair or good for society\n\nThe people on the committee want to pretend they make subjective choices that are \"fair or good\", but really they're self serving and recreate students with similar interests to themselves.\n\nAll that aside, there really *does* seem to be a difference in fields with a strong quantitative component between students with ok quant GRE scores and students with dismal quant GRE scores. You could probably tie that to coursework, instead - the better prepared students tend to do better on that subsection of the GRE and are better prepared for quantitative methods training at the graduate level.\n\nAlso:\n\n> Perhaps part of this is recognizing that there is no meritocratic system that collects everyone who 'deserves' it and is the 'best' because such a thing doesn't really exist.\n\nIf people really believed that, they'd admit students by lottery, but they don't. In fact, if you ask enough questions the people that want to avoid GREs, GPA, or LORs *do* have some rather specific criteria about what makes a potential student a better choice than another - they just refuse to state them as such so they can keep the evaluation within the realm of the subjective.",
              "author": "ph0rk",
              "created": 1606931448,
              "upvotes": 7,
              "replies": {
                "gef13pc": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef13pc/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1606944415,
                  "upvotes": 2,
                  "replies": {
                    "gef2ed2": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef2ed2/",
                      "text": "> I remember it seemed stupidly pointless and fairly easy to score high once you understand how the scoring system works\n\nI still see quant GREs below the 20th percentile from time to time.\n\nWhen you have that coupled with C’s in quant classes and letters that don’t address it at all, my money is that student will flounder in quant methods courses. The metrics for this aren’t perfect (which ones are?) but they also aren’t measuring something orthogonal to quantitative reasoning.",
                      "author": "ph0rk",
                      "created": 1606944988,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gee71js": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee71js/",
                  "text": "> If people really believed that, they'd admit students by lottery, but they don't. In fact, if you ask enough questions the people that want to avoid GREs, GPA, or LORs do have some rather specific criteria about what makes a potential student a better choice than another - they just refuse to state them as such so they can keep the evaluation within the realm of the subjective.\n\nAbsolutely agree with this. Most proposed systems are just bad in different ways from the current system. Honestly I think introducing at least an element of randomness would probably be good for academia; ie some system where the committee picks their finalists (maybe 3-5x the number of slots) and the final decision is made as a lottery. But people like to believe in meritocracy so I don't think we'll see this any time soon.",
                  "author": "drgledagain",
                  "created": 1606931702,
                  "upvotes": 2,
                  "replies": {
                    "gee7aww": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee7aww/",
                      "text": "> But people like to believe in meritocracy\n\nWell, the funny thing is the people wanting to nix the criteria use \"there is no such thing as a meritocracy\" as their argument... while they rank order persons from most to least preferable *due to merit*.\n\nLike... what?",
                      "author": "ph0rk",
                      "created": 1606931801,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gefb87i": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefb87i/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1606949098,
                  "upvotes": 0,
                  "replies": {
                    "gefjogd": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefjogd/",
                      "text": "> I don't think anyone believes it's not a predictor at all\n\nI have colleagues and see posters on this very sub that argue test scores and/or grades predict nothing. However, sure, they don’t predict everything.\n\nI’d, however, argue that poor grades *and* poor test scores predict a fair bit, and thus far many if not all of the special case admits that were low on both in the two grad programs I have been a part of have not gone well.\n\nA half or full standard deviation in scores is one thing, but assuming someone with a 14th percentile GRE has *markedly* worse performance than someone with a 50 or 65th percentile score, but a comprehension of these issues is rarely present when evaluating applicants.",
                      "author": "ph0rk",
                      "created": 1606953032,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gee0hfd": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee0hfd/",
      "text": "There's so much about personality that predicts success beyond grades. My husband and I probably had similar grades as an undergrad (maybe his a bit higher). Both all As in graduate school.  But he has a strong passion and drive for his field that I do not, was willing to put in the extremely long hours to be a successful academic, and now is a full Professor and Head of his department.  I'm an NTT Lecturer because I didn't have the drive.  Any decent student can get a decent GPA but that doesn't make them primed for an academic career.  The drive to get experiences during undergraduate  I think predicts a LOT more.  I see it in my undergraduates now - a clear distinction between those getting the necessary experiences and those who aren't motivated to do so.",
      "author": "katclimber",
      "created": 1606929053,
      "upvotes": 9,
      "replies": {}
    },
    "gedq1pp": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedq1pp/",
      "text": "[deleted]",
      "author": null,
      "created": 1606924826,
      "upvotes": 45,
      "replies": {
        "gedvwb7": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedvwb7/",
          "text": "Like all things in academia, it's so easy to take this to extremes, when of course in reality an intermediate position is probably best. If someone has a GPA of sub-2, they're probably not going to do well in grad school. If someone had a GPA that's sub 3, you probably need to look at EVERYTHING else to determine if they've got the chops. You do need to be smart to design experiments that will tell you something. If you're demanding 4.0s you're going to be disappointed (perhaps consistently!).",
          "author": "imhereforthevotes",
          "created": 1606927234,
          "upvotes": 20,
          "replies": {
            "gedxshw": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedxshw/",
              "text": "I think we're basically in agreement.\n\nRegarding experiment design -- Let me assert there's regression to the mean. Extremely high performing undergrads, as a group, will not do \\_as well\\_ as expected by their grades, bringing *some* disappointment. Students with poorer grades, if admitted, will be in the environment to write papers, and thus, as a group, look like a success story compared to their undergrad performance.",
              "author": null,
              "created": 1606927986,
              "upvotes": 12,
              "replies": {
                "gedyaeh": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedyaeh/",
                  "text": "Agreed!",
                  "author": "imhereforthevotes",
                  "created": 1606928180,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gee2ro8": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee2ro8/",
              "text": "> If someone has a GPA of sub-2, they're probably not going to do well in grad school. If someone had a GPA that's sub 3, you probably need to look at EVERYTHING else to determine if they've got the chops. You do need to be smart to design experiments that will tell you something. If you're demanding 4.0s\n\nI don't think this is representative of the grade distribution at most UGs tbh. Like, I suspect that the average cGPA across America is somewhere in the 3.3-3.5 range, and I suspect that people with sub-3 GPAs are underperforming by 1-1.5 SDs relative the AVERAGE student, not the valedictorian. I'd feel pretty safe assuming that, barring some major constraint, such a person won't excel in a graduate environment.",
              "author": "thegreenaquarium",
              "created": 1606929944,
              "upvotes": 8,
              "replies": {
                "geefbr9": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geefbr9/",
                  "text": "Yeah, very true, I was riffing a little there and that's not helpful. Seems like the sweet spot is 3.5-4, but that doesn't help you determine who's a \"afraid of failure\" grade grubber and who is intelligent but willing to take on challenges.",
                  "author": "imhereforthevotes",
                  "created": 1606934888,
                  "upvotes": 7,
                  "replies": {
                    "gef7xxd": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef7xxd/",
                      "text": "> who is intelligent but willing to take on challenges.\n\nAs someone who had a 3.9, this is one meme that really annoys me. You can look at my transcript. You can see I took extra high level classes. Sorry that coursework comes easy to me :/",
                      "author": "Mezmorizor",
                      "created": 1606947506,
                      "upvotes": 2,
                      "replies": {
                        "gef9vat": {
                          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef9vat/",
                          "text": "Right. Your point highlights the problems with GPA. It doesn't reflect the experience and in the case of grade grubbers is easily gamed.",
                          "author": "imhereforthevotes",
                          "created": 1606948437,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gehewtb": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gehewtb/",
                      "text": "I mean, that a metric isn't a good proxy for everything under the sun doesn't make it a bad metric... It's not like we apply to grad school with a piece of paper that states our full name and cGPA only, so I don't think the cGPA needs to do that.",
                      "author": "thegreenaquarium",
                      "created": 1607001997,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "geg0iu1": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg0iu1/",
              "text": ">If someone has a GPA of sub-2, they're probably not going to do well in grad school. If someone had a GPA that's sub 3, you probably need to look at EVERYTHING else to determine if they've got the chops.\n\nNeither of those are going to get into grad school in the first place, so they will not be part of the sample.\n\nIf you want to be pedantic, there are rare exceptions, but those individuals have other accomplishments, so they have proven to be more capable than their grades suggest.",
              "author": "foradil",
              "created": 1606961608,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gedx9cn": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedx9cn/",
          "text": "I agree 100%. This year there is no GRE math subject so it will be a forced experiment with having no GRE.",
          "author": "FilemonNeira",
          "created": 1606927780,
          "upvotes": 5,
          "replies": {}
        },
        "gedu7jm": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedu7jm/",
          "text": "i agree...we gotta hold the line!",
          "author": "patriotto",
          "created": 1606926560,
          "upvotes": 5,
          "replies": {}
        },
        "gedwpvg": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedwpvg/",
          "text": "We should probably jettison interviews first -- [how attractive someone is](https://en.wikipedia.org/wiki/Halo_effect#Role_of_attractiveness)  or how eloquently they may speak (esp. if English is not their native language) is probably not the best indicator of graduate school performance, either. Add extracurriculars / leadership in there too, to whatever extent they are relevant, since someone being captain of the sailing team or president of the outreach society or w/e may not have gotten there by merit.\n\nAlthough I think your modus tollens could well just be another's modus ponens -- admissions decisions should just be done by random lottery, with the program sorting wheat from chaff according to whatever performance metrics it strives to maximize.",
          "author": "--MCMC--",
          "created": 1606927566,
          "upvotes": 5,
          "replies": {
            "gee38xr": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee38xr/",
              "text": "PhD programs don't care about anyone's extracurriculars, nor how they look, and generally not whether or not they have an accent. I'm not sure where you're getting these assumptions.\n\n> admissions decisions should just be done by random lottery, with the program sorting wheat from chaff according to whatever performance metrics it strives to maximize.\n\nSome programs in the US used to do this, and some programs in Europe still do, and all of those programs are very toxic because students are in constant competition with each other. Academia is already enough of a battlefield; I'd rather some people have trouble getting in than all of us having to play the Hunger Games for funding and adviser attention.",
              "author": "thegreenaquarium",
              "created": 1606930128,
              "upvotes": 5,
              "replies": {
                "gee5qqf": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee5qqf/",
                  "text": "Eh, I've heard many times that programs want their applicants to be balanced individuals, rather than academic robots who do naught but study and research (esp. if the ECs evince passion for the field). And I'm not aware of any data showing that interviewers are free from pervasive biases common within the broader population? Lots of programs are taking steps to blind things like applicant names (which suggest gender, SES, and ethnicity), and that's a context I'd anticipate it being much easier to ignore demographic signifiers than a F2F interview, much less something even more salient, like attractiveness.\n\nThe suggestion here wouldn't be to accept everyone and face a funding shortfall, but rather to accept whatever proportion of applicants there are resources to support, just sampled at discrete uniform from the total pool of prospectives.",
                  "author": "--MCMC--",
                  "created": 1606931213,
                  "upvotes": 0,
                  "replies": {
                    "geed1k2": {
                      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geed1k2/",
                      "text": "> I've heard many times that programs want their applicants to be balanced individuals\n\nI think you might be confusing college and PhD admissions.\n\n> esp. if the ECs evince passion for the field\n\nYou mean, exclusively if the ECs relate to the field. As in, if you have an EC that is related to your discipline, it's worth putting on the CV. It won't have much of a part in moving the needle though.\n\n> And I'm not aware of any data showing that interviewers are free from pervasive biases common within the broader population?\n\nI never said that interviewers were free of biases. I said that looks and accent are not accepted admissions criteria. I see an argument for blind admissions, but I also see a bigger argument for knowing how this person whom you're hiring for 6+ years will be as a colleague.\n\n> but rather to accept whatever proportion of applicants there are resources to support\n\nYou are aware that a graduate class of 15-20 students would be considered a very large cohort, yes?",
                      "author": "thegreenaquarium",
                      "created": 1606934009,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "geea9fm": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geea9fm/",
      "text": "I received a prestigious government fellowship for my PhD. Thankfully the reviewers explicitly didn’t mind my 3.4ish GPA, and weren’t asked to see my GARBAGE GRE scores. \n\nMy research experience carried me through. I’ve always found the extent to which people do research to be the best predictor of research success.",
      "author": "Peekochu",
      "created": 1606932936,
      "upvotes": 6,
      "replies": {}
    },
    "geebnvy": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geebnvy/",
      "text": "Honestly, the best courses I have had were with professors who began each semester with \"I'm only grading you because the University is making me; either you'll learn something here or you won't.\"",
      "author": "WillitsThrockmorton",
      "created": 1606933473,
      "upvotes": 6,
      "replies": {}
    },
    "geerfj6": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geerfj6/",
      "text": "I was always a bad student, getting Bs/Cs in high school and undergrad even though I studied hard.  Just couldn't get a handle on testing, for whatever reason.  Even failed one class in undergrad and had to retake it which you'd think is integral to my research.\n\nOnce I got to my PhD and no more classes I learned a lot of great skills and the grit to pull through those classes by the skin of my teeth by working extra hard in other areas paid off.  I'm now a postdoc in Harvard which I never would have dreamed about bothering to apply to at earlier stages due to my grades.  So yeah, I definitely have opinions about just how much traditional exams matter versus just filter people out.",
      "author": "Andromeda321",
      "created": 1606940047,
      "upvotes": 6,
      "replies": {}
    },
    "geegiwv": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geegiwv/",
      "text": "When hiring RAs, I don't even ask for GPA. I am more concerned with research experience, skills, and reliability.",
      "author": "datafix",
      "created": 1606935357,
      "upvotes": 5,
      "replies": {}
    },
    "geevgfv": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geevgfv/",
      "text": "Currently a PhD student in psychology but I have directly supervised 20 undergrads. I agree with the consensus that grades are not the end all determinant of a strong RA and I don't use a GPA cut off at my particular school due to grade inflation and due to the fact that high grades really only tell me how well a person does in a structured, predictable environment. Research is anything but predictable and my most reliable RAs have been very adaptable to changing conditions, not discouraged by setbacks, intrinsically interested in research and diligent in completing work on time or at lease communicating that they will miss a deadline. I've had students across the GPA gambit be good RAs but (anecdotally) the people with higher GPAs seem to have a harder time completing work independently and freak out often if things are not going according to plan. They also view their responsibilities as more optional for some reason while those with lower GPAs have completed work on time with no excuses.  \n\nAs a graduate student, everyone in my program has 3.8-4.0. Half of the people finish the PhD and half do not so GPA is not a factor in graduate school completion. At least in my cohort, the people who have had more adverse life experiences are the ones who are still enrolled.",
      "author": "Content_Bowl",
      "created": 1606941868,
      "upvotes": 5,
      "replies": {}
    },
    "gefq4wb": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefq4wb/",
      "text": "The cool, laid-back, edgy answer here is the grades don’t matter. That, of course, is not the case. While there are exceptions going both ways, students with better grades generally do better.",
      "author": "Aubenabee",
      "created": 1606956029,
      "upvotes": 5,
      "replies": {}
    },
    "gedqd8x": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedqd8x/",
      "text": "2.8 undergrad gpa and I'm publishing papers now as a masters student.\n\nWhile I am no longer getting Cs I still hate dedicating so much time for assignments .",
      "author": "Onion-Fart",
      "created": 1606924959,
      "upvotes": 10,
      "replies": {
        "geejsij": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geejsij/",
          "text": ">2.8 undergrad gpa and I'm publishing papers now as a masters student.\n\nAwesome :)",
          "author": "yourmomdotbiz",
          "created": 1606936871,
          "upvotes": 2,
          "replies": {}
        },
        "geh8ynw": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geh8ynw/",
          "text": "Yo what's up I'm in the same boat. Had a 2.9-ish (major) GPA in undergrad. Published papers during my master's and also got done applying to PhD programs last weekend. Good luck! :)",
          "author": "Seankala",
          "created": 1606997258,
          "upvotes": 2,
          "replies": {
            "gei7267": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gei7267/",
              "text": "We're gonna make it",
              "author": "Onion-Fart",
              "created": 1607016771,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gedw1ys": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedw1ys/",
          "text": "Sorry, are you still an undergrad or now a grad? If grad, how's it going?",
          "author": "imhereforthevotes",
          "created": 1606927295,
          "upvotes": 1,
          "replies": {
            "geefpcf": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geefpcf/",
              "text": "Doing my masters and am applying for PhDs rn. It's going very well despite corona throwing everything around. \n\nWhen I started undergrad I thought I'd be a medical doctor and from there ended up changing my major many times before figuring out what I was good at.. Along with the mental ups and downs of your early 20s, relationships, etc its hard to be a good student. \n\nGradschool is different because by the time you get to it you have a pretty good idea of what you want to do along with your strengths and weaknesses and how to compensate for them.",
              "author": "Onion-Fart",
              "created": 1606935033,
              "upvotes": 3,
              "replies": {}
            },
            "gee6t6k": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee6t6k/",
              "text": "They’re in their last semester of undergrad.",
              "author": "JoeyLing",
              "created": 1606931614,
              "upvotes": -1,
              "replies": {
                "geeemcd": {
                  "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeemcd/",
                  "text": "That's one way to read it, yes, and is how I understood it initially.  \nAnd /u/Onion-Fart demonstrates that it's wrong.",
                  "author": "imhereforthevotes",
                  "created": 1606934618,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "geelui1": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geelui1/",
      "text": "On average, people with higher GPAs make better Ph.D. students, TAs, and RAs. I don't think that's really all that controversial of a statement.\n\nI think this gets conflated with \"people with higher GPAs will strictly dominate people with lower GPAs\", which is clearly _not_ true. \n\nWhat this does mean is that if I'm choosing between two otherwise identically qualified students and one has a 3.2 and the other has a 3.7, the student with the 3.7 is probably going to be the better choice. Will they actually be? Who knows! This is a decision being made under uncertainty and there's never going to be a definite answer.",
      "author": "Tagost",
      "created": 1606937803,
      "upvotes": 9,
      "replies": {}
    },
    "gedu30m": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedu30m/",
      "text": "A lot of the background association will probs break down due to collider bias + range restriction when you condition on the admissions filter, as with other metrics. Height is [decoupled](https://i.imgur.com/ESaSKpu.png) from performance in the NBA, but that doesn’t necessarily mean that being taller doesn’t confer an advantage in basketball.",
      "author": "--MCMC--",
      "created": 1606926509,
      "upvotes": 6,
      "replies": {}
    },
    "gee83qp": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee83qp/",
      "text": "Graduate school grades are a joke. Grade inflation is out of control and As are handed out meaninglessly like confetti. One of the reasons I hate teaching grad courses is that I don't feel like I'm \"allowed\" to be critical of student work. Especially in master's programs where it's just pay to play.\n\nSo generally I don't think they matter, but they could, and they should.\n\nEdit: I think I misunderstood your question as I'm reading other responses. To add, I don't think that undergraduate grades always mean much in terms of future success in academic life",
      "author": "yourmomdotbiz",
      "created": 1606932105,
      "upvotes": 7,
      "replies": {}
    },
    "gee0i4v": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee0i4v/",
      "text": "Yes I think they matter, but more for theorists than experimentalists.  Correlation isn't 1, standard caveats apply.",
      "author": "dampew",
      "created": 1606929061,
      "upvotes": 3,
      "replies": {}
    },
    "geegqq6": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geegqq6/",
      "text": "As long as one can regurgitate from the table, \nThere are many PIs who loves to give free authorship, free publications as long as one know how to kiss their ass.",
      "author": "yourseck",
      "created": 1606935456,
      "upvotes": 3,
      "replies": {}
    },
    "gefhg9y": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefhg9y/",
      "text": "I don't think I'm anywhere near qualified to comment considering I'm not even a PhD (I'm a MSCS student who just applied to PhD programs this round), but I wanted to chime in.\n\nI'm originally from the humanities. Decided to do a CS double major and well my GPA absolutely tanked (I think my CS-only GPA is somewhere around 2.9/4.0).\n\nI managed to find a mentor who's been good to me and gave me a chance. I now have a 3.9/4.0 MS GPA and have coauthored two publications in just a year. So yeah, I'm also for the \"UGPA doesn't matter\" camp, but I guess I can also see why there may be some merit into taking them into account.\n\nI don't agree with cutoffs though, and also don't agree with putting a significantly higher weight on GPA (I don't have proof but I have heard some schools prioritize GPA quite a bit). Then again like I said, I'm nowhere near qualified to say that haha.",
      "author": "Seankala",
      "created": 1606952007,
      "upvotes": 3,
      "replies": {}
    },
    "geg51c3": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg51c3/",
      "text": "2.7/4 GPA PhD reporting. Not due to laziness or intelligence, but due to way too much partying. \nCurrently a postdoc in one of the top Quantum Computing Institute in North America. Supervisor is number 1 name in the country in his field of research.\nAttitude and a strong character in general gets you ahead in this game.\nIf you think about getting into academia, you have to ask yourself; are you the kind of person that never ever gives up once commited to a task? And work for endless hours towards a deadline?\nIf you cannot say YES, with a high level of confidence and honesty, pick another career.",
      "author": "stdoggy",
      "created": 1606964112,
      "upvotes": 3,
      "replies": {}
    },
    "gefn0td": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gefn0td/",
      "text": "Grades don't matter. If you are doing a technical course like computer science, computer engineering or anything to do with programming, only your skillset will take you places. Say working for companies like Google, Microsoft and other tech Giants in Silicon Valley.",
      "author": "EssayPundit",
      "created": 1606954705,
      "upvotes": 2,
      "replies": {}
    },
    "geg9zzh": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg9zzh/",
      "text": "As or Bs and one or two Cs is fine. Multiple/mostly Cs or some Ds is a red flag.",
      "author": "Extreme-System-23",
      "created": 1606966939,
      "upvotes": 2,
      "replies": {}
    },
    "gedso6q": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedso6q/",
      "text": "[deleted]",
      "author": null,
      "created": 1606925939,
      "upvotes": 2,
      "replies": {
        "geecv8m": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geecv8m/",
          "text": "What was that transition like?",
          "author": "EmpathyIsAHabit",
          "created": 1606933939,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gedwq7k": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedwq7k/",
      "text": "I think some people have strong feelings about this, and I just don't have the energy for a debate (I have occasionally engaged in long discussions on this topic on reddit). But if you want my opinion, grades are useless educationally speaking. Perhaps, an argument can be made that they are necessary given the educational reality we face. But they are not (imo) worth it for their own sake.",
      "author": "l_lecrup",
      "created": 1606927570,
      "upvotes": 2,
      "replies": {}
    },
    "geeu1d0": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geeu1d0/",
      "text": "My first semester in college I had a 2.05, had a 2.3 end of sophomore year, graduated with a 2.994 overall and 3.4 in department classes\n\nI also did undergraduate research with the person I’d work for until I earned my PhD.\n\nI also published a lot. And while in industry I have been very successful as well in research.\n\nI am also more successful than people that are so smart that next to them I might as well be a carrot because I can convey why what I’m doing matters.\n\nI’ve also been described as a unicorn by people and my former PI even told me he had to stop trying to find another me",
      "author": "k0np",
      "created": 1606941214,
      "upvotes": 2,
      "replies": {}
    },
    "geekmrl": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geekmrl/",
      "text": "This question needs to be addressed fr the perspective of those in acceptance committees. Grades may not matter for hiring purposes or express much in terms of creativity, but they seem to have a very high value in program admissions.",
      "author": "8giln",
      "created": 1606937242,
      "upvotes": 1,
      "replies": {}
    },
    "geezrc1": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geezrc1/",
      "text": "In the Netherlands I noticed \"cum laude\" is an extremely useful thing to have while PhD jobhunting",
      "author": "Ltrfsn",
      "created": 1606943796,
      "upvotes": 1,
      "replies": {}
    },
    "geh72gh": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geh72gh/",
      "text": "Yes",
      "author": "tonymaric",
      "created": 1606995399,
      "upvotes": 1,
      "replies": {}
    },
    "gedpxkc": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gedpxkc/",
      "text": "Anything a B+ or above does not matter, IMO.",
      "author": "tpm319",
      "created": 1606924781,
      "upvotes": 1,
      "replies": {}
    },
    "gee53l6": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gee53l6/",
      "text": "Knowing how messed up, manipulated, and biased grading is at all levels of tertiary education, grades mean nothing. More important to me is the career progression and meeting the person and finding out what kind of human they are.",
      "author": "reversechinlock",
      "created": 1606930913,
      "upvotes": 1,
      "replies": {}
    },
    "geecsgy": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geecsgy/",
      "text": "Grades do not accurately reflect student ability. They lead to favoritism, and other internal issues. Personally, my grades were horrible in high school, I didn’t think I would go to college. Now I have four degrees. If the SAT or highschool grades are goo predictors— well... that must be a lie!",
      "author": "st0pt1me",
      "created": 1606933909,
      "upvotes": 1,
      "replies": {}
    },
    "geevrkr": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geevrkr/",
      "text": "Current PhD student here-I was told by my superior that if you’re getting higher than a B+/A- average you’re not spending enough time in lab. This is a gross simplification of course but the idea they were getting at is that we should use courses as a means of learning about new tools and getting *enough* fundamental knowledge to pursue projects independently.",
      "author": "damiandiflorio",
      "created": 1606942009,
      "upvotes": 0,
      "replies": {}
    },
    "gef8qmu": {
      "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/gef8qmu/",
      "text": "Grades never mattered to me, not with our archaic \"modern education\" that still hasn't even realized how to cure most disease and cancer, extend human life to 150+, incorrect anthropology, physics, etcetera...\n\nThis ghetto planet teaching how slaves built the pyramids...get real. I kept a 3.2-.3.6gpa and gave the answers my ignorant teachers wanted so I could pass. Sleep in school, go home and study without all the garbage propaganda.",
      "author": "EnrichYourJourney",
      "created": 1606947890,
      "upvotes": -2,
      "replies": {
        "geg2dvb": {
          "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg2dvb/",
          "text": ">Grades never mattered to me ... I kept a 3.2-.3.6gpa\n\nIt's easy not to care about grades when you are getting decent grades.",
          "author": "foradil",
          "created": 1606962623,
          "upvotes": 2,
          "replies": {
            "geg6f51": {
              "link": "/r/AskAcademia/comments/k5b5jj/now_that_youre_in_academia_do_you_really_think/geg6f51/",
              "text": "Sure it may be easy for me but \"modern\" academics are trash. Having value on them with our current barbaric society is not healthy and a direct indication of severe enculturation.",
              "author": "EnrichYourJourney",
              "created": 1606964877,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}