{
  "sid": "p3qmox",
  "link": "/r/AskAcademia/comments/p3qmox/trying_to_decide_when_to_graduate/",
  "title:": "Trying to Decide When To Graduate",
  "text": "Hello! \n\nI'm a Ph.D candidate in English literature currently. I started writing my dissertation this time last year (Fall 2020). I am on track to graduate in May 2022, and I'm planning to apply for some jobs this year. Having said that, I recently had a faculty advisor tell me that I would be a more compelling candidate if I had more articles published before I go on the market. He suggested that I slow down on the dissertation and graduate in December 2022 or May 2023 to give myself more time to publish additional articles. Currently, I have one article published in a respectable peer-reviewed journal in my field and a forthcoming article in another journal with a similar reputation. So my question is: how many publications should I try to have before I go on the market? My university is one with a heavy teaching requirement so I have a lot of teaching experience. Will that potentially bolster my job application even though I've only had two articles accepted for publication? \n\nThank you in advance for any responses!",
  "author": "CassandraLover14",
  "created": 1628877889,
  "updated": 1634079681,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "h8t9crg": {
      "link": "/r/AskAcademia/comments/p3qmox/trying_to_decide_when_to_graduate/h8t9crg/",
      "text": "So I just served on a search committee for a TT job in an English department at my regional uni. I think 2 respectable, relevant articles would be enough to get you on the short list. I know the people we interviewed had that. Perhaps one or two of them only had a single article out, but two I think is the minimum. Others may disagree - my uni isn't very competitive (but I like it). A wide range of teaching would also definitely help you if you were applying here. \n\nGood luck!",
      "author": "UfoTofu130",
      "created": 1628878735,
      "upvotes": 9,
      "replies": {
        "h8tarv4": {
          "link": "/r/AskAcademia/comments/p3qmox/trying_to_decide_when_to_graduate/h8tarv4/",
          "text": "Thank you for this response! It is very reassuring!",
          "author": "CassandraLover14",
          "created": 1628879314,
          "upvotes": 3,
          "replies": {
            "h8xcwo3": {
              "link": "/r/AskAcademia/comments/p3qmox/trying_to_decide_when_to_graduate/h8xcwo3/",
              "text": "No problem! Feel free to message me if you'd like another set of eyes on your letter or CV or whatnot.",
              "author": "UfoTofu130",
              "created": 1628958475,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h8urrip": {
      "link": "/r/AskAcademia/comments/p3qmox/trying_to_decide_when_to_graduate/h8urrip/",
      "text": "I think it depends on what level of academe you want to go to.\n\nIf you want to go to a teaching institution, graduate on your schedule with your teaching experience. If you want to go to an R1 or R2, I think your advisor has a point and an additional article or 2 would be useful.\n\nWay back when, I started teaching at a CC as I was finishing my degree from a top R1. I had my final meeting and approval before fall classes started but I didn't hand in my dissertation to the Registrar's office until January so that I'd officially be a year later. I did that in case I hated teaching at a CC and so decided to apply to R1's and R2's. In that case my CC would be on my CV as teaching experience as I was finishing up my degree. Turns out I loved the teaching more than research and spent a career at the same place.",
      "author": "rockyfaceprof",
      "created": 1628901791,
      "upvotes": 4,
      "replies": {}
    },
    "h8tjsnj": {
      "link": "/r/AskAcademia/comments/p3qmox/trying_to_decide_when_to_graduate/h8tjsnj/",
      "text": "To start on tenure track, you need to show that you CAN teach and that you CAN publish. It sounds like you’ve shown that. At this point, I’d be just as happy to see additional articles in submission or revision. It’s shows that you still have your foot on the gas.",
      "author": "TimeAverage",
      "created": 1628882960,
      "upvotes": 4,
      "replies": {}
    },
    "h8u4nde": {
      "link": "/r/AskAcademia/comments/p3qmox/trying_to_decide_when_to_graduate/h8u4nde/",
      "text": "There is nothing you can really do to stand out against the hundreds of other people with similar qualifications who will be competing for every other job in your field. Having said that, articles aren’t a bad idea",
      "author": "BelaTarrd",
      "created": 1628891154,
      "upvotes": 3,
      "replies": {}
    }
  }
}