{
  "sid": "q9i3c6",
  "link": "/r/AskAcademia/comments/q9i3c6/best_pdf_annotatororganizer_for_pdfs/",
  "title:": "Best PDF annotator/organizer for PDFs?",
  "text": "I’m going crazy trying to keep all my readings organized. I’ve been using GoodNotes throughout undergrad, but I’m starting grad school soon and I need something better. I need an app that can handle large PDF files and allows for highlighting and note taking. \n\nMy biggest issue with GoodNotes is that I can’t tag PDFs. It makes it really difficult to find documents that cover multiple topics. I need something with a tag system, so if I tag a document both “A” and “B”, it will show up in both places. A folder system is okay as long as there are also tags. I have ADHD and like 0 object permanence, so I will often forgot about readings that aren’t right in front of me. This is my #1 problem, so an app that does this, but is missing some other things, would still be great!\n\nI feel like Mendeley or Zotero would be good, but it’s annoying that I can’t access them on my iPad. I just got a free trial of LiquidText, but it seems like it wont let me add tags to the PDFs themselves, only excerpts from the text.\n\nThe app doesn’t have to have note taking as long as I can annotate and highlight the readings. I would prefer an app that is also on PC (or at least cloud saves on Google Drive/Dropbox) so I’m able to pull up my marked up readings on my PC as well. I’m a political science student, so an app that caters to the social sciences, as opposed to STEM, might be more useful. I’m okay paying for it. \n\nThank you for your help, and if there’s a better subreddit for this kind of thing please let me know! Sorry if this is the wrong place!",
  "author": "MisterTubbers",
  "created": 1634410283,
  "updated": 1634423649,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgw6dxb": {
      "link": "/r/AskAcademia/comments/q9i3c6/best_pdf_annotatororganizer_for_pdfs/hgw6dxb/",
      "text": "Papers app by ReadCube",
      "author": "mountainsandphysics",
      "created": 1634411753,
      "upvotes": 3,
      "replies": {
        "hgwim8m": {
          "link": "/r/AskAcademia/comments/q9i3c6/best_pdf_annotatororganizer_for_pdfs/hgwim8m/",
          "text": "I second this, and the subscription isn't bad with the student discount. As much as I like Zotero personally, mobile support has always been janky. You can get it to work between zotfile and the various platform-specific app betas, but it's a pain. Papers is well-supported and basically works out-of-box, and it checks all of OPs boxes for functionality.",
          "author": "xenotranshumanist",
          "created": 1634417026,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}