{
  "sid": "gpyl3c",
  "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/",
  "title:": "I have finally sent that long email",
  "text": "I gave myself till the end of this week to gear up one last time in submitting my work after been unproductive for a month, but sadly I failed. After long, careful consideration, I have decided to send out that long email detailing my mental issues in juggling pandemic, loneliness and PhD to my supervisors. It was nerve-wracking and humiliating as I was always the strong one, but it feels like a heavy rock has been lifted off my chest at the same time. I’m not sure how are they going to process this, but I’m gonna keep an open mind about the options or whether or not I have one. I’ve taken the first step of the many steps that I’ll be taking after this, so I will breathe for now before facing the next one.",
  "author": "ConstantAide",
  "created": 1590358451,
  "updated": 1634080155,
  "over_18": false,
  "upvotes": 324,
  "upvote_ratio": 0.98,
  "comments": {
    "frpmsve": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frpmsve/",
      "text": "Good for you on putting your mental health first. Imo, no point in getting a PhD if you've lost yourself getting there. Good luck person. Hope you have a beautiful day/night.",
      "author": "zbethel710",
      "created": 1590359271,
      "upvotes": 100,
      "replies": {}
    },
    "frpmqe5": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frpmqe5/",
      "text": "Congrats on taking that first step! I really hope your supervisors can be understanding of your struggles during such a difficult time. Sending strength and good vibes your way.",
      "author": "starfirerebel",
      "created": 1590359232,
      "upvotes": 44,
      "replies": {
        "frprp6a": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frprp6a/",
          "text": "I hope so too. Fingers crossed. \n\nThank you for your kind words.\n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1590362106,
          "upvotes": 21,
          "replies": {
            "frpsn6f": {
              "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frpsn6f/",
              "text": "Anytime. 💕",
              "author": "starfirerebel",
              "created": 1590362657,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "frpqih1": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frpqih1/",
      "text": "Our Dept is having a whole faculty meeting devoted to our internal grad student mental health survey. The health and well-being of grad students is paramount. You should get the support you need from your Dept.",
      "author": "mmilthomasn",
      "created": 1590361419,
      "upvotes": 29,
      "replies": {
        "frprhpp": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frprhpp/",
          "text": "I have spoken to my supervisors in brief few times before but this time I have decided to be completely honest with them. While waiting for their response, I will focus on feeling better now. \n\nThank you for your kind words. \n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1590361987,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "frprmay": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frprmay/",
      "text": "I still want this but I’m not sure how much now hence why I need to take some break to get clarity of my mind. I will focus on feeling better now. \n\nThank you for your kinda words. \n\nStay safe. 💕",
      "author": "ConstantAide",
      "created": 1590362059,
      "upvotes": 16,
      "replies": {}
    },
    "frpts7h": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frpts7h/",
      "text": "Are you living alone during all this?",
      "author": null,
      "created": 1590363336,
      "upvotes": 9,
      "replies": {
        "frpv6ne": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frpv6ne/",
          "text": "Yes. I’ve been in quarantine alone all this time.",
          "author": "ConstantAide",
          "created": 1590364174,
          "upvotes": 8,
          "replies": {
            "frq0dtz": {
              "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frq0dtz/",
              "text": "Wow. That’s rough, I know I’d be struggling too. Hope you feel better, I’m glad you’re focusing on yourself some more.",
              "author": null,
              "created": 1590367339,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "frqc4fk": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frqc4fk/",
      "text": "Good for you!! As someone who has struggled with mental health throughout my masters and PhD program it is insanely hard to send that first explanatory email. I hope your mentor is as accepting as mine is and helps you find a path that works for you!",
      "author": "aledaml",
      "created": 1590374743,
      "upvotes": 6,
      "replies": {}
    },
    "frqxani": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frqxani/",
      "text": "Good on you! \n\nI’m working on my MA thesis rn, I have ADHD, and trying to get anything done at home is really hard, so when the university closed it took aaaages for me to get up to just a level of productivity that doesn’t feel like a complete standstill. +distractions and -routine is pretty much a recipe for disaster in my case. I avoided talking to my supervisor for *weeks*, because I didn’t wanna admit that I was gonna need an extension.",
      "author": "aerdnadw",
      "created": 1590390750,
      "upvotes": 5,
      "replies": {
        "frr0te5": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frr0te5/",
          "text": "Having ADHD must be really tough for you especially when you’re working in an environment with a lot of distractions. Relating to your story, I’m glad that I’m not alone in this. I have avoided my supervisors for weeks too, but I couldn’t go on doing that. I woke up feeling anxious every day and going to bed feeling the same. I started questioning my passion and career path - I become more and more disinterested in doing this. I couldn’t go on living like that so I decided to just write that email and send it last night. I need some time off to clear my head and figure out what’s best for me. It’s scary though, as my program is funded and it might be cancelled if I decided to take a leave or extend, but I don’t want to feel stuck anymore. Things may be tougher after this, but for now I’m gonna take it easy. After sending that email, for the first time in weeks, I managed to go to bed and wake up early. It makes me realised that sometimes we just need to admit our weakness to feel better. I hope this will be the start to more good things. \n\nThank you for your kind words.\n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1590394069,
          "upvotes": 3,
          "replies": {
            "frr1f8l": {
              "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frr1f8l/",
              "text": "Yeah, definitely! Glad you managed to put put your health first and communicate your needs. I felt loads better when I finally talked to my supervisor, and he was actually really chill about it. I got a month and half’s extension, but we’ve also discussed that I might need a whole extra semester, and that that’s totally fine. It really helped take the pressure of, and even though it’s a slow grind, and I’m still not being super productive, which is frustrating, I actually feel more motivated now that I’m not anxious all the time. Obviously it’s more complicated in your case because of funding (I’m in a program with like 60 students, so all I have to worry about is not qualifying for a student loan if I’m too far behind, but I think I have just enough credits that I can take an extra semester if need be), but it’s still really important to put your own well-being first. Hope it all works out for you!",
              "author": "aerdnadw",
              "created": 1590394662,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "frq3jni": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frq3jni/",
      "text": "Good luck. It sounds like you did something really hard, and I hope you get a positive response. <3",
      "author": "LucyQZ",
      "created": 1590369300,
      "upvotes": 4,
      "replies": {}
    },
    "frq0fua": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frq0fua/",
      "text": "I hope you have a good response. I just had to admit that I was overwhelmed trying to balance everything since it was starting to affect my writing quality and grades. Thankfully I was allowed to remain in my PhD program.",
      "author": "GrumpyMare",
      "created": 1590367373,
      "upvotes": 3,
      "replies": {}
    },
    "frqc5zd": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frqc5zd/",
      "text": "As a fellow grad student struggling with sending the same kind of e-mail, I send you my virtual hugs and praise for the strength! I hope everything turns out fine for you and you start feeling better soon :)",
      "author": "PreviousInstruction4",
      "created": 1590374770,
      "upvotes": 3,
      "replies": {}
    },
    "frrayod": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frrayod/",
      "text": "I did exactly this a couple of weeks ago. I was very nervous about his response, but actually my supervisor was very understanding and we agreed to let me work at my own pace. He apologized and said he didn't realize because I always seemed so upbeat, but really that was just me trying to look strong. Since then, things are much better! I hope your supervisor is understanding too. They are humans too, having issues of their own I'm sure, and in these crazy times it *should* be the norm to be lenient. Congratulations on sending the email, that takes a lot of courage! Fingers crossed that things get better for you, both for your work situation and mental health. Take care and be good to yourself :)",
      "author": "0hMyGardevoir",
      "created": 1590404463,
      "upvotes": 3,
      "replies": {
        "frt0or9": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frt0or9/",
          "text": "That is a great response from your mentor. He respected your honesty and acknowledged your aptitude for knowing what's best for your mental health and long-term productivity.\n\nI hope everything works out well for OP. Not to be a downer, but worse case scenario...\n\nI did the same thing with my PI last week. Explained that I was stressed out by him asking for manuscript updates every few days with all the edits corrected from him days before, in addition to edits he makes during our weekly Zoom meeting. I told him if we set a deadline (end of the month) that I would have a great, non-typo'd version for him to completely edit. I won't go into details, but we argued via email all week (which stressed me out even more). We eventually agreed that I could have until the end of the May to finish (6 days away), but I wasted a whole week arguing with him about it and being so upset about the situation that I lost more time on it than if he had just said \"Ok.\"\n\nHopefully every else has mentors who are supportive in these awful times of uncertainty and best wishes for everyone to be safe and healthy.",
          "author": "OutrageousReasons",
          "created": 1590441039,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "frrkdp9": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frrkdp9/",
      "text": "if there a way to your pi can give you a break?",
      "author": "aperez1561",
      "created": 1590412487,
      "upvotes": 2,
      "replies": {
        "frroxqy": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frroxqy/",
          "text": "I’m not sure, but I was told that I could extend my review if I need it.",
          "author": "ConstantAide",
          "created": 1590415559,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "frry3dl": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frry3dl/",
      "text": "Good for you! \n\nI did that in April - the pandemic hitting shortly after losing my Dad (November) was just too much of me pretending that everything was okay. \n\nOddly  enough, after I sent that email, I've never been more productive. But I also know that my supervisors know if/when I am not, that I need help from them. \n\nWishing you well. Reach out if you need!",
      "author": "pennylaine713",
      "created": 1590420894,
      "upvotes": 2,
      "replies": {}
    },
    "frscyw4": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frscyw4/",
      "text": "does anyone wanna have a big zoom call with OP?",
      "author": "sdbabygirl97",
      "created": 1590428601,
      "upvotes": 2,
      "replies": {}
    },
    "frut0lc": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frut0lc/",
      "text": "So so proud of you<3 I have just gone through a similar situation -- I actually just clicked that send button for an email to my Prof after seeing your post so THANK YOU!! It took me a week of very stressful time to finally make the decision that I cannot handle all those hard tasks as much as I wished to. I am currently quarantined on my own as well and it has been absolutely brutal. I worried a lot about my future and even questioned my career path. But I finally decided to prioritize my health and wellbeing. Let's hope for the best for now.",
      "author": "JJLLXX",
      "created": 1590485587,
      "upvotes": 2,
      "replies": {
        "fruuvq0": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/fruuvq0/",
          "text": "You don’t know how much your message means to me. It makes me feel relieved knowing that there are a lot of other people out there who are suffering like me. I’m glad you have decided to prioritise your mental health. I’m flying home tomorrow as I can no longer handle it. I’d really be crazy if I stay longer. I’ve been questioning my career path too and it becomes even more complicated when my program is funded, but I’ll deal with it one by one. Things are not gonna be easy after this but at least I could cuddle my cats if things become too much. I hope you’re gonna be in the comfort of your own home surrounded by your loved ones soon. I’m praying for the best for both of us and the rest who are going through the same thing. \n\nStay safe. 💕",
          "author": "ConstantAide",
          "created": 1590487495,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "frvlaec": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frvlaec/",
      "text": "[deleted]",
      "author": null,
      "created": 1590505904,
      "upvotes": 2,
      "replies": {
        "frw18fx": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frw18fx/",
          "text": "Awww! I can imagine. I don’t think I can bring myself to do that, that’s why I gave them a heads up in the email. I don’t think I can avoid talking to them about this in the video meeting, but if I ever did, I think I’d ugly cry too. I hope you’re feeling better now!",
          "author": "ConstantAide",
          "created": 1590513697,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "frqs8eb": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frqs8eb/",
      "text": "proud of you! i am glad you were honest with them. that takes a lot of courage and vulnerability",
      "author": "PeptoBisma",
      "created": 1590386372,
      "upvotes": 1,
      "replies": {}
    },
    "frrdnm1": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frrdnm1/",
      "text": "This must be a huge weight off your shoulders, I hope it works out ok for you. Please update us on how it goes.",
      "author": "AnUnladenSwallow_",
      "created": 1590407068,
      "upvotes": 1,
      "replies": {}
    },
    "frrr2ix": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frrr2ix/",
      "text": "> It was nerve-wracking and humiliating as I was always the strong one, but it feels like a heavy rock has been lifted off my chest at the same time.\n\nThat's a big step regarding personal growth. We are all human and life can hit any of us hard. When I had severe health issues, I would meet a lot of people who clearly thought that this would never happen to them. It's almost as if being sick was my own fault. I could only shake my head and hope for their sake that they'd never have to experience what I went through. Good luck with your health and mental health.",
      "author": "Instantcoffees",
      "created": 1590416901,
      "upvotes": 1,
      "replies": {
        "frrtkd7": {
          "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/frrtkd7/",
          "text": "Those people sound shitty! Being sick in grad school is extremely draining, physically and mentally. Having unsympathetic bastards around to make you feel like your sickness was your own fault sounds horrible! I am impressed you sound like you got through it all despite all this though. You are strong!",
          "author": "lumpythegiraffe",
          "created": 1590418389,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fs0qjnj": {
      "link": "/r/AskAcademia/comments/gpyl3c/i_have_finally_sent_that_long_email/fs0qjnj/",
      "text": "Man, I feel what you're saying. I'm at the end of the second month of my (six month) Masters thesis, also struggling with some mental health and discipline issues (ADD). I sent my supervisors a message yesterday explaining why I haven't been living up to the deadlines we set - they were understanding about it so far. I have a meeting with them tomorrow, we'll see how it goes. Best of luck to you on that difficult task, hopefully I can address most of my issues by the time I get to where you are.",
      "author": "Cull_The_Meek",
      "created": 1590614068,
      "upvotes": 1,
      "replies": {}
    }
  }
}