{
  "sid": "p82dgv",
  "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/",
  "title:": "Do your family/ friends understand your job?",
  "text": "Hello, \n\nI had a question about how you explain what you 'do' as a researcher/ lecturer. I am an early career researcher in Ireland, and my family and friends know generally that I teach, but during the summer I have had to explain a lot about what academics do during the summer months that makes them different to teachers. There was a lot of expectation that I would be not at work for 3 months like teachers are. Just wondering if this is a common problem issue and how do you explain that this is a really important time to get work done? \n\n&#x200B;\n\nNot a huge issue I know, but just curious if this is a common experience. Thanks.",
  "author": "rachmcmc",
  "created": 1629454557,
  "updated": 1634079540,
  "over_18": false,
  "upvotes": 99,
  "upvote_ratio": 0.93,
  "comments": {
    "h9nf935": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nf935/",
      "text": "I’m a postdoc, but my family keeps calling me a student or an intern.",
      "author": "llImHereCuzImBoredll",
      "created": 1629459799,
      "upvotes": 92,
      "replies": {
        "h9nkljb": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nkljb/",
          "text": "I have a PhD in a field where postdocs are not common. I still think it’s like an internship. How is it different?",
          "author": "ThatProfessor3301",
          "created": 1629462891,
          "upvotes": 6,
          "replies": {
            "h9noyeq": {
              "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9noyeq/",
              "text": "At that point you're essentially an independent scholar. You get to direct your research program without having to do all the other stuff faculty are responsible for (teaching, desperate grant writing, committees). I guess I've never seen an internship where the intern already knows what they're doing and given pretty much free reign to do what they want. I've also not really seen interns who secure their own funding for 2-3 yrs. Ultimately not sure it matters too much what it's called, but I'm not sure internship is quite right.",
              "author": "tishtok",
              "created": 1629465083,
              "upvotes": 45,
              "replies": {
                "h9q3l34": {
                  "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9q3l34/",
                  "text": "> You get to direct your research program without having to do all the other stuff faculty are responsible for (teaching, desperate grant writing, committees). \n\nThis is **incredibly** dependent on the terms of the post doc. There are lab post docs where you work predominantly on a PI's project, there are teaching post docs where you teach, etc.\n\nI don't think a post doc is equivalent to an internship, mind you; but, I also don't think this statement applies as broadly as you might think.",
                  "author": "WrestlingStuffGuy",
                  "created": 1629501453,
                  "upvotes": 5,
                  "replies": {
                    "h9wtb5x": {
                      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9wtb5x/",
                      "text": "That's fair. Both of those are rare in my field.",
                      "author": "tishtok",
                      "created": 1629641664,
                      "upvotes": 1,
                      "replies": {
                        "h9x672l": {
                          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9x672l/",
                          "text": "They aren't super common in mine (though there is one prestigious teaching focused one), I just wanted to note that there are a lot of different *types* of post doc. Of course, **all** of them are fairly different from internships - which was your larger point. :)",
                          "author": "WrestlingStuffGuy",
                          "created": 1629647483,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h9o2ipb": {
                  "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9o2ipb/",
                  "text": "Then why is that not just a visiting professor position then? Because aren't you funded by a PI?",
                  "author": "ThatProfessor3301",
                  "created": 1629471004,
                  "upvotes": 2,
                  "replies": {
                    "h9o5jj2": {
                      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9o5jj2/",
                      "text": "You are funded and advised by a PI but you're also involved in student mentoring and other professor-level activities (but not all of them obviously). The equivalent of intern to me in academia is undergrad research assistants.",
                      "author": "antonia90",
                      "created": 1629472239,
                      "upvotes": 24,
                      "replies": {}
                    },
                    "h9oiq07": {
                      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9oiq07/",
                      "text": "Some postdoc positions are visiting professor positions, especially if they bring in their own research funding or are only partially funded by a PI.",
                      "author": "Lamalaju",
                      "created": 1629477528,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "h9p2nqn": {
                      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9p2nqn/",
                      "text": "I think these are more like emergent properties of the system than having a justification based on mentoring. There's of course many different types of work groups, but my experience is that postdocs have a largely independent research program. They of course collaborate with the PI but the relationship is much less one of mentoring than with PhD students. The reason for why postdocs have becone such a widespread position is that many fields have grown much faster than the amount of tenured positions. Thing seems to be that increasing the number of tenure positions considerably is a big commitment in terms of resources, while the number of PhD students can increase pretty steeply without putting strain in long-term funding.",
                      "author": "fuckwatergivemewine",
                      "created": 1629485635,
                      "upvotes": 4,
                      "replies": {}
                    },
                    "h9wt3nu": {
                      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9wt3nu/",
                      "text": "In my subfield they don't really exist and are not prestigious. I don't know why. Postdocs usually last 2-3 years (but can last up to 5) which I believe is way longer than most VAP positions? Most postdocs in my field secure their own funding, but many do so through postdoc specific grants. What others said is true as well: in my research area you need a really robust set up to do work and data collection can take years. A postdoc plugs you into an existing set up where you can get work done, otherwise you'd have to spend months and $$$ just setting things up. Finally, usually VAP's are hired to teach. Postdocs usually don't teach at all, at least in my field. More focus on research.",
                      "author": "tishtok",
                      "created": 1629641565,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9ne036": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ne036/",
      "text": "I have two kids, they know I'm a scientist in a lab, and roughly what my research aim is. It complicates things that I'm also in the field sometimes, they know roughly what I'm doing then too. It helps to frame the conversation because I bring them to open days, or if we meet for lunch they can pop in to see what I'm doing for a minute. \n\nI had a paper accepted today and told them that I wrote all my work down and it's going in a special science magazine that all the scientists read so they can know all about what I found out.\n\nHonestly my kids probably have a better grasp of my work than any of my other family and friends. A lot of tgen never went to university so it's very foreign to them.",
      "author": "Philieselphy",
      "created": 1629458997,
      "upvotes": 67,
      "replies": {}
    },
    "h9nb6m2": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nb6m2/",
      "text": "My relatives and friends think I teach while I am actually pursuing PhD. I say I am a scientist and I do discoveries and inventions which take a lot of my time. To which, they laugh and reply that they await my invention.",
      "author": "ioup568",
      "created": 1629457055,
      "upvotes": 46,
      "replies": {
        "h9ncet6": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ncet6/",
          "text": "That's exactly it! They are waiting for the big reveal, but all contributions to knowledge are building on so much other knowledge, it's hard to explain even your contributions without explaining the bigger ideas. Best of luck with your PhD, it's not an easy road but hopefully worth it.",
          "author": "rachmcmc",
          "created": 1629457923,
          "upvotes": 32,
          "replies": {
            "h9ol8bf": {
              "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ol8bf/",
              "text": "Yeah it's so true. But if they get to know that my research papers, when published, will not have a contribution to the world as compared to inventing a light bulb, they would reduce my worth 😂. Thank you for the wishes 😊",
              "author": "ioup568",
              "created": 1629478528,
              "upvotes": 7,
              "replies": {
                "h9rmx4l": {
                  "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9rmx4l/",
                  "text": "That's low-key gaslighting. My family does this to me as well. Everytime they post some fake news on the family chat often regarding covid, if I were to correct them. They'd say ouhh the \"scientist\" is here to tell us what is right in a sarcastic tone.",
                  "author": "kvjd1",
                  "created": 1629533649,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h9nl4x3": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nl4x3/",
          "text": ">I say I am a scientist and I do discoveries and inventions which take a lot of my time. To which, they laugh and reply that they await my invention.\r  \n\r\n\nMajority's grasp of what scientists are and what they do comes from outliers amidst outliers amidst outliers who made foundational and fundamental discoveries that ushered a new scientific dawn.\n\nExamples would be the likes of Einstein, Darwin, Newton, and their kinds. This is chiefly because they alone receive representation in the media. And even at that a grossly simplified account is presented to the lay person.\n\nSo, most likely they are expecting you to pull off a Einstein at whatever it is that you are doing. Which I will not put that past you, but it is hardly the norm for even the brightest of scientists to define an entire epoch. *Even among the Nobel Prize winning category of scientists.*\n\nAnd I bet even Einstein did not expect to pull off an Einstein until he had done so.\n\n(*Edited for English*)",
          "author": "srr408",
          "created": 1629463173,
          "upvotes": 22,
          "replies": {
            "h9ol0jk": {
              "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ol0jk/",
              "text": "Very well said. Haha 😁 it's so true. Also they actually think I am going to invent a light bulb or something like that. I tell them that be careful with me because I may discover something in any simple situation, such as failing of Apple on my head or taking shower or using bathtub.",
              "author": "ioup568",
              "created": 1629478441,
              "upvotes": 3,
              "replies": {
                "h9omaq8": {
                  "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9omaq8/",
                  "text": ">I tell them that be careful with me because I may discover something in any simple situation, such as failing of Apple on my head or taking shower or using bathtub.\n\nIn this time and era, the fall of an Apple may mean something else entirely.\n\nAnd good luck with your inventions, discoveries and innovations!",
                  "author": "srr408",
                  "created": 1629478957,
                  "upvotes": 3,
                  "replies": {
                    "hanwhqi": {
                      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/hanwhqi/",
                      "text": "Haha 😂 😂 I hope i can publish even a single thing first.",
                      "author": "ioup568",
                      "created": 1630142658,
                      "upvotes": 2,
                      "replies": {
                        "hanwwps": {
                          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/hanwwps/",
                          "text": "Good luck with your publications too!",
                          "author": "srr408",
                          "created": 1630143033,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9ny3gb": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ny3gb/",
      "text": "I study disease transmission (specifically of human social networks).  They ignored my advice early on and got COVID.  They refuse to get the vaccine, even though they know my background is molecular-related in a closely related field.  It wasn't too long ago that I was still asked, \"When are you going to get a real job?\"\n\nNo...they don't understand.",
      "author": "the_bio",
      "created": 1629469181,
      "upvotes": 35,
      "replies": {
        "h9pi32h": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9pi32h/",
          "text": "That's super frustrating",
          "author": "noface_18",
          "created": 1629491950,
          "upvotes": 6,
          "replies": {}
        },
        "h9rkifh": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9rkifh/",
          "text": "My research focuses on misinformation about health (how it spreads, why people believe it, etc..) and people used to just shrug or tell me it was a waste of time\n\nNow I don't have that problem",
          "author": "werewere-kokako",
          "created": 1629531559,
          "upvotes": 6,
          "replies": {}
        },
        "h9sglyd": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9sglyd/",
          "text": "That’s annoying",
          "author": "fish_penis",
          "created": 1629554901,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9nednk": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nednk/",
      "text": "I'm in Ireland also, 3rd year phd, and every single time I go home my Dad asks \"so what have you discovered\". It doesn't help that the Indo have a science discovery article nearly every day that he will cut out and show me! Its not really annoying, he just doesn't get how much time goes in before you get to publishing results.\nI work in a fairly niche area of gut immunology, and ONE time I had to analyse the microbiome using stool samples. Now all friends and family know me as the lad who works on poo! To the extent my own wife coined the nick name Dr. Poolittle! \nI get the expectation of having summer off, people ask what I'm planning after students finish for the summer, and I'm like nope nothing changes for me!",
      "author": "Arch_Stanton171",
      "created": 1629459240,
      "upvotes": 33,
      "replies": {
        "h9ogd2o": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ogd2o/",
          "text": "Crying laughing at Dr. Poolittle",
          "author": "thatgirldan3",
          "created": 1629476588,
          "upvotes": 12,
          "replies": {}
        },
        "h9o0zf0": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9o0zf0/",
          "text": "The nickname is hilarious! But yes I think we would love the 'ah ha!' moments that people expect.",
          "author": "rachmcmc",
          "created": 1629470378,
          "upvotes": 6,
          "replies": {}
        },
        "h9ov2ai": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ov2ai/",
          "text": "Fair play to your wife. Glad, at least, they're seeking to understand on some level and engaging.",
          "author": "needaburneracct",
          "created": 1629482490,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "h9on5hd": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9on5hd/",
      "text": "I don’t even understand my job",
      "author": "dammit_sammy",
      "created": 1629479297,
      "upvotes": 23,
      "replies": {}
    },
    "h9nilm8": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nilm8/",
      "text": "It depends with whom of course, I'm an MD and now i am doing a PhD in neuroscience. For my friends, im a scientist who studies the brain (everything brain related), for my aunts/uncles  i am a MD focused on research, so anything related to the human body as a whole, and my grandma thinks that since im an MD and work with rats, i became a veterinarian",
      "author": "fmessore",
      "created": 1629461793,
      "upvotes": 19,
      "replies": {
        "h9q3pil": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9q3pil/",
          "text": "> my grandma thinks that since im an MD and work with rats, i became a veterinarian\n\nListen to your grandma, clearly.",
          "author": "WrestlingStuffGuy",
          "created": 1629501511,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "h9nep9g": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nep9g/",
      "text": "Some more than others. I also don't really understand what a lot of them do, either, so I'm not too worried about it.",
      "author": "pipkin42",
      "created": 1629459448,
      "upvotes": 19,
      "replies": {}
    },
    "h9okzq2": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9okzq2/",
      "text": "I don’t understand my job.",
      "author": "GingerTartanCow",
      "created": 1629478432,
      "upvotes": 16,
      "replies": {}
    },
    "h9oxvi9": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9oxvi9/",
      "text": "I started as a biological research technician in microbiology, somehow my grandmother didn't hear/ignored the last part and told all my extended family I do stuff like birdwatching and such. The problem is that everyone believed that and somehow I am now the bird expert of the family. I don't know anything about birds and could name maybe a handful safely but who doesn't?\n\nNow I am in public health and when I explained what it was I mentioned that fields stretch across medicine, psychology and sociology. Now she told everyone I study medicine and psychology and everyone things I must be super smart and is really impressed until I corrected that. At least it's an improvement and I am not the bird scientist anymore.",
      "author": "whitelieslatenightsx",
      "created": 1629483646,
      "upvotes": 13,
      "replies": {}
    },
    "h9nikk1": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nikk1/",
      "text": "no",
      "author": "mr_kazemiro",
      "created": 1629461777,
      "upvotes": 10,
      "replies": {}
    },
    "h9nohry": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nohry/",
      "text": "No, I don't bother explain what I'm doing because that's too much work.",
      "author": "ndgnuh",
      "created": 1629464859,
      "upvotes": 9,
      "replies": {}
    },
    "h9odilr": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9odilr/",
      "text": "I just tell my parents I do computers.",
      "author": "KingofSheepX",
      "created": 1629475449,
      "upvotes": 9,
      "replies": {}
    },
    "h9oihbp": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9oihbp/",
      "text": "My sister is a schoolteacher and this last summer is the first she’s had off in her 20 year career. She usually teaches summer school, does professional development courses, or picks up side gigs. \n\nSo my family definitely understands that I work year round but my job changes from school-year to summer just like a teacher.",
      "author": "Lamalaju",
      "created": 1629477430,
      "upvotes": 8,
      "replies": {}
    },
    "h9ojcr8": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ojcr8/",
      "text": "I'm an American so nobody expects me to have vacation time...\n\nFor my family I usually write an email explaining what I do when I start a new job and it gets forwarded to cousins/siblings/whoever.  They appreciate it.\n\nMy friends usually don't care too much, they just know I do something sciency.  People I've met more recently will be more likely to ask me what I do for a living.",
      "author": "dampew",
      "created": 1629477779,
      "upvotes": 7,
      "replies": {}
    },
    "h9nhtb8": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nhtb8/",
      "text": "Ive explained my job and qualifications multiple times to my family. They still talk to me like i know all the things. \n\nMe who specilises in biologic drugs\n\nFamily: \"Being a scientist you must know everything about the way the weather works. \n\nIve also stopped telling in public (barbers, taxi drivers, shop workers) that I'm a scientist. Especially with covid the amount of plan-demics that have gone down the rabbit hole and interrogated me just to ignore my rationality cause having access to the internet makes them the better scientist apparently. I just say I work with people helping them get better.",
      "author": "DanDangerx",
      "created": 1629461338,
      "upvotes": 18,
      "replies": {}
    },
    "h9nmldv": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nmldv/",
      "text": "Yes, but most of my family are teachers so it's not a huge leap",
      "author": "IntLawprof",
      "created": 1629463913,
      "upvotes": 7,
      "replies": {}
    },
    "h9phno2": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9phno2/",
      "text": "I've had people ask why I couldn't take 3 months off my program...as a grad student. I then had to explain I get a good amount of research done during the summer months, which he also didn't understand.",
      "author": "noface_18",
      "created": 1629491768,
      "upvotes": 7,
      "replies": {}
    },
    "h9oylim": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9oylim/",
      "text": "hell no. they still think i take the summers off.",
      "author": "jstor_and_chill",
      "created": 1629483946,
      "upvotes": 5,
      "replies": {}
    },
    "h9p5a1y": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9p5a1y/",
      "text": "Not directly related to academia, but one of my professors previously was the head of fixed income strategy or something like that at Goldman Sachs. He just told people that he was a stock broker so he wouldn’t have to try and explain what he actually did over and over.\n\nMy point is that things might not get any easier after school.",
      "author": "NikonuserNW",
      "created": 1629486735,
      "upvotes": 6,
      "replies": {}
    },
    "h9nbfej": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nbfej/",
      "text": "That is why I keep a small collaboration with a CBD company, it makes me the coolest dude during family reunion.",
      "author": "COFenirr",
      "created": 1629457232,
      "upvotes": 17,
      "replies": {
        "h9ncgd3": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ncgd3/",
          "text": "That's brilliant, distract the conversation is a good tactic.",
          "author": "rachmcmc",
          "created": 1629457953,
          "upvotes": 7,
          "replies": {
            "h9ppiim": {
              "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ppiim/",
              "text": "Haha, thanks!\n\nI am not sure how it works in Ireland, but in US, most my relatives ask this question to start what we called \"small talks\". Just be nice and try to make them happy (and never short of beer), no need to take it seriously.",
              "author": "COFenirr",
              "created": 1629495094,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h9os3nq": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9os3nq/",
      "text": "My mom finally gets it! She understands that I teach, ideally would teach less than I do, write books and papers and stuff, move all the time, and have a job that is moderately high prestige but crap pay. \n\nOther people (friends and family) kind of get it when I emphasize the research and service parts - they know that I have meetings like a 'real' job and spend time in the summers etc. doing research. I try to avoid giving lots of details about my research, as I'm in the humanities. I bring up stuff about history of ideas and the relevance of past ideas for understanding current ideas.",
      "author": "wipekitty",
      "created": 1629481286,
      "upvotes": 5,
      "replies": {}
    },
    "h9pb76a": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9pb76a/",
      "text": "They don't, and I don't understand theirs either.",
      "author": "TTbulaski",
      "created": 1629489045,
      "upvotes": 4,
      "replies": {}
    },
    "h9pc0jd": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9pc0jd/",
      "text": "I don't think so. I don't understand their jobs either. It's not my job.",
      "author": "baenpb",
      "created": 1629489391,
      "upvotes": 5,
      "replies": {}
    },
    "h9qik5n": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9qik5n/",
      "text": "My uncle badmouthed me to my mother and grandmother the other day, calling me lazy because I get home from my two part-time jobs (adjunct professor and research assistant) and \"sit at my computer all day.\"   \n\n\nYou know, replying to student emails, preparing lecture slides, and interpreting data and writing research reports. He, a truck driver, was unemployed for over a year while I went through two COVID semesters. I'm lazy?",
      "author": "Pox_Americana",
      "created": 1629508538,
      "upvotes": 5,
      "replies": {}
    },
    "h9nzs33": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9nzs33/",
      "text": "Most of my family knows I publish papers and that it's a big deal when I get something published, but they don't get how I do that. My father thinks I get paid per paper published on top of teaching and assumes because my schedule is flexible and I'm on a 2/2 that I only work like 10 hours a week. It is a bit frustrating as I have tried to explain my main job is research and the broad idea of service many, many times.\n\n\nOn top of research, most people don't understand service. Since universities generally used shared governance structures, my \"boss\" is as much a colleague as a boss and we have a lot of voice (even if it is sometimes ignored) which adds a lot of work to being a professor, for better and worse. And that's not counting professional service.",
      "author": "Dr_Pizzas",
      "created": 1629469880,
      "upvotes": 10,
      "replies": {}
    },
    "h9q5hl6": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9q5hl6/",
      "text": "Absolutely and utterly not. They get the teaching, because theyve been to school. They have no clue about the research, although I can kind of explain the generalities of my research. But they can't fathom the underwhelming overload of service, the conferences, the publications, editorial roles, grant writing, administration of labs...etc. they cant. And i dont think I'd like them to know. Theyd really get very worried about my mental health.",
      "author": "phenomenologist83",
      "created": 1629502340,
      "upvotes": 3,
      "replies": {}
    },
    "h9qrzoq": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9qrzoq/",
      "text": "Everyone understands your job better than you do when you are a historian. Always fun to have someone lecture me on my own research",
      "author": "crimbuscarol",
      "created": 1629513096,
      "upvotes": 3,
      "replies": {
        "h9ruar8": {
          "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ruar8/",
          "text": "I think this is because, unlike scientific fields, most people have a basic (sometimes *very* basic...) understanding of the discipline. Or have heard of the events. Or lived through them. Or whatever, but, in essence, they feel that they also have some expertise.\n\nThen there's those who, the above being true, cross-over from well-meaning small talk into \"correcting\" (wrongly) your work. That's always fun...",
          "author": "Fluffy_Ad2274",
          "created": 1629540217,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h9r6ef0": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9r6ef0/",
      "text": "Some colleagues have said they tell friends or family their research areas In layman's terms - \"I'm trying to find out the chemical composition of distant stars\" or \"The cellular structure of the skin on fingertips\" - and get the response \"What's the point of that? Why would anybody want to know that?\"\n\n(The skin researcher said \"So now I just say I'm working on cancer.\")\n\nAnd those are extremely concrete, practical fields compared to my research in pure mathematics.\n\nI remember the scene from Big Bang Theory:\n\n\"What do you do all day as a theoretical physicist?\"\n\n\"I think about stuff.\"\n\n\"That's it?\"\n\n\"Well, I write some of it down.\"",
      "author": "radams78",
      "created": 1629521109,
      "upvotes": 3,
      "replies": {}
    },
    "h9osc5b": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9osc5b/",
      "text": "I'm a PhD and I struggle to explain to my family and friends what I *actually* do. As with most PhD projects, the work is complex and not easily digestible for the layperson. Even if I try to explain it simply, it doesn't really make sense to a lot of people. Maybe that says something about my communication skills but I'm going to put it down to my project.\n\nI've been to see family/friends over the summer and lots of them will say \"have you broken up for the summer?\" and I have to explain that I don't get \"summer holidays\" anymore and I have to take annual leave. Through the week when they ask what I've been doing, I tell them I've been working and they say \"what, working a job or studying?\" and I have to try to explain that they're essentially the same thing.\n\nIt's also annoying as a PhD that lots of people expect you to still have the financial situation of an undergrad student. While some PhDs are self-funded, lots of us are provided with funding and a stipend which is a lot more generous than an undergrad student loan. I've had people make comments about \"I wonder how much her parents are having to pay for her flat\"... I'm completely financially independent! My parents don't pay for anything I have.\n\nSorry for the rant!",
      "author": "draaj",
      "created": 1629481379,
      "upvotes": 7,
      "replies": {}
    },
    "h9ntacm": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9ntacm/",
      "text": "Following. I start grad school on Monday and I have the hardest time explaining my research to my family... especially since I don’t know exactly what I’m doing yet :P",
      "author": "eeel12345",
      "created": 1629467100,
      "upvotes": 2,
      "replies": {}
    },
    "h9qgoxq": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/h9qgoxq/",
      "text": "I'm the first in my family to go to university, my parents know I work with rats, that's about it I think. They don't really make any big effort to understand though.\n\nI had a paper in Nature Neuroscience recently and my gf was frustrated that my parents didn't really understand what that meant, but that's just the way it is.",
      "author": "UndendingGloom",
      "created": 1629507658,
      "upvotes": 2,
      "replies": {}
    },
    "ha294i6": {
      "link": "/r/AskAcademia/comments/p82dgv/do_your_family_friends_understand_your_job/ha294i6/",
      "text": "My parents are both retired professors but at times I still don’t think they understand what I do. I know this might sound weird to some of you but it is true! I mean, of course they very well (better than me) know the basic contours of academic life. Teaching, research, service, and admin. But they both come from times when higher education was expanding and standards were less rigid, competition less fierce to pursue questions that they genuinely cared about in a less structured manner. They also worked their entire lives in the developing world despite obtaining their PhDs from the US. They both genuinely enjoyed their jobs and found so much satisfaction in being professors. So, there is a massive gap in how I, a US AP, understand what academic life entails and them. I feel frustrated trying to communicate with them because they do not seem to understand the tremendous stress I am under all the time, the gamification of academic publishing, the crazy job market, the dog fight that is tenure, and how I feel the imposition of bean counting metrics, and ultimately what I consider neoliberalization of academia has destroyed academia. Our conversation about this get so tense to the extent that I often refuse to even talk about work anymore.",
      "author": "Overall_Designer7502",
      "created": 1629743061,
      "upvotes": 1,
      "replies": {}
    }
  }
}