{
  "sid": "qxjnyf",
  "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/",
  "title:": "Do y'all feel that the academic faculty hiring process is fair & ethical? (She asks after what feels like an exploitive and ridiculous, drawn-out, BS application process.)",
  "text": "Ok, so I'll get to my question by way of example. I applied to a faculty position in May. \n\n* Four zoom interviews with search committee in June.\n* One zoom interview with dept head in August.\n* TWENTY FIVE (25!!!!) zoom interviews spread out across FOUR (4!!!!) days in October.\n* 1-hour job talk + 1-hour chalk talk in November.\n\nI emailed to ask about where they're at in their process, how many candidates, when can I expect a decision. I would assume that for a hiring process that began in May, they'd be at the final round by now. They emailed me back to say that, *they are still reviewing new applications,* and will not be negotiating with top candidates until ***January*** at the earliest. \n\nThe whole process has felt absurdly exploitive--absolutely no regard for my time. On at least 1/3 of the 25 interviews in October, people would ask me, \"Can you remind me which position you're applying for?\" It feels like they just threw the wall at me, without telling me WHY I was meeting with all of these people. The interviews were in chunks of back-to-back-to-back zooming. It feels like it was *convenient* for them to just schedule me with anyone/everyone they felt like, without considering the cumulative burden on me. This is INSANE. Has anyone ever heard of 30 interviews for any position, academia OR industry (other than maybe like, C-suite stuff)?\n\nSo, I'm curious about the following questions:\n\n\\-  Is this example extreme, or does this seem normal?\n\n\\- Is this fair & ethical, or does this seem just as exploitive to you as it does to me?\n\n\\- Even beyond this particular example, the whole faculty hiring process feels inhumane and overburdensome on candidates. Is it sustainable? Does it have to be like this?  It just seems like one more example of shit that academia has embraced as convention, but which is really screwed up, compared to other hiring processes. And it privileges only people that have brutal endurance, and the luxury of enough time to go through the process. How can we really expect underrepresented folx to go through it, when they have so much else on their plate to battle against in the world?\n\nOk, I'm done now. Would love to hear your thoughts.",
  "author": "PhDwhaaaaa",
  "created": 1637338853,
  "updated": 1637353645,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hl9ugr8": {
      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hl9ugr8/",
      "text": "25 zoom calls is on the extreme side imo. That said, job candidates tend to assume malice for what is usually incompetence (understandably) or stuff going on behind the scenes that, had the candidate known about it, would make things make a lot more sense. e.g.:\n\n* if this is their first hiring cycle in COVID, it's possible that they fumbled the campus visit over zoom thing. You'd think that someone would figure out that 25 zoom meetings was untenable and not fun for anyone, but people are stupid.\n\n* It's unlikely that they're intentionally and maliciously taking their sweet time deciding. Searches are expensive and none of those people have any more desire to be in the room than you do. There are probably problems or politics behind the scenes that are preventing them from making a decision: the scope of work for the line is unclear or keeps changing, personalities can't agree on candidates in practice or even in principle, looming budget concerns, etc. \n\nAs for does it have to be like this, I feel we have an illusion of control over social phenomena that we don't permit ourselves with, say, natural phenomena, when in fact social systems, like all systems, are by necessity stronger than us. There's no moustache-twirling villain decreeing that academic hiring operate in this way - it operates in this way in response to a complex web of incentives that govern academia as an institution. It would be easier to fix if there were a moustache-twirling villain. \n\nAnyway, I think what you describe is a sign of a dysfunctional department, and if you have the option, you'd be well-positioned to take yourself out of contention after this spectacular show of ass. But, you and others like you might not have that option, which is one of the systemic incentives I referenced earlier.",
      "author": "thegreenaquarium",
      "created": 1637340385,
      "upvotes": 8,
      "replies": {
        "hl9xpt1": {
          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hl9xpt1/",
          "text": "Yeah, it reads like bungling trying to convert from a standard 2-day in person on campus interview to a remote/COVID setup.",
          "author": "Spambot0",
          "created": 1637341650,
          "upvotes": 4,
          "replies": {
            "hla7oje": {
              "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla7oje/",
              "text": "Right.  I read this and thought it would not be unusual to have hour long meetings with 25 different people as part of an on-campus interview. So I suspect that the 25 zoom meetings were individual meetings with faculty members taking the place of that in a Covid era.",
              "author": "DocGlabella",
              "created": 1637345543,
              "upvotes": 2,
              "replies": {
                "hlafffy": {
                  "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlafffy/",
                  "text": "More or less - I interviewed twice in Canada (unsuccessfully both times), with a phone interview of an hour, then in person with 15-20 half hour or hour meetings plus two lunchs, two dinners, a panel interview of ~2 hours, a research talk (~hour), a teaching demo (~hour), a meeting with the students ... this sounds not that dissimilar but converted to zoom and kinda drawn out.\n\nNot smooth on their part, but not surprising.",
                  "author": "Spambot0",
                  "created": 1637348390,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hla05ld": {
              "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla05ld/",
              "text": "Yea, I guess I don't assume an evil moustache-twirler is in the room. It just seems that the *complete* disregard is something that at least the admin person could have pointed out somewhere along the line. \n\nI thought about canceling the whole interview process when I received 25 zoom invites. Some part of me wishes I had, while another part of me feels forced into compliance--if I want an academic job. Of course, most of the people I talk to are academics who have survived the crucible, and they encourage me that the autonomy/intellectual freedom is *worth* it. I just don't know who or what to believe, and my internal compass feels--quite literally--traumatized by my graduate school experiences. (A mix of abusive advisor problems + other personal things (deaths in the family, breakups, etc.)) I wish I knew what to trust anymore. :/",
              "author": "PhDwhaaaaa",
              "created": 1637342605,
              "upvotes": 1,
              "replies": {
                "hla19th": {
                  "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla19th/",
                  "text": "Well, you can.  I'm hestitant to speculate on how much not figuring out a great COVID setup is liable to represent a greater disfunction or not.  They have their own constraints too and *probably* are trying their best.",
                  "author": "Spambot0",
                  "created": 1637343044,
                  "upvotes": 1,
                  "replies": {
                    "hla1nxt": {
                      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla1nxt/",
                      "text": "Sorry, I'm not sure I understand. Can *what*?",
                      "author": "PhDwhaaaaa",
                      "created": 1637343198,
                      "upvotes": 1,
                      "replies": {
                        "hlaeqdf": {
                          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlaeqdf/",
                          "text": "I mean, you can withdraw.  If the way you're framing it is unhelpful, you approach it as you have the option to do it or not, it's just something you're working towards.   You don't have to do it, you're choosing to do it to (hopefully) accomplish something.",
                          "author": "Spambot0",
                          "created": 1637348136,
                          "upvotes": 2,
                          "replies": {
                            "hlag9r5": {
                              "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlag9r5/",
                              "text": "Oh, I see what you meant, thanks for clarifying.\n\nAt this point, just waiting to see what happens, as I already finished the interview process. No need to withdraw—but of course, if I do receive an offer, I will have to think carefully about whether to accept it or not. Big decision!!  Thanks for your input.",
                              "author": "PhDwhaaaaa",
                              "created": 1637348695,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl9t6ru": {
      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hl9t6ru/",
      "text": "Recruiting in the UK right now for faculty and I can tell you we absolutely wouldn't do this. We've set up a virtual first round and the leading candidate (ideally only one for each position) will be invited to visit in person. \n\nWe've broken the virtual interviews up into morning and late afternoon/evening sessions. While not ideal for our staff with caring responsibilities we went this way to better accommodate candidates in different time zones so they wouldn't be presenting at 4am their time against a UK candidate presenting in the middle of their waking day. We've also worked with our own staff to accommodate caring responsibilities as best as we are able.\n\nWe have limited the number of zoom meetings because it's hard on everyone. We also didn't consider any candidates until after the deadline closed and we've been careful to try and interview the candidates for each position as closely as possible to avoid leaving them hanging. \n\nWe aren't perfect by a long shot and I'm not thrilled with some of the diversity aspects of our recruiting but I read people's experiences on here and know we're doing better than we did and we aspire to be better than we are.",
      "author": "ACatGod",
      "created": 1637339885,
      "upvotes": 4,
      "replies": {
        "hla0c03": {
          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla0c03/",
          "text": "That sounds so kind compared to what I've gone through. \n\nThank you for doing your best. Seriously. I genuinely mean that.",
          "author": "PhDwhaaaaa",
          "created": 1637342677,
          "upvotes": 2,
          "replies": {
            "hla5oj8": {
              "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla5oj8/",
              "text": "We're not perfect and we did a recruitment last year that was the first virtual one. We felt we didn't do a good job with that one and I feel for the candidates. We tried to learn from it. \n\nI think there are organisations starting to think about this stuff and improve. I also think we as recruiting managers need to remember that applicants are interviewing us as much as we them. We need to be putting on our best show for them.",
              "author": "ACatGod",
              "created": 1637344750,
              "upvotes": 2,
              "replies": {
                "hlah8vg": {
                  "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlah8vg/",
                  "text": "If they don’t make an offer, I’m thinking about writing a respectful but frank email with some feedback. I don’t know if that’s a good idea or not, though… don’t want to burn a bridge for no reason. But I mean, if I don’t say something, who will?!",
                  "author": "PhDwhaaaaa",
                  "created": 1637349048,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hla7ldd": {
      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla7ldd/",
      "text": "We do one or two interviews tops. 30 is unheard of.\n\nWhat information could you possibly gain after an hour of talk? Evidence of research and teaching skills should be found in the written documentation.\n\nIf this how they run their hiring, maybe working there is equally chaotic?",
      "author": "molobodd",
      "created": 1637345508,
      "upvotes": 2,
      "replies": {
        "hlagzva": {
          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlagzva/",
          "text": "Yea… I do wonder that…",
          "author": "PhDwhaaaaa",
          "created": 1637348957,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlarg52": {
      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlarg52/",
      "text": "I can not believe the amount of commenters saying this isn’t too bad as they’re just replicating in person meet greets/ is just incompetent and due to Covid.\n\nIt is utter insanity and whether you get the job or not I’d be giving feedback on the process specifically pointing out the number of calls, the back to back nature of them, length of process etc. it’s absurd and exploitation",
      "author": "Taffeta_Dream",
      "created": 1637352850,
      "upvotes": 2,
      "replies": {
        "hlarusb": {
          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlarusb/",
          "text": "Thank you for the validation. \n\nIt's absurd.",
          "author": "PhDwhaaaaa",
          "created": 1637353004,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl9u5zw": {
      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hl9u5zw/",
      "text": "No, it's not fair or ethical, though some processes are probably more or less fair and ethical than others. As you point out, hiring processes are often incredibly ableist and biased in other ways. Unfortunately, I see some of these as patterns that result from the academic hiring situation being a long term \"buyer's market\" where there are many more applicants than there are positions available. There are many other factors that contribute to the problems you're describing that I could get into if you're interested but I won't bore you otherwise. Anyway, to answer some of your qs:\n\nIn my field it would be extremely unusual for to have a job posted in May for an offer to be made in January. I can't speak for your field, though. More typical would be jobs posted in August at the earliest but more likely Sept–Nov to have an offer made in January-ish.\n\nIt would also be extremely unusual for a search committee to conduct 30 first round interviews for one position. Typically the number is more like 8–12. But again, this is in my field.\n\nI don't think it has to be the way it is, but academia can be so slow to change, unless you have people who have the capacity to make that change and are very motivated to do so.",
      "author": "corgi5005",
      "created": 1637340267,
      "upvotes": 1,
      "replies": {
        "hla1ap7": {
          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla1ap7/",
          "text": "Right... January would feel fine for an August job posting. \n\nI was **absolutely baffled** that new applications are still being reviewed.\n\nThank you for sharing.",
          "author": "PhDwhaaaaa",
          "created": 1637343054,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl9u48a": {
      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hl9u48a/",
      "text": "I've definitely not seen that complex of an interview process before. My experience has been one screener interview (phone or Zoom) with the search committee, usually a half-hour to an hour, followed by a full-day or two-day interview session with relevant parties; my experience was the Dean, Associate Dean, job talk, faculty Q&A, student Q&A, search committee chair alone, chair of department, and then optional Q&A time with faculty outside of the department I'd requested to meet with. The last part didn't have any bearing on my selection. Pre-pandemic, the full day/two day interview process was in-person, complete with a campus tour, and tour of facilities if applicable. I don't think that this process is exploitive, since they're generally attempting to select someone who will, in theory, be a part of the department for the rest of their careers, and trying to select someone from an interview process is really difficult. In some ways, the marathon interviewing is partially a way to break someone down and see their \"real\" personality, research interests, teaching philosophy, mentoring style, and general fit, which you're not going to get from a 1-hour interview. The department is also not the last step in the acceptance process. Even if the search committee recommends you, the chair has to approve, then the dean has to approve, then the provost, chancellor, president, and, in public schools, maybe all the way up to the Board of Governors, so they want sufficient evidence to put together justification for your hire. If a candidate fails to get through any of those approval processes, then the search generally fails and they have to start over, usually requesting the line again. On top of it, since the whole process can take months, sometimes (often), the selected candidate has already accepted another position, especially if they're interviewing in multiple institutions or have combined academic and industry searches, the latter of which generally move much faster. \n\nThe process you went though is definitely abnormal. A four day interview is insane. In industry, 2, 3, or even 4 interviews are common across several days, but they're usually relatively short, and you're going through screening rounds each time. I think it's unreasonable to expect that someone can take almost a whole week off of work to conform to the whims of whatever the prospective position's stakeholders want. Further, even the traditional academic job search process expects that you're going to be hired on the usual academic year timeline, which, especially if you're looking at candidates that are just getting out of grad school, can mean waiting a year or more for confirmation of employment. So, yes, it does treat marginalized and underprivileged people unfairly, and expects that you have the time to sit on your laurels waiting expectantly for the results of a long, arduous process. Even more, if you're moving from academic sphere to academic sphere, then employment contracts often have unreasonably long expectations for notice, so if you're hiring for, say, Fall, and you've selected a candidate and notify them in May, then it's likely that the candidate hasn't already agreed to some obligation in the summer months, and they need to give 60-90 days notice to their current institution, which can put you on shaky ground, especially since the actual notice of contract approval doesn't happen for a month or three after you're hired, so there's already the potential to not actually be employed when you're officially leaving your last job.",
      "author": "insanityensues",
      "created": 1637340248,
      "upvotes": 1,
      "replies": {
        "hla0ztu": {
          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla0ztu/",
          "text": "Thank you for sharing. This validates my feelings that this process I'm going through is utter insanity.\n\nI think for my own psychological safety, I'm going to keep sending applications out and think a little more seriously about going for industry. This just feels like absolute garbage, when I know I could get a cushy remote industry gig for probably $50-100k more in salary than I'd get at a professor job.  Money isn't everything, but do I really want to work for an organization that treats applicants like this?  *Ugh.*",
          "author": "PhDwhaaaaa",
          "created": 1637342935,
          "upvotes": 2,
          "replies": {
            "hla4utx": {
              "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla4utx/",
              "text": "I would agree. As other commenters have noted, it's likely that this insane search process is  due to mismanagement of time and/or inexperience with a full search in COVID-land. Getting academics together at the same time can really be like herding cats, and disorganization can definitely be a sign of how administration and/or the department operates. \n\nAll that said, I completely support folks who consider industry. On the other hand, I can say personally that industry is not for me. I really like having academic freedom both in teaching and research, and have yet to stumble across an industry job that would provide the same. I might be have rose-colored glasses on the Golden Handcuffs, but I also have a very supportive department that has only denied tenure to one faculty member in the last ten years, while I've known folks in industry and government who have had to jump ship multiple times due to breakdowns and changes in leadership and management. I prefer job security over wealth, I guess, and I also really like the mentorship opportunities available to me as an academic. Academia and industry have their own respective set of problems, and everyone's perception of risk is different. In any case, job interviews are just as much about the institution getting to know you as it is about. you getting to know the institution *and* the system. \n\nBest of luck to you. I hope you find what you need.",
              "author": "insanityensues",
              "created": 1637344428,
              "upvotes": 2,
              "replies": {
                "hlahicf": {
                  "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlahicf/",
                  "text": "Thank you. I do struggle to think about leaving academia.\n\nI’m glad you have a supportive Dept. That’s really awesome, and it’s wonderful you found the best fit for you. :)",
                  "author": "PhDwhaaaaa",
                  "created": 1637349144,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hla7v2w": {
      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hla7v2w/",
      "text": "When you do an in person campus meeting, it is not uncommon to be rushed from office to office over the course of two days and individually meet with anywhere from 10 to 30 people. It’s incredibly stressful. Is it possible that your 25 zoom meetings were just taking the place of that process?",
      "author": "DocGlabella",
      "created": 1637345617,
      "upvotes": 1,
      "replies": {
        "hlagx25": {
          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlagx25/",
          "text": "Yes, I agree that they are trying to replicate that process. But it feels problematic that there were: (a) no breaks between individual calls, and (b) they felt it was ok to eat 4 days of my life rather than 2.  And then other two talks a week later. Dragging out the anxiety over such a long time feels disrespectful. They should have kept it to two days, included the talks on those two days, and they could have/should have done more group interviews rather than so many individual meetings. Yea, it’s harder and more logistically challenging to line up their faculty’s schedules than to just make me repeat myself, but it would have shown me that they cared about my experience if that had.",
          "author": "PhDwhaaaaa",
          "created": 1637348929,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlalti2": {
      "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlalti2/",
      "text": ">I emailed to ask about where they're at in their process, how many candidates, when can I expect a decision. I would assume that for a hiring process that began in May, they'd be at the final round by now. They emailed me back to say that, they are still reviewing new applications, and will not be negotiating with top candidates until January at the earliest.  \n  \nThey rebooted the search, which means everyone's application who was in the original search is in \"dead on arrival but we're not cutting them loose until the absolute end of the process\" stage. Sorry.  \n  \n>Is this example extreme, or does this seem normal?  \n  \nI would say the extreme side of normal.  \n  \n>Is this fair & ethical, or does this seem just as exploitive to you as it does to me?  \n  \nI'm not sure if it's exploitative, but it's extremely disrespectful and I don't think all of the effort going into it (on either side) yields a better outcome than if they just had a normal hiring process.  \n  \n>Is it sustainable? Does it have to be like this?  \n  \nAs long as there are 100 viable candidates for every open position, it's not going to change.  \n  \n>How can we really expect underrepresented folx to go through it, when they have so much else on their plate to battle against in the world?  \n  \nAcademia as a career is one of the most classist institutions I can think of, and it's completely blind to it. It wants candidates who have had the privilege to endure an academic pilgrimage that is out of reach for anyone who doesn't have a wealthy family background. For all of the hand-wringing about inequity, academia's head is too firmly up it's own backside to ever notice it is a major contributor to it.",
      "author": "brett_hoover_wx",
      "created": 1637350729,
      "upvotes": 1,
      "replies": {
        "hlarnlz": {
          "link": "/r/AskAcademia/comments/qxjnyf/do_yall_feel_that_the_academic_faculty_hiring/hlarnlz/",
          "text": "Regarding your first comment about \"dead on arrival,\" that is exactly why I was a bit shocked and pissed this morning.\n\nWhy the f\\*\\*\\* put people through this crap if you're still letting new applicants in. \n\nI'm working on letting it go. Just going to take a moment of silence for my wasted time. I'm not fully 100% convinced that it's a 0% chance of getting an offer, but I absolutely recognize that there was a major drop in my optimism after the email today. :/",
          "author": "PhDwhaaaaa",
          "created": 1637352929,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}