{
  "sid": "jfbqej",
  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/",
  "title:": "I am SO torn about qutting my PhD",
  "text": "Hi all.\n\nI am sure I am not the first to consider quitting a PhD, it is a lot more intense than I ever realised (and I knew it would be), so much more stressful (esp with covid-19 happening) and I am realising more and more it might not be for me. I made this list:\n\nIs a phd for me?\n\nYes:\n\n· I love research\n\n· I enjoy writing (sometimes)\n\n· I want to be a dr\n\n\\- i love my topic and am passionate about it \n\nNo:\n\n· It is not needed for my future career (career prospects pretty much remain the same because research roles are all desk based and I want a more practical job)\n\n\\-  i feel like the topic would be better helped practically - theorising everything doesnt so much to solve  a problem\n\n· I am struggling so much I just the first year that I am worried about the 3rd/4th years\n\n· Im not really botheredto do the fieldwork for a year. I don’t want to take another year out travelling/learning etc. \n\n· I want to work: save money for a apartment, a car, general life. I also want to climb the career ladder\n\n· It is really really really stressful and aniexty ridden\n\n· I have no desire to be in academia\n\n I also have a complex: a high school teacher told me once  I would be a failure once in life, and she is OBVIOUSLY wrong, but it stuck with me. That b\\*tchis a dr and I wanted to prove I could be one too. To myself. but why am I allowing this to encompass who I am and what I am worth? \n\nBut at the same time: my list of No’s is obviously longer but I cant bring myself to give up/not do it. But I also really don’t wanna do the fieldwork, im scared of how much work the write up will be and im terrified of the WIP.\n\ndespite all of the evidence pointing to quit and get rid of this stess - i just cant seem to bring myself to do it. instead, i have actually been working on my phd? i am so confused by MYSELF in all of this.\n\npls help guys, im going crazy.",
  "author": null,
  "created": 1603282832,
  "updated": 1634080773,
  "over_18": false,
  "upvotes": 181,
  "upvote_ratio": 0.97,
  "comments": {
    "g9jbfoo": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jbfoo/",
      "text": "Honestly, it doesn't seem like a good idea for you to continue with your PhD. Your time and energy could be much better utilized pursuing other work. Also, don't let that high school teacher live rent-free in your mind.",
      "author": "datafix",
      "created": 1603285128,
      "upvotes": 180,
      "replies": {
        "g9k1x4f": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k1x4f/",
          "text": "It is hard enough as it is to manage rent for yourself, don't let someone live rent-free in your head.",
          "author": "Guy_2701",
          "created": 1603298953,
          "upvotes": 42,
          "replies": {
            "g9mxo9u": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mxo9u/",
              "text": " 🏅 please take my poor medal",
              "author": "Doprrr",
              "created": 1603365585,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g9lj12m": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9lj12m/",
          "text": "Yes. Point number one in your no list is honestly enough of a good reason even on its own not to continue. My advice though is to make sure it’s true and the most important way to do that is to find a job (read: get an offer) that you want to accept that you are qualified for right now and that you see a future with. Talk to people who do that job (or similar) at different levels, if possible, and make sure it’s work you would like to do. You aren’t going to feel better later and you’ll instead feel like you’ve wasted even more time.",
          "author": "imposter_syndrome1",
          "created": 1603325255,
          "upvotes": 7,
          "replies": {}
        },
        "g9mwtdo": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mwtdo/",
          "text": "thats true, i did realise as i wrote this i let her really get into my mind. i am a well acomplished person and i know i am smart but i guess words really can affect you growing up",
          "author": null,
          "created": 1603364779,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "g9jcyav": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jcyav/",
      "text": "Is it really worth the next 4 years of your life just to show up one teacher in high school who probably hasn't thought of you since you graduated? Like being a dr should not be on the pro list (in my opinion). A titile isn't really something to be looking for in life in order to gain validation from others. Why does someone who seemed to have wronged you have so much weight in your life? Like you're 22/23 I imagine? At what age will you not care what that one teacher once thought of you?",
      "author": "rosealyd",
      "created": 1603286083,
      "upvotes": 70,
      "replies": {
        "g9k31yb": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k31yb/",
          "text": "Yeah just imagine going and telling this teacher that you got a PhD. It would be evidence that her and her words stuck with you every day for YEARS. She'd then deem herself as the most responsible and positively influential person in your life.",
          "author": "antisaccade",
          "created": 1603299494,
          "upvotes": 45,
          "replies": {
            "g9kfsrd": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kfsrd/",
              "text": "And she still would condescend you. Like having a phd won't change your teacher's personality.",
              "author": "rosealyd",
              "created": 1603305560,
              "upvotes": 23,
              "replies": {}
            },
            "g9mbho9": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mbho9/",
              "text": "she is delusional!! she is confusing “positively influential” with toxic, verbal abuse that is traumatic to impressionable teenagers.",
              "author": "d0lltee",
              "created": 1603343202,
              "upvotes": 3,
              "replies": {
                "g9mxliv": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mxliv/",
                  "text": "yeah and my high school was super rough as it is....she wasn't helping the situation lol",
                  "author": null,
                  "created": 1603365515,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g9mxkih": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mxkih/",
              "text": "eeeeee that's so true \\*puke\\*",
              "author": null,
              "created": 1603365489,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g9mwvfh": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mwvfh/",
          "text": "yes your so right...and im 28 so thats worse lol",
          "author": null,
          "created": 1603364835,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9jax85": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jax85/",
      "text": "I’ll probably be in the minority, but if you have no desire to be in academia and don’t need the degree for your future job, I don’t know if it’s worth staying in it. Especially with the explicitly names opportunity costs you’re considering (e.g. traveling, saving money). The anxiety you could work around, if that were the biggest issue. But it doesn’t seem like it is. As for wanting to research and write, you can do that without doing a PhD.",
      "author": "notverrybright",
      "created": 1603284798,
      "upvotes": 131,
      "replies": {
        "g9myzai": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9myzai/",
          "text": "your so true and this is what I think about ALL the time...but when push comes to shove im like eeeeeeeeeeeeee",
          "author": null,
          "created": 1603366733,
          "upvotes": 2,
          "replies": {
            "g9nfvov": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9nfvov/",
              "text": "Just keep the opportunity costs in mind.  I can't tell you what makes the most sense for you, but by definition, when you do something, you give up the opportunity to do something else.  \n\nThere's no doubt that you *can* do the PhD.  Fuck your old high school teacher.  You know you can.  The people who know you best know you can.  Getting the degree to prove to her that she's wrong isn't going to get you anywhere.  You can get it to prove to yourself that she's wrong, but you already know she is.  \n\nSo, if you get the degree, you'll have accomplished something that very few people have.  You'll be well versed in whatever field you're in, and you'll have refined the skills necessary to do so.  All great things.  And in return, you'll likely be less financially stable than others your age, and may have fewer life experiences (e.g. as you said, and as I've seen, friends who didn't go to grad school had the opportunity to travel, and to develop hobbies that those in grad school didn't have while in school.  There's exceptions to everything, of course, but the point is: you can have anything you want, but n everything you want.",
              "author": "notverrybright",
              "created": 1603377401,
              "upvotes": 2,
              "replies": {
                "g9okp5a": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9okp5a/",
                  "text": "this is so true, thank you so much for this.",
                  "author": null,
                  "created": 1603396453,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9jbi1d": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jbi1d/",
      "text": "It sounds like you’re doing a PhD because you wanted to take time to learn, explore a topic, read, and write. NOT in order to get a job or move forward in your career. So, if you don’t feel like you are getting out of it what you want, it sounds like you should leave. There’s no shame in that. Honestly, with Covid it makes a lot of sense that you’re not getting what you signed up for. Community is harder to find, conversations over video calls are stunted, no beautiful campus to appreciate. \n\nIt’s not the experience you applied for! \n\nThat said, you don’t have to make a strong decision immediately. Apply for jobs. See what’s out there that you can get right now. Take some interviews. No harm in that either.",
      "author": "longliveFuriosa",
      "created": 1603285170,
      "upvotes": 67,
      "replies": {
        "g9jvn0s": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jvn0s/",
          "text": "This is exactly what I needed to hear, thank you. I just completed my PhD in August, and I loved learning and exploring my research and teaching, but it wasn’t the experience I thought I’d get. \n\nNow that I’m done, going into academia limits what jobs to apply for now that I’m done. So I’m applying to just teaching positions and in the industry. All I’ve done for 24 years is school, and I’m still young, and I’m excited to see what is out there. \n\nThank you for sharing.",
          "author": "Bookkeeper-Imaginary",
          "created": 1603295925,
          "upvotes": 14,
          "replies": {
            "g9mz2xx": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mz2xx/",
              "text": "oh wow that's interesting",
              "author": null,
              "created": 1603366817,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g9lsg6z": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9lsg6z/",
          "text": "I think this is the most solid answer. Getting a Ph.D. is almost never a smart career move. It should be worth the experience you are having now, not something down the road, since there is very often not a clear \"payout\" to a doctoral program.  \n\n\nI really enjoyed doing my graduate degrees. (Well, 90% of the time.) I hoped that it might provide some value to me beyond that enjoyment, and I did end up in academia where it is something of a required credential. But I never expected it would. I did it because I enjoyed learning in that context. I think that's the best reason to stay in a program, and if you're not feeling it, find work outside the program that brings you more meaning.",
          "author": "halavais",
          "created": 1603330660,
          "upvotes": 4,
          "replies": {}
        },
        "g9mz0xt": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mz0xt/",
          "text": "yes 100%. I have been job hunting too. but its weird I keep flipping between the two difference stances",
          "author": null,
          "created": 1603366771,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9jqr1q": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jqr1q/",
      "text": "First off, are you 1. paying for your PhD? Or 2.is your tuition covered and you get a stipend? If you’re in camp 2, you could try applying to jobs to see if you can even find an ok job right now in this economy. If you can’t even find another job, maybe it’s worth sticking in the program for now.",
      "author": "grfhoyxdth",
      "created": 1603293527,
      "upvotes": 25,
      "replies": {
        "g9k2kdq": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k2kdq/",
          "text": "This is good advice!",
          "author": "datafix",
          "created": 1603299263,
          "upvotes": 6,
          "replies": {}
        },
        "g9mz5dd": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mz5dd/",
          "text": "I am self funded!",
          "author": null,
          "created": 1603366873,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9kgkpe": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kgkpe/",
      "text": "Academia is weird in that it somehow becomes a huge part of our identity. So stopping being an academia often feels like giving up a part of ourself.  \nI finished my PhD in March and was somewhat hellbent on staying in academia, because it felt like giving up or failing. I invested years in being where I am and I like to believe that I generally fared quite good. I already got postdoc offers, so moving on with this career would have been easy. But this is where the first problems arose: Offers abroad, partner unwilling to move there. And it wouldn't be our last move. Granny got sick, now I live within 2 hours car drive of her and my family, then at least 10 hours with an airplane. Salary. Realization that I won't have any job security for at least 10 more years, so how to plan kids/house/etc? \nThe more I though about it, the more negatives I found, not with the particular postdoc offers but general things about the academic lifestyle I don't agree with.\n\nBut honestly, what really helped me to do the jump from academia to industry was finding a job I was sure I would love. Before that, I was unsure. I didn't really want to give up, especially not for a stupid generic IT or consulting or whatever job. Finding that job helped me immensely to \"pull the plug\" because now I am confident that I'll do something I like and I actually see it as an even bigger adventure and challenge than staying in academia and doing \"more of the same\".  \nYou currently have a position, so why not look at openings \"just for fun\", without pressure? Start reading job openings to see what you could do with your current education (or where you might want to improve, if you stay at your PhD position). See if companies you like have any type of \"orientation day\" offer, with the pandemic they actually got a bit more accessible, since everything moved online. When you like a position: consider applying. In worst case, you'll have collected some experience in applying or even being interviewed, which will be handy in life no matter which path you go. Or you find a job or at least a direction you want to work at.\n\nAlso try to see all the other successes you achieved and that clearly proved that your teacher is an ass. Having a stable and well-paying job is probably an even bigger success than that stupid title, so moving on might actually help you finding some peace in that direction, too. \n\nIf you want to connect to some other \"suffers\", you can also join us at /r/LeavingAcademia.",
      "author": "LittlePrimate",
      "created": 1603305928,
      "upvotes": 17,
      "replies": {
        "g9kpu4m": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kpu4m/",
          "text": "If I could upvote this 100x I would. The only reason I hesitate in advising OP to quit now is because they say they love research, even though they say they don't need a PhD to advance in their field. OP, before you quit your program, take some time to explore the pros and cons of research opportunities available in \"industries\" within your field of interest. For me, I definitely could have landed a research-related role in my field without a PhD, but I would have been limited in what I could do in that role. For example, I am specifically asked to design and run studies in my field in my current non-academic position, which I can guarantee would have never happened if I hadn't pursued a PhD, I probably would have been in charge of data collection on someone else's study at best. But I think the degree to which these limitations exist varies greatly by field. So, start looking around and figuring out both what you want as a person, and what's available to you with and without a PhD. Once you start seeing how your personal goals line up with PhD vs. non-PhD opportunities, I think the best choice for you will be clearer. \n\nAnd never pursue anything for a title/shiny gold star. A lot of the most miserable people I know have done this, and it's a big reason why they're so miserable.\n\nAnd your teacher was/is an ass.",
          "author": null,
          "created": 1603310349,
          "upvotes": 4,
          "replies": {
            "g9mzgg2": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzgg2/",
              "text": "thank you so much for this.\n\n&#x200B;\n\nyeah she was",
              "author": null,
              "created": 1603367130,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g9mze2y": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mze2y/",
          "text": "thank you so much for this, this has given me a lot to think about!\n\nthe issues with my phd is - social sciences - is that I either go into academia or nothing at all. there is no other real pathway with this. I worked in the charity sector before this and tbh I want to go back to it afterward - I DEF do not need a phd for that.\n\nbut I do need experience. and the more years of experience I miss out on (studying) the worse my job prospects are getting for the charity/development sector",
          "author": null,
          "created": 1603367076,
          "upvotes": 2,
          "replies": {
            "g9ng4mk": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9ng4mk/",
              "text": "Yeah, your last point is definitely true. For all jobs that don't have a PhD as a hard requirement working experience is often worth a lot more than an extra degree. For some jobs a PhD can make landing an entry level position a bit easier, but some companies will also tackle that with \"You have no idea about the corporate world\" and will see it as a big negative and kind of view you as \"tainted\" by academia. The longer you stay in academia, the more companies might be reluctant to give you a chance.\n\nYou otherwise would need to concentrate on other skills your studies gave you. As a PhD you can always claim ability to work independently on a project, leadership and supervision (depending on your program), collaborative skills and communication, writing and presentation skills and of course the ability and drive to learn new things. If you would want to have a role associated with these, you could add a formal certificate and try to make that into a job.  \nI am not familiar where social scientists can end up, my friends (STEM) went into project management, consulting, patent law, PR for scientific communication or technical/medical writing.\n\nI suspect you have checked whether you can \"Master out\" instead, to get the benefit of having something to show for the time you invested but also being able to shorten your time there?",
              "author": "LittlePrimate",
              "created": 1603377528,
              "upvotes": 2,
              "replies": {
                "g9okllz": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9okllz/",
                  "text": "yes I have and my stupid uni is the only uni in the uk where I can't get a masters after 1 year so I leave with all or nothing basically",
                  "author": null,
                  "created": 1603396412,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9n833u": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n833u/",
          "text": "May I ask what job you have?",
          "author": "Bookkeeper-Imaginary",
          "created": 1603373082,
          "upvotes": 1,
          "replies": {
            "g9ne7b0": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9ne7b0/",
              "text": "Software Tester at a company that builds prostheses. It fits my background where I mixed Biology and Computer Science and during my PhD worked on brain-computer-interfaces in monkeys, where I studied grasping movements.   \nThe position is also great because even though I am formally a tester, I'll be involved in the whole developmental process from the start.   \nI'll still have to see how I'll actually like it long-term, but for now I am excited.\n\nOtherwise, the recruiters I talked to connected me to job openings for \"Software development for kitchen user-interfaces\", \"Survaillance software for construction side progress\" or \"consulting for a insurance company\", which lacked the Biological aspect for me.",
              "author": "LittlePrimate",
              "created": 1603376515,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g9otr69": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9otr69/",
          "text": "this is all so true. thank you so much for this. I will check out the group.",
          "author": null,
          "created": 1603400273,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9jer91": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jer91/",
      "text": "If ur gonna wake up in a cold sweat in 10 years thinking ‘what could have been?’ ... stick with it, else quit",
      "author": "Netcat2",
      "created": 1603287161,
      "upvotes": 19,
      "replies": {}
    },
    "g9jix7f": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jix7f/",
      "text": "The number of pros vs. number of cons isn't as important as how good/bad each of them is. Assign each pro/con a score, then see which category has the biggest score.\n\nIt's ok to do a PhD just because you want to learn and read and write etc., even if you won't need it for your future career. The downside of that is you'll lose potential wages because you'll spend several years making like $20k when you could be making $60k if you were in the workforce, but for some people that is totally worth it.\n\nKeep in mind that the difficulty and anxiety will not increase year after year. At my alma mater program, the first year was the most stressful, and it got much easier after 3rd year.\n\nIf I were you, I'd wait until the end of the second semester before making any decision about staying or quitting. Wait until the newness of the experience has worn off somewhat, because your anxiety levels at that point will be better representative of how they'll be for the rest of grad school. Right now there are so many things that you haven't experienced yet, and those unknowns are probably exacerbating your stress. I'm thinking things like exams, presentations, research, one-on-one meetings with your research advisor, etc. (I know some of these things also happen in undergrad, but part of you might be expecting them to be harder or more high-stakes in grad school, so they're different now (or seem different right now when you haven't done them yet))",
      "author": "pb-pretzels",
      "created": 1603289507,
      "upvotes": 17,
      "replies": {}
    },
    "g9jliha": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jliha/",
      "text": "Leave when you can.",
      "author": "geometer2015",
      "created": 1603290879,
      "upvotes": 7,
      "replies": {}
    },
    "g9jlyu9": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jlyu9/",
      "text": "What is your 3, 5, 10 years life plan? Generally, not to make life changing decision while you are confused and distressed. Covid time is not easy for everyone...\ntake a break!",
      "author": "maymay_g",
      "created": 1603291118,
      "upvotes": 5,
      "replies": {
        "g9mzjy5": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzjy5/",
          "text": "I took a looooooong 6 months break and im still as confused now as I was when I took the break",
          "author": null,
          "created": 1603367210,
          "upvotes": 1,
          "replies": {
            "g9n1f6o": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n1f6o/",
              "text": "have you tried to speak to a career counselor?",
              "author": "maymay_g",
              "created": 1603368679,
              "upvotes": 1,
              "replies": {
                "g9n742g": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n742g/",
                  "text": "I have tried to find one online but its ££££",
                  "author": null,
                  "created": 1603372498,
                  "upvotes": 1,
                  "replies": {
                    "g9n7foe": {
                      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n7foe/",
                      "text": "Your school's career center?",
                      "author": "maymay_g",
                      "created": 1603372697,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g9kfxn4": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kfxn4/",
      "text": "> It is not needed for my future career (career prospects pretty much  remain the same because research roles are all desk based and I want a  more practical job)\n\nHere is your answer. A Ph.D. is a means to an end. People do not get a Ph.D. for fun; they get one because it is required to achieve their goals. If the kind of job you want doesn't require a Ph.D., you can actually screw yourself over by getting a PhD by being overqualified for that position.\n\n> I want to be a dr\n\nDig into this more - why do you want to be a Dr? Prestige? Respect? What is the underlying thing that you actually want out of this.",
      "author": "banamana27",
      "created": 1603305626,
      "upvotes": 3,
      "replies": {
        "g9mzlmh": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzlmh/",
          "text": "I realise I am looking for validation for my intelligence because of that one asshole teacher",
          "author": null,
          "created": 1603367248,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g9juuzv": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9juuzv/",
      "text": "It's not worth it! I left in my first year for a practical job in my field and never looked back.",
      "author": "tefferhead",
      "created": 1603295545,
      "upvotes": 3,
      "replies": {
        "g9mzmau": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzmau/",
          "text": "wow really? what was your phd? what are you doing now?",
          "author": null,
          "created": 1603367263,
          "upvotes": 1,
          "replies": {
            "g9n9vtb": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n9vtb/",
              "text": "No I shouldn't say that unilaterally PhDs aren't worth it, but rather for me a PhD was not worth the emotional stress, anxiety, and depression that came with long hours of solitary work for an ungrateful and  narcissistic advisor. I left and am working in epidemiology for a multilateral organization. Best decision was leaving the University.",
              "author": "tefferhead",
              "created": 1603374129,
              "upvotes": 1,
              "replies": {
                "g9okswy": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9okswy/",
                  "text": "I feel this",
                  "author": null,
                  "created": 1603396497,
                  "upvotes": 1,
                  "replies": {
                    "g9ou5lp": {
                      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9ou5lp/",
                      "text": "Yea I think ultimately you just need to determine whether you absolutely need a PhD to succeed in your field. If the answer is no and you feel excited by career prospects outside of academia, then apply for jobs while in the program and quit when you get one. If academia excites you and you really want it, then look into either changing topics, advisors, or labs to see if you can find a better work environment or something to get the creative juices flowing. Remember, you're not a failure or anything if you leave.",
                      "author": "tefferhead",
                      "created": 1603400453,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g9k1mea": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k1mea/",
      "text": "The first year or two (in my experience, and that of just about every other PhD student I know)  are the most stressful. After certain milestones are surpassed, e.g. qualifying exams and coursework, the stress drops off immensely. The stress of these initial years is not representative of later years.\n\nI was stressed beyond belief in my first year; I was overloaded with a genuinely impossible amount of work and got four hours of sleep a night for the whole year. Those first two years were the hardest years of my life (and I've had some objectively tough times in life aside from this). \n\nBut it got better. Much, much better. Once you get on to focusing on the real dissertation research, it feels very different. Don't give up yet. My advice is that you get past these hardest milestones (that is, keep going for another year, until after quals and courses are done). If you are still not feeling it after that, then I suggest you evaluate the situation again.\n\nI also saw some of your post history and can chime in as a fellow person who has some unhealthy food-related coping mechanisms, including similar eating issues. The stress of grad school in those first two years really brought out the worst of my coping behaviors and was a true journey in me figuring out how to transform those. It was very tough but I eventually started to transition them over to different/healthier things. It was a hard journey with a lot of bumps, but eventually I figured out how to stay more sane and less self destructive during that time, and I ultimately learned (in a trial by fire way) some much healthier ways to cope that have stayed with me through these less stressful times and will likely benefit me long into the future. For me the PhD process has truly been a trial by fire...so many ego deaths, so many times that I felt angry and humiliated at myself, but ultimately (pardon the corny phrase) it has been a very phoenix-like process. I have gotten through it and emerged a stronger person. I believe you can do the same if you go forward with determination and intention, and perhaps if you also find a therapist to work through issues with.",
      "author": "norge_erkult",
      "created": 1603298810,
      "upvotes": 3,
      "replies": {
        "g9mzu71": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzu71/",
          "text": "thank you for this and yes I agree with the stress of studying and food issues I do tend to make myself suffer more with overeating and all but that's another post...\n\nso I am in the UK and I have no classes/courses ( I should have mentioned this before) my first year is just planning and my god It has been hell. its like a mini thesis and its been sooooo tough. and my supervisors don't make it easier. 2nd year (next step) is straight fieldwork. and I really don't wanna do that rn with covid too",
          "author": null,
          "created": 1603367436,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9jcwop": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jcwop/",
      "text": "At the end it has to be your own decision, but I would seek advise from people that know you. Maybe your colleagues or your supervisor could give you some constructive feedback on you as a scientist/phd candidate. You don't have to tell them you are thinking about leaving, you can always just ask for the feedback for personal improvement :). \n\nIn general, I think that sloppy finished phd is much worse than unfinished phd because if you will not use the degree afterwards, it is just a waste of time and energy.",
      "author": "vidmantef",
      "created": 1603286055,
      "upvotes": 2,
      "replies": {
        "g9lm5cr": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9lm5cr/",
          "text": "Be careful who you go to for this chat. I've found a large number of those in the game want others to stay in it. The biggest pushers of phd were the PhDs I worked with. \n\nThen I'd wander out into the world where the support was usually much more balanced.",
          "author": "WDersUnite",
          "created": 1603327032,
          "upvotes": 2,
          "replies": {
            "g9mzw2j": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzw2j/",
              "text": "all my friends and fam say do it cos they're just excited someone they know is doing a phd so they aren't much help lol",
              "author": null,
              "created": 1603367478,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9js1nd": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9js1nd/",
      "text": "Honestly it sounds like you would be best off quitting. It sounds like you're only holding on because you want to be a Dr, and that stems from someone in a position of power telling you when you were a child you would be a failure in life. You think that her Dr title made her not a failure, when in fact most people aren't failures at life and most of them don't have a PhD it even a master's degree. Then there's the odd person with an advanced degree who does end up failing at life.\n\nTherapy and then see how you feel. I think you're doing the PhD for the wrong reasons and then the sacrifices are not going to be worth it.",
      "author": "monster_peanut",
      "created": 1603294155,
      "upvotes": 2,
      "replies": {
        "g9mzxcc": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzxcc/",
          "text": "true",
          "author": null,
          "created": 1603367507,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9jvmum": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jvmum/",
      "text": "Many have left before you and most of the people I know who left are quite happy. If you don't need a PhD then don't do it. Chances that you get an academic career are small. If you can get a job that pays well then go for it. You are only in your first year so you will not lose a lot and you can always do a PhD later in life. Good luck.",
      "author": "frugalacademic",
      "created": 1603295923,
      "upvotes": 2,
      "replies": {
        "g9mzyix": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzyix/",
          "text": "so true tysm",
          "author": null,
          "created": 1603367531,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9jxduo": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jxduo/",
      "text": "Take a leave of absence first and clear your head. \n\nAs far as this goes:\n\n I also have a complex: a high school teacher told me once I would be a failure once in life, and she is OBVIOUSLY wrong, but it stuck with me. That b\\*tchis a dr and I wanted to prove I could be one too. To myself. but why am I allowing this to encompass who I am and what I am worth? \n\nThis is something to probably see a therapist about only because it likely is a foundational belief in not being good enough that you need to unlearn if you want to move forward in your decision either way.",
      "author": "yourmomdotbiz",
      "created": 1603296782,
      "upvotes": 2,
      "replies": {
        "g9mzzqb": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mzzqb/",
          "text": "I took off 6 months and im still confused!",
          "author": null,
          "created": 1603367559,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9k3sx3": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k3sx3/",
      "text": "This is the thing though, \"wanting\" a PhD is not a good reason to get one. Needing a PhD for your chosen career path is really the only good reason to get one. Not accepting this gets people sucked in and they miss out on job opportunities, earning potential, general life, while they prove to themselves they can do it, and what for?",
      "author": "TourmalineTart",
      "created": 1603299856,
      "upvotes": 2,
      "replies": {
        "g9n0bfj": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0bfj/",
          "text": "yessssss this is the thing....but when I rationalise this to myself I get too scared to take the plunge to drop out",
          "author": null,
          "created": 1603367818,
          "upvotes": 1,
          "replies": {
            "g9nl34k": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9nl34k/",
              "text": "Sounds like you should take the plunge tho. One action that may convince you is to tally up your potential salary over the next 5 years as a PhD student vs. working your career of choice. Factor in any debt you may go into to remain in school. Then look for the differences in earning potential for your career of choice with and without a PhD— chances are both that there is no different because it is not required, and also that you can become less likely to get that job because there is such a thing as being over qualified. \n\nNo one can make you stay or leave but you, the semester is ending soon, this is probably a good time to decide.",
              "author": "TourmalineTart",
              "created": 1603380016,
              "upvotes": 1,
              "replies": {
                "g9oki7w": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9oki7w/",
                  "text": "I have done this and it doesn't work out to do a phd unless I wanna be an academic ( I don't, I don't even like teaching)\n\nthanks for this",
                  "author": null,
                  "created": 1603396373,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9k5o95": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k5o95/",
      "text": "I have a similar situation to yours although with slightly different reasons. An hour ago I decided to postpone my phD study for a few years if not more, and I can tell you that I already feel a lot better! You can always go back and get a phD, it's not the end of the world if you decide to do it later or not at all. Your wellbeing and peace of mind should come first, and you can pursue your topic without restrictions and deadlines imposed by your phD.\nI wish you good luck, and fu*k that person that told you you wouldn't achieve anything, you are the main character in your story! :)",
      "author": "domicic1",
      "created": 1603300764,
      "upvotes": 2,
      "replies": {
        "g9n00ts": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n00ts/",
          "text": "awww ty",
          "author": null,
          "created": 1603367583,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9kpm1o": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kpm1o/",
      "text": "Sounds like you should quit. If it helps, you could think of your high school teacher as a loser because they were teaching high school with a Ph.D. Also, getting a Ph.D. doesn't make you a doctor--it gives you the title doctor, yes, but it's just a title. An M.D. makes you a doctor.\n\nIt really bothers me that you chose to call your teacher a \"bitch\"--uncalled for misogyny. Pick some other shitty thing to call her next time?",
      "author": "doctork1885",
      "created": 1603310239,
      "upvotes": 2,
      "replies": {
        "g9n0579": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0579/",
          "text": "lol true\n\nI'm a woman myself and there was misogyny in that. I was in my feelings when I wrote the post. its only really misogyny when a man says it because that stems from centuries of men treating women as objects/animals at their disposal. also im from the hood and a bitch is a bitch if she is mean....!",
          "author": null,
          "created": 1603367679,
          "upvotes": 1,
          "replies": {
            "g9n1ai5": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n1ai5/",
              "text": "Haha fair!!",
              "author": "doctork1885",
              "created": 1603368581,
              "upvotes": 1,
              "replies": {
                "g9n751e": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n751e/",
                  "text": ":-)",
                  "author": null,
                  "created": 1603372514,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9kscqh": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kscqh/",
      "text": "I am a retired professor andhave been a dissertation coach for 30+ years. Academia is not for everyone. People call me on extensions aftet 8, 9, and 10 years. Many of these people have paid up to $6000 a quarter in tuition the entire time. \nThe best advice given to me was from an older, seasoned professor. \"Not everyone is meant to be a PhD.\" \nI cannot give you advice. However, if you called me and told me how you feel, i would not take you on as a client.",
      "author": "Drlynw",
      "created": 1603311568,
      "upvotes": 2,
      "replies": {
        "g9n0upm": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0upm/",
          "text": "oh wow .... thank you that was actually perfect",
          "author": null,
          "created": 1603368240,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9la90e": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9la90e/",
      "text": "[deleted]",
      "author": null,
      "created": 1603320236,
      "upvotes": 2,
      "replies": {
        "g9n07mv": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n07mv/",
          "text": "thank you so much for this. I needed this! and I hope your mum is okay",
          "author": null,
          "created": 1603367733,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9jwkqf": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jwkqf/",
      "text": "It seems to me you are doing this for the wrong reasons. Which will make it really rough...what causes burn out is when the reward isn't worth the effort we put in and that might happen to you since you know your career may not benefit much. Maybe you should work on your own image of yourself and on how you react to how people view you. Do you really want to waste 5 years of your life trying to prove that some random person in your past was wrong? Self esteem issues will not magically disappear if you have 'Dr' next your name. In fact, it may only get worse without proper treatment.",
      "author": "Sea_of_colors",
      "created": 1603296387,
      "upvotes": 1,
      "replies": {
        "g9n08x3": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n08x3/",
          "text": "I agree 100% its just so hard to put into practise",
          "author": null,
          "created": 1603367762,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9jzfye": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9jzfye/",
      "text": "> Is a phd for me?\n\nNo one can answer that for you. That's a bit of a cop out so let me say a couple of other things.\n\nDo *not* let other people decide for you, not us, not that teacher. Even in the guise of \"prove it to myself\" - the way to be a success is to make choices that are best for you, and live your life well. \n\nThe pros you have listed are all itches you can scratch in other careers and through hobbies. Being a Dr in a subject (eg in mathematics) has and should have no significance to the wider world. It is no different to being Senior Manager in a company or what have you - means a lot inside the industry, means nothing in any other context.",
      "author": "l_lecrup",
      "created": 1603297770,
      "upvotes": 1,
      "replies": {
        "g9n0a50": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0a50/",
          "text": "100% true",
          "author": null,
          "created": 1603367790,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9k5hoi": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k5hoi/",
      "text": "I'd say leave at the earliest opportunity.  I knew I didn't want to be an academic but I really wanted to be an expert in this subfield (it also turns out that industry loves this area and pays fresh PhDs really well)...and it's hard enough for me (and my friends in a similar spot) to stay sometimes, even though a PhD unlocks some really awesome jobs in industry in the field.",
      "author": "throwaday-academic1",
      "created": 1603300675,
      "upvotes": 1,
      "replies": {
        "g9n0cmr": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0cmr/",
          "text": "in social sciences?\n\nnot in the UK",
          "author": null,
          "created": 1603367845,
          "upvotes": 1,
          "replies": {
            "g9ntxmy": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9ntxmy/",
              "text": "Yeah, I'm saying it's hard enough to stay in a PhD where we know it can lead to great job opportunities once finished, I can't even imagine starting a PhD that doesn't if I'm not dead-set on becoming an academic.",
              "author": "throwaday-academic1",
              "created": 1603384349,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9k86rr": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k86rr/",
      "text": "If your teacher was so low to talk to her student like that, then she probably isn't happy with her life. If you want to get back at her, then be happy with your own life. A PhD isn't for you if you say it isn't, and you know it isn't because you said it yourself. Don't let someone you won't see again determine your life and ultimately your happiness.",
      "author": "Nyxah95",
      "created": 1603301961,
      "upvotes": 1,
      "replies": {
        "g9lmkc0": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9lmkc0/",
          "text": "Love this. \n\nI have worked with some really horrid PhDs who seem to just wander through life spreading their bitterness. Y'all aren't the poster children you think you are for higher learning 😂",
          "author": "WDersUnite",
          "created": 1603327270,
          "upvotes": 1,
          "replies": {
            "g9n0dq6": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0dq6/",
              "text": "lmao",
              "author": null,
              "created": 1603367868,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g9n0dxv": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0dxv/",
          "text": "tysm <3",
          "author": null,
          "created": 1603367873,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9k8mlh": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9k8mlh/",
      "text": "[deleted]",
      "author": null,
      "created": 1603302167,
      "upvotes": 1,
      "replies": {
        "g9n0epw": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0epw/",
          "text": "anything you can recommend? lol",
          "author": null,
          "created": 1603367890,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9kb9zm": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kb9zm/",
      "text": "Hi Stressedoutpeach1,\nI saw this post and immediately I felt that someone entirely embodied everything I had been feeling for a while now. I read all the comments below and they felt very helpful as well. I recently made a very similar post here and got some advice that told me maybe keep going. But i had been doing a lot of soul searching, a lot of questioning myself and I felt exactly the same as you. I’m starting to feel that I can always go back and get a phd again if I want to and I truly felt like a huge weight has been lifted off my shoulders once I started thinking that way. Also, even the complex you mentioned abt your teacher, i have a similar memory that mostly fueled some of my higher education passion in the past. But once (after many many years and painfully conditioning myself to think this way) i started thinking that nothing, and I mean NOTHING is more important than looking after your health (mental and physical), i started to realize it’s ok to quit sth for pursuing another path if that thing is costing you something much more valuable than whatever it is adding into your life. Anyways, i’m sorry abt this weirdly long and maybe slightly poetic reply, but basically what i’m saying is that since I started thinking it’s ok to leave a phd to pursue sth else for a while and try to do a phd again if you want later in life, I have been feeling the lightest i have felt in a long long time. I suggest that you also sort out your way of thinking and priorities and decide based on that. And do not forget to put yourself and your well-being really high up on that list. Best of luck my pal!",
      "author": "burntoutandconfused",
      "created": 1603303410,
      "upvotes": 1,
      "replies": {
        "g9n0j7z": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0j7z/",
          "text": "awwww tysm for this, im glad we can relate. I do want to feel light. I want that feeling of lightness! I miss that feeling of no extra stress....maybe that's my answer?",
          "author": null,
          "created": 1603367988,
          "upvotes": 1,
          "replies": {
            "g9n29r7": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n29r7/",
              "text": "Ofc! I’m so glad we are able to relate as well! It definitely makes me feel less alone and much less stuck inside of my head and thoughts ahaha",
              "author": "burntoutandconfused",
              "created": 1603369310,
              "upvotes": 1,
              "replies": {
                "g9n71j7": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n71j7/",
                  "text": "yeah its really so intense",
                  "author": null,
                  "created": 1603372454,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9kbefc": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kbefc/",
      "text": "You have made very valid points in your pros vs cons. I’ll keep it short. If you don’t want to be in academia and don’t need this degree for a better career opportunity then it’s not worth sticking it out. Especially because it’s just your first year. Do you really want to miss out on a higher salary, work-life balance for four-five more years when your heart is not set in it? \n\nQuitting a PhD is not Failure. It’s identification of a different path better suited to your goals and following that path. Also if you still want to be a dr. in 5 years time, you can revisit this idea. You’ll be more mature, will probably be more financially comfortable and will have experienced a life outside academia. So at that point you can make a more educated decision about whether the dr. title is important to you and whether you want to pursue it again.",
      "author": "sciencechick92",
      "created": 1603303470,
      "upvotes": 1,
      "replies": {}
    },
    "g9kph8t": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kph8t/",
      "text": "If you have no desire to be in academia, and the PhD won't help you in your career, I'm not seeing any reason you should spend years of your life getting a degree.  (I don't know what your field is, so it's possible that the degree won't even be helpful if you decide to move into a different line of work.)\n\nYou want to show up a high school teacher with a PhD? Bad reason to waste years and potential lost earnings.\n\nKeep in mind, too,  nobody will call you \"Doctor\" in your day-to-day life because you have a PhD. If you're the sort who can't wait to demand random people call you \"Doctor\" at your workplace or while making hotel reservations, that's not really healthy.",
      "author": "Sublime_Porte",
      "created": 1603310176,
      "upvotes": 1,
      "replies": {
        "g9n0syz": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0syz/",
          "text": ">burntoutandconfused\n\nlol I like your last point",
          "author": null,
          "created": 1603368202,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9kz442": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9kz442/",
      "text": "I really think that maybe it would be better just to quit. Doing a PhD only gets progressively more stressful. When you write up it is really really tough and stressful, and most of the time your supervisor is more interested in a million other things than actually helping you with your work(my experience anyway). \n\nI finished my PhD and it was really tough. I often wish I’d just stayed in industry instead, I’d be a lot further on in my career by now if I had and what doing a PhD has confirmed to me is that o do not want to stay in reasearch/academia. Being a Dr is cool but I don’t think it makes up for the slog and mental stress of writing your thesis, especially if you’re not going to use it after. \n\nIf I was in your position and struggling already my advice would be don’t put yourself through it. It’s not worth your mental health.",
      "author": "mothergoosetron",
      "created": 1603314863,
      "upvotes": 1,
      "replies": {
        "g9n0wdx": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0wdx/",
          "text": "sorry you had that experience :(\\\\\n\nty for your advice",
          "author": null,
          "created": 1603368276,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9lgzep": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9lgzep/",
      "text": "I work in a field where a Master's is sufficient to work professionally/successfully, and decided to get a PhD for reasons similar to yours. I am very happy to have completed my PhD, but if you think it's more harmful than helpful, definitely listen to yourself.\n\nThe difference: I want to work in academia. Whereas some fields have good non-academic (e.g., industry) options for PhDs (that compensate for the additional degree), some don't. Since that is one of your 'No's, I would look at the job you want and reverse-engineer the grad experience you need (or don't).",
      "author": null,
      "created": 1603324066,
      "upvotes": 1,
      "replies": {}
    },
    "g9llohj": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9llohj/",
      "text": "I'm not saying dont quit! I'm just saying never give up.. fight for what you want no matter what it is!",
      "author": "Pigwigeon13",
      "created": 1603326765,
      "upvotes": 1,
      "replies": {}
    },
    "g9ln0mk": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9ln0mk/",
      "text": "I’m putting my PhD on pause to switch to a nurse practitioner program. I realized it’s a ridiculous amount of work with minimal payback, while all of my former coworkers were graduating with master degrees and nurse practitioner certification and getting out and working. \n\nI have so many family obligations and it was becoming a delicate balance of either neglecting my family, or turn in substandard work.",
      "author": "GrumpyMare",
      "created": 1603327530,
      "upvotes": 1,
      "replies": {
        "g9n0xvp": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n0xvp/",
          "text": "oh wow good luck! and good for you",
          "author": null,
          "created": 1603368309,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9lu56x": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9lu56x/",
      "text": "Comment on a small part—\nYour anxiety about WIP, the work of the write-up (possibly 3rd/4th year), those all may be reason to STAY in the program... truly may be growth opportunities. \n\nIn contrast, your “not feeling it” about a year of fieldwork,that may be a reason to LEAVE the program... that sort of “forcing myself to go thru the motions because I’m doing the ‘right path’” is not a good place to be...",
      "author": "schizontastic",
      "created": 1603331642,
      "upvotes": 1,
      "replies": {}
    },
    "g9lwxaw": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9lwxaw/",
      "text": "One thing to consider is how much more money you'll make having a PhD, depending on your field it can be way more than without. You have to consider your future earnings as well. It sucks not being able to save up for that stuff because you have to keep studying, but that's a short-term sacrifice for long-term gains.\nI know many people who stopped with an MA and regret it because they reached a ceiling in their career and need a PhD to get higher positions, but again it depends on your field.",
      "author": "bluethirdworld",
      "created": 1603333268,
      "upvotes": 1,
      "replies": {
        "g9n10kf": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n10kf/",
          "text": "yeah the problem with me is cos I don't want to enter academia I will make the same when I graduate (5 years from now) as I could NOW without a phd (or even a masters tbh)",
          "author": null,
          "created": 1603368367,
          "upvotes": 1,
          "replies": {
            "g9n56pj": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n56pj/",
              "text": "Fair enough. You can also consider that in the future you may want to change your specific job but in the same field, or that the qualifications will get higher over time, in which case a PhD wouldn't hurt. Now academia seems unappealing but who knows about later in life. Of course it was quite different for me because I did a PhD tovget into academia, so I might be biased!  Lol... good luck",
              "author": "bluethirdworld",
              "created": 1603371290,
              "upvotes": 1,
              "replies": {
                "g9n72yu": {
                  "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n72yu/",
                  "text": "lol ty!",
                  "author": null,
                  "created": 1603372479,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9m38ba": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9m38ba/",
      "text": "[deleted]",
      "author": null,
      "created": 1603337206,
      "upvotes": 1,
      "replies": {
        "g9n118t": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n118t/",
          "text": "so true I have seen this a lot",
          "author": null,
          "created": 1603368381,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g9mb67a": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mb67a/",
      "text": "when a high school teacher tells a student that they’re going to fail at life, the teacher has already failed as a teacher. the teacher sounds like a miserable person. you are already better than the teacher because you seem really empathetic and sweet. you don’t need a phd to prove something. start working, save up for things, and do what makes you happy! happiness is the true answer to success. please don’t be hard on yourself for taking a better path for yourself. be proud of yourself! i am studying to be a teacher now because i had some horrible teachers in my past too. lets beat their negativity with happiness! be kind to yourself. i am proud of you :)",
      "author": "d0lltee",
      "created": 1603342943,
      "upvotes": 1,
      "replies": {
        "g9n126s": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n126s/",
          "text": "awwww tysm love this so much",
          "author": null,
          "created": 1603368402,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9mwrh1": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9mwrh1/",
      "text": "wow first of all - thank you all for all the replied. i am really shocked at how many replied this got. i guess a lot of people have been through this? i am going to try and reply to everyone",
      "author": null,
      "created": 1603364728,
      "upvotes": 1,
      "replies": {}
    },
    "g9oex7g": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9oex7g/",
      "text": "The best advice I have ever received about making a big decision is to flip a coin and spend one week with the \"decision\" that the coin gave you. Don't tell anyone about this, just live with the idea that the decision has been made. By doing this, you will start to having feelings about your path forward. Maybe relief, maybe sadness. But take time to work through these. You will learn a lot about what you really want. At the end of the week, if you are feeling good about the decision, you can stick with it, or you can take the next week to live with the opposite decision.\n\nI've used this with several big decisions in my own life, and it has helped me a lot. I hope it might do they same for you.",
      "author": "Broccolisa",
      "created": 1603394070,
      "upvotes": 1,
      "replies": {
        "g9okd71": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9okd71/",
          "text": "hmmm wow this is super interesting I might try this",
          "author": null,
          "created": 1603396311,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9lsjud": {
      "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9lsjud/",
      "text": "DON'T QUIT. you can analyse and theorise how much ever you want in not continuing with it. But remember , you have one life and whether you like it or not, our complexes make us who we are. If you want to prove yourself do it. You are the enemy not any of the reasons you mentioned.",
      "author": "Direct-Teacher8581",
      "created": 1603330718,
      "upvotes": 1,
      "replies": {
        "g9n13bm": {
          "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/g9n13bm/",
          "text": "but what if a big part of me doesn't even want to do it? this is what my post is about",
          "author": null,
          "created": 1603368427,
          "upvotes": 1,
          "replies": {
            "ga4exse": {
              "link": "/r/AskAcademia/comments/jfbqej/i_am_so_torn_about_qutting_my_phd/ga4exse/",
              "text": "If you are sure that PhD is not for you, then don't waste even a day more.",
              "author": "Direct-Teacher8581",
              "created": 1603674029,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}