{
  "sid": "r01ey6",
  "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/",
  "title:": "How do you find people to talk to about your subfield?",
  "text": "I'm in my fifth year of my Ph.D. I know OF a lot of people in my field, but there aren't really conferences for my specific subfield. I don't know how to talk to them in a way that feels normal. Do other people find this frustrating? \n\nI'm at the point where I want to build a new social media platform for academia to find ppl based on my endnote library lol",
  "author": "dancedance__",
  "created": 1637630775,
  "updated": 1637688570,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hlpphay": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlpphay/",
      "text": "This is how new conferences start. Reach out to paper authors in your sub field and see if you can pull a little symposium together",
      "author": "Sad-Dot9620",
      "created": 1637631035,
      "upvotes": 9,
      "replies": {}
    },
    "hlpzvwl": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlpzvwl/",
      "text": "In my field, it's how a new section at an existing conference starts.",
      "author": "CruxAveSpesUnica",
      "created": 1637635882,
      "upvotes": 5,
      "replies": {}
    },
    "hlrf14f": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlrf14f/",
      "text": "Cold emailing for a quick zoom chat costs almost nothing, and academics generally LOVE any attention to our respective work. \n\nTo argue the other side though, I would like to see more interdisciplinary points of connection. My PhD is in education, and I recently spent some years with engineers. I learned loads of things, and I was also struck by what was obvious in my field but not in theirs. Seems academia needs more of that and less of folks thinking their phd in X makes them qualified for ABCDEF, and G.",
      "author": "octaviousearl",
      "created": 1637671259,
      "upvotes": 2,
      "replies": {
        "hlrujce": {
          "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlrujce/",
          "text": "Yessss! I love the idea of being able to visualize all the people I’m vaguely related to. My field is very interdisciplinary and I’ve gone down rabbit holes to a ton of different sub fields and I’d love to be able to casually chat about ideas to ppl in them",
          "author": "dancedance__",
          "created": 1637679236,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlrlxcy": {
      "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlrlxcy/",
      "text": "Umm my field has a twitter hashtag and I totally interact with people on there.",
      "author": "maps1122",
      "created": 1637675143,
      "upvotes": 1,
      "replies": {
        "hlrorat": {
          "link": "/r/AskAcademia/comments/r01ey6/how_do_you_find_people_to_talk_to_about_your/hlrorat/",
          "text": "Have you met grad students from labs you don’t know that way?",
          "author": "dancedance__",
          "created": 1637676579,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}