{
  "sid": "qlnvf5",
  "link": "/r/AskAcademia/comments/qlnvf5/do_commendation_letters_help_professors_achieve/",
  "title:": "Do commendation letters help professors achieve tenure?",
  "text": "I’m looking to write one of my professors a letter. Wanted to know if it would actually make a difference.",
  "author": "Professional-Pop-927",
  "created": 1635918311,
  "updated": 1636136922,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hj537yd": {
      "link": "/r/AskAcademia/comments/qlnvf5/do_commendation_letters_help_professors_achieve/hj537yd/",
      "text": "If students say nice things about the faculty member, it gives the department and chair something else to mention in their letter to the higher-level committees. It’s not make or break. But it can be one more arrow in the quiver, so it’s nice to have. I know that comments from my grad students when I was nominated for a teaching award were mentioned favorably in my letters when I went up.",
      "author": "EconGuy82",
      "created": 1635943396,
      "upvotes": 3,
      "replies": {}
    },
    "hj4bdjw": {
      "link": "/r/AskAcademia/comments/qlnvf5/do_commendation_letters_help_professors_achieve/hj4bdjw/",
      "text": "Depends on the tenure committee if they take student commendation into account.\n\nFor most part, the Prof's performance as a researcher (publications record) and teacher (total credits taught) is the main consideration.",
      "author": "Wise-Replacement7286",
      "created": 1635922426,
      "upvotes": 2,
      "replies": {}
    },
    "hj6imtk": {
      "link": "/r/AskAcademia/comments/qlnvf5/do_commendation_letters_help_professors_achieve/hj6imtk/",
      "text": "If you're at a smaller college where professors mostly teach, it can help quite a bit. \n\nIt certainly won't hurt them. So go ahead and write the letter.",
      "author": "apple-masher",
      "created": 1635964036,
      "upvotes": 2,
      "replies": {}
    },
    "hj4bb7r": {
      "link": "/r/AskAcademia/comments/qlnvf5/do_commendation_letters_help_professors_achieve/hj4bb7r/",
      "text": "It's a nice gesture, but I doubt it'll make a difference, unless the professor is at a teaching focused institution. At a research focused institution, excellent teaching will not save the tenure case of a professor with mediocre research.",
      "author": "mleok",
      "created": 1635922372,
      "upvotes": 1,
      "replies": {}
    }
  }
}