{
  "sid": "qlhsjp",
  "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/",
  "title:": "Question about name formatting for poster presentation and potentially future publications",
  "text": "Alongside a partner, I have been working on an for a poster presentation that is due at the end of the week. Today during a team meeting the topic of names came up. As of right now my name is just [first name] [last name] with no middle name. As a first generation college student, I’ve thought a lot about the efforts and sacrifices *both* of my parents have made in order to help me get this far. I’ve thought a lot about changing my last name to be [first name] [last name]-[mothers surname] so that if I’m ever published both of my parents family names are there. I wanna go through with it, it’s just a tedious process that I haven’t done yet. Would it be ok to submit this abstract under the latter last name-surname even though it’s still not my legal name? Just want to make sure I don’t run into any issues. Thanks in advance to anybody that answers my question! Hope I used the correct flair but if not please fe",
  "author": "iwenttoberkley",
  "created": 1635897399,
  "updated": 1636136926,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hj303jp": {
      "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/hj303jp/",
      "text": "No one has ever asked me for ID for publication. I go by my maiden name at the office since that's what I started publishing on. I usually advocate others to publish their name as they want, 2 last names, hyphenated, middle initial - up to you from perspective but I'm not a lawyer or a journal editor so take that into account",
      "author": "Sea-Palpitation-4796",
      "created": 1635898471,
      "upvotes": 3,
      "replies": {
        "hj4p0zk": {
          "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/hj4p0zk/",
          "text": "Perfect. Thank you! I definitely want to use the hyphenated so I thought it made sense to do so from the very beginning",
          "author": "iwenttoberkley",
          "created": 1635934362,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hj31tyl": {
      "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/hj31tyl/",
      "text": "I think as long as you are consistent in using it and use ORCID, there should not be a problem.\n\nBut do check with your university. They should have someone who can give you advice regarding publication name.",
      "author": "Wise-Replacement7286",
      "created": 1635899186,
      "upvotes": 2,
      "replies": {
        "hj4p3np": {
          "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/hj4p3np/",
          "text": "Thanks, I’ll check with somebody in the university just in case!",
          "author": "iwenttoberkley",
          "created": 1635934422,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj3f93n": {
      "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/hj3f93n/",
      "text": "In most cases, it won’t matter. People’s names change sometimes and it’s not a huge deal. The one issue may be if you’re not a citizen of the country you work in. In that case, you probably want to use your legal name just to make sure it doesn’t lead to any issues later on when it comes to immigration.",
      "author": "EconGuy82",
      "created": 1635904744,
      "upvotes": 1,
      "replies": {
        "hj4p4xv": {
          "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/hj4p4xv/",
          "text": "I’m a citizen so that won’t be an issue, thank you!",
          "author": "iwenttoberkley",
          "created": 1635934449,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj4nvfh": {
      "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/hj4nvfh/",
      "text": "It's important all your papers are under the same name including initials for ease of finding them, I have known people who've kept their maiden name at work for this reason.",
      "author": "nickbob00",
      "created": 1635933421,
      "upvotes": 1,
      "replies": {
        "hj4p7il": {
          "link": "/r/AskAcademia/comments/qlhsjp/question_about_name_formatting_for_poster/hj4p7il/",
          "text": "Yeah that’s why I wanted to do the hyphenated from the very beginning just to avoid using multiple names. Just wanted to make sure it was ok since I haven’t legally made that change yet. Thank you!",
          "author": "iwenttoberkley",
          "created": 1635934504,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}