{
  "sid": "qma3an",
  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/",
  "title:": "Can professors refuse to give you a reference?",
  "text": "Can they? I'm currently less than month away from the deadlines on my earliest PhD application, have contacted some professors from my undergrad uni (I'm now doing a masters) and have heard nothing. My email was long, admittedly, but very respectful - it asked for their advice on my proposed research project and then whether they could write me references/letters of recommendation for my applications. That was a week ago, and I still haven't heard from them. Is it common for professors to be hard to contact like this. Is it a sign that they won't write me a reference? Does that sort of thing happen often, and what should I do if they don't? I'm getting quite concerned.\n\nEDIT: Thanks for your comments everyone. It seems as though what I thought a reference is and what it actually is are two different things. I also didn't realise quite how busy academics are. That said, I must admit I have been a little upset by some of the feedback I've been receiving. I'm not entitled. I don't think I'm owed a reference (although I do think it would be kind of a prof to give me one). And thinking that just under a month was a decent notice period isn't me giving my professors a 'fuck you' but an honest misconception. So please be a little kinder to me. I was hoping to get some useful advice from this thread. As it stands I've found many of the replies unduly harsh and even quite upsetting.",
  "author": "FlexMissile99",
  "created": 1635990931,
  "updated": 1636136899,
  "over_18": false,
  "upvotes": 71,
  "upvote_ratio": 0.72,
  "comments": {
    "hj8d2zx": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8d2zx/",
      "text": "You may want to send a gentle, short, reminder.\n\nYou emailed during a very busy period. And a potentially lengthy email. Frankly, a ton of them may have lost interest while reading through your proposed research project. \n\nBut yes, silence could mean no. I would respond (positively or negatively), but some simply don’t.",
      "author": "EconomistPunter",
      "created": 1635991399,
      "upvotes": 97,
      "replies": {
        "hjahxko": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjahxko/",
          "text": "Good advice with the gentle reminder email. Profs get tons of emails a day and sometimes it’s innocent when they don’t respond.",
          "author": "Roadkill_Bingo",
          "created": 1636039069,
          "upvotes": 5,
          "replies": {
            "hjbfxdh": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjbfxdh/",
              "text": "Yes. The longer the email & the more time it takes me to make sense of the ask, the more likely it is that I’ll skim the email while going through my inbox in the morning but not reply right away. Ideally, then, it gets marked as unread again and I come back to it later in the day/week when I have the time to do it justice.\n\nBut maybe 5% of the time, I miss marking it as unread, and the email slips below the fold and I forget about it. Usually that has nothing to do with my willingness to do the task or interest in the person emailing!\n\nI get a lot of email, and sometimes things slip through the cracks. I always appreciate a follow-up “hey, just wanted to bump this in your inbox” if it’s been a few days.",
              "author": "elizzybeth",
              "created": 1636052258,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "hj9z640": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9z640/",
          "text": "Yeah that could mean no, I had one professor who I askes for LORs and they kept dodging me. I felt like I kept burning out the same 3 so I wanted to try 4. Their answer was “other 3 could give you a better letter of recommendation because they know you better” I was in this reluctant professor’s class for the same amount of time as the other 3 professors.",
          "author": "rabbitpiet",
          "created": 1636030958,
          "upvotes": 15,
          "replies": {
            "hjahwev": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjahwev/",
              "text": "The professor was politely telling you that they couldn't write a positive letter about you.",
              "author": "flipester",
              "created": 1636039056,
              "upvotes": 26,
              "replies": {
                "hjb9iwc": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjb9iwc/",
                  "text": "Yeah it took me a while to realize it and it was definitely the more polite way to not say it.",
                  "author": "rabbitpiet",
                  "created": 1636049738,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hj8k64f": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8k64f/",
      "text": "Yes.  There's no requirement for anybody to provide a reference.\n\nLetters are a lot of work for professors, especially if they have a lot of letter requests and especially if they're teaching this semester.  You could write a reminder letter, but if you don't hear back you may need to find some additional references.",
      "author": "Decisionsota",
      "created": 1635994805,
      "upvotes": 67,
      "replies": {}
    },
    "hj8kjzz": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8kjzz/",
      "text": "If a professor doesn't want to give you a reference, the last thing you want is for them to give you one. A bad letter is a death sentence to a grad school application. That's why most professors will tell you directly if they think they won't be able to write you a strong letter.\n\nI would send a followup email, but I would also prepare for them to potentially not be able to write you a letter. Writing a letter (especially for a student from a few years back) is not easy. You have to look over their work again, read their statement of purpose/research statements, and so on. It's not guaranteed that they will be able to write one on short notice.",
      "author": "BandiriaTraveler",
      "created": 1635994998,
      "upvotes": 41,
      "replies": {
        "hj92a8b": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj92a8b/",
          "text": "I know a guy who had a bit of a falling out with his dissertation committee chair a year or two after his PhD, and the latter went silent when the dude was on the market again. So this guy went over his head and contacted the Dean of the college to get him to pressure the chair to write a letter. \n\nI can only imagine what was in it…",
          "author": "EconGuy82",
          "created": 1636006091,
          "upvotes": 27,
          "replies": {
            "hj9j07x": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9j07x/",
              "text": "Oof",
              "author": "ilovemacandcheese",
              "created": 1636020763,
              "upvotes": 10,
              "replies": {}
            },
            "hja3vfh": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja3vfh/",
              "text": "Yeah but having an advisor who won’t write a rec letter is a professional death sentence. I would’ve done the same. I doubt the letter was bad if the chair was pressured from the dean. Unless there’s a crazy anomaly, the expectation is that your advisor writes your rec letters. It’s part of chairing a diss",
              "author": "tallulahQ",
              "created": 1636033200,
              "upvotes": 5,
              "replies": {
                "hja5kqs": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja5kqs/",
                  "text": "My guess is that it was around a one-page letter that said “This is a letter for xxxxx. I chaired his dissertation. His dissertation was about this. Please call me if you would like more information.”\n\nAnd that’s also a death sentence. \n\nThis guy was a couple years out, and had had predocs and postdocs, so he didn’t necessarily have to have his committee chair writing for him at that point.",
                  "author": "EconGuy82",
                  "created": 1636033964,
                  "upvotes": 12,
                  "replies": {
                    "hja6ftg": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja6ftg/",
                      "text": "Fuck that’s awful. Sometimes advisors can be really narcissistic. Not saying it’s always the advisor’s fault. Plenty of oblivious grad students who suck to work with. I’ve known people who have had terrible advisors though and it really fucks people over to have to rely so much on one person for so long",
                      "author": "tallulahQ",
                      "created": 1636034348,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hjalndu": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjalndu/",
          "text": "My undergrad advisor, who in hindsight was a huge jerk, told me that he wrote “she’s not the smartest student I’ve ever had, but she’ll finish the program if you admit her” in his letter for me. I mean, it’s bad enough to write that, but then a whole other thing to tell me to my face after the damage is done. \n\nHe also told me that he wrote in my boyfriend’s letter “he is the smartest student I’ve ever worked with in my life, but he will absolutely drop out of the program if you admit him”. The worst part was that he was right lol.",
          "author": "HNSUSN",
          "created": 1636040503,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hj8dk8h": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8dk8h/",
      "text": "Word of advice: give a lot more notice next time. A reference is not a quick and thoughtless task.. if you want them done well, you need to A) reach out to professors you *know* relatively well and B) give them a good amount of notice; min. a month..",
      "author": "Hopeful__Historian",
      "created": 1635991620,
      "upvotes": 119,
      "replies": {
        "hj8jd0s": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8jd0s/",
          "text": "Ah. It seems this is where I'm going wrong, then, I assumed 3 and a half weeks would be a decent amount of time (mainly because I assumed most references are tweaked copypastas).",
          "author": "FlexMissile99",
          "created": 1635994395,
          "upvotes": -39,
          "replies": {
            "hj8lbmi": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8lbmi/",
              "text": "Is that the kind of reference you want?",
              "author": "Doctor_KM",
              "created": 1635995382,
              "upvotes": 48,
              "replies": {
                "hj8qg62": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8qg62/",
                  "text": "I've never had another type of reference letter tbh",
                  "author": "doornroosje",
                  "created": 1635998144,
                  "upvotes": 35,
                  "replies": {
                    "hj8r6a2": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8r6a2/",
                      "text": "That's disappointing to hear. I research the program a student is applying to, read all of their materials to look for points I can similarly highlight, and try to craft a very focused and specific reference that paints then explicitly as the best candidate for ______________. If they're doing less, they probably just shouldn't write the letter.\n\nBUT, that quality of letter, fit in among all my other work, needs 4-6 weeks notice, minimum.",
                      "author": "Doctor_KM",
                      "created": 1635998563,
                      "upvotes": 45,
                      "replies": {
                        "hj8vw27": {
                          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8vw27/",
                          "text": "It's also relative to how well you know the student. A weaker relationship means they have less to say about you. \n\nAlso, a lot of people will agree to write a letter even though they don't think they're the best person to do it. One of the best things a former professor of mine did was be honest and tell me that they didn't think they could write a good letter.",
                          "author": "set_null",
                          "created": 1636001446,
                          "upvotes": 23,
                          "replies": {}
                        },
                        "hj9desx": {
                          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9desx/",
                          "text": "I think references are very different between different cultures. I know my co-supervisor described writing references for American programs as having to be very over-the-top in their descriptions as if the person was the 2nd coming of Jesus. But he asked my main supervisor when writing a LOR for a student going to a French program, and it was to be much less flamboyant in its praise.\n\nGetting it the wrong way around would probably lead to either one being laughed at and thrown out.",
                          "author": "slick3rz",
                          "created": 1636015861,
                          "upvotes": 8,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hj8rj37": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8rj37/",
              "text": "I gave my letter writers a 4 month notice. Three weeks is nothing and very last minute.",
              "author": "adorationn01",
              "created": 1635998766,
              "upvotes": 19,
              "replies": {
                "hj8w7rk": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8w7rk/",
                  "text": "That worked in the opposite direction for one of my letter writers. I started a bunch of applications right when they opened and filled in all the reference info so they'd get the notifications. Then when the deadline came up I started getting a lot of emails saying \"Reference X has not yet submitted their letter.\" She'd just plain forgotten and was not very happy about having to write everything all at once. \n\nI'll admit that's still on me though. I should have checked in long before then to remind them.",
                  "author": "set_null",
                  "created": 1636001665,
                  "upvotes": 12,
                  "replies": {
                    "hj8yakl": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8yakl/",
                      "text": "That’s why you send reminders. I sent reminders periodically and checked in to ask if there was anything they needed from me.",
                      "author": "adorationn01",
                      "created": 1636003094,
                      "upvotes": 18,
                      "replies": {
                        "hj8zf3s": {
                          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8zf3s/",
                          "text": "Yeah, this one person in particular didn't receive reminders because I wasn't actively communicating with them like my other references, so I just dropped the ball. One of the others was my boss at the time, so I literally saw him five days a week, while the third was a professor I already regularly kept in touch with.",
                          "author": "set_null",
                          "created": 1636003902,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "hj8xzhi": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8xzhi/",
                      "text": "Forgetting happens, but that doesn’t seem like that’s on you.",
                      "author": "gugabalog",
                      "created": 1636002878,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hj8u4rz": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8u4rz/",
              "text": "I like how you were told ‘a month’ by the comment group here, and you defensively came back with ‘well I assumed 3.5 weeks was fine’. You seem to think you are owed something here.",
              "author": "ohnoyoudin",
              "created": 1636000333,
              "upvotes": -2,
              "replies": {
                "hj90ti6": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj90ti6/",
                  "text": "Dude. Are you capable of writing a comment that isn't a flame? Literally both your posts have amounted to 'fuck you you're entitled'. If you've got that from my posts, well then fair enough. But I really think that's a difficult inference to draw. \n\nClearly, I got the timings wrong. It wasn't intentional. I thought the span I gave, which is literally a few days (4 days, maybe) under a month was reasonable. Most commenters think it wasn't, or isn't. And that's fine. I'm not the one making the call here after all. But you can tell me I've got my timings wrong politely, note my timescale is at odds with professors workloads, without being a jerk about it. \n\nLike, it's humanly possible.",
                  "author": "FlexMissile99",
                  "created": 1636004947,
                  "upvotes": 9,
                  "replies": {
                    "hj9ii32": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9ii32/",
                      "text": "I think your problem wasn't really the timing but that you had a long email asking for a bunch of advice as well as a recommendation. They probably got overwhelmed with everything you're asking for and just closed your email. \n\nWhen you ask for a recommendation, you're asking for a significant commitment. Asking for that *as well as* advice about all this other stuff is going to be overwhelming. Keep it simple with a recommendation request. Don't try to *make conversation* by asking them to also do a bunch of other stuff for you. Also make sure you're asking professors that you've made some personal relation with, who has some individualized knowledge of your abilities.\n\nIf I got a long email from someone who I can't remember as a former student, asking for advice about this and that, I'd probably just immediately trash it or possibly go off and do something, intending to read it when less overwhelmed, but forgetting to come back.",
                      "author": "ilovemacandcheese",
                      "created": 1636020343,
                      "upvotes": 27,
                      "replies": {}
                    },
                    "hj926xh": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj926xh/",
                      "text": "Hey OP, a lot of people are going to read this after being familiar with the process and it will seem insane that you asked for letters so close to your application deadline when these aren't even professors you've been in close contact with. That's all that's going on here. Now you now better for next time. I hope you hear back from at least one of the professors soon, though, and I would try following up with a shorter email lol",
                      "author": "figuringthingsout--",
                      "created": 1636006018,
                      "upvotes": 16,
                      "replies": {}
                    },
                    "hj98gia": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj98gia/",
                      "text": "Sorry, can someone please explain the actual value of these letters in the application prosess? I am a European professor btw, and an outsider to the US system.\n\nIt seems to me that these letters are often written by professors without close contact/personal knowledge about the candidate, who have to craft a personalized text explaining why this particular applicant is perfect for just this position.\n\nAnd it is clear that this is a mandatory part of any PhD application, while it is at the same time not a recognised part of the professors’ paid work time.\n\nHaving sat in a fair amount of PhD selection committees, I would think that such a constructed collection of half-fake «praise» for a student you barely know is competely useless, and a waste of everyone’s time?",
                      "author": "toru_okada_4ever",
                      "created": 1636011356,
                      "upvotes": 7,
                      "replies": {
                        "hj9au04": {
                          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9au04/",
                          "text": "A fair number of European programs also ask for letters of reference (although in my experience, it is literally impossible to ask for a specific tailored letter, providing all my application materials,  \"more than a month\" before the position is even posted - almost everything I've seen in my field in Europe is open for about 3 weeks max). I assume they are essentially a way to get a (rosy) preview of the applicant's references as an additional piece of information in the initial sort. They will still call the references for the top candidates.\n\nAnecdotally, I have found that my European references are much, much more likely than my American references to ask the applicant to write the first draft and less likely to be concerned about whether the letter is sealed from the student. I know zero students who actually *want* to draft their own recommendation letters. \n\nIf the student does not have references who know them well enough to write a detailed, personalized later...they are probably out of luck because they don't have good references. In one of my previous jobs I helped my boss go through internship applications and there are definitely ways to tell which recommendations are sincere and backed up with concrete examples and which are formulaic fluff or subtly backhanded. Some of the phrases in the subtly backhanded ones are seared into my memory...",
                          "author": "threecuttlefish",
                          "created": 1636013498,
                          "upvotes": 8,
                          "replies": {
                            "hj9e8pv": {
                              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9e8pv/",
                              "text": "Please share the phrases!",
                              "author": "toru_okada_4ever",
                              "created": 1636016633,
                              "upvotes": 2,
                              "replies": {
                                "hj9exee": {
                                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9exee/",
                                  "text": "Oh man, the one that really struck me was along the lines of \"polishes the nail instead of pounding it in.\" Just...Ouch. (I mean, if I would say that about someone, I wouldn't write the letter, but that's me...)\n\nI'm sure people who have read through rec letters more recently than me could come up with others!",
                                  "author": "threecuttlefish",
                                  "created": 1636017247,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "hj9tjd5": {
                          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9tjd5/",
                          "text": "They are not supposed to be about someone you couldn’t pick out a a lineup.\n\nPresumable someone applying to a grad program did something (worked in a lab, did an honors thesis, independent study ,capstone project , was in multiple high level seminars etc) where you can speak to their character and traits that would indicate they could be successful in a grad program.\n\nSo If I can say, X got good grades but also deals with problems and failures in the lab but trouble shooting and views this as a joy rather than a drama, dont you want that person?\n\nSomeone who has no letters other than X was in my class and got good grades and didnt’ kick puppies also tells you a lot about that person.\n\nI had to have personal references to get into my European PhD though some were contacted and only one was a formal letter.",
                          "author": "PersephoneIsNotHome",
                          "created": 1636027945,
                          "upvotes": 5,
                          "replies": {}
                        },
                        "hj9scdl": {
                          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9scdl/",
                          "text": "For my UK applications, my letter writers were 1) my director of studies who had also been a lecturer in several of my courses over 3.5 years and with whom I'd discussed my research ambitions (vaguely, as he was in a different area), and more importantly 2) my masters research supervisor who had also supervised a couple of summer research projects that I'd done. So I'd say they were very much able to attest to my suitability as a PhD candidate.\n\nBut I fully get your point, because when I see questions like this from people who are asking (for example) a professor who taught them one course that they did well on for a letter, it always seems odd to me that this person is meant to have a good sense of the student's ability to do graduate research on the basis of their performance in one specific taught course.",
                          "author": "foibleShmoible",
                          "created": 1636027250,
                          "upvotes": 2,
                          "replies": {
                            "hj9tu6h": {
                              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9tu6h/",
                              "text": "> I see questions like this from people who are asking (for example) a professor who taught them one course that they did well on for a letter \n\nThis is a misunderstanding on the part of many students .  That is not who you should get a letter from.\n\nBut students who do nothing else and dont participate in class and havent done anything to show they would be suitable for whatever they want to do still ask.",
                              "author": "PersephoneIsNotHome",
                              "created": 1636028119,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "hja4iak": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja4iak/",
                      "text": "People here are being insane. Great for them, glad they know the ins and outs of academia, but I didn’t know a single person who’d gone to grad school except professors before I applied and I had no idea what I was supposed to do. It’s a totally honest mistake.",
                      "author": "kayelar",
                      "created": 1636033487,
                      "upvotes": 5,
                      "replies": {
                        "hjb26v2": {
                          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjb26v2/",
                          "text": "I see students in your situation all the time - because they have asked their professor for advice on applying to grad school.  Our faculty even help students polish their statements for other grad school applications.  Tbh, students who \"have no idea what to do\" because they haven't learned to use academic resources,  like faculty, are far less likely to succeed in a graduate program.",
                          "author": "Readerokie",
                          "created": 1636046872,
                          "upvotes": 1,
                          "replies": {
                            "hjboxl4": {
                              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjboxl4/",
                              "text": "I talked to my professors, had long meetings with them about applying to grad school before. Talked to a prof in the program I was applying to on the phone. Still didn’t really get how things worked. By the time I applied I was a waitress at a diner and didn’t think it was okay to ask an old professor who was already busy for help. I had profs very close to me who happily wrote letters for me, but I was lucky that my honors program pretty much told us that we had an open invitation to request a letter whenever we needed one. \n\nI also had no idea what people did to pay for school. Sure, I had a TA position, but what about rent? I didn’t realize everyone took out loans and just dealt with it, I am from Arkansas where they will give you a full ride with room and board if you get a 32 on your ACT so that wasn’t something I knew anything about. Some girl took me aside during the open house when she noticed how out of place I felt and explained to me how people pay for school. I felt like an idiot. \n\nI’m a chronic over-researcher and I am decent at navigating “the system” but if you’re unfamiliar with academia or even the culture of the coasts (unpaid internships, looking down on state schools, etc) then you might ask some stupid questions. And that’s fine.",
                              "author": "kayelar",
                              "created": 1636055799,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "hjbgzsi": {
                              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjbgzsi/",
                              "text": "That's harsh. I had kids and a job during undergrad and had to figure stuff out for myself, my only benefit was that my professors knew me (probably because there weren't many students with kids, and they only found out when I had to miss because kids were sick). I'm doing pretty well in my PhD program despite the pandemic. \n\nIf a student is able to figure out what to do without that guidance, to me it seems like they'll do okay in a grad program.",
                              "author": "mastid",
                              "created": 1636052680,
                              "upvotes": 0,
                              "replies": {
                                "hjbn4tj": {
                                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjbn4tj/",
                                  "text": "You've missed my point. Sure, you can do the minimum in terms of outreach and communication with faculty and maybe still get into a program. But the best grad students I've seen, first-gen or not, use the resources they have - including office hours and faculty mentors. If they don't know, they ask. Going it on your own isn't some stamp of approval, it tells me that the student lacks the initiative to do their due diligence fully.",
                                  "author": "Readerokie",
                                  "created": 1636055099,
                                  "upvotes": 2,
                                  "replies": {
                                    "hjc6rcj": {
                                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjc6rcj/",
                                      "text": "How are you supposed to get a faculty mentor?",
                                      "author": "mastid",
                                      "created": 1636062852,
                                      "upvotes": 1,
                                      "replies": {
                                        "hjc8n5n": {
                                          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjc8n5n/",
                                          "text": "Go to the office hours of a Professor whose area you're interested in. Ask questions, get recommendations for reading to expand your understanding of their field. Talk to them about research opportunities, ask for advice on graduate programs, etc.\n\nIn an ideal situation, this relationship develops naturally, when a very interested student takes several courses with the same professor, gets to know them and their area, gets the professor to advise on a major research project like a capstone, independent study, undergrad thesis (this is for Humanities fields). At that point, if you're good, your mentor might suggest you present at an undergraduate conference, etc. They should be able to guide you roughly through the application process too.\n\nAt that point, they should know your abilities and interests very well, and be able to write a long, detailed, hopefully glowing letter of recommendation.",
                                          "author": "Readerokie",
                                          "created": 1636063626,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hj9ok79": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9ok79/",
      "text": "Prof here:[How to Ask For A Letter of Recommendation](https://youtu.be/PJZwQZsoqE0)\n\n\\^ Made this for my students for this very process. I think faculty often assume students know the unspoken rules of asking for a letter of rec. I didn't when I was an undergrad/grad student.",
      "author": "Mtt76812",
      "created": 1636024857,
      "upvotes": 25,
      "replies": {
        "hjao9qk": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjao9qk/",
          "text": "Nice video! I will be glad to share it around.\n\nI saw one of the comments under your video mentioned that they were asked to draft their own recommendation letter. Actually, I have been drafting my own recommendation letters for my advisors and they will afterwards polish and sign the letters for me. Granted, I was a PhD student, so it would be important for me to learn how to write recommendation letter as I might one day need to write one for someone else. It is probably too much to ask from an undergrad though.",
          "author": "Purpleprint24",
          "created": 1636041520,
          "upvotes": 2,
          "replies": {
            "hjariv3": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjariv3/",
              "text": "Thank you! \n\nAnd totally agree. The first time I had to write a letter of rec., I realized I had no clue how to do it. It would have been nice to have written one for myself before doing it for someone else.",
              "author": "Mtt76812",
              "created": 1636042773,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hjalwuv": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjalwuv/",
          "text": "Thanks, that's a great resource, I should point my students to that video.",
          "author": "mleok",
          "created": 1636040604,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj8h3j6": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8h3j6/",
      "text": "Here's the thing. You don't want them to write a letter that they don't want to write. It won't be a good letter, and that will tank you. \n\nBut we're not at that stage of assumption yet. They could have just gotten busy and not gotten back to you. As a professor I can attest that it is VERY easy for e-mails to get lost in the flow. I'll see something, I'll think, oh I should respond to that, then a metaphorical squirrel will run by, I'll be distracted, and I've since marked it \"read\" and it sinks under the weight of other e-mails. It happens. \n\nYou should try to reestablish contact — to send them a SHORT e-mail that speculates that your e-mail might have gotten lost in their no-doubt overflowing inbox. Be concise, friendly, and assume the best. It might include a very obsequious apology about having not given them a whole lot of time, a note that you REALLY value their time, a wistful recollection that you thought of them because they were so GREAT with you as a student and really INSPIRED you, and so on. Lay it on — you need something from them, they hold all the cards. Flattery can work if it feels genuine. \n\nIf they still don't get back to you — well, time to re-strategize, and quick.",
      "author": "restricteddata",
      "created": 1635993291,
      "upvotes": 58,
      "replies": {}
    },
    "hj9z551": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9z551/",
      "text": "The comments you're getting are all over the place, but I really think the only issue is that you buried your request for a reference under a bunch of other paragraphs. They may not have even noticed the request to review. Even if they did, it might be hard for them to reply because instead of writing \"Sure, I'm happy to write a letter.\" they feel that they need to respond to all the other stuff you wrote. Try writing a reminder, but keep it short.",
      "author": "ProfOnTheMove",
      "created": 1636030944,
      "upvotes": 13,
      "replies": {}
    },
    "hja6vfo": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja6vfo/",
      "text": ">My email was long, admittedly, but very respectful - it asked for their advice on my proposed research project and then whether they could write me references/letters of recommendation for my applications. \n\nI think this was your main mistake, not the time (which seems reasonable to me, as a professor).\n\nWhen professors see a long e-mail with multiple requests for detailed help, usually one of two things happens -- they ignore it because it's too much work, or they don't have time to do it right then but intend to get back to it later, and it falls to the bottom of the inbox.\n\nIn the future, start with a short e-mail that reminds them of who you are and what you're doing, then ask if they would be willing to write a reference for you and give you feedback on your project (make sure you include the due date). Then once they've responded you can send them more stuff. \n\nWriting reference letters is a part of our job (despite what some other people are saying) -- we're certainly not required to write any letter that we get requested for, but don't be afraid to ask. Asking is fine, regardless of your relationship to the professor (although I would recommend not asking someone you know doesn't like/respect you)",
      "author": "honkoku",
      "created": 1636034539,
      "upvotes": 12,
      "replies": {}
    },
    "hj8dwmr": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8dwmr/",
      "text": "I only write letters for students that I can fully support based on my knowledge of their work, and who contact me at least a month before the letter deadlines.",
      "author": "hartfordmove",
      "created": 1635991781,
      "upvotes": 37,
      "replies": {}
    },
    "hj8d37f": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8d37f/",
      "text": "Yes, they can. Also, asking with under a month is kind of shit.",
      "author": "CerebralBypass",
      "created": 1635991402,
      "upvotes": 173,
      "replies": {
        "hj991ad": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj991ad/",
          "text": "Frequently unavoidable, though. I've seen plenty of PhD positions go up for 2- to 3-week windows, and since letters have to be specific to the position, it's not possible to ask any sooner than the posting goes up. I'm not sure I see a lot of positions posted with more than a month before the deadline!\n\nIf the prof has written a letter for that student before, they should be able to revise it.\n\nIf you mean \"let potential references know you are searching and ask if they are willing to serve as references and write letters if needed as far in advance as possible,\" I 100% agree. And of course no one is ever obligated to recommend a specific student for anything, although I'd argue that a prof who *never* agreed to be a reference would be shirking part of the job.",
          "author": "threecuttlefish",
          "created": 1636011869,
          "upvotes": 29,
          "replies": {
            "hj9l50t": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9l50t/",
              "text": "It sounds like OP is applying to graduate school, so the application deadline has been known for months.",
              "author": "bacon_music_love",
              "created": 1636022437,
              "upvotes": 23,
              "replies": {
                "hjaujwr": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjaujwr/",
                  "text": "That's not necessarily true about the deadline - that's why I'm so surprised most people here assume that it's possible to give months of advance notice. \n\nThey're applying to PhD programs. So am I. Funded PhD studentships (at least in my field in the geographic region I'm applying) are posted as jobs when the funding comes through and are generally up for less than a month, and since the proposal has to be tailored to the funding, the applicant is writing a proposal and cover letter from scratch in that time. It's just not possible to give letter writers more lead time than the applicant themself has! The application I'm currently working on is for a position with a 3-week application window. (Believe me, I would LOVE to have more time to write my proposal, especially since I work full-time.)\n\nIs this a geographic thing?",
                  "author": "threecuttlefish",
                  "created": 1636043921,
                  "upvotes": 3,
                  "replies": {
                    "hjaw5j1": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjaw5j1/",
                      "text": "Very likely it varies by country! \n\nIn the US, it's common to be accepted to the university graduate program first, and then rotate through labs to pick which one you'll do your PhD in. So students visit, interview, and apply, but ideally would only accept admission at a school with multiple PIs they'd be happy with. Since funding and cohort size fluctuates, a lab with a new grant might take 2 students from the same year, but then not have any more open spots until someone graduates. At my institution, the tuition and stipend are paid by the grad program for the first year, then by the PI grant for subsequent years (unless the student received some kind of fellowship or is awarded an individual grant like an F31).",
                      "author": "bacon_music_love",
                      "created": 1636044536,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "hjag88t": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjag88t/",
                  "text": "This.",
                  "author": "professorbix",
                  "created": 1636038401,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hj9wi1o": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9wi1o/",
          "text": "Oof reading through this thread guess I'm not applying this cycle. I just didn't have time to prepare the research statement that far in advance due to switching jobs and still finishing papers voluntarily for my old boss (who would be writing the letter).",
          "author": "yaboyanu",
          "created": 1636029581,
          "upvotes": 3,
          "replies": {}
        },
        "hj8jl1y": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8jl1y/",
          "text": "It wasn't intentional. I genuinely thought that a reference is something they can turn out relatively quickly. But it seems as though I was a little naive...\n\nSo if they just don't reply to me that's it, then? I can't apply to my PhD courses?",
          "author": "FlexMissile99",
          "created": 1635994508,
          "upvotes": -36,
          "replies": {
            "hj8sx7b": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8sx7b/",
              "text": "I mean some professors will create generic templates references that would only require them to change the name. But that is not what you want.\n\nThe reference letter, similar to your personal statement, is what's going to stand out the most in your application. Your professors are the ones who went through the process of the earning a PhD and they will attest to your ability to complete yours. It's not something you simply want to \"check off\" on your application. That is why it's recommended you take the time to think of some good references that are people who really know you personally and to give them ample time so they can really write something that is unique to you.\n\nA lot of grad school admissions can pick out a well written personal LOR vs a generic template one.\n\nYou could try to apply as is, but I'll be honest, without solid references your chances of getting accepted are small. Learn from this mistake and apply next cycle and be sure to give your professors ample time (no less than a month is minimum - but letting then know as soon as you narrowed down your schools is best) so they can write you a solid reference.",
              "author": "JHDog93",
              "created": 1635999593,
              "upvotes": 31,
              "replies": {}
            },
            "hj99kn3": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj99kn3/",
              "text": "I can see how you would think that, but you were wrong. On top of that, you *also* asked for advice. So chances are that your professors either care about you deeply and are simply not done with all the work you asked of them, or that they feel overwhelmed by your request for so much in so little time and have decided not to do it. (It's also possible that they don't think you are that good, but honestly I would think that you would know if that were the case.)",
              "author": "18puppies",
              "created": 1636012356,
              "upvotes": 11,
              "replies": {}
            },
            "hj8lxvu": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8lxvu/",
              "text": "Are you kidding me? Do you know how much stuff a professor has to do on a daily basis? Also I’m sure you want them to write you a good reference right? Not just, “they are pretty good.” Writing a nice, thought out letter takes time and effort. I’m sure others have asked them for letters too. Finally, of course they can refuse. It’s not their job to write you a letter. No where in the job description does it say, must write letters of recommendation for anyone who asks. They can turn you down for time reasons or maybe because they just don’t think much of you. It’s their prerogative. Everything you assumed was completely wrong. A good letter isn’t just a tweaked copy paste and if the letter is that then it isn’t good.",
              "author": "frogfriend66",
              "created": 1635995709,
              "upvotes": 63,
              "replies": {
                "hj8m375": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8m375/",
                  "text": "There's no need to be a dick about it.",
                  "author": "FlexMissile99",
                  "created": 1635995785,
                  "upvotes": -64,
                  "replies": {
                    "hj8mu7j": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8mu7j/",
                      "text": "Sorry, I don’t want to be too harsh about it but it is the truth. Having been a teacher at multiple levels it’s crazy what students expect of us. I’ve had students not complete a single assignment all year, turn in work, and then expect me to grade it within a day. Remember that these people are very busy with outside stressors besides their jobs. In the same way you probably wouldn’t want something proposed to you without much turn around time think about how they feel.",
                      "author": "frogfriend66",
                      "created": 1635996179,
                      "upvotes": 64,
                      "replies": {}
                    },
                    "hj8ost4": {
                      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8ost4/",
                      "text": "Agreed",
                      "author": "Excellent-Resist-220",
                      "created": 1635997228,
                      "upvotes": -19,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hj934ej": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj934ej/",
              "text": "Don't know why you're getting downvoted. You admitted you were naïve and simply didn't know the process, not sure what else people want...\n\nI think the only thing you can so is apologise profusely and see if a professor can churn a reference out in short notice. If you admit your mistake I'm sure someone will take sympathy and help you out. Not the best scenario, but worth trying.",
              "author": "01010100111011011011",
              "created": 1636006775,
              "upvotes": 27,
              "replies": {}
            }
          }
        }
      }
    },
    "hj8nfys": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8nfys/",
      "text": "Expecting a professor to reply is reasonable. Our responsibility to our students doesn’t stop when they graduate. We sometimes lose track of emails. OP: Ask again, be brief, respectful, professional. 3 weeks is not terrible. I’m frequently asked with much shorter notice by people who are already PhDs or professors. Write them again. Just be brief and polite. You’ll be glad you did.",
      "author": "UTArlingtonprof",
      "created": 1635996503,
      "upvotes": 37,
      "replies": {
        "hj99wir": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj99wir/",
          "text": "Yes and maybe say that you don't need advice on your project right now (as you did ask in the first email) and that you realize you are/were asking on very short notice.",
          "author": "18puppies",
          "created": 1636012654,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "hj8o6do": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8o6do/",
      "text": "Yes, they can decline.\n\nAs someone else said, giving them less than a month was a bad move. Professors are busy and reference letters are a moderate amount of work.\n\nAt this point, you can do two things: \n\n1. Reach out to them again, apologize for the short time available, and ask very politely if they can please do it; and \n2. Offer to provide a draft letter that they can work from (and which you should start on immediately). That significantly reduces the amount of time and effort they have to expend, because you can fill in your background and accomplishments and other relevant information, and they can then slice and dice it however they like and add their own personal thoughts about your accomplishments and their thoughts about your potential for success at the PhD level.",
      "author": "bigrottentuna",
      "created": 1635996893,
      "upvotes": 25,
      "replies": {}
    },
    "hj96mk1": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj96mk1/",
      "text": "Yes they can and it's actually an ethical thing to do if they think that they can't write you a good reference. A negative reference letter obviously is a no-go but even a neutral one can harm the student's application. So you keep out unless you can actually help the student.  \n\nBut not getting a response isn't saying no, it just means they didn't respond. I'd forget about the research proposal advice and just send a short email with only the request for reference, apologizing for the short time you give them to actually write the letter. If you have the option to go to office hours you could also discuss it in person. I wouldn't expect enthusiastic \"yes\" answers but it's all you can try.  \n\nIt's sadly not uncommon for professors to not only being hard to contact but also to forget about handing in letters in time. It really sucks that such a basic requirement that basically everyone involved hates is still existing. But there's nothing you can do than respectfully contacting them again, saying sorry for the short time period and hoping for the best.",
      "author": "LittlePrimate",
      "created": 1636009716,
      "upvotes": 9,
      "replies": {}
    },
    "hj9bhfd": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9bhfd/",
      "text": "I've refused a few times, especially when my letter wouldn't have helped their case: Be it because they weren't great nor hardworking, in which case I had nothing positive to say; or because I felt that they could've found someone closer to their field that would've had a greater impact. Or when they don't give me enough time/details...",
      "author": "oroboros74",
      "created": 1636014082,
      "upvotes": 8,
      "replies": {}
    },
    "hj9d04v": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9d04v/",
      "text": "So I’ve noticed that everyone has been piling onto OP for not giving enough notice, and downvoting them to oblivion, but I’d like to remind everyone that knowledge of the academic system is a privilege and not a guarantee. Many people are first generation university students and may not have people in their lives who can advise them on the best time to approach a professor about a reference, language for emails, application materials, etc. I’m not saying this is exactly OP’s case, but I think it’s best to be mindful that just because you had a decent advisor in undergrad (or one at all! I actually didn’t have one and I had to figure out how to navigate academia through trial and error), doesn’t mean everyone did. Yes, OP has admitted they were naive to think that 3 weeks was enough time for a LOR, but how could they know otherwise if they haven’t been told? \n\n\nTLDR: Academia is already insanely elitist, let’s not act as gatekeepers.",
      "author": "tibiapartner",
      "created": 1636015481,
      "upvotes": 67,
      "replies": {
        "hj9x1ua": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9x1ua/",
          "text": "To be honest, given my experience in academia before reading this thread I honestly assumed a 4-6 weeks would be appropriate. Considering the number of times I've completed \"last minute\" work for a grant deadline, paper submission, conference abstract, etc. that were due in under a week, I figured a month was plenty of time.",
          "author": "yaboyanu",
          "created": 1636029869,
          "upvotes": 18,
          "replies": {}
        },
        "hja3mmb": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja3mmb/",
          "text": "exactly, finally someone who's sane and sees the bigger picture instead of piling onto OP who is still relatively very early in their career. there needs to be a uniform way information about things like this gets communicated explicitly.",
          "author": "knowuow",
          "created": 1636033087,
          "upvotes": 10,
          "replies": {}
        },
        "hja3qbq": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja3qbq/",
          "text": "Completely this. \n\nAlso: in any non-academic context a month of notice would be ridiculously long. If you ask for a reference for a job (albeit providing references in a work context is a very different task), a week would be totally the norm.",
          "author": "doodahdoo",
          "created": 1636033135,
          "upvotes": 7,
          "replies": {
            "hjagh6w": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjagh6w/",
              "text": "True, but in a non-academic context people are writing far few such letters.",
              "author": "professorbix",
              "created": 1636038500,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hj9t6xd": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9t6xd/",
          "text": "I second this comment, and I would like to add that sometimes calls might be published a couple of weeks before the deadline. So it's not always possible to ask one month in advance. Also, it's true that not everyone has had a supportive advisor or knows how to navigate the academic job market. I'm first gen and I had the bad luck of having a negligent supervisor during my PhD. I learned everything through trial and error, as you say. Also big yes to academia being insanely elitist. We often talk about diversity, but diverse candidates often do not have the information it takes to thrive.",
          "author": "Normal_Kaleidoscope",
          "created": 1636027747,
          "upvotes": 6,
          "replies": {}
        },
        "hjaver0": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjaver0/",
          "text": "THIS, thank you.",
          "author": "threecuttlefish",
          "created": 1636044248,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj8mq99": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8mq99/",
      "text": "If that email landed in my inbox it would read as a student who had little knowledge of grad school and academic norms, and what goes into a good letter - in other words, not a scenario that lends itself to envisioning writing a strong letter.\n\nWhy aren't you getting the letters from your Masters faculty? And why didn't your adviser there better prepare you for this basic academic task?",
      "author": "Readerokie",
      "created": 1635996122,
      "upvotes": 38,
      "replies": {}
    },
    "hja6l8n": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja6l8n/",
      "text": "Write it for them in a word doc and send attached to the request.\n\n\nStrive for brevity in all communications without minimum word count.  People stop reading.",
      "author": "Hafslo",
      "created": 1636034414,
      "upvotes": 5,
      "replies": {
        "hjac3zo": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjac3zo/",
          "text": "Came here to say something similar. At the very least, include your résumé and maybe a brief one pager highlighting/detailing accomplishments in your degree program. When I get a LOR request, I sometimes struggle to remember what all the student worked on and the extent to which they participated. I always greatly appreciate the students who include supporting documents from which I can work.",
          "author": "jbeanie111111111",
          "created": 1636036751,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj8z20q": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8z20q/",
      "text": "Yep. And sometimes you’d rather them NOT give one than give a bad one.",
      "author": "indiandxll",
      "created": 1636003638,
      "upvotes": 5,
      "replies": {}
    },
    "hj9by1e": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9by1e/",
      "text": "I would suggest politely following up with SHORT emails (many people set long emails aside to follow up \"later\" and never do, and professors might see a long infodumpy email as a lack of focus). Asking for feedback on your research ideas is a much bigger ask in many ways and most profs won't have time or interest, especially if you don't have an ongoing relationship. In the second email, just ask about the letter and include your application materials and a brief summary of what you're applying for.\n\nYes, it's good to give as much lead time as possible. I don't get where all the people saying 1-2 months is absolutely mandatory are coming from - most PhD and job postings are not even up that long! Can't ask for a letter before you know a position exists.\n\nIt is true that the further back you go, the less likely it is that they can write you a strong letter unless you have stayed in close touch, but most will say if they are not comfortable writing you a letter or serving as a reference.\n\nIt is also entirely possible some thought they replied but didn't - this recently happened to me with a prof who was willing to write a letter but only answered my first email in his imagination. (Also - have you checked your spam filter, just in case?) Again, it's reasonable to follow up politely.\n\nWhile no professor is ever obligated to write a specific rec for a specific student and many will say no for different reasons, I don't think I agree with those who say writing letters in general is entirely optional. As long as letters are required for applications, someone has to write them, and when letters have been written for us, I think we are obligated to pay it forward by recommending others when we are in the reference position. This is why it's important to cultivate good relationships with a handful of people who can write strong references. (Much like the peer review system, it sucks that the labor is not officially compensated, but if we take advantage of what others put into the system, I think we *are* in fact ethically obligated to put similar work in ourselves.)\n\nGood luck - the whole process is complex, often opaque, and not very consistent, especially if you are applying to programs in different countries.",
      "author": "threecuttlefish",
      "created": 1636014507,
      "upvotes": 5,
      "replies": {}
    },
    "hj8kp8h": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8kp8h/",
      "text": "They usually have no obligation. References are usually provided in a personal rather than professional capacity. That is, it's not their professional duty or responsibility or even expectation to do it. It would just be an act of personal generosity to you. \n\nSometimes no answer is your answer. Other times they might just be busy.\n\nI'd suggest targeting one or two who know you and your work very well, and send a very short, polite follow up. Move on if still no reply.",
      "author": "RagingHomophone",
      "created": 1635995070,
      "upvotes": 8,
      "replies": {
        "hj9mlhn": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9mlhn/",
          "text": "No no no. Writing letters is part of your job as a professor. If a student did poorly in your class or is a jerk you can decline that student’s request but it’s something you have to do for normal students (with enough advance notice).",
          "author": "schwza",
          "created": 1636023507,
          "upvotes": 3,
          "replies": {
            "hjb3sw5": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjb3sw5/",
              "text": "This may be institution- specific. Some US schools, usually CCs and lower tier,  require profs to write a letter for everyone who asks. But most strong 4- year schools leave it to the faculty member's discretion, and treats it as a favor rather than a requirement.",
              "author": "Readerokie",
              "created": 1636047504,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hj9upcy": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9upcy/",
      "text": "Absolutely. I’ve written a number of letters of recommendation in my time, and I was in the unfortunate situation to have have to tell one person that I couldn’t do it. Sometimes you simply can’t, in good conscience.\n\nEven if you are deserving of a recommendation, you should recognize that it’s very difficult to do on short notice. The professor might not get to your e-mail right away, may be traveling, and they may be under pressure to address other higher priority issues. Your response rate is going to be higher the more time given. Also, you\nmust be sure that they remember you specifically. A professor has many students that come and go. If you are not a current student of theirs, you really need to be certain that they know who is asking.\n\nThat said, I do feel an obligation to give letters of recommendation where I can. I’m fairly forgetful, so a casual reminder would not be out of place, but I will absolutely do it if I can.",
      "author": "FellowConspirator",
      "created": 1636028611,
      "upvotes": 3,
      "replies": {}
    },
    "hj9z1cj": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9z1cj/",
      "text": "Yes.\n\nAnd, really, if a professor would like to decline, you are better off with another letter writer, anyway.",
      "author": "ph0rk",
      "created": 1636030891,
      "upvotes": 3,
      "replies": {}
    },
    "hjaajkf": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjaajkf/",
      "text": "Reading both of the above (including your edit)… slow down!!! Pause before sending. Write a shorter request.  \n\nAsking for a reference is fine (and stop there).\n\nI’m not sure if your undergrad profs are the right people to ALSO serve as a sounding board for proposed PhD research. \n\nThat job belongs to your PhD committees and advisors when you get to that step ~12-24 months from now.\n\nYes, of course anyone can refuse… maybe they are subtly telling you that they can’t write a strong one, but they are probably busy.",
      "author": "11th-plague",
      "created": 1636036110,
      "upvotes": 3,
      "replies": {}
    },
    "hjafziv": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjafziv/",
      "text": "To answer your specific question, of course they can refuse to write a letter. You cannot really think they are required to do so. Professors get requests for letters that would be negative if the professor was honest. In most such cases, the professors refuse to write such a letter rather than write a negative one. You would not want a system where they are required to write a letter. Occasionally, we do receive negative letters or lukewarm letters, which function as negative letters.\n\nI think you are trying to be respectful, but in reality could come off as demanding. You did not just ask for a letter but for them to review your proposed research. This is a lot of work and while some profs will be glad to do this, it is not their job and is a big ask. You also did not give a huge lead time.\n\nBelow are my suggestions for how to engage with your professor on this, which align with many suggestions made by other posts:\n\n1) Write a *short* email. Longer emails are sometimes written in an effort to engage the prof. In reality, they often are taking up their time unnecessarily. \n\n2) Remind the professor who you are, even if you think they will remember you. \"I enjoyed taking your classes X and Y, for which I made an A grade.\"\n\n3) Attach your resume or CV.\n\n4) Provide the name of the program(s) to which you are applying to. If you are going to apply to multiple programs, try to include all of this in one email, not a separate email for each recommendation request.\n\n5) Give a brief text - one sentence - about why you are excited about this program(s).\n\n6) Give clear instructions on deadlines, how the recommendation will be submitted, etc.\n\n7) Thank them.\n\n8) After you have written your email, read it again and see if you can shorten it. This will be greatly appreciated.\n\nStart thinking of alternate letter writers just in case.\n\nGood luck in your applications.",
      "author": "professorbix",
      "created": 1636038305,
      "upvotes": 3,
      "replies": {}
    },
    "hjawnq2": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjawnq2/",
      "text": "Word of advice when emailing profs, keep it as short as possible! Many profs do not even read an email that’s multiple paragraphs long.. keep it to a handful of sentences and reminders are fine! Reply to original email chain you sent for best results",
      "author": "onetwoskeedoo",
      "created": 1636044731,
      "upvotes": 3,
      "replies": {}
    },
    "hj9trkb": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9trkb/",
      "text": "As someone that writes a fair bit of PhD application references myself, I actually find it annoying if a student that I barely know but happened to attend my classes but never really interacted during class coming up to me asking for a reference, but I'm more than happy to write a good reference for a student who has even remotely attempted to actively participate in teaching settings",
      "author": "Dr_2019",
      "created": 1636028077,
      "upvotes": 7,
      "replies": {}
    },
    "hj90pzf": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj90pzf/",
      "text": "So, yes. They can refuse to write a letter. Writing a letter of rec is a favor, not an obligation, and takes loads of time. It’s concerning that, as a masters student who wants to get a PhD, you haven’t done basic research into what is required for these applications and how letters of rec should be asked for. Also surely you needed letters of rec for your masters program? Did you only give your letter writers a few weeks notice then? Tbh it just seems like if you really wanted to get a PhD, you would have spent more time looking into the process. This is in no way meant to be rude; I’m just confused.",
      "author": "DazzlingLink1740",
      "created": 1636004872,
      "upvotes": 8,
      "replies": {
        "hj9k3p9": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9k3p9/",
          "text": "I gave them about a month when applying for my masters too, yes. And it wasn't an issue that time from what I recall. Honestly, it just wasn't something I thought to research into. My mind has been 100% focused on picking schools and writing my proposal. I (naively) assumed the references were just 500 words or so of puff praise, that they turned around quite quickly. As I've admitted above, from what people are telling me, it seems I really misunderstood this aspect of the process.",
          "author": "FlexMissile99",
          "created": 1636021644,
          "upvotes": 5,
          "replies": {
            "hj9prcq": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9prcq/",
              "text": "To be totally fair to you, a lot of people seem to be focusing on the time period and not on anything else here. Honestly a month isn't unheard-of and I'm fairly certain most of your profs will have done more with less. That being said, you now know to give them as much lead-in time as possible. \n\nWhat strikes me as the bigger concern is that you sent a really long email asking for multiple pieces of input. As somebody else recommended, I'd follow up with them, with a very clear single ask. You can reply to your original email, and say \"dear x, I just wanted to follow up on the below, and specifically, writing a reference in support of my application for y program. The deadline is z and I was hoping to list you as a reference. I sincerely apologize about the late notice, and I would understand if it is not possible in that time period. If it is possible, I can send you any further information you require to help craft the letter. Please let me know one way or another.\" Or words to that effect. \n\nGive them: (a) the ask, (b) the deadline, and (c) a single action (saying yes or no). Don't overwhelm them with documents and info that they don't need until they've confirmed they're willing to write the letter. \n\nDon't assume malice or that the profs don't want to support you. It's much, much more likely that the profs just missed the email or put it aside for later instead of actively wanting to refuse to write you a letter. After a week (which really isn't that long to not reply to an email), it's entirely reasonable to follow-up. \n\nI would, however, think about having a couple of people in your back pocket who you may be able to call on for a reference. Are there profs you're working with during your MA who might be able to help? Anybody that you can reach out to if you don't hear back? \n\nAnd this isn't a hopeless case. People are jumping on you for not giving enough time - and while it's fair, it's also not particularly helpful for you unless you've got a time machine - so let's figure out how to get those letters of recommendation for your application!",
              "author": "doodahdoo",
              "created": 1636025643,
              "upvotes": 13,
              "replies": {
                "hj9tn9f": {
                  "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9tn9f/",
                  "text": "This exactly !! A month isn’t unreasonable if they know you well and like you. But getting an email that leads with a research pitch and an ask for advice before the reference? I have a feeling most profs would not have even gotten that far in the email to see the request for the letter. Completely agree with the follow up format that  u/doodahdoo suggests",
                  "author": "klk204",
                  "created": 1636028007,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            },
            "hj9ti95": {
              "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9ti95/",
              "text": "If you’re applying for a PhD, why are you asking for refs from your undergrad? That in itself seems like an issue to me. You should have connections in your Masters program who can do the recommendations.",
              "author": "sheath2",
              "created": 1636027927,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "hj9b76l": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9b76l/",
      "text": "There is no law requiring them to give you a reference.",
      "author": "lazymutant256",
      "created": 1636013828,
      "upvotes": 3,
      "replies": {}
    },
    "hj9jf8d": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9jf8d/",
      "text": "Yes that's common unless you are fresh in there memory they won't remember you hence you have to remind multiple times and may be call few times that's what i am doing for masters, although mahe sure you have more than a months time !",
      "author": "MeteoraRed",
      "created": 1636021103,
      "upvotes": 2,
      "replies": {}
    },
    "hja7hma": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja7hma/",
      "text": "If professors don’t want to give you a reference, they will usually recommend someone else as a signal that if they wrote you a reference, they aren’t gonna say nice things. \n\nIf they are just taking a while, it’s academia and everything is slow in academia.\n\n(Also, it makes way more sense to ask for references at your MA program.)",
      "author": "iunoionnis",
      "created": 1636034808,
      "upvotes": 2,
      "replies": {}
    },
    "hja7t7l": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja7t7l/",
      "text": "My last graduate advisor refused to give me one.",
      "author": "Weird_Surname",
      "created": 1636034947,
      "upvotes": 2,
      "replies": {}
    },
    "hjanl7n": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjanl7n/",
      "text": "3 weeks is very short for a phd program, though I’ve seen worse. I work with a few professors and essentially the more time you give them the better letter you’ll get (assuming they like you of course).",
      "author": "cactushugger8",
      "created": 1636041258,
      "upvotes": 2,
      "replies": {}
    },
    "hja674u": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja674u/",
      "text": "> I'm not entitled. I don't think I'm owed a reference\n\nThe title of your post would indicate otherwise: \"Can professors refuse to give you a reference?\"\n\nAlso, frankly, the time to be building a relationship with profs who might give you a reference isn't a month before you need it, but ideally a couple of *years* prior. \n\n> I'm not entitled. I don't think I'm owed a reference (although I do think it would be kind of a prof to give me one). ... So please be a little kinder to me.\n\nUh, that last statement and the first really don't go together...",
      "author": "iugameprof",
      "created": 1636034242,
      "upvotes": 6,
      "replies": {}
    },
    "hj90nu5": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj90nu5/",
      "text": "No, we are legally bound to provide a reference in all cases.  /s \n\n&#x200B;\n\n:)\n\n&#x200B;\n\nYes, we can turn down an ask, although IME it's rare and usually done with cause. I've only every turned down 2 students.  One because I honestly didn't remember the student whatsoever and wouldn't feel comfortable vouching for them and the other because the student was enrolled in my course at the time and it would be an ethical conflict.    \n\n\nWith respect to the non-response, many faculty members are swamped.  Everyon's schedule invariably varies, but they may simply be busy (and, sadly, your request is likely not a priority.)   Be patient and, if it warrants, send a gentle, quick follow-up to remind them you're waiting for a response.",
      "author": "anoddlittlebird",
      "created": 1636004826,
      "upvotes": 2,
      "replies": {}
    },
    "hj92aon": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj92aon/",
      "text": "Yes, professors can certainly refuse to write you a letter of recommendation. And, yes, one month before the application deadline is a very short lead time to give a professor.",
      "author": "mleok",
      "created": 1636006101,
      "upvotes": 4,
      "replies": {}
    },
    "hja2m9d": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hja2m9d/",
      "text": "don't take the rude comments to heart, academia has a problem with not laying out expectations for things like this explicitly",
      "author": "knowuow",
      "created": 1636032615,
      "upvotes": 2,
      "replies": {}
    },
    "hj9dmb8": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj9dmb8/",
      "text": "What kind of participation trophy world did you grow up in?\n\nIt's a reference. Of course they can deny. \n\nWhy the hell are you asking for letters of rec from professors you aren't on good terms with anyway? The letter will be trash even if they write it. \n\nEspecially on such short notice.",
      "author": "EvilLost",
      "created": 1636016054,
      "upvotes": -13,
      "replies": {}
    },
    "hjaj2en": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjaj2en/",
      "text": "You need to bug them. My way of handling emails from students is to ignore them until they’ve followed up enough to make me feel bad. Be polite but don’t be shy.\n\n\nAlso, yes, they can refuse to give you a letter. One time one of my students asked for a letter but lied about the due date (I know he was lying because tons of PhD apps are due at the same time and I wrote letters for a bunch of people). I told him I can write the letter but I’d mention that he lied about the date. (Note the emphasis I mentioned on respect!) He said no thanks. LMAO!\n\n\n——————\n\n~Rocky~\n\n~he/him~\n\n*keep on rockin*",
      "author": "Rocky_Notice",
      "created": 1636039506,
      "upvotes": 1,
      "replies": {}
    },
    "hjar5v4": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjar5v4/",
      "text": "I would suggest writing a very short email to the professor asking if they would feel comfortable writing you a strong letter of recommendation. If they say no, then you have your answer. If they say yes, then send them the deadline, your CV, some notes about things that will remind them who you were, what classes you took with them, your aspirations. Be brief. And thank them. This from a professor.",
      "author": "kritchseed",
      "created": 1636042634,
      "upvotes": 1,
      "replies": {}
    },
    "hjbfyg5": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjbfyg5/",
      "text": "You’ve gotten a lot of good advice to approach earlier in the future and so forth. \n\nI will say that some profs need gentle reminders; just send a quick “following up on this reference request, which is due _____.”\n\nAs others have pointed out, there is no requirement that profs do a letter, and if the letter is to be effective, it is certainly not a copypasta, but tailored to the student and, if you are lucky, the strengths of the institution/department/labs you are applying for. A generic letter is not much better than a bad one.\n\nBut also, if you are in a master’s, surely your current profs could write a better recommendation than your bachelor’s ones? One letter from an undergrad prof with whom you had a strong relationship, sure, but it will look sketchy if your application doesn’t include LORs from your current degree.",
      "author": "schilke30",
      "created": 1636052269,
      "upvotes": 1,
      "replies": {}
    },
    "hjbr11d": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjbr11d/",
      "text": "In the interest of providing productive advice, when you ask for something like this with relatively short notice you can offer to provide a draft of the recommendation letter that they can edit/personalize and submit confidentially. It can be really weird to write a draft letter for yourself but it's something you will need to get used to (depending on your field). This will make them more likely to help you because the letter writing will be lot less time consuming for them.",
      "author": "fuzzywuzzypanda",
      "created": 1636056625,
      "upvotes": 1,
      "replies": {}
    },
    "hjc1cwx": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjc1cwx/",
      "text": "1) yes, they could refuse. \n2) as a rule of thumb I try to give at least 2 months’ advance notice\n3) After a week, a short follow up is appropriate\n4) I’m sorry people are being rude. There are many unspoken rules in academia that can be hard to find out, unfortunately.",
      "author": "alstroemerial",
      "created": 1636060675,
      "upvotes": 1,
      "replies": {}
    },
    "hjctwl1": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjctwl1/",
      "text": "You don’t want a reference from someone who isn’t willing to give it.",
      "author": "GradAdmissionDir",
      "created": 1636072708,
      "upvotes": 1,
      "replies": {}
    },
    "hjd2kce": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjd2kce/",
      "text": "The reason why you are being called entitled, is because, the wording as is is, is extremely entitled (not that a wording being entitled does not immediately mean the author is).  \n\n\nThe number one thing you need to understand is, it's not tha they can refuse, the DEFAULT is that they will. A proffessor has no reason to give you a recommendation letter unless they already like you/repsect you/ want to help you out. i.e. if you approach a random prof, assume tha anser to the question \"May you write me a recommendation letter\" is \"no\".  \n\n\nAsking if they can refuse is what makes you sound entitled, it makes it sound like you feel you are owed a recomendation letter. But those have to be earned through hustling. By going to their classes, doing research with them and chatting them up to make them like you.",
      "author": "camilo16",
      "created": 1636076527,
      "upvotes": 1,
      "replies": {}
    },
    "hjdo5im": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hjdo5im/",
      "text": "Yes, a professor can refuse to write you a recommendation letter for several reasons. They may be busy. You may want it on too short notice. They may have a low opinion of your work, and honestly try to avoid saying so to potential letter readers—believe me, you *want* faculty to refuse in this case. If you’re asking for more than a “yes/no”—it looks like you wanted feedback on your project—they may want to discuss it in person (or via Zoom) during office hours.\n\nI’d strongly recommend against forcing a professor, or anyone else, to write a letter of recommendation for you. You won’t like the results.",
      "author": "squeamishXossifrage",
      "created": 1636087701,
      "upvotes": 1,
      "replies": {}
    },
    "hj8tk5j": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8tk5j/",
      "text": "Yep they can. Probably they don’t think you deserve a reference from them. You’re lucky they don’t just agree to give you the reference and then tank you.",
      "author": "ohnoyoudin",
      "created": 1635999974,
      "upvotes": -12,
      "replies": {
        "hj928do": {
          "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj928do/",
          "text": "This is not necessarily true either, cut OP a break",
          "author": "figuringthingsout--",
          "created": 1636006050,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hj8or7u": {
      "link": "/r/AskAcademia/comments/qma3an/can_professors_refuse_to_give_you_a_reference/hj8or7u/",
      "text": "Edit: I will take these down votes as a yes (personally)",
      "author": "PanOmnist",
      "created": 1635997205,
      "upvotes": -4,
      "replies": {}
    }
  }
}