{
  "sid": "qy8c9o",
  "link": "/r/AskAcademia/comments/qy8c9o/do_learning_methodsstyles_change_once_fully_in/",
  "title:": "Do learning methods/styles change once fully in graduate school?",
  "text": "TL:DR I have trouble learning the basic fundamentals, but have an easy time with the upper level theories and then developing the \"fundamentals\". RA position does theory then fundamentals, coursework does fundamentals then theory. Was wondering if anyone learns this way, and if things change to this in grad school. \n\n***Dual BS and M.S. student here in an RA position, I am both an undergrad and grad student***\n\nHi all,\n\nI'm a dual BS Mechanical Engineering and Physics student, also getting my M.S. in Mechanical Engineering. Just got diagnosed with ADHD/OCD. \n\nIn my RA position I've been given a paper to re-format/learn and expand upon which will become a first authorship paper before I graduate from all 3 programs. \n\nMy RA position is vastly different than anything I've come across in my coursework. I'm expected to learn the material on my own, come back with any questions on material, hammer those out with my professor and repeat the process and then continue to write my paper. Im currently doing a paper on Fluid Dynamics.\n\nIn my actual undergraduate Fluid Dynamics course, I'm struggling due to the material being \"too slow\"/ not deep enough. I'm told to accept some theories/values and go along with it. Though in my own time, I've been learning the upper level Fluid course material in order to work on my paper. \n\nI've excelled in the higher level material, but struggle with the lower end stuff. Essentially the \"bottom-up\" method is a struggle for me, while the \"top-down\" method is something I excel with. \n\nI was wondering if anyone had these same struggles, and if things change when I enter my PhD program where things are top-down instead. \n\nThanks for any responses.",
  "author": "CarterTheSpaceman",
  "created": 1637423538,
  "updated": 1637688652,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.56,
  "comments": {
    "hler0ym": {
      "link": "/r/AskAcademia/comments/qy8c9o/do_learning_methodsstyles_change_once_fully_in/hler0ym/",
      "text": "Not necessarily answer your question, but just thought I could respond a bit, as a person in education/teaching & curriculum: the way a curriculum is designed, does not always reflect what makes sense (to whom, right?). And it may have nothing to do with learning or theories of learning (they are mostly hypotheses btw), but more with policy, management, etc. Like why we have different subjects? why we have the grade level? why we need to learn certain things at a certain time (elementary - middle - high school)?\n\nNow if you feel like you're more struggling with \"bottom-up\", I wonder how you feel about turning tangible things into patterns and abstraction cuz that's one way theories are developed. Being able to shift between the two directions/modes is part of what I think people should be able to do at the more advanced level. What can happen, if we learn through \"top-down\" but do not have enough \"bottom\" means we do not always understand \"top\" fully or correctly. We may have too many questions about \"bottom\" that we need to fill the gaps in order to fully know how the \"top\" works. \n\nThen, in terms of studying in the PhD program, obviously I'm not in your field, but I think the ability to learn on your own (you still can ask for help and that's part of it; more like self-directed) is what I've exercised the most. In my coursework, I've explored what interests me and I learn stuff through reading, discussing them and writing about them. There's always stuff I don't know but I'm not intimidated by it. I can always learn and I do it quickly.\n\nedit to add: personally, I feel like I learn faster cuz I know myself better and I can utilize all kinds of ways to learn. I don't subscribe to one way. I also care a lot more about how the thing I'm learning is connected to my existing knowledge, like the relationship between or among things. I also employ analogy and metaphor to help me understand stuff.",
      "author": "solo-melon-cho",
      "created": 1637430871,
      "upvotes": 1,
      "replies": {}
    },
    "hlg5lga": {
      "link": "/r/AskAcademia/comments/qy8c9o/do_learning_methodsstyles_change_once_fully_in/hlg5lga/",
      "text": "As an RA and grad student, your supposed to *know* and do research, which is what the R stands for. I’ve encountered many people who had the same ideas like you and every single one of them were very wrong.\n\nYou do not get to be good at learning advanced topics without acing the fundamentals and you do not get to judge how good you are at understanding. Once you get to be a grad student, you won’t have the luxury to waste weeks on a single paper where you didn’t do the research, you’ll be churning out multiple papers per year where you’ll be doing everything and you won’t have the time to learn the basics (or rather, you will, but it will be on your own dime because PIs will not waste funding on you doing something that you’re supposed to be doing now).",
      "author": "tpolakov1",
      "created": 1637453395,
      "upvotes": -1,
      "replies": {}
    }
  }
}