{
  "sid": "pa28lv",
  "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/",
  "title:": "Should I put my small online business on my CV for graduate program application?",
  "text": "Hello,\n\nDo you ever apply for a graduate program while you are unemployed or doing your own small online business? If so, how do you put it in your CV for a graduate application?\n\nI plan to apply for a graduate program but I don't have degree related jobs since I've got my MSc. This is due to Covid and the political unrest in my country. The companies stop hiring. All are closed. The industry is not running anymore and thousands of workers are unemployed at the moment. I am no different. All I can do to earn is doing my own small online delivery business from time to time. I don't think I can find a proper related job any sooner. \n\nSo can you please give me some advice on how to put this period in my CV?",
  "author": "hopefulbear_sea",
  "created": 1629732789,
  "updated": 1634079513,
  "over_18": false,
  "upvotes": 42,
  "upvote_ratio": 1.0,
  "comments": {
    "ha1ll4c": {
      "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha1ll4c/",
      "text": "You can list your small online business as work experience. It would be even better if you could relate some of the soft skills you acquired from this experience that relate to this program in the cover letter, if applicable.",
      "author": "Hhas1proton",
      "created": 1629733427,
      "upvotes": 44,
      "replies": {
        "ha1txky": {
          "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha1txky/",
          "text": "Project management, keeping deadlines, working under pressure, all important skills",
          "author": "DeepSeaDarkness",
          "created": 1629736878,
          "upvotes": 29,
          "replies": {
            "ha52p2d": {
              "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha52p2d/",
              "text": "Hey, thanks for the ideas. It's useful to me.",
              "author": "hopefulbear_sea",
              "created": 1629795761,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ha52jsy": {
          "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha52jsy/",
          "text": "That's a great idea! I'm concerned that it's not worth to mention on my CV since it's nothing related to my previous degrees or the program I'm going to apply. But if I don't mention, then this period will be a huge gap. Now that you've said, I'm a little relief. Thank you.",
          "author": "hopefulbear_sea",
          "created": 1629795631,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ha2d8g1": {
      "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha2d8g1/",
      "text": "Definitely. You need to distinguish yourself from other applicants and anything that shows concentration, application and perseverance is golden.",
      "author": "sbw2012",
      "created": 1629744759,
      "upvotes": 14,
      "replies": {
        "ha52s50": {
          "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha52s50/",
          "text": "Thank you. I will describe it for sure.",
          "author": "hopefulbear_sea",
          "created": 1629795839,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ha2e2i8": {
      "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha2e2i8/",
      "text": ">small online delivery business from time to time.\n\nIt depends what this means. If it is a small business that you started then it is worth listing, since it shows skills that graduate schools might care about (mention this in cover letter). If this means that you did deliveries for Grab/Doordash/Deliveroo, etc then it won't add anything to your CV and it doesn't matter if you leave it on or off.",
      "author": "DevFRus",
      "created": 1629745100,
      "upvotes": 9,
      "replies": {
        "ha52zzy": {
          "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha52zzy/",
          "text": "Yeah it's my own business, founded with my friends.",
          "author": "hopefulbear_sea",
          "created": 1629796031,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ha2e30e": {
      "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha2e30e/",
      "text": "You are an entrepreneur! You should absolutely list it! That's a big plus.",
      "author": "bigrottentuna",
      "created": 1629745106,
      "upvotes": 6,
      "replies": {
        "ha53i2w": {
          "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha53i2w/",
          "text": "Thank you! I didn't think that way earlier. Now I know better and definitely will do.",
          "author": "hopefulbear_sea",
          "created": 1629796477,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ha37sku": {
      "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha37sku/",
      "text": "Yes",
      "author": "radionul",
      "created": 1629757401,
      "upvotes": 2,
      "replies": {}
    },
    "ha43lob": {
      "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha43lob/",
      "text": "Are you applying to a PhD or another Masters degree?",
      "author": "entropyStable",
      "created": 1629771864,
      "upvotes": 2,
      "replies": {
        "ha53901": {
          "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha53901/",
          "text": "I'm considering for a PhD because I think I can apply for fundings/scholarships and they are more generous to the doctoral degrees imo. Another Master's will be very costly for me.",
          "author": "hopefulbear_sea",
          "created": 1629796254,
          "upvotes": 2,
          "replies": {
            "ha5qt03": {
              "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha5qt03/",
              "text": "It won't make much of a difference on a PhD application.  \n\nPositions seeking someone with a PhD tend to avoid countries with political unrest so just make sure job opportunities post graduation exist.",
              "author": "entropyStable",
              "created": 1629811753,
              "upvotes": 2,
              "replies": {
                "ha66xca": {
                  "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha66xca/",
                  "text": "Thank you for advice. Can you please elaborate on what you mean? I know employers prefer to hire native people rather than outsiders. But why do they avoid people coming from such countries? Shouldn't they treat all candidates with the same skills equally without considering which countries they come from?",
                  "author": "hopefulbear_sea",
                  "created": 1629818854,
                  "upvotes": 1,
                  "replies": {
                    "ha75zkl": {
                      "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha75zkl/",
                      "text": "I meant local positions within the country are less likely to exist in countries with political unrest. \n\nAs for applying internationally the country of origin does matter for two reasons. \n\nFirst there will be the question about the quality of your education. Even if your school is top notch it can be hard for employers to judge this about foreign universities, as there are a lot of shit schools around the world (including in Europe and the US). So the perception of the country matters a lot if the school isn't well know; generally a country undergoing political unrest is going to have a more negative bias against the school system. \n\nSecond, the visa application process can vary in difficulty and if there is significant number of applicants from a country for visas it can make the process more difficult even when sponsored by an employer. This will depend heavily on the country you are applying to. \n\nBest of luck. \n\n&#x200B;\n\n&#x200B;\n\nP.S. these are not value judgments on the described practices just stating our current reality.",
                      "author": "entropyStable",
                      "created": 1629832832,
                      "upvotes": 1,
                      "replies": {
                        "ha9mace": {
                          "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha9mace/",
                          "text": "I see. There will be a lot of difficulties being from an unstable country. However, applying for a graduate program internationally is the most viable option for me right now rather than applying directly for jobs. This will buy me some time to familiarise the system in a new place. Hopefully, the politics will get better in the meantime. Let's see what will happen then. Fingers crossed.",
                          "author": "hopefulbear_sea",
                          "created": 1629877373,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ha3l9fn": {
      "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha3l9fn/",
      "text": "Yes list it. I actively prioritize students who have real world life experience through part time or full time jobs. I find these students usually have an outstanding attitude to learning, tenacity, work ethic, etc. Some advisors won't care about it and they can ignore it, but some like me do take it seriously.",
      "author": "The-very-naughtyduck",
      "created": 1629763543,
      "upvotes": 3,
      "replies": {
        "ha53nli": {
          "link": "/r/AskAcademia/comments/pa28lv/should_i_put_my_small_online_business_on_my_cv/ha53nli/",
          "text": "That's interesting to know. Thanks for the heads-up!",
          "author": "hopefulbear_sea",
          "created": 1629796614,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}