{
  "sid": "mz9ytt",
  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/",
  "title:": "How to tell if academia is or isn’t for you?",
  "text": "I’m in the first semester of a thesis Master’s in Mechanical Engineering that I started because I struggled to land a job during the pandemic (May 2020 grad). I had no research experience and I think came in with an idealized view of grad school, thinking it’d be manageable because I was successful in undergrad. \n\nNeedless to say I struggled a lot this first semester. Did well in my courses and progressed in the research but I’m extremely unhappy and my mental health has suffered quite a bit because of the stress, uncertainty about career goals, and some personal things as well. I don’t enjoy the research work at all, it seems like torture after taking all the time to stay on top of courses. I’m definitely not that passionate about engineering, I think it’s mainly a career for me rather than a calling. I’m hanging in but everyday is a struggle and I’ve never been this level of anxious/depressed before.\n\nI’m thinking about quitting and doubling my efforts to land a job as things reopen at the tail end of the pandemic to work for awhile to figure out what I do/don’t like. I’m unsure how much of this is just first semester growing pains, and how much is my gut telling me that this isn’t what I want to do right now. I suspect it’s a little of both. Anyone have any similar experiences? I feel like I started grad school with no goals or passion as a backup plan and I’m starting to think it may have been a mistake. Any insight is welcome!",
  "author": "CricketChoice4796",
  "created": 1619476449,
  "updated": 1634081361,
  "over_18": false,
  "upvotes": 132,
  "upvote_ratio": 0.98,
  "comments": {
    "gw05g9k": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw05g9k/",
      "text": "i'm nearing my 5th and final year of my PhD, and I realized academia isn't for me when I started resenting the fact that I had to go home and still think about my chemistry. i just want a normal life, and i don't want to be in this constant circle jerk of people trying to boast how great their research is, try to run a research lab, beg for funding from the government, etc. i want a normal 9-5 and a normal life. but that's just how i personally feel. others may have their own reasons",
      "author": "cascaderade",
      "created": 1619488883,
      "upvotes": 159,
      "replies": {
        "gw062o7": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw062o7/",
          "text": "I’m already feeling that way in my first semester, thinking back to my internships in college. I’m so burnt out of worrying about grades and professors and all that.",
          "author": "CricketChoice4796",
          "created": 1619489218,
          "upvotes": 27,
          "replies": {
            "gw0680n": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0680n/",
              "text": "don't worry about grades they don't matter. the only thing that matters for classes in grad school is that you are made aware of the information so that you can refer back to it later for your research. grades only matter for certain departmental fellowships but other than that you just need to pass.",
              "author": "cascaderade",
              "created": 1619489298,
              "upvotes": 24,
              "replies": {
                "gw06e3w": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw06e3w/",
                  "text": "Yep I’ve been given that advice elsewhere too. I’m a bit of a perfectionist so that’s tough for me to do but it makes sense. Would you say you enjoy or have/had a passion for the research that you do/did?",
                  "author": "CricketChoice4796",
                  "created": 1619489392,
                  "upvotes": 13,
                  "replies": {
                    "gw06jjx": {
                      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw06jjx/",
                      "text": "yeah i've enjoyed my research and it's been successful. i've been able to publish a few papers from it, but i'm not using those accomplishments to try and get a post-doc or anything like that. i just want an industry position lined up for graduation. if you don't like your research at all, you're going to have a very rough time surviving grad school.",
                      "author": "cascaderade",
                      "created": 1619489472,
                      "upvotes": 8,
                      "replies": {
                        "gw06v02": {
                          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw06v02/",
                          "text": "Exactly my thoughts as well lol it seems for many people they dislike the coursework and focus more on their research but for me if anything it’s almost the opposite",
                          "author": "CricketChoice4796",
                          "created": 1619489645,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    },
                    "gw0qsko": {
                      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0qsko/",
                      "text": "Being a perfectionist is a habit you probably want to rid yourself of. Whether or not you choose to stay in academia, you'll need to learn to prioritize. Don't be like a former collaborator of mine who spent two months just to fix the punctuation on the displayed equations in a paper.",
                      "author": "mleok",
                      "created": 1619502394,
                      "upvotes": 12,
                      "replies": {
                        "gw0y6zc": {
                          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0y6zc/",
                          "text": "In real life, perfectionism can be detrimental. You will have a family (I presume) one day, kids will need your time and work can’t wait to be done perfectly. You simply have to finish the task at hand or you will be weighed down by a high pile of unfinished tasks you wish to complete perfectly. It’s a life skill to learn when to leave perfectionism behind.",
                          "author": "worm1010",
                          "created": 1619508584,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gw0ifxm": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0ifxm/",
          "text": "I'm a Master's student and same.  There's just no time to properly unwind, and since I have anxiety it's a whole other nightmare for me right now (I live in India) I thought of quitting but I just...idk it'll be harder for me to find a job with just a BS in chemistry with mostly Cs.  Makes me think I should've gotten a humanities degree instead, I've done loads better in those classes.  I'm too depressed to care about anything besides surviving but also too anxious to let everything go.   \n\nOnly thing keeping me afloat is knowing that there are people I know who have no data for their thesis and are still continuing with it.  \n\nI'm just so tired all the time. I have 2 presentations this week, one in front of my lab and one in front of my thesis advisory committee. I have to write a report of all the work I've done but every time I open the document, I get anxious about my TAC presentation.  Somehow managed to write 500 words.\n\nI need a fucking break FML I just wanna go home",
          "author": "phantom_0007",
          "created": 1619496361,
          "upvotes": 21,
          "replies": {
            "gw0nrz1": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0nrz1/",
              "text": "Damn sorry to hear about that",
              "author": "CookiesForSaten",
              "created": 1619500064,
              "upvotes": 7,
              "replies": {}
            },
            "h9dhn1t": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/h9dhn1t/",
              "text": "I am in India too. And in a similar place. Final year of BS+MS in physics. I think it's my fault that I took too many projects on my plate but I feel so burnt out right now. I feel like I may have liked studying but I can't handle research. I don't think I enjoy it as much or I am cut out for the frustrations of independent research. I'm somehow holding on till my internship finishes but the doubts I have are so bad. Due to my (multiple) projects, I don't have time to properly prepare for placements and I am not even sure if I am fit for any of the roles offered. It feels horrible especially when you add the pandemic and more than a year of isolation too.   \n\n\nI am at home but not really :/",
              "author": "lostneedhelp7",
              "created": 1629260446,
              "upvotes": 2,
              "replies": {
                "h9dib8r": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/h9dib8r/",
                  "text": "Yeah I've moved home since then, I go to lab from home every day.  My spondylitis is getting worse and worse and I don't know how much more work I have left in me.  Thesis submission is in 2 months and the days are just passing by because I can't get stuff done.  Thankfully my supervisor is supportive but it sucks not having much data to show week after week.  I try to read literature but I can't understand what I read because my brain just doesn't work.  I lost almost 2-3 months of time to flare ups.  Feeling so done at this point, I don't even mind working but I just want this stupid spondylitis shit to go away.  It's okay though, I'm sure we'll figure it out.",
                  "author": "phantom_0007",
                  "created": 1629260890,
                  "upvotes": 2,
                  "replies": {
                    "h9dimta": {
                      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/h9dimta/",
                      "text": "Hang in there! I am trying too. Sounds like symptoms of burn out. And it's shitty and really difficult to take decisions in a state like this. The symptoms are similar to depression and the pandemic routine and the stress of being productive doesn't help much. Try to rest or take short breaks if you can manage. I hope you figure it out and it makes sense. I hope I somehow do it too",
                      "author": "lostneedhelp7",
                      "created": 1629261109,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gw0s5op": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0s5op/",
          "text": "Oh my God! I Feel the exact same way. It sounds like too much stress for me to handle.",
          "author": "1349sohelas",
          "created": 1619503470,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gw0atla": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0atla/",
      "text": "Plenty of good advice in this thread already, some of this is a little redundant but adding my story just in case:\n\n* Job search/job market wise, getting a master's degree is probably worth it. I assume it's a 2-year program? So you're already 25% of the way there. If you definitely hate academia/research then you absolutely do not want to go on for a PhD, but the master's degree will make you more competitive in the job search and give you a starting salary boost. \n* If you're really not passionate about your research project, then you need to have that conversation sooner rather than later to see if you can switch projects/advisors. It might still be possible in your first semester. If you try to switch after a full year in then it might be too late to do without delaying your graduation. These are guesses on my part, you should talk to the relevant people at your school. This is all assuming (as you mentioned in other comments) you want to keep your funding and not drop research altogether.\n* Don't feel bad about it being hard. Grad school hit me in the face like a brick. I thought I was smart as an undergrad because I was good at taking tests. I got to grad school and found out I could not approach open-ended problems on my own. It was hard. I dropped a class for the first time in my life because I had no idea what was going on. I adjusted though, and I think you can too in your second semester, if you take the points above into account. \n* Mechanical engineering is an incredibly versatile degree. Plenty of people get engineering degrees and then go into business/consulting/law etc. You're good at math and solving problems. So if you aren't actually that passionate about the engineering and don't want to design cars/airplanes/robots/whatever, you still have a ton of options.\n\nHope that helps!",
      "author": "bengineering103",
      "created": 1619491801,
      "upvotes": 46,
      "replies": {
        "gw1erhq": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw1erhq/",
          "text": "50%*",
          "author": "jml011",
          "created": 1619523246,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gw0kon9": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0kon9/",
      "text": "I always wanted to be an academic. The only thing I’ve ever been good at was studying and this was pretty similar right? \n\nBut now I don’t like it. All I do is sit alone in my office staring at a computer. Barely any human interaction, zero creativity, and I have stopped caring about my area of research. \n\nOne thing I wanted when I started the role was to be a lecturer, but my boss just isn’t willing to make that happen even if she has the power to. \n\nSo I’ve decided to re-train and be a teacher. I’ve heard lots about the negative aspects, but I think it will provide a lot of what I’m missing. I will still have the aspect of exploring the world and discovery, but I’ll also have creativity and social interaction and hopefully it will increase my quality of life",
      "author": "nyequistt",
      "created": 1619497847,
      "upvotes": 20,
      "replies": {
        "gw0kzxu": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0kzxu/",
          "text": "Fair play man! It’s good you’ve realized this first step to making a change right?",
          "author": "CricketChoice4796",
          "created": 1619498062,
          "upvotes": 4,
          "replies": {
            "gw0ln3w": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0ln3w/",
              "text": "And I realised it pretty quick too! But I know life is way to short to stay doing something you don’t like.",
              "author": "nyequistt",
              "created": 1619498503,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "h9dhzeh": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/h9dhzeh/",
          "text": "This is what I am struggling with. Starting with my final year of BS+MS and after research internships this year I feel burnt out and averse to research than before doing it. Could be the effect of the pandemic and the online classes before it but also because I was always good at studying so this seemed natural. Now, it doesn't and it seems scary because I don't know what jobs to go for if not PhD. I like programming, have experience with working with a little bit of ML but I have no idea about what I like and where I could land up with this :/",
          "author": "lostneedhelp7",
          "created": 1629260674,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gvzkzhq": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzkzhq/",
      "text": "> \nI’m thinking about quitting and doubling my efforts to land a job as things reopen at the tail end of the pandemic to work for awhile to figure out what I do/don’t like.\n\nthat's a good idea.\n\nI think there's a lot of good/valid reasons to get a PhD. Some people do it out of some intrinsic sense, because they love research or a challenge, some out of an extrinsic goal, e.g. because they want to work in academia or a PhD is a good resume boost for them in industry. Probably most people have a mix of these reasons. And imo it's hard to say anything but \"when you know you know\". I think, as long as you're not doing it because you don't know what else to do or out of some unhealthy notion (like that your mom won't love you if you don't get a PhD), it's fine. Also, not being sure that you want the degree is definitely a red flag and a sign that you should take time to figure out what you want. You can always come back - academia will always be there!",
      "author": "thegreenaquarium",
      "created": 1619478536,
      "upvotes": 18,
      "replies": {
        "gvzmw4j": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzmw4j/",
          "text": "I’m wondering if quitting earlier is more considerate, and would free me up for even more job applications and maybe something part time until I find a full time engineering role. I’m not sure if it makes sense to do that or if I should try and tough out another semester while trying to find a job.",
          "author": "CricketChoice4796",
          "created": 1619479476,
          "upvotes": 2,
          "replies": {
            "gvzu6dt": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzu6dt/",
              "text": "I would get the master's degree. Otherwise you will have trouble explaining what you were doing all this time. And, also, if you do decide to continue, you might have to repeat it.",
              "author": "thegreenaquarium",
              "created": 1619483137,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    },
    "gw01u8j": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw01u8j/",
      "text": "If you went into grad school because you thought it was just an extension of undergrad, then of course you're having a hard time. The first semester is usually one of the hardest for everyone and would be especially so if you didn't know what to expect. Of course it is up to you, but it will probably be a bit easier next term so you may want to stay and see! I don't think a master's in mechanical engineering would ever hurt your career. \n\nHowever if you are going into debt for this and aren't sure then I suggest stepping back for a while until you know what you want.",
      "author": "Winesday_addams",
      "created": 1619487040,
      "upvotes": 11,
      "replies": {
        "gw03cid": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw03cid/",
          "text": "No debt if I stick with the research position I’m in currently, but that’s the main thing giving me trouble right now. I’m finding it tough to manage the research on top of courses when I’m not that passionate or interested in the research.",
          "author": "CricketChoice4796",
          "created": 1619487802,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gw07dp6": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw07dp6/",
      "text": "Start applying for jobs ASAP. If you find a good job, leave. If not, consider sticking it out so that you can a) explain what you were doing for a good chunk of time, and b) become more employable. I wouldn't leave without a job; you have an overall great situation since you are not going into debt and are also gaining a useful degree. You can also consider telling your advisor you hate your research and seeing if there's anything else you can do; many of us have dropped research projects b/c we didn't like them or weren't interested in them and that's nothing to be ashamed of if there's something else you can start working on instead that will still be productive but less torturous.\n\nIf engineering is already a career and not a calling then I don't see how this will be *that* different than a job. It's totally valid to work for work's sake and find your passions out of work—but if that's the case, then you really will have to make your peace with struggling through some aspects of it because they're expected of you. To me it doesn't seem like it matters too much if that aspect is research, or other boring components of an industry job that you may not relish. Grad school is also a good time and place to figure out how to maintain work/life balance. This can vary if your PI is awful, but if they're a nice normal person then this is a good time to learn how to balance your work (which you may not always love) with your life (which may provide you more fulfillment). That is a skill you can take with you beyond your degree. If you're spending too much of your time working this may explain why you are miserable—I'd do my best to stick to 40 hrs a week including both classes and research. If you're doing more, that's probably part of the problem (because you're not getting to do all the other fun things in life!) Of course I'm not in your shoes and don't know just how much you dislike the research vs. boring components of other jobs. But I wouldn't leave without something else lined up.\n\nAs you mention in comments, you are correct—the earlier you leave the better for everyone. So ideally you can secure a job now and dip out. And as others are saying, the first year ANYWHERE new is really tough from a lot of angles. So part of what you are experiencing is probably totally normal and I hazard a guess that if you talk to others in your program you will hear very similar things (at least, that is what always happened when I talked to other students in my program—we were all struggling with pretty much the same thing). That's not to say you should stay, but at least a small portion of it might just be getting used to your new context. I'd guess that most grad students think seriously about quitting at least once in their first year...most of them, probably more than once. And probably also beyond their first year.",
      "author": "tishtok",
      "created": 1619489930,
      "upvotes": 8,
      "replies": {
        "gw08wyz": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw08wyz/",
          "text": "Yeah the lack of work life balance is a big gripe I have. I hate the feeling of the work following you home, and the remote nature of things right now has made it all the worse. In industry from my experience there was also more support and team based work, whereas my experience in research so far has been quite solo and unguided. Not to mention it’s all simulation based so I’m very rarely interacting with others.\n\nI know of others in the same boat as me looking to quit already after a semester haha. I’m quite miserable and burnt out of school and feel like I can’t possibly do the courswork/research juggling act for another 3-5 semesters",
          "author": "CricketChoice4796",
          "created": 1619490753,
          "upvotes": 5,
          "replies": {}
        },
        "gw08zwb": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw08zwb/",
          "text": "And I’ve definitely ramped up the job applications since I started feeling this way. Really hoping to land something soon.",
          "author": "CricketChoice4796",
          "created": 1619490797,
          "upvotes": 2,
          "replies": {
            "gw0a56b": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0a56b/",
              "text": "Good luck! This was a really tough time to start any kind of new job or degree, so I definitely empathize with your struggles. For now I'd consider downloading a time clock app to your phone and punching in and out every day—helps delineate the time, and you can also see if you're working too much. Try not to think about work outside of work hours. See if that improves things at all. And hope you find a job soon :)",
              "author": "tishtok",
              "created": 1619491423,
              "upvotes": 2,
              "replies": {
                "gw0amv8": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0amv8/",
                  "text": "Thank you so much for all the advice!",
                  "author": "CricketChoice4796",
                  "created": 1619491698,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gvzyb3b": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzyb3b/",
      "text": "Its difficult to say if you'd be happier if you didn't stay the course. What was your emotional state like before your masters program? If you're the unfortunate host to any lurking mental health issues, any long term stressful situation (like grad school) can potentially exacerbate them. \n\nIf you truly feel thus is a hollow endeavor, there is no shame in pulling out. If you feel that sticking it out will improve your future AND you have access to mental health resources to soften the blow you're taking, it might be worth sticking with. Thats a big 'if' though, do not underestimate the health risks of long term stress with no reward.",
      "author": "goatsandhoes101115",
      "created": 1619485241,
      "upvotes": 7,
      "replies": {
        "gvzyx88": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzyx88/",
          "text": "I came into the program apprehensive because grad school was my backup plan since I failed to land a job. I also mistakenly thought it’d be similar to undergrad, which I excelled in. I was immediately stressed out and actually ended my first relationship halfway through the semester thinking that may have been a problem/distraction since I had some anxieties in that situation. That didn’t really improve things and I realized I’m also pretty unhappy with grad school. It’s been mentally exhausting trying to figure out if I actually want to do this or if I’m doing it to satisfy family, think of it is a next step etc, while also dealing with personal issues.",
          "author": "CricketChoice4796",
          "created": 1619485558,
          "upvotes": 3,
          "replies": {
            "gw08psn": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw08psn/",
              "text": "Oh Jesus, I’d say get out ASAP if grad school was the ‘backup plan’",
              "author": "eggplant_wizard12",
              "created": 1619490648,
              "upvotes": 6,
              "replies": {
                "gw09a1l": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw09a1l/",
                  "text": "Very foolish of me indeed, hindsight has made me realize that. It was a crazy year last year graduating amidst the pandemic and not getting even a single interview from all the applications I sent out even with my good GPA and co-op experience",
                  "author": "CricketChoice4796",
                  "created": 1619490950,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gw076ei": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw076ei/",
      "text": "Question: are you not passionate of (a) your specific research topic in engineering, (b) research in engineering, or (c) research in general? Three different questions to think about. Note (a) is a subset of (b) which is a subset of (c).\n\n(a) but not (b): I would advise you to look into other research topics in the engineering field within your department\n\n(b) and not (c): I would graduate with the Masters and then go into the industry to find a research problem to work on. Figure out your interests and build more opportunities towards that. Give yourself time to retry the PhD after you figure things out. I personally fall in this category.\n\n(c) Graduate with Masters and focus on your engineering career in the industry. \n\nFor context, I entered a Math PhD program initially wanting to pursue research in number theory. I soon realized that I didn’t really enjoy creating theorems in the field and I enjoyed more applied maths, so I tried to approach my suggestion for (a) not (b). After learning that none of my faculty interests aligned with mine, I left my PhD with my Masters and pursued data science.\n\nNow being pretty stable with my career in data science, I am being extra cautious and aware of any research opportunities I find in the industry to feel very rewarding via my ability to contribute. You can find these research opportunities if you ever want to explore the PhD in the future (I am still dabbling but will not commit unless I find a topic that I absolutely love hence why I’m in (b) but not (c) category). You can also stay in the industry and not look back but I knew I love creating something new and beneficial using my math skills (which may not necessarily be research).\n\nI’m currently in the grey cloud of still figuring what I want to do five to ten years from now, but what I can say is that being able to distinguish between the three options would give you much more clarity on what you believe is right for you.",
      "author": "WirrryWoo",
      "created": 1619489817,
      "upvotes": 6,
      "replies": {
        "gw0afhg": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0afhg/",
          "text": "Do you think it would be wrong or out of line to have a candid discussion with my PI about my future and career goals and trepidations? I’d rather be transparent about all of this.",
          "author": "CricketChoice4796",
          "created": 1619491584,
          "upvotes": 1,
          "replies": {
            "gw0gsya": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0gsya/",
              "text": "I think honesty is important too. I would recommend it if you find other research interests other faculty members have and that you are interested to further explore. Otherwise, if not (like my case) I would phrase it as being interested to acquire work experience to learn more about the problems around us, etc.",
              "author": "WirrryWoo",
              "created": 1619495320,
              "upvotes": 1,
              "replies": {
                "gw0hxxy": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0hxxy/",
                  "text": "I’m thinking of phrasing it that way and saying that I’m unsure how much the research I’m doing or research in general lines up with my current career goals",
                  "author": "CricketChoice4796",
                  "created": 1619496040,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gvzjmy0": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzjmy0/",
      "text": "Research/education/working from home is unbearable for me. Grad school can be tough, and I imagine that wfh would be really biasing my experiences. \n\nBut if you are unhappy, just go find a job you like and leave your program. People do it all the time, and definitely doesn’t mean you are a “failure” or anything, you are just learning what you like to do. Grad school is all extra credit anyways and nobody will care if you don’t finish.",
      "author": "Sacuna9999",
      "created": 1619477882,
      "upvotes": 12,
      "replies": {
        "gvzodsz": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzodsz/",
          "text": "The working from home aspect definitely makes it much worse. I’m sure that’s played a role in feeling isolated anxious and unhappy",
          "author": "CricketChoice4796",
          "created": 1619480209,
          "upvotes": 5,
          "replies": {}
        },
        "gw0j1an": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0j1an/",
          "text": "That and honestly I feel like the world around me is moving on from the pandemic (here in Florida), but I still cant have the experience I want at my lab, like seminars, and one-on-one meetings with my advisor and committee members, because of liability issues. It's just not the experience that I signed up for and what I initially enjoyed for both my MS and first 2 years of my PhD. Like, why do I live where I do if I need to have indefinite zoom meetings anyway.",
          "author": "Lord_Velvet_Ant",
          "created": 1619496748,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gvzim43": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzim43/",
      "text": "Well things vary from person to person but I think most of the people that I've known who were fellow graduate students totally loved the courses.  That's not to say it wasn't difficult but most of us generally enjoyed the challenges. I mean it's one of those things that you really immerse yourself in and you really enjoy if you belong there. From everything you've said it sounds like you don't. But that doesn't mean you shouldn't finish. And you can probably do a masters that isn't really research heavy. You might want to talk to your advisor but you definitely don't wanna go on for a phD",
      "author": "mathychick",
      "created": 1619477382,
      "upvotes": 19,
      "replies": {
        "gvzmjms": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzmjms/",
          "text": "I’m 100% not thinking about a PhD even though my advisor said I could after my Master’s. I know now that’s not for me. I guess I recognize that the Master’s is a good opportunity objectively and that’s why I’m so hesitant. That and I’m scared of letting my advisor down or putting him in a hard position. I also don’t have a job lined up and I’m worried what it will look like to employers that I quit after a semester.",
          "author": "CricketChoice4796",
          "created": 1619479307,
          "upvotes": 8,
          "replies": {
            "gvzpank": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzpank/",
              "text": "To me finishing your masters is a good strategy on several levels. 1st of all the job market hasn't rebounded yet; probably will take a little bit of time. Secondly, it doesn't necessarily look good if you start a program and then you quit it. Third, most masters programs you can get through, and it will probably add value when you go out in the job market.  If you're doing a masters in engineering you should be able to find something applied which will allow you that transition or make industry contacts.",
              "author": "mathychick",
              "created": 1619480661,
              "upvotes": 10,
              "replies": {
                "gvzpv93": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzpv93/",
                  "text": "That’s my thought as well. It’s not the coursework that’s getting to me, it’s mainly me really not enjoying the research. It’s entirely simulation based, so no labwork just tons of programming. If I could do just coursework I could grit my teeth through it, but after all the tough coursework research is such a burden, especially when I have very little interest or passion in the topic.",
                  "author": "CricketChoice4796",
                  "created": 1619480949,
                  "upvotes": 5,
                  "replies": {
                    "gvzr3vd": {
                      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzr3vd/",
                      "text": "Well if you're in your 1st year of your master's program do you have to do a research project? A lot of masters programs you can simply write a paper or do enough coursework to compensate.",
                      "author": "mathychick",
                      "created": 1619481575,
                      "upvotes": 4,
                      "replies": {
                        "gvzt89j": {
                          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzt89j/",
                          "text": "I’m reasonably sure I wouldn’t get my tuition paid for if I dropped the research. I definitely don’t want to go into debt or pay expensive out of state tuition either. Do you think it would be rude to tell my PI that I can’t manage research and classes and ask if there are any options to not do research?",
                          "author": "CricketChoice4796",
                          "created": 1619482659,
                          "upvotes": 3,
                          "replies": {
                            "gvzulem": {
                              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gvzulem/",
                              "text": "I don't know the particulars of your support. IMO, it is not unusual for grad students to want to change plans or paths. Your exposure to your field as an undergrad is so limited, most students really don't know what they are getting into. So I don't think it would jeopardize your position or do any harm to talk to your advisor. Dont tell them you hate it or can't stand it; just say you think you might not like the work as much as you thought and wanted to check out your options. Worst case scenario is they say, \"no can do, suck it up buttercup\".",
                              "author": "mathychick",
                              "created": 1619483349,
                              "upvotes": 6,
                              "replies": {}
                            },
                            "gw085sa": {
                              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw085sa/",
                              "text": "It sounds like you are on a GRA (graduate research assistantship) which comes with tuition and a stipend. You are correct that if you drop the research you are probably looking at a pay-to-play situation. Most GRA positions require 20 h per week research, and a good PI has you doing your *own* research work during that time (possibly with occasional exceptions to help other students).",
                              "author": "eggplant_wizard12",
                              "created": 1619490346,
                              "upvotes": 4,
                              "replies": {
                                "gw0ajsx": {
                                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0ajsx/",
                                  "text": "Correct I am on a GRA stipend. Do you think it would be out-of-line to have an open discussion with my PI about my current feelings and worries?",
                                  "author": "CricketChoice4796",
                                  "created": 1619491651,
                                  "upvotes": 1,
                                  "replies": {
                                    "gw0btoy": {
                                      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0btoy/",
                                      "text": "Not at all; in fact I think the sooner you speak up the better. It will be much worse for the PI to get blindsided. If you tell them early they can probably redirect the funding elsewhere with little harm.",
                                      "author": "eggplant_wizard12",
                                      "created": 1619492369,
                                      "upvotes": 5,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gw0ovf8": {
                      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0ovf8/",
                      "text": "If you don't like your project, you could find a different project. Maybe you can do experimentation in the same field, maybe modeling & simulation in a different field, maybe neither. Here are some questions that may help you decide.\n\nWhat do you not understand that you'd like to? What would you spend time thinking about if you were locked in an empty room for hours? What thought produces that nagging doubt about whether what you've always been told is really true? What two pieces of information are you trying to reconcile? Trying to answer these questions is a path to academic success.\n\nWhat thing would you like to exist that doesn't? What common problem do you deal with on a regular basis that you'd prefer not to? What cool thing did you see in a research paper that would change the world if it could be made available to everyone? What two ideas combined would make something bigger than the whole? Trying to answer these questions is a path to success in industry.\n\nIt's not my place to tell you whether to switch your project, whether to stay in academia or move to industry, or when or how to do any of these things. But since you're clearly not happy with what you're doing now, you need to ask yourself what you would be happy doing, and what you need to do to get yourself there. And then you need to do it.",
                      "author": "TooTallForPony",
                      "created": 1619500897,
                      "upvotes": 3,
                      "replies": {
                        "gw0qbsr": {
                          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0qbsr/",
                          "text": "Very insightful. I definitely think I lack the direction/experience to know what I want to do or where I want to go.",
                          "author": "CricketChoice4796",
                          "created": 1619502025,
                          "upvotes": 3,
                          "replies": {
                            "gw1clm5": {
                              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw1clm5/",
                              "text": "I've been doing this for decades and I still don't know what I want to do or where I want to go. Don't let that stop you! It probably won't come to you in a flash, you'll just find yourself gravitating toward certain things. Do the things you think sound fun, throw your heart into them, and everything else will take care of itself.",
                              "author": "TooTallForPony",
                              "created": 1619521679,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gw0r0co": {
                      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0r0co/",
                      "text": "Is there a way to transfer to a coursework based Master's?",
                      "author": "mleok",
                      "created": 1619502566,
                      "upvotes": 1,
                      "replies": {
                        "gw0txwo": {
                          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0txwo/",
                          "text": "I could technically drop the research but then I’d lose the tuition assistance and stipendad have to go into debt or pay out of pocket, neither of which is financially viable for me",
                          "author": "CricketChoice4796",
                          "created": 1619504905,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gw1wtyd": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw1wtyd/",
              "text": "Don't base life decisions on whether or not you might disappoint your advisor. You are the one living with the decisions you make, not them, and a good advisor just wants to see you end up somewhere that makes you happy anyway.\n\nTo an employer, Bachelor's + Some Masters looks fine imo. (I am in CS, not sure how your field sees it.) My experience with industry is that the pro of hiring academics is they are smart, but the con is they are motivated by long-term, low output projects instead of doing profitable things for the company. \"Some grad school\" can actually be a sweet spot -- you're smart enough for grad school but have a temperament for \"real\" work. Again, this experience is all through the lens of CS, ymmv.\n\nAt the end of the day, if you're unhappy and your mental health is wrecked, look for something else. It's a big world, and even in shitty COVID times there are opportunities to be had doing other things. The only mistake you can make is to wreck yourself out of \"how will other people think of me\" fears (which you are probably mostly inventing anyway).",
              "author": "zanidor",
              "created": 1619533140,
              "upvotes": 1,
              "replies": {
                "gw2a2qr": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw2a2qr/",
                  "text": "This is very true and something I’ve always struggled with. I suppose I’m a bit of a people pleaser. I hate the feeling of me having let someone down, but I guess it’s not worth it to be miserable.",
                  "author": "CricketChoice4796",
                  "created": 1619538819,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gw0bsy2": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0bsy2/",
          "text": "Completely disagree, coursework sucks. I love research and I love writing/communicating my science, that’s why I’m here. But the “challenge” of coursework is how much you can tolerate tedium more than anything, imo.\n\nBut I am also in a PhD program, not a masters, so different goals I guess.",
          "author": "trevorefg",
          "created": 1619492357,
          "upvotes": 5,
          "replies": {
            "gw0e49i": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0e49i/",
              "text": "Well if you read the 1st sentence of my post it says it varies from person to person. Also it also varies from discipline the discipline. If you are in the hard sciences like mathematics, your ability to do research is built on your coursework and tends to be more book oriented.",
              "author": "mathychick",
              "created": 1619493686,
              "upvotes": 0,
              "replies": {
                "gw0g9jj": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0g9jj/",
                  "text": "I mean, you say that as a caveat, but then you go on to describe perceived norms that I don’t think are 1) actually norms or 2) indicative of anything other than the culture of your program/cohort. Which is why I made my post.\n\nAnd I’m in neuroscience, so hard pass on your comment about “hard sciences”, too. It seems like you just don’t realize how much you’re generalizing personal anecdotes, and I don’t think it’s helpful to say “most things are x way” when they’re just not.",
                  "author": "trevorefg",
                  "created": 1619494988,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "gw09xhm": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw09xhm/",
          "text": "Tagging /u/CricketChoice4796 but imho, whether or not a student enjoys the courses is not necessarily predictive of whether they should go into academia or not. Most every grad student enjoys the coursework but academia is an entirely different endeavor with lifestyle demands rather than \"do i like learning\". I actually dislike my grad courses entirely but I LOVE research and engaging with my scientific community but I'm set on academia (and my mentors have said I'd do well in it/I remind them of themselves).\n\nSort of in response to the other commenter, I absolutely love my neuroscience and I relish being able to think about it every second of the day and also surround myself with neuroscientist friends. I don't want nor do I expect a normal life or normal working hours; I mostly just want to do whatever it takes to stay in research within reasonable bounds (which may be unreasonable by another person's measure). I don't think this is a prerequisite but it is however a positive quality for academia.",
          "author": "Stereoisomer",
          "created": 1619491305,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gw0nfc2": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0nfc2/",
      "text": "I’m in the same boat, been really struggling trying to keep up in classes. Majoring in computer science now after dropping classes last year from majoring in engineering. \n\nAlthough I ended up unemployed on different terms. But I feel lost as well, not really sure what my future is going to look like a year from now, and quite frankly I’m depressed to think about it. But I’m still trying for whatever reason I’m still giving my all.",
      "author": "CookiesForSaten",
      "created": 1619499799,
      "upvotes": 4,
      "replies": {
        "gw0o1uu": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0o1uu/",
          "text": "Exact same boat man. I’m so unsure I just know I’m unhappy right now and I really want to make a change but I’m scared the change will be worse in the long run. So it just feels like I’m paralyzed unsure what to do. I know this is a tough time and I’m confident we’ll both figure it out, even if it takes time. Feel free to PM me if you ever want to comisserate haha",
          "author": "CricketChoice4796",
          "created": 1619500270,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gw0cu7e": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0cu7e/",
      "text": "The first piece is liking the research. There's a ton of other aspects that consider, but if you don't enjoy the research, it's not even worth thinking about the rest of it. It can be a career rather than a passion or calling, but it's got to be a career you enjoy or the other downsides are too much to deal with if you don't enjoy the research. (With the one caveat being people who really love the teaching & are targeting teaching positions)\n\nThat said: nothing wrong with realizing it's not for you! Especially in engineering, you'll have lots of job options as the economy picks back up.",
      "author": "mediocre-spice",
      "created": 1619492945,
      "upvotes": 3,
      "replies": {}
    },
    "gw0tahu": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0tahu/",
      "text": "I was in the exact position you're in 4 months ago (just finishing my undergrad in May 2020 as well), and I felt EVERYTHING you described. I started my Masters in September 2020 and I hated research soooo much. However, I'm in an MA so I have a research project instead of a thesis...fast forward 4 months later and I'm transferring to an MSc and doing a thesis because my second semester was so much more enjoyable – I took course topics I actually like and got better at reading research articles compared to when I was in the first semester. I'd say maybe continue to give it a shot? Everyone in my cohort felt the same way as I did hating research, a few dropped out and some dropped halfway through the second semester, but a bunch of us are still here. It's not for everyone, but it could be the difficult learning curve that's making you hate it!\n\nI can't say I'm going to love doing all of the thesis work or that continuing into the next semester will help you to love research, but my perception of it has definitely changed since I first started :)",
      "author": "m-r-s-e",
      "created": 1619504377,
      "upvotes": 2,
      "replies": {
        "gw0u0j9": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0u0j9/",
          "text": "I’m afraid of this! That quitting would be jumping the gun too soon. I’m planning a heart to heart with my advisor where I discuss everything and see what guidance he can give me.",
          "author": "CricketChoice4796",
          "created": 1619504966,
          "upvotes": 1,
          "replies": {
            "gw500fb": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw500fb/",
              "text": "Wishing you all the best and hope your advisor supports what you're passionate about researching!!",
              "author": "m-r-s-e",
              "created": 1619585319,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gw17da9": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw17da9/",
      "text": "To everyone who thinks that academia is not for them, because they want a normal life with 9to5.\nAny 9 to 5 that has enough potential and growth will do the same and possibly worse to you.",
      "author": "riduser",
      "created": 1619517221,
      "upvotes": 1,
      "replies": {
        "gw296ne": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw296ne/",
          "text": "Yeah I’m worried about jumping ship from one crappy situation to another. At the very least I’d be making 2-3x the pay",
          "author": "CricketChoice4796",
          "created": 1619538449,
          "upvotes": 1,
          "replies": {
            "gw2dl7u": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw2dl7u/",
              "text": "To me personally, I'm worried about a life without a story. I'm worried about not being in enough rooms before settling for one. I want to fight, because I know I want something big. I'm ready to go bankrupt for an idea, and I'll still be the happiest man ever. The truth is, everything is uncomfortable. Do you really think that the next guy with the 100 patents and a Nobel prize was comfortable during his work? \n\n\nIf you leave academia and go into an organisation where business is the heart, and you have performance goals and points to promote, or an organisation with the model upward or out, you'll suffer, and you'll probably cry yourself to sleep every night. Now, this is for some people and not all. And it sucks being the type of person that wants success more than life. However, an ordinary job with a medium salary will stress you far less and give you room to live. The key word is a medium salary and an ordinary job. Because you can't have both.\n\n\nEven if you're a singer, or a video game streamer(you really have fun doing what you do). If you want to be big in what you do, you'll have to do it enough to the point where you no longer love it. \n\nMy advice is to align your expectations before you act on them.",
              "author": "riduser",
              "created": 1619540309,
              "upvotes": 2,
              "replies": {
                "gw2e01e": {
                  "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw2e01e/",
                  "text": "I’ve always been high achieving with school and internships until now. I’ve very rarely felt a sense of accomplishment from it all or done it out some intrinsic drive, it was always just what I felt I was supposed to do. In the past 2-3 years I’ve realized the things that make me happiest are all outside of the realm of work/career/school. An ordinary job that pays me enough to live and doesn’t kill me sounds like a dream.",
                  "author": "CricketChoice4796",
                  "created": 1619540480,
                  "upvotes": 4,
                  "replies": {
                    "gw2egdh": {
                      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw2egdh/",
                      "text": "I wish you nothing but happiness, good luck.",
                      "author": "riduser",
                      "created": 1619540666,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gw0kcc1": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw0kcc1/",
      "text": "MechE Prof here. You're getting some good advice, but this is also probably not the right sub for your question. You may get a different perspective from /r/AskEngineers about the stay-or-go dilemma.",
      "author": "blue_pez",
      "created": 1619497614,
      "upvotes": 1,
      "replies": {}
    },
    "gw1581v": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw1581v/",
      "text": "Become a plumber , they can make more, than engineers. You can get into a variety of plumbing. Maybe you can go out on your own one day.",
      "author": "romboot",
      "created": 1619515220,
      "upvotes": 1,
      "replies": {}
    },
    "gw16olu": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw16olu/",
      "text": "Honestly, I am still not sure if academia is or isn't for me.\nI am a little bit like you (a perfectionist who struggle). It will be a long one.\n\n I have a M.A. in linguistics and do vividly remember that until March 2020, I loved my field and sort of appreciate my M.A. but my result (of my research) were not what I expected (I actually hate my M.A thesis today, have been hating it since May 2020). I partially blame the Pandemic (I loved the girls from my lab) and my P.A. (She pulled my MA in a way I hate). \n\nI was sure that once I got into my PhD program, I would be happy. And yet, here I am. In two weeks, I will be a drop-out of a PhD in linguistics, because the actual learning experience (we are full on zoom class) is having its toll on me. I am still at the beginning (a year in) and I already hate how my subject has been hijacked by one of my P.A (two directors). I also hate the uncertainty of my field (1 in 2 PhD find a job at the end in linguistics : lower in my specialized field of research because who cares about morphology). So even if I still love my original subject (conceptualizing derivational morphology in a theorical approach), I have left academia. But I still blame in part the pandemic (being stuck in my room has been awful for my mental health), the lab (I had difficulty fitting in), and the university (it wasn't my first time at this specific uni, and everytime, I hated the attitude of student and teachers)\n\nI am still not sure if I am leaving academia for good. I still have an idea for another PhD (related field, in something I have always loved) but right now (well, in September) I am doing a M.A. in a related field to give me access to a job. I am 28, I want to work and be useful to society. My only trick to know will be to take time to evaluate what does not suit you and if it is research itself, there is no wrong in quiting.",
      "author": "the-morphology-queen",
      "created": 1619516578,
      "upvotes": 1,
      "replies": {}
    },
    "gw1kn1m": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw1kn1m/",
      "text": "I'm not sure if someone else already said this in the pervious comments,  but one of my professors gave me one of the best pieces of advice I have ever received regarding this. And it helped me decide when I was asking the same question. He said to me: Would you talk about your research with your friends at a beer? And would you be excited about sharing it? \n\nThe thing was, I was so frustrated with the whole institution of academia at the time and with the birocracy and the lack of integrity here and there. But even so, I loved what I was researching and I was always enthusiastic to talk about it when someone gave me the chance. \n\nHope this helps a little. And if you don't feel like you're place is there that's alright. I'm sure you'll find that thing that makes you talk for hours, annoying the hell out of people at dinner parties:))) (if you already found that it's wonderful!)",
      "author": "ForgottenNamesGame",
      "created": 1619526977,
      "upvotes": 1,
      "replies": {}
    },
    "gw1kye8": {
      "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw1kye8/",
      "text": "I donʻt think academia is for you. I say this because you said youʻre not that passionate about engineering. Academia tends to be the kind of thing where youʻre always thinking about your research topic or field -- and it energizes you! And thatʻs not to say there arenʻt moments (many moments) where you are fed up with or even begin to dislike your research, or feel very overwhelmed and stressed by it. At the end of the day, though, there are people who love it. Iʻm a bit of an anomaly though. Iʻm in the sixth year of my Ph.D and Iʻve had way fewer moments where Iʻve wanted to just give up than most people. \n\nThe take away you should take from that is, donʻt do a Ph.D. You donʻt mention you are. I would actually bet thatʻs the last thing you want to do right now. Sometimes, though, people think a Ph.D will be different, and itʻs really more of the same -- just more of it.\n\nWhat I can say is that academia not being for you doesnʻt mean that you should drop out of your program. Education isnʻt a waste. Iʻm not an engineer, so I donʻt know exactly how valuable a masters degree is in your field, but you do. If you think it will have value and you can tough it out, Iʻd say itʻs worth finishing. But if itʻs not going to help at all with finding a job or advancement, and something better comes your way, there is no shame in not finishing your degree.\n\nEven though I said Iʻve had fewer moments where Iʻve w anted to just give up, I can say Iʻve had more moments of wanting to give up on, well, *everything,* if you know what I mean. Iʻve really struggled with my mental well being at times. Taking care of yourself is very important. Before I started my Ph.D, I had a job for about half a year after I graduated from my masters that I didnʻt like and felt like was taking absolutely everything out of me. I was so depressed and miserable. If your masters is making you feel that way, where itʻs actually hurting you (I cried so hard in the bathroom at work once I bruised my face), then it isnʻt worth it.",
      "author": "JapanOfGreenGables",
      "created": 1619527153,
      "upvotes": 1,
      "replies": {
        "gw2aej9": {
          "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw2aej9/",
          "text": "See I’m unsure if it’s the Master’s or the current state of things as is with the pandemic. All I know is that I’ve genuinely never been this unhappy before. I think it’s a combination of the pandemic and an uncertain future, the stress of grad school, and just personal stuff. I feel exhausted and like making a change, just scared the change will be even worse.",
          "author": "CricketChoice4796",
          "created": 1619538958,
          "upvotes": 1,
          "replies": {
            "gw9iimd": {
              "link": "/r/AskAcademia/comments/mz9ytt/how_to_tell_if_academia_is_or_isnt_for_you/gw9iimd/",
              "text": "Well, I know one thing for sure: they say not to make a big decision when you're depressed. I would say, don't force yourself to make a decision right away. You're starting to think about it, and have gotten some good responses. It's ok to let them sink in and coagulate and take some time making your decision.\n\nNot related to academia per say other than the fact many academics are in therapy, and you need an advanced degree to be a therapist, but if you aren't seeing a therapist, I'd urge you to strongly considerate. You deserve to be happier than you are now, and they can help.\n\nIf you're being cooped up indoors with no social interaction... that can play a big part in how you're feeling too. Be sure to open your curtains every day so you get sunlight and are at least exposed to that natural cycle of sunrise and sunset. Try and get outdoors every day for a walk. And make sure you're connecting with people. Discord helped me a lot. And when I say that, I don't even mean like, reaching out to people for help per say (though do do that). Personally, I've had bad luck with mental health/wellness discords. So I literally just mean do something where you're interacting with other people for the sake of being social so you're not just alone in your head. This is especially important if you live alone and are single.\n\nDoing things to take care of yourself and elevate your mood and decrease anxiety can seem like it takes up a lot of time that you don't have, but, you actually end up being more productive if you're in good health, and everything else can fall in to place and start to make sense when you do. Especially with getting enough sleep. Sometimes you just wake up and have the answers.",
              "author": "JapanOfGreenGables",
              "created": 1619673532,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}