{
  "sid": "q13n0u",
  "link": "/r/AskAcademia/comments/q13n0u/what_are_some_long_term_career_goals_for/",
  "title:": "What are some long term career goals for Humanities scholars?",
  "text": "I'm a final year PhD working through applications and one has asked for an outline of my long term career goals. I'm a bit stumped -- apart from running externally funded, impactful projects and organising conferences, I can't think of anything past \"it would be lovely to get tenure!\" Is it worth saying that I want to publish here? Any ideas or guidance would be greatly appreciated!",
  "author": "Ebonyivories",
  "created": 1633347289,
  "updated": 1634078781,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfckfof": {
      "link": "/r/AskAcademia/comments/q13n0u/what_are_some_long_term_career_goals_for/hfckfof/",
      "text": "They're asking about your goals as a mature scholar in the next 5-10 years. I will note, having been on a lot of search committees, that this is the area that ABDs frequently struggle articulating well, for obvious reasons (your main goals right now are finishing your dissertation and getting a job, which are very short-term, and it takes some time out of the \"I am a worm\" mentality of grad school to figure out what kind of scholar you want to grow into).\n\nOf what you have listed, yes, externally-funded impactful projects (hopefully with a little more specifics than that), and organizing conferences (ditto) are good things to list. Ideas for books you might write after your dissertation book are good as well, and can be necessarily speculative (what is your \"next project\"?). Do _not_ say you want to get tenure — that is obvious and irrelevant to what they are asking you.\n\nOther sorts of things can be along the lines of, \"I'd like to expand the work I've done on X to also encompass Y,\" or \"I am interested in pivoting to include more analyses of X and Y in my work.\"\n\nIt's a difficult question for anyone, but especially someone who is ABD. It is designed to help them see you as a \"scholar\" and not just \"someone who has been writing a dissertation,\" but of course you are mostly still the latter person! Keep in mind that, if you get the job, _literally no one_ will even remember what you said here, much less hold you to it. You just need to make it something you could comfortably talk about in a job interview. This is also the kind of thing that gets asked in phone and in-person interviews, so you need to have a plausible answer to it. From your perspective, you want them to see that you are going to be a mature scholar whose work goes in interesting places and has a bright, bold future — and _not_ someone who is going to just work on whatever it is you did your dissertation on, forever. You want to look deep and broad with infinite potential, not shallow and narrow with a finiteness. And at the same time, you need to look realistic and practical; it needs to look attainable. So it's a difficult path to wend.\n\nGood luck!",
      "author": "restricteddata",
      "created": 1633354481,
      "upvotes": 8,
      "replies": {
        "hfcuesp": {
          "link": "/r/AskAcademia/comments/q13n0u/what_are_some_long_term_career_goals_for/hfcuesp/",
          "text": "Thank you so much for your reply! It's a great help!!",
          "author": "Ebonyivories",
          "created": 1633359133,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}