{
  "sid": "qrtobm",
  "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/",
  "title:": "Calling the contact person, good idea ?",
  "text": "I have just applied for a position for a phd. I know that phds are highly competitive and that he probably has a pile of applications in front of him. Should I try to find his number and call him about my application to ask if he received it and have a quick chat ? This would allow me to stand out. What do you think ? How would one go about finding the contact person's phone number ?\n\nOther tips to increase the chances of being taken for a position by standing out from the other applicants ?\n\nThanks in advance.",
  "author": "ProstateDeGorille",
  "created": 1636660944,
  "updated": 1637385694,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.6,
  "comments": {
    "hk94cir": {
      "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hk94cir/",
      "text": "The contact person may or may not be on the admissions committee. Either way; no. The contact person is who you call if you have questions about the program or process. Calling just to try to \"stand out\" after applying is a waste of their time, and they'll know it.",
      "author": "Weaselpanties",
      "created": 1636666276,
      "upvotes": 17,
      "replies": {}
    },
    "hk8vhrv": {
      "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hk8vhrv/",
      "text": "Now you've submitted you need to leave it. It's too late to have a chat about your application after you've applied.",
      "author": "ACatGod",
      "created": 1636662638,
      "upvotes": 22,
      "replies": {
        "hk8xhi8": {
          "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hk8xhi8/",
          "text": "Is that some kind of an unwritten rule ? I could say that I did not have time to call since I only saw the offer a few days before the deadline and ask some questions about the publications opportunity and so on ?",
          "author": "ProstateDeGorille",
          "created": 1636663459,
          "upvotes": -6,
          "replies": {
            "hk8z0tp": {
              "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hk8z0tp/",
              "text": "The point of speaking to the PI is to help you learn about the job so you can decide whether to apply and to tailor your application better. We know when someone is just speaking to us to impress us. I for one feel that's just a waste of my time . You're not interested in what the PI has to say, you just want to be noticed and they're going to notice that. \n\nIt's also weird to put in an application and then contact them to say you want to learn about the job. It suggests you've applied for a job without having done your research.\n\nLastly, email not phone. Ask if you can call someone and then arrange a time. If it was me you'd either get me in a middle of a meeting or you'd get me in one of the few breaks from meetings I get during the day. Either way I wouldn't want to talk to you, blunt as that sounds. This kind of conversation needs dedicated time, not 5 minutes without warning.",
              "author": "ACatGod",
              "created": 1636664088,
              "upvotes": 24,
              "replies": {}
            },
            "hk94m33": {
              "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hk94m33/",
              "text": "So... you didn't plan ahead and research PhD options with plenty of time before the application deadlines? You applied last minute without knowing what the program was really offering?\n\nThats how that will come across.",
              "author": "Weaselpanties",
              "created": 1636666389,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "hk9jkl8": {
      "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hk9jkl8/",
      "text": "If you really want to reach out, don’t call, but send a brief email to the professor(s) you applied to informing them that you submitted your application. Mention some common research interests & thank them in advance for taking the time to review your application.",
      "author": "DazzlingLink1740",
      "created": 1636672844,
      "upvotes": 3,
      "replies": {}
    },
    "hkarrno": {
      "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hkarrno/",
      "text": "Call?  Call?  Seriously?\n\nYou cold call me and you are going to end up with a rattled and confused PI who is not going to be happy.\n\nThe appropriate route would be to email and ask for a chat, at the PIs convenience.\n\nHowever, in this case you would be best to leave well alone as the application is already in.",
      "author": "Life_time_learner",
      "created": 1636694298,
      "upvotes": 2,
      "replies": {}
    },
    "hkammci": {
      "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hkammci/",
      "text": "Typically the time to call and talk to the PI/find out program details/check the vibe of a potential boss/attempt to make a good impression via phone skills is before submitting an application. But I can see sending a brief email saying that you sent in your application and look forward to hearing more, thanks for considering. etc.",
      "author": "RacecarGibson",
      "created": 1636691479,
      "upvotes": 1,
      "replies": {}
    },
    "hkdl487": {
      "link": "/r/AskAcademia/comments/qrtobm/calling_the_contact_person_good_idea/hkdl487/",
      "text": "Contacting at this point would make you stand out ---- negatively.",
      "author": "matthewsmugmanager",
      "created": 1636749795,
      "upvotes": 1,
      "replies": {}
    }
  }
}