{
  "sid": "qdjwf2",
  "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/",
  "title:": "Need final year Ph.D. survival guide: What was your daily routine like during the final year of dissertation?",
  "text": "I really want to know how you chalked out your time, tips and tricks to help you through the day, and divide your time between various projects, post-doc scouting etc when it came to writing disseratation",
  "author": "nerdcorner",
  "created": 1634918109,
  "updated": 1635184090,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.92,
  "comments": {
    "hhmwi58": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhmwi58/",
      "text": "(Note: My situation may have been different than most stage of life, parent, pandemic was in full swing, etc.)\n\nIn general, I tried to stay pretty aware of my capacity and ability to focus (and holistic priorities). For me, that meant beginning work when my kids started school, they remote schooled at that point, and working until I wasn’t productive any longer. I took mini breaks along the way as needed each day, but could usually get in a strong 3-5 hours. Sometimes I would try again later in the evening, sometimes not. I was careful to not completely exhaust myself and tried to pick “something productive” to do each time. Sometimes that would be more analysis or writing, sometimes it was setting my margins, formatting a table to fill in later, outlining table of contents, etc. Sometimes, I just couldn’t get into the work (I’d usually try at least 20-30 min) and so I’d just stop that day and do something else productive like take a walk, clean the house, call a friend, take a nap, spend extra time cooking a fun meal, etc. I tried to organize things in a way that would give me some margin so I wasn’t any more stressed toward the end than was necessary.  Most certainly parts of the process are by nature just really rough, but scheduling margin helped me be able to have some wiggle room I days I needed it. By scheduling margin I mean not booking myself so tight that I or my committee were rushing to get things done last minute. I went by the motto “Just because I can’t control everything doesn’t mean I can’t control anything.” and I gave myself a lot of grace.",
      "author": "REC_HLTH",
      "created": 1634919117,
      "upvotes": 30,
      "replies": {
        "hhnd49n": {
          "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhnd49n/",
          "text": "That motto is fantastic!! Thank you for sharing.",
          "author": "sinfonia21",
          "created": 1634925842,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hho0qm7": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hho0qm7/",
      "text": "I followed a very structured daily routine, working no more than 8 hours per day in the 9-13, 15-19 periods. When you are not working, if possible, I changed rooms. When writing, I used vìolin music to concentrate better.\n\nBut the most important thing is to remember: a good dissertation is a done dissertation, a perfect dissertation is never finished. \n\nYou can do it, you will do it. \n\nI repeated the mantra to make it, and I managed.\n\nMy best wishes for you!",
      "author": "MezzoSole",
      "created": 1634935620,
      "upvotes": 17,
      "replies": {}
    },
    "hho78zw": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hho78zw/",
      "text": "First off: no kids, self-sufficient partner, easy dog, full-time job. \n\n1. Sleep 8-9 hours. Sleep keeps your brain healthy. A tired brain does bad work that costs you more time in the long run. \n\n2. Get up at 6:30 am and take half an hour to just drink coffee, read something fun (not on a screen), and wake up. After that, work about an hour, mostly analyzing data or writing. Then walk the dog and go to work. \n\n3. Done with work between 4-5:00 pm. Come home and take the dog on a longer walk. Then write/analyze for another hour, then dinner with partner. After dinner, watch TV (usually reruns or something boring) while skimming articles, books, and other sources for 2+ hours. Then shower and bed. \n\n4. On weekends, spend full mornings doing analysis, writing, and editing (not too much editing though - easy to get lost down that rabbit hole, but you need to focus on production before revision). Spend afternoons doing anything BUT your dissertation, particularly something fun, relaxing, outdoors, or social. \n\n5. At least once a week, check in with someone about your writing - a classmate, writing buddy, advisor, mentor, etc. But make it social, fun, and accountable. Put it in your calendar. Make the time. Don't let yourself become isolated. \n\n6. I also took at least two days off work per month just to focus on my dissertation and used every holiday (including at least three weeks off in different places) for over a year for that purpose. \n\nStarted collecting data in July, finished in October. Constructed main theory from September to November. Writing from August to December, starting with lit review and methodology, ending with discussion, findings, and limitations/implications. Turned in the draft to my committee in late December and defended in late January. \n\nHard, but worth it. Kept a steady pace. Prioritized sleep, healthy eating, regular walking, and not too much caffeine. It's a marathon not a sprint. Prioritized important relationships, but said no to a lot of things, including all other hobbies. This isn't forever. \n\nNo matter what, good luck to you.",
      "author": "monmostly",
      "created": 1634938552,
      "upvotes": 8,
      "replies": {}
    },
    "hhnegp4": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhnegp4/",
      "text": "I just finished mine, so I'm just starting to digest some lessons from the experience. Above all, I recommend putting time and effort into designing a detailed outline that actually reflects the structure of the work you intend to write. This way, you can always write with the larger structure and purpose in mind, breaking the whole thing into smaller parts, each of which you can manage to write in a few days, provided that you have all the research and materials ready.\n\nAlso, be aware that your actual writing will start to deviate from your original plan, and you may likely fall behind the ambitious goals you set out in the beginning. Take some time each day to think about whether your actual writing is following the outline you created. What is a contingency plan in case things aren't working out? How can you ensure that your objectives are addressed clearly in the end?\n\nFor a daily schedule, I honestly recommend dedicating your entire day to writing with modest breaks every few hours to get away from the screen/paper (approx. 20 minutes long, excluding meals and sleep). If your outline is well-conceived, and if you've done all your research, the writing stage shouldn't stress you out to the point of exhaustion. If it is, take a step back and reconsider the first two points. If you take too many long-term breaks for other projects, you risk procrastinating and slowing down, which would force you to write more later with less time for revision. Instead, try to get a first draft written earlier on, and then you can come back later and revise periodically.",
      "author": "ilDavide2100",
      "created": 1634926383,
      "upvotes": 6,
      "replies": {}
    },
    "hho5p35": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hho5p35/",
      "text": "Literally the only advice is to find what works for YOU and stick to it and not let other people's routines or judgement of YOUR routine fuck you up.\n\nFor example I had my final year during covid. This meant I was going into the lab only when we could (rotating schedule) but since I'm a night owl I often took afternoons and evenings. \n\nWe pushed through experiments and I would write during every other waking moment, and often work late into the night when the world was quiet and it was just me, the office floor, and my laptop. \n\nMornings were for a workout (if I had time), a meal, emails, etc. \n\nSome people will tell you the only way to be productive is to get ready for the day and work a normal work day. \n\nJust...ignore the advice. The best thesis is a finished thesis. Do what you need to do, within YOUR living conditions (do you have kids? Spouse who shares the office - I did - pets?) to get it done and stop reading guides on how you should get up 6am and do a HIIT workout and then dress in work attire and be at your desk 8 to 5.\n\nAdditionally ignore anyone who is not currently or who hasn't already done this. This means junior lab members, technicians, whatever - who may have ideas about when you should be putting in face time. This has been a big issue pre-covid at my institute and has really hindered the writing progress of folks who felt like they had to be \"present\", even if it wasn't the most productive place for them with a thesis/dissertation deadline looming.",
      "author": "capybaracreek",
      "created": 1634937834,
      "upvotes": 6,
      "replies": {}
    },
    "hhnwdvs": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhnwdvs/",
      "text": "It was the only time I regularly went to a library. To use the computers mind you :-) Library had duel monitors, comfy chairs, quite setup. \n\nHeadphones, Spotify Deep focus, and way too much Yerba Mate. That was my life till that dissertation was done.",
      "author": "GetCookin",
      "created": 1634933761,
      "upvotes": 3,
      "replies": {}
    },
    "hhof27t": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhof27t/",
      "text": "Without knowing your specific situation, here are some generic yet proven to be working strategies: have a routine, go about it daily (it doesn't mean just writing/putting words down), and be specific about what you're gonna work on during a time block. Some people like to join writing groups for support. Books like Writing Your Dissertation 15 minutes A Day or Wendy Belcher's Writing Your Journal Article in 12 Weeks provide some scaffolding, if you're not good at envisioning the process.",
      "author": "solo-melon-cho",
      "created": 1634942252,
      "upvotes": 3,
      "replies": {}
    },
    "hhpob86": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhpob86/",
      "text": "wake up\n\npanic \n\nstare at wall\n\npanic\n\ngo to sleep",
      "author": "AlexanderHBlum",
      "created": 1634967330,
      "upvotes": 3,
      "replies": {}
    },
    "hhormpx": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhormpx/",
      "text": "Go to lab and write/ Facebook, come home and smoke weed, drink, and play videogames. Repeat.",
      "author": "BronzeSpoon89",
      "created": 1634948648,
      "upvotes": 2,
      "replies": {}
    },
    "hhwejiu": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhwejiu/",
      "text": "During my PhD i worked 12 to 16 hours daily, including weekends. Every once in a while i would take one day off and sleep 12 hours or more to catch up. Writting the dissertation was easy, copy paste from the five articles i have published. Then work on extra chapters of ongoing projects.\n\nDuring my last year i also started applying for postdocs. For my postdoc i switched fields (a very drastic switch in disciplines not just topic). During my last months as a PhD i read hundreds of papers about my new field mainly by using audioread function on pdfs. So, i was basically listening to papers all the time. I used this knowledge to submit several postdoc fellowships. Remember, these fellowships were about something i had no experience or published work and BEFORE i even set foot in my postdoc lab. One reviewer even commented that he/she did not believe i wrote the application given those exact reasons. \n\nNow i am finishing my postdoc, after 5 years of working M-F 10-12 hours. I published some major work in my new field and currently interviewing at top institutions.\n\nBottom line... once you stop considering your work as work then it is not hard to work many hours and advance your career. Obviously, i am not saying people should work the way i did but just answering your question.",
      "author": "Outrageous_Ad1882",
      "created": 1635104565,
      "upvotes": 2,
      "replies": {}
    },
    "hhok4xz": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhok4xz/",
      "text": "I like short term goals and breaking things up so naturally I productively procrastinated by writing my headings and sub headings. I kept a routine waking up at the same time every day, even weekends and made sure I had my time to enjoy my coffee. I literally used that as my motivation since I love coffee. Since my brain is better in the morning I would read articles and write for one of those subheadings. If I thought of a change to data or figure, I would just write a note. If it got to the point were I was staring at the same paragraph forever I would force myself to finish getting what I needed from that paper (don’t give an instant reward to “not feeling like it”) and then go for a short walk or start those more mindless “fun” changes to the data. Do some editing in the afternoon, and quit between 5 and 6 to make/eat dinner. In the evening I would look for papers I needed for the next subheading. It even got to the point where I procrastinated on my intro by writing my conclusions haha… just think about the task at hand and focus on that… and build in things to look forward to… like coffee :)",
      "author": "Acrobatic_Future_412",
      "created": 1634944812,
      "upvotes": 1,
      "replies": {}
    },
    "hhqjqyx": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhqjqyx/",
      "text": "So much good advice on here. I had a kid and a job and a spouse. I think I got like 4 hours of sleep a night for more than a year and turned into a monster bitch. I just kind of gritted it out and isolated myself when I had things I had to complete. Academia requires you to be selfish sometimes and it's ok. Lessons you can take from this:\n1) make time for sleep. Your work will be better and anyone who has to suffer your company will appreciate it.\n2) if you have time for self care, do that shit! Anyone who has to suffer your company will appreciate your reduced stress load.\n3) do put yourself first and get that dissertation done! Otherwise all the work and investment will be for nothing. Get to the other side. It's way better!\n4) eat as well as you can and don't live off caffeine alone. Your mind will be sharper and writing will come easier.\n5) if you have writers block, it's ok. Take a break and try again in 20 minutes. Sometimes this will allow you to be more productive.\n\nAmazingly I managed not to get divorced and my kid doesn't hate me but I was so fucking miserable during this time period because I was so. Very. Very. Tired. But I made it. And you can too.",
      "author": "anemone_rue",
      "created": 1634993282,
      "upvotes": 1,
      "replies": {}
    },
    "hhsioqj": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhsioqj/",
      "text": "I was in my first full-time faculty position. What worked for me was blocking off the first few hours of my day solely for writing. I wrote every day, without fail, and I did not let anything interfere with that time. \n\nI had a set goal for when I wanted to be finished. For each month I set milestones. For each week I set goals for outlining, writing, and revising, and made a loose plan for each day. Most days went according to plan, some days didn’t - but I always made my weekly goals and that kept me on track. \n\nPlan the work, and work the plan!",
      "author": "GoldenBrahms",
      "created": 1635028023,
      "upvotes": 1,
      "replies": {}
    },
    "hhxyva7": {
      "link": "/r/AskAcademia/comments/qdjwf2/need_final_year_phd_survival_guide_what_was_your/hhxyva7/",
      "text": "I love some of the comments here! I finished my dissertation in 1996. My rituals were these: I used to take long walks while listening to cassette in a walkman\\* to rehearse my thoughts and plans for the day; really enjoy my first cup of coffee before writing, savor it, bask in it, focus on it; internalize the motto, \"divide and conquer... divide and conquer... divide and ... etc.\"; work nomadically in different coffee shops; and finally (hardest one), if possible fall in love with someone wonderful.\n\n\\*original prototype of the Apple iPod, but 7 times thicker with undigital sound quality; however, cassettes could be repaired with scotch tape, which was nice.",
      "author": "UTArlingtonprof",
      "created": 1635131176,
      "upvotes": 1,
      "replies": {}
    }
  }
}