{
  "sid": "noq3oh",
  "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/",
  "title:": "How to turn down first authorship? PI contributed way more to this paper than I did",
  "text": "Field: Neuroscience, Year: mastered out of PhD program 4 years ago, USA\n\n(I apologize ahead of time if this has been answered before but I couldn't find anything for this specific situation)\n\nSo, I have been out of grad school for a while. A few weeks ago, my former PI/advisor reached out to me about submitting a paper based on data I collected which was part of my Master's thesis. She has apparently been analyzing and re-analyzing the data all this time and has put me as first author on this paper (which she has written \\~90% of). The thing is, my contribution was pretty much just data collection, plus analysis using various equations and programs that my PI created (I don't completely understand the math involved, but my PI seems to think otherwise). I also did not design the experiment. Collecting data in this case involved a fair amount of training and skill, but to me it was the easiest part of my thesis because I really struggle with writing and data analysis.\n\nIs data collection really all that's necessary to be first author? My PI is an extremely kind person and I don't feel that I've done enough to be first author. What's the right way to ask her to switch authorship order with me? (it's 3 authors total and she's 3rd). Or should I just take the first authorship and not say anything?\n\nEDIT: Wow, thanks everyone for clarifying this!! I didn't know about the PI taking last author (first gen in academia here). Since the second author contributed to some of the data analysis (but in comparison I did more of the work), I guess there's no issue! I just wanted to be sure I wasn't taking undue credit.",
  "author": "chickenpede",
  "created": 1622427293,
  "updated": 1634081266,
  "over_18": false,
  "upvotes": 145,
  "upvote_ratio": 0.96,
  "comments": {
    "h01iths": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01iths/",
      "text": "For a PI, last author is generally more useful than first author",
      "author": "mediocre-spice",
      "created": 1622429187,
      "upvotes": 75,
      "replies": {
        "h02a7ru": {
          "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h02a7ru/",
          "text": "Why? I am kind of new to this. I submitted a paper which was contributed mainly by me and was appointed as first author. However, my PI insist of being corresponding author even though I am perfectly fine for that job but I gave it to him. Do they benefit more as last author + corresponding author?",
          "author": "SpaceAuk",
          "created": 1622449627,
          "upvotes": 10,
          "replies": {
            "h02c704": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h02c704/",
              "text": "In many fields, being the first author signifies that you are the student who did most of the hands-on work, and being the last and corresponding author signifies that you did the role of the supervisor (big picture planning, brought in funding, oversaw the work, trained the student, etc).  \n\nA PI who wants to be last+corresponding author is probably at the point in their career where they need to demonstrate to others that they're forming a group and training up students, not just doing things alone themselves.  \n\nOtherwise, it could simply be a precaution.  For example, it could be that your professor or a colleague of theirs had a student who did something incorrect or unprofessional when they were corresponding author for their first paper.  In that case, they may decide that it's prudent for them to be the corresponding author on other students' first papers so they can vet communication and use this to train the students before letting them do it.",
              "author": "polyphonal",
              "created": 1622451568,
              "upvotes": 30,
              "replies": {}
            },
            "h02cg7n": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h02cg7n/",
              "text": "As corresponding author they are taking ultimate responsibility for the contents of paper. As the PI of the group it's appropriate they are last author as they run the group and the buck stops with them. That position indicates the seniority of the authors but also means if there is any question over the integrity of the paper they are responsible for handling that and accountable if something is amiss. They shouldn't be passing off that responsibility to junior staff.",
              "author": "ACatGod",
              "created": 1622451820,
              "upvotes": 9,
              "replies": {}
            },
            "h02cgfd": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h02cgfd/",
              "text": "PIs are almost always corresponding author. There's always a high turnover of lab members, and many drop out of academia, so it makes sense for the PI to be the main contact on papers.",
              "author": "xaranetic",
              "created": 1622451827,
              "upvotes": 8,
              "replies": {}
            },
            "h031n5x": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h031n5x/",
              "text": "It shows you're successfully training others/leading a group vs just doing everything yourself. \n\nCorresponding is just because trainees get \"lost\". You might be fine as corresponding right now (and a lot of people contact first author anyway), but in 5 or 10 years, you'll probably have switched institutions or careers.",
              "author": "mediocre-spice",
              "created": 1622470778,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h01g86r": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01g86r/",
      "text": "Did you contribute more than the second author? The PI needs to be last, corresponding author. I had a similar situation from undergrad. It was a tiny liberal arts college and a tiny lab, I had a “first author” paper come out 4 years after I graduated, because I technically contributed more to the (very slow) project than the other authors besides the PI bc of my honors thesis research...",
      "author": "oelkat",
      "created": 1622427688,
      "upvotes": 181,
      "replies": {
        "h01idb5": {
          "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01idb5/",
          "text": "This. As a PI, the question of who gets first author is who, other than me, did the most work on the project.\n\nAlso, first author papers as a PI, in my field, count for way less than last/corresponding author papers for promotion and tenure.",
          "author": "Eigengrad",
          "created": 1622428918,
          "upvotes": 127,
          "replies": {
            "h01o2ke": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01o2ke/",
              "text": "I...honestly did not know that until today. I'm still learning some of the intricacies of academia (first gen kid + absentee advisor). Is there a reason for that? Is it the case for other fields? (last question is more rhetorical, I see you're in chem).",
              "author": "ImpossibleGuava1",
              "created": 1622432400,
              "upvotes": 40,
              "replies": {
                "h01owcw": {
                  "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01owcw/",
                  "text": "It can be very field specific, as are a lot of authorship questions. \n\nIt’s the case in a large number of the experimental lab sciences, that work on a “research group” basis. These fields (generally) have labs that have a hierarchical structure and work together on research projects. They’re (usually) headed by a single faculty member, the PI or Principal Investigator. This person directs the overall research, and brings in funding, trains and mentors the lab members, etc. with larger groups, they’re rarely actively involved in lab work, but mostly writing and overseeing. The lab then has post-doctoral fellows, research staff, graduate students, undergraduate students, etc. who work on subsections of research projects. \n\nWith this structure, the PI position is typically the last and corresponding author, and the other folks who did the experimental work and often (but not always) a lot of the writing are ranked in decreasing contributions from first author. With multiple PIs on collaborative papers, it’s usual that the one who has the first author in their group goes last. \n\nSocial sciences can be a mix, from what I can tell, with some necessitating first authorship for faculty and others not.",
                  "author": "Eigengrad",
                  "created": 1622432926,
                  "upvotes": 46,
                  "replies": {
                    "h01rjsu": {
                      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01rjsu/",
                      "text": "Yep. This is basically the way that the lab I'm in (as an undergrad) works. \n\nWe have the PI, who's not super involved in our day to day. Then we've got our three satellite missions. They're basically data collection instruments for the PI's grad students, who are doing the actual papers and such. (I think. We might actually be sending data directly to NASA and DoD)\n\nDirectly under the PI, you've got Project Managers and Chief Engineers for each satellite, who correspond with vendors (launch providers, component vendors, Nanoracks, who make the stuff that actually pushes the satellite into the void, etc) and our funding source (so Space Force or NASA). \n\nThen under *them*, you have subsystem leads, like me, who basically report things to management, and delegate tasks to the members of each subsystem, who are designing and building the hardware and software.  \n\nAnd on the phd student side there's a separate hierarchy that I'm not super familiar with, because we don't interact directly, at least at my level",
                      "author": "BecomingCass",
                      "created": 1622434680,
                      "upvotes": 9,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "h01vims": {
          "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01vims/",
          "text": "This is a really weird, field specific thing, but last author is not automatically corresponding. In my subfield of biology it's fairly uncommon for the PI to be corresponding - especially if the paper is part of the first author's dissertation. First author is first author, last author is last author, and corresponding can be whoever you choose.\n\nIt's also entirely not a given that the PI is excluded from first author work that comes out of their lab. PIs certainly have pet projects overarching goals where they aren't necessarily collecting the data directly themselves but are drawing from multiple field seasons or synthesizing and taking lead.",
          "author": "guttata",
          "created": 1622437427,
          "upvotes": 28,
          "replies": {
            "h021xtq": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h021xtq/",
              "text": "Yeah I don’t think people pay attention to corresponding as much as first/last. But when you work in an area where the PI doesn’t get their hands dirty, last authorship is very standardized.",
              "author": null,
              "created": 1622442325,
              "upvotes": 12,
              "replies": {}
            },
            "h02pdhi": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h02pdhi/",
              "text": "I just want to reply for the benefit of people in other fields; PI also does not go last in all areas of science. For mine, it is approximately hierarchical by effort and lab preferences (sometimes with institutions being grouped for convenience in affiliation marking in LaTeX), and the first-author generally corresponds regardless of juniority, unless unavailable. A PI (not necessarily *the* PI) might be at the end of the list if they really didn't do anything after securing the funding. But the last author could be any person with a minor contribution to the actual work (labor). In a field with specific niches, many collaborators, many projects with distinct PIs, and not much social hierarchy, everyone generally can guess what an individual author did.",
              "author": "Jon3141592653589",
              "created": 1622463339,
              "upvotes": 2,
              "replies": {}
            },
            "h0282c1": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h0282c1/",
              "text": "I wrote two papers with my PI where I did most writing on one and him the other, and each were first author on the part they wrote most of.  So not particular rule not to have them in that spot, but last author is a place to pay attention to.  There were only two author on our papers, which is different too.  If we had 3 authors, he'd probably be last on both and the third author would write the second paper.",
              "author": "noguchisquared",
              "created": 1622447609,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "h01l78e": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01l78e/",
      "text": "As others have said, the PI typically will take the last authorship place. \n\nWith that said I greatly appreciate your concern in making sure others get fair credit for their work! I've heard some horror stories that tell me we need more people like you.",
      "author": "ooof_buddy",
      "created": 1622430627,
      "upvotes": 42,
      "replies": {}
    },
    "h01k9qi": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01k9qi/",
      "text": "Don’t - PI knows what ordership is best for all involved.",
      "author": "AureliaGreenwood",
      "created": 1622430062,
      "upvotes": 93,
      "replies": {
        "h01p1ta": {
          "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01p1ta/",
          "text": "This is really the only answer.",
          "author": "ellaAir",
          "created": 1622433024,
          "upvotes": 22,
          "replies": {}
        }
      }
    },
    "h01p5fv": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01p5fv/",
      "text": "Like what others have mentioned here, PI is generally the last author. As there are 3 authors, it becomes a question of who is first and who is second. Based on what you have written, it seems that you did most of the work of collecting data, whereas your PI did most of the work of analyzing and interpreting the data. This means that the other author did minimal work, or at least less work then you. Hence, it is a logical choice for you to be first, and the other author to be second.",
      "author": "Jean_Diharo",
      "created": 1622433088,
      "upvotes": 11,
      "replies": {}
    },
    "h01qtkr": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01qtkr/",
      "text": "2 most important positions in the paper is first (student/postdoc that contributed the most) and last (PI aka the boss, or whoever funded the project). In our field, we actually look mostly at the last author before reading the paper.",
      "author": "Neerolyte87",
      "created": 1622434191,
      "upvotes": 9,
      "replies": {}
    },
    "h01mq3o": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h01mq3o/",
      "text": "PI goes last, always, regardless of how much work they do on the project. They could do 99% or 1% and they’d still go last, because that’s the position in the list of authors that tells everyone who the PI is!",
      "author": "WoodwardHoffmannRule",
      "created": 1622431564,
      "upvotes": 16,
      "replies": {}
    },
    "h02ewk1": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h02ewk1/",
      "text": "AS others have said, last authorship is often more valuable to a PI. I would suggest to talk to your PI on the reasons behind the first authorship. Your PI may have valued your contributions in a different light than the way you perceived it. Either way, you have worked hard, so give yourself a pat on the back.",
      "author": "amberbryan",
      "created": 1622454241,
      "upvotes": 2,
      "replies": {}
    },
    "h035jd6": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h035jd6/",
      "text": "I like the convention in most mathematics papers of listing the authors in alphabetical order.",
      "author": "tdmorley",
      "created": 1622472793,
      "upvotes": 2,
      "replies": {
        "h03exoz": {
          "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h03exoz/",
          "text": "I feel a bit ignorant here coming from medicine - but then how do people know who to refer to or contact to collaborate, ask questions etc. \n\nReading and discussing papers in my lab (often there will be 10 + authors) how would I ever keep track of who did what?",
          "author": "boriswied",
          "created": 1622477496,
          "upvotes": 2,
          "replies": {
            "h03f618": {
              "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h03f618/",
              "text": "A mathematics paper is rarely over 4 authors. And it is presumed that you can contact and collaborate with any author.",
              "author": "tdmorley",
              "created": 1622477614,
              "upvotes": 2,
              "replies": {
                "h04es26": {
                  "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h04es26/",
                  "text": "Makes sense, in the study i'm a part of atm, theres 2-photon microscopy, laser speckle, intrinsic optical signal imaging, MRI, etc. etc.\n\nEverything has a respective expert associated, and then there's doing the mouse surgeries, etc. etc. so it would be extremely difficult to assume all authors have a good overview of all parts for the firstt contact. But i see what you mean! I wish i'd studied maths sometimes!",
                  "author": "boriswied",
                  "created": 1622495261,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h037gta": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h037gta/",
      "text": "As many have pointed out, the significance of author ordering is FIELD SPECIFIC, even in STEM. \n\nFor example, in the earth sciences, the author is generally in order of contribution. Last author has no meaning in my field. In fields that follow this tradition, the first author is generally: (1) the one who did the most work and/or wrote most of the paper; or (2) the PI, because they secured funding/came up with the project and did most of the management. \n\nIt sounds like the consensus shared in this thread answered the OPs question. However, I wanted to make this point here in case someone in a non-neuroscience field gets confused.",
      "author": "MoreCobbler",
      "created": 1622473767,
      "upvotes": 2,
      "replies": {}
    },
    "h03u05z": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h03u05z/",
      "text": "Don’t. It wouldn’t have been offered to you if you didn’t deserve it (at the very least, more than whoever else your old PI might offer it to next).\n\nI declined once, and first authorship ended up going to someone who had done far less than me. It didn’t feel right to take it at the time, but in retrospect I should have rolled with it. Not least because it’s now one of my most cited publications.",
      "author": "sirtwixalert",
      "created": 1622484858,
      "upvotes": 2,
      "replies": {}
    },
    "h020d0t": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h020d0t/",
      "text": "First of all, PIs need papers so it doesn’t matter who is 1st author when she has last authorship. Sounds like she needs publications and wanted to get it published and you did the data collection so win-win.",
      "author": null,
      "created": 1622441083,
      "upvotes": 1,
      "replies": {}
    },
    "h027rwu": {
      "link": "/r/AskAcademia/comments/noq3oh/how_to_turn_down_first_authorship_pi_contributed/h027rwu/",
      "text": "The PI goes last and the lead student or researcher who does most work goes first. That's the CS way, IDK about others.",
      "author": "lunaticneko",
      "created": 1622447349,
      "upvotes": 1,
      "replies": {}
    }
  }
}