{
  "sid": "ecvd7m",
  "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/",
  "title:": "Grant funding was cut and post-doc offer rescinded, is this normal and what do I do this late in the game?",
  "text": "I don't want to name the agency or lab, but a very well known research body offered me a post-doc as part of one stage of multi-stage grant funding. Essentially, this was an exploratory grant. I've been helping them since the beginning of this year, I went to the final pitch, and while I have not been essential to the core robotic form factor, I am one of the only experts who can investigate a specific vital function of the robot. Our lab was told that we had received the grant this summer, and that the money would come in during October. Note that because I've had a tenative offer since August, I didn't apply for other postdoc grants. It's been an insane sprint to the finish since we had our first child in April and had to redo experiments over the summer.\n\nI successfully defended on Nov 1. We celebrate, I'm feeling amazing, we hear one of my chapters was accepted for journal publication with revisions, life is great. Cue a couple of weeks ago. My advisor calls, he tells me that the agency has cut all external collaborators from the project. They are only doing internal funding at this stage now, and saving external for the next phase. My advisor is just as, if not more screwed than me. I am heartbroken.\n\nMy advisor has no other grants to support me to speak of, but has managed to cobble together $14K from various funds and department support for the spring semester through summer, starting in January. This is basically TA pay, or worse, but its all he can do. Our agency contact said there's a small grant that would add about $8K of pay for that time period.\n\nWhat do I do? This feels like an insult and a slap in the face, but quite frankly almost every other opportunity has passed for this cycle. The other difficulty is child care. My wife works full time, and I am the defacto caretaker of our kid until receiving a fully funded position.  \n\nMy current thought, while still applying and contacting people through the holiday season, is to take the position as a compromise and pay for three days of childcare.  This would allow me to get work done, to keep applying for jobs and other grants, and to weather out the year while getting to a less tenuous position.",
  "author": null,
  "created": 1576772230,
  "updated": 1634081929,
  "over_18": false,
  "upvotes": 105,
  "upvote_ratio": 0.99,
  "comments": {
    "fbdx2wb": {
      "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbdx2wb/",
      "text": "I mean, nothing you can do. I would take it and keep looking for jobs. Given the situation, I think he would understand if you left quicker than you would otherwise. \n\nThis is part of the problem with grant funding working the way it does. \n\nAs for how normal it is, it's not normal exactly, but unless things were signed to the contrary it can happen. Besides that, professors have to seek to fill positions that haven't even been funded yet all the time. Things looking like they are gonna work out and then falling through is not uncommon.",
      "author": "Average650",
      "created": 1576773273,
      "upvotes": 63,
      "replies": {
        "fbf0k5m": {
          "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbf0k5m/",
          "text": "Is it normally confirmed, and then the grant downsized about a month before the start date?  Because that's unusual in my experience.",
          "author": null,
          "created": 1576798466,
          "upvotes": 4,
          "replies": {
            "fbff34h": {
              "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbff34h/",
              "text": "It is unusual. But, especially if it's a company, they can do what they want until the paperwork is done.\n\nIt would be unprofessional, but let's not pretend everyone is always professional.",
              "author": "Average650",
              "created": 1576809031,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fbdx8xb": {
      "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbdx8xb/",
      "text": "That sucks but I had a similar thing thing happen to me for a postdoc-professor was supposed to move from university A to university B but for various reasons didn't, so my offer got rescinded. Luckily for me I was able to live with my parents for a few months, but had to begin the job search over (I am single so don't have a spouse or kids, and lease expired on my apartment). This did allow me to finish up all of my papers from grad school.\n\nAll told it took about 6 months from the offer being rescinded to me starting my new postdoc. The new postdoc was actually a better fit me in the end (closer to parents/family, a little better pay).\n\nReach out to all the former group members and your collaborators to see if there are any openings.\n\nEdit to add: Here are some other opportunities since I see that you are in engineering\n\nNRC Postdocs:  [https://sites.nationalacademies.org/pga/rap/](https://sites.nationalacademies.org/pga/rap/) \n\nNASA:  [https://npp.usra.edu/](https://npp.usra.edu/) \n\nMost DOE labs list postdocs on their websites.  Here is Oak Ridge's Postdoc programs  [https://jobs.ornl.gov/go/Postdoctoral-Jobs/4537100/](https://jobs.ornl.gov/go/Postdoctoral-Jobs/4537100/) and Argonne's  [https://www.anl.gov/hr/postdoctoral-applicants](https://www.anl.gov/hr/postdoctoral-applicants)",
      "author": "jpc4zd",
      "created": 1576773381,
      "upvotes": 27,
      "replies": {
        "fbf0kzv": {
          "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbf0kzv/",
          "text": "Thank you!  This is what I was hoping for.",
          "author": null,
          "created": 1576798483,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fbe1jj9": {
      "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbe1jj9/",
      "text": "This could have happened to me.  There was an incredible post-doc offered to me contingent on them receiving a grant.  At the same time, I was offered a faculty position at a small college.  The college wanted me to give them an answer while all the post-doc could say was that the program officer thought they would be funded, but nothing in writing.  I took a leap of faith and turned down the faculty position and fortunately the grant was funded, but it could have just as easily gone the other way with me having no job. \n\nUnfortunately, this is the life of soft-money positions.  If you were already at the institution, they probably would have come up with some bridge funding, but since you are not there yet, the admins probably don't feel much pressure to help you, after all, they have the PI to take care of also.  The small pay is a nice gesture, but I understand that is not enough to live on.  \n\nThere is nothing you can do to change what is happening.  You have to figure out some way to make a living.  You will have to start your job hunt over again.  You will also need to see what can be done in the mean time.  Odds are, you have 2 possibilities: 1) talk with your current supervisor to see if there is any way you can stay on a little longer while you search or 2) take the low paying position while you search.  In either case, you would be clear that it is a temp position that you will leave as soon as a full-paying position is obtained.  Good luck.",
      "author": "manova",
      "created": 1576776139,
      "upvotes": 8,
      "replies": {
        "fbf0p7l": {
          "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbf0p7l/",
          "text": "The money wasn't soft though.  It WAS awarded, and then post-award they slashed externals.  It just seems off, but no one has said as much yet.",
          "author": null,
          "created": 1576798566,
          "upvotes": 1,
          "replies": {
            "fbf3uz7": {
              "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbf3uz7/",
              "text": "Oh, I miss understood.  Wow, that is a new one to me.  When I was in grad school, I was working in a lab with a NSF grant.  After about year 2, a new program officer came on and decided the grant did not fit the mission of their program and yanked it.  About 4 or 5 grad students lost their funding because of that, but the department picked up their stipends.",
              "author": "manova",
              "created": 1576800865,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fbe4ta4": {
      "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbe4ta4/",
      "text": "At least in my field, there isn’t a “season” for postdocs like there is for faculty searches- new postings come up all year.\n\nThe situation you’re in sucks, but you may still have a good shot at getting a postdoc soon.",
      "author": "Eigengrad",
      "created": 1576778200,
      "upvotes": 8,
      "replies": {}
    },
    "fbee898": {
      "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbee898/",
      "text": "First of all, I'm so sorry that happened to you. I was in a similar situation at the end of my Ph.D. I ended up teaching adjunct in my Ph.D. department for the spring semester while I looked for post-doc positions, then I got very lucky in finding the one that I did. Is teaching something you're interested to do to help supplement? Since you have a child-care challenge, maybe you could teach night classes? The only down side to that (besides the obvious lack of family togetherness in the evenings) is that you would be \"stuck\" in your current position until the spring semester ends.\n\nAs Eigengrad said, in my field there is no \"postdoc hiring season,\" like there is with faculty. Postdocs are hired continuously throughout the year. \n\nFinally, are you set on a long-term academic career, or is industry something you'd consider? Industry jobs are (often) higher paying and (tend to) have more \"normal\" hours. \n\nAnyhow, the above are some things to consider. Again, I'm sorry about your current situation. Having grant funding pulled really does suck. \n\nOn the plus side, congrats on the Ph.D.! I know it's hard not to worry, but you will find something!",
      "author": "Esmereldista",
      "created": 1576783921,
      "upvotes": 5,
      "replies": {}
    },
    "fbdylem": {
      "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbdylem/",
      "text": "Your advisor should speak with his Dean about the possibility of some bridge funding.  At my university, we would help out in a situation like this by providing some funding to cover the postdoc for a semester.  We don’t like to see people get screwed like that.",
      "author": "bigrottentuna",
      "created": 1576774243,
      "upvotes": 7,
      "replies": {
        "fbe106a": {
          "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbe106a/",
          "text": "Would that apply for someone who hasn't even started yet though?",
          "author": "Average650",
          "created": 1576775793,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fbe1gvz": {
      "link": "/r/AskAcademia/comments/ecvd7m/grant_funding_was_cut_and_postdoc_offer_rescinded/fbe1gvz/",
      "text": "This happened to me too. Because of the academic hiring calendar, I had to take random contract/consulting work for an additional year before I got another postdoc. It was fucked!",
      "author": "nevernotdating",
      "created": 1576776093,
      "upvotes": 2,
      "replies": {}
    }
  }
}