{
  "sid": "i8d9jm",
  "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/",
  "title:": "Academic Appeal - PhD removed without fair cause",
  "text": "Hi all!\nFurther to my post from a few weeks ago when I was initially removed from my PhD project. All your comments and advice were really helpful!\n\n\nOn 19/06 I was informed by my assessor and supervisor that they could not condone my transfer into 2nd year due to \"poor writing\" of my continuation report. No actual instances of poor writing were highlighted, my supervisor had actually read the report and said it was fine to submit, and no concerns of writing ability were raised at any point prior.\n\n\nAdditionally, a colleague and I had compared our reports and feedback comments. I was negatively marked/criticized for points he was praised for. We both used the same journals/figures as our introductions covered similar areas albeit different organs as endpoints. He was positively marked for good use of figures whereas I was told “Figures are of poor quality”. I was negatively marked for not using a GANTT chart in my planning, where it is not a formal requirement and he didn’t use one either and it was never raised. “The future plans seem a bit general” We were told to keep future planning broad as this is not a “final paper”, arguably I had shown potential and well thought out avenues for future works and exploration for the study though kept in mind the ability to expand or adapt depending on future results. I was negatively marked for this whereas he was not.\nOn  20/07 a progress committee meeting was held with myself, my supervisor, and the PGR assessors to discuss outcomes. I highlighted that at no point in the year had any concerns been raised. I have always performed well and have been well praised by my supervisor. My supervisor had read the report and not mentioned any issues that would significantly hinder my progression so to remove me based on \"poor writing\" when 1) no evidence has been provided and 2) as if writing skills cannot be taught/improved over the course of my PhD education is a very drastic and final approach. It was also at this time I was prevented from speaking about the bullying/harassment I have faced in my lab and told that this was only a discussion on the academic side of things. In this meeting, I mentioned that in light of the COVID lockdown/closure of the university. I had to carry out my assessment from home, no support or guidance was offered by my supervisor aside from a link to a ‘phrasebook’. I addressed all the points and adjustment which were highlighted in the initial assessor's feedback and had weekly meetings with my supervisor/team, though no support was given/offered.\n\n\nIn this meeting, it was also admitted by my supervisor that he did not offer/implement any support. Though he tried to cover his own back by saying he had “reservations since early in the year” (though this was never highlighted, discussed or anything spoken about as a point to improve) and that I “was an average student and not forward-thinking” which I have evidence to the contrary that I have performed well and produced a number of plans/presentations and avenues of exploration for future work. I also achieved all the milestones set for the first year, the work was otherwise well praised and had also carried out extra work to help on other projects.\nFollowing this, on the 22/07 I received an email that it was decided that the decision to not support transfer into the 2nd year could not be overturned and it was a unanimous decision by the panel that the written work would not be sufficient for an MPhil re-write as I “demonstrate at the Progress Committee Meeting a full understanding of the extent of your writing difficulties and the requirement to improve your written communication to an extent where writing for a research degree would be possible”.  Concerningly overlooking the aforementioned points of lack of support, communication, and consideration to the COVID lockdown. So I have worked for two years in this lab only to be removed with no fair cause and no further qualification/career development.\n\n\nAs I am in the process of launching an appeal. I had requested a copy of the meeting minutes to compare with my own. Strangely all mention of my supervisor not supervising was omitted. It downplayed any of the supervision shortcomings and painted me to be a lost cause/bad student – saying that I did not provide drafts (I sent my supervisory team drafts 3 weeks before submission and also sections with their comments/adjustments) and I have the email logs to prove it. Saying that I had not taken any initiative to seek support – 1) no issues have ever been raised prior relating to my writing, 2) I had elected to attend a number of development and training workshops on my own accord 3) In light of the COVID lockdown, any access to support and guidance was severely limited/if any provided at all.\n\n\nI mentioned in my earlier post that the lab that I worked in was notorious for politics, nepotism, and bullying. The student who had the project before me was bullied into leaving after a few months. It has become clear this is a reoccurring issue involving the behavior of particular senior members of staff which I and others had tried to raise. In my own experience, I had found myself subject to unwelcome comments regarding my appearance and stature made by a senior member of staff. Rumors were being spread about my apparent use of enhancing drugs (I don’t use) and that I was “all brawn, no brains”, comments to that effect. Furthermore, on a number of occasions, I had also experienced uncomfortable and unwelcome physical advances by a member of senior staff who would grope my chest and arms. I made it clear to this individual that I was uncomfortable with this behavior and in a professional manner would not like to be viewed as such. Unfortunately, this unwelcome physical behavior continued. In addition to remarks being made that I do not partake in social drinking (due to my religious beliefs) or the eating of shared food items (pork, meat, bacon). I had highlighted this to my supervisor. Particularly the physical harassment and groping who told me he was aware of this individual, politics such as this has a history and that his advice was to “keep your head down, let it happen and you can get your PhD at the end”. Members of the lab were frequently told to not socialize with me, not talk to me, “I don’t want to see you with him” which cultivated an environment of isolation. Finally, I raised this to the Head of Department via email, because it was taking a toll on my wellbeing and the enjoyment of my work being in such a negative and isolating work environment.\n\n\nThis culminated in an interaction a few days after sending the email, where the senior individual in question lured me to a private corner of the workspace for “a quick chat” and attempted to intimidate me saying I should stop talking to members of the office (my friend/colleagues) and that I should stop talking about the issues and that I wouldn’t be remaining for much longer and that things could be made difficult for me. It is impossible to say whether these instances of bullying and harassment may have tainted my character in the eyes of senior staff for whistleblowing and potentially influenced the channels involved in my academic progression. As I had made it clear that I was not going to be subject to intimidation. It is arguable and perhaps logical that I was removed as a means to silence these issues. As I have highlighted before, written communication is an extremely atypical reason for such a drastic and final solution. Particularly when I have demonstrated promise in all other aspects of my performance.\n\n\nI would appreciate any advice/avenues to explore. I am currently launching an academic appeal so I can get a proper grading or an MPhil to at least show for my years of work. In addition to contacting the OIA, Research Excellence Framework, and potentially the local press / the Independent and the Guardian do articles based on student submissions and academic experiences to name and shame these members and faculty.",
  "author": "DYEL_26",
  "created": 1597237077,
  "updated": 1634080760,
  "over_18": false,
  "upvotes": 183,
  "upvote_ratio": 0.98,
  "comments": {
    "g17opx5": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17opx5/",
      "text": "Strongly agree with the prior comment about seeking out the ombudsman.",
      "author": "crackmethisnut",
      "created": 1597239939,
      "upvotes": 144,
      "replies": {}
    },
    "g17o9pz": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17o9pz/",
      "text": "I would not contact the press, that could (and will likely) blow up in your face. However, contacting an ombudsman or barrister/lawyer to explore legal avenues at this point would be worth your time. \n\nIf these allegations are true, there are some serious issues with that lab and most involved. At very least, pursuing physical harassment charges would likely be possible (as this is a charge the university could hardly argue to handle internally).",
      "author": "the_Q_spice",
      "created": 1597239680,
      "upvotes": 233,
      "replies": {
        "g17y40d": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17y40d/",
          "text": "I want to reinforce not approaching the press at this stage. Their interests diverge quite a bit from yours (not to say they're opposite interests, just that you immediately lose control once a reporter/editor decide to persue a story). And once they make contact with your school, it effectively triggers an adversarial posture -- for example, university lawyers go from 50% defensive and 50% quiet fact-finding to 90% defensive, 5% quiet fact-finding, and 5% angry.\n\nMeanwhile, the press will only be effective when there is similar behavior across at least a few people at the school, when the school had knowledge and provably did nothing. The story also has to be \"simple\" for a non-academic audience to understand. A school doesn't feel pressure when it's one story; they say \"We're evaluating the accusations and will take appropriate steps\" and it's over. But if they have to account for a pattern of behavior that implicates the school rather than an individual, they have to show change. Unfortunately that usually results in the departure of accusers as well.",
          "author": "dcgrey",
          "created": 1597244968,
          "upvotes": 66,
          "replies": {
            "g1ag3zh": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1ag3zh/",
              "text": "Where there's smoke there's fire",
              "author": "mpbarry46",
              "created": 1597288418,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g17qs48": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17qs48/",
          "text": "I never had such a horrific experience in a lab, but I heard of many victims. I always wondered, would it be legal for the student to have a hidden bodycam/recorder and just document evidence of abuse? There is no way anyone can deny a video of harassment, verbal or physical. The question is, would it be usable? Would it leave the student vulnerable to reprimand/lawsuit due to risking disclosure of confidential research? Honestly, if I felt I was cornered by those in power and left no choice, my career is over in academia anyway, I would just make such recordings and publish them anonymously perhaps to at least scratch the reputation of such shit profs/staff.",
          "author": "ahmadove",
          "created": 1597241096,
          "upvotes": 25,
          "replies": {
            "g17sj2y": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17sj2y/",
              "text": "Legality of recording varies quite a bit depending on jurisdiction and context so it really depends on where you are",
              "author": "tc1991",
              "created": 1597242057,
              "upvotes": 31,
              "replies": {}
            },
            "g18k2w6": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g18k2w6/",
              "text": "There is also an enormous difference between what is admissible in a court of law, what is allowed in arbitration, and what is allowed to show to an ethics board or ombudsman. The rules for what is allowed as \"evidence\" generally decrease (as in become more lenient) the further you get from a court of law.",
              "author": "nemoflamingo",
              "created": 1597254877,
              "upvotes": 13,
              "replies": {}
            },
            "g18kbmu": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g18kbmu/",
              "text": "If you feel the harassment is to the point of making you feel unsafe (like the sexual harassment you described) , wearing a recorder for your own protection is more justifiable. Bodycams for safety reasons are quite common (think cyclist on the road wearing a body cam to protect in the case of an accident)",
              "author": "nemoflamingo",
              "created": 1597254986,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "g17qzii": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17qzii/",
      "text": "We had someone similar in our cohort, whose supervisor said their research question does not make any sense (odd considering they passed 1st and 2nd year without any problems) and the student failed to follow the supervisor's feedback (believable considering how this student was acting about everything).\n\nAfaik, the student asked for the tuition fees in the appeal process, didn't get it. Being reinstated wasn't an option anyway. They used a lawyer, asked for the minutes of everything. We werent in touch after that, so not sure how it ended but they didn't go to press. The student later started a PhD elsewhere and was directly treated as a 2nd year student there. They didnt get any ref letters from their past supervisors.\n\nIn my opinion, unfortunately, not progressing to 2nd year due to poor performance is a very common and acceptable excuse and hard to argue against. You can name and shame them but it wouldn't save your academic career in the long run. \n\nBut the other stuff you mentioned, being bullied in the office space etc should be brought up at venues other than the appeal process as well. You have to be really clear that it's not just because you are bitter about what happened to you, but there is a wider problem.",
      "author": "sollinatri",
      "created": 1597241212,
      "upvotes": 48,
      "replies": {}
    },
    "g17vbax": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17vbax/",
      "text": "Which country is this in?\n\nIn think that has a lot of effect on the your options are.",
      "author": "AdmiralSP",
      "created": 1597243527,
      "upvotes": 33,
      "replies": {
        "g18bsas": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g18bsas/",
          "text": "Im in the UK.",
          "author": "DYEL_26",
          "created": 1597251303,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "g17v0qj": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17v0qj/",
      "text": "I am very impressed by your willingness to continue to fight. It takes courage and perseverance to hold a mirror up to systems that are broken. Hurrah for those like you willing to make those sacrifices!",
      "author": "jdfoote",
      "created": 1597243374,
      "upvotes": 29,
      "replies": {}
    },
    "g17t52u": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17t52u/",
      "text": "Try your university Ombudsman. They might be able to review your case.",
      "author": "ria427",
      "created": 1597242381,
      "upvotes": 20,
      "replies": {}
    },
    "g180woi": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g180woi/",
      "text": "Best chances are to document everything you can, elevate to whatever the highest level you can is, and start making plans to transfer to another program as a second year if possible. \n\nGoing to the press is almost never a good idea. They don't necessary have your interesting in mind or see things your way. The rules that the press think are fair aren't necessarily what you would think are fair. \n\nIt sounds like your advisor just doesn't want you there. The unfortunate thing is that even if you won an appeal and stayed in the lab, you're going to still be working with someone who a) doesn't want you there, and b) has a lot of control over your progress. \n\nThe best chance you have is to switch to another program where they actually do want you there and support you/",
      "author": "fleemfleemfleemfleem",
      "created": 1597246359,
      "upvotes": 8,
      "replies": {}
    },
    "g182hcr": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g182hcr/",
      "text": "My recommendation may not be what you want to hear because you are still fighting this decision. \n\nI’m sorry this is happening and this would not easily happen in the US. Why were you not able to select another advisor ? and I mean from their point of view \n\nHere is my recommendation. They don’t want you. Go to another university where you can be appreciated. They are not going to overturn this and if it is overturn they will make your life miserable.",
      "author": "FoCoCS",
      "created": 1597247127,
      "upvotes": 16,
      "replies": {
        "g187wgv": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g187wgv/",
          "text": "Yeah I totally get that. I wouldn't want to return to that department anyway. As it stands the academic ruling cannot be overturned regardless of the appeal. Currently my main objective is to at least get graded for an MPhil so I have something to show for the time I have spent there. Otherwise its just a blank space on my CV.\nFortunatly I am already lining up interviews for other projects once the current COVID climate clears up.",
          "author": "DYEL_26",
          "created": 1597249606,
          "upvotes": 16,
          "replies": {
            "g191vo8": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g191vo8/",
              "text": "That makes sense. But you can do a master in one year ? and it is posible that you will not get it and may had to cut your losses. \n\nMay I ask which country is this happening?",
              "author": "FoCoCS",
              "created": 1597262853,
              "upvotes": 6,
              "replies": {
                "g19m7ac": {
                  "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19m7ac/",
                  "text": "Upon completion of the first year report, I am entitled to submit for an MPhil and withdraw. But I have not been afforded this opportunity. Most likely because they will have to continue to pay my stipend until completion, and with the current COVID situation and lack of students The university is scrimping where they can!\n\nI am in the UK.",
                  "author": "DYEL_26",
                  "created": 1597272515,
                  "upvotes": 2,
                  "replies": {
                    "g19w76n": {
                      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19w76n/",
                      "text": "If leaving, call and demand the opportunity now. Don't take no for an answer - they have become your nightmare for a year, now be theirs. They abused you, you were sexually assaulted, you were demeaned, mentally harmed, and had your future upended. Talk to every damn part of the university - go to the Ombudsman last, go to... say, the Registrar first and ask being sure to say the department, the professor, etc. Then the next agency, then the next.\n\n&#x200B;\n\nI feel vindictive on your behalf right now. I lost out on my PhD partially for mistakes made by my department head,  because I developed an illness that makes my ability to write and research spotty and unpredictable. It hurt. It hurt a lot, and I recognize I also deserve some blame.\n\n&#x200B;\n\nIn your case, it isn't your fault at all unless you're leaving something major out. Hell, your writing on here is perfectly fine and my guess is you didn't work as hard on writing your post as you did on your research.\n\n&#x200B;\n\nAdvertise this - make it public. The public has a right to know. Prospective students have a right to know. Some of what happened may feel humiliating, but turn the tables on your abusers - it may be hard to publicly say you were sexually assaulted and abused, but I promise your abusers will be more humiliated and face much more harm (and likely a divorce and job loss).",
                      "author": "Euthyphraud",
                      "created": 1597277631,
                      "upvotes": 2,
                      "replies": {
                        "g1a6w7o": {
                          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1a6w7o/",
                          "text": "Im a guy. But I had attracted attention in the department for being a bodybuilder outside of my academic life. Which lead to certain PI's and senior staff making unwanted comments, making me the butt of jokes and some even making serious allegations that I was using illegal substances. Full disclosure: I haven't been, but rumors ruch as that tend to attract the \"no smoke without fire\" view.\n\n This then lead to physical/sexual abuse such as the groping of my arms and chest. Due to my religious beliefs I also don't partake in drinking/bars and do not consume any pork products such as bacon/pepperoni or gelatine containing sweets. Which then lead to this individual to make comments that I was unsocial or \"snooty\" because I wouldn't join drinks or eat certain food items that were brought in.\n\nIf you'd like I can upload the report which is apparently \"poorly written\"",
                          "author": "DYEL_26",
                          "created": 1597283298,
                          "upvotes": 3,
                          "replies": {
                            "g1cfnr1": {
                              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1cfnr1/",
                              "text": "I don't think there is any need to upload the report unless others want to read it: I believe you, sadly it isn't the first story like this I've encountered. Departments generally can get a little cultish and take on the worst attitudes of its worst members. This seems even more true in fields where people work, research and take some classes in laboratory settings. \n\nThey can become very toxic; you'd think that a bunch of people with PhDs and people about to have PhDs would act kindly, be helpful, care about education and care about all students. Sadly, that seems more the exception than the rule. People who don't quickly fit into small departments/labs' cultures find themselves ostracized, treated unfairly, etc. \n\nIt is upsetting that you are facing sexual advances like that - and it can't be easy talking about it or pursuing any appropriate actions. While some of our society now realizes men can be victims of sexual abuse, assault, etc. as well, too often such victims are treated like they weren't 'really abused' due to their sex.\n\nThe alcohol thing I understand; I drank from the time I was 16 until I was about 28 (I'm 35 now - seven years clean - excepting all the damn pot I smoke). It was so much a part of my departments culture - particularly among the small number of graduate students we had (political science). Those who didn't drink either went out and watched everyone else get shit-faced and eventually face peer pressure to drink OR they stayed home, bored, alone. Not fair, and it sucks that graduate student culture and sometimes faculty culture can be embedded in alcoholism and immediately judge someone who doesn't drink. Especially when, at the same time, they are saying you're doing illegal substances. And, even if you were (and I know you are not) it still wouldn't be their damn business unless it was directly affecting work within the lab, etc. I have known plenty of grad students - and more than one professor - who are potheads, and I've known quite a few who did harder stuff (coke, amphetamines like adderall). What they do on their personal time is their business, not mine - and that should hold true for you; their spending time talking about the things they think you do says a lot more about them than you. I wish you could go after those who have sexually abused you - and you could; but I've learned from teaching courses on Women, Public Policy and Politics - that men are rarely believed, and both police and universities are far less likely to take them seriously if they make an accusation of sexual abuse. It isn't right - it has created generations of men who have hidden things that happened to them, who thought they just needed to toughen up and put up with it. That same cultural belief is still more present than many of us would like to believe.\n\nAll the ideas I have for how to handle a situation like this are based off of going to grad schools and teaching in the USA. The US and UK education systems are very different, and the structure of universities themselves differ quite a bit. The rights of students, faculty and staff differ too - you'd probably have more recourse in an American University but you never know, each department still has its own little culture.\n\nIf you really want to stay in academia you can always look at other schools, including abroad - though I can understand the desire to just wash ones hands at it and be done after something like this (I have two MAs - was ABD and eventually had to quit my own PhD program due to illness: I tried hanging on for 2 extra years before I admitted to myself I just didn't care anymore and wanted to be done). It is a valid way to feel, it is a valid thing to do - you may regret it for a time but realize you did what was best for you.\n\nEven if you can't get evidence to pursue an appeal or take legal action (at least, that is how it appears), you can raise hell. I'm not sure what types of legal protections you have in the UK as a student, but here you'd have a pretty good lawsuit (but we Americans absolutely love to litigate everything). \n\nI'm the type of ass who would advertise this to prospective students, as an op-ed in the school paper, on reddit and multiple other social media platforms. But I'm a bit vindictive, yet also feel that when something like this happens to one person you can bet your life that it has happened to others, and will happen to still more. \n\nMy social justice warrior self and vindictive self get along a little too well ;)\n\nI hate witnessing people with great power over others' lives act without any consideration into how they are impacting those lives; I hate seeing faculty members who treat providing an education to others as the 'shit they have to do to get to do research' - it always comes out in their teaching whether they realize it or not. I hate seeing someone slowly made more and more uncomfortable, seeing someone slowly pushed aside like a slow-motion car accident you can't stop. I did qualitative research, which is an increasingly rare thing in political science (a major problem with the entire field, not just my former university). Many professors and grad students didn't believe qualitative work was 'rigorous' (though it took a lot more effort and research than running a bunch of regressions on proxy variables!). My work would often be treated as 'lesser than' that of the 95% of grad students doing primarily quantitative analysis. Of course, I made no secret of my displeasure in the final years - and made sure to let everyone know. Because, again, I can be a bit of a dick when I feel I've been wronged - or someone else has - by individuals who ought be 'on their side' and helping them which is what your case entails.\n\nI wish you the best. I hope you can find some resolution. I hope you are still able to use that experience to do work you enjoy. I also think you'll be surprised at how many others have had issues like yours - there are more hiring committees, etc. in academia with members who know very well what type of lab culture you were chased out of. \n\nThere are always a few such departments at any university, and faculty/staff tend to know what departments those are - and are unlikely to be shocked at someone coming for a job, or to apply for a grad program, who has to explain a hole in the CV that exists because of the type of abuse you face. I bet that if you're honest as you move forward in life, you'll find a lot of people are sympathetic.\n\nIt is disgusting how easily, effortlessly and thoughtlessly those we're supposed to trust most - professors, administrators, fellow grad students - can turn on and harm those whose care they are trusted with. You'd think academics would have some self-awareness regarding how their actions affect others. Maybe they do and just don't care. Not sure which is worse...\n\nSorry for rambling, anyways - I wish you the best of luck.",
                              "author": "Euthyphraud",
                              "created": 1597337695,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g19tdi8": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19tdi8/",
              "text": "You can put ”research assisstant” or ”lab assistant” in your resume for this time to make up for a lack of degree if they don't approve your appeal.",
              "author": "hbrgnarius",
              "created": 1597276196,
              "upvotes": 3,
              "replies": {
                "g1a7d1k": {
                  "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1a7d1k/",
                  "text": "Thats a good shout! Fortunately, on My CV I already have a year as a research assistant after my MSc and did a year as a lab assistant between my BSc and MSc.\nI have also been awarded a PGDip (73% - Pass) in Nanoscience which I had to complete before beginning my project. I had to attend and pass a 6 month taught portion as a skills audit (funnily enough doing 4 lab reports in this time) before I could 'graduate' onto my actual PhD project.",
                  "author": "DYEL_26",
                  "created": 1597283545,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "g19vkty": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19vkty/",
              "text": "If you've been pushed out of academia and don't see anyway of really returning in the way you want, I'd collect every piece of evidence, I'd seek out the threatening individuals and tape record them, I'd get the minutes, comments, comparisons to your peers paper (I have to ask - are you female because I kept thinking 'this sounds like blatant sexism' as I read this)... then I'd publish it all, online, on Reddit. Publish to Higher Education reddit, to your universities reddit, to your university's Facebook page, to student groups pages, to regional reddits, forums, etc. Publish on youtube, email the posts and evidence to top leaders of the department and the university, and other departments (you'd be amazed at how much influence other departments can exert when they identify a wrong that is this egregious, especially with the bullying and sexual assault (in the US you could have sued your supervisors - although it still would be a difficult battle, but at least you'd take down the sexual predator with you). \n\nI'd say you no longer should protect the people abusing you. Stop referring to them by titles rather than names - let everyone know what university, what department, who assaulted you (and yes, groping is sexual assault), etc. Sure, the revenge will feel good - but it is also good for others: you could save other individuals from being preyed upon, you could save others from losing a year or more of their life to a corrupt department; you could ruin the career of those whose corruption caused you to lose your desired future. \n\nOnce you have nothing to lose, then let loose. It's amazing how much Reddit, Google Reviews, Facebook, Craigslist, Instagram, etc. has altered power relations, yet society hasn't really fully caught on yet. People still don't turn to social media too often to seek justice and go after those who prey on their subordinates and destroy people's lives - but they should. You may not be able to get what you have sought for so long, but you really ought not let this go - this is beyond the pale and if the university won't address it, then it is time to make it a public issue. Hell, you post it on Reddit in a few places and just imagine how many emails will flood those individuals email accounts, the university's accounts, etc.\n\nI wish I knew now because I'm feeling kinda like an asshole right now and I'd love to be an ass to an institution that has earned such... treatment!",
              "author": "Euthyphraud",
              "created": 1597277312,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g17qgp8": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17qgp8/",
      "text": "OP I’m so sorry that you’re going through all of this. It sound awful. Have you contacted your research degrees team, graduate school team or student union? If I were you I would talk to as many people outside of your department as possible who can support you. The bullying and harassment needs to be flagged up with people not in your lab/department as they are seemingly turning a blind eye to everything and actively trying to get rid of anyone who speaks out against them by the sounds of it. \n\nPersonally I would also make this public on twitter with a thread and name and shame the uni and department. The @DoBetterAcademia and #BrokenAcademia tags are something you should check out. But keep in mind that people who have spoken up about this sort of thing have received backlash in the sense that they have been ousted from their departments/fields etc. which is awful but something to think about. \n\nI would try and find a position elsewhere with a supervisor you trust (perhaps someone you’ve met at a conference?) who you can explain all of this to and who will be supportive and understanding. \n\nBest of luck with everything and again, so sorry you’ve had to put up with this.",
      "author": "zoetje_90s",
      "created": 1597240915,
      "upvotes": 8,
      "replies": {}
    },
    "g18uvgb": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g18uvgb/",
      "text": "The same thing happened to me, terminated despite positive feedback. My issue was an ongoing disagreement with my advisor. I ended up having to get a lawyer. The college offered a settlement but would admit no wrongdoing. Was able to get a terminal MA. Best of luck!",
      "author": "monkeyswithknives",
      "created": 1597259598,
      "upvotes": 3,
      "replies": {}
    },
    "g181qd9": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g181qd9/",
      "text": "I hope you are able to solve this. I also support lawyering up\n\nIf you decide to drop academia or want to welcome the fire/fight, send it to the press in addition to lawyering up",
      "author": null,
      "created": 1597246765,
      "upvotes": 2,
      "replies": {}
    },
    "g19artu": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19artu/",
      "text": "Go for legal support!",
      "author": "Senthipua",
      "created": 1597266951,
      "upvotes": 1,
      "replies": {}
    },
    "g19b8zf": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19b8zf/",
      "text": "wow, that really fucking sucks",
      "author": "f33dmewifi",
      "created": 1597267177,
      "upvotes": 1,
      "replies": {}
    },
    "g19go9y": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19go9y/",
      "text": "Are you by any chance not a native language speaker? Or minority? \n\n\nDon't go to the press it doesn't work, and do contain whom you are speaking to in the department.\n\nFinally what is your goal? Is your goal to stay in the program? Change advisors? Get money back. If you want to stay in the program you may need to secure support (an alternate advisor maybe?) Do you have any publications or presentations? Any pending manuscripts (submit some anyway to say you do). Show you are a scholar despite your advisor.\n\nDocument and summarize everything your advisor told you to do and prove you did them. Don't try to paint the advisor in a negative light, just show the claims are not true. Don't get your friends involved, they may have repircussions later.\n\nAsk for another semester in the lab to further the research. Convince them your an asset.",
      "author": "lnln8",
      "created": 1597269794,
      "upvotes": 1,
      "replies": {
        "g19lw73": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19lw73/",
          "text": "British born, but I was the only \"ethnic\" (Middle Eastern heritage) as I was described by my supervisor in my cohort/department who are predominantly European. I am a native English speaker but recently it has come to my attention I may be mildly dyslexic. Never really had it pointed out before but upon having my first-year continuation report reviewed by external. It was pointed out that there are some patterns that fit the bill. Generally, they are flagged up by the word processor but admittedly some do slip through.\n\nUnfortunately, it is not possible to return to the lab, I wasn't even able to collect my belongings. My supervisor has made it clear that I am \"no longer welcome\" when referring to me to a colleague.\n\nOverall I would like to get the MPhil/chance to rewrite for an MPhil submission. Provided I actually have proper support and guidance this time. Then move to an entirely new project/faculty.\n\nI have made sure to back up and document everything. Not painting anyone in a negative light. Just making sure that everything is brought forward in a truthful and representative manner.",
          "author": "DYEL_26",
          "created": 1597272362,
          "upvotes": 2,
          "replies": {
            "g19scqn": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19scqn/",
              "text": "Yeah this sounds like plain old racism to me, it’s rampant everywhere but obviously particularly bad amongst the old guard in UK universities. Hope it goes ok for you in your pursuit of some kind of justice with the MPhil, what a shitty situation. Good luck 🧚🏻",
              "author": "rosepegasus",
              "created": 1597275666,
              "upvotes": 1,
              "replies": {}
            },
            "g19yyl1": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g19yyl1/",
              "text": "Oo, I would argue not only racism but also ableism(?). I made through to my doctoral program without needing accomodations. In my MA program I had a great program director that intervened with a faculty that was bullying several students (me amongst them). In my doctoral program I requested accomodations in my second year. My professor threatened me - saying that if I was lying about a disability, i'd be out of the program. Didn't get an apology when disability services started advocating for me. \n\nSometimes in these programs you have crazy people with far too much power.",
              "author": "lnln8",
              "created": 1597279077,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g1afwr1": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1afwr1/",
      "text": ">It is impossible to say whether these instances of bullying and harassment may have tainted my character in the eyes of senior staff for whistleblowing and potentially influenced the channels involved in my academic progression.\n\nSpeaking out about being bullied will not taint your image in the eyes of any decent person. If it does then they're lumped in as part of the problem\n\nNever doubt yourself",
      "author": "mpbarry46",
      "created": 1597288300,
      "upvotes": 1,
      "replies": {
        "g1aj1hq": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1aj1hq/",
          "text": "It has been an ongoing issue with that department long before I started. The head professor is known for bringing in a lot of money. So the university allows him to act like a law unto himself - going as far to have his own \"code of conduct\".\n\nOne individual in our department has a chronic disorder and has weekly treatment. as our core hours are 9-5:30/9:30-6. They would not be able to get an appointment out of hours. They were told to take it out of their annual leave!\n\nI was called \"a colourful fellow\", \"this big brown one\" among other slurs and at once instance he held his hand up to mine to check his tan and said we \"were competing\"\n\nNumerous others had come forward with bullying, harassment or misconduct and it all gets swept under the rug as he is protected by the vice dean.",
          "author": "DYEL_26",
          "created": 1597290197,
          "upvotes": 2,
          "replies": {
            "g1al8ui": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1al8ui/",
              "text": "Sounds like your strategy of getting out with the best that you can is a good one then\n\nShame on them",
              "author": "mpbarry46",
              "created": 1597291607,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g1afygj": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1afygj/",
      "text": "Also your writing skills are clearly excellent.",
      "author": "mpbarry46",
      "created": 1597288328,
      "upvotes": 1,
      "replies": {
        "g1aj9bt": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1aj9bt/",
          "text": "Thank you, but I'll admit my writing isn't perfect. It was a 150 page report (unlimited in pages/characters but generally is around 80 pages) But I did a lot of optimization, extra work and explored other aspects in my project so it all came together and I was proud that I had all the extra work to show for it. I'll be the first to admit there was the odd typo and I do tend to have long sentences with commas rather than full stops. But nothing that would hinder my progress or impact communication.",
          "author": "DYEL_26",
          "created": 1597290335,
          "upvotes": 1,
          "replies": {
            "g1aksaw": {
              "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1aksaw/",
              "text": "Your skills in general as displayed here are excellent.\n\nThe odd typo does not make writing bad. The occasional run on sentence does not make writing bad. As you're aware, writing is about communicating messages and ideas, that's the key thing that matters and poor grammar is bad when that is interrupted.\n\nDon't let other people's opinions drown out your own internal voice, especially if they're deliberately malicious",
              "author": "mpbarry46",
              "created": 1597291310,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g1bav1o": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1bav1o/",
      "text": "This is only partly related but: do you guys write meeting proctocols? I have been advised to do so (one prof at my dep. even requires them) - both to protect the student and the involved faculty. If so: how do you do it? Do you send them to the envolved people for confirmation? How do you store/organise them?",
      "author": "kokomoinmyheart",
      "created": 1597313904,
      "upvotes": 1,
      "replies": {
        "g1sm0t9": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1sm0t9/",
          "text": "Normally we should. We are supposed to have regular meetings with our supervisor and the agenda is recorded by the supervisor on a system called \"eProg\". Then I check off/agree to the points as I work through them with dates or submissions.\n\nMy supervisor never recorded anything on the eProg system as apparently he \"doesn't have access to the system\".",
          "author": "DYEL_26",
          "created": 1597628519,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g1bc624": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g1bc624/",
      "text": "If you are sure that there is no way for you to come back or to get an Mphil, you should just go to the press. I mean it is ridiculous that politics is a thing in academia. Your story will bring the whole department to it knees and raise the awareness about such poor behaviors from these faculties. \n\nI am really sorry that you have to endure it.",
      "author": "minhquan3105",
      "created": 1597315137,
      "upvotes": 1,
      "replies": {
        "g2u4ufz": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g2u4ufz/",
          "text": "I think the Guardian has an anonymous academics column where people have talked about issues such as this.",
          "author": "LucyLoo152",
          "created": 1598385705,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g17vjyi": {
      "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17vjyi/",
      "text": "[removed]",
      "author": null,
      "created": 1597243653,
      "upvotes": -21,
      "replies": {
        "g17wcsh": {
          "link": "/r/AskAcademia/comments/i8d9jm/academic_appeal_phd_removed_without_fair_cause/g17wcsh/",
          "text": "Weird, an account created just to post on this. That's not fishy at all.",
          "author": "junkholiday",
          "created": 1597244069,
          "upvotes": 12,
          "replies": {}
        }
      }
    }
  }
}