{
  "sid": "r0moxc",
  "link": "/r/AskAcademia/comments/r0moxc/i_am_so_terrified_about_reviewer_feedback/",
  "title:": "I am so terrified About Reviewer Feedback",
  "text": "It is my first paper in this subfield, I am very terrified by the feedback, my PI considers my research risky since there is not much work on it and also at one time admitted they dont quite understand it although I made the effort to explain in all meeting, now they put pressure on me and that paper must be accepted or I am done. I am not good at writing, it was very painful to write and express what I considered interesting, which makes me so much worried.\n\nSometimes I feel stupid but this idea came to me intuitively I dont know but in my mind, it is beautiful and opened my eye to the rich scientific background, if I didn't get accepted that would be so hard for my PI. I dont know I just feel anxious every day I did what I am passionate about, but I am afraid I have an illusion. I dont know if anyone was in a similar situation.",
  "author": "meldiwin",
  "created": 1637700005,
  "updated": 1638206349,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "hltcwhi": {
      "link": "/r/AskAcademia/comments/r0moxc/i_am_so_terrified_about_reviewer_feedback/hltcwhi/",
      "text": "A few things I'd say to this. Firstly, any review, good or bad, should be respectful and constructive. If it's not that's on the reviewer and the editor for allowing it. It's not a reflection on you. They chose to be rude, you didn't make them.\n\nSecond, try to have something to take your mind off the review lined up for when it comes in. I hate reviews. Find them very stressful. From experience, I have to read them and then leave them alone for a bit. I find they're usually not nearly as bad as my first read suggested, and the work required isn't as bad as I thought.\n\nThird, a reviewer isn't just reviewing your work, they're reviewing it in the context of whether it's appropriate for the journal you submitted to. That may sound like the same thing but it does change the nature of the review and what they're thinking. \n\nFourth, don't take it personally. You are more than one paper. It's great you are so passionate about this project, but don't let it become your entire identity and measure of self-worth. It's one piece of work. You have a whole career ahead of you and a whole life filled with other things. One paper does not define you, and it doesn't make or break your career. \n\nLastly, check out Shit My Reviewers Say on Twitter. You'll laugh.",
      "author": "ACatGod",
      "created": 1637700792,
      "upvotes": 20,
      "replies": {}
    },
    "hltq9k0": {
      "link": "/r/AskAcademia/comments/r0moxc/i_am_so_terrified_about_reviewer_feedback/hltq9k0/",
      "text": "1. It is double blind. Worst case is that someone unknown who doesn't know who you are doesn't agree with you.\n\n2. That person has spent 10 % of the time you think they spent on  your work.\n\nBut, this semi-engaged reader is still way more engaged in your text than 99 % of your future readers, so any feedback from your reviewer is still super important from that perspective.",
      "author": "molobodd",
      "created": 1637706115,
      "upvotes": 8,
      "replies": {
        "hlvowdi": {
          "link": "/r/AskAcademia/comments/r0moxc/i_am_so_terrified_about_reviewer_feedback/hlvowdi/",
          "text": "Reviewers know who the authors are...at least in my field!",
          "author": "queue517",
          "created": 1637743446,
          "upvotes": 3,
          "replies": {
            "hlvtsvq": {
              "link": "/r/AskAcademia/comments/r0moxc/i_am_so_terrified_about_reviewer_feedback/hlvtsvq/",
              "text": "Ok. I would think it is way less common in most fields, though. What is the point of making that known?\n\nI did a lazy search and found this regarding bias benefitting well-known authors:\n\n[https://www.pnas.org/content/114/48/12708](https://www.pnas.org/content/114/48/12708)",
              "author": "molobodd",
              "created": 1637747568,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hluz2qb": {
      "link": "/r/AskAcademia/comments/r0moxc/i_am_so_terrified_about_reviewer_feedback/hluz2qb/",
      "text": "Keep in mind t reviewer feedback is as much a part of the scientific process as designing or conducting the research.",
      "author": "DicaxErsatz",
      "created": 1637726912,
      "upvotes": 2,
      "replies": {}
    },
    "hlul9lu": {
      "link": "/r/AskAcademia/comments/r0moxc/i_am_so_terrified_about_reviewer_feedback/hlul9lu/",
      "text": "I have had reviews all over the board. Some have been very constructive, some have been straight insulting. On the same paper I have had a reviewer sing praise, while another rip it to shreds. I have been straight up rejected from one journal and given very fair reviews from another with the same paper. Usually the reviewers who are the most critical don't understand fundamental things. It would be like having a heart specialist review a paper about the brain. For some reason people get matched up inappropriately sometimes. In these situations sometimes clarification is sufficient, other times the paper is damned for that journal. The answer is usually pretty simple, if it gets rejected for anything other than bad science, just find a better fitting journal. \n\nSomeone else said something important. Take time between reading and responding. Read the reviews, go have a tantrum, hate yourself and science, contemplate quitting, complain to your partner and friends about how stupid the reviewers are, then go to sleep. When you wake up, read it again and just get started on the edits. Sometimes it's worth it to retract and go somewhere else. One journal review wanted me to go back and redo two years and about 100k worth of experiments using a drug that works the same as the one I used, just to validate that the effects weren't specific to my drug. The editors wanted me to honor the reviewers request rather than just describe/discuss the potential limitation, so I was forced into either doing something impractical, or just going somewhere else. I went somewhere else and got very good reviews.\n\nPoint is. Prepare to get your asshole ripped open. Prepare for a night of head spinning, rage quitting, anger. Prepare to have an irrational response and feel like child later. It's part of the process and takes many times before you start to chill out. Your feeling are normal and there isnt much of anything that anyone can do to lessen the anxiety. Hopefully you fair well in the eyes of the reviewers, but just prepare for the worst and take comfort in knowing it happens to everyone and is honestly just part of the process.",
      "author": "ActionXPotential",
      "created": 1637720224,
      "upvotes": 1,
      "replies": {}
    },
    "hlum6vu": {
      "link": "/r/AskAcademia/comments/r0moxc/i_am_so_terrified_about_reviewer_feedback/hlum6vu/",
      "text": "What's your field? A lot around scholarly publication is field specific.\n\nFor the most part though, you're not publishing an idea, you're publishing a model or conclusion that's the result of a rigorous analysis/inquiry that supports your idea. \n\nSo, are your data and/or sources strong and appropriate to support the very specific aspect/relationship/interpretation/discovery you want to publish?\n\nIf yes, you're in good shape. \n\nIf no - that's the part to focus on first. If no, and with no hope of getting there in a timely way, this idea isn't ready for publication.\n\nYour PI will not disown you if you can't make *this* idea work, but you may need to redirect your energies. You also will need to write something. If this idea is difficult for you to crystallize and your PI can't provide you guidance in this area, you may find a different project that will allow you to be more productive.\n\nReviewers aren't anything to worry about at this stage if you've got no words on the page.",
      "author": "FireTruckWhite",
      "created": 1637720666,
      "upvotes": 1,
      "replies": {}
    }
  }
}