{
  "sid": "n5a4b6",
  "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/",
  "title:": "How to improve technical writing",
  "text": "I am a final year undergrad working on my thesis. I finally after a lot of procrastination and worrying that I would be writing crap submitted my thesis draft yesterday. \n\nMy supervisor was quite happy with my work until now. But he is extremely unhappy with the draft I handed in, he gave tons of comments and said I should NEVER hand in something written like that again. I realize I made several technical errors as well which prolly pissed him off even more if my horrible writing had not already done it. \n\nMy supervisor is in general really sweet and honestly cares about his students mental health. And I really want to apply to his lab for grad school, but would such an experience be a deal breaker for him to accept me? \n\nAlso I would love suggestions on how to improve my writing. I read a lot of literature and tried to write along those lines, but yeah didn't really work out. \n\nThis was my first real scientific research report. And now I feel like I would suck at being a good researcher and I am seriously reconsidering my career choice.\n\nEdit: Thanks for the overwhelming response and some great advice. Some comments have really given me a good way to go about writing, and thank you for taking out some time to help me.",
  "author": "Hungovernerd",
  "created": 1620199451,
  "updated": 1634081912,
  "over_18": false,
  "upvotes": 105,
  "upvote_ratio": 1.0,
  "comments": {
    "gx0g2c4": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx0g2c4/",
      "text": "I learned to write scientific work by writing a lot.\n\nOne likely problem for you is what you said in your second sentence, \"...after a lot of procrastination and worrying...\" If you start writing assignments very early, thinking about what the topic will be, fleshing it out, maybe outlining it, doing the background research, developing your thesis, starting to write sections, rearranging things, and putting together a draft you will take some significant period of time. Then I'd suggest that you put the thing away for a week. Then come back to it and read it through fresh and start to edit it, maybe focusing on the development of the whole paper first (maybe you need to rearrange paragraphs or strengthen your argument), but also catching typos and technical errors. Put it away for a day or so and do it again. One thing that I did that might be very helpful is to read the paper out loud and really listen to yourself. If it sounds stilted or odd then edit it. I've always thought that good writing will sound fine when spoken, so that was always my starting place. Also, read science articles in your area and ask how they differ from what you are writing. Modelling how you write after scientific papers that read well and make sense can help you figure out scientific writing.\n\nBy the way, your informal writing is fine; your post demonstrates it. You can certainly learn to write in the scientific realm, as well.",
      "author": "rockyfaceprof",
      "created": 1620211976,
      "upvotes": 67,
      "replies": {
        "gx1wd3f": {
          "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1wd3f/",
          "text": "I read a book on technical writing, How to Write a Lot. The central point was to make it a habit. Write for one hour everyday no matter what you write. \n\nFor specific suggestions, I'd recommend going through the book. It's a quick read and you can select the chapters related to thesis, etc. \n\nhttps://www.goodreads.com/book/show/39874447-how-to-write-a-lot",
          "author": "vardhanisation",
          "created": 1620237051,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "gx0pevo": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx0pevo/",
      "text": "You can fix this problem, become a better writer, and be welcome in the lab in the future by addressing every single comment the professor made on your document, and then bringing your level up to at least there on everything in the future.\n\nBasically, your professor did the copy-edit you should have done on your own before handing it in, and they're not happy because that takes forever. So you need to open the computer, open the file with your paper in it, and systematically fix every single thing the professor marked. While you are doing it you will notice the types of improvements and become a better writer.\n\nDon't worry about the million strokes of red ink. When I edit my own papers they look like that even on the second or third drafts. In the future you have to read and reread your work multiple times in order to get a quality product.\n\nAt the research level you are representing yourself and your work when you write, so do a zillion drafts before you let anyone see it. Godspeed",
      "author": null,
      "created": 1620218243,
      "upvotes": 33,
      "replies": {
        "gx2k86b": {
          "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx2k86b/",
          "text": "I’ll add after OP meticulously addresses all the PI’s comments, it would probably be worth while to take the draft to the university’s writing center.",
          "author": null,
          "created": 1620247114,
          "upvotes": 9,
          "replies": {
            "gx2qb8b": {
              "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx2qb8b/",
              "text": "This is a great suggestion, almost worth making twice. As a student I never utilized the one at my institution, and it wasn't until I was working as a professor that I saw the usefulness of the writing center. It is very much worth your time...although getting appointments now may be difficult, assuming you're on a semester system.",
              "author": "Teacher_",
              "created": 1620249644,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "gx2k86c": {
          "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx2k86c/",
          "text": "I’ll add after OP meticulously addresses all the PI’s comments, it would probably be worth while to take the draft to the university’s writing center.",
          "author": null,
          "created": 1620247114,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gx1o2wr": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1o2wr/",
      "text": "One thing to bear in mind is your supervisor is there to advise and provide intellectual input not to correct your work or try and divine some meaning in what you submit. Don't let the words \"rough draft\" fool you into thinking you don't have to provide quality work at that stage. In a rough draft your basic arguments should be there and definitely all spelling and grammar corrected. It's really annoying to have a student say \"Oh I know it's not very good\" or \"it's only very rough\". If you know it's not good why are you asking them to look at it? \n\nA few tips for writing: \n\n- short sentences. \n- tell the story - it's not a murder mystery don't leave it to the end to tell your reader the point. Start at the beginning and walk them through it step by step. No surprises. \n- use paragraph/section  headings to help you structure it. You can take them out later but knowing what the point you're making in each paragraph/section before you start the paragraph/section helps. \n- don't try to shoehorn in every fact you ever heard on the topic. Keep it relevant and lean. If you don't know why you're mentioning something, neither does your reader so delete it. \n- read your writing out aloud. It's totally different from reading it in your head and much closer to how someone else reading it will experience it. You'll suddenly find sentences don't flow, things don't make sense. \n- be brutal, move paragraphs around, delete that beautiful sentence you spent 45 mins crafting. \n- sign up for any writing classes your college offers. Writing is hard, most people need help with it. I'm a pretty good writer (better editor) but I learnt by having some people really rip my work to pieces and help me understand where I was going wrong. \n- find a way to cope with red pen. I'm a pretty senior member of staff at a research institute and I still find edits on my work tough. If someone's made a lot of changes my tactic is to open the document, read two or three comments, go away and sulk over a cup of tea and then just bite the bullet and just hate the person until I've finished the edits.",
      "author": "ACatGod",
      "created": 1620233628,
      "upvotes": 18,
      "replies": {}
    },
    "gx1g9ja": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1g9ja/",
      "text": "I have TAed a couple undergraduate engineering classes that have a large focus on technical writing. Here is a list of common mistakes I see:\n\n1. \"Fluffy\" writing, keep things clear and concise, don't add extra words to make things longer. Sometimes students think longer makes it better, but if the writing is not concise it normally just makes it hard to follow. Avoid using unnecessary jargon or cluttering sentences with extra words. \n\n2. Lead the reader by the hand, they should not need to infer your meaning, it should be clearly stated for them to understand.\n\n3. With figures/tables/non-text items instead of just stating what the item is when you reference it in text, tell the reader the key points you want them to gain from that item. \n\n4. Paragraph and section structure is important. Things should logically flow into one another. Within paragraphs and sentences make important ideas stand out, by strategically placing them (ex. at the beginning or end of a sentence). Paragraphs are unified ideas. Start with a claim that defines the focus of the paragraph, then give justification followed by evidence, and finally a conclusion. \n\n5. Using rhetorical patterns can be helpful. The main ones used in these courses were mechanism description, process description, classification, compare/contrast, ascending or descending order, situation-problem-solution-evaluation and cause-effect. \n\nHopefully this helps, but as other commenters advised go through and fix every comment given, and look for common mistakes that your advisor pointed out.",
      "author": "mediummeg",
      "created": 1620230462,
      "upvotes": 7,
      "replies": {}
    },
    "gx2glnu": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx2glnu/",
      "text": "If you wrote your thesis anything like you wrote this post (yes, I know you were probably a little more careful, but I’m sure your habits permeate all your writing), I think I can see some specific problems you may have with the technical style. That said, I can’t comment on how you wrote about your research, of course.\n\nUse more punctuation. You’re underutilizing commas (you used three, one of which should’ve been a semicolon, and you should have actually used nine). \n\nOrganize your clauses; don’t interject thoughts into the middle of a sentence. Don’t write “I finally(,) after a lot of procrastination(,) wrote my thesis,” even if you would say it out loud. It’s clearer to read “After a lot of procrastination, I finally wrote my thesis.”\n\nVary how your sentences start. Generally, sentences should barely ever start with “and” or “but”. Use more introductory clauses, or transition words like “furthermore,” or better connecting words like “therefore.” The best writing advice I ever got was to make the end of each sentence lead into the start of the next, generally by repeating an idea: “The indicator was added to the reaction mixture. The reaction mixture was then immediately heated to 80°C.” That sort of thing. Also note that I don’t say “It was then immediately heated to 80°C.” In technical writing especially, we try not to use “it” too much because it can be unclear what “it” is referring to among many sentences.\n\nThese are just a few tips; hopefully they point you towards the sort of things to be aware of as you pick up on the style of other papers.",
      "author": "giantsnails",
      "created": 1620245605,
      "upvotes": 6,
      "replies": {}
    },
    "gx0yt1j": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx0yt1j/",
      "text": "You get better by practicing. I still remember the first draft of my first paper when I was a first year Master's student. My adviser's reaction to it was 'Well, this certainly is a first draft.'. The entire thing was filled with red marks but he was nice enough to go through each comment with me. It honestly hit me quite hard because at that point I had thought that I was a decent technical writer because I always had very good grades for my lab reports (on one occasion the TAs even turned my report into an example report so I was kinda proud of it). But to answer your question, you get better as you write, review, and read more papers. It's one of those things that you just can't rush, there's no magic formula to it.",
      "author": "SubcooledBoiling",
      "created": 1620223012,
      "upvotes": 13,
      "replies": {}
    },
    "gx16166": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx16166/",
      "text": "If you’ve got time in your schedule for an elective, take a technical writing class. Alternatively, business or professional writing. Those classes focus on the nuances of writing. They’re usually in the English department.",
      "author": "mylifeisprettyplain",
      "created": 1620226234,
      "upvotes": 4,
      "replies": {}
    },
    "gx2q9s2": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx2q9s2/",
      "text": "Honestly, I'd ask your supervisor if he would mind providing you a few examples of what he thought were exceptionally well done papers.\n\nEven one or two papers that he likes might be enough to clue you in as to what looks different from the draft you submitted.",
      "author": "YourFriendNoo",
      "created": 1620249627,
      "upvotes": 5,
      "replies": {}
    },
    "gx1gmr9": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1gmr9/",
      "text": "A few common themes I end up having to edit and trigger rewrites are:\n\n1. Writing way too much without ever making a critical argument.\n2. Failing to develop a conclusion derived from, or related to, the actual data.\n3. Writing introductions that cover loosely related topics to the topic of the manuscript.\n4. Not referring to all of the data presented in figures, tables, etc.\n5. Incorporating data that doesn't need to be included. No one wants to read a paper describing why an experiment worked so you pivoted methods or dropped those experiments entirely. This type of style is supposed to be used in lab reports to get students to think about why things failed.",
      "author": "NewInMontreal",
      "created": 1620230612,
      "upvotes": 3,
      "replies": {}
    },
    "gx1rx0m": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1rx0m/",
      "text": "If you're comfortable DM'ing me your school name, I can get a quick sense of your school's writing center. They can be indispensable for learning technical writing, but their staffs can range from seniors helping format bibliographies to subject matter expects with Ph.D.'s who lecture on writing in their field.",
      "author": "dcgrey",
      "created": 1620235187,
      "upvotes": 3,
      "replies": {}
    },
    "gx2grxd": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx2grxd/",
      "text": "You've gotten some really good advice here. I think some really important things to consider are:\n\n* Don't procrastinate! Plan ahead so that you can read the draft several times with time in between, with fresh eyes each time. The first read through, read for grammar and punctuation, sentence flow, and formatting. The next reading, read for paragraph construction, confusing or incomplete thoughts, flowery wording, big words to sound important, tangents, appropriate intros and conclusions, and transitions between paragraphs/sections. Third read though, read for content. Do you know your research? Are you presenting it in a well-organized way? Defending your claims sufficiently? Concluding your thoughts?\n* Utilize your university's writing lab or writing center. It is a group of usually grad students in English or Editing, sometimes faculty, who work in the lab editing student papers. Even though they may not know the research intimately, they can still edit for grammar conventions and flow, as well as pick up on enough of the content to tell if you've presented and concluded on your subject fully and consistently (like do you contradict yourself? Present an argument and don't defend it?). Sometimes the writing labs are free, sometimes they are an inexpensive fee, but they're invaluable. \n* Talk to your supervisor. Find out what he specifically expects from a paper (whether draft or complete), and what advice he has on how to improve your draft, and ask if he would let you turn in a revised draft. Open communication is always best. Based on past experiences I don't know if I personally would call this a deal breaker, but it's definitely a come-to-jesus moment. This is an area that you just now learned you struggle with, so now is your time to take advantage of resources to help yourself improve\n* (Also, DON'T PROCRASTINATE!) :)",
      "author": "drilllbit",
      "created": 1620245677,
      "upvotes": 3,
      "replies": {}
    },
    "gx2olux": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx2olux/",
      "text": "There's a great course called Writing in the Sciences in coursera, from Stanford",
      "author": "RandomPhrase8",
      "created": 1620248916,
      "upvotes": 3,
      "replies": {}
    },
    "gx1aicx": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1aicx/",
      "text": "Without seeing your style of writing, it's hard to gauge what's actually the problem. If you copy the writing style of existing literature, I can imagine the issue may be readability.\n\nFor me, the hardest part is organising my thoughts so they fit into a logical 'flow' within the body. If you treat the various concepts, results, and discussions you want to have as pieces of a puzzle it may help. About 80% of the time I took writing my thesis was just sitting down and trying to figure out which piece fits where and how to transition from one to the other. Something like a flowchart is helpful (also extra helpful to write down which citations will be associated with each piece).    \nThen I just write as a stream of consciousness.\n\nFinally, reread the paragraph and refine. \n\nUltimately, you're writing this for the benefit of the reader. Even if you make technical errors (everyone does this), a legible text will at least make the reader a bit more forgiving.",
      "author": "onca32",
      "created": 1620228125,
      "upvotes": 6,
      "replies": {
        "gx2h9v3": {
          "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx2h9v3/",
          "text": "We can see OP’s style of writing in the post, it’s not the best...",
          "author": "giantsnails",
          "created": 1620245888,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gx1addf": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1addf/",
      "text": "If you're comfortable and interested I'm happy to take a look at a future draft before sending it to your PI. Have a STEM PhD and studied English in undergrad. Just PM me and give me more than a day's notice.",
      "author": "drz112",
      "created": 1620228067,
      "upvotes": 2,
      "replies": {}
    },
    "gx1h87g": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1h87g/",
      "text": "Lots of nice advice in here - i just want to add that i think if you improve your writing, i think the experience would only make him more likely to accept you in his lab. \n\nSome people are naturally gifted at writing, some aren't. The difference between being naturally good and *getting* good is only that the altter *also* shows that you know how to learn, which is arguably much better.",
      "author": "boriswied",
      "created": 1620230857,
      "upvotes": 2,
      "replies": {}
    },
    "gx1q11w": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1q11w/",
      "text": "Often times universities will have a dedicated person in their writing center whose job it is to take appointments with students and go through their papers with them. These are people with extremely high technical writing skills who can help show you what makes good vs great writing.",
      "author": "waterbenderwannabe",
      "created": 1620234412,
      "upvotes": 2,
      "replies": {}
    },
    "gx1v3xu": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx1v3xu/",
      "text": "As far as generally improving your writing goes, I really like Steven Pinker’s *Sense of Style.* There are a ton of books out there like this one but I recommend his because he uses writing samples and breaks them down.",
      "author": "lStannisl",
      "created": 1620236529,
      "upvotes": 2,
      "replies": {}
    },
    "gx167wq": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx167wq/",
      "text": "I don’t work in STEM but I am a transfer pricing consultant, and most of our deliverables are written reports that have to explain pricing methods in complex transactions, along with the rationality of these pricing methods, so that it can be understood by tax authorities in instances of tax audit. \n\nI would often focus on technical analysis and the “difficult” parts, which would lead to more careless mistakes in the more basic sections, perhaps similar to the “technical errors” that you mention. I found that a three stage self review worked for me, whereby I would perform self review three times, but check for different elements each time. For example, the first self review would just be reviewing the technical correctness of the analysis; the second would be reviewing just the readability and coherence of sentences, ensuring that sentences follow a logical argument; and the third would be reviewing basic formatting points and correct input of figures and data. Focusing your review on something different each time seems to help notice things that can be easily missed, as the mind can get easily distracted when the content is complex and technical. \n\nHope that helps!",
      "author": "Reiko_Nagase_114514",
      "created": 1620226316,
      "upvotes": 3,
      "replies": {}
    },
    "gx14yk2": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx14yk2/",
      "text": "I find reading other people’s studies related to my work helps. You can even try and replicate their writing style.",
      "author": "A_Brown_Crayon",
      "created": 1620225770,
      "upvotes": 2,
      "replies": {}
    },
    "gx19iw6": {
      "link": "/r/AskAcademia/comments/n5a4b6/how_to_improve_technical_writing/gx19iw6/",
      "text": "I'm not in STEM but I teach writing. What I do is look at the papers that I like and note the writing strategies used in them. How do the author's structure their intro? What kind d of strategies do they use to link ideas or to refer to additional scholarship? It also helps if you follow a structure in your paragraphs to get you started",
      "author": "pin_yue",
      "created": 1620227710,
      "upvotes": 1,
      "replies": {}
    }
  }
}