{
  "sid": "n00q6i",
  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/",
  "title:": "Humanities PhDs that have left academia, what do you do now?",
  "text": "The market has been terrible since I was in undergrad. I am getting towards the end of my PhD and I know that I need plan B's and C's (really these will more than likely be A and B with academia being a Hail Mary). But I am struggling with thinking about alternatives. I have some friends in the private sector that say consulting could be a good fit. Others say to go into teaching, but I'm certain that this requires even more school.",
  "author": "Chiquye",
  "created": 1619563518,
  "updated": 1634080723,
  "over_18": false,
  "upvotes": 191,
  "upvote_ratio": 0.99,
  "comments": {
    "gw44w4k": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw44w4k/",
      "text": "> Others say to go into teaching, but I'm certain that this requires even more school.\n\nDepends where you are trying to teach. Public schools (in the US anyway) often require certification of some sort. But private schools do not. (My wife got a PhD in History but now teaches at an elite private school. She has never needed any kind of additional training or certification.)\n\nIt would help to know what flavor of humanities you are — the options can vary depending on it.",
      "author": "restricteddata",
      "created": 1619568263,
      "upvotes": 112,
      "replies": {
        "gw44zq6": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw44zq6/",
          "text": "History, I'm a historian of Latin America.",
          "author": "Chiquye",
          "created": 1619568313,
          "upvotes": 54,
          "replies": {
            "gw468u6": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw468u6/",
              "text": "Gotcha! Among the historians I know who \"left\" academia:\n\n* Three became consultants at places like McKinsey or RAND. HARD WORK of a sometimes dubious moral character. Math skills typically required.\n\n* Two (a married couple) joined the Foreign Service and now live a pretty interesting life abroad on the policy track for the US State Department.\n\n* Two became consultants within industry or less-dubious think tanks relating to the subject matter of their research (e.g., they were historians of medicine, so they now do medicine-related consulting).\n\n* A few (including my wife) went into the world of private high school teaching. HARD WORK but can be relatively lucrative and rewarding. If you want to know more about that, feel free to PM me and I can tell you how this world works (at least in the USA).\n\n* One went into radio journalism and has been ridiculously successful there (this is both HARD and requires LUCK, because those jobs ain't exactly hanging on trees either).\n\n* One basically went into NTT academia, getting a long-term appointment running a teaching center (I think it is a program for first-gen students and things like that) at a prestigious university. Not adjunct hell but not a TT route. She teaches a class or two, but mostly runs the program.\n\n* One found his way into the museum world (also a competitive place!). It should be noted that he had interests in this area prior to finishing the PhD, and made sure to do lots of work (e.g., at the university museums) in this area prior to graduation.\n\n* One went to law school (on top of the PhD), got a law degree, worked at the Hague for awhile, then worked in corporate law for awhile (hated it), then worked at a law school legal clinic for awhile (low pay), eventually landed a TT job at a law school (verrrrry long path).\n\n* One bounced around a few different kinds of jobs writing copy of different sorts of private companies, and is now (I think) doing some kind of journalism/research. Not a lot of job security. (This person technically never finished the PhD, FWIW.)\n\nThis is not a complete list, just the people I know of off the top of my head from cohorts similar to mine (part of the dreaded \"graduated a couple years after the 2008 crash\" cohort). Only the last one has really struggled with job security. Most seem to like their jobs. (One of the McKinsey ones does NOT seem to like their job, but the RAND ones all seem to.) This is not exhaustive of the possibilities, just spinning out some actual things people I know first-hand did. None of them ended up as the proverbial barista at Starbucks.",
              "author": "restricteddata",
              "created": 1619568948,
              "upvotes": 283,
              "replies": {
                "gw4ked2": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4ked2/",
                  "text": "> This is not exhaustive of the possibilities, just spinning out some actual things people I know first-hand did.  \n\nAnd yet this the most comprehensive list of alt-ac career pathways I’ve ever seen. Thank you so much for writing it up. Not OP, but I just might take you up on asking about your wife’s high school teaching pathway.",
                  "author": "ConsciousReindeer265",
                  "created": 1619576035,
                  "upvotes": 167,
                  "replies": {
                    "gwbd3co": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gwbd3co/",
                      "text": "Also happy to help in any way that I can as a soon-to-be history PhD who just navigated the difficult private HS market!",
                      "author": "urmedieval",
                      "created": 1619714960,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gw4zr6x": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4zr6x/",
                  "text": "This is insanely useful. I don't think you realize how many people find thw information you provided incredibly helpful! Again, thank you for posting this very thorough list IMO",
                  "author": "nemoflamingo",
                  "created": 1619585142,
                  "upvotes": 51,
                  "replies": {}
                },
                "gw46l7j": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw46l7j/",
                  "text": "Thanks this is greatly appreciated",
                  "author": "Chiquye",
                  "created": 1619569119,
                  "upvotes": 30,
                  "replies": {}
                },
                "gw74c5v": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw74c5v/",
                  "text": "Since a number of people have asked about the private school path, here's my semi-standard spiel. Again, this is by proxy (my wife's experiences, not mine), but it's been a decade or so that she's been in this world and so I've gotten something of a sense of it.\n\nFirst, there are multiple \"tiers\" of private high schools in the USA. If you have a PhD you are aiming at the top ones, or to end up in those. The lower and middling ones don't necessarily find a PhD attractive, and they aren't places you probably want to work anyway. You want a school that is comfortable with its status and isn't worried about enrollments. If it gets worried about enrollments that means it will be hesitant to stand up to asshole students and parents, and will throw their teachers under the bus. Being able to stand up to rich, entitled parents (who think they know everything about education, since they once had one) is absolutely key for a teacher-friendly workplace. The best private schools have more resources than most university humanities departments (at my wife's school, they don't actually know what their annual book budget is because they've never come close enough to it to matter... imagine that!).\n\nSecond, the hardest thing will be getting your foot in the door. You will need to jettison all of your jargon, and any sense that you are \"settling\" for a private school job. These are good, fulfilling jobs. They are not academia. If you go into the interview (or the job) with a chip on your shoulder it will be completely visible to everyone else. If you go in with a sense of superiority, it will be completely visible. And the odds are that no matter how good of a college teacher you are, you will have a lot to learn when you go to a high school setting. It's not quite the same thing. You can't throw a lot of Foucault at your students and expect them to get it. They are not developmentally there yet. You _can_ give them a lot of really high-powered ideas, but you have to dress them up in the experiences and language that your students will already be familiar with. This is a skill that takes time to learn. (So you can't assign Foucault himself, in all of his badly-translated French glory, but you could, for example, introduce the idea of the panopticon in a very slow way and have them get it.) Private schools are going to be VERY wary of you at first, because they will fear that you think too highly of yourself to actually do the work of high school teaching.\n\nThird, it is a \"show up early in the morning on time\" kind of job. It is a \"get all of your grading in promptly\" kind of job. It is a \"you will be on your feet from the minute the kids arrive until you leave the door to go home\" kind of job. Which is to say, it's not flexible, in terms of time, like academia is. It's very regimented, though the class periods are divided up a lot smaller than college courses so the day goes by _very_ fast (in my experience, having guest taught at my wife's high schools a few times). You will not have time or energy to do research — you should just ditch that fantasy. Your summers are your own, and maybe you'll want to do that then. But I think a lot of recent PhDs harbor the idea that they'll be able to effectively be some kind of alt-ac and still keep a toe in the field (and maybe apply for a TT job someday if the perfect one comes up...). I wouldn't bet on it, realistically. It's a lot of work. Aside from a jam-packed workday, you also have to grade homework and prepare assignments for the next day. It is basically a 5.5 day workweek. But again, you do get your summers off. And other breaks, etc.\n\nFourth, the biggest and best of these schools tend to be in big cities. That's a perk and a punishment! High cost of living, etc. Not for everyone. There are a few that are more isolated, though they are often boarding schools (as opposed to \"day schools\" — where students are just there for the day) and that's a different kettle of fish that I don't know much about. (We have some friends who now work at a boarding school and appear to love it. They basically get free housing, which counts for a lot these days, financially. The downside, of course, is that 90% of their life is school-related. But it's a different life either way from a day school.) \n\nFifth, one of the perks of the private school world, versus academia, is there is a lot more \"churn\" in the industry. Jobs come and go all the time. People transfer between schools all the time. There is a definite job \"season,\" but at any time of the year a place might need a fill-in position and if you do a good job at that, it might turn into a permanent position. I have never heard of a private school with something like tenure (doesn't mean it doesn't exist, but I haven't heard of it), but usually there is a \"probationary\" period in which you can be dismissed for any reason, but after that your job security is fine so long as you don't do something heinous. At my wife's school the turn-over rate for new faculty is HIGH because they (like a lot of elite schools) put a lot of emphasis on understanding the local culture (teaching effectively, dealing with parents well-enough, dealing with your colleagues well, etc.) and for whatever reason a good number of people (most with recent PhDs) just can't hack it. To be fair to the school, a lot of those people would have problems in a lot of non-academic jobs. Academia allows the eccentric to thrive (one of the reasons I thrive in it), but private school eccentricity has to be either tamped down or funneled into acceptable silos. Note that when you are a high school teacher in the USA you are held to an old-fashioned \"moral standard\" that is different than a college professor or graduate student. Scrub your social media and lock it down. No photos of you drinking with your pals. Nothing sexy. Is this bullshit? Yes. Is this the reality of how parents and thus administration views you? Yes. \n\nSixth, and finally, how do you get these jobs? There are basically two routes. One is to register with [Carney Sandoe](https://www.carneysandoe.com/) and if they take you as a client, they will try to match-make you with schools. There is really nothing to lose trying it this way, because it doesn't cost you anything (the schools end up paying for it, if they hire you). My wife and I both did this a bit early on, just to test the waters. It wasn't worthless but it didn't turn into anything for us, and frankly I don't think many of the colleagues she has got their jobs this way. But it's something to try and it can give you some interview experience at the least. They have regularly conferences in several big cities in the US and you can do some lightning interviewing rounds there. Can't hurt if you don't have to travel far.\n\nThe other way is to just apply to jobs out of the blue. The [National Association of Independent Schools](https://careers.nais.org/jobs) maintains a very active job list. Again, there is a \"season\" for these jobs (it's similar to the academic one, but a little later, I think), but jobs can pop up all the time. Most jobs won't be what you want, surprise surprise. But a lot of the people who end up in this world just do this approach. If you get an on-campus interview, be aware that you'll have to teach a sample class — one that you don't know, who doesn't know you, and so on. Probably the hardest part and the easiest part to screw up. My recommendation is to be warm and funny and confident (so easy, right?), and aim for a relatively low level of engagement but be ready to scale it up if the students actually are willing to work with you. You want to look like someone who sort of gets that high school students aren't college students, but you still would give them a quasi-college-like education (always the ambition of a prep school), and that you'd be a colleague they'd want to work with. \n\nIn terms of the actual job satisfaction, what my wife likes about the work is you form very deep bonds with the students (you see them almost every day, so it's a lot deeper than the college connections), at her schools she has been able to have a lot of latitude for course planning in the classroom (very different than most public schools), and there can be some cool perks (book budgets, outside speakers, etc.). If you're good at your job you'll have parents and students telling you how transformative you have been. Some of those students will stay in touch with you their whole lives. It's an incredible thing.\n\nWhat she doesn't like about it is that the workload can be grinding, you have very little free time for independent projects or growth outside of the school, there are some times very silly office politics (like everywhere), and the administrations are often not quite as enlightened as the faculty (a stark difference from our enlightened university administrators, I always agree). And the stuff about scrubbing your social media and all that (but I think she was actually pretty happy to abandon social media anyway). And of course even if you work at once of the top schools in the country, to some people you'll just be \"a high school teacher\" — it carries very little social capital with it for most people. \n\nOh, and you are, essentially, contributing to class inequality in this country, by giving the elite a huge leg up over everyone else. We always justify the latter by saying, well, shit, these people are going to be running things in a decade anyway, so they might as well get a real, myth-free, no-nonsense history education (one with full attention to the histories of racism, classism, sexism, you have it), and maybe they _won't_ turn into huge assholes down the line. But everyone sort of has to make their peace with this aspect of it in this world.",
                  "author": "restricteddata",
                  "created": 1619632034,
                  "upvotes": 20,
                  "replies": {}
                },
                "gw4fgkx": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4fgkx/",
                  "text": "Hi there, not OP and but I see your flair states that you are in academia and I wanted to ask how you feel about your career trajectory compared to your friends/peers with PhDs (in terms of work hours, stress, flexibility, fullfilment and the like). Thank you in advance :)",
                  "author": "blondiecommie",
                  "created": 1619573552,
                  "upvotes": 6,
                  "replies": {
                    "gw4k1ya": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4k1ya/",
                      "text": "It's hard to generalize about both career paths, I'm sure — it's going to depend on all sorts of things related both to the institutions one works for, and one's other life priorities (e.g., family, where you live, etc.). And look, I've been very lucky — I got the TT job at an institution that likes the kind of weird work I do, is reasonably well-run, and they just gave me tenure. If that were the viable alternative for most people it'd be the obvious choice, but that's not even a very likely outcome, even for most TT jobs, many of which (as comments here frequently attest) can be agonizing anxiety machines. My job has its ups and downs, like all jobs, but the core \"ups\" are what I focus on most of the time (while sometimes trying to subtly correct the \"downs\" that are accessible to me to address, like morale in my program and things like that). \n\nThe #1 thing I value about my job is autonomy and flexibility, as well as the expectation that I am going to spend some portion of my time (never enough, but some) just thinking about stuff I want to think about. To me, that's the value of an academic job, but most academic jobs — even many TT jobs — don't really offer that.",
                      "author": "restricteddata",
                      "created": 1619575856,
                      "upvotes": 25,
                      "replies": {}
                    }
                  }
                },
                "gw4zsnj": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4zsnj/",
                  "text": "Sounds like you went to a pretty elite school. I think when discussing where humanities graduates end up, people shouldn’t give false hopes to people from run-of-the-mill universities because well-connected rich people at Harvard and Stanford turned out okay. Not saying that’s what you’re doing, but I’ve seen it done.",
                  "author": "TakeOffYourMask",
                  "created": 1619585171,
                  "upvotes": 36,
                  "replies": {
                    "gw67coo": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw67coo/",
                      "text": "My school _was_ elite but you shouldn't confuse that with its graduate students being \"well-connected rich people.\" (Its undergraduates largely fell into that category, of course, but the gulf between the grads and the undergrads is a deep one!) We weren't, on the whole. Of the above, maybe one or two came from families one would describe as \"elite,\" and in none of the cases above was it a \"my roommate was Mark Zuckerberg and that's how I got the job\" scenario. Every one of the above absolutely worried about the job market, every one felt the need to really hustle to get anything after their PhD. Ditto those of us who did end up in academia in the end. A fancy CV can get people's initial attention but it doesn't get you the job, not these days anyway.\n\nObviously the school you go to matters in how easily doors initially open for you, of course — school reputation matters immensely, more than it ought to, as we all know. I don't recommend people doing a PhD in History (or really any humanities), for example, from a school without an amazing reputation both inside and outside the academy — whether you want to succeed in academia or outside of it, the degree reputation is going to be a huge differentiator in a world flooded in such PhDs. This is not exactly a radical claim. (My wife got her PhD from an elite state school, for whatever that is worth. As did many of her colleagues at her current job.)\n\n(I come from a middle-class family and went to a state school for my undergraduate, FWIW.)",
                      "author": "restricteddata",
                      "created": 1619618051,
                      "upvotes": 20,
                      "replies": {
                        "gw7i7ta": {
                          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw7i7ta/",
                          "text": ">well-connected rich people\n\nI gotta agree with this. I also went to and go to \"elite\" private institutions in the Northeast as an undergrad and as a Ph.D. student, and \"well-connected rich people\" really applies to undergraduate students. I mean, yes, rich (and driven) college students have a better opportunity to get into an elite Ph.D. since they can focus on their research and study, rather than worrying about paying tuition and bills. But it's not that some fancy volunteer work in the third-world country or some other fancy extracurricular activities and expensive tutoring get you into prestigious graduate schools. As a Ph.D. student, I've met two graduate students whose parents are super influential (a high-ranked politician and a super famous actor in their own respective countries), but other than those two, my colleagues are from a middle-class or working-class background. This is quite a contrast from my undergraduate school, where something like 60% of the student body was from the top 1% family income ladder in the U.S. \n\nAnd this is not to deny what you said about the companies. Those places want students from elite schools. All I'm saying is that that's not because the graduate students who go to elite schools are \"well-connected rich\" people. It just tells you the favoritism those companies have. There are a couple of students I know who ended up at McKinsey from a humanities discipline, but they did it through a hiring process, not through personal connections like their parents, relatives, or wealthy friends.",
                          "author": "Kindly_Book5115",
                          "created": 1619637875,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gw6exdm": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6exdm/",
              "text": "All historians I know who have left academia (10+) do very well in a range of fields. Intelligence, NGOs, high level of government, archives, etc.\n\nThere is literature that argues that historians are trained in skills that are particularly in demand outside of academia compared to many others.",
              "author": "molobodd",
              "created": 1619621474,
              "upvotes": 10,
              "replies": {
                "gw6gj5o": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6gj5o/",
                  "text": "Which sounds awesome, but finding these jobs and selling yourself to them seems difficult to impossible, coming from a historian currently looking for jobs external to academia.",
                  "author": "mollymayhem08",
                  "created": 1619622160,
                  "upvotes": 6,
                  "replies": {
                    "gw7asux": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw7asux/",
                      "text": "It's been a while since I knew this group of people, but I think most of them got their respective jobs via contacts that related to their expertise at the time. (Cold War history > intelligence, contemporary political history > government, etc.) I think this was just the first step outside academia, and the the second and third step beyond that built on the former, and by then their different theses subjects were all a thing in the past.\n\nI don't think any of them looked for jobs on the open market. They were \"drafted\" more or less by chance at a time when they got to choose between a well paying steady job or stay in academia and get a similar job security some 10-15 years down the line.\n\nSorry for not having more concrete tips here, but all I can say that is that I don't think I have met a historian outside of academia who stayed unemployed for long or who had to do unqualified work after their PhD's.\n\nA PhD in Latin American history should be a type of expertise that is a super strong merit in government and NGO work alike. The tricky thing is for you and this \"market\" to find each other.",
                      "author": "molobodd",
                      "created": 1619634739,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gw5z3sr": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5z3sr/",
              "text": "I mean, it's not the best fallback, but I'm guessing that means you have enough graduate hours in Spanish to qualify to pick up part-time teaching gigs in Spanish while you look around for plan B or C?\n\nAlso, I know that when you finish up the diss, the last thing on earth you want to do is more school, but most states and provinces can get you certified to teach secondary ed with a one-year program. \n\nA super-easy you-could-have-done-this-with-a-BA fallback for at least a year or two is teaching English overseas (or at least that was an option before the pandemic).",
              "author": "AndrewSshi",
              "created": 1619613809,
              "upvotes": 5,
              "replies": {}
            },
            "gw6w9no": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6w9no/",
              "text": "It definitely depends on your state, but my fiancée is a high school history teacher who didn’t do her certification during her BA program, she just did an alternative certification program online. Your state board of education should have a listing of similar programs - you do all of the education coursework (videos about how to teach) and study for your certification test, take the test, and then you can be hired as a teacher. During your first year, you have some assignments that you have to complete, but trust me, they were straightforward and not that difficult. You pay off the tuition fees during your first year, it comes out of your paycheck. Other programs may work differently, but the way my fiancée did it, it was pretty easy. You might not want to do this after getting a PhD, but it at least isn’t more school, just online requirements you have to complete.",
              "author": "throwaway-soph",
              "created": 1619628703,
              "upvotes": 2,
              "replies": {}
            },
            "gw7bmwm": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw7bmwm/",
              "text": ">History’s self-consciousness is often cited as a distinctive quality of the discipline. This involves, for me, a critical, sceptical approach to enquiry -- alert to differences of perspective, to gaps, ambiguities and agendas -- and also an awareness of the influences on our own practice. It is a quality highlighted by scholars advocating history’s importance in contemporary life, the case being that critical historical thinking is a valuable resource for the informed exercise of agency, whether as a decision-maker at the highest levels or as an individual citizen. (Green, 2016, p. 97)\n\nGreen, A. (2016), *History, Policy and Public Purpose : Historians and Historical Thinking in Government*, London: Palgrave Pivot.",
              "author": "molobodd",
              "created": 1619635089,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gw4rl67": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4rl67/",
      "text": "Policy analyst for a Govt department. Was sad to leave academia but now I get to do interesting work with intelligent people, clock off at 5pm, I'm paid a decent wage and get to live in the city I want to live in :)",
      "author": "missquince",
      "created": 1619579983,
      "upvotes": 62,
      "replies": {
        "gw6orp7": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6orp7/",
          "text": "This is what I'm leaning toward as well but for criminal justice.",
          "author": "FolkMetalWarrior",
          "created": 1619625590,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gw4fn4n": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4fn4n/",
      "text": "[deleted]",
      "author": null,
      "created": 1619573643,
      "upvotes": 41,
      "replies": {
        "gw4g2r6": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4g2r6/",
          "text": "I study Latin American history, I would love to know more about museum studies.",
          "author": "Chiquye",
          "created": 1619573857,
          "upvotes": 16,
          "replies": {
            "gw4kei7": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4kei7/",
              "text": "[deleted]",
              "author": null,
              "created": 1619576037,
              "upvotes": 25,
              "replies": {
                "gw4ktxa": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw4ktxa/",
                  "text": "That's one thing I fear. My uni offers museum studies certification. Would a 1 year program teach me enough of the basics? I assume (perhaps incorrectly) that there's on job training too.",
                  "author": "Chiquye",
                  "created": 1619576263,
                  "upvotes": 7,
                  "replies": {
                    "gw5qswn": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5qswn/",
                      "text": "Museums are also challenging to get a job in - I have a museum studies certificate from my Masters (doing a Ph.D now). The best thing you can do is internship after internship (job maybe) while in school for experience. Out of my museums studies certificate, cohort of 30, 2 work in museums.",
                      "author": "cattail31",
                      "created": 1619608433,
                      "upvotes": 5,
                      "replies": {
                        "gw94scv": {
                          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw94scv/",
                          "text": "please join us in r/MuseumPros",
                          "author": "RedPotato",
                          "created": 1619664991,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gw64gyn": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw64gyn/",
                  "text": "Lol thanks for this followup. I work in an adjacent field and people are always shocked when they find out we have our own required degrees and aren’t just a backup plan.",
                  "author": "Untranslatedmoments",
                  "created": 1619616649,
                  "upvotes": 3,
                  "replies": {}
                },
                "gw5uqva": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5uqva/",
                  "text": "Did you end up getting any specific credentials in Museum Studies?",
                  "author": "nerdhappyjq",
                  "created": 1619611184,
                  "upvotes": 2,
                  "replies": {
                    "gw6kfss": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6kfss/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1619623839,
                      "upvotes": 2,
                      "replies": {
                        "gw8uy1c": {
                          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw8uy1c/",
                          "text": "Gotcha. I thought about getting into Museum Studies, but when I was researching how to actually get a job in the field, it seemed that the only successful people were people like you who had a lot of varied experience and contacts.",
                          "author": "nerdhappyjq",
                          "created": 1619660130,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gw51lz4": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw51lz4/",
              "text": "Important to know: there were no jobs in museums before COVId, and now a bunch of institutions have closed. Very experienced ppl got laid off this year; they’ll be the first to be hired back. Unpaid internships are the standard for entry level positions (though this is changing). Pay in most departments is trash (better in development). Don’t pay for a one-year Museum Studies program, they’re too general to get you any marketable skills. Your best bet is an internship/fellowship while you’re still in school, or a postgrad fellowship the summer or year following your degree. Just know it’s a rough market and gonna be rough for a good long while.",
              "author": "Euax",
              "created": 1619586465,
              "upvotes": 21,
              "replies": {
                "gw5chwj": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5chwj/",
                  "text": "R/museumpros",
                  "author": "RedPotato",
                  "created": 1619595273,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gw5cfho": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5cfho/",
              "text": "Hey. Come visit us at r/museumpros.\n\nI don’t mean to discourage but the prospects in the museum field aren’t great either. Landing a museum job is like landing a TT job - few availability’s especially post covid. Now I’m not saying don’t do it (that would be very hypercritical of myself as a PhD in Museum Studies) but don’t think this is somehow the fallback or easy route.",
              "author": "RedPotato",
              "created": 1619595210,
              "upvotes": 9,
              "replies": {
                "gw5px8j": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5px8j/",
                  "text": " I've heard this. I have 2 colleagues that are curators getting their phd and they said the job market is as competitive as the TT. Another is getting a public history degree which is cool but also doesn't have a Fircrest career path.",
                  "author": "Chiquye",
                  "created": 1619607744,
                  "upvotes": 4,
                  "replies": {
                    "gw6tgns": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6tgns/",
                      "text": "Okay, cool. As long as you get it. We often hear about advisors suggesting that humanities PhDs take museum jobs, thinking that this is somehow easier or has entirely transferable skills. While there is some truth to transferable skills, museum studies and arts administration is an entire field that you'd need to learn at least the basics... there's a ton of books out there to give you an overview, and again, r/museumpros will give you a good start on what we actually talk about amongst ourselves.",
                      "author": "RedPotato",
                      "created": 1619627546,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "gw5cg02": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5cg02/",
                  "text": "Here's a sneak peek of /r/MuseumPros using the [top posts](https://np.reddit.com/r/MuseumPros/top/?sort=top&t=year) of the year!\n\n\\#1: [Somehow, even as I catalog, my backlog never does seems to decrease.](https://i.redd.it/qvrfs4kk6vp61.jpg) | [20 comments](https://np.reddit.com/r/MuseumPros/comments/mfe2ve/somehow_even_as_i_catalog_my_backlog_never_does/)  \n\\#2: [Made this meme for my museum studies class, thought it might be appreciated here](https://i.redd.it/0526f6e8fps51.jpg) | [11 comments](https://np.reddit.com/r/MuseumPros/comments/j9w2tl/made_this_meme_for_my_museum_studies_class/)  \n\\#3: [Found this humorous... a bit morbid really. I know it’s not the most credible job resource site but it’s painful to look at.](https://i.redd.it/02pim1o2g4b61.jpg) | [7 comments](https://np.reddit.com/r/MuseumPros/comments/kwj6j8/found_this_humorous_a_bit_morbid_really_i_know/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)",
                  "author": "sneakpeekbot",
                  "created": 1619595223,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gw5caeg": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5caeg/",
          "text": "R/museumpros",
          "author": "RedPotato",
          "created": 1619595084,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gw57qvj": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw57qvj/",
      "text": "The fact that people have to resort to Reddit to find out answers to these questions tells you everything you need to know about just how much academic depts care about what happens to their PhD graduates after they’ve pushed them out of the door.",
      "author": "wj_gibson",
      "created": 1619591228,
      "upvotes": 139,
      "replies": {
        "gw5qk2o": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5qk2o/",
          "text": "I look at it as a form of survivor bias. We're all trained by people who are tenured. We may occasionally interact with non-tenured and adjunct faculty. Tenured folks only know how to train us to be professors/professional historians. \n\nAdd to this departments in humanities have shoe string budgets and non of what they do have is going to training us in fields outside the academe. Most the responses on here are the same thing I've been told by professors and recent grads at my uni. I just figured I'd ask people who will be brutally honest about their trajectory and what it took to get where they are",
          "author": "Chiquye",
          "created": 1619608243,
          "upvotes": 35,
          "replies": {
            "gw6elk8": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6elk8/",
              "text": "This. \n\nI also find that a lot of my graduate school professors and administrators had very little understanding of what it looks like to struggle in the academic world. The majority of them were tenured before I even started high school and were given their first TT position with only a Masters. The majority of them would not land a TT position in today's academic world and they really don't grasp that. \n\nThey are basically like \"what? Like it's hard.\" I can't even tell you the amount of bad advice I've gotten from faculty who have been around since the 80s who just love to say things like \"I got this job without any publications on my CV so you aren't going to have any trouble getting one. You probably just aren't applying enough places.\" (Meanwhile, I'm cringing knowing that I applied to over 100 positions over the last two years and got 2 interviews out of the hours and hours and hours of work that went into that). While I think they are well intentioned, they are also incredibly out of touch and while they *should* realize how deep the candidate pool is now given the fact that they serve on hiring committees, they really don't get it.",
              "author": "littleirishpixie",
              "created": 1619621331,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "gw5d00t": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5d00t/",
          "text": "People with PhDs is one of the byproducts of the academic system.",
          "author": "CaptainCornerCamper",
          "created": 1619595735,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "gw5mxem": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5mxem/",
      "text": "Got my English PhD in 2018 from a non-elite Canadian institution. Decided I wanted to live closer to home (small city). Worked for a small market intelligence firm for a while. The work was interesting but it didn't pay much. Decided I wanted to work in public policy. Through a connection (prof i had RAed for during phd) got a postdoc focused on public policy. Now I am working on getting into federal gov as a policy analyst but there are still some barriers. Just got to the final phase in one process and they asked for undergrad transcripts to check I have enough coursework in economics, which I do not (I was clear in the application about what I have). So now l am enrolling in some online 1st year undergrad economics courses this summer to avoid this in the future lol\n\nI have a couple of friends employed at the university as dedicated writers for research institutes. Again, its interesting work but it doesn't pay well.",
      "author": "suhawhee",
      "created": 1619605192,
      "upvotes": 18,
      "replies": {
        "gw5nu94": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5nu94/",
          "text": "Wow you're close to being hired by the federal government! I heard that the recruitment process is so long and tedious. I hope things work out for you. I'm thinking about doing this, but I feel a lot of uncertainty about whether I'll actually enjoy the job at the end of the day. I'm currently doing my PhD in a different field than policy analysis so it's difficult for me to know whether a job in the federal government is the right path for me.",
          "author": "Scientism101",
          "created": 1619605995,
          "upvotes": 4,
          "replies": {
            "gw5oipy": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5oipy/",
              "text": "Thanks, I suspect things won't work out with the process I mentioned but I'm hopeful about a 2-year term for a different process I'm in (they just called my references yesterday!) These are both from an inventory I applied to in 2019 so yes its a long process!\n\nI know there are aspects of government work i wont like, but having been working in private sector/non-TT academia for a few years now, I have a better sense of what kind of salary I can achieve doing different things and federal looks like the best/most stable path. Its becoming the main non-academic route for grads of my program",
              "author": "suhawhee",
              "created": 1619606583,
              "upvotes": 3,
              "replies": {
                "gw5pdqp": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5pdqp/",
                  "text": "I'm glad to know you have another plan! Yes, I've heard it's a long process. I should be getting started soon 😅. I have no job experiences beyond involvement in various committees and occasional internships so I really don't know what to expect in terms of a federal job. I'm glad that you were able to weigh options based on your other experiences. In my field it is rather uncommon for someone to work for the federal government. Most will end up working for the provincial government.",
                  "author": "Scientism101",
                  "created": 1619607298,
                  "upvotes": 2,
                  "replies": {
                    "gw5q6p1": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5q6p1/",
                      "text": "See, I've found provincial government impossible to break into, but I'm in a small province where hiring is largely based on networks\n\nIt doesn't hurt to try get into some federal inventories (post-secondary recruitment programs usually open up in the Fall)\n\nBut sometimes you just have to start applying places working to get a sense of what's out there and what kind of places might hire you. I had no plan when I finished because university was all I knew and there were no resources available to help me navigate it. Just applied to everything I thought I could do and really focused on my cover letters to explain how my grad degree was relevant experience.\n\n  \n\n\nGood luck out there! Its a tough adjustment, not gonna lie, but overall I'm glad I decided to leave the traditional academic track",
                      "author": "suhawhee",
                      "created": 1619607956,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gw513z8": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw513z8/",
      "text": "I manage the tutors at an online tutoring company. I wish I had had the foresight to pursue management consulting at McKinsey and the like, if only to pay off the debts of grad school before heading elsewhere.",
      "author": "talondarkx",
      "created": 1619586105,
      "upvotes": 17,
      "replies": {}
    },
    "gw6yzwk": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6yzwk/",
      "text": "English PhD. Did a brief stint in marketing and consulting. Wanted to hang myself. Then got a visiting assistant prof position that gave me tuition reimbursement, and I started get my Ed certification.  Then, thank god, published my first book and lucked into a tenure track line, and, when I say lucked I mean it. It’s an absolute crap shoot. Now almost 20 years down the road.  Full prof, etc.  Still believe I would have enjoyed teaching high school.",
      "author": "anonymouspimp",
      "created": 1619629829,
      "upvotes": 9,
      "replies": {
        "gw6z6qd": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6z6qd/",
          "text": "Also, good luck!",
          "author": "anonymouspimp",
          "created": 1619629907,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gw47fr5": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw47fr5/",
      "text": "I will soon graduate with a PhD in Spanish and I plan on exploring the field of localization. You obviously need to pay for these courses, but it's something to consider if you know a foreign language (especially Spanish), have experience translating, and would like to gain more marketable technical skills. Not sure if it's your cup of tea, but I'm considering giving it a try.",
      "author": "FredCornette",
      "created": 1619569541,
      "upvotes": 9,
      "replies": {
        "gw47ojr": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw47ojr/",
          "text": "What is localization? I am a historian of Latin America so I have solid reading and writing skills. I'm good in conversation but a bit shy. I still make mistakes while speaking too.",
          "author": "Chiquye",
          "created": 1619569663,
          "upvotes": 1,
          "replies": {
            "gw48kiy": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw48kiy/",
              "text": "[https://en.wikipedia.org/wiki/Language\\_localisation](https://en.wikipedia.org/wiki/Language_localisation)",
              "author": "FredCornette",
              "created": 1619570109,
              "upvotes": 4,
              "replies": {
                "gw5xtut": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5xtut/",
                  "text": "TIL. Of course that’s a field, but it never occurred to me before.",
                  "author": "nerdhappyjq",
                  "created": 1619613067,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gw5om9b": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5om9b/",
      "text": "Historian here (Europe-based with a European specialty though). About 10 years after defending, most of us have ended up in the cultural heritage sector: I am head of special collections at a university library, others are leading or working for local heritage organizations, coordinating a group of volunteers that describe cultural heritage artifacts, working for a national heritage library initiative... then there’s an editor for a local publisher, and we have a couple of cops, a stay at home dad, and a couple of people who work in a museum.",
      "author": "ServialiaCaesaris",
      "created": 1619606665,
      "upvotes": 10,
      "replies": {
        "gw94x1d": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw94x1d/",
          "text": "please join us in r/MuseumPros",
          "author": "RedPotato",
          "created": 1619665061,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gw6fruy": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6fruy/",
      "text": "It’s not of immediate help to OP but UC Berkeley has been running their Beyond Academia conference for a few years now, and it’s super valuable for answering questions about how to transition out of academia, with lots of representation for the humanities. https://beyondacademia.berkeley.edu/",
      "author": "singcal",
      "created": 1619621836,
      "upvotes": 7,
      "replies": {
        "gw6hx4h": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6hx4h/",
          "text": "Thanks for sharing this! I hope it helps others, it is definitely of some use for me.",
          "author": "Chiquye",
          "created": 1619622763,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gw71la9": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw71la9/",
      "text": "I’m stuck as an adjunct. Why? Because I’m burned out. Because I don’t have the energy to start all over again. Because every time I apply for a job I feel like I’ve just volunteered as “Tribute” in the Hunger Games. Joining this thread because I’d like to read about successful extractions from this cycle.",
      "author": "overeducatedmother",
      "created": 1619630895,
      "upvotes": 6,
      "replies": {}
    },
    "gw5tus1": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw5tus1/",
      "text": "Can I jump on this question but for literary studies (in Europe)?",
      "author": "alex_g_87",
      "created": 1619610601,
      "upvotes": 6,
      "replies": {}
    },
    "gw76sct": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw76sct/",
      "text": "I have a PhD in religious studies. I opted out of academia voluntarily after seeing so many of my peers toiling for years as adjuncts, or bouncing from one visiting position to the next every year or two. I have been working as an Executive Assistant at a non-profit for nearly three years and am really loving it, though that is partly because I am just temperamentally well-suited for administrative work. I do miss researching and writing and am hoping to transition to a job that lets me use those research skills at some point. But for now, I am at least paid reasonably well, get to contribute to a good cause, and don't have to grade garbage churned out by undergraduates. \n\nI have a former colleague now working as a freelance editor and making very good money doing that, though I'm not sure how she got started doing that.",
      "author": "weareedible",
      "created": 1619633055,
      "upvotes": 3,
      "replies": {}
    },
    "gw8ct05": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw8ct05/",
      "text": "I keep getting linked in notices that tell me my English PhD is *exactly* what the FBI is looking for (hey, I’ve read enough about murder in my spare time to believe I’d be an asset!), but there is a catch: they won’t hire you if you are over 36. Honestly, I would check this out if I were not over-the-hill in their eyes; alas, they are allowed to keep me and my grey hair away from Quantico. \n\nApparently, soft skills (research, communication, writing) are in demand. Where? I have yet to see such demand. I wish they would ring the dinner bell already. Me and my soft-skills are just sitting here aging into vinegar. . . .",
      "author": "overeducatedmother",
      "created": 1619651345,
      "upvotes": 3,
      "replies": {}
    },
    "gw6dilu": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6dilu/",
      "text": "Other people already said it, but look into private schools. They are eager to hire Ph.D.s more than anywhere. Elite private boarding schools are harder to get in because they already have lots of applicants with a Ph.D. degree when there's a job opening, but most private schools will open their doors for you if you have a Ph.D. and some teaching experience (i.e., TAs).\n\nIt's definitely hard work as *restricteddata* said. Parents can be demanding because they're paying tens of thousands of dollars for tuition, and if you work at a boarding school, you'll likely have to take another role like taking care of them at a dorm or organize an extracurricular activity. If you end up at a smaller private school, they might ask you to teach Spanish or some type of a general humanities course (world civilization, etc) on top of a history course. But it pays well; you don't have pressure for tenure; you get to teach what you love (hey, it's like teaching at a liberal arts college without a tenure review!); and if you have a child, they'll attend the school for free. So most people I know who went into this field genuinely like their jobs though there are hard days for sure. But what jobs don't?\n\nSo if you're open to teaching secondary school students but getting another degree is a concern, definitely look into a private school. (I also went to a private boarding school in New England, and there were very few teachers with an Ed.M. or M.Ed. Most \"only\" had Ph.D. or regular Master's (M.A. or M.S.) in their respective field.",
      "author": "Kindly_Book5115",
      "created": 1619620858,
      "upvotes": 3,
      "replies": {}
    },
    "gw6chu9": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6chu9/",
      "text": "[deleted]",
      "author": null,
      "created": 1619620405,
      "upvotes": 2,
      "replies": {
        "gw6gyf2": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6gyf2/",
          "text": "How did you find this job and how did you market yourself for it, if you don't mind me asking? This sounds potentially interesting to me but I'm not sure what jobs to look for, what skills are most valuable for it, etc.",
          "author": "mollymayhem08",
          "created": 1619622344,
          "upvotes": 2,
          "replies": {
            "gw6q3oe": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6q3oe/",
              "text": "[deleted]",
              "author": null,
              "created": 1619626148,
              "upvotes": 2,
              "replies": {
                "gw79fsp": {
                  "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw79fsp/",
                  "text": "Thanks for this! yeah I'm involved in/have taught myself a bunch in digital humanities and have worked in exhibit/production tech and project and event management in and out of academia, I know javascript/HTML/CSS/CS basics but can't really say I'm proficient yet. Just figuring out where I can attempt to market these skills  in addition to my research, writing, and soft skills has been a difficult task so far. I don't know what sort of jobs to apply for, at all.",
                  "author": "mollymayhem08",
                  "created": 1619634167,
                  "upvotes": 2,
                  "replies": {
                    "gw7dd3n": {
                      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw7dd3n/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1619635814,
                      "upvotes": 2,
                      "replies": {
                        "gw883i5": {
                          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw883i5/",
                          "text": "That’s a great point. I suppose my next step is figuring out how to build on the basics. I know boot camps are an option but I’m not sold on anything in particular yet. Thanks for taking the time to weigh in",
                          "author": "mollymayhem08",
                          "created": 1619649094,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gw6sm3k": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gw6sm3k/",
      "text": "Quit my psychology research and teaching roles in academia. Joining corporate as a researcher, gaming industry to be precise. Really excited because it offers the money my labour deserves and more opportunity for growth. More job availability. It's a win win for me, will have to adjust with the pace of work in corporate though, academia was snail paced.",
      "author": "snorlaxtothemax94",
      "created": 1619627192,
      "upvotes": 2,
      "replies": {
        "gwjmanv": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/gwjmanv/",
          "text": "Wow as a aspiring postgrad gamer and psychology researcher this is literally my dream job, can I ask how you landed this job?",
          "author": "lunareclipsexx",
          "created": 1619879970,
          "upvotes": 1,
          "replies": {
            "hacayfd": {
              "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/hacayfd/",
              "text": "Free online courses for upskilling and just keeping up to date with what's up and coming and out there. Even more important than that iss realising where you are isn't good enough and working to change that. Academia is so overrated that a lot people compromise beyond what they should.",
              "author": "snorlaxtothemax94",
              "created": 1629925217,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h9pstzc": {
      "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/h9pstzc/",
      "text": "Definitely looking into private school/boarding school teaching is a viable option. As comments said above, many private schools will open their doors to people who have PhDs, as there is not a requirement for private schools to hire candidates with a teaching license. That being said, teaching high school students will be definitely different from college students. High school students don't have the maturity as college students, but they are a fun group to work with.  A lot of private schools do allow teachers to create courses that suit their teaching interests, and a lot of elite private schools do allow teachers to create electives. That being said, teaching at a private school is a lot of work, as many private schools do ask teachers to participate in the school life outside of the classroom -- that could be being a coach, supervisor for a club, etc. But teaching can be rewarding and it is not a boring profession by any means.",
      "author": "Square_Calligrapher7",
      "created": 1629496551,
      "upvotes": 2,
      "replies": {
        "h9pwp76": {
          "link": "/r/AskAcademia/comments/n00q6i/humanities_phds_that_have_left_academia_what_do/h9pwp76/",
          "text": "And one reason to get into private school teaching is that kids typically will be more motivated and driven to learn. As many well-known NAIS schools have strict admission requirements, a lot of the students at these schools will be able to handle the workload and perform at a high level. And private schools look for teachers that truly enjoy teaching and connecting with adolescents. I did not have a teaching degree and I taught at a boarding school straight out of undergrad. Right now, I left that boarding school to go to graduate school, but the two years I spent teaching was rewarding.",
          "author": "Square_Calligrapher7",
          "created": 1629498275,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}