{
  "sid": "qmp3d1",
  "link": "/r/AskAcademia/comments/qmp3d1/how_to_list_t32_training_grant_on_cv_biosketch/",
  "title:": "How to list T32 training grant on cv, biosketch, other support, etc?",
  "text": "Hello,\n\nI am a postdoc and recently acquired funding through a T32 training grant at my university. I am very confused as to how this should be listed on my cv, biosketch, other support documents. When I list this as my funding source, do I list myself as the PI for my project which was selected for funding through my department and list the amount of funding I was awarded or do I list the PI who was awarded the original training grant and the total amount that was awarded?\n\nThank you in advance.",
  "author": "Titcomb84",
  "created": 1636045007,
  "updated": 1636136900,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjf1nkh": {
      "link": "/r/AskAcademia/comments/qmp3d1/how_to_list_t32_training_grant_on_cv_biosketch/hjf1nkh/",
      "text": "You are not the PI of the main grant. Do NOT list that grant. I don’t know how postdocs usually list T32s, but I would be careful. It is more analogous to getting funded as a grad student than getting a grant. You aren’t formally a PI, even if you are the lead investigator on your research project.\n\nSome faculty do list internal university research “grants” on their CVs. I suppose you could list yours that way.",
      "author": "bigrottentuna",
      "created": 1636121918,
      "upvotes": 2,
      "replies": {
        "hjf1y7d": {
          "link": "/r/AskAcademia/comments/qmp3d1/how_to_list_t32_training_grant_on_cv_biosketch/hjf1y7d/",
          "text": "I realize I am not the PI on the grant, but with a T32 I am officially a postdoctoral fellow and in the NIH system as such. Do I list it as the lead investigator of a T32 fellowship?",
          "author": "Titcomb84",
          "created": 1636122042,
          "upvotes": 2,
          "replies": {
            "hjf5chl": {
              "link": "/r/AskAcademia/comments/qmp3d1/how_to_list_t32_training_grant_on_cv_biosketch/hjf5chl/",
              "text": "You should list it as a postdoctoral fellowship in your education section. I would also probably list it as an internal grant or research award, but be clear that it is internal. You were presumably selected via some sort of competitive process and you got funded, so it’s worth mentioning. Calling yourself Lead Investigator is appropriate.\n\nMy concern is that PI has a formal meaning. This isn’t it, and you don’t want to appear to be claiming to be something you are not.",
              "author": "bigrottentuna",
              "created": 1636123410,
              "upvotes": 3,
              "replies": {
                "hjf9tdr": {
                  "link": "/r/AskAcademia/comments/qmp3d1/how_to_list_t32_training_grant_on_cv_biosketch/hjf9tdr/",
                  "text": "Got it. Thank you so much for the advice. I hadn’t been able to find a single example or guidance on the internet for this situation",
                  "author": "Titcomb84",
                  "created": 1636125184,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}