{
  "sid": "g2w6rg",
  "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/",
  "title:": "How do you guys deal with imposter syndrome and writer's block?",
  "text": "Im having a pretty hard time wrapping up my thesis and cant seem to tie everything together because of a pretty bad case of writers block. What also doesnt help is that it is making me feel incredibly stupid and that I dont know enough about my material. No matter how much I read I feel like its not enough",
  "author": "twitterdotcom",
  "created": 1587103388,
  "updated": 1634081336,
  "over_18": false,
  "upvotes": 140,
  "upvote_ratio": 0.97,
  "comments": {
    "fno1pa6": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno1pa6/",
      "text": "Hemingway method usually works for writers block. Just write whats in front of you instead of trying to interpret it all, don't think about it too much and don't worry if you might be stupid. It requires non of your personal feelings. Take it a step further and take in the Hemingway lifestyle and do it piss drunk, you'll be writing too much, and trimming the fat while sober.\n\nHemingway was interesting.",
      "author": "Snowpossum",
      "created": 1587108873,
      "upvotes": 56,
      "replies": {
        "fno24t8": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno24t8/",
          "text": "this is an interesting technique and gives me an excuse to have a beer or 7 friday night. Might just try this",
          "author": "twitterdotcom",
          "created": 1587109304,
          "upvotes": 24,
          "replies": {
            "fnob5z9": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnob5z9/",
              "text": "\"Write drunk, edit sober.\"\n\nI've done some of my best work between 2-4 beers. 😁",
              "author": "bs6",
              "created": 1587119001,
              "upvotes": 30,
              "replies": {}
            }
          }
        },
        "fnp9zzz": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnp9zzz/",
          "text": "So true!  One of my best papers was written while drunk, and I'm currently working on a novel.  Most of that was ghost written by my good friend Jack Daniel.",
          "author": null,
          "created": 1587141838,
          "upvotes": 6,
          "replies": {}
        },
        "fno28xe": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno28xe/",
          "text": "works for me as well, though I'm starting to be more careful with the second part. Feels weird to have a cabernet-, a beer- and a gin-essay on the resumé.",
          "author": "EcstaticEmphasis",
          "created": 1587109419,
          "upvotes": 6,
          "replies": {
            "fnpr0qx": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpr0qx/",
              "text": "Wait a second, I got impression that that part \"write drunk\" is metaphor :D",
              "author": "goranstoja",
              "created": 1587150412,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fnoucd6": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnoucd6/",
          "text": "It helped me to read textbooks or papers saying things in the same vein I wanted to say, then I would just rearrange the words to make them mine.",
          "author": "airwalker12",
          "created": 1587133756,
          "upvotes": 2,
          "replies": {}
        },
        "fnoitcm": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnoitcm/",
          "text": "Except Hemingway didn't drink until the writing was done for the day, but then drank more than enough to catch up.",
          "author": "dexwin",
          "created": 1587126276,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fnnxs1t": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnnxs1t/",
      "text": "I've had lots of issues with writer's block. I tend to just get really high for a weekend or a couple of days with my partner and not do anything related to work whatsoever. Taking time off and going away to somewhere (if possible) helps a lot. \n\nAlso, realising that writing is a struggle for almost everybody. Once my supervisor told me that writing is a struggle for her too and that she thought I was a fast writer, I started acknowledging that I'm not slow but that writing is just a slog. I often spend entire days in a row just staring at a paragraph barely changing anything after 5+ hours. We've all been there. Its the nature of the beast.",
      "author": "ThatMsAnthrope",
      "created": 1587105086,
      "upvotes": 58,
      "replies": {
        "fnnyj0l": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnnyj0l/",
          "text": "yeah the whole staring at a paragraph for hours on end is what Ive been doing recently, I wanted to have this draft done on Sunday and here we are lol. This and a combo of other things is making me glad im not really considering going for a PhD at least right away. I cant take too much time off but Ill try to take at least the afternoon or morning off tomorrow.",
          "author": "twitterdotcom",
          "created": 1587105792,
          "upvotes": 15,
          "replies": {
            "fno0pi5": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno0pi5/",
              "text": "For me, to stop staring at an blank page, I first just write down really really shitty words - just whatever I know I need to say/discuss, without trying any finesse or trying to make it sound good. Then I have a shit paragraph already written and for some reason my brain thinks its easier to edit that then to write a new one from scratch! \n\nI feels weird at first writing down what I know doesn't sound good/perfect but this method has worked for me so far. Spend as little time looking at the blank page and most of your time editing!",
              "author": "oddkinsandbodkins",
              "created": 1587107876,
              "upvotes": 25,
              "replies": {
                "fno272v": {
                  "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno272v/",
                  "text": "that basically what im dong now, wish i started that sooner, im making greater strides because of it right now",
                  "author": "twitterdotcom",
                  "created": 1587109367,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "fno3h0i": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno3h0i/",
              "text": "Also, remember that nobody keeps their deadlines in academia lol",
              "author": "ThatMsAnthrope",
              "created": 1587110674,
              "upvotes": 9,
              "replies": {
                "fnpwypt": {
                  "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpwypt/",
                  "text": "Thank god lmao I thought I was the only one struggling with meeting them",
                  "author": "twitterdotcom",
                  "created": 1587153511,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "fnomevk": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnomevk/",
          "text": ">Once my supervisor told me that writing is a struggle for her too\n\nMy supervisor is the exact same. He had a few different deadlines and he said to me he was finding it hard to start work on some of them. Made me see him in a new light (for the best) - he was human and even he had bad days. Made me feel a lot better though I'm still finding it hard to write, ha.",
          "author": "irishartistry",
          "created": 1587128939,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fno7s7e": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno7s7e/",
      "text": "Bullet points of POTENTIALLY useful things to say \n\n\n-put down key facts\n-related journals and summaries\n-the results I want to talk about\n\n\nWhen it’s all down in a list, it’s a lot easier to construct sentences.  If I don’t have the supporting results I go make more figures or if I don’t have the supporting background I go do more google scholaring .  If I can’t think of thr word i put underscore and then use review to leave a note outlining what I’m trying to say and move on.\n\n\nDealing with imposter syndrome——> “yoloooooooo, I’m going to make this @#&#! Work anyways “ is my overall mood.",
      "author": "RaddishEater666",
      "created": 1587115302,
      "upvotes": 16,
      "replies": {
        "fnokve7": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnokve7/",
          "text": "When I am experiencing writer's block I also make a sentence outline with bullet points. Basically I make a list of arguments following each other. For me, this really helps me with explicating the rationale I want to follow for a certain paragraph. In my experience, this is really useful while writing introductions/discussions of papers.",
          "author": "Boostinator",
          "created": 1587127842,
          "upvotes": 3,
          "replies": {}
        },
        "fnprk0s": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnprk0s/",
          "text": "If this is your method of writing you need to try Dynalist app!",
          "author": "goranstoja",
          "created": 1587150693,
          "upvotes": 1,
          "replies": {
            "fnptnao": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnptnao/",
              "text": ">Dynalist \n\nfor me adding in another processor just slows down the process, especially when scientific writing (what I do) for the most important feature for me is the insert citation button lol.  Keeping track of my bibliography and having it auto-update is key\n\n&#x200B;\n\nbut other writing types might work well.",
              "author": "RaddishEater666",
              "created": 1587151789,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fnohpqy": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnohpqy/",
      "text": "I literally name the first draft document - shit draft.doc. And just vomit all my ideas on it without regard to proper language or logic. As i progress with the draft find that I become more organized and write better. Then i go back to the vomit part and rewrite it. And rename the whole doc - first draft. It really helped to remove any expectation of excellence to get over the block. For the second draft i usually rearrange the whole thing and rewrite some more focusing on removing duplicate narratives, explaining assumptions and just revising logic and language. \nI'm a decent academic by the way, so the struggle is real for everyone.",
      "author": "doireallyhaveto2",
      "created": 1587125378,
      "upvotes": 16,
      "replies": {}
    },
    "fno2ont": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno2ont/",
      "text": "Donald Trump is in the white house dude you can do whatever you want",
      "author": "mpbarry46",
      "created": 1587109866,
      "upvotes": 65,
      "replies": {
        "fnomrup": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnomrup/",
          "text": "Fukayama's next book \"Donald Trump and the End of Imposter Syndrome\"",
          "author": "a_large_plant",
          "created": 1587129181,
          "upvotes": 20,
          "replies": {
            "fnotte4": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnotte4/",
              "text": "I would read that!",
              "author": "lnln8",
              "created": 1587133465,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "fnpwwsv": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpwwsv/",
          "text": "Fantastic point. Does this mean I’m qualified to be the president at this point lmao",
          "author": "twitterdotcom",
          "created": 1587153483,
          "upvotes": 3,
          "replies": {
            "fnpzuup": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpzuup/",
              "text": "Overqualified",
              "author": "guttata",
              "created": 1587155032,
              "upvotes": 5,
              "replies": {}
            },
            "fnqb9ou": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnqb9ou/",
              "text": "Yes sir",
              "author": "mpbarry46",
              "created": 1587161267,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fno4wm9": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno4wm9/",
      "text": "I'm experiencing the same thing. Although I'm done with my first draft (which I really don't want to submit), I really can't seem to work on it anymore. I feel like the material is there but it isn't connected. I tried taking a few days of (to the extent I can afford), but that doesn't seem to work either. To make things worse my supervisor thinks that the discussion is great and very well written and thus she thinks I have not written the introduction to my full potential. \n\nI know the material is shit (because it's the first draft and I still have to work on it a lot) but, I feel really stupid that I submitted it to her :(. Plus, there's this uncertainty because of COVID-19 regarding when I'm supposed to turn in my paper. I feel since I do not have a deadline DEADLINE, I'm not really productive. I have been the most unproductive lately. :(\n\nI'm sorry for the rant. What I mean to say is that you are not in this alone. What you are experiencing is completely okay. You'll turn in a great paper! All the best for your thesis! GO MAKE YOURSELF PROUD. :)",
      "author": "99neeee",
      "created": 1587112193,
      "upvotes": 9,
      "replies": {
        "fno591e": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno591e/",
          "text": "Same goes for you, friend. You can do this!!",
          "author": "EcstaticEmphasis",
          "created": 1587112562,
          "upvotes": 3,
          "replies": {}
        },
        "fnpxy4d": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpxy4d/",
          "text": "I struggled with being unproductive too honestly. And thinking it’s all a pile of shit. But like someone else pointed out a thesis doesn’t have to be perfect. No need for apologies and I know you’ll get it done too! Good luck with yours and take some advice here and destress about it when you’re feeling particularly down about it",
          "author": "twitterdotcom",
          "created": 1587154023,
          "upvotes": 2,
          "replies": {
            "fnq7nl2": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnq7nl2/",
              "text": "Yes, I have actually been going through the whole thread and it's the inspiring thing on the internet today. Have fun working on your thesis! :)",
              "author": "99neeee",
              "created": 1587159248,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fnoahv4": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnoahv4/",
      "text": " I kept postponing my thesis for three months because of this exact reason.\n\nThe key is to identify what is preventing you from writing:\na) Are you feeling lazy? Sadly, this can only be solved by just getting on with it.\nb) Are you feeling overwhelmed ? This might happen because you might be setting a higher bar for yourself. Instead of thinking in terms of \"I want to finish Chapter X by tonight\" just think of it as \"I will work on Chapter X today\". Even if you write one word you have met your goal. \nc) Are you trying to make your thesis the best work of your career? I was facing this issue as I was trying to make my thesis \"THE BEST\" work I would ever write until one of my colleagues pointed out that if I have a successful career my thesis would be one of the worst works (the graph would be going upwards). This helped me get rid of the notion that my thesis had to be perfect.\nThe last part is to remember that \"writing and editing are two very different aspects\". Yes, the sentence you wrote might be incorrect or might be grammatically wrong but don't delete it right away. Split your writing sessions into two blocks, one where you just write the other where you edit and review what you wrote. \nRemember to take time off and relax. Writing is stressful..especially if you are writing about what you learnt. Go for walks or destress completely and then get back to work.\nHope you make progress with your thesis OP. All the best. Let us know if you need any further help.",
      "author": "a220599",
      "created": 1587118278,
      "upvotes": 9,
      "replies": {
        "fnpxllk": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpxllk/",
          "text": "Man that’s actually a great point. I was always trying to make this thing perfect when it really doesn’t have to be. I’ll just get what is good enough and call it a draft to turn in. At this point everything else is written besides some management implications and one point about a small section of results I was having trouble interpreting",
          "author": "twitterdotcom",
          "created": 1587153842,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fno2gfl": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno2gfl/",
      "text": "A writing coach once told me: You can never write the same text twice. The text you wrote yesterday is basically the text of another person. Learn to exept that no text is perfect but captures a special moment in time. At least for me, that advice helped to get some distance. And now I try not to worry to much about writing something stupid or missing something. Because that's future me's job to figure out.",
      "author": "EcstaticEmphasis",
      "created": 1587109630,
      "upvotes": 8,
      "replies": {}
    },
    "fnob0qi": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnob0qi/",
      "text": "Get a hobby that requires both creative and problem solving mental faculties. For me it's woodworking. When I'm really struggling with a research project and imposter syndrome creeps in, I stop and go build a piece of furniture or something. It forces me to flex similar mental muscles but on a much shorter time horizon, so I remember what it feels like to actually finish a project. Having a tangible accomplishment helps me snap out of it for the time being until the next time around.",
      "author": "bs6",
      "created": 1587118844,
      "upvotes": 8,
      "replies": {}
    },
    "fno4x49": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno4x49/",
      "text": "Another thing you can try is just verbalising instead of writing. For example, you could choose a supportive friend or partner, get them some delicious food, get your voice recording app ready to go, and just start explaining your findings/intro/whatever you are working on to them while they eat. It’s not so horrible for them as they have something tasty to eat (provided by you), and somehow it works because you have an audience. Academic writing can sometimes be blocked because it can feel too removed from an audience/communicative purpose when you are slaving in isolation. Then later on just start typing up what you said, adding a bit of academic “voice”, and you’ve got a re-entry to writing.",
      "author": "PaddlingDuck108",
      "created": 1587112208,
      "upvotes": 7,
      "replies": {
        "fnohf3d": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnohf3d/",
          "text": "I read somewhere that the region in brain responsible for formulating thoughts for spoken versus written narrative is different. And i noticed this on myself. I could be brilliant in explaining my ideas to a colleague but get immediately stuck when i get to put them on paper. One solution is to record yourself and just write it down!",
          "author": "doireallyhaveto2",
          "created": 1587125125,
          "upvotes": 6,
          "replies": {
            "fnprxwk": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnprxwk/",
              "text": "Word have option to write voice dictation to, so you dont need to listen your voice record.",
              "author": "goranstoja",
              "created": 1587150895,
              "upvotes": 2,
              "replies": {
                "fnr2gi2": {
                  "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnr2gi2/",
                  "text": "I know! Getting round to use it!",
                  "author": "doireallyhaveto2",
                  "created": 1587177695,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fno7huh": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno7huh/",
          "text": "I wish I could up this more than once, as it's really good advice. And it involves food, so there's that.",
          "author": "veberi",
          "created": 1587114988,
          "upvotes": 3,
          "replies": {}
        },
        "fnobm7v": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnobm7v/",
          "text": "Ah, inverse rubber-ducking!",
          "author": "fuckwatergivemewine",
          "created": 1587119487,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fnogdsm": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnogdsm/",
      "text": "For writer’s block, I do variations on the pomodoro method. Also, sometimes I change up my mental audience. Am I writing for me? For my colleagues? For the profession? Sworn enemies? And if it’s not working, I try instead to keep the cobwebs out by working on something else.\n\nFor imposter syndrome, I embrace it and two things have worked. I either lean into it and figure out why I’m worried people will think I’m a fake and work on or exploit those areas where possible, OR I just remind myself that imposter syndrome is a waste of time, and to paraphrase, I reclaim that time. I’m not a fake—I have the degrees, I was hired, I’ve been published. Once, I read about an academic who created an alternate personality who was the blandest, most overconfident version of an academic, and she displaced all her anxieties on to him. “Bob wouldn’t worry about that.”",
      "author": "plentypk",
      "created": 1587124208,
      "upvotes": 6,
      "replies": {}
    },
    "fnotmi3": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnotmi3/",
      "text": "You have to get over the the expectation for perfection. I've learned that your good enough maybe just right. So instead of being bonked down with the big picture. Think of small good enoughs, then expand on them. Keep building layer by layer, facet by facet. Remember that even the most spectacular and beautiful creations we're built one brick at a time, and not all bricks were perfect.",
      "author": "lnln8",
      "created": 1587133359,
      "upvotes": 6,
      "replies": {}
    },
    "fnom8as": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnom8as/",
      "text": "I always tell my students to write shitty rough drafts. You can curse, be silly, mock the material, etc. The writing process becomes easier if you stop taking it and yourself as seriously.",
      "author": "nerdhappyjq",
      "created": 1587128812,
      "upvotes": 4,
      "replies": {}
    },
    "fno8e6a": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno8e6a/",
      "text": "Alternate between caffeine and alcohol and set a goal for the day.",
      "author": "pastaandpizza",
      "created": 1587115981,
      "upvotes": 4,
      "replies": {}
    },
    "fnonbsl": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnonbsl/",
      "text": "When you are writing, writing it's easy.\n\nJust start with the smooth and trivial parts. Write about the technical part that everyone knows, but that must be part of any thesis in your area. Write about that part of your work that is straight forward. Just start writing, you don't need to write something substantial or perfect, that will happen once you edit the text.",
      "author": "Cacti_supreme",
      "created": 1587129551,
      "upvotes": 5,
      "replies": {}
    },
    "fno8wex": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fno8wex/",
      "text": "I had a lot of trouble starting my thesis and it took me almost 2 months to really get into it. What didn’t help was that I decided to write my hardest chapter or “chapter full of failures” first thinking that if I could do the hard one then the other ones should be easier. Anyways, what I gotta ended up doing was listing all the experiments I had done and compiled their results and just wrote what I saw before diving deep. Then I just made a story out of what I had. I did this for 6 chapters and I ended up finishing my draft in 2 months :)",
      "author": "Raelynndra",
      "created": 1587116542,
      "upvotes": 3,
      "replies": {}
    },
    "fnp3114": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnp3114/",
      "text": "Read the book *Advice for New Faculty Members* by Robert Boice, immediately. It doesn't matter if you're not faculty. He is a psychologist who mainly studies writers block among academics and has been helping people for many years. Cannot recommend this book strongly enough.",
      "author": "dowcet",
      "created": 1587138347,
      "upvotes": 2,
      "replies": {
        "fnpw59p": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpw59p/",
          "text": "I’ll have to check this out. Thank you",
          "author": "twitterdotcom",
          "created": 1587153090,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fnq3dxz": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnq3dxz/",
      "text": "Maybe not super helpful, because y just do it. Just start writing. I like to do voice to text, but typing works too. Just get ideas out and dont worry if they make sense at first or if they flow or if the spelling is write. Then come back.\n\nSecondly, talk to someone about the topic. A mentor, another grad student with relevant background, etc. Talking out an idea can be very helpful.",
      "author": "Pop_pop_pop",
      "created": 1587156916,
      "upvotes": 2,
      "replies": {}
    },
    "fodpp46": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fodpp46/",
      "text": "I don't really have a grand suggestion, but I wanted to thank the comments in here. I manage to write, but refuse to show it to anyone because it's trash and because imposter syndrome makes it impossible to feel confident in my analysis and conclusions. \n\nThe one thing which helps me is to take a break and talk about research with other smart people. By talking and bouncing ideas off of them and by having them willing to entertain your thoughts you can get feedback and inspiration to further develop your ideas.",
      "author": "foxfact",
      "created": 1587687769,
      "upvotes": 2,
      "replies": {}
    },
    "fnpk05f": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpk05f/",
      "text": "Writer's block --> take a break, do something else.\n\nWhen I find myself doing this in my office I usually pack up and head home. By the time I get to my front door sometimes I've figured out and made sense of whatever I'm trying to make sense of in my head. There is no sense in trying to squeeze words out of a head when they aren't coming.",
      "author": null,
      "created": 1587146841,
      "upvotes": 1,
      "replies": {
        "fnpw96g": {
          "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpw96g/",
          "text": "Yeah I have a hard time doing that because I’m stubborn and want to get it done but I did it last night and that exact thing happened to me",
          "author": "twitterdotcom",
          "created": 1587153147,
          "upvotes": 1,
          "replies": {
            "fnpwu6a": {
              "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fnpwu6a/",
              "text": "You're not alone in that. I still struggle with that.",
              "author": null,
              "created": 1587153447,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fodgkv3": {
      "link": "/r/AskAcademia/comments/g2w6rg/how_do_you_guys_deal_with_imposter_syndrome_and/fodgkv3/",
      "text": "If you stop writing for more than a few minutes, attempt to stop in the middle of a sentence. Even if you know the end. Your mind will keep working on it and when you sit down to continue it will be easier to begin with a thought that is already in motion.",
      "author": null,
      "created": 1587684421,
      "upvotes": 1,
      "replies": {}
    }
  }
}