{
  "sid": "opk9k0",
  "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/",
  "title:": "Other very average postdocs out there, how do you feel?",
  "text": "I see myself as a very average STEM postdoc in terms of research output. For publications, I’d say ~50% of other postdocs I come across have “better” records, and ~50% have “worse” ones. The publication record from my PhD is equally average (first-author papers in good but not top tier journals, not very well cited).\n\nFor the others in the same boat, how are you feeling? Do you feel that you’ll still have a chance at a faculty position? Do you feel that you’ll have to aim for departments that focus more on teaching than research? Do you think about going into industry?\n\nFor those who are no longer postdocs, what did you end up doing?",
  "author": "Hhas1proton",
  "created": 1626979549,
  "updated": 1634081775,
  "over_18": false,
  "upvotes": 118,
  "upvote_ratio": 0.98,
  "comments": {
    "h66ojnb": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66ojnb/",
      "text": "I had an above average PhD and maybe just below average post doc.\n\nI left academia for industry. I work 35-40 hours a week at a fun job that's very easy and I doubled my salary. Decent trajectory within my company and many opportunities outside of it. It's amazing how quickly I went from \"I wanna be a professor\" to \"nah fuck that.\"",
      "author": "SoupaSoka",
      "created": 1626995360,
      "upvotes": 133,
      "replies": {
        "h66wkk7": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66wkk7/",
          "text": "What is your job???",
          "author": "scienceislice",
          "created": 1626999743,
          "upvotes": 15,
          "replies": {
            "h66y34n": {
              "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66y34n/",
              "text": "Fermentation scientist. Basically I create fermentation processes to produce target chemicals/proteins/enzymes for my company.",
              "author": "SoupaSoka",
              "created": 1627000528,
              "upvotes": 50,
              "replies": {
                "h672ck1": {
                  "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h672ck1/",
                  "text": "That's very cool.\n\nI was wondering about how a job could be both fun and easy. To me, a \"fun\" job is one that is not too easy but also not too hard. It's right in that sweet spot of \"this is hard enough that it doesn't feel trivial but easy enough that I can actually do it\".",
                  "author": "ezluckyfreeeeee",
                  "created": 1627002733,
                  "upvotes": 11,
                  "replies": {
                    "h6741b6": {
                      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h6741b6/",
                      "text": "For me, the sweet spot is that it's mentally stimulating, but the workload is low enough that I don't have to rush through finding solutions for the specific problems I face. So, it's a challenge, but expectations are maintained at a reasonable level.\n\nThat's my definition of fun and easy.",
                      "author": "SoupaSoka",
                      "created": 1627003605,
                      "upvotes": 47,
                      "replies": {
                        "h68l9hd": {
                          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68l9hd/",
                          "text": "This sounds so ideal to me. I never imagined leaving academia but now that I’ve had a kid and suddenly hate my job, I really want out and don’t know how to find these magical industry jobs.",
                          "author": "Froggy101_Scranton",
                          "created": 1627040913,
                          "upvotes": 4,
                          "replies": {
                            "h68qjxn": {
                              "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68qjxn/",
                              "text": "My partner and I had our first kid in May. I left academia a few months beforehand and a part of the motivator was our baby. It was a wonderful choice in our case.",
                              "author": "SoupaSoka",
                              "created": 1627044227,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "h68kgcx": {
                      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68kgcx/",
                      "text": "As an old supervisor said \"It's enough to keep you awake at work, and not enough to keep you awake at night.\"",
                      "author": "TheBrickWithEyes",
                      "created": 1627040356,
                      "upvotes": 9,
                      "replies": {
                        "h68lbxv": {
                          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68lbxv/",
                          "text": "I was up at 3am last night stressing about work for an hour, so this is really hitting home. I’m so done mentally.",
                          "author": "Froggy101_Scranton",
                          "created": 1627040958,
                          "upvotes": 3,
                          "replies": {
                            "h68lszc": {
                              "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68lszc/",
                              "text": "I had a previous job examining trade marks. It was fairly repetitive process based work, but you researched a lot of topics, it engaged your brain enough, and you couldn't do it at home, so you left your work at work. Paid very well and the conditions were amazing.\n\nNot a job if you want job satisfaction or you see your job as your identity, but if you have a life/hobbies/interests outside of work, it's perfect.",
                              "author": "TheBrickWithEyes",
                              "created": 1627041275,
                              "upvotes": 2,
                              "replies": {
                                "h68m0he": {
                                  "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68m0he/",
                                  "text": "I absolutely do not see my job as my identity anymore. I LOVED being a neuroscientist until all of a sudden, I didn’t. Now I loathe my job and just want to be home with my kid, but life as a family on a single postdoc salary isn’t possible so I’m just trudging away at something I hate. I’d love to transition to something I can leave at work",
                                  "author": "Froggy101_Scranton",
                                  "created": 1627041414,
                                  "upvotes": 4,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h67mokn": {
                  "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h67mokn/",
                  "text": "That sounds interesting! I'm looking for challenging but relaxed labs that don't require any benchwork lol",
                  "author": "scienceislice",
                  "created": 1627013372,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h6736n8": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h6736n8/",
      "text": "The answer is to look at who is getting jobs in your field. In some fields, its entirely bean counting, in which case, no, you have no chance. In many fields however, its all down to the random lottery of \"fit\", where your chances are determined by what you put in your application and networking, and publication records are largely irrelevant. In the first case, you absolutely need to look at industry or teaching-heavy positions if that's what you like and you have some teaching credentials.  In the second case, you can absolutely get a faculty job but you need to scout out each job posting and find out what the secret \"fit\" sauce is, plus network aggressively.",
      "author": "such_science_wow",
      "created": 1627003166,
      "upvotes": 20,
      "replies": {
        "h683lin": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h683lin/",
          "text": "OP just do not forget the probabilities are very low in both cases.",
          "author": "CaptainCornerCamper",
          "created": 1627025870,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "h66lldr": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66lldr/",
      "text": "It depends on what how you define as top-tier journal. \n\nI gradually lost faith in obtaining a faculty position as I realized that the most recent hires at my research institute (R1 at the US east coast) all published at least 3 impact factor IF> 16 papers (we're talking about science, nature, cell, cancer cell, cell metabolism). Most of them spend at least 8+ years to get to that level of strong publications with their average age when applying for a faculty position \\~40. \n\nRecently had my first postdoc paper accepted at a decent journal that recently got bumped up to IF>10. By the time I was done with the revision, i was already feeling a bit burnt out. \n\nCurrently contemplating if i should accept a staff scientist position at a new place or bit the bullet and continue on my postdoc experience. I still have 3 years remaining in my postdoc clock that I can either continue or just move on to a new lab.",
      "author": "overzealous_labgnome",
      "created": 1626993920,
      "upvotes": 41,
      "replies": {
        "h69v6u1": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h69v6u1/",
          "text": ">Recently had my first postdoc paper accepted at a decent journal that recently got bumped up to IF>10. By the time I was done with the revision, i was already feeling a bit burnt out.\n\nAre we twins?! That's me right now. I just got my first decent first-author postdoc paper published after working so hard on finalizing the manuscript and revisions and I'm just so burnt out while everyone around me seems to be working away so effortlessly.",
          "author": "Hhas1proton",
          "created": 1627062523,
          "upvotes": 2,
          "replies": {
            "h69zaim": {
              "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h69zaim/",
              "text": "Congrats on the paper acceptance!!\n\nYeah, I was also working hard around the clock to get the revision experiments done as much as possible. Sometimes it really depends on the type of work that was necessary. Some parts of my revision was highly technical in nature and I ended up finding 2 different collaborators (separate groups) to work on it concurrently. One ended up enticing me to dump in more and more money into the project while another had a out-of-the-box idea that addressed all of my reviewer's concerns. Before that, I was under the constant fear of what-if i have to rewrite my entire conclusions which means more experiments etc. But was glad that it was done.\n\nOne of my co-worker who submitted his paper before mine is still in the revision limbo when he got a cranky reviewer 3 who requested for additional revision. But his work is mostly cell-culture based so he can plan out his experiments more efficiently while i kept praying that my mice like their partners enough to mate and generate enough cohorts for the revision. So it's all relative at times.",
              "author": "overzealous_labgnome",
              "created": 1627064330,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h66vfic": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66vfic/",
      "text": "What do *you* want to do?\n\nHave you submitted fellowship applications? If not find opportunities and apply. \n\nIf you want to get in at a research-focused R1 in the top 50 or so you will have to put together a research proposal for the application that the committee would consider fundable by whatever grant mechanisms it could be sent to. Most search committee members don't make it past the CV and only read the rest of the apps once shortlisted which means top 10-20%.\n\nSo getting a job is one thing, then you'll be expected to get funding and with a weaker CV and 5-10% success rates be prepared for rejections based on reviewers biases. It is a terrible system but a lot of early career funding is heavily CV weighted so making the right moves early, and often, are the only way to make and keep an academic R1 stem career.",
      "author": "Boogers_my_dad",
      "created": 1626999152,
      "upvotes": 14,
      "replies": {
        "h67b85y": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h67b85y/",
          "text": "Well, I applied and got a postdoctoral fellowship to fund my first 2 years of postdoc project (ended last year during the pandemic). I was proud that it was recently accepted for publication after a grueling revision process before the availability of vaccination. Decided to cut my losses when we were forced to kill off a lot of our mouse colony that I decided to publish whatever I have in hand first and see how it goes afterwards. \n\nI'm actually an international postdoc and is limited in my options for a lot of the national fellowships. Was finding hard for postdoc fellowships that did not have a citizenship requirement when I applied to several and got one. Now at year 3 of my postdoc and am at that cross road of either continue on fighting or cut my losses. \n\nInitially thought of moving to do a second postdoc to learn new things and build new networks but was lured in by the  staff scientist position in an academic that offers a better visa status for a green card application. I talked to my PI about this and they confirmed to me that it might be problematic if i switch from a postdoc (trainee) to a staff-based position since there's still a lot of people out there who somehow stigmatize people who didnt suffer the full 5 year postdoc stint.\n\nI like to do research and academic lab do offer me the flexibility of exploring crazy ideas without needing to worry about grant applications. Most of my peers also agree that getting a green card opens up an even large possibility for career placements.",
          "author": "overzealous_labgnome",
          "created": 1627007172,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h66ym1g": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66ym1g/",
      "text": "While my PhD experience was above average with an amazing supervisor and I felt that things were relatively easy, I've always been an average student. I was an average PhD student and the publications I had were submitted to journals with an impact factor of 1.1-1.6 and my work wasn't cited much at all. I ended up doing a post-doc that is related to my PhD field, but I had no experience in. Currently my post-doc has been an amazing learning experience (I taught myself how to code on the job), but I still have no idea what I'm doing (I've been here 8-9 months), though I am working on a 2nd publication. In Canada, postdocs are paid pretty poorly so I've shopped around and will be moving into into industry next month at a job in the US that pays almost triple my salary.",
      "author": "muaythaiboxer",
      "created": 1627000799,
      "upvotes": 11,
      "replies": {
        "h68lg74": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68lg74/",
          "text": "How did you find your industry job?",
          "author": "Froggy101_Scranton",
          "created": 1627041035,
          "upvotes": 1,
          "replies": {
            "h69pcik": {
              "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h69pcik/",
              "text": "I used linkedin and indeed to find jobs, then went to the company website to apply.",
              "author": "muaythaiboxer",
              "created": 1627060013,
              "upvotes": 2,
              "replies": {}
            },
            "h68p8vj": {
              "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68p8vj/",
              "text": "craigslist",
              "author": "cyberonic",
              "created": 1627043453,
              "upvotes": -2,
              "replies": {}
            }
          }
        }
      }
    },
    "h67pndw": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h67pndw/",
      "text": "Not all skills are in the lab. Personality and good humor and diplomacy and writing are all \"intangibles\" that will help you get to the next level.\n\nSource: Anxious postdoc who is starting R1 Asst. Prof in two months.",
      "author": "atchemey",
      "created": 1627015224,
      "upvotes": 9,
      "replies": {}
    },
    "h679557": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h679557/",
      "text": "I do okay. I would even consider myself above average. Postdoc has been slow going but a lot of papers about to pay off/be submitted, and I'm in a few decent proposals. I also serve in a local imate government climate assessment for a very large city, and an equivalent assessment for the UN, but have no Big journal publications. So while productive, I know there's a lot of folks who publish/do more. It's still incredibly discouraging going into the faculty/research scientist market, as departments and universities have the benefit of being extremely picky (or not hire anyone at all!). \n\nI am probably quitting my faculty search after this year. Had two campus visits so my best one yet. One of them was a top R1, and the position was an excellent fit for me, and I absolutely nailed the interview. Faculty voted to extend me offer (which the chair told me), only for the dean to block it in the end after a very long wait. No idea why. Maybe they wanted the money to build a new pool, maybe they wanted someone from an \"elite\" institution. In any case, this completely destroyed my confidence that I could get any position in academia that wasn't temporary/precarious. My second campus visit they sent me an automated system rejection. Just demoralizing after you spend a whole day with these people and prepare for a job talk and all that. \n\nI applied to most positions that had even a bit of an overlap with my work that were in a place I wouldn't hate living in. My research is incredibly interdisciplinary so I could apply to engineering, atmospheric, climate, or even  geography departments. Since I wasn't interested in a \"mostly teaching\" position, I didn't apply to those. I also suspect I wouldn't have done as well, since I didn't have as much teaching experience.",
      "author": "Prukutu",
      "created": 1627006157,
      "upvotes": 6,
      "replies": {}
    },
    "h66n96s": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66n96s/",
      "text": "[deleted]",
      "author": null,
      "created": 1626994725,
      "upvotes": 15,
      "replies": {
        "h66tpjv": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66tpjv/",
          "text": "Wut? These people must've had amazing contacts, 2 papers/10 citations won't even be considered in a lot of STEM positions..! I've seen people with named postdoc fellowships with papers in Nature/Science and h-indices of 10+ get rejected from so many positions..",
          "author": "dovaahkiin_snowwhite",
          "created": 1626998250,
          "upvotes": 13,
          "replies": {
            "h672j71": {
              "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h672j71/",
              "text": "There could be that weird situation where you have someone with a really bad phd publication but ended up publishing big for postdoc. It could be that the postdoc paper might not get citations easily if it's just recently published and the person's immediately plunged into the faculty hunger games. \n\nBut alas, connections apparently make the world go round.",
              "author": "overzealous_labgnome",
              "created": 1627002830,
              "upvotes": 8,
              "replies": {}
            },
            "h672nfg": {
              "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h672nfg/",
              "text": "[deleted]",
              "author": null,
              "created": 1627002892,
              "upvotes": 2,
              "replies": {
                "h673ax6": {
                  "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h673ax6/",
                  "text": "Which field?",
                  "author": "arjunkc",
                  "created": 1627003226,
                  "upvotes": 6,
                  "replies": {}
                },
                "h673ecu": {
                  "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h673ecu/",
                  "text": "Freak cases I suppose. My department has been interviewing people for 3+ years and never hired anyone because they \"weren't good enough/a good fit\". All people interviewed had 10s of papers, cool research, hundreds of citations, multiple fellowships. \n\nAlso, marathi? (from the username xD)",
                  "author": "dovaahkiin_snowwhite",
                  "created": 1627003277,
                  "upvotes": 3,
                  "replies": {
                    "h67dbs7": {
                      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h67dbs7/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1627008201,
                      "upvotes": 2,
                      "replies": {
                        "h67eg1u": {
                          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h67eg1u/",
                          "text": "To be honest I'm glad to be in a field where it is pretty obvious if you'll make it in academia or not fairly early on. Switching to industry right after PhD sounds a lot less painful than dealing with the ambiguity of academia 4 years down the line.",
                          "author": "dovaahkiin_snowwhite",
                          "created": 1627008770,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "h684g8e": {
                  "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h684g8e/",
                  "text": "I've also seen people with almost non-existent publication records getting good jobs. In the few cases I have seen, it has been due to connections primarily.",
                  "author": "CaptainCornerCamper",
                  "created": 1627026639,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "h66yarv": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66yarv/",
          "text": "What is a research investigator?",
          "author": "hates_drama",
          "created": 1627000639,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h66rsam": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h66rsam/",
      "text": "I just have to say don’t count yourself out. I wouldn’t have imagined I’m in the position I’m in today (On job market, but very hopeful)",
      "author": "Cupcakequeen789",
      "created": 1626997040,
      "upvotes": 3,
      "replies": {}
    },
    "h68gwxm": {
      "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68gwxm/",
      "text": "Just out of curiosity - what do you consider average? What’s the average number of papers PhD students come out with? (Whether it’s first/ second/ third/ etc author)",
      "author": "green-tea-11",
      "created": 1627037743,
      "upvotes": 3,
      "replies": {
        "h68hght": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h68hght/",
          "text": "Curious too for social science +1",
          "author": "givemeyourdonut",
          "created": 1627038165,
          "upvotes": 2,
          "replies": {}
        },
        "h69uoub": {
          "link": "/r/AskAcademia/comments/opk9k0/other_very_average_postdocs_out_there_how_do_you/h69uoub/",
          "text": "I can't answer for social sciences, but for the life sciences at a top 20 university in North America (where PhDs are 5+ years), I think an average PhD student would have \\~2–4 co-author papers and \\~2–4 first-author papers in subject journals (IF \\~ 3), and maybe one of those papers is a higher ranked one, but not top tier (IF \\~ 10–17). Maybe a few standard government scholarships/fellowships, but no awards or recognition for their papers, and no invited talks or reviewing for journals.\n\nI could be wrong about the numbers, since there's visibility bias, where people who have higher outputs are more visible, and people who have lower are less visible. However, this profile was exceedingly common in the department I did my PhD, including myself.\n\nAs a postdoc, I've just gotten my first-author IF \\~ 10–17 paper out after a couple of years of work, and man am I burnt out while people around me are endlessly producing...\n\n&#x200B;\n\nEdit: Take these numbers with a grain of salt. My field is biophysics, so average will look different in different fields",
          "author": "Hhas1proton",
          "created": 1627062306,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}