{
  "sid": "m5w9k8",
  "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/",
  "title:": "Work-Life Balance for tenured R1 professors?",
  "text": "I'm about to start as an Assistant Professor position in a (very) small STEM department of a well-ranked R1 university and already gave up the idea of work-life balance during the tenure track. However, what's the situation like with tenure? Some people say it gets worse since you're not \"protected\" anymore, others say it gets better since you can more freely say no. Does it get any better? Is there such a thing as work-life balance with tenure and could you significantly reduce your hours, say, when you start a family?",
  "author": "itsmi",
  "created": 1615854166,
  "updated": 1634081875,
  "over_18": false,
  "upvotes": 110,
  "upvote_ratio": 0.99,
  "comments": {
    "gr2kzd4": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2kzd4/",
      "text": "I am on the tenure track so take this for what it's worth, but I have stopped believing in the \"just this one more step z and then finally things will be good\" mentality. Things will always be busy, there will always be stressors, and when the things that made tenure track difficult disappear new challenges will magically present themselves. This is how it was when I graduated from PhD, then transitioned out of my postdoc into a research faculty position, and finally when I got in the tenure track. \n\nTherefore, I think you need to find work life balance now, since if you don't, you'll be burnt out by the time you are tenured. I have two young children that take a considerable amount of time which admittedly results in a lot of stress, but I still take time to go running, do other sports, hang out with my spouse in the evening, etc. because I think I have to if I want to make it work. Also, this is the message I want to send to my mentees who have an even longer way to go making sustainability so much more important.",
      "author": "defntly_not_mathias",
      "created": 1615854949,
      "upvotes": 268,
      "replies": {
        "gr33bdu": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr33bdu/",
          "text": "I could not agree with this more. I love what I do, but that feeling you described never gets better; you have to find balance early on to make sure that it does not end up consuming you. The more you give academia, the more it takes.",
          "author": "KarateMaster99",
          "created": 1615864797,
          "upvotes": 53,
          "replies": {
            "gr3mzz2": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3mzz2/",
              "text": "Your last sentence is so terrifying",
              "author": "anxiety_on_steroids",
              "created": 1615880440,
              "upvotes": 18,
              "replies": {
                "gr4bfob": {
                  "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4bfob/",
                  "text": "It's terrifying but also wrong. Don't confused one person's inability to deal with their career in a healthy manner with some sort of general rule about academia.\n\nEdit: I wasn't clear enough. To clarify: I think u/KarateMaster99's first couple of sentences are healthy and correct. I'm objecting to the line \"The more you give academia, the more it takes.\" My point is that people who think \"the more you give academia, the more it takes\" do not have a healthy relationship with their career.",
                  "author": "Aubenabee",
                  "created": 1615901041,
                  "upvotes": -8,
                  "replies": {
                    "gr4gs08": {
                      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4gs08/",
                      "text": "I don't think it's wrong at all. Admin is pushing more and more work onto faculty, and if you show people that you're willing to take on that work, then you're going to continue to get more work. It'll be difficult backing away from that. So, the more you give, the more it takes. \n\nAlso, this is highly dependent on a number of other factors. I think women, for example, end up giving quite a bit more and having more taken as a result. A lot of this labor, including emotional labor for students, falls on women faculty disproportionately.",
                      "author": "KaesekopfNW",
                      "created": 1615903759,
                      "upvotes": 6,
                      "replies": {
                        "gr4n2ox": {
                          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4n2ox/",
                          "text": "I hear you, but you're taking agency out of the equation entirely. Learning to say \"no\" is an incredibly important skill.\n\nI probably say \"no\" to 19 out of 20 requests for my time that aren't germane to my primary focus (my lab and my research). Do they like that? No. Do they push back? Sure, but they lose. But I don't care. Guarding my time for my lab and (more importantly) my family is important enough to me that I don't care whether the Vice Provost of Asshattery likes me or not.\n\nAnd -- earnest question -- what do you mean with respect to emotional labor for students falling disproportionately on women faculty?",
                          "author": "Aubenabee",
                          "created": 1615906721,
                          "upvotes": 1,
                          "replies": {
                            "gr4x3cw": {
                              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4x3cw/",
                              "text": "That's very much the privilege of tenure, though. You, being tenured, absolutely have the luxury of saying no 19 out of 20 times. An Assistant Professor does not, and will probably say yes to most things out of obligation in the pursuit of tenure. Maybe some people can dial that back after they get tenure, but if you made it clear the last six years that you're willing to take on projects, those requests don't go away.\n\nAnd as to your last question, a lot of this can be dependent on the field. Given the topics that the social sciences and humanities may deal with, many students might end up relying on their professors to discuss stresses and trauma. My partner, for example, teaches in criminal justice and deals with gender-based violence. She gets numerous disclosures from students each semester and engages in a lot of emotional labor to help those students get the resources they need and process their trauma. I, as a man in political science, receive none of this, so I don't have to do much emotional labor for my students.\n\nHowever, I think in any field, a student is more likely to confide in a female faculty member on any topic. A chemistry student who is dealing with extraneous stress in their life may feel comfortable revealing this to a female chemistry professor, assuming that they will receive more compassion and understanding from her. If you have female colleagues, I guarantee they deal with this kind of stuff far more often than you do (if you're male). It's the same for me. I'm sure my students are more likely to drop these kinds of emotional labor tasks on my female colleagues than they are with me. All of this adds up to an immense amount of labor that many male faculty don't have to deal with.",
                              "author": "KaesekopfNW",
                              "created": 1615911241,
                              "upvotes": 3,
                              "replies": {
                                "gr57yu2": {
                                  "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr57yu2/",
                                  "text": "I hear you, but I don't think it's the privilege of tenure nearly as much as its the privilege of success or value to the university. I've said \"no\" 19/20 times since I got tenure, and I probably said \"no\" 19.5/20 times pre-tenure. I've actually loosened up *since* getting tenure! Since the very beginning, they've understood that I'm there to run my lab and do research and that I'll keep publishing/bringing in grant money as long as they don't weigh me down with other stuff. If I ever the sense that I'm getting too close to the sun with the \"no's\", I'll agree to the smallest job I can find and do that as best I can. I realize that my experience isn't representative, but I guess my point is that I wish EVERYONE would say \"no\" up to the point where they start getting serious pushback from the administration. If everyone said \"no\" more often, I honestly believe many of the commitees, etc. would dry up (something that's happened more than once in my career). \n\nAs to the rest of your point, I understand that gender is a major component, as is field. But I also feel like a lot depends on how open one is with your students. I'm a man, but I'm also try to be very accessible to and open with my students, so during the semester I have one student per week in my office unburdening themselves of their stress or trauma.",
                                  "author": "Aubenabee",
                                  "created": 1615916008,
                                  "upvotes": 1,
                                  "replies": {
                                    "gr5h59z": {
                                      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr5h59z/",
                                      "text": ">If everyone said \"no\" more often, I honestly believe many of the commitees, etc. would dry up (something that's happened more than once in my career).\n\nThat's probably true, but we run into a Prisoner's Dilemma situation with this. It may ultimately be better if everyone said no, but people are incentivized to say yes, because if you say no to this kind of work and everyone else says yes, now you stand out as not working nearly as much as others and jeopardize your tenure. So, of course you'll say yes. There's nowhere near the level of communication and organization for every person at a university or even in one department to all collectively say no and tell the administration to fuck off. Unless, of course, you're unionized. That tends to help.\n\n&#x200B;\n\n>I'm a man, but I'm also try to be very accessible to and open with my students, so during the semester I have one student per week in my office unburdening themselves of their stress or trauma. \n\nI think this is also an important variable to consider, but I bet your openness nets you roughly the same number of students as a woman who isn't open. And that means that a woman who is just as open as you is going to get even more students doing these things, simply because she's a woman. There's also just more general pressure for women and people of color and other minorities to be open like this, because it's often socially expected. You or I not being very open wouldn't get us negative student evals, but a woman or person of color not being open might, and all that stuff can jeopardize tenure.",
                                      "author": "KaesekopfNW",
                                      "created": 1615920087,
                                      "upvotes": 1,
                                      "replies": {
                                        "gr8jdos": {
                                          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr8jdos/",
                                          "text": "Good points both!",
                                          "author": "Aubenabee",
                                          "created": 1615989222,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gr4de1u": {
                      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4de1u/",
                      "text": "What?? How in the world is having work life balance correlated with an inability to deal with their career in a _healthy_ manner??",
                      "author": "sk81k",
                      "created": 1615902078,
                      "upvotes": 4,
                      "replies": {
                        "gr4fo3a": {
                          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4fo3a/",
                          "text": "I mean the last sentence. It is wrong, and it is a product of a fallacious line of thought that there is something unique or special about academia that demands self-flagellation from the participants. Being a professor is just a job like any other. \n\nYou can give your career plenty without academia \"taking\" anything.",
                          "author": "Aubenabee",
                          "created": 1615903212,
                          "upvotes": -2,
                          "replies": {}
                        }
                      }
                    },
                    "gr4wb3o": {
                      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4wb3o/",
                      "text": "How is what I’m saying any different from what you’re doing, u/Aubenabee? You say you usually say no to 19 out of 20 things. If my last line wasn’t true, why not say yes to all 20? Because you would be burnt out and 20 wouldn’t be 20, it would be 50. So, what you’re saying is actually well-aligned with my point. And u/KaesekopfNW explains it perfectly well. What you say yes to and how often you do it teaches others about your boundaries. If you say yes to everything, you will always be the “go to” in people’s minds. So, recognition of the general principle I mentioned is actually very important for ensuring that you are able to have a healthy relationship with your career.",
                      "author": "KarateMaster99",
                      "created": 1615910887,
                      "upvotes": 2,
                      "replies": {
                        "gr56khu": {
                          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr56khu/",
                          "text": "I see your point. I guess I just interpreted what you said differently/wrongly. If you had written \"The more you give, the more academia *tries* to take\" I would have agreed wholeheartedly (though this is true of many jobs). \n\nIn my (misinterpreted) view, there was an inevitability to \"the more academia takes\" that I don't agree with. I can give everything I want to my research and my lab, and the University/academia can *try* to take more from me in other areas, but I'll say no every time. Do they love it? No. But are they going to do anything about it? Nope. I did it pre-tenure, and I've done it post-tenure.",
                          "author": "Aubenabee",
                          "created": 1615915393,
                          "upvotes": 2,
                          "replies": {
                            "gr58rsa": {
                              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr58rsa/",
                              "text": "Oh yeah, I agree with you there, u/Aubenabee. Just because it tries to take doesn’t mean we should let it. At some point you have to draw the line and create boundaries, as others have said.",
                              "author": "KarateMaster99",
                              "created": 1615916361,
                              "upvotes": 1,
                              "replies": {
                                "gr59enx": {
                                  "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr59enx/",
                                  "text": "I guess that's what I've been trying to say. I wish people would dispense with the feelings of obligation (which, incidentally, I think often stem from the fallacious notion that academia is somehow unique in its demands of self-sacrifice) and say \"no\" A LOT more. I wish everyone would go into assistant professor jobs and establish themselves as a default \"no\" (as I did). Everyone's research and teaching (regardless of the field) is more important than supporting the extraneous demands of bloated administrations.",
                                  "author": "Aubenabee",
                                  "created": 1615916637,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gr3dlu1": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3dlu1/",
          "text": "I mostly agree, but I also found that the first year or so of a post is the busiest, and while it never calms down completely I do a lot less 12hr days now than I did in the first 12-18 months",
          "author": "Solivaga",
          "created": 1615871731,
          "upvotes": 14,
          "replies": {
            "gr5r7b6": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr5r7b6/",
              "text": "That's often the case with any new job. After a couple of years certain things become muscle-memory, or demand less consideration, and in aggregate this can free-up a surprising amount of time.",
              "author": "jimmythemini",
              "created": 1615924637,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gr47ugp": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr47ugp/",
          "text": "This is the answer. Create boundaries for your life, and decide how much you want to give to this job. Either that's enough for you to have a career, make tenure, or it's not. Give all during the time you work, and give nothing outside these boundaries. That's what I did and it worked really well, but now with pandemic ect I struggle. But there will always be times when I will have to re-negotiate my boundaries between job and life, and I think this is a time when this takes place.\n\nEdited to say: I'm tenured at a R1, research heavy STEM department, single parent. I'm not a high flying Price decorated champion (...), but I'm not an unknown slouch either, I publish well. And I'm happy with that.",
          "author": "25limes",
          "created": 1615898987,
          "upvotes": 13,
          "replies": {}
        },
        "gr3pprv": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3pprv/",
          "text": "Great reply. \n\nNever sacrifice your work-life balance for long periods of time, and especially not on some fictional promise you make to yourself that it might be better in the future.",
          "author": "OrbitalPete",
          "created": 1615883244,
          "upvotes": 18,
          "replies": {
            "gr4d2l2": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4d2l2/",
              "text": "Good advice but that can mean not getting a job",
              "author": "GabhaNua",
              "created": 1615901918,
              "upvotes": 3,
              "replies": {
                "gr4eseg": {
                  "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4eseg/",
                  "text": "If you are willing to *change* your work-life balance for a job, then maybe that is a suitable work-life balance for you. If you want a different work-life balance, and a job is not able to grant you that, then surely it's not the right job? Work-life balance isn't a fixed and static thing.\n\nMy point is that sacrificing your work life balance on the promise of some neverland fantasy in the future is madness.",
                  "author": "OrbitalPete",
                  "created": 1615902779,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gr2r3td": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2r3td/",
      "text": "It’s better from an anxiety perspective but the work changes after tenure and promotion. Two years after getting tenure and promotion, I was made department chair. Once you get into that pseudo-administration role it’s a whole different beast. All of the responsibilities with almost no power and perpetually having someone in the department who is mad at you and sometimes everyone in the department is mad at you.",
      "author": "CAinCa",
      "created": 1615858178,
      "upvotes": 65,
      "replies": {
        "gr2wzcn": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2wzcn/",
          "text": "Can you elaborate on what is driving this? I have my own perspective, but I would like to hear yours.",
          "author": null,
          "created": 1615861298,
          "upvotes": 7,
          "replies": {
            "gr3dvdy": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3dvdy/",
              "text": "It’s pretty cynical but the true administrators (Provost, Dean, Associate Dean) hang you out as a buffer between them and the faculty. The department chair has to deliver the news about tuition hikes and budget cuts. Plus, at least our dean, made a rule that faculty couldn’t approach her directly, they had to go through the department chair.",
              "author": "CAinCa",
              "created": 1615871939,
              "upvotes": 20,
              "replies": {}
            },
            "gr4ighn": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4ighn/",
              "text": "It's the \"all responsibilities and no power\" part that drives it. You are answerable for everything the administration needs or wants from departments and you have no authority whatsoever to produce it. You need to speak up for your department and your colleagues in meetings but your administrative leadership is under no obligation to remember or take note of or act on what you have said. And chairs typically discover to their surprise (even if they were told this in advance) that many of their departmental colleagues now come to see them with grievances, worries, anxieties, complaints (about the administration, the institution, other departments, their colleagues in the department, you, etc.), some of which are painfully petty, cruel or even delusional, some of which are profound and important, and you have to carry all of the weight of those confidences. It's an incredibly stressful position--it's akin to be a joint in a complicated machine where your job is to absorb the shocks and friction created by parts moving on either side of you and whatever insulation you had when you begin in the role invariably wears down until it's metal grinding on metal by the end.",
              "author": "swarthmoreburke",
              "created": 1615904569,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gr2wsmo": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2wsmo/",
      "text": "Two things I've realized lately:  \n1) No matter how hard you work, there's always more work left.  \n2) The reward for hard work is more work.",
      "author": "tryatriassic",
      "created": 1615861195,
      "upvotes": 97,
      "replies": {
        "gr41lzr": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr41lzr/",
          "text": "Man, I wish this had occurred to me a lot earlier, instead of a decade post-tenure.",
          "author": "Ronnie_Pudding",
          "created": 1615894781,
          "upvotes": 5,
          "replies": {}
        },
        "gr47wu5": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr47wu5/",
          "text": "I have such a hard time accepting the first one. I'm in my PhD and it's just now shifting from \"I wonder how people come up with so many research ideas\" to \"there is an infinitude of things I want to try\"",
          "author": "Monsteriah",
          "created": 1615899028,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gr2nmkc": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2nmkc/",
      "text": "When I was promoted to associate professor my anxiety went down but my workload went _up_.  Significantly reducing hours would be challenging.  Expectations for research don’t change, and there are plenty of jobs that have to be done by tenured faculty.\n\nMy other associate-professor colleagues all report the same: get awarded tenure, maybe get a sabbatical, and then: welcome to your new workload.",
      "author": "nrnrnr",
      "created": 1615856363,
      "upvotes": 64,
      "replies": {}
    },
    "gr2vctt": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2vctt/",
      "text": "A good and truth piece of advice I one got is \"how you work during tenure track is what you'll be doing after tenure.\" Basically, it's unlikely that there will be a drastic drop in effort after tenure. So you should find a good balance now. After tenure you will definitely be asked to do more service and administrative stuff. Now, some people do drop off on the research after the get tenure. I don't mean completely, but they don't try as hard anymore on proposals and they have fewer students. So you can get more personal time back there. However, the tradeoff is it will be really hard to make full professor. If you want to make full, you basically need to keep your head down and keep going full steam even after tenure. But, if you're happy not going for full, then consider slowing down after tenure. It depends on what you want in your career.",
      "author": "Plasma4life",
      "created": 1615860416,
      "upvotes": 18,
      "replies": {
        "gr38gc8": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr38gc8/",
          "text": "> After tenure you will definitely be asked to do more service and administrative stuff.\n\n\"All the admins and senior faculty will look up and shout, 'save us!' And I'll whisper, 'no.'\"",
          "author": "respeckKnuckles",
          "created": 1615867993,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "gr2t3a8": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2t3a8/",
      "text": "Second to u/defntly_not_mathias. You need to figure out what downtime / self care you need to keep sane *now.* And then stick to it. The truth is, you don't want the stability of being tenured if you are stuck in a job that is going to give you insane stress and working hours for decades. That's just not sustainable.\n\nMy examples: I have a block on my schedule every morning 7:30 to 9am, which is when I run, drink coffee, and get ready for the day. I have a no laptop rule on Saturdays, and usually take a long hike with my partner and our dogs. Evenings are for cooking dinner with my partner and relaxing - sometimes with my laptop, but usually not. I refuse to get sucked into any conversation about how many hours I worked or how late I stayed up doing xxx thing. It's toxic. I'm vocal about leaving work early when I need a break with colleagues and students - I think it's really important to model healthy work/life balance for my students as well.\n\nFor context, I just got tenured last year in a research-heavy position at an institute within an R2 uni, so my research expectations and teaching load are R1-level (I'm half at the R2, half at the institute, so have half the teaching load of my R2 colleagues). My external letters all came from folks at R1s and all were positive. I did give up the idea of being the best or famous in my field a long time ago - mostly because I simply don't want to work that hard - but I'm consistently funded and publish multiple papers per year.",
      "author": "boilerlashes",
      "created": 1615859206,
      "upvotes": 58,
      "replies": {
        "gr3vgr5": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3vgr5/",
          "text": "This 🙌🏻 I am in a similar position but untenured. I actively avoid saying ‘busy’ when someone at work asks me how I am and have a pretty strict no weekend email policy. I think some people are surprised, but many appear to respect my boundaries.\n\nI’m doing well at work so far, so your post gives me hope that I can continue on this path.",
          "author": "E388",
          "created": 1615889324,
          "upvotes": 12,
          "replies": {
            "gr55ica": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr55ica/",
              "text": "Yeah I think the thing about academia is that YOU have to set your boundaries, no one else will set them for you. I’ve never had someone react badly when I said no to something, and I’m pretty direct about what I can do (eg, “I can take on this project but will have to give up xxx commitment to do so”, “I need xxx accommodation to make time for this”, “this is impossible for me right now but maybe check back in 6 months”)",
              "author": "boilerlashes",
              "created": 1615914926,
              "upvotes": 3,
              "replies": {
                "gr5afs6": {
                  "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr5afs6/",
                  "text": "*Reddit has a 36 minute delay to fetch comments, or you can manually create a reminder on Reminddit.*\n\n**boilerlashes** , kminder 6 months on [**16-Sep-2021 17:15Z**](https://www.reminddit.com/time?dt=2021-09-16 17:15:26&reminder_id=00fb6b6b8724499796128dccf2e88143&subreddit=AskAcademia)\n\n> [**AskAcademia/Worklife_balance_for_tenured_r1_professors**](/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr55ica/?context=3)\n\n>  Yeah I think the thing about academia is that YOU have to set your boundaries, no one else will...\n\n[**CLICK HERE**](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder%20from%20Link&message=your_message%0Akminder%202021-09-16T17%3A15%3A26%0A%0A%0A%0A---Server%20settings%20below.%20Do%20not%20change---%0A%0Apermalink%21%20%2Fr%2FAskAcademia%2Fcomments%2Fm5w9k8%2Fworklife_balance_for_tenured_r1_professors%2Fgr55ica%2F) to also be reminded. Thread has 1 reminder.\n\n^(OP can )[^(**Delete comment, Update remind time, and more here**)](https://www.reminddit.com/time?dt=2021-09-16 17:15:26&reminder_id=00fb6b6b8724499796128dccf2e88143&subreddit=AskAcademia)\n\n\n\n*****\n\n[**Reminddit**](https://www.reminddit.com) · [Create Reminder](https://reddit.com/message/compose/?to=remindditbot&subject=Reminder&message=your_message%0A%0Akminder%20time_or_time_from_now) · [Your Reminders](https://reddit.com/message/compose/?to=remindditbot&subject=List%20Of%20Reminders&message=listReminders%21)",
                  "author": "remindditbot",
                  "created": 1615917094,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gr33tso": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr33tso/",
      "text": "It gets better in a few ways. First, once you have tenure, the pressure eases. It doesn’t stop, but it is no longer existential. Second, the time scale changes because you no longer have an expiration date. You are free to think things through more deeply and make longer term plans. Third, you realize that you can stop pushing quite so hard. That doesn’t mean that you will suddenly have a life, but it does make it easier to take an evening off now and then.",
      "author": "bigrottentuna",
      "created": 1615865097,
      "upvotes": 9,
      "replies": {
        "gr38odp": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr38odp/",
          "text": "In your experience, how many drop back after tenure and decide not to go for full? I'm extremely happy with the heavy workload of research, but the administrative workload of full professorship just doesn't appeal to me.",
          "author": "respeckKnuckles",
          "created": 1615868143,
          "upvotes": 7,
          "replies": {
            "gr3cefg": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3cefg/",
              "text": "It varies a lot by university, so it is really hard to say in general. It’s definitely something that some people choose to do, but in many places it can lead to salary stagnation (okay, worse salary stagnation).\n\nNot all who reach Full take on a lot of admin work. Some just keep ducking it. You can get away with it if your research remains strong, especially if you also have weak people skills. But some of us don’t mind it. Among other things, it’s a way to achieve more than you can do on your own.",
              "author": "bigrottentuna",
              "created": 1615870795,
              "upvotes": 4,
              "replies": {
                "gr4xpqq": {
                  "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4xpqq/",
                  "text": "That actually seems preferable, even given the cap on salary. I'm hoping after tenure to pull back and do for-profit side projects. Increased time sitting in meetings arguing about policies the University VPs are going to override anyway just isn't an appealing way to spend the rest of my career.",
                  "author": "respeckKnuckles",
                  "created": 1615911518,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gr2r9fp": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2r9fp/",
      "text": "A former mentor basically stopped working a few years after making full professor. Doesn’t apply for funding, produce research, or train students. He teaches a few undergrad classes, writes review papers, and spends time with his grandkids.",
      "author": "zinfandelightful",
      "created": 1615858261,
      "upvotes": 31,
      "replies": {
        "gr385rv": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr385rv/",
          "text": "dude beat the game. And the game has no replay value for him.",
          "author": "respeckKnuckles",
          "created": 1615867802,
          "upvotes": 11,
          "replies": {}
        },
        "gr2s9rj": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2s9rj/",
          "text": "That is definitely not the norm, especially at R1s.",
          "author": "coldgator",
          "created": 1615858783,
          "upvotes": 26,
          "replies": {
            "gr342js": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr342js/",
              "text": "I feel almost every department has one professor like that. My previous department (STEM in midwestern state flagship R1) had one professor in his late 50s who did relatively little work. He showed up in the department once or twice a week (whenever not traveling), didn't have any graduate students, didn't have any teaching load while I was there (unsure how that happened...), attended very few faculty meetings, etc.\n\nNow, he does write a solo author paper every 2 or so years and has a co-authored paper every year so clearly he's still doing research.",
              "author": "newpua_bie",
              "created": 1615865245,
              "upvotes": 15,
              "replies": {}
            },
            "gr2tsdx": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2tsdx/",
              "text": "Sorry, I did not mean to imply that it was normal. Just one fringe case.",
              "author": "zinfandelightful",
              "created": 1615859574,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "gr2syqo": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2syqo/",
          "text": "I’m doing that pretenure at a balanced school. Oh and with my kid. I don’t have grandkids.",
          "author": "ThatProfessor3301",
          "created": 1615859142,
          "upvotes": 6,
          "replies": {}
        },
        "gr3mgys": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3mgys/",
          "text": "I've seen this as well. Other faculty talk sh\\*t about them, but other than that there's nothing they can do if you have tenure. In my department, we had a faculty member who did no research, but he was a great teacher. He retired in his mid-50s because there are other things he wants to do in life.",
          "author": "drpicoloco",
          "created": 1615879903,
          "upvotes": 6,
          "replies": {}
        },
        "gr4kdc7": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4kdc7/",
          "text": "Good on them!",
          "author": "kalamano",
          "created": 1615905470,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gr2vwgg": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr2vwgg/",
      "text": "I reject the premise that you can’t have work-life balance before tenure. My situation may not be representative, but I haven’t worked more than 9-5 five days a week since my second year of grad school. There’s probably a lot of luck involved, but I believe that one can train oneself to be efficient and “say no”.",
      "author": "Aubenabee",
      "created": 1615860714,
      "upvotes": 25,
      "replies": {}
    },
    "gr3m40u": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3m40u/",
      "text": "Full professor and department chair at an R1 checking in. I put in hard work during the day 8:30-5:30, but take most evenings and weekends off (I am a mom of two kids). I have learned to be very picky about what I say yes to, choose my collaborators wisely, and delegate what I can. Teaching is a lot easier to prepare for than it was when I first started, and I enjoy it more. I do occasionally work evenings or a weekend if I’m working toward a grant or paper deadline, but it’s not that often (maybe once every few months?). I have also learned to accept less than perfection, focus on trying to get in 30 minutes daily research writing, and collaborate with people and graduate students I enjoy working with and mentoring them to maximize everyone’s productivity and accountability. I also strongly encourage setting boundaries and promoting work-life balance in everyone in my department as well. The academic culture of overwork sucks badly. Do your best to fight against it for yourself and others.",
      "author": "DoodleCaboodle",
      "created": 1615879543,
      "upvotes": 25,
      "replies": {}
    },
    "gr3ohai": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3ohai/",
      "text": "> already gave up the idea of work-life balance during the tenure track.\n\nAlways sad to read this.",
      "author": "01010100111011011011",
      "created": 1615881948,
      "upvotes": 8,
      "replies": {
        "gr4bnkx": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4bnkx/",
          "text": "Especially because it's not necessary. At all.",
          "author": "Aubenabee",
          "created": 1615901157,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gr3zbko": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr3zbko/",
      "text": "Like many have stated in this thread, it is in part a choice. The most successful full professors (mostly men) at my department take a rather relaxed approach to service and teaching. Other full professors (mostly women) go all in on administrative duties and other stuff. I am a man but I got caught in the service wheel for many years (director, director of studies, numerous boards and committees etc.). \n\nAdministration require certain skills and a mindset that is sometimes hard to come by. Therefore, every time you do a decent job, you are certain to be asked to do something similar later on, and again, and again. I had to make a clean break and just decide that I wasn't going to do it anymore. Like a recovering drug addict, it took a while to get used to not having a say in anything and everything, but after a while it became the new normal. I am ten times happier today, and just do stuff that I like.\n\nOther than that, I think the biggest time waste is the way many organize their teaching. Many, many hours are wasted with no benefit for the students.",
      "author": "molobodd",
      "created": 1615892910,
      "upvotes": 7,
      "replies": {
        "gr491jv": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr491jv/",
          "text": "Can you elaborate on how to organise teaching efficiently?",
          "author": "Monsteriah",
          "created": 1615899694,
          "upvotes": 3,
          "replies": {
            "gr4doty": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4doty/",
              "text": "Imho, the thing that wastes the most time is communications outside of class with students about stuff that is NOT about understanding and content. If you have an LMS or just check your e-mail, how many questions from students are of the type:\n\na) \"I struggle to understand how X relates to Y. I read the book and did everything you told me to do, but I still don't get it.\" (Reply: \"Thanks for your question. I will try to explain this more thoroughly tomorrow in class.\")\n\n...and how many questions do you get of this type:\n\nb) \"When is the assignment due?\" \"I was absent yesterday because... what did I miss?\" \"My dog is ill and I haven't... what should I do?\"\n\nI have done some anecdotal surveys among lecturers over the years, and often (b) makes for close to 90 % of the work. If you can get the latter close to zero, more time to do Reddit, PS5 or research.\n\nAnother time suck is summative feedback after the fact. If I spend 10 minutes on a paper, I may be able to grade it reasonably validly and reliably. If I have to write feedback and communicate strengths and shortcomings of the paper it takes ten times longer. Sometimes this is necessary, but how much time is spent on explaining things that the student got wrong because they didn't study enough or was absent from your teaching?\n\nSuch ad hoc \"re-teaching after the fact on an individual basis\" should be brought down to absolutely nothing.\n\nPersonally I only give qualitative, formative feedback on drafts during the course. When the course is over with they get grades, and if they have questions about them I answer them.",
              "author": "molobodd",
              "created": 1615902227,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gr4bunh": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4bunh/",
      "text": "I’ve been tenured for a while now and still find it very hard to set boundaries. People mention working 8/9 to 5pm, but I find that if I try to focus for that long in a stretch, I get distracted, tired, and the quality of my work suffers. I’ve read something that says you can really only do 2-3 hours of quality work in a day. I just can’t grade or write or read for more than that in a stretch. So as a result my workday ends up taking over my entire day and I find that I start my day at 9am and wrap up a little past 9pm (with multiple short breaks and a workout and a dinner around 5pm). Note though that I love writing at night, so this is in part a personal choice to maximize productivity. But the downside is that it creates the impression of constantly working. I don’t have kids and this is a major reason why tbh. \n\nI have gotten better about drawing boundaries around weekend work after developing some health issues due to chronic stress though. I try not to work Saturdays unless I have a big stack of grading or a grant due. Sunday evenings are all work though because it helps make the coming week less stressful.",
      "author": "QueenAsphyxiaXIX",
      "created": 1615901262,
      "upvotes": 4,
      "replies": {}
    },
    "gr4ypxr": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4ypxr/",
      "text": "Once you have tenure, it's a job...  You are personally responsible for work life balance.    Personally I want to quit every spring quarter, then every summer it's like \"I can't believe they pay me to have this job\". Over the year it averages out to a great job ... for me at least.  BTW I've opted out of many chair searches ... see other posts on this.",
      "author": "blakehannaford",
      "created": 1615911956,
      "upvotes": 5,
      "replies": {
        "gr50enb": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr50enb/",
          "text": "That's a great point -- I assume most replies here refer to \"during the semesters\". I assume the summers are much more flexible w/o the teaching and administrative work?",
          "author": "itsmi",
          "created": 1615912697,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gr4hp38": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4hp38/",
      "text": "What's likely to happen after tenure is that you will take note of a sharply bimodal distribution among associate professors between those who invest entirely in their own research program (and are often rewarded both internally and externally if they are successful with it, though they also then get on the grant-seeking hamster wheel for life if so) and those who accept responsibility for administrative service--chairing, being on important committees, etc. The former people tend to make the burden even heavier on the latter people by not doing their share (at R1s, always justifying that decision in terms of the demands of their research programs) and to some extent the latter often face a choice between letting their own research wither to some extent or shafting the \"life\" part of the work-life balance. Associate professors are generally the administrative workhorses of any higher education institution and that brings a lot of new stress into their lives.",
      "author": "swarthmoreburke",
      "created": 1615904204,
      "upvotes": 4,
      "replies": {
        "gray61p": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gray61p/",
          "text": "I’ve never really had ambitions to get into admin positions and your post truly solidified that stance. I do feel badly that those in admin positions are exploited and over worked - but also I have no desire to be that person.\n\nThe system sucks.",
          "author": "E388",
          "created": 1616030075,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gr45in5": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr45in5/",
      "text": "You have a great deal more control over your time. By now teaching should be a minimal time investment and while service expectations are somewhat greater you were probably already doing about as much anyway.\n\n\nYou can have time to do stuff before tenure too, but you have to plan and be smart with your time.",
      "author": "ph0rk",
      "created": 1615897540,
      "upvotes": 2,
      "replies": {
        "gray96i": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gray96i/",
          "text": "Can you give examples of things you’ve found to be good uses of your time? Or ways you’ve been able to be smart with your time?",
          "author": "E388",
          "created": 1616030120,
          "upvotes": 1,
          "replies": {
            "grbc336": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/grbc336/",
              "text": "Letting papers/projects die that are going nowhere.\n\nSetting hard limits on the time spent on teaching.\n\nStuff like that.",
              "author": "ph0rk",
              "created": 1616037552,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gr4dq1s": {
      "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4dq1s/",
      "text": "Please please do not enter this profession. It is not worth it",
      "author": "GabhaNua",
      "created": 1615902244,
      "upvotes": 1,
      "replies": {
        "gr4ikqh": {
          "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4ikqh/",
          "text": "Could you elaborate on that? Why do you think that and is that your own experience?",
          "author": "itsmi",
          "created": 1615904625,
          "upvotes": 1,
          "replies": {
            "gr4u1nr": {
              "link": "/r/AskAcademia/comments/m5w9k8/worklife_balance_for_tenured_r1_professors/gr4u1nr/",
              "text": "If you were offered an assistant Professor position you will already know a lot about the sector, perhaps more than me. I just posted that as a whole I find it a very unrewarding industry. So many of my colleagues work extremely long weeks through out their 20s, 30, and 40s and struggle to get employment at the end of it.",
              "author": "GabhaNua",
              "created": 1615909881,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}