{
  "sid": "qpxks7",
  "link": "/r/AskAcademia/comments/qpxks7/has_anyone_ever_taught_while_being_a_postbacc/",
  "title:": "Has anyone ever taught while being a post-bacc student at their college?",
  "text": "Hi, all. This is going to sound like a weird question. Basically, i’m wanting to teach nursing students and take them to clinicals on a certain day of the week. At the same time however, I have been taking classes at the same school as a post bacc student. Has anyone ever done this before and is there a rule or anything as to being a student and an instructor at your same institution? It sounds a bit weird, I know. Just seeking some input. Thanks.",
  "author": "renznoi5",
  "created": 1636439013,
  "updated": 1636654673,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjy1t3j": {
      "link": "/r/AskAcademia/comments/qpxks7/has_anyone_ever_taught_while_being_a_postbacc/hjy1t3j/",
      "text": "It’s not weird at all. This is the life of many, many grad students.\n\nI’m in a psychology grad program and teaching in two different departments. Officially, I’m a TA in one of those departments, but adjunct faculty in the other.",
      "author": "ItsAllMyAlt",
      "created": 1636472003,
      "upvotes": 2,
      "replies": {
        "hjykygx": {
          "link": "/r/AskAcademia/comments/qpxks7/has_anyone_ever_taught_while_being_a_postbacc/hjykygx/",
          "text": "Thanks for sharing. I guess it feels weird for me cause I am wanting to teach nursing, but will be taking classes for another degree that is not related to nursing. If I may ask, does your adjunct faculty position pay just as much as a regular instructor at your school? I know with TA positions they don’t tend to make as much.",
          "author": "renznoi5",
          "created": 1636479673,
          "upvotes": 1,
          "replies": {
            "hjyu13v": {
              "link": "/r/AskAcademia/comments/qpxks7/has_anyone_ever_taught_while_being_a_postbacc/hjyu13v/",
              "text": "I’m honestly not sure. I think they’re technically paying me like a TA because of my grad student status (partial tuition remission and a stipend that I think comes out to $20 an hour for 10 hours of work per week), but everyone else who is teaching other sections of the course I am teaching already has a graduate degree.\n\nWhy the trepidation at teaching classes in a subject that you’re not a student in? If you have the appropriate amount of knowledge to teach that stuff, then go for it. The department where I’m adjuncting is tangentially related to what I’m studying but it’s not what my degree is in. It’s not even a class I had taken before. If they’ll accept you then who cares?",
              "author": "ItsAllMyAlt",
              "created": 1636483265,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}