{
  "sid": "pay1kc",
  "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/",
  "title:": "Wanting to start research after leaving undergrad… is it too late?",
  "text": "Hi 23F here 1 year out of college. My biggest regret is having not done more research in my undergrad. I studied computer science and am now a software engineer but don’t feel like my intellectual curiosity is satisfied…. I’m trying to explore what I’m really passionate about and would like some experience using data science to research and reveal meaningful data visualizations about humanities or classics. Is it too late for me to participate in research like this as a hobby/part time pursuit? Even if I wanted to would any professor or institution let me participate without being a student? Do I just need to suck it up and pay for a masters in data science? Any help would be appreciated. Thanks!",
  "author": "Zestyclose_Bank3279",
  "created": 1629844578,
  "updated": 1634079501,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "ha8aro4": {
      "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha8aro4/",
      "text": "I commend you on your desire to keep learning after college!!\n\nYou might consider reaching out to an early career scholar who would be grateful for the help… perhaps a new assistant professor in a related program? They are usually working hard to get lots of projects up and running. A pleasant and professional email inquiry would be fine. No harm if it doesn’t work out.\n\nThat said… do u have a specific topic /study focus in mind? If so you might be able to bring that to the table as a catalyst for further discussion/involvement.",
      "author": "XCThinker",
      "created": 1629850200,
      "upvotes": 6,
      "replies": {
        "ha9lw9s": {
          "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha9lw9s/",
          "text": "Hi! Wow thanks so much for the detailed response :) I never really thought much about academia until after college so I really appreciate your guidance. For topic/focus I’m very interested in trying to use data to better illustrate female power throughout history. I haven’t narrowed down where if any of this research is being conducted but something to do with using data science and visualization to analyze whether patriarchal perceptions of the past are accurate or if there are feminist perspectives that could be applied. How would you recommend even beginning to look for the right professors to ask?",
          "author": "Zestyclose_Bank3279",
          "created": 1629877041,
          "upvotes": 1,
          "replies": {
            "hadccrf": {
              "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/hadccrf/",
              "text": "Hmm interesting topic and good question. You could start with trying to find a recent paper on a similar or related topic and tracking down the author. Most authors have an email address listed under their name on the paper. Another way might be to join a professional scholarly society/association where folks might be talking about similar things and get in touch that way. Perhaps there’s a historical studies association? Or a literary studies association (I think you mentioned something about classics). Not sure any of this helps…?",
              "author": "XCThinker",
              "created": 1629941778,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ha82axx": {
      "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha82axx/",
      "text": "With your CS background and experience, I think a good way to approach this is to actually get started on side projects. There are so many resources out there right now on data science and datasets - find a topic you like, see what skills you might need to pick up, and have fun! Doesn’t have to be immediately publishable or super formal. \n\nIt might be difficult to work on digital humanities with a PI in academia right away, but if you explore a bit and have a repo/portfolio/some way to demonstrate your skills you’ll be able to (1) see if it’s something you’d be interested in and (2) use it to apply for new jobs/grad school.",
      "author": "abriec",
      "created": 1629846346,
      "upvotes": 2,
      "replies": {
        "ha9m2by": {
          "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha9m2by/",
          "text": "That’s a great idea! This foray was kind of inspired by the Fulbright and thinking about what kind of studying abroad Id want to do and realizing, embarrassingly, I haven’t dedicated much of my time to intellectual pursuits as much as I have just getting a job to pay for my lifestyle. Research isn’t the only means to achieve that, side projects can definitely help me discern if I actually want to dedicate more time towards this topic",
          "author": "Zestyclose_Bank3279",
          "created": 1629877181,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ha8ygdm": {
      "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha8ygdm/",
      "text": "If you want to do it for fun, of course, knock yourself out.\n\nIf you want to do it in a way that contributes to research in a bigger way, you could do it as a hobby, sure, with the hope of finding something interesting. But the bar for this is going to be high — you'll need to know the methods and questions and discussions taking place within the academy. You _can_ learn this from reading lots of academic journals, books, etc., but it's very hard to self-teach effectively in a way that would make other academics respect you. Learning this stuff is what grad school is really all about at its core. And a lack of institutional affiliation means acquiring these resources is going to be difficult. \n\nWorking for free sounds like something academics would enjoy but it may not be the case. I do not employ free labor, for two reasons. One, it is unethical. Your labor is worth something and there is a big difference between underpaid and unpaid. I know, you say it's what you want to do, etc., but no — if I am going to employ someone's labor there has to be some kind of compensated framework for it (either money or student credit or whatever). Otherwise I am contributing to a system of expected exploitation. There is already a LOT of that in academia and it is not good, and any of it that is avoidable should be avoided.\n\nThe other reason I don't is that if you don't have any incentive other than \"you think this is cool\" to do the work, in my experience, you probably won't. You'll get busy. You'll get bored. You'll get annoyed. Who knows? But it's hard enough to keep compensated workers on task. I have no leverage with uncompensated ones. It's just not worth the effort. It takes time for me to work with an employee — time to train them up, time to check in on their results, time to process what they do, etc. I wouldn't invest _my_ time in your giving me _your_ time because I would be very wary of the idea that it would pay off in the end.\n\nI would be _deeply_ suspicious of either the intentions, ethics, or management skills of any academic who would accept free labor from a non-student/non-scholar unless it was some kind of true collaboration. That kind of thing won't appear overnight or the result of a blind e-mail; you'd need to demonstrate actual skills, be seen as a collaborator and not a subordinate, etc. You'd need to somehow already demonstrate what you bring to the table. Again, it takes a LOT of time to collaborate.\n\nOf these options, the \"amateur hobbyist who becomes a contributor\" is not as hard as it might seem if you are willing to put in the time. Especially if you are contributing to open source software — that is the kind of place where non-academics can make real contributions. Again, this will take a huge time investment. But academics routinely use code libraries and tools developed by amateurs in this way, and could be a foot in the door, and maybe a way to see if this is really what you want to do without committing to something as expensive as a masters.\n\nJust my opinion as someone who works a little in the space (and occasionally gets well-meaning people asking to work for me for free) — feel free to disregard...!",
      "author": "restricteddata",
      "created": 1629861339,
      "upvotes": 2,
      "replies": {
        "ha9me2e": {
          "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha9me2e/",
          "text": "Thank you for sharing your thoughts! I definitely feel the same wariness about offering unpaid labor, the commitment and quality of work often times with unpaid labor is a gamble from both the person offering the service and the disinterested or low expectations from the manager accepting it. Open source contribution is certainly a great idea to start with. Thank you for the suggestion!",
          "author": "Zestyclose_Bank3279",
          "created": 1629877462,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ha9yi2y": {
      "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha9yi2y/",
      "text": "You're 23! It's not late. Another person asked about auditing classes without being a student, it seems this possibility depends on the country you're in. Personally once I started learning I could not stop. It's also true that I did not have to pay for my education. It seems to me that you'd love doing a PhD (in case, please do some research on potential advisors, first!).",
      "author": "Normal_Kaleidoscope",
      "created": 1629887782,
      "upvotes": 2,
      "replies": {}
    },
    "ha7zkn7": {
      "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha7zkn7/",
      "text": "[deleted]",
      "author": null,
      "created": 1629845122,
      "upvotes": -2,
      "replies": {
        "ha9li5j": {
          "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/ha9li5j/",
          "text": "Oh I didn’t drop out, I graduated already!",
          "author": "Zestyclose_Bank3279",
          "created": 1629876712,
          "upvotes": 1,
          "replies": {
            "han7rbg": {
              "link": "/r/AskAcademia/comments/pay1kc/wanting_to_start_research_after_leaving_undergrad/han7rbg/",
              "text": "Sorry I am going to delete this comment",
              "author": "Illustrious-Job-8650",
              "created": 1630123421,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}