{
  "sid": "pduleq",
  "link": "/r/AskAcademia/comments/pduleq/advice_related_to_choosing_my_postgraduate_degree/",
  "title:": "Advice related to choosing my Postgraduate degree",
  "text": "Hello and Greetings,\nI did my bachelor's degree in Biochemistry at a low tier college, in India. And even then thanks to the pandemic, I have lost almost one and a half years worth of real academic learning. But I did study well and got 9.2 GPA(which may have been helped by the university's leniency due to the pandemic). \nSo now I had applied to a really, really great college for an M.Sc in Biochemistry and as my secondary option, an Msc in applied microbiology.  Both are really good departments there I hear. And getting my M.sc there would really redeem me. \nI was selected for the M.Sc in applied Microbiology program but put in the waiting list for Biochemistry . I talked to the faculty in the Biochemistry dept, and they said I had zero chance to get a seat and I should take what I have(M.sc applied Microbiology) or leave. So I took it, paid the fee.\nBut now two of my friends who had only applied for Biochemistry, who had scored less than me have been invited to join the Biochemistry program there.\nI would like to hear advice from  people who do real microbiology, regarding the following,  \n1. Would doing a cross major help me or impede me in the long run?\n2. Can a Biochemistry graduate like me excel in Microbiology?(I must say I lost valuable Lab skills because of the pandemic but I am good at the theoretical side)\n3. Is there any possibility for me to get out of India for my job and would my cross major be a problem for that?\n4. What kind of jobs are available for Microbiology postgraduates in countries other than India, preferably the Nordic countries and east Asian countries?\n5. What would you suggest me to make my wet lab skills better?\nP.S : I am asking these because I am on a hedge, and I still might persuade the Biochemistry department to consider me.\nThanking you",
  "author": "Zealousideal-Buy-382",
  "created": 1630241144,
  "updated": 1634079459,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "haty6kj": {
      "link": "/r/AskAcademia/comments/pduleq/advice_related_to_choosing_my_postgraduate_degree/haty6kj/",
      "text": "It's very difficult to answer these questions without know the course syllabi in detail. Firstly, I'd say if you really want to do the MSc in biochemistry you should push with the department.\n\nHowever, in general once you start getting into research the subject titles of what you're doing are much less defined and often reflects the department you're working in rather than the nature of the project. For example, if you were doing a project looking at the interaction of two e coli proteins, that could be microbiology, but it could also be biochemistry or even structural biology. It would probably depend on the department. I spent my academic career looking at the formation of chromatin and at various times that's been molecular biology, biochemistry, molecular medicine, structural biology and cell biology. \n\nIt's not clear from your post if these are taught or research masters but I would say that while it might be harder to jump from a microbiology degree to a biochemistry degree it won't be impossible at all and you have the UG biochemistry degree to back it up. \n\nLastly, stop putting yourself down and being negative about your results. You got the result you got, and it seems relatively good. Let other people make up their mind about you, rather than putting words in their mouth.",
      "author": "ACatGod",
      "created": 1630260993,
      "upvotes": 2,
      "replies": {}
    }
  }
}