{
  "sid": "nkixmd",
  "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/",
  "title:": "Got my PhD almost a year ago, struggling to find a job.",
  "text": "Hey /r/AskAcademia ,\n\nAustralian PhD graduate here. My doctorate was (broadly) in risk communication and natural hazards research. I started when I was 23 straight after undergrad and was awarded last year at 29. I worked as a sessional/casual academic during that period, mostly teaching management science at my university. I'm 30 now.\n\nAt the start of this year, I took the savings I had and called it quits with the university. I never wanted to be a teacher and I couldn't take the institutional exploitation by the university anymore. It's also a fairly bad time to be a non-STEM academic in Australia.\n\nI've been applying for jobs full time, but I can't even get so much as an interview for a position. \nI applied for a position at the CFA (Country Fire Authority, the main body for fire management in my state) that was almost a natural extension of the work I did in my doctorate. The application was ignored for six weeks until I emailed asking for an update, at which point they updated the application from \"In Progress\" to \"Finished\" and told me they wouldn't be inviting me to interview. I suspect they had an internal candidate in mind and the job posting was just a legal requirement and never actually checked. Still, it hurts to not have even had the opportunity to interview, after all that time building an expertise on the subject. \n\nI've also been applying for any and every researcher or consultant role I can find, but I'm turned down at the first stage every time.\n\nTo be honest, I'm starting to get really scared. It's been almost 12 months since I graduated and I don't feel like I'm any closer to a career. I spent six years in some truly awful conditions, sacrificing a lot to get my doctorate finished. The thing that kept me going the whole time was the idea that a PhD would be valuable, prestigious, and make it easier to find a job. Now I look at my testamur and I just want to burn it. It feels like all the suffering was meaningless and has no context. My self-worth, mental state and finances are rapidly deteriorating and I'm not sure what to do next. \n\nIs anyone able to give me some advice on leaving academia and finding a job?",
  "author": "shocklance",
  "created": 1621923839,
  "updated": 1634080222,
  "over_18": false,
  "upvotes": 290,
  "upvote_ratio": 0.98,
  "comments": {
    "gzd9u0r": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzd9u0r/",
      "text": "Can you get someone who's familiar with hiring PhDs into non-academia jobs to review your CV and a sample of your cover letters?  You'll need to include the job ads with the cover letters for review, because each cover letter needs to be tailored specifically to the job, especially if you're applying for things that aren't the 100% obvious next step for your career path.\n\nYou talk about applying but not about networking.  If you haven't already, I'd suggest you put some of this effort into finding out what professional associations or meetings are relevant to the people you want to work for and attend those.  Ask them what they need from candidates in these roles.\n\nLastly, if you haven't already, you should be looking up the people who currently do the kinds of jobs you're applying for.  Check out their educational path and experience and see if you can spot something that you're missing.",
      "author": "polyphonal",
      "created": 1621928938,
      "upvotes": 110,
      "replies": {
        "gzdd788": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdd788/",
          "text": "Thanks for your response. I'll try and follow these steps. I appreciate your input!",
          "author": "shocklance",
          "created": 1621932207,
          "upvotes": 23,
          "replies": {
            "gze7n47": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gze7n47/",
              "text": "I wanted to just jump on this and add a bit more advice: don't be afraid to message people who you would want to work for to ask them what they are looking for in prospective workers.\n  \nA lot of my own professional development has been e-mailing people who I would love to work with, and if I were to hypothetically approach them for work, what would be some of the expectations they would be looking for in my credentials.\n  \nThis has really helped me narrow down where my skill development needs to be focused, and has put me in a much better position professionally.",
              "author": "PM_ME_A_ONELINER",
              "created": 1621952590,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "gzdb3t4": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdb3t4/",
          "text": "This is great advice.",
          "author": "OrbitalPete",
          "created": 1621930164,
          "upvotes": 13,
          "replies": {}
        },
        "gzeec2v": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzeec2v/",
          "text": "I agree with having someone else look at your CV. I applied for hundreds of jobs after my PhD and didn't hear back from more than a handful. Once I finally took some time to learn how to tailor my CV to the position and to focus on my accomplishments rather than just listing everything I'd done, I had much better success. I found the Cheeky Scientist to be helpful, you have to pay for it but I found their CV prep and interview trainings very helpful. The group also helps you network with other PhDs. I think this group or something else similar could help.",
          "author": "Future-Pattern-8744",
          "created": 1621955597,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gzd9k4c": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzd9k4c/",
      "text": "I'm just finishing my thesis in international relations and I got an industry job already (after 6 months searching). Allow my two cents in how I did it.\n\n\nI checked what companies valued in my field. Do not rely only on your PhD to get employed, take training courses on what you want to do. E.g., I took courses in project management, risk management, agile and others. If you take live courses in zoom, try to ask a good question at the end. Your name will stand out.\n\n\n\nSecond, network is key. Even with the pandemic, I started to ask my friends about my CV (curated by a specialist) and added things they suggested. They showed my CV to their friends in the industry, so the ball was rolling. I went to LinkedIn vacancies and began to talk to recruiters about my chances. When getting negative feedback, I asked how should I improve myself to be considered for next openings.\n\n\n\nThird, learn to sell yourself. People will always ask why they should hire a PhD reeking of academia. You must have the answer ready - your skills, your projects, the training you're taking. I know it's hard when you're seeking for a year, but honestly I was only selected for interviews after I stated to chat with recruiters about me being awesome.\n\nI really hope things work out for you, OP. Dm me if you want any more help.",
      "author": "StrawberryinPizza",
      "created": 1621928671,
      "upvotes": 79,
      "replies": {
        "gzdd40n": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdd40n/",
          "text": "Thank you so much. This was really helpful. Congratulations on your job!",
          "author": "shocklance",
          "created": 1621932116,
          "upvotes": 7,
          "replies": {
            "gzddnur": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzddnur/",
              "text": "Thank you, best wishes!",
              "author": "StrawberryinPizza",
              "created": 1621932662,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gzf93y5": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzf93y5/",
          "text": "Would love to know more about this. Do you mind if I message you?",
          "author": "bobagrlies",
          "created": 1621968695,
          "upvotes": 1,
          "replies": {
            "gzfzs7h": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzfzs7h/",
              "text": "DM-me away!",
              "author": "StrawberryinPizza",
              "created": 1621980746,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gzdblk5": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdblk5/",
      "text": "What others said, but also: the PhD doesn't make getting jobs easier. It allows you to apply to higher paying jobs. There is still a competition, you won't be showered by job offers just because you have a relevant PhD. \n\nA year seems long, but it probably isn't. There are likely not that many jobs on your level, and if you are geographically constrained it adds. So the numbers game is against you. \nI don't know about your local diffusing, but in particular in local government internal hires are indeed a thing. However, you need to learn to not take that personally - it doesn't mean your expertise is of no value. \n\nKeep going. Those who persist always get a job in the end. Don't give up. It would be harder, or more frustrating, without a PhD. \n\nAlso, you sound depressed. Maybe have a chat with your GP.",
      "author": "25limes",
      "created": 1621930647,
      "upvotes": 52,
      "replies": {
        "gzdd5oj": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdd5oj/",
          "text": "Thank for you responding. I do need to remind myself to not take it personally; I'll keep at it. Thanks for the advice!",
          "author": "shocklance",
          "created": 1621932163,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "gzd6vae": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzd6vae/",
      "text": "Hey, I'm in the same boat right now. Don't have anything too helpful to say unfortunately, but hit me up if you want to practice consulting cases for the interviews. And try to post your CV to r/resumes for feedback.",
      "author": "Loweren",
      "created": 1621926231,
      "upvotes": 45,
      "replies": {
        "gzd7uv3": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzd7uv3/",
          "text": "Thanks a lot! I'll check it out. Hang in there!",
          "author": "shocklance",
          "created": 1621927104,
          "upvotes": 8,
          "replies": {}
        },
        "gzdox8g": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdox8g/",
          "text": "> r/resumes \n\nNever knew that sub existed. Thanks!",
          "author": "wirrbeltier",
          "created": 1621942371,
          "upvotes": 4,
          "replies": {
            "gzdoxxh": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdoxxh/",
              "text": "Here's a sneak peek of /r/resumes using the [top posts](https://np.reddit.com/r/resumes/top/?sort=top&t=year) of the year!\n\n\\#1: [Please stop saving your resumes as “resume.pdf”](https://np.reddit.com/r/resumes/comments/kw6xie/please_stop_saving_your_resumes_as_resumepdf/)  \n\\#2: [Tips that got me an interview!](https://np.reddit.com/r/resumes/comments/m22xci/tips_that_got_me_an_interview/)  \n\\#3: [Changing your name on your resume? Worked for me!](https://np.reddit.com/r/resumes/comments/gzzat8/changing_your_name_on_your_resume_worked_for_me/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/joo7mb/blacklist_viii/)",
              "author": "sneakpeekbot",
              "created": 1621942385,
              "upvotes": 2,
              "replies": {}
            },
            "gzfkn43": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzfkn43/",
              "text": "Great find!! I teach HR courses and would often need CVs for workshops, and the ones in that sub are perfect! Thanks for the info!!",
              "author": "watchNtell",
              "created": 1621973560,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gzdmw6i": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdmw6i/",
          "text": "Thanks for the suggestion as well.. I will be exploring that subreddit.",
          "author": "givemeyourdonut",
          "created": 1621940921,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gzdc3ax": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdc3ax/",
      "text": "Speaking from experience, the problem you have is that you’re waking into an incredibly tight job market, over qualified and under-experienced. Employers right now are not in a position to take a risk. Most are downsizing and those that are hiring are looking for safe bets. PhD value to industry is way overemphasised by Universities. \n\nThis is not what you want to hear, but someone needs to say it: you need to downgrade your expectations and go after a grad level job. Up against a 4 year graduate you have fighting chance. Helpfully the skills you’ve learned in your PhD will help you progress faster, though there’s no guarantees.",
      "author": "ischickenafruit",
      "created": 1621931126,
      "upvotes": 37,
      "replies": {
        "gzdd8wg": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdd8wg/",
          "text": "Thank you! I have been slowly lowering my expectations and applying for some graduate positions. The experience deficit is a really big problem that I'm struggling to overcome. I'll keep searching.",
          "author": "shocklance",
          "created": 1621932253,
          "upvotes": 8,
          "replies": {
            "gzdf6wx": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdf6wx/",
              "text": "I don't know how it is in Australia, but keep in mind that your PhD was a job too (disguised as education). Try selling it as such as well. You're no graduate fresh from graduation, you've worked in research for a few years. That might help with the experience gap.",
              "author": "speeding_sloth",
              "created": 1621934155,
              "upvotes": 21,
              "replies": {
                "gzdkpak": {
                  "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdkpak/",
                  "text": "This. I never understood this \"you have no work experience\" narrative. I spent 5 years managing multiple projects, coordinating international collaborations, teaching myself whatever was needed to finish the task and had to write and speak about all of this to many different audiences. I have a ton of experience, regardless of what my PhD was actually in.   \nDuring my PhD I also worked part-time at a company in my field and I genuinely don't think I got more \"work experience\" there than at my university.",
                  "author": "Eksoj",
                  "created": 1621939178,
                  "upvotes": 24,
                  "replies": {
                    "gzdw9lp": {
                      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdw9lp/",
                      "text": "There's a few issues with PhDs. Firstly, employers are worried that they'll leave if a better opportunity arises. Secondly, when they say \"no work experience\", they really mean \"no industry experience\". While I agree that a good PhD can do practically any entry-level job, the concerns of employers are still valid since hiring someone can be a significant investment – on the order of $30–50k. They can't afford to keep hiring new people if they suspect a PhD will only stay for a year. And let's be real, PhD *are* often looking for better opportunities.",
                      "author": "someth1ng_au",
                      "created": 1621946913,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "gzdtqxv": {
                      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdtqxv/",
                      "text": "If your employer (boss) has never done a PhD, which honestly is most of them, then best case they have absolutely no idea what’s involved. You may see project management, independent working, writing skills, presentation skills, self learning, cutting edge R&D. etc etc. To them, it’s probably something like just more advanced courses than that they did at uni. Not very useful or practical. \n\nWorst case (and I’ve seen this happen) they feel intimidated by you and your “cleverness” and feel the need to prove they are much smarter than you. \n\nIn general there’s a lot of misunderstanding about PhDs in industry.",
                      "author": "ischickenafruit",
                      "created": 1621945458,
                      "upvotes": 14,
                      "replies": {}
                    },
                    "gzeblvp": {
                      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzeblvp/",
                      "text": "In my experience, \"work experience\" is not usually a synonym for \"transferable skills\"; it literally means experience doing this specific work in this specific type of environment. For employers ime it tends to mean what the Greeks called metis - the ability to make useful subjective judgments that relies on your extensive familiarity with some phenomenon. Industry experience is really, really important for everyone - people coming in from grad school, people trying to lateral from another industry, whatever.",
                      "author": "thegreenaquarium",
                      "created": 1621954366,
                      "upvotes": 3,
                      "replies": {
                        "gzhvs7u": {
                          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzhvs7u/",
                          "text": "Yes, fair enough! That kind of experience is indeed lacking.   \nJust some people seem to think that at the end of your PhD you have no work experience simply because you were still working towards a degree and that I would disagree with.",
                          "author": "Eksoj",
                          "created": 1622023333,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "gzf5782": {
                          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzf5782/",
                          "text": "Yes! Well said!",
                          "author": "ischickenafruit",
                          "created": 1621967139,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gzdk0gn": {
                  "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdk0gn/",
                  "text": "In Australia (unlike Europe) PhDs are not a job. You may get a stipend/ scholarship, but it’s not the same. More importantly, employers (who largely don’t have PhDs) simply don’t see them as jobs. They see them as “yet more study” in “the ivory tower of academia”. The perception matters much more than the reality here because when they are choosing from 100 applicants even silly things can get you knocked off.",
                  "author": "ischickenafruit",
                  "created": 1621938592,
                  "upvotes": 6,
                  "replies": {
                    "gzdvoqg": {
                      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdvoqg/",
                      "text": "I'm an Australian PhD graduand and found a job through connections and I completely disagree that a PhD is not a job in Australia. A PhD is a job in Australia, it's a job in Europe, and it's a job in USA. Part of my PhD (~40%) was in the UK and it's exactly the same there.\n\nThe problem in Australia is that employers do not care if you have a PhD unless it's government, consulting, research, and a few other jobs. When applying for entry-level jobs (e.g. graduate roles), put your pay expectations down to 55–70k (remember, MD interns get paid 69k at RPA, so it's not that bad). You're a PhD and capable of impressing people with the (much higher) quality of work, but you need some industry experience. In fact, it took me just 2–3 months to be on upper management's radar as a future candidate for better management roles. It will take you a year or so (because you're relatively new to industry) and you'll be on your way. You'll fine that a decent PhD actually completely shits on any bachelors or masters level employee, so it's not hard to get attention of senior management – they are *always* looking for talented people (which many PhDs are).\n\nAlso, based on feedback I've received from recruiters, a major concern is that PhDs can talk too much during an interview. *Keep your answers concise.* It might even feel like you're being too brief, but this is a good thing. A lot of questions just need to be 30 seconds (early in the interview) and the longer ones are maybe 2–3 minutes (towards the latter half of the interview).\n\n@OP, I can look at your CV, if you want, and offer some feedback. I know how rough it is as a PhD grad looking for work, since few will give you the chance.",
                      "author": "someth1ng_au",
                      "created": 1621946590,
                      "upvotes": 4,
                      "replies": {
                        "gzdy7an": {
                          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdy7an/",
                          "text": "Several of my close friends did their PhDs in Australia, I did mine in the UK, and my brother and sister in law did there’s in different countries in mainland Europe. \n\nIn mainland Europe when you do your PhD, you are employed by the University. As such you are a staff member at the university. You attend staff meetings. The institution pays you a salary. You pay tax. This is a job. \n\nBye-and-large when you do your PhD in Australia and the UK, you are a student. You get student discounts. You pay the institution for your education. If you are lucky enough to get funding, your stipend is tax free. \nYou are a student. It’s not a job.",
                          "author": "ischickenafruit",
                          "created": 1621947964,
                          "upvotes": -1,
                          "replies": {
                            "gze0the": {
                              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gze0the/",
                              "text": "Firstly, you need to stop making excuses and I'm calling you out on some BS here. How a university or country wants to classify you is *completely irrelevant* because the employer doesn't know or care. Internally, you might be considered an employee in one country and a student in another country – but an employer cannot distinguish that.\n\nWhat you describe are two effectively identical scenarios. In some Australian universities, PhD candidates are classed staff – I know at USyd, they often classify even honours students as staff, because they generally do some teaching. The scholarships are paid through the same staff portal, and you do NOT pay the institution for your education in Australia.",
                              "author": "someth1ng_au",
                              "created": 1621949348,
                              "upvotes": 4,
                              "replies": {
                                "gzf3yqx": {
                                  "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzf3yqx/",
                                  "text": "> You do not pay the institution for your education in Australia\n\nYou are simply wrong. The reason you are confused is because your fees were likely covered by the RTP program. \n\n> Domestic HDR candidates at UNSW may be offered an Australian Government Research Training Program (RTP) Fees Offset Scholarship for four years for a Doctorate, and two years for a masters.The RTP Fees Offset is paid to the University by the Australian Government on your behalf and is used by the University to offset your tuition fees so that you may receive free research training.\n\nhttps://research.unsw.edu.au/fees-and-costs\n\n\n> Higher Degree by Research students may receive a Research Training Program (RTP) Fees Offset under the Australian Government's RTP, which will cover the cost of their tuition fees. \n\nhttps://www.sydney.edu.au/courses/courses/pr/doctor-of-philosophy-science0.html\n\nWhile the cost *may* be covered by the Government, fundamentally, you are are still paying the University a fee for you education (tuition fees), your fees simply come out of your taxes in this case. \n\nIf you are lucky enough to have a scholarship/stipend, then the university *may* choose to use its existing HR/payroll systems to pay you. But the University is not paying payroll tax, worker’s compensation insurance, superannuation or any other government required employee related costs on your behalf. And, you are not paying  income tax, accumulating long service leave nor are you eligible to join the union. You are a student, not an employee.\n\nIn mainland Europe, you are an actual employee of the university, with all the benefits that it brings, on a fixed term contract, with contractually stipulated teaching duties and requirements. You are an employee. \n\nMore than the legal requirements is how employers see you. Which is, in Australia, that you’ve been a student. They typically don’t see or understand what the PhD entails and so they don’t view it as relevant on-the-job experience. You can argue all you want that they should, but there’s a lot of ignorance out there, and it just doesn’t work that way.",
                                  "author": "ischickenafruit",
                                  "created": 1621966647,
                                  "upvotes": 2,
                                  "replies": {
                                    "gzfxedu": {
                                      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzfxedu/",
                                      "text": "If my fees were covered by RTP, did *I* pay for them? No. It makes zero difference to me. None of those things actually matter to whether you are effectively an employee or student – that is purely a technicality and has no relation to your employment.\n\nAgain, the rights you receive have basically no effect on whether you are an employee or student to a potential employer. A PhD is effectively a job and it's *your* problem to justify it as such. You might *technically* be a student, but that's completely beside the point, and it has absolute *ZERO* relevance.\n\nIf you weren't so full of yourself, you'd see that my point was more focused around it being *irrelevant* that you are a student or an employee. The only thing they will see is \"PhD\" on your CV. Why the fuck does it matter if you are technically an employee or student? That's none of their business.\n\nPretty sure you're not supposed to pay fees to your employer...\nNorway: fees must be paid to the *student* union.\nAustria: tuition can be required for non-EU PhD students.\nFrance: PhD fees of €380\nSpain: PhD fees are €22–36\nSwitzerland: €100–900/year",
                                      "author": "someth1ng_au",
                                      "created": 1621979625,
                                      "upvotes": -1,
                                      "replies": {
                                        "gzgmq1e": {
                                          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzgmq1e/",
                                          "text": "> if you weren’t so full of yourself… \n\nSee \n> More than the legal requirements is how employers see you. Which is, in Australia, that you’ve been a student. They typically don’t see or understand what the PhD entails and so they don’t view it as relevant on-the-job experience. You can argue all you want that they should, but there’s a lot of ignorance out there, and it just doesn’t work that way.\n\nHow you see yourself is irrelevant. Most employers do not view a PhD as the equivalent of on-the-job experience, and speaking as an employer, with a PhD, nor do I.",
                                          "author": "ischickenafruit",
                                          "created": 1621992205,
                                          "upvotes": 1,
                                          "replies": {
                                            "gzh1i5z": {
                                              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzh1i5z/",
                                              "text": "It's *your* responsibility to clarify with potential employees that your PhD is effectively a job. There's also a difference between \"employment\" and a \"job\". If you can't do that, then you have nobody to blame but yourself. You've argued that it's somehow different in Europe. It is absolutely not. The only difference is that there's more jobs that specifically require a PhD in Europe (e.g. senior scientist roles).",
                                              "author": "someth1ng_au",
                                              "created": 1622000058,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gze6r8n": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gze6r8n/",
              "text": "Very much what was said above. Industries and government don’t really want to hire PhDs who have limited job experience unless it’s in a highly technical field where a PhD is a baseline qualification. They see it as a constraint, not a benefit. Relying on the degree itself as a qualification could give hiring managers the impression that a candidate isn’t flexible or willing to learn how things work in the “real world” or will have salary/promotion expectations that they don’t want to deal with. I suggest getting advice on how to structure your CV from people who have jobs similar to ones your interested in. Emphasize your soft skills, not your education.",
              "author": null,
              "created": 1621952174,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gzdegle": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdegle/",
      "text": ">I spent six years in some truly awful conditions, sacrificing a lot toget my doctorate finished. The thing that kept me going the whole timewas the idea that a PhD would be valuable, prestigious, and make iteasier to find a job.\n\nYep, people get PhDs because they are told that this is the path to a well paid and meaningful career. I wonder how many people would do PhDs if they were told the truth that they are really there to serve the universities and the professors in their departments. The careers of the students may or may not have after graduating is irrelevant to the true goal of graduate education.",
      "author": "CaptainCornerCamper",
      "created": 1621933450,
      "upvotes": 10,
      "replies": {}
    },
    "gzdnwgn": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdnwgn/",
      "text": "I am learning a lot from the responses provided to your question so I just wanted to say, thank you for asking this question. I am sure that there are many in this subreddit that are also going through the same thing. I wish you the best.",
      "author": "givemeyourdonut",
      "created": 1621941659,
      "upvotes": 9,
      "replies": {}
    },
    "gzdhxza": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdhxza/",
      "text": "Hey, I am a social science Ph.D. as well and had no intention of staying in academia. I basically sold my analytics ability in the market. I did my Ph.D. on a completely unrelated topic as I now work in peace and development research. The think tank I work in has absolutely no connection to my Ph.D. except that the questionnaire uses a lot of subjective indicators. It's kind of ironic because most of the places I used to send manuscripts to turned them down because I used subjective indicators. However, that got me the job! \n\nI don't have a clear-cut solution but this is what I did. I was desperate, just had got married and my wife was also a Ph.D. student in the US then. I cast a really wide net, a really really wide net. I must have applied to close to 600 jobs from December 2019 (kind of semi-desperate) to June 2020 (full-blown desperation) end (my stipend had ended in May) and I started my job in July. So to start with I applied to a lot of places, a lot of them not even directly related to what I do but even if there was a small niche I could make myself relevant in, I would apply. \n\nI didn't network at all. I find academic gatherings fake - I can't stand them, so I went to Linkedin and I kept following pages, organizations, and people whose jobs I liked. I kept adding them, kept following pages, and finally, I started getting a lot of job openings. Not just those that come up on the normal search but general people posting and talking about stuff.  Finally in the middle of the pandemic - I got three calls. \n1. Position for a volunteer in IRC - somewhere in NY/NJ, USA\n2. A really small NGO which was opening up a data team - starting with two people. \n3. A really cool think tank in Europe, where I thought I had no chance. \n\nI got rejected as a volunteer by IRC. In the interview with the NGO, I got a rejection as well. Guess, I didn't quite fit in the mould they were looking for. Eventually, the think tank in Europe gave me a job in July. Pay is not that great but they take care of health and don't make work like indentured labour. They have a good reputation and I hope to stay for 2-3 years and then make a transition to monitoring and evals in NGOs. Maybe IRC can finally stop rejecting me for volunteer positions with a Ph.D. and actually offer me a job. ; )\n\nPoint is that I was lucky, right place and right time but the issue is you have to talk to people, within academia, on LinkedIn, apply to a hundred thousand places. I can't deal with the fake atmosphere of academia, so that option was closed for me but I contacted people on Linkedin, asked them for advice, and kept applying. It would be helpful if you ask help with resumes and cover letters and also make sure that your applications are steered to the job.",
      "author": "kewra_bangali",
      "created": 1621936773,
      "upvotes": 13,
      "replies": {}
    },
    "gzdxd5e": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdxd5e/",
      "text": "So the big question when applying outside academia is: do you have non-academic work experience? It doesn't have to be formal salaried office experience (although that helps a lot), but even a relatively recent internship or a time you consulted on a project with a non-academic entity. When you're 30, and when you have a PhD, companies are reluctant to hire you for entry-level roles, but at the same time, if you have no work exp, they're going to assume you're not ready for the higher-level roles. So K-PhD people are often in this weird limbo when it comes to industry jobs, unless they are of course the few industry jobs that specifically look for PhDs.\n\nIf you don't have work experience, I'd consider an internship (some of them are paid, and anyway, building experience and getting paid even a low wage is better than sitting at home not getting paid anything), or a temp position, a fellowship, or some other short-term program that lets employers try you out and lets you try out your chosen field.",
      "author": "thegreenaquarium",
      "created": 1621947510,
      "upvotes": 3,
      "replies": {}
    },
    "gzddttq": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzddttq/",
      "text": "I did my PhD in Australia and it was drummed into me that I would probably have to leave Australia to get a job. So I did. Sorry if that's nto an option for you, it sucks. I have been out of Australia over 10 years now and the job market there still sucks for my line of work. (I'm in the UK now in a permanent position, but did a postdoc in Belgium.)",
      "author": "liedra",
      "created": 1621932827,
      "upvotes": 5,
      "replies": {}
    },
    "gzdm1dq": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdm1dq/",
      "text": "Do you have any past colleagues or collaborators that you can reach out to? I find it is much easier to find something when you know someone. May not be a perfect position, but could be a good start. Good luck!",
      "author": "01010100111011011011",
      "created": 1621940266,
      "upvotes": 4,
      "replies": {}
    },
    "gzdg4b1": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdg4b1/",
      "text": "Just about to finish my masters in international relations, here at Monash University in Melbourne. Same boat here, nothing but rejection. \n\nIt is a horrible time to be a non-stem grad in Australia.\n\nAt the point now where I’m more than likely going to be back at uni next year doing a juris doctorate as I don’t want to be left doing nothing, working a dead end job at Woolworths. I’d much rather be suffering with assignments but enjoying my contact hours at uni.\n\nHonestly it was a breath of fresh air reading your post, knowing I’m the not only one in the same boat. My mental health has taken a serious decline combined with feelings of inadequacies over my inability to find decent employment in my field.",
      "author": "dr_pepper97",
      "created": 1621935038,
      "upvotes": 2,
      "replies": {}
    },
    "gzdse6k": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdse6k/",
      "text": "This might be a bit demoralising but have you applied for research assistant positions? This is a great way to build connections/get a foot in the door and progress through the ranks of the University sector.",
      "author": "alittlelife_90",
      "created": 1621944646,
      "upvotes": 2,
      "replies": {}
    },
    "gzdvhkg": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdvhkg/",
      "text": "Have you tried applying for any postdoc positions? That may be helpful for getting your foot in the door.",
      "author": "bakedveldtland",
      "created": 1621946475,
      "upvotes": 2,
      "replies": {}
    },
    "gzdwh3r": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdwh3r/",
      "text": "If you’re looking at public service jobs, you need to get someone with public service experience to help with your CV. If you don’t know anyone, there are people you can pay for this service. I tried switching and did get a public service job briefly. It’s really all about the SC responses with them. You have lots of skills from a PhD that could be relevant. \n\nI upped my titles that looked more generic (program director instead of academic chair) and dropped my education further down my CV. Be prepared to accept less money than an equivalent academic job (but the hourly rates technically higher if you’re no longer doing academic hours!).",
      "author": "ginisninja",
      "created": 1621947028,
      "upvotes": 2,
      "replies": {}
    },
    "gzeh73w": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzeh73w/",
      "text": "I worked in consulting when I finished my PhD and then came back to academia. You should start by reaching out to your network and look on LinkedIn as a lot of non academic jobs are posted there. You can also connect with people who work in industry there. It’s a tough market, Good luck!",
      "author": "algebragoddess",
      "created": 1621956851,
      "upvotes": 2,
      "replies": {}
    },
    "gzeqlm4": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzeqlm4/",
      "text": "This is something that academics don’t understand: you don’t get jobs from submitting applications, you get jobs from knowing people. You need to network to meet all the people in your area who have the job you want and who have the power to hire for that job.\n\nMost jobs are never advertised. It’s not internal candidates, it’s applicants who know someone who recommended them for the position.",
      "author": "flagondry",
      "created": 1621960872,
      "upvotes": 2,
      "replies": {}
    },
    "gzel0pb": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzel0pb/",
      "text": "I found pretty good advice at [https://cheekyscientist.com/](https://cheekyscientist.com/) which is specifically for PhDs. You do have to pay, but you get a bunch of useful info on all aspects of the job hunt. If you don't want to spend any money, here are some things I found out. Orient yourself on what job titles are out there and try to cast a big net based on your transferable skills (project management, technical skill, writing, presentation, analysis, experimental design and so on). Some things I didn't know: names of job titles in R&D to look for (R&D project management, user experience research, business development manager, R&D director, quality control, quality assurance, application scientist and so on). Also to start looking for more management roles (and perhaps do a course on Coursera or something to boost your skill). Look at the language people use to present themselves on LinkedIn etc. In the resume, highlight your ability to work in teams, your innovative spirit, your coaching of others, adaptability, experience and comparison of different methods or hardware solutions (product, market knowledge). For your resume, do a simple word comparison between job announcement and your resume and make them match because they use software to scan them. E.g. if the word 'scientific analysis' occurs 3 times in the job announcement, make sure your resume has that exact same word combination at least once. Same with every other word that seems important. The more overlap the better.",
      "author": "sclbmared",
      "created": 1621958482,
      "upvotes": 3,
      "replies": {}
    },
    "gzdq8cu": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdq8cu/",
      "text": "Could be worse. I have risen to a tenured academic role and now want out. There is almost no chance as I've been institutionalised and I'd have to probably half my remuneration. Stuck in a job I wanted and worked hard for, for years, to discover that the commitment they required is literally killing me.",
      "author": "schumpter81",
      "created": 1621943248,
      "upvotes": 3,
      "replies": {}
    },
    "gzdqq8t": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdqq8t/",
      "text": "Sending good vibes. Things will soon get much much better",
      "author": "BalthazarBulldozer",
      "created": 1621943577,
      "upvotes": 1,
      "replies": {}
    },
    "gzdsty6": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdsty6/",
      "text": "Same boat here, finishing a PhD in theoretical physics. Been straight-up rejected from dozens of jobs, in all industries e.g. regular finance, banking, quantitative finance, engineering, R&D, data science, as well as multiple postdocs.\n\nRight now waiting on some other postdoc applications in engineering/physics. Can't really say Australia has ever been big on education, though. This is a very blue-collar country and people only value work experience. Education is at most optional in most places, even corporate jobs (literally know people in banking and financial management positions who didn't go to university)",
      "author": null,
      "created": 1621944913,
      "upvotes": 1,
      "replies": {
        "gzdxqcj": {
          "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdxqcj/",
          "text": "The weird thing is, Australia has among the highest years of education of any country. I think the issue is that Australia tends to value the experience more than other countries. I've noticed in the UK, employers are more willing to take a risk on a candidate that has shown potential through academia (e.g. a PhD). With that said, with my PhD and no experience, I had a 100% success rate in getting interviews for graduate programs – but these were my first ever interviews and I sucked at them lol. A recruiter eventually told me what I was doing wrong.\n\nAnother problem is that postdocs have the reputation of being \"poorly paid\". This is generally true in Europe and North America, where you'd get paid more in almost any industry job, but this doesn't apply in Australia. Your first non-academic job here will not pay as well as an Australian postdoc. You'll will need to settle for 60–70k for a year or two, and you'll likely excel in that role and get noticed – after that, those >100k roles become more attainable.",
          "author": "someth1ng_au",
          "created": 1621947708,
          "upvotes": 1,
          "replies": {
            "gzfv1bg": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzfv1bg/",
              "text": "Those statistics (for years of education) usually count TAFE as tertiary education because it is. TAFE is a really solid institution and offers useful VET courses/certifications, but it’s not university. \n\nI don’t know that many countries have any real analogue to TAFE. Community college might come close in the US, but where CC is seen as optional there, TAFE is seen as pretty much mandatory here. I mean, if you’re a student and you don’t want to work towards an ATAR then you’re basically legally obliged to do VET courses. They’ve really tightened the loopholes and it’s very hard to drop out before completing college.\n\nJust looking at 4-year equivalents, we’re at the same level as the UK, the US, and plenty of other Western countries. Nothing special.",
              "author": "officially_anxious",
              "created": 1621978524,
              "upvotes": 1,
              "replies": {}
            },
            "gzgq2bf": {
              "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzgq2bf/",
              "text": "Yes, experience in Australia is in fact so important that even for a lot of internships you need to have prior work experience in that same area (ironically).",
              "author": null,
              "created": 1621993921,
              "upvotes": 1,
              "replies": {
                "gzh1tzw": {
                  "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzh1tzw/",
                  "text": "To be honest, I've rarely (well, never, actually) seen internships or grad programs that require any prior experience. However, you'll be competing with some people that do. It's just very competitive to find your first job.",
                  "author": "someth1ng_au",
                  "created": 1622000244,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gzdt613": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzdt613/",
      "text": "Do you write cover letters for your applications? I’ve heard that many don’t but it gives you the opportunity to show that you’ve thought about the job and display your unique advantage for the job",
      "author": "pajamasinbananas",
      "created": 1621945114,
      "upvotes": 1,
      "replies": {}
    },
    "gzegavn": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzegavn/",
      "text": "No worry mate.\n\nWith Morrison and Payne wrecking relationship with China, we don't need to protect forest and all the mineral mines. \n\nWe just need to look out for kangaroo protection jobs.",
      "author": "yourseck",
      "created": 1621956465,
      "upvotes": 1,
      "replies": {}
    },
    "gzepwu7": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzepwu7/",
      "text": "I am not an academic by any stretch of the imagination,  I did raise one.   \nReading your post,  I wonder if you have given any thought to working with Douglas Thron. \nHe is pioneering a whole new science really.  \nYou are certainly qualified,  I  can think of all kinds of things you could do,  using your skills.",
      "author": "Mother-Firefighter-2",
      "created": 1621960578,
      "upvotes": 1,
      "replies": {}
    },
    "gzfoh1p": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzfoh1p/",
      "text": "In reality it takes 6 months to land a job for a PhD. 2-3 months of searching and networking. 2-3 months of writing and editing (along with sending your cover letters and statements to your peers and mentors for feedback). 2-3 months of applying and interviewing. \n\nIf you're skipping the networking stage or the peer and mentor feedback stage, it's unlikely that the applying and interviewing stage will be fruitful.\n\nIf you're hitting all of this, then it might just be lack of opportunity in your field, and I would recommend broadening your search to other fields that value a portion of your skillset.",
      "author": "scoobystacks",
      "created": 1621975440,
      "upvotes": 1,
      "replies": {}
    },
    "gzfp438": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzfp438/",
      "text": "I just want to say I completely understand and empathize with your struggle. Getting a job is NOT an easy process (no matter what degree you hold) and lets not forget we were amidst a pandemic last year. So, first and foremost, give yourself a pat on the back because you never gave up. Secondly, I was in a similar situation last year. I had graduated from a research-based master's program and was looking for work for 6 months. The thing that helped me was that I focused on any industry related research jobs. Focus on transferrable skills i.e. skills in qualitative, and quantitive data analysis. I focused on applying to positions that were titled, \"data analyst\", \"Research analyst\", and \"Evaluations Lead\" etc. This is when I started to hear back from organizations because they were looking for people with experience with that. Go on indeed and type, \"quantitive or qualitative research\" jobs and apply to 5 jobs every single day. Getting a job is simply a numbers game. You need to apply for A LOT of jobs. This increases your odds of success. I did not focus on networking or sending messages to people. That never worked for me. I simply applied to 5 jobs every single day that were advertised, tailored my cover letter/resume to the needs of the jobs, and did so consistently. This is how I get results. You can do it!",
      "author": "dilhaikimantanahi",
      "created": 1621975742,
      "upvotes": 1,
      "replies": {}
    },
    "gzg9j1v": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzg9j1v/",
      "text": "STEM PhD here, so take my experience with a grain of salt.\n\nMost non-academic positions don't understand what a PhD can really bring you, a lot of the time applications have to go through HR - who are there usually to tick boxes. You rarely find HR that understands the job itself, and so it can be hard to get past that initial hurdle.\n\nMany of my friends have undergone this long battle (even with PhDs in STEM), but after they have had 1 position changing jobs is a very fast process. So how do you bridge that gap? You need to find some experience. \n\n**The way I got experience:**\n\nAfter deciding to make the switch, I started to do consulting while doing a PostDoc (for reference, im told it gets harder after a PostDoc) and having that experience has made all the difference. I'm now transitioning to a company that I consulted for (and have had other clients because of them). Consulting may sound like a nebulous concept but all I did was get started on a freelancer website ([Upwork.com](https://Upwork.com) was the one I used) and started to look for jobs and found one that matched my expertise. \n\nI have had others go down the volunteer path, but this was the path I chose because it came with a payslip. \n\nGood luck! \n\n**P.s.** Australian here, and the job + freelance gigs were all overseas.",
      "author": "AlienMindBender",
      "created": 1621985560,
      "upvotes": 1,
      "replies": {}
    },
    "gzgcabw": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzgcabw/",
      "text": "You’d think most institutions would be looking for natural hazard researchers right now. Goodness knows we need ‘em. I have no advice better than what others have written but I just wanted to say good luck! Your work is important to so many!",
      "author": "FakinItAndMakinIt",
      "created": 1621986956,
      "upvotes": 1,
      "replies": {}
    },
    "gzgs4ys": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzgs4ys/",
      "text": "I just wanted to say thank you to everyone who contributed to this thread. The advice has been very encouraging and I am feeling a lot less hopeless about things today. I really appreciate the time you all took and I am sure that anyone who is in a similar position reading this thread appreciates it too. You guys rock.",
      "author": "shocklance",
      "created": 1621994985,
      "upvotes": 1,
      "replies": {}
    },
    "h0w0qxk": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/h0w0qxk/",
      "text": "Maybe you're looking at positions which are too close to your degree. If you'd feel comfortable working in another environment. I know a lot of PhDs that work in banking in totally unrelated fields.\n\nAlso, have you checked European institutions? They are searching for climate risk professionals. They probably require EU citizenship but you might be able to get that through ancestry.",
      "author": "RomeNeverFell",
      "created": 1623055389,
      "upvotes": 1,
      "replies": {}
    },
    "h1x7ma6": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/h1x7ma6/",
      "text": "To be honest, I don't know much about the job hunting for Ph.D. students (which is something I believe totally different than undergraduate and graduate students). However, my general advice is to try your best to show yourself, your skills, and more importantly, let people (recruiters) recognize you as the best candidate they are looking for. Sizigi, in this case, could be something really helpful. Sizigi gives applicants an opportunity to share a video about themselves, highlight their skills and experience, and introduce themselves in a creative but also efficient way. If you are interested in Sizigi and how it works, register a free account today with this link (https://go.joinsizigi.com/tianshuo) and try for yourself (there is no harm to try anyway!)!",
      "author": "laobaisbackyard",
      "created": 1623809692,
      "upvotes": 1,
      "replies": {}
    },
    "gzv5oxo": {
      "link": "/r/AskAcademia/comments/nkixmd/got_my_phd_almost_a_year_ago_struggling_to_find_a/gzv5oxo/",
      "text": "It sounds like you wasted the 6 years you went to school assuming the slip of paper would get you a career and not networking. It really doesn't work that way unfortunately",
      "author": "nufonia",
      "created": 1622291252,
      "upvotes": 0,
      "replies": {}
    }
  }
}