{
  "sid": "b6yxqy",
  "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/",
  "title:": "How do.i go about with dealing with a senile professor?",
  "text": "Hello, perhaps you all could help with this problem that I am having. \n\nCurrently I am a junior in college, and I'm taking a class with a professor who I am sure incompetent. The semester has started in January, and as of March we still have not received a syllabus. I do not know what we're supposed to be doing in this class, other than its is a statistics course. For instance, we have had no tests, no homework assigned, and regularly he mixes us up with his combintorics class before us.\n\nBesides that, this semester he thought that it was an extension of last semester, so he gave us other students tests to take home and think about because he thought that it was us. Moreover, sometimes he forgets that we are even in class, and last week he went to get in the couch that is in the class room, but before he did he took his pants off. \n\nI think he has alzheimers or something, but I'm afraid that this is going to be like the last time I had him and hes going to just give me a B- without ever giving homework, tests, or a finale.. \n\nI dont know what to do. I've been to the head of my department to tell them about this, but they havent done a thing about it. The only advice inwas offered, was this is what graduate school is like and to just get over it. ",
  "author": "throwAwayBird007",
  "created": 1553874660,
  "updated": 1634081373,
  "over_18": false,
  "upvotes": 127,
  "upvote_ratio": 0.95,
  "comments": {
    "ejo0g27": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejo0g27/",
      "text": "If you have a professor taking their pants off in class, you need to go up the chain of command until something is done. I’m astounded that the dept chair seems to be making an excuse for his behavior - not even sending someone to observe a class or two, which would take minimal effort. In my opinion you should go to the Dean now ",
      "author": null,
      "created": 1553875768,
      "upvotes": 258,
      "replies": {
        "ejo0o1c": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejo0o1c/",
          "text": "I am only an undergrad but I second going to the Dean. ",
          "author": null,
          "created": 1553875913,
          "upvotes": 61,
          "replies": {}
        },
        "ejowjx7": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejowjx7/",
          "text": ">In my opinion you should go to the Dean now\n\nI'm a department chair and this sounds appalling-- if the chair isn't doing her/his job, go to the dean. The pants incident is particularly disturbing, as it opens the university to accusations of sexual harassment and/or creating a hostile learning environment, which could create a Title IX issue for the school. The dean will be concerned, trust me.",
          "author": "SnowblindAlbino",
          "created": 1553895702,
          "upvotes": 61,
          "replies": {}
        },
        "ejpedxf": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejpedxf/",
          "text": "Clearly a fake story. ",
          "author": "leestitzel",
          "created": 1553909925,
          "upvotes": 22,
          "replies": {
            "ejpgru7": {
              "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejpgru7/",
              "text": "I’m thinking the same thing. The dude takes his pants off in a graduate course to chill on the couch and this shit ain’t viral? Sure. ",
              "author": "shackusa",
              "created": 1553911958,
              "upvotes": 28,
              "replies": {
                "ejpgwcv": {
                  "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejpgwcv/",
                  "text": "Senile professor? Sure. Takes pants off in class and doesn’t get fired right away? Nah. ",
                  "author": "leestitzel",
                  "created": 1553912069,
                  "upvotes": 19,
                  "replies": {
                    "ejph7d1": {
                      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejph7d1/",
                      "text": "Yeah, I had an older Speech Professor last spring and the first time he said something that sounded remotely sexist the students were all over him. If a class of graduate students does not understand that this ain’t normal behavior, then uhh, maybe, uhh, they shouldn’t be Grad students. ",
                      "author": "shackusa",
                      "created": 1553912330,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ejq0j00": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejq0j00/",
          "text": "Yeah the rest I think is more or less par for the course with some old profs, but that's inappropriate in anyone's book. But I mainly commented here to say: great username!",
          "author": "l_lecrup",
          "created": 1553935730,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ejoa4ds": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejoa4ds/",
      "text": "Wow, I thought this post was going to be about a professor forgetting to grade assignments or forgetting to show up to class a couple of times...but if he's taking his pants off in class and thought that he was supposed to be teaching an extension of the previous semester, that's a huge red flag that there is something seriously wrong with his mental state.\n\nGo to the dean of the college.",
      "author": "reudude",
      "created": 1553881531,
      "upvotes": 80,
      "replies": {}
    },
    "ejo5hk9": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejo5hk9/",
      "text": "If you see it, his colleagues probably do too.  It’s not uncommon for people developing dementia to be in total denial and/or to be incapable of realizing their skills are declining.  \n\nI guess this discussion is pretty much the same as the “when do you take grandpa’s drivers license away” issue, and it’s difficult and largely unresolved.  However, the no-pants thing might have crossed a red line.",
      "author": "TurnsOutImAScientist",
      "created": 1553878750,
      "upvotes": 56,
      "replies": {
        "ejojqnj": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejojqnj/",
          "text": "[deleted]",
          "author": null,
          "created": 1553887348,
          "upvotes": 26,
          "replies": {
            "ejpakai": {
              "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejpakai/",
              "text": "I don't want to say that I wish I was there to see it, but... I sort of wish I was there to see it, because I can't even imagine what that entire scene would have been like.",
              "author": "tlumacz",
              "created": 1553906781,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ejoeev7": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejoeev7/",
      "text": ">this is what graduate school is like and to just get over it.\n\nLmao I've been in graduate school for a while and not once have I had a professor take their pants off in class\n\nGo extremely to the dean, ASAP. Go in person, but send an email detailing your concerns on which you CC the ombudsman, the department head - hell, the VP and the president as well. Be extremely polite and professional, but lay out everything that's happened - emphasizing the pants removal - and make it clear that you have already spoken to the department head but, since you do not feel that your concerns were adequately addressed and since the behavior under consideration is so egregious, you feel the need to escalate. Handing out other student's tests *has* to be a FERPA violation, so I would stress that as well.  The syllabus and lack of homework stuff is more easily dismissed; I'd mention it, but you need to stress the pants and the test thing. ",
      "author": "badskeleton",
      "created": 1553884159,
      "upvotes": 44,
      "replies": {
        "ejognf4": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejognf4/",
          "text": "This. An elderly absent-minded professor who doesn't give an eff because he's tenured is one thing; a professor absent-mindedly *taking off his pants in class* is another whole ballgame. This is very much what Deans of Faculty are for.",
          "author": "MisterSmeeee",
          "created": 1553885494,
          "upvotes": 31,
          "replies": {
            "ejok4si": {
              "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejok4si/",
              "text": "Yeah, if OP went to the dept head talking about how no tests or homework or syllabus had been given, I could see the head brushing it off. The pants bit... not so much. ",
              "author": "badskeleton",
              "created": 1553887576,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "ejoar6d": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejoar6d/",
      "text": "I would email the Chair again reiterating your concerns, and his lack of action. Copy the Dean of the College, the Provost, and the Title IX / Compliance coordinator (he took off his pants???). Do this via email so there is a record, in person conversations can be denied. \n\nI would have other members of the class do the same thing. If nothing happens and you get a grade without being properly evaluated then follow the grade appeal process with your school and demand records for why you got the grade you did",
      "author": "HoratiosGhost",
      "created": 1553881914,
      "upvotes": 16,
      "replies": {
        "ejofpse": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejofpse/",
          "text": "$30 that OP is not in the US",
          "author": "thegreenaquarium",
          "created": 1553884934,
          "upvotes": 7,
          "replies": {
            "ejohjyx": {
              "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejohjyx/",
              "text": "No bet.",
              "author": "HoratiosGhost",
              "created": 1553886030,
              "upvotes": 1,
              "replies": {
                "ejoiuie": {
                  "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejoiuie/",
                  "text": "Then why you writing comments about Title IX and all the rest of that US stuff, bro?",
                  "author": "thegreenaquarium",
                  "created": 1553886801,
                  "upvotes": -2,
                  "replies": {
                    "ejoua3e": {
                      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejoua3e/",
                      "text": "I am in the US with duel citizenship between here and my native land ",
                      "author": "throwAwayBird007",
                      "created": 1553894110,
                      "upvotes": 9,
                      "replies": {
                        "ejovvte": {
                          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejovvte/",
                          "text": "Want to get it resolved fast? Contact Title IX Coordinator about the pants.",
                          "author": "nbx909",
                          "created": 1553895205,
                          "upvotes": 9,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ejotjt5": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejotjt5/",
      "text": "> That’s what grad school is like, get over it.\n\nHi, grad student here and that’s complete **BS.** Just....no. He can’t even keep track of which class is which and apparently randomly takes his pants off (I assume because he thinks he’s at home?)....No.\n\nWhat the hell kind of grad school did the head of your dept go to? Sounds like it’s time to go over their head and go up the chain of command until somebody does something.\n\nLet’s have this professor retire with *some* shred of his dignity intact- those who ignore his incompetence as a way of “protecting” him are actually ensuring that he’s remembered as a scattered, mentally-feeble old man- a disservice to him.",
      "author": "OctoSevenTwo",
      "created": 1553893614,
      "upvotes": 15,
      "replies": {}
    },
    "ejpj0y3": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejpj0y3/",
      "text": "You say you're a junior but also graduate school?\n\nThis + the rest of the story sound like you're trolling.",
      "author": "Fibonacci35813",
      "created": 1553913913,
      "upvotes": 11,
      "replies": {
        "ejpnceg": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejpnceg/",
          "text": "This stood out to me too. ",
          "author": "starbellyXO",
          "created": 1553917828,
          "upvotes": 6,
          "replies": {}
        },
        "ejplwkg": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejplwkg/",
          "text": "Yep. There was an episode of the Good Wife where the senile old lawyer gets in trouble for taking his pants off before he naps on the couch in the middle of the day. Weird.",
          "author": "cuttlepuppet",
          "created": 1553916491,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ejoju3v": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejoju3v/",
      "text": "This is a major failure on the part of the chair. I've seen first hand two instances of dept. chairs having to intervene with faculty with early onset dementia. Started with forgetting to hold class and getting lost on campus. As [TurnsOutImAScientist](https://www.reddit.com/user/TurnsOutImAScientist) noted, other people in your dept. are probably aware this is happening. If you have a prof. you trust in the dept. I might contact them to let them know how bad things have gotten before moving up the chain of command.\n\nI'd also talk to someone about that B-.",
      "author": null,
      "created": 1553887405,
      "upvotes": 9,
      "replies": {}
    },
    "ejor8i6": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejor8i6/",
      "text": "Certainly reporting up is the way to go, but, as you do, try to consider the possibility that what the professor seems to be a person who needs help and is a kind of person who is very hard to help.  The chair probably knows this and just doesn't know what to do (probably at some point this professor was the chair's supervisor).\n\nCertainly what the chair is doing by ignoring this is wrong, but the thing happening to this professor is super terrifying to experience and observe (which is why denial is the usual response).\n\n*As a student* it shouldn't be your responsibility to do that work, but this professor could basically be any of us in 60 years.  The most significant problem is that people are unwilling to properly care for this person.  What's happening to you is inexcusable and really bad, but if the professor has dementia what's happening to you is really being done by the chair, the dean, etc.  If the professor has dementia, then probably the professor is not taking off the pants - the dementia is doing it.\n\nI say all this not just because it's true, but also because you're probably more likely to get help from other people if you communicate the issue with them in this way.",
      "author": "mediaisdelicious",
      "created": 1553892085,
      "upvotes": 8,
      "replies": {}
    },
    "ejos0ks": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejos0ks/",
      "text": "Oh dear.\n\nAll the advice already here is good. I want to add another voice to support that this isn't acceptable behavior--not from a prof or the administration. I'm sorry you've been put in this position.\n\nI hope you see traction on this issue soon. I'm sure the professor's family members are also concerned. I'd be concerned about this man getting safely to his own home, driving, cooking a meal and remembering to turn off the burner, etc. ",
      "author": "brownidegurl",
      "created": 1553892594,
      "upvotes": 6,
      "replies": {
        "ejou1ub": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejou1ub/",
          "text": "What's really scary, is that he still drives. I've heard stories of him just parking in the middle of the road, leaving the car running, then going to class as such. Also, there has been times when he has fallen during class and we've had to help him back up. It's not just grades, it is also his own safety. Everytime I'm in class I am afraid it will be his last. ",
          "author": "throwAwayBird007",
          "created": 1553893953,
          "upvotes": 6,
          "replies": {
            "ejpe4h6": {
              "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejpe4h6/",
              "text": "I have a parent with dementia, it is a terrible disease. I'm sorry you have been put in this position.\n\nYou will be doing the prof. a favor if you report this to the dean. This is a serious medical condition, and from what you have reported, he could be a danger to others and to himself. Don't take any of his behavior personally, and the best thing to do is to make sure others in power know about his condition. I would guess he may be isolated from family, and that others do not know the seriousness of his condition.",
              "author": "WaylonWillie",
              "created": 1553909706,
              "upvotes": 5,
              "replies": {}
            },
            "ejp6km9": {
              "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejp6km9/",
              "text": "If this is happening during the short duration of your class, it's happening elsewhere around campus. It's disgraceful that no one else has intervened.\n\nAgain, I'm sorry your the one who's shouldering the burden of reporting this, but you can also take comfort in the fact that you're doing right by this man who no one else seems to care for. \n\nPerhaps he has no family or support network to witness his decline. 3/4 of my grandparents died due to complications from falling, and it's the leading cause of death among the elderly. Your action might extend his life.",
              "author": "brownidegurl",
              "created": 1553903524,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ejopcl2": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejopcl2/",
      "text": ">...I'm afraid that this is going to be like the last time I had him and hes going to just give me a B-...\n\nWait, you took him for a second course? Or am I misunderstanding?",
      "author": "99_44_100percentpure",
      "created": 1553890868,
      "upvotes": 3,
      "replies": {
        "ejoqvih": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejoqvih/",
          "text": "Some course sequences are only taught by one person at some schools. Might be unavoidable for OP.",
          "author": "LordGobbletooth",
          "created": 1553891854,
          "upvotes": 6,
          "replies": {
            "ejougs6": {
              "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejougs6/",
              "text": "Very much true, the saddening part is, is that these classes are the prerequisite for all other courses.. the more saddening part, is that he teaches the majority of the other courses, so it's a cheat of an education, but sucks that I'm passionate for the subject matter. ",
              "author": "throwAwayBird007",
              "created": 1553894237,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ejotrg2": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejotrg2/",
          "text": "Yes, I have had to take classes from him before because he is the only one that will teach the sequence of classes that I need to graduate. Last time, it wasnt as bad, but this year he has sort ofist his mind. ",
          "author": "throwAwayBird007",
          "created": 1553893756,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ejomc9v": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejomc9v/",
      "text": "First, I'm so sorry the department chair blew you off and  that you have this on your plate. Second, it sounds from your message that maybe you're trying to carry this by yourself? \nEveryone here has said go to the next level up- I second that but want to add: maybe consider approaching them as a group. Other students in the class must feel the same way. I would either make an appointment with the dean with multiple classmates on your side, or maybe articulate what you've shared with us in a petition for action to be taken- have people sign their name and email etc. Just an idea! I wondered if it wouldn't be soothing to not be carrying the issue all on your own.",
      "author": null,
      "created": 1553888938,
      "upvotes": 2,
      "replies": {}
    },
    "ejo0rs2": {
      "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejo0rs2/",
      "text": "There's a professor at my university who keeps forgetting to give this class he taught three quarter ago final grades \n\nIf he has tenure I'm not sure if there is anything you *can* do except just keep reminding him",
      "author": null,
      "created": 1553875982,
      "upvotes": -12,
      "replies": {
        "ejo87pl": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejo87pl/",
          "text": "Tenure is not immunity for things like *taking your pants off in class*. Many people, including administrators and professors themselves, have a weird notion that tenure is a total and complete get-out-of-jail-free card - it is not, nor was it designed to be. The fact that people treat it as such is a danger to the tenure system itself.",
          "author": "guttata",
          "created": 1553880389,
          "upvotes": 22,
          "replies": {
            "ejos3n8": {
              "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejos3n8/",
              "text": "Oh, I missed that detail.  It sounds weird to say but OP is actually lucky that their professor took off his pants in class. It's not a get-out-of-jail-free card but if he didn't do something legally dubious, I doubt anything would happen at all. \n\nAnd even in this case, I'm not sure if anything will actually happen.\nAt my university, it took 10+ years for anything to be done about [a tenured professor](https://www.seattletimes.com/seattle-news/education/uw-researcher-michael-katze-fired-after-sexual-harassment-investigation/) that had many documented incidents of sexual harassment, which is decidedly far worse than just taking off your pants, so color me skeptical in regards to anything happening with OP's prof.\n",
              "author": null,
              "created": 1553892650,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ejo8o4i": {
          "link": "/r/AskAcademia/comments/b6yxqy/how_doi_go_about_with_dealing_with_a_senile/ejo8o4i/",
          "text": "While tenure protects from dismissal, failure to tender grades can be overridden or at least pressed from above, because after a certain amount of time those grades default (at most schools) and must be grieved. It is potentially a legal liability for the University as well, if it damages the prospects of a student or alum. If the dean or chair gets no results, talk to the ombuds, and/or start preparing a formal grievance by collecting your extant work and talking to whatever office handles student grievance or judicial matters. I've seen very few cases like yours, but when I have, we have ways of pressing compliance by getting the provost and general counsel involved. Your institution may vary, but I'd suggest you start this process before a full year has elapsed. Do so with a group, if it helps. ",
          "author": "khosikulu",
          "created": 1553880656,
          "upvotes": 6,
          "replies": {}
        }
      }
    }
  }
}