{
  "sid": "nfgkt9",
  "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/",
  "title:": "Transgender name changes and publication history",
  "text": "I've got a lot of hurdles to get over before this really becomes an issue for me, but it's on my mind this morning and I can't focus on chemistry until I just ask the question.\n\nI'm a second year grad student who recently realized that I am transgender. I was wondering how name changes effect publication records. I've got a couple first author papers out already, and (as soon as I get some crystals) I'll be submitting another paper in a couple months. I don't know whether I should keep publishing under my given name or if/when I should switch to my chosen name.\n\nI am out with my lab peers, but haven't talked to my PI yet.\n\nI guess I'm just looking for some reassurance from someone who has thought about these things before. I'm really new to understanding myself as transgender and it is very confusing.",
  "author": "sailingpj",
  "created": 1621358663,
  "updated": 1634082333,
  "over_18": false,
  "upvotes": 93,
  "upvote_ratio": 0.85,
  "comments": {
    "gyle109": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyle109/",
      "text": "Name changes are a bit of a problem and do make it harder for people to connect your publications with you. However, things are getting better. Some journals are enacting policies and APIs to allow people to retroactively change their names on their papers. Also you're early in your career so if you're gonna change your name now is the time. In addition, ORCID IDs allow you to ensure all your papers are attached to you regardless of variations/changes in name. I also think in terms of applying of academic positions you can explain it in the application, if you're OK outing yourself.\n\nThis is an issue for trans individuals but also for women who wish to change their name upon marriage or divorce. It's not ideal but as long as you're willing to be open about your former name you should be able to get round it without too much damage but definitely get yourself an ORCID ID.",
      "author": "ACatGod",
      "created": 1621359440,
      "upvotes": 90,
      "replies": {
        "gylg3hc": {
          "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gylg3hc/",
          "text": "I forgot about ORCID. That definitely helps. I already have two names there because one PI forgot to include my middle initial on the paper and I didn't catch it (I have a stupidly common last name). \n\nI think that thinking about potentially having to be that open with other people in the future is a significant portion of my anxiety about this right now. I just picked my new name this weekend and now my brain is betraying me and dragging me down all these side paths. \n\nYou are right. This is not uncommon, and it is still early. I'll for sure publish this next paper under my old name, then I probably have 8-12 months before it'll come up again. I can accept that and move on for right now.\n\nThank you! That was the prompting I needed to get unstuck.",
          "author": "sailingpj",
          "created": 1621360276,
          "upvotes": 36,
          "replies": {
            "gymnvhg": {
              "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymnvhg/",
              "text": "I ended up coming out to my PI a few weeks before submitting a paper. The advice I got was to switch over as quickly as possible to maximize publications under my chosen name (though, of course, you should do what you’re most comfortable with). \n\nMost journals do not require you to publish under your legal name, and you can set up a separate ORCID ID with that, linking to only newer papers. If you are able to change the name on existing publications, you can start pulling them in piecemeal. It’s not perfect, but it’ll help if you want to be stealth later on.\n\nAgain, do what’s best for you at the pace you’re most comfortable with. I imagine you’ve got enough on your plate as it is. Good luck! :)",
              "author": "kallistini",
              "created": 1621378789,
              "upvotes": 12,
              "replies": {
                "gymtxfb": {
                  "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymtxfb/",
                  "text": ">Most journals do not require you to publish under your legal name\n\nOr indeed require [that the author has a legal name at all](https://en.wikipedia.org/wiki/F._D._C._Willard).",
                  "author": "MoonlightsHand",
                  "created": 1621381749,
                  "upvotes": 11,
                  "replies": {
                    "gymvo5f": {
                      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymvo5f/",
                      "text": "Yeah, the physics and mathematics journals get pretty wild with that :P",
                      "author": "kallistini",
                      "created": 1621382609,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gylgqhr": {
              "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gylgqhr/",
              "text": "Good luck. In a few years I'm certain you will be able to change your name retrospectively on your current papers. Also on your CV you can fluff it a bit and not include the author names, just an abbreviated reference and mark the ones you're first author on with an asterisk.\n\nI hope it all goes well for you.",
              "author": "ACatGod",
              "created": 1621360534,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gylwkjj": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gylwkjj/",
      "text": "First, do it sooner rather than later. Second, a couple of my friends who have changed names for a variety of reasons have done it gradually, and it has worked well.\n\nAs an example, let's say old name is Ofirst Olast, and new name is Nfirst Nlast.\n\n* Assuming papers from prior to name change are all Ofirst Olast\n* Next paper is OfirstInitial Nfirst Nlast Olast\n* Next paper os Nfirst Nlast Olast\n* All subsequent papers are Nfirst Nlast\n\nAnd ORCID is key",
      "author": "cheesymm",
      "created": 1621366950,
      "upvotes": 16,
      "replies": {}
    },
    "gymcu8x": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymcu8x/",
      "text": "I kept my initials, so 99% of the time, no one notices at all. There's a few publications that had my full name right up on the byline, unfortunately. I've been trying to get some of the all-digital ones to change it, but they generally won't.\n\nI made the shift in between getting hired and going up for tenure. I submitted a document with my tenure packet stating that I had changed my name and that all papers published as Name A or Name B were me. My chair and dean were very supportive and that went over fine.\n\nIf you end up working at a university that's not so trans friendly, you'll be in a tougher position.\n\nThere's real benefit in getting the switch done, but if you've already got first author pubs, then you're going to want to refer to both names anyhow, so don't let that force you to make a change faster than you're ready. A name change is fairly expensive (varies by state and other stuff, but about 1.5k) and involves months of paperwork - you have to write to or meet with everyone who has your name on file for anything: car loan, credit monitoring, license, insurance, library, bank, dentist, etc. It probably took me about 3 months to get everything straight, and I had a relatively simple case. Not trying to scare you out of it - a name change was absolutely the right move for me. Just saying, do what works for you. If you want to wait a year, wait a year. If you want it now, go for it now.\n\nLastly, feel free to PM me if you want to chat. Trans academia seems a little scary at first, but there's more of us out there than you think. Welcome!",
      "author": "nezumipi",
      "created": 1621373614,
      "upvotes": 14,
      "replies": {
        "gymnofx": {
          "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymnofx/",
          "text": "Just a heads up, name changes do not always cost that much. I’m in the U.S. and have found the range to be more like $100-$400. It sucks that you had to pay more — I just wouldn’t want to scare people by leading them to believe 1.5k was standard.",
          "author": "artdco",
          "created": 1621378695,
          "upvotes": 5,
          "replies": {
            "gyn2una": {
              "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyn2una/",
              "text": "It depends on the state, various circumstances, even which judge you draw. There's apparently a judge on my slate who routinely makes trans people post notices in the paper, which tacks on another $500. A lot of places make you get searches for debts, warrants, etc. There's so much that's up to the judge's discretion.\n\nI worked with a lawyer because there's a guy in my area who specializes in LGBT law and does trans name changes as his bread-and-butter cases. He takes a lot of them sliding scale. I could pay and I wanted to give him business, so I spent a bit more. I probably could have managed it pro se but it was nice not to have to.",
              "author": "nezumipi",
              "created": 1621386190,
              "upvotes": 1,
              "replies": {
                "gynb73f": {
                  "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gynb73f/",
                  "text": "Ah, I see, you paid a lawyer. A very reasonable approach, but most people don’t.\n\nEdit: Also, $500 is not normally what it costs to publish in a newspaper. That would typically be $30-$50.",
                  "author": "artdco",
                  "created": 1621390320,
                  "upvotes": 5,
                  "replies": {}
                },
                "gyq9pna": {
                  "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyq9pna/",
                  "text": "Wow, the American approach is really expensive. In the UK, all you need is a piece of paper and two witnesses - then you can write down what name you're changing from and what your new name is. Doesn't cost anything at all, unless you need to buy some paper or a pen to write it down with.",
                  "author": "theredwoman95",
                  "created": 1621450018,
                  "upvotes": 1,
                  "replies": {
                    "gyqbbzx": {
                      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyqbbzx/",
                      "text": "The American way really leaves you at the mercy of judges. If the judge is fair-minded, it goes pretty well. If not...",
                      "author": "nezumipi",
                      "created": 1621450698,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gymhpjx": {
          "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymhpjx/",
          "text": "Thanks! Yeah, the paperwork is definitely daunting. My partner changed their last name when we got married less than two years ago so that process is fresh in my mind, and that was the easy way.",
          "author": "sailingpj",
          "created": 1621375824,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gymn8lg": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymn8lg/",
      "text": "I just want to mention this amazing, sadly recently-dead neuroscientist Ben Barres who transitioned at 40 after starting his lab. He wrote several articles discussing trans issues and gender in science including this: [https://www.nature.com/scitable/content/does-gender-matter-by-ben-a-barres-10602856/](https://www.nature.com/scitable/content/does-gender-matter-by-ben-a-barres-10602856/). He was also a huge name in neurobiology with a big lab in Stanford and a killer publication record despite switching his name (though he used the same initial, Barbara -> Ben).",
      "author": "Sant_Darshan",
      "created": 1621378479,
      "upvotes": 13,
      "replies": {}
    },
    "gyle3qy": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyle3qy/",
      "text": "ORCID is a system for keeping your publications all associated with the same researcher ID. \n\nKeep in mind, it may be terrifying with the added layer of coming out more publically as trans, but name changes happen all the time. People get married, divorced, immigrate, and so on. It's totally normal to change the name you publish under.",
      "author": "aggressive-teaspoon",
      "created": 1621359471,
      "upvotes": 14,
      "replies": {
        "gylehfe": {
          "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gylehfe/",
          "text": "Thanks! I forgot about ORCID. That definitely alleviates the administrative anxieties.",
          "author": "sailingpj",
          "created": 1621359623,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gylqlsb": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gylqlsb/",
      "text": "Depending what you change your name to, you could just leave an initial in place of previous name. I know several people who legally and professionally have different names. To stand true to your identity, if you change your name to the same as your middle, it’ll flow really nicely and no one will notice.\nS\nExample\nJohn L Doe\nJ Leaanne Doe",
      "author": "Cupcakequeen789",
      "created": 1621364515,
      "upvotes": 7,
      "replies": {}
    },
    "gymyfdk": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymyfdk/",
      "text": "I'm about to be in my seventh (and final, thank god) year and just changed my name a year or so ago - not legally, but in my university account so that my emails automatically now come from my chosen name, I changed my name and pronouns on my department bio, etc. I have several published papers under my old name, but I have the same initials, so in my CV, I just put the publications with my initials, same with conference presentations, etc.\n\nI have ORCID but only because I was prompted to get an ORCID ID when I published my last paper (under my old name though....), and I'm curious if anyone knows if I can change my name attached to my ORCID ID and then retroactively attach the ORCID ID to my previously published papers? It's not ideal, but I dread the thought of trying to contact journals to correct my name when I feel like they won't. I'm kicking myself for not using my initials the whole time since I knew I was trans before I even came to grad school (but I hadn't settled on a new name, and was very reluctant to come out to anyone in my department as a new grad student).",
      "author": null,
      "created": 1621383976,
      "upvotes": 3,
      "replies": {}
    },
    "gyn7rv8": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyn7rv8/",
      "text": "Most name changes in academia (only women who have been married in my experience) are something the author decides to keep as the initial name as a matter of consistency. So they will be \"Sarah Smith\" on publications, but all colleagues know them as \"Sarah Jones\".\n\nYour case I would guess to be more sensitive to your feelings, so I'd say just change it for future publications. You can link your old papers to your Google Scholar and Research Gate, etc. profiles with the ORCID.\n\nEdit: did I say something offensive here? I didn't intend to if that is the case.....",
      "author": "Darkwinged_Duck",
      "created": 1621388655,
      "upvotes": 4,
      "replies": {
        "gynlk77": {
          "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gynlk77/",
          "text": "Nothing offensive to me. I appreciate the context you provided!\n\nYeah, I'm even sure what my feelings on that are yet anyway. My brain insisted I ask this morning. I definitely have time to figure it out.",
          "author": "sailingpj",
          "created": 1621395539,
          "upvotes": 2,
          "replies": {
            "gynmwcp": {
              "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gynmwcp/",
              "text": "Cool, thanks. I don't usually worry about reddit \"karma\", but I noticed some downvotes which gave me the impression I said something tone-deaf.\n\nGood luck!",
              "author": "Darkwinged_Duck",
              "created": 1621396280,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gyo8ej9": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyo8ej9/",
      "text": "I don't know if you use APA, but they have a great page about this regarding referencing:\n\n[https://blog.apastyle.org/apastyle/2017/05/whats-in-a-name-inconsistent-formats-and-name-changes.html](https://blog.apastyle.org/apastyle/2017/05/whats-in-a-name-inconsistent-formats-and-name-changes.html)\n\nIt's in APA 6th, but I don't think it has changed in the latest one. Good luck!",
      "author": "molobodd",
      "created": 1621412009,
      "upvotes": 2,
      "replies": {}
    },
    "gyptre6": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyptre6/",
      "text": "Academic with a changed name here (a different reason than yours but I don’t think that will be relevant here)\n\nI think there are two issues that you might be worried about here and I’ll say that one is not a problem at all but the other might be a challenge. \n\nIn my experience the only situations where pib record *really* matters are those situations when you are providing a CV that you made yourself. Very rare circumstance where someone is making an actual decision about your career and basing it off of Google scholar or Web of Science or whatever\n\nSo in that case the problem of a paper being missed is nil; you just put all of your papers in the CV or PL and there they are. \n\nHowever this might bring up another issue which is that you might not want to emphasize your earlier name once you’ve changed it. Here there might be a bit of a problem, since it’s typically difficult to get the journals to retroactively change publication names. I know that some journals are open to this but this is far from universal. \n\nI’m aware of the issue that some who transition would like to remove references to the older name and I have heard in circumstances similar to yours that this presents certain challenges. \n\nAlso as other people have mentioned, services like ORCID and other disciplinary specific services can keep track of all of this. \n\nIn any case hope this helps",
      "author": "TenuredAcademic",
      "created": 1621443394,
      "upvotes": 2,
      "replies": {}
    },
    "gytl6yg": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gytl6yg/",
      "text": "Congratulations on the papers, \n\nChemist postdoc, not LGBT though. \n\nThe RSC allows name changes for many reasons so if you have published through them then you can contact them, their policy can be found here- https://www.rsc.org/journals-books-databases/journal-authors-reviewers/processes-policies/#Author-name-changes-after-publication\n\nACS also allows for name change request- https://publish.acs.org/publish/publishing_policies/name_change\n\nElsevier- https://www.elsevier.com/about/policies/inclusive-author-name-changes\n\nSpringer doesn't seem to have an easy method to do this. \n\nBit of further reading on policies- https://www.sciencemag.org/careers/2021/02/new-more-inclusive-journal-policies-ease-author-name-changes-published-papers \n\nHope this helps,\n\nedit- adding springer details here- https://group.springernature.com/gp/group/media/press-releases/springer-nature-introduces-trans-inclusive-name-change-policy/19305714?utm_medium=social&utm_content=organic&utm_source=twitter&utm_campaign=SpringerNature_&sf246792187=1",
      "author": "EnthusiasticHamster",
      "created": 1621518344,
      "upvotes": 2,
      "replies": {}
    },
    "gymnwau": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymnwau/",
      "text": "Thank you so much for posting! I’m NB and plan on changing my name. My wife and I also want to combine our last names, so a change has been in the plans for awhile. We’re saving up the ~$1,000 needed for the name change process. \n\nI’ve been hesitant about publishing specifically because I haven’t changed my name yet, so I really appreciate this post.",
      "author": "nerdhappyjq",
      "created": 1621378799,
      "upvotes": 4,
      "replies": {}
    },
    "gymihon": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymihon/",
      "text": "One of my trans colleagues cha he’s their name such that their initials didn’t change. You can also use an ORCID to link both of your names.",
      "author": "johnnydaggers",
      "created": 1621376197,
      "upvotes": 2,
      "replies": {}
    },
    "gyme1i4": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyme1i4/",
      "text": "In addition to ORCID, you have control of your Google Scholar record and can keep it up dated. This is general advice to anyone, name change for whatever reason or not.",
      "author": "TourmalineTart",
      "created": 1621374136,
      "upvotes": 1,
      "replies": {}
    },
    "gymubkd": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymubkd/",
      "text": "I’m late to the party, but more and more academic journals are allowing authors to retroactively change their names (with or without notifying the other authors). I’ve done this twice now for two peer-reviewed articles and it was super easy! It can be stressful to come out in the workplace, but (generally) academia is very trans friendly. Congrats on your name! What an exciting step.",
      "author": "TostitozZ",
      "created": 1621381938,
      "upvotes": 1,
      "replies": {}
    },
    "gymtom6": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymtom6/",
      "text": "A researcher identifier (like ORCID) solves this problem to some degree. Your publications will be associated with you, regardless of your name.",
      "author": "Broric",
      "created": 1621381627,
      "upvotes": 1,
      "replies": {}
    },
    "gyn6qor": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gyn6qor/",
      "text": "This may or may not be relevant to you depending on your subfield in STEM, but the American Geophysical Union (AGU) just released an update to their [name change policy](https://fromtheprow.agu.org/agu-announces-update-to-its-name-change-policy/). \n\n*The new update in our policy supports anyone who wishes to change their name on a previously published AGU publication for any reason. This includes but is not limited to marriage or divorce, religious conversion and alignment of gender identity. This policy aligns with that of and is supported by our publishing partner Wiley.*\n\nAGU continues to lead the way and I hope more journals/publishers follow suit.",
      "author": "rf439",
      "created": 1621388147,
      "upvotes": 1,
      "replies": {}
    },
    "gylml8g": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gylml8g/",
      "text": "I’m in a similar boat that’s further down the creek, so to speak. I’m already pretty established in my career and have a few first authors but it also just has my initials so I may have a way around it. I saw others comment about orcid id so I might try that. Are you in geology? You said crystals so I’m curious.",
      "author": "Bendy_Dwyatt",
      "created": 1621362902,
      "upvotes": 0,
      "replies": {
        "gylqcce": {
          "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gylqcce/",
          "text": "No, I'm in inorganic chemistry. I need a crystal structure of the reduced form of the complex I made so that we know what the structure is when it is reduced. So far our other data has been unconvincing, and the simulations/computations we've done have not clarified anything. So I get to learn how to crystallize a highly reactive, light and air sensitive compound. Fun stuff! \n\nInitials were something I thought about, but I didn't connect with any names that started with my original first initial.",
          "author": "sailingpj",
          "created": 1621364409,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gymp2lb": {
      "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gymp2lb/",
      "text": "[removed]",
      "author": null,
      "created": 1621379369,
      "upvotes": -10,
      "replies": {
        "gynn2qi": {
          "link": "/r/AskAcademia/comments/nfgkt9/transgender_name_changes_and_publication_history/gynn2qi/",
          "text": "Why am I being downvoted? Aren't I correct?",
          "author": "Parking_Injury_5579",
          "created": 1621396382,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}