{
  "sid": "9q5jbe",
  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/",
  "title:": "Professor overstepping personal boundaries?",
  "text": "I hope this is okay to post here. I’m a female grad student in a class with a male professor who is also on my thesis committee. This is my second class with this professor and he has always been extremely nice, professional, and encouraging. However, recently I’ve picked up on certain behaviors that give me some pause. \n\nA few weeks ago he began to text me on my cellphone on the weekends. I did not give him my number - he presumably got it from my email signature. He has kept it mostly school related but did call my cellphone and ended the conversation with random personal questions. He has also recently added me on Facebook. Additionally a male classmate and I had to have similar one-on-one meetings to discuss our final projects and I told the male classmate to expect to field lots of personal questions from this professor (since that was my experience in our meeting). My classmate came back saying that did not happen at all. However a female classmate of mine also experienced the same treatment as I did with lots of questions and compliments in the second half of the meeting that were off topic from the project. \n\nThe attention does not feel sexual in anyway but does feel excessive and gender specific. Should I say something to someone in the hopes that it doesn’t progress or should I just stay observant and not make a big deal? Has anyone experienced this? \n\nI received another text from him today asking why I wasn’t at an on campus event I had registered for. It all seems fairly innocuous but I feel sensitive to it. \n\nUPDATE: Thank you all for your feedback, it’s very helpful. I am removing my cellphone from my email signature, I completely agree that if I don’t want people to contact me I shouldn’t provide it. I’ve had my cellphone on my email signature for years without issue so this is new territory. \n\nI also want to clarify that personal questions varied from, “Do you have siblings? What do your parents do?” to “How did you pay for your undergraduate degree?” to “Why are you wanting to live in that city after graduation, do you have family or a boyfriend there?” What made them more unnerving is that they came out of nowhere with no prompting. We would be talking about something related to work and then he would jump to asking me a fairly specific question about my personal life. When we talked on the phone he asked me if I was going to a music festival and if I knew how he could get tickets. It seemed more like a question for Google than for me. The conversation also had no urgency at all and I was going to see him in class the next day. Like I said, they are fairly innocuous but I do not have a strong personal relationship with him and this strikes me as a strange way to build one. I have had good friendships with colleagues and professionals before but this is not how I experienced forming those relationships. \n\nAs for the small sample size, I understand that not a lot can be gleaned from the experience of three people. However, I can say that the other female independently arrived at a feeling of discomfort in her interactions with him as well. I would say the three of us are equally engaged and ambitious, so there’s no reason I can see that the professor would have to not offer the same treatment to my male classmate. ",
  "author": null,
  "created": 1540144239,
  "updated": 1634082352,
  "over_18": false,
  "upvotes": 93,
  "upvote_ratio": 0.93,
  "comments": {
    "e86v85n": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86v85n/",
      "text": "Document, document, document, but also be clear about boundaries you would like to have. If you don't want to get texts about academic stuff on the weekends, say that. You can frame it as \"work-life balance\" or whatever you want, but make it crystal clear. ",
      "author": "ProfMamaByrd",
      "created": 1540147151,
      "upvotes": 118,
      "replies": {}
    },
    "e86wd2n": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86wd2n/",
      "text": "It does sound like he’s stepping over some boundaries, but my two cents is to not put your cell phone number in your email signature if you are not comfortable with the potential of every single person you would ever email using it to contact you.",
      "author": "WalkingArmory",
      "created": 1540148075,
      "upvotes": 90,
      "replies": {
        "e8789v2": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e8789v2/",
          "text": "Contact information you put in an email signature are... ways to contact you. If you have your cell phone number there, that means it's okay to call you on your cell phone.\n\nAnd I hope OP did not accept the Facebook invitation.\n\n**IF** the Professor has some hidden intent, actions like this can be perceived as \"positive responses\".",
          "author": "anotherbozo",
          "created": 1540157897,
          "upvotes": 13,
          "replies": {}
        },
        "e87lpbg": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87lpbg/",
          "text": "I always have my cell number in my internal signature but I remove it for anything leaving my employer because honestly, if you don't work directly with me, I don't care that much.\n\nAs a guy, I've only ever gotten two calls to that number ever and both were entirely professional.",
          "author": "hardolaf",
          "created": 1540171081,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e87jv75": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87jv75/",
      "text": "It sounds as if he has taken a great liking to you and seems to want to form some kind of (unsollicited) personal relationship. Although his questions per se do not seem to be overly creepy (yet), the timing (weekends) and excessive personal nature of his texts and calls seem to be way off. In any case, **whether his intentions are good or bad, the biggest issue is that it makes you feel uncomfortable**. \n\nTo protect yourself in case his behavior persists, document all your interactions, reduce 'personal' contact time (ignore his calls, respond to work-related questions only), and state your work boundaries (no contact during weekends, unless urgent). For the latter, sometimes a more subtle approach works better to get your point across (in a joking or witty manner) without your relationship turning sour. In any case, trust your gut and tell someone you trust (from the department).",
      "author": "wigglypotatoes",
      "created": 1540169209,
      "upvotes": 10,
      "replies": {
        "e87x1q7": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87x1q7/",
          "text": "Your style of typing reminds me of someone. weird",
          "author": "itshighnoooon",
          "created": 1540183653,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e86v14h": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86v14h/",
      "text": "That sounds inappropriately intrusive to me. I have only ever been texted by my advisor when it was relevant to the work, and have never had anyone on my committee call me or ask personal questions.",
      "author": "Weaselpanties",
      "created": 1540146994,
      "upvotes": 39,
      "replies": {}
    },
    "e87jbny": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87jbny/",
      "text": "You're clearly uncomfortable, and you shouldn't ignore that feeling, no matter what anyone here is saying. I would suggest you put up some boundaries and ask if he could email rather than use your personal number, unless   something is urgent. You can say that you'd like to limit time spent on your phone, or something like that, and the removal of your phone number from your signature will support that.   \n\n\nIf he reacts negatively, that is a red flag to me. If he doesn't, then hopefully that's the last of it. ",
      "author": "rafjel",
      "created": 1540168665,
      "upvotes": 9,
      "replies": {}
    },
    "e86stuz": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86stuz/",
      "text": "He sounds like a creep. Definitely stay alert, document, try not to meet with him in private (and if you do, keep the door open), and keep the texting frequency down (respond, but with a long delay). If you have a trusted person to talk to about this, that's a good idea (in a non-accusatory manner though); but you don't really have enough for a case and starting shit with professors is not a good idea.",
      "author": "thegreenaquarium",
      "created": 1540145243,
      "upvotes": 41,
      "replies": {
        "e86w97p": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86w97p/",
          "text": "> but you don't really have enough for a case and starting shit with professors is not a good idea.\n\nWhich is the exact problem with academia, there is really no reason a Professor should be texting students on their personal devices at all, especially if they haven't been given their number, Email exists for professional communication for a reason. ",
          "author": "Psyc5",
          "created": 1540147989,
          "upvotes": 27,
          "replies": {
            "e86zaq1": {
              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86zaq1/",
              "text": "I actually find this attitude sort of surprising and wouldn't mind hearing from others on the matter.  Yeah, it's weird in this case because the student did not officially give out her number.  But I text my grad students all the time about work related stuff and they text me:  \"can't meet today, sick\" or \"the lab is flooding again, come upstairs.\"  I feel like labeling an entire mode of communication as \"inappropriate\" in all circumstances, particularly when it is usually the fastest way to get a hold of younger people, sort of odd.",
              "author": "DocGlabella",
              "created": 1540150448,
              "upvotes": 51,
              "replies": {
                "e87gtlg": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87gtlg/",
                  "text": "FWIW, I use it the same way as you do, for quick messages to my PhD students and RAs. Nothing long winded back and forth, but certainly for “running late today” or “don’t forget to send me that spreadsheet” stuff. Makes sense to me and as long as you establish some clear boundaries, can’t see how it’s different than an email or a phone call, it’s just a different (more short form and quick) form of communication.",
                  "author": "ranglin",
                  "created": 1540166144,
                  "upvotes": 4,
                  "replies": {}
                },
                "e888ru2": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e888ru2/",
                  "text": "I absolutely use texting the same way. All my grad students have my number, as do some colleagues, and a handful of undergrad ta’s and ra’s. One of the main reasons for this is I don’t like to put my school/work email on my phone, or I’d never stop working. ",
                  "author": "perceptionactionprof",
                  "created": 1540206260,
                  "upvotes": 3,
                  "replies": {}
                },
                "e876oaa": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e876oaa/",
                  "text": "The only time that I have communicated with students in this way is at conferences, where we are arranging to meet and email and face to face is harder.\n\nI'm not the best person to talk about this, but I'd find text communication a bit odd in OP's context, though it needn't be menacing.",
                  "author": "another_secret_prof",
                  "created": 1540156465,
                  "upvotes": 4,
                  "replies": {}
                },
                "e87lm7q": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87lm7q/",
                  "text": "The case you're describing sounds fine to me. My first thought was what if a class had some sort of active or field component. Using text would be the most sensible way to sort out logistics. Overall I wouldn't have an issue getting texts from professors.\n\n&#x200B;\n\nOf course, important caveats are - They should be work related, not personal. I should probably have been asked for the number. It should be something that requires timely action (i.e don't start texting me snippets about vector bundles.) I think this guy is violating all of that which is what makes it different.",
                  "author": "usualtoken",
                  "created": 1540170994,
                  "upvotes": 2,
                  "replies": {}
                },
                "e873ib5": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e873ib5/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1540153772,
                  "upvotes": 4,
                  "replies": {
                    "e87gmd6": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87gmd6/",
                      "text": "I’d never give my number to undergrads for the same reason, but do it all the time with PhD students for the reasons outlined above.",
                      "author": "ranglin",
                      "created": 1540165938,
                      "upvotes": 4,
                      "replies": {}
                    },
                    "e8756eq": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e8756eq/",
                      "text": "> I never give my number out to students, nor would I want theirs. \n\nI agree, but in this case the phone was in the email signature, which makes it fair information. I mean, it's like being angry that something called you Bill if you sign your emails Bill. The signature is an invitation for a contact and a follow-up. (And I personally would never put my home or cell phone there)",
                      "author": "ampanmdagaba",
                      "created": 1540155149,
                      "upvotes": 10,
                      "replies": {
                        "e879dp5": {
                          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e879dp5/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1540158940,
                          "upvotes": 3,
                          "replies": {
                            "e87r4hi": {
                              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87r4hi/",
                              "text": "Yep, I first answered, then scrolled down, and saw many people saying the same thing. Which made feel better, and more rooted in reality =]",
                              "author": "ampanmdagaba",
                              "created": 1540176544,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e870mjm": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e870mjm/",
                  "text": "It is inappropriate because there is an easily accessible, traceable, and accountable official line of communication for work.\n\nIf your students aren't checking their email regularly enough then they need to be informed of that, as would be the case if they are sick, why would they have not informed you by email that they were sick? Allowing for an official record of it. The problem is academics have always been academics and don't understand \"professional\" conduct, you wouldn't just not turn up to work without emailing at least.\n\nAs for a lab flooding, that is more of an emergency situation and would be when you would actually use it, the fact you say again though means you either have a maintenance issue or people aren't using equipment improperly which is just bad management. ",
                  "author": "Psyc5",
                  "created": 1540151490,
                  "upvotes": -8,
                  "replies": {
                    "e871ggw": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e871ggw/",
                      "text": "It’s interesting to me how different this is in medical schools. MD students, clinical fellows in research electives, and MD/PhD students in particular heavily rely on texting me and vice versa. I suppose it’s because schedules are less predictable and clinics or surgeries frequently run long or end early so meeting can be pushed back or pulled forward as time permits. ",
                      "author": null,
                      "created": 1540152111,
                      "upvotes": 10,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "e86x5q1": {
              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86x5q1/",
              "text": "I do have the cell numbers of grad students & post docs who work directly with me and they have mine, but it's a \"for emergencies only\" type of thing... for example, if they were in the lab over the weekend, and I was not, and something happened that I needed to be informed about. Absolutely not for personal communication. ",
              "author": "Argos_the_Dog",
              "created": 1540148719,
              "upvotes": 22,
              "replies": {
                "e86xk1x": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86xk1x/",
                  "text": "Yes, which have been given to you, and you essentially don't use.",
                  "author": "Psyc5",
                  "created": 1540149043,
                  "upvotes": 7,
                  "replies": {
                    "e86z8hp": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86z8hp/",
                      "text": "Yes I would expect them to use it only in a “the lab just burned down” kind of situation...",
                      "author": "Argos_the_Dog",
                      "created": 1540150395,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "e86xlu8": {
              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86xlu8/",
              "text": "> there is really no reason a Professor should be texting students on their personal devices at all\n\nExcept that it's more convenient for a lot of people. It doesn't make sense to ban whole communication technologies just because some people who use them are creeps or have poor boundaries. If we banned things because some people using them were predators, we'd have to cancel society.",
              "author": "thegreenaquarium",
              "created": 1540149084,
              "upvotes": 17,
              "replies": {
                "e87239f": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87239f/",
                  "text": "Slack, Discord, other group messaging applications solve all of this. Push notifications can be utilized the same as texts without the use of a phone number and the messaging is still documented.\n\nI think it's definitely an odd cultural norm that text via SMS is personal but group messaging applications are deemed ok, but that's just how it is I guess?",
                  "author": "FakeyFaked",
                  "created": 1540152619,
                  "upvotes": 1,
                  "replies": {
                    "e873awa": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e873awa/",
                      "text": "Yeah, I'm not sure that there is a difference between texting and messaging apps (but the people who feel adamantly could let me know if not). I am talking about texting, whatsapp, viber, skype all in conjunction.",
                      "author": "thegreenaquarium",
                      "created": 1540153602,
                      "upvotes": 7,
                      "replies": {
                        "e874o58": {
                          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e874o58/",
                          "text": "there is definitely a difference. I can turn off my slack notifications, or not download it on my next device when I move on, but if you text me and you're weird about it, now I have to worry that you can find me forever unless I do the much more arduous task of changing my phone number. Messaging apps are a level of protection.",
                          "author": "jenesaisquoi",
                          "created": 1540154727,
                          "upvotes": 5,
                          "replies": {
                            "e876dop": {
                              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e876dop/",
                              "text": "fair enough.",
                              "author": "thegreenaquarium",
                              "created": 1540156197,
                              "upvotes": 2,
                              "replies": {}
                            },
                            "e87k9g4": {
                              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87k9g4/",
                              "text": "You can very easily block messages from a phone number",
                              "author": "Durkano",
                              "created": 1540169614,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e86xw48": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86xw48/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1540149313,
                  "upvotes": -4,
                  "replies": {
                    "e86y6a9": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86y6a9/",
                      "text": "> you are invading someone's personal time without their permission\n\nI'm not clear on how this is the case.\n\n> everyone can choose to check their email on their phone out of hours if they would like, they also can choose not to.\n\nExactly. You can choose not to check your email - and you can also choose not to check your messages or answer phone calls. You can even choose not to answer certain phone calls while answering others. I'm not sure how people using non-email to contact you at all limits your scope of options.\n\n> \nThere is no reason to contact people on personal devices for professional matters, if you are so disorganised that you need to regularly contact people for an \"emergency\", the problem is your own time management.\n\nI mean, you live your life how you want to; I'm just standing up here for people who might want to live theirs differently from yours. I am unconvinced that your way is the right way, and implying untoward things about me isn't helping /:",
                      "author": "thegreenaquarium",
                      "created": 1540149542,
                      "upvotes": 12,
                      "replies": {
                        "e86zu9z": {
                          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86zu9z/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1540150895,
                          "upvotes": -1,
                          "replies": {
                            "e8705ga": {
                              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e8705ga/",
                              "text": "> It is intrusive and inappropriate to text a student if they haven't given you explicit permission to use their personal cellphone number as a means of contacting them for anything other than emergencies.\n\nYep, I agree. This is not what we're talking about.\n\n> I personally wouldn't rely on texting as a method of communicating with my students unless there was an explicit conversation about it before hand, a clear understanding of boundaries and how it should and shouldn't be used, and not unless I also gave them the option to opt out of this kind of communication\n\nYep, also agree. Still not what we're talking about.\n\n> \nThe fact that you think that the individual convenience of the faculty member should trump all of that context is bizarre to me.\n\n...that's not what I said. \n\nI am responding to a comment saying that texting and phone calls should *never* be used, with no caveats. I am responding to say that this policy is needlessly draconian, which I think I have made abundantly clear. I'm not sure why you are choosing to misread me so egregiously.",
                              "author": "thegreenaquarium",
                              "created": 1540151137,
                              "upvotes": 5,
                              "replies": {
                                "e871o9u": {
                                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e871o9u/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1540152284,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "e86yrzf": {
                          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86yrzf/",
                          "text": "[removed]",
                          "author": null,
                          "created": 1540150026,
                          "upvotes": -4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e885s47": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e885s47/",
      "text": "I feel like a lot of people are attacking you. You can have your phone number in your e-mail and not want professors to call or text you on it. I don't think that's weird. I'm a female grad student. I think that'd be weird. I posted a similar thing about male professors taking photos of me on their cell phones and got a similar reaction of people blaming me, saying it wasn't because I was a woman, it's my responsibility to tell them to stop ,etc. I feel for you. I'd just try to keep my distance and not let it get to you but if it does maybe say something. ",
      "author": "rrtaylor222",
      "created": 1540200185,
      "upvotes": 9,
      "replies": {
        "e887v2o": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e887v2o/",
          "text": "Right, from my experience it is not that uncommon to include your phone number in the e-mail signature. In any case, some of the comments asking why OP put her number up seem to (unintentionally) put part of the blame on her (akin to the classic victim blaming of \"why did you wear that short skirt?\") -- she was not \"asking for it\" nor was the professor justified to make unsollicited calls during the weekend and ask all sorts of personal questions.\n\nTo add, I have had a similar experience when I was an undergraduate where a male professor randomly took pictures of me during a one-on-one meeting, saying that \"he wanted to show it to his colleagues\" as some sort of introduction. I was caught off guard and it did make me feel uncomfortable. To this day I still have no idea if he really shared the pictures for these purpose.",
          "author": "wigglypotatoes",
          "created": 1540204580,
          "upvotes": 4,
          "replies": {
            "e88zgj4": {
              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e88zgj4/",
              "text": "Totally agree that you can have your phone number in your email and still not want a prof to use it. Also agree that asking why OP put her phone number in the email is a little akin to asking \"why did you wear that short skirt?\".\n\nI still feel like not putting your phone number in your email signature is a good idea though, I'd like to think that advice is more of the \"avoid walking through a bad neighborhood alone at night\" sort of advice. Having your phone number available isn't asking for harassment or attention, but not having it up will mean you don't have to worry about people using it at all! \n\nI'm a man and I don't give out my phone number to people until they need it just because I don't want people bothering me!",
              "author": "sgillen04",
              "created": 1540232226,
              "upvotes": 0,
              "replies": {
                "e89bifx": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e89bifx/",
                  "text": "I don't see how this is like the short skirt thing at all. If you're not okay with a committee member contacting you by cellphone, why is it in your email signature in the first place? The vast, vast majority of people you email you know less well than someone on your committee.\n\nThe whole idea that this is predatory is also a bit suspect. Nothing said is a red flag, and the only evidence of it being gender based is a whopping sample size of 1. Obviously OP is in the right if she wants to tell him to stop texting her personal questions, but there's nothing wrong with a professor becoming friends with a grad student.",
                  "author": "Mezmorizor",
                  "created": 1540242023,
                  "upvotes": 2,
                  "replies": {
                    "e8aa0w5": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e8aa0w5/",
                      "text": "I actually missed that this prof was on the OP's committee, which does actually change how I look at this a bit. \n\nI also don't think this behavior is predatory, nor do I see any big red flags. It does seem clear the OP is uncomfortable though, and I think that should be considered too when thinking about the situation. \n\nI guess we both agree that the OP probably should remove their phone number from their signature, if this sort of thing makes them uncomfortable. ",
                      "author": "sgillen04",
                      "created": 1540279248,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e8827v9": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e8827v9/",
      "text": "Does your uni have a women's representative or the like?    \nSkimmed the comments and seems like most has been said already. Putting your number in your signature doesn't allow him to do this; and, yes, you shouldn't pick up fights with profs - but if he is overstepping your boundaries, you don't need to endure it without saying a word! His behavior is anything but normal or ok - I mean, wtf!",
      "author": "LuciaTalita",
      "created": 1540192445,
      "upvotes": 3,
      "replies": {}
    },
    "e88edvk": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e88edvk/",
      "text": "\"When someone shows you who they are, believe them the first time.\" -- Maya Angelou",
      "author": "iugameprof",
      "created": 1540214021,
      "upvotes": 3,
      "replies": {}
    },
    "e88ikas": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e88ikas/",
      "text": "He's asking you (subtly) about whether nyou have a boyfriend and asking about you moving to another place. This is bordering on the edge of creepy, and the most important part is that you feel uncomfortable, whether people commenting here and blaming you think it is or not.\n\nYou are allowed to push back on the form of communication, the topic of communication, or anything else. I understand you must be worried about the consequences, but if you document everything, you can show that chain of events to someone if you choose to.\n\nYou can also speak to people about the situation (not just a hypothetical) and not file a report. They can hold onto the past/documentation on file and still not necessarily go forward with it. Just so you know.",
      "author": "0102030405",
      "created": 1540218228,
      "upvotes": 3,
      "replies": {}
    },
    "e87416h": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87416h/",
      "text": "However you deal with this situation, I would suggest you remove your personal cell number from your professional email signature. ",
      "author": "aprildianne1",
      "created": 1540154205,
      "upvotes": 6,
      "replies": {}
    },
    "e86x4km": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86x4km/",
      "text": "[deleted]",
      "author": null,
      "created": 1540148692,
      "upvotes": 11,
      "replies": {
        "e87w5t2": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87w5t2/",
          "text": ">I don't think there is anything to document\n\nYet. It's weird that this is only happening with female students. Even just a few is enough to raise defenses a bit. Nobody here is saying she needs to lambast him on social media as a Predator, but it's still worthwhile to document conversations that seem more personal than they should be. Hopefully it doesn't amount to anything, but if something is going on, it will be good to have the documentation from the beginning.",
          "author": "ProbabilisticWorld",
          "created": 1540182430,
          "upvotes": 5,
          "replies": {}
        },
        "e874uf2": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e874uf2/",
          "text": "It's worrying if the only personal relationships being built are with female graduate students.  There were enough red flags in the post to warrant keeping a professional distance.",
          "author": "riricide",
          "created": 1540154868,
          "upvotes": 6,
          "replies": {
            "e875hfv": {
              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e875hfv/",
              "text": "[deleted]",
              "author": null,
              "created": 1540155421,
              "upvotes": 6,
              "replies": {
                "e878v0w": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e878v0w/",
                  "text": "I agree, there isn't a large enough sample size to determine if it was gender specific. Personal questions are fine within the limits of small talk too. For me the red flag was (1) texting/calling the student (2) without explicit permission (3) on weekends (4) about things that can be discussed in a regular work meeting. He could easily have emailed her about project related questions or scheduled an office meeting. His intentions might be good, but she also has the right to set her own personal boundaries to her comfort level.",
                  "author": "riricide",
                  "created": 1540158443,
                  "upvotes": 6,
                  "replies": {
                    "e87ct6c": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87ct6c/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1540162235,
                      "upvotes": 0,
                      "replies": {
                        "e87y416": {
                          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87y416/",
                          "text": ">The world of academics is full of nepotism (whether we like it of not) and having a senior professor taking a personal interest in you and your work can open a lot of future doors. \n\nThis is exactly how creepers who use their position of power to enable sexual misconduct get away with it. People minimize their behaviour, and both the minimizers and the harassers make it clear to victims that they can either put up with it or risk damaging their careers if they speak up or walk away.",
                          "author": "Unicormfarts",
                          "created": 1540185248,
                          "upvotes": 6,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e87556u": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87556u/",
          "text": "Agree. I had (and still have) great working and personal relationships with everyone on my committee (two men and one woman). I honestly can't think of a single meeting that didn't have at least *some* personal conversation. I mean... it's part of building and maintaining relationships.  It's kind of weird how much people are jumping down this guy's throat over seemingly normal behavior....",
          "author": "hochizo",
          "created": 1540155120,
          "upvotes": 3,
          "replies": {
            "e88wujv": {
              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e88wujv/",
              "text": "Personal questions in meeting are fine you can see the tone and it's \"a part of building and maintaining relationships\" everyone's there and it's nice but on texts on weekends is a bit weird even if nothing is out of line (yet). You might have heard it's better to take precaution than cure which if needed would definitely be a \"burned bridge\".\n\nAlso, never discount someone's experience because you're not in the situation and no one is dumb enough to feel awkward when it's such an important relationship unless there's something awkward. I personally wouldn't like building \"professional\" relationships over texting! It's kind of unprofessional.",
              "author": "Maha_",
              "created": 1540230148,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "e8evio0": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e8evio0/",
      "text": "This story makes me extremely nervous. The power dynamics between full-fledged academics and grad students are ripe for abuse. This type of thing is definitely inappropriate and could definitely escalate- and because he is on your thesis committee it may be difficult for you to feel comfortable speaking up- he may be banking on this. I would urge you to get away from him if possible. Don't minimize your feelings of being uncomfortable. I agree something is likely wrong here.",
      "author": "double-park",
      "created": 1540450711,
      "upvotes": 2,
      "replies": {}
    },
    "e86y1t6": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86y1t6/",
      "text": "Put a simple stop to it: tell him that you'd prefer to use the school email for all communication as you don't use texts except with family. Unless he's sending out mass texts with class info for some reason that should take care of it.\n\nI give my undergrad research assistants and students with whom I travel or do fieldwork my cell number so we can be in contact in emergencies. No other reason for faculty and students to be texting IMO, esp when email exists, is clearer, and is less intrusive.\n\nAlso: why put your cell number in your email? I don't give mine to anyone at work other than my admin assistant...I don't want calls from students or anyone related to work.",
      "author": "SnowblindAlbino",
      "created": 1540149443,
      "upvotes": 5,
      "replies": {}
    },
    "e875fjv": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e875fjv/",
      "text": "This is definitely overstepping bounds. It sounds like he is paying special attention to you in a way that feels like a future threat. I agree with everyone saying to change your email signature--cell phone calls/texts are much more personal now that people can reach us via messenging apps that add a layer of what feels like safety. \n\nI would definitely push back on the cell-phone communication by saying \"I would prefer to only communicate with professional colleagues via email.\" I would also talk to my advisor about it, because I have a pretty close relationship with him and I feel that I could trust him to subtly push back on this professor and provide a buffer between me and someone invading my life. How did your advisor respond to the personal questions he/she saw you be asked in committee meeting? ",
      "author": "jenesaisquoi",
      "created": 1540155374,
      "upvotes": 4,
      "replies": {
        "e87pgta": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87pgta/",
          "text": "Thanks for your reply - I have yet to have a full committee meeting. At the moment all meetings have strictly been one-on-one. I am considering talking to my director, who I trust, but do not want to trigger any action/reporting. Maybe I can bring it up as a hypothetical situation and get a read on what his response might be. \n\nI sincerely appreciate all of the feedback from everyone here. ",
          "author": null,
          "created": 1540174852,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e86w5gd": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86w5gd/",
      "text": "Seems like you have a very small sample size: has the male student taken multiple classes with this prof. as you have?\n\nIt may be that he sees you as a potential colleague. ",
      "author": "SeeCF",
      "created": 1540147901,
      "upvotes": 2,
      "replies": {
        "e874uo2": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e874uo2/",
          "text": "eeehhh is a student really a potential colleague until after they've defended? There's a power dynamic that makes personal questions very invasive--a potential colleague could say \"I don't like to talk about my personal life\" but you feel pressure to be nice and obliging to someone who controls your thesis passage.",
          "author": "jenesaisquoi",
          "created": 1540154874,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "e86ww7e": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86ww7e/",
      "text": "This sounds very shady. As others have said, be clear about your boundaries, document incidents that have happened, don't respond beyond the minimum. His behavior is inappropriate. ",
      "author": "GrandmaMabelGrey",
      "created": 1540148502,
      "upvotes": 2,
      "replies": {
        "e872g0g": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e872g0g/",
          "text": "Agreed. This is pretty clearly over the line.",
          "author": "ProfessorHomeBrew",
          "created": 1540152911,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "e86w6sl": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86w6sl/",
      "text": "I’m not sure what his motives are. You might be in a discipline where there aren’t a lot of women and he may be trying to encourage you. Sounds like it is based in your sex, but that doesn’t mean he has some bad motive. As others have noted, wait and see how it plays out. Might be nothing.",
      "author": "beaubaez",
      "created": 1540147933,
      "upvotes": 1,
      "replies": {
        "e86wane": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86wane/",
          "text": "I still wouldn't enjoy lots of personal questions from a colleague.",
          "author": "izvin",
          "created": 1540148021,
          "upvotes": 7,
          "replies": {
            "e86yxqj": {
              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e86yxqj/",
              "text": "You don't have colleagues you are friendly with?  I ask (and am asked) about the family lives of colleagues all the time.  It's one thing to ask about someone's sex life; it's another to ask how their kids are doing.",
              "author": "DocGlabella",
              "created": 1540150150,
              "upvotes": 6,
              "replies": {
                "e87y9tt": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87y9tt/",
                  "text": "Friendliness is one thing, people who ask a bunch of personal questions out of the blue is another. I have a colleague who is like this; she asks a lot of personal questions in a really blunt way, and then she shares any answers with all kinds of people. I think she likes feeling like she knows a lot of info but I don't find it friendly. She also asks these kinds of questions of third parties and again shares the info as if she got it from the source, which I find weird. Conversation is not asking a bunch of blunt questions.",
                  "author": "Unicormfarts",
                  "created": 1540185499,
                  "upvotes": 5,
                  "replies": {}
                },
                "e8717sx": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e8717sx/",
                  "text": "Some small talk is to be expected when you meet with a colleague, but do your colleagues text you at night specifically to ask you about your family life? \n\nI'm also uncomfortable with the assumption that some people seem to be making, that OP is overreacting. The tells for someone being overfriendly are usually subtle and hard to put into words, but you can feel it when you're in that situation - and even if OP were overreacting, it's completely within her rights imo not to have personal conversations (whatever she considers personal) with her colleagues.",
                  "author": "thegreenaquarium",
                  "created": 1540151934,
                  "upvotes": 8,
                  "replies": {
                    "e871ozr": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e871ozr/",
                      "text": "I guess that's fair.  The OP should certainly define her own boundaries and enforce those.  My discomfort in this case lies with potentially getting someone in trouble for asking too many completely non-sexual questions (particularly without ever giving fair warning that those questions are undesired).  ",
                      "author": "DocGlabella",
                      "created": 1540152300,
                      "upvotes": 6,
                      "replies": {
                        "e871ycc": {
                          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e871ycc/",
                          "text": "I don't really see an axis along which the professor could get in trouble here. It's not illegal to text your students.\n\nThat said, cozying up to you with these types of innocuous interactions is a common tactic for people with ulterior motives. I'd wager every woman has had at least one guy be really friendly for a while and then bam, you're sitting next to each other and he puts a hand on your thigh.",
                          "author": "thegreenaquarium",
                          "created": 1540152510,
                          "upvotes": 6,
                          "replies": {
                            "e872da0": {
                              "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e872da0/",
                              "text": "I'm not sure texting is the main issue here though.  The OP is suggesting that there may be a sexual dimension to this (which you clearly agree with).  That could get the faculty member in a lot of trouble in today's climate.  \n\nAnd yes, as a woman in academia, I've had almost that exact situation happen.  But I've also had wonderful, friendly interactions with male colleagues, and really think we should not view friendliness from men as innately threatening just because they are men.  ",
                              "author": "DocGlabella",
                              "created": 1540152850,
                              "upvotes": 6,
                              "replies": {
                                "e87370k": {
                                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87370k/",
                                  "text": "Oh my goodness, everyone is misreading everyone else today it seems.\n\nOP clearly states that there is no overt sexual dimension:\n\n> The attention does not feel sexual in anyway\n\nShe is, rather, saying that she feels that there potentially could be one and would like to minimize the risk of it coming to fruition. To be perfectly clear, she does not seem to be trying to get the professor in trouble - she just wants to not get in trouble herself. And as a woman to whom this has happened, I wrote in to confirm that his interactions do seem suspicious. Women frequently have to pay attention to these risks because, once the situation happens, it is frequently too late to get out of it in good shape. We aren't trying to get anyone in trouble. We just want to be safe.",
                                  "author": "thegreenaquarium",
                                  "created": 1540153515,
                                  "upvotes": 11,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "e872cu8": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e872cu8/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1540152840,
                  "upvotes": 7,
                  "replies": {
                    "e87395d": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87395d/",
                      "text": "I get the differences in this particular situation.  I was responding more to the comment about not wanting personal questions from colleagues.  Having friendly relationships with my colleagues is one of the things that is most valuable to me in my department and we socialize quite a bit, so the comment surprised me.  ",
                      "author": "DocGlabella",
                      "created": 1540153562,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "e872h59": {
                  "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e872h59/",
                  "text": "For them to bring up mildly personal questions during a one-on-one phonecall before we are even actual colleagues is different from having a group informal chat or coffee with coworkers where we mention of families or partners etc. Additionally, I didn't get the impression that the Prof was asking about her hypothetical kids.",
                  "author": "izvin",
                  "created": 1540152938,
                  "upvotes": 2,
                  "replies": {
                    "e872rqa": {
                      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e872rqa/",
                      "text": "Perhaps my difficulty here comes from the lack of specifics on what a personal question is in this case.  I frequently ask students of both sexes when I'm interviewing them where their home town is and what hobbies they have.  Those are personal questions I use to break the ice and get to know them as people. Asking about a student's romantic life is another matter.  The OP doesn't really tell us much about what she defines as personal question.  ",
                      "author": "DocGlabella",
                      "created": 1540153171,
                      "upvotes": 2,
                      "replies": {
                        "e87812d": {
                          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87812d/",
                          "text": "That's a good point! We must have different interpretations here. I would have presumed questions like hometown are fairly innocuous. My impression of \"random personal questions\" would've been things like where she hangs out or whether she's seeing someone. Without OP's clarification it is hard to gauge between the varying answers here.",
                          "author": "izvin",
                          "created": 1540157678,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e874xpf": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e874xpf/",
          "text": "encourage her via email. It's a much more appropriate, less invasive way to contact someone.",
          "author": "jenesaisquoi",
          "created": 1540154945,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e8705ve": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e8705ve/",
      "text": "I don’t see anything wrong to be honest",
      "author": "AsymptoticallyBiased",
      "created": 1540151146,
      "upvotes": -1,
      "replies": {
        "e87531d": {
          "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87531d/",
          "text": "that may be symptomatic of your biases",
          "author": "jenesaisquoi",
          "created": 1540155069,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "e87692n": {
      "link": "/r/AskAcademia/comments/9q5jbe/professor_overstepping_personal_boundaries/e87692n/",
      "text": "It seems strange to me. I'm a male however, so maybe it's normal for females to receive phone messages instead of emails?\n\nI'd tell them I prefer email instead. I'm pretty bad at keeping track of my phone anyways, so it would be easier for them to contact me. Maybe that would work? Professors can be sensitive people so you have to be careful how you approach things, even when it's THEIR behavior that's inappropriate. ",
      "author": "Gold4Schiff",
      "created": 1540156087,
      "upvotes": 1,
      "replies": {}
    }
  }
}