{
  "sid": "hqqxlw",
  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/",
  "title:": "So I'm getting ready to turn down a TT job offer...",
  "text": "...I'm a postdoc. I'm 6 years since my doctorate in a biological science. The salary and start-up are reasonable for the school but on the low end of the range I told myself I would take. Everything else is good just a little off for my particular situation (teaching load, location, department fit, spousal happiness/job prospects ). But, if I took the job I'd only be treading water in until I could start applying other places. How big of a mistake am I making turning down a reasonable TT job at the start of the worst academic hiring market in a century?  Please talk me out of this or at least try to so I know I've considered everything.",
  "author": "GuyNBlack",
  "created": 1594685027,
  "updated": 1634081188,
  "over_18": false,
  "upvotes": 159,
  "upvote_ratio": 0.95,
  "comments": {
    "fxzlx6l": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzlx6l/",
      "text": ">if I took the job I'd only be treading water in until I could start applying other places.\n\nAnd if you don't, you'll be treading water as a postdoc. Which water would you rather tread?",
      "author": "ProbabilisticWorld",
      "created": 1594687562,
      "upvotes": 272,
      "replies": {
        "fxzwmi2": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzwmi2/",
          "text": "Or potentially not even in a post-doc. It's really late in the season now.",
          "author": "tspier",
          "created": 1594693807,
          "upvotes": 79,
          "replies": {}
        }
      }
    },
    "fxzkjmw": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzkjmw/",
      "text": "Honestly, in my opinion, you are making a terrible mistake if academia is the only outcome that would make you happy. If you are just as happy working in industry, then turning down the job might not be a big deal. But if you are committed to academia, and you get offered a decent tenure track job offer in a bad economy, then you take it. Going to a potentially shitty location is always part of the deal when you get into academia.",
      "author": "lh123456789",
      "created": 1594686761,
      "upvotes": 448,
      "replies": {
        "fxzywpp": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzywpp/",
          "text": "Only 6% of PhD’s get TT jobs. OP is absolutely insane to turn this down without strong objections to something very real.\n\nEdit: I missed the part about the spouse. That’s an important conversation to have.",
          "author": null,
          "created": 1594695186,
          "upvotes": 223,
          "replies": {
            "fy07aog": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy07aog/",
              "text": "Agree. Take the job then reevaluate after a year.",
              "author": "winedr85",
              "created": 1594700658,
              "upvotes": 39,
              "replies": {}
            },
            "fxzz6ki": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzz6ki/",
              "text": "I think the spousal happiness is a big deal.",
              "author": "Pop_pop_pop",
              "created": 1594695354,
              "upvotes": 115,
              "replies": {
                "fy0rrkc": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0rrkc/",
                  "text": "Honestly, depending on how much OP values their marriage, that should be a high priority. I'm only a 2nd year grad student, but my wife and I are in our early 30's. We moved from a big city in a state we loved to a small town in a state we are a bit uncomfortable with so far. She basically had to uproot her whole life to come here and leave a job she loved. The ONLY reason we are okay with this is because it's temporary. We'll only be here for 5-6 years (hopefully...). OP's situation is less temporary. The academic TT job at the end of the grind is where you're finally supposed to settle down. If you're someone who is flexible and doesn't really care where you live then it's an easier problem to solve. But if you or your partner derive a lot of happiness from your environment, things can go downhill pretty quickly once the realization sets in that you hate your permanent home.",
                  "author": "BoJacob",
                  "created": 1594719249,
                  "upvotes": 32,
                  "replies": {
                    "fy12y0x": {
                      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy12y0x/",
                      "text": "While I agree that spousal happiness is paramount, I wouldn't say that TT is \"the end of the grind\" as you put it. Especially at smaller or less research focused schools, getting tenure is a often a jumping off point for someone to apply to larger/R1 schools (assuming they want a research-focused academic career). That's a similar timeframe (~6 years) to your scenario, but I do agree that its not as \"inevitable\" as finishing up grad school.",
                      "author": "Mexicorn",
                      "created": 1594729474,
                      "upvotes": 24,
                      "replies": {}
                    }
                  }
                },
                "fy1bmdi": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1bmdi/",
                  "text": "Ah, I missed that part. Funny enough, family is part of why I’m not chasing TT jobs around the country. My wife gave her blessing if it’s what I needed but we have a son and she has a very well paying stable job here so I’m exploring other options. \n\nI’m in engineering though so my “failure” to go academic means I have to find a position which pays 50% more than professorship with none of the headaches.",
                  "author": null,
                  "created": 1594734942,
                  "upvotes": 10,
                  "replies": {
                    "fy1fpe8": {
                      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1fpe8/",
                      "text": "> I’m in engineering though so my “failure” to go academic means I have to find a position which pays 50% more than professorship with none of the headaches.\n\nAs a computer scientist who also left academic for industry positions, \"none\" is not the word I would have used there. :)",
                      "author": "deong",
                      "created": 1594737199,
                      "upvotes": 5,
                      "replies": {
                        "fy1s656": {
                          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1s656/",
                          "text": "Haha fair  enough",
                          "author": null,
                          "created": 1594743526,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fy04bnt": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy04bnt/",
                  "text": "I think we found OP's spouse.",
                  "author": "ApesInSpace",
                  "created": 1594698635,
                  "upvotes": 49,
                  "replies": {}
                },
                "fy0t2wm": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0t2wm/",
                  "text": "No doubt, but we don't even know if the alternative will make the spouse happy or if there even is an alternative.",
                  "author": "makemeking706",
                  "created": 1594720606,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "fy0h3ln": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0h3ln/",
              "text": "That’s actually 0.45% as of 2010 in UK. I don’t think it jumps up to 6% in any country.\n\nEdit: of",
              "author": "QuasiAstute",
              "created": 1594708618,
              "upvotes": 7,
              "replies": {
                "fy0kmba": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0kmba/",
                  "text": "> That’s actually 0.45% as of 2010 in UK.\n\nThis is apples and oranges; [0.45% of new PhD graduates in the UK make it to Professor, as opposed to the 3.5% that take any permanent academic post](https://www.theguardian.com/higher-education-network/2018/aug/24/the-path-to-professorship-is-long-rocky-and-confusing-why) (e.g. Lecturer). We don't have tenure, so 'tenure-track' is a misnomer, and the job titles don't translate to the US system either.",
                  "author": "Hasefet",
                  "created": 1594711940,
                  "upvotes": 20,
                  "replies": {
                    "fy0lit3": {
                      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0lit3/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1594712822,
                      "upvotes": 11,
                      "replies": {
                        "fy0m271": {
                          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0m271/",
                          "text": ">The UK \"Lecturer\" is about equivalent to the US \"Assistant Professor\"\n\nI think this is where meaning of tenure track changes. For example, there are Asst. Profs who are not on tenure track and there are Asst. Profs who are on tenure track. The ones who are on tenure track are the ones who reach Prof level. Of course, it varies depending on which country we are looking at.",
                          "author": "QuasiAstute",
                          "created": 1594713356,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "fy0hnyt": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0hnyt/",
                  "text": "Most of the UK data I've seen is much higher than 0.45%.  Do you have a source?",
                  "author": "polyphonal",
                  "created": 1594709129,
                  "upvotes": 2,
                  "replies": {
                    "fy0kch7": {
                      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0kch7/",
                      "text": "https://royalsociety.org/~/media/royal_society_content/policy/publications/2010/4294970126.pdf\n\nFigure 1.6.",
                      "author": "QuasiAstute",
                      "created": 1594711675,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                },
                "fy0iu23": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0iu23/",
                  "text": "That sounds very low... The figures I've seen (for US) are usually 6-7%, and my understanding was that the UK was broadly comparable.  Where did you get that 0.45 from?",
                  "author": "Solivaga",
                  "created": 1594710219,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fy0p8gg": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0p8gg/",
          "text": "I agree. Rather get on the job ladder now and get some experience than keep looking.",
          "author": "Dr_Radar",
          "created": 1594716616,
          "upvotes": 5,
          "replies": {}
        },
        "fy0szm7": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0szm7/",
          "text": "OP didn't even say what the alternative was, assuming there even is one. Moreover, if they want to be elsewhere, they should be busting their behind to get there, not \"treading water\". Sitting and waiting is not going to get them anywhere.",
          "author": "makemeking706",
          "created": 1594720513,
          "upvotes": 3,
          "replies": {
            "fy0txny": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0txny/",
              "text": "I am aware that the OP didn't say what the alternative was. Given his/her fields, I merely suggested that industry might be an alternative.\n\nI didn't say anything to suggest that OP should be \"treading water\".",
              "author": "lh123456789",
              "created": 1594721499,
              "upvotes": 4,
              "replies": {
                "fy0v14q": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0v14q/",
                  "text": "That's what OP said. I definitely agree with your take.",
                  "author": "makemeking706",
                  "created": 1594722635,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fxzlxtw": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzlxtw/",
      "text": "A bird in the hand is worth two in the bush. If you want to be an academic I don't think you should turn this down. Like the others have said, much easier to land another tenure job if you are already in one.",
      "author": "zero2hero2017",
      "created": 1594687573,
      "upvotes": 175,
      "replies": {}
    },
    "fxzmy8l": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzmy8l/",
      "text": "OP if you are in this for a career in academia, I side with the other responses here, and say take it. You mention that the particulars, teaching load, fit, spouse happiness, are \"just a little off\" -- is that all? Or is it in stark opposition to your long term career and personal goals? Do you truly think you can find a comparable job in a short amount of time that perfectly aligns to your needs?\n\nConsider this too---if you apply for a new job while holding this position, you can leverage counter offers or your current salary from your place of employment to raise salary / startup for any new position. Even if it's only a few thousand difference for a starting salary, it may be a huge payout over the course of your career.",
      "author": "thisicouldnotdo",
      "created": 1594688157,
      "upvotes": 102,
      "replies": {}
    },
    "fxzi6bv": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzi6bv/",
      "text": "It is easier to find another job when you are already employed. I wouldn’t turn it down unless there was a more compelling reason not to. TT positions are difficult to come by...",
      "author": "njbella",
      "created": 1594685419,
      "upvotes": 171,
      "replies": {
        "fxzmxl7": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzmxl7/",
          "text": "This. It’s easier, and less stressful, to find another TT position once you already have one.\n\nPlus, considering what a crapshoot it is, it seems foolhardy to turn down one with the assumption you’ll just get a better one later. Take it.",
          "author": "PhD4Hire",
          "created": 1594688147,
          "upvotes": 77,
          "replies": {}
        }
      }
    },
    "fxzrpkd": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzrpkd/",
      "text": "Well, it depends on how important it is for you to stay in academia. Realistically, hiring will continue to be tight for the forseeable future, and you're unlikely to improve on your existing offer in the next few years. A reasonable tenure-track position will provide you with the critical opportunity to develop an independent reputation as a PI, and to secure independent funding. If you miss this opportunity, it might be another couple of years before hiring starts to thaw out again, by which time you'll be dangerously close to  the being 10  years out from the Ph.D. without a tenure-track position, which will not feed into the narrative of being a rising star, which is critical to be competitive at the most prestigious institutions. At the end of the day, you're really making a choice between staying in academia, or a non-academic career.",
      "author": "mleok",
      "created": 1594690912,
      "upvotes": 54,
      "replies": {}
    },
    "fxzuix1": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzuix1/",
      "text": "I'm having trouble understanding why you're not taking it. It sounds like it's fine, just not your dream job. Am I missing something?",
      "author": "zinfandelightful",
      "created": 1594692549,
      "upvotes": 47,
      "replies": {}
    },
    "fxzsaxp": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzsaxp/",
      "text": "Social Science PhD Student here. Please, take the TT job because of all the reasons everyone else so far has cited. If you are in academia for the long haul, take a tenure track job if you have the option!",
      "author": "fantasmapocalypse",
      "created": 1594691262,
      "upvotes": 39,
      "replies": {}
    },
    "fy09byd": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy09byd/",
      "text": "I got four interviews for TT jobs right out of the gate, and got offered one of them. I turned it down for the same reason as you: it wasn't ideal, and because I had four great interviews my first year on the market, I saw no reason why it shouldn't be the same next year. Then... five years without a single interview. Turning down that job is my #1 regret. If you get offered a TT job, *take it.*",
      "author": "impossible_apostle",
      "created": 1594702144,
      "upvotes": 63,
      "replies": {
        "fy15348": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy15348/",
          "text": "[deleted]",
          "author": null,
          "created": 1594730959,
          "upvotes": 9,
          "replies": {
            "fy16cyd": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy16cyd/",
              "text": "Thank you. I eventually got a position I like, although I'm NTT, and had to switch disciplines. I'm teaching faculty with no research requirement - but it turns out I like teaching more than research, and it's nice not to have publication pressure in the summer!",
              "author": "impossible_apostle",
              "created": 1594731777,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "fy0111e": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0111e/",
      "text": "I also learned from this experience: you will NOT get your dream job in the first round. Also, you will be a better candidate as a TT than a postdoc. Take it, save some money, and gain experience as a professor.\n\nIf you see any red flags, you should turn it down. However, based on your description, it seems like you are considering to reject because the job is just average. It's hard to get a R1 job right away - if that's what you wanted.",
      "author": "searchinhappiness",
      "created": 1594696507,
      "upvotes": 33,
      "replies": {}
    },
    "fy08gjb": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy08gjb/",
      "text": "The group has already piled on so I won't add to it (not that I think they are wrong). The thing for me here is that you haven't actually articulated any concerns. Yes, the job is suboptimal (whose isn't) but is there are an actual showstopper here?\n\n&#x200B;\n\n>spousal happiness/job prospects \n\nThis can indeed be a show stopper but you're so vague here that it's hard to evaluate how serious this concern is. Would your spouse be unemployed? underemployed? If it's just desirability of location (say a small town rather than big city) then you and your spouse need to have a serious discussion about your career plans for academia. Also, why did you bother applying if you couldn't/wouldn't live there? Academic jobs don't exist everywhere - they are where they are - and 99% of the locations will be undesirable/too competitive to land that you need to discuss whether this is is something you should actually pursue or whether you should move on. No one here can answer that for you but you. But as pointed out, the further out you are from your PhD, if you're still in a non-independent role your academic job prospects will shrink with each passing day. That's not saying anything about the current climate",
      "author": "blacknebula",
      "created": 1594701498,
      "upvotes": 26,
      "replies": {}
    },
    "fxzxjyu": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzxjyu/",
      "text": "Not that academia is the end all be all but IF you are committed to working in academia, you should take the job (you can try negotiating your salary and start-up a bit). It is so much easier to move horizontally as a junior faculty then trying to get TT job anew.",
      "author": "blondiecommie",
      "created": 1594694360,
      "upvotes": 23,
      "replies": {}
    },
    "fxzz1vw": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzz1vw/",
      "text": "If you want to be in academia, and the job is truly just \"a little off,\" then most everyone would take it. Many institutions are worried about closing; I can't imagine many are out there waiting for GuyNBlack to knock on their door. If you are planning on looking for a better job, you will appear much more qualified with a year of full time teaching/research on your resume.",
      "author": "WaylonWillie",
      "created": 1594695273,
      "upvotes": 18,
      "replies": {}
    },
    "fxzx0j7": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzx0j7/",
      "text": "You're riding a pretty damn high horse to be picky about TT at 6 years post doc, aside from the market, and with no other offers too. Shit or get off the pot - this is your shot to stay in academia.",
      "author": "tacobellisadrugfront",
      "created": 1594694037,
      "upvotes": 75,
      "replies": {
        "fy051kl": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy051kl/",
          "text": "Everybody deserves to be picky if they want to be picky regardless of how many offers they have, as long as they have a realistic outlook on what that means for them professionally. Some people aren't willing to sacrifice all of the other things they want/care about in their lives for the TT shot, and that's OK! They just need to understand that it could mean their exit from academia, especially now. But it's not a \"high horse\" to realize that you won't be happy in a job because it's not right for you.",
          "author": "roseofjuly",
          "created": 1594699116,
          "upvotes": 36,
          "replies": {
            "fy058qt": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy058qt/",
              "text": "Ok, hell yeah I agree. I redact!",
              "author": "tacobellisadrugfront",
              "created": 1594699250,
              "upvotes": 20,
              "replies": {}
            }
          }
        }
      }
    },
    "fxzpxr1": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzpxr1/",
      "text": "Still better than a postdoc? Remember that a lot of the early career awards are time since doctorate, so you are getting to the tail end of that window to apply. Take the job, do awesome at it, move on up. I'd say basically 0 chance you'll get a job this next year with the market, so unless 2+ more years as a postdoc sounds great, you are throwing something better out the window!",
      "author": "AwkwardAccountant5",
      "created": 1594689884,
      "upvotes": 34,
      "replies": {}
    },
    "fy03rwu": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy03rwu/",
      "text": "Have you **SEEN** the job market out there? Good god. \n\nIf you won $10 million in the lottery, would you take it, or would you turn it down because next time you might win $11 million in the lottery? \n\nRight now, you don't have a choice between this offer and another theoretical offer that will maybe be *everything* you ever dreamed of. You have a choice between this and applying to be a driver for UberEats.",
      "author": "MisterSmeeee",
      "created": 1594698274,
      "upvotes": 35,
      "replies": {}
    },
    "fy02iw4": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy02iw4/",
      "text": ">(teaching load, location, department fit, spousal happiness/job prospects )\n\nAll those things are incredibly important, especially spousal happiness, but this is also how academia works. We often take not-so-great TT positions as our first step and try to make a better move after 2-3 years.",
      "author": "zifmer",
      "created": 1594697461,
      "upvotes": 14,
      "replies": {}
    },
    "fxzze5e": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzze5e/",
      "text": "Spousal happiness is the big one to me. Is your partner going to hate you for taking the job? if so then don't do it. If I am blowing up the spousal happiness and  they will be happy for the next 3 or 5 years then I think you should strongly consider taking the job.",
      "author": "Pop_pop_pop",
      "created": 1594695485,
      "upvotes": 20,
      "replies": {}
    },
    "fxzv9te": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzv9te/",
      "text": "This is a bad idea, IMO. I'd take the job. If you're looking to be in academia, this is your shot.",
      "author": "Mtt76812",
      "created": 1594692997,
      "upvotes": 11,
      "replies": {}
    },
    "fxzuh70": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzuh70/",
      "text": "This seems like such a terrible idea, but you do you, OP...",
      "author": "IntoGold",
      "created": 1594692522,
      "upvotes": 18,
      "replies": {}
    },
    "fy0rmk0": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0rmk0/",
      "text": "If you want to stay in academia, this is your golden ticket. If you're happy to leave academia, don't take the job.\n\nDon't place any confidence or hope in getting further offers in the next few years - let alone ones which are better than this one.",
      "author": "OrbitalPete",
      "created": 1594719103,
      "upvotes": 10,
      "replies": {}
    },
    "fxzxtfx": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzxtfx/",
      "text": "I am surprised you got any position at all. Academia is frozen.",
      "author": "foradil",
      "created": 1594694519,
      "upvotes": 17,
      "replies": {}
    },
    "fy05f1i": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy05f1i/",
      "text": "[deleted]",
      "author": null,
      "created": 1594699368,
      "upvotes": 14,
      "replies": {
        "fy0vttn": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0vttn/",
          "text": "> But, if this is choice anxiety where you're paralyzing yourself and looking for reasons to say no out of fear, or if your offer has ignited a sense of entitlement to more that wasn't there before\n\nThanks for writing this. I am not OP, but I am struggling with what you describe and couldn't put words to it.",
          "author": "DevFRus",
          "created": 1594723430,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fxzw54v": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzw54v/",
      "text": "Bruh, I just hope you have the stats to back up that attitude. If you're cranking up papers, making it rain grant and have a healthy pipeline over the next few years, then yeah, wait it out. Google up the TT staff of people who are employed in 'your range of schools', and estimate if you can have 1.5x pubs/grants of those people by 2022 because that's probably when schools will start hiring again for real, and by that time the competition will be even fiercer.",
      "author": "gergasi",
      "created": 1594693516,
      "upvotes": 23,
      "replies": {}
    },
    "fy00gcl": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy00gcl/",
      "text": "As others have said, you'll be more likely to get a tt job if you already have a tt job. What are the other options, stay in the postdoc position? OP might be anticipating another offer, but it's getting late in the season, and the better offer might not come. The job market is not going to improve for at least a couple of years, and might not improve at all. The tt jobs may very well not come back. Sounds like OP is ambivalent about academia.",
      "author": "Opening_Doors",
      "created": 1594696148,
      "upvotes": 7,
      "replies": {}
    },
    "fy01lg0": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy01lg0/",
      "text": "Take the job and work hard — if they don’t improve salary and other items, you can leave.",
      "author": "FoCoCS",
      "created": 1594696868,
      "upvotes": 6,
      "replies": {}
    },
    "fy0567q": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0567q/",
      "text": "Just to echo the other comments...\n\n...TAKE THE DAMN JOB!\n\nIf you want to stay in academia. I was lucky enough to land a TT gig in my actual field (which is even rare) that I start in two weeks. A friend and colleague of mine recently joked that I may have gotten the last tenure track job in my field. The economy SUCKS and tenure track jobs are not necessarily becoming more numerous...\n\nI was told by a faculty member at my new institution that I should start applying for jobs at other places immediately, which I plan to do. My SO is finishing her PhD soon, so we’re going to try our hardest to get a spousal hire at my current institution, or alternatively (hopefully) one or both of us gets a TT job elsewhere and negotiates a spousal hire.\n\nNone of this would be remotely possible if I wasn’t starting a TT job right now. The experience and resources (e.g. research startup), and not to mention financial security, will enable me to build up my CV so that I can be competitive as an Assistant Professor attempting to move institutions. In a perfect world I’d move elsewhere with tenure...\n\nTake the job!",
      "author": "northamrec",
      "created": 1594699203,
      "upvotes": 7,
      "replies": {}
    },
    "fxzuafo": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzuafo/",
      "text": "NOOOOOOOOOOOOO",
      "author": "Pikardio",
      "created": 1594692412,
      "upvotes": 6,
      "replies": {}
    },
    "fxzz99m": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzz99m/",
      "text": "If you don't want the job, don't take the job. \n\nIf there's a part of you that does want to job, even if its maybe not perfect, consider that maybe you can adjust some of those things/make up for it in other ways. Or, perhaps this would be good experience for eventually transitioning into your dream job. \n\nAs far as the other things: if your saying taking this job might impeded your spouse's happiness/ability to have THEIR dream job, then that's a whole other thing. \n\nWe need more info, OP.",
      "author": "saruhhhh",
      "created": 1594695400,
      "upvotes": 10,
      "replies": {}
    },
    "fxzycsw": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzycsw/",
      "text": "This is a moment where you gotta realize you're going to be living a monks life. This is just another monk moment.",
      "author": "Snowpossum",
      "created": 1594694849,
      "upvotes": 4,
      "replies": {}
    },
    "fy04tny": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy04tny/",
      "text": "Well, I think the question for you is: is academia the only thing that will make you happy? Or would you be equally satisfied in a non-academic job?\n\nI would've totally done this (and would totally do it) when I was a postdoc and also job hunting, but that's because I knew I would truly be at least as happy in industry (and I was right; I work in industry now and I love it). I knew only an academic job with the right circumstances would make me happy, and those circumstances were pretty narrow. \n\nI also believe there's no point in being miserable if you can avoid it, especially being *tethered* to a job and a place and being miserable. If you can survive on your postdoc income now and you are doing well, and you know you'd be deeply unhappy with the TT job because of the mismatches...eh. It's really a personal decision of what and how much you are willing to sacrifice in order to be a TT professor, especially when there's also the possibility that you could get a little bit trapped there.\n\nBut again, the fullest of disclosure is that I'm a PhD outside of academia by choice - by preference. I have never had the burning desire to be a tenure-track professor, so I don't know what that feels like. As far as I can tell it, though - by observing the folks who do have it - if you have that burning desire and you *know* academia is where you want to be in the long term, then it doesn't make sense to turn down the TT job and you may well regret it.",
      "author": "roseofjuly",
      "created": 1594698967,
      "upvotes": 4,
      "replies": {}
    },
    "fy0pg6t": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0pg6t/",
      "text": "People here are right. It is a big mistake to turn down this job from a career perspective. Don't hold out for something better. You're very unlikely to get something better, at least as a postdoc.",
      "author": null,
      "created": 1594716848,
      "upvotes": 4,
      "replies": {}
    },
    "fy117rl": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy117rl/",
      "text": "I agree with everyone here about taking the TT offer, BUT if you love your spouse as much as you love discovery and research, please discuss this thoroughly with them. It’s important that your spouse sees what your decisions are based off given the difficulty to land TT, especially if their work isn’t in academia. Your happiness doesn’t only depend on your job.",
      "author": "smile-sunshine",
      "created": 1594728179,
      "upvotes": 5,
      "replies": {}
    },
    "fy04uhh": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy04uhh/",
      "text": "I have heard that most TT change their job locations at, or around, the three year mark. The first three years, I’ve heard provide opportunities to start creating a research agenda and also developing connects to where people really want to go. Take the job, you May end up liking it... and remember if you don’t like it, like everything else, you can go somewhere else...",
      "author": "muzikboi_2000",
      "created": 1594698982,
      "upvotes": 6,
      "replies": {}
    },
    "fy081v7": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy081v7/",
      "text": "Curious, how have your six years as a postdoc been? I know plenty of postdocs who have stayed in their lab for longer because the high impact work just happened to be flowing like water, was that like situation you were in? Have you gotten any NIH/NSF grants? I'm in the \"you do you\" camp tbh, but it does seem crazy given that I don't even know of a single institute hiring postdocs rn let alone faculty",
      "author": "quohr",
      "created": 1594701202,
      "upvotes": 3,
      "replies": {}
    },
    "fy1cxz2": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1cxz2/",
      "text": "It used to be that you’d land a TT job right out of grad school. Then the system changed, requiring people to do a postdoc to become worthy of a TT position. Now the system is changing again, where you have to already be a professor at a smaller school before you are worthy of a TT position at a big R1 school. Stanford, for example, has mostly adopted this model and likes to poach established professors from smaller institutions, guaranteeing they always have the best of the best. It’s a messed up system.",
      "author": "Sacuna9999",
      "created": 1594735696,
      "upvotes": 3,
      "replies": {}
    },
    "fy1xy3t": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1xy3t/",
      "text": "Turning down a tenure-track position is not just absurd because of the low probability of ever seeing that opportunity again, but also because taking a tenure-track position will put you in a good position for future positions. \n\nOnce you are tenure-track, when negotiating any other job at another university, you will be in a strong position for demanding a tenure track position there, and if it takes long enough such that you actually earn tenure at your current institution, guaranteeing your tenure at other universities will be a natural part of your negotiations. It puts you in a strong position, and you can even negotiate maintaining tenure at another university if you take a job in the administrative side of things (guaranteeing job security).",
      "author": "fiskiligr",
      "created": 1594746299,
      "upvotes": 3,
      "replies": {}
    },
    "fxzxin0": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzxin0/",
      "text": "You are an idiot. Unless you have multiple Nature papers that you're hiding. Turning down a reasonable offer is only going to make you a less attractive candidate in  the future because no one will know if you are serious or just jerking them around. Take the offer, get a grant, get renewed, then take your pick because you will be very portable with that record.",
      "author": "joejimbobjones",
      "created": 1594694337,
      "upvotes": 12,
      "replies": {
        "fy05g4u": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy05g4u/",
          "text": "Why would any reasonable person assume that because a person turned down *one* offer somewhere else, it means they are not serious about getting a job *anywhere*? There are *hundreds* of reasons a job may not be a good fit for a person; without knowing any of the details of the offer, how would they be able to rationally judge?\n\nI'm not actually genuinely asking these questions because I was in academia long enough to see this happen - the rumor mill about the candidate who would never actually leave his current job, he's just trying to get a higher salary; or the candidate who turned down this or that offer last year so she thinks she's hot stuff; or what ever. Academia is a small place and people do talk. But it baffled me even then!",
          "author": "roseofjuly",
          "created": 1594699388,
          "upvotes": 7,
          "replies": {
            "fy0vzpq": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0vzpq/",
              "text": "> Why would any reasonable person assume that because a person turned down one offer somewhere else, it means they are not serious about getting a job anywhere? There are hundreds of reasons a job may not be a good fit for a person; without knowing any of the details of the offer, how would they be able to rationally judge?\n\nWhy did OP apply if they were not willing to take the job? It doesn't seem like they are concerned about new information that was revealed during the offer stage. It seems like they were applying to a place they wouldn't be willing to go in the first place. I can see how people might perceive that as wasting people's time.",
              "author": "DevFRus",
              "created": 1594723591,
              "upvotes": 4,
              "replies": {}
            },
            "fy07day": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy07day/",
              "text": "Recruiting for a faculty position is a low six figure proposition. There are dozens to hundreds of applicants. They dont want to waste time with someone who is being picky. You may be a superstar and have multiple offers from R1schools. But if you aren't a superstar,  they will not want to waste time as you hem and haw over whether you're too good for them. I know of a couple examples of people who  interviewed themselves out of academia. And that was in a stronger job market. If you are serious about being in academia, take it. If not, get off the pot and do something else. /toughlove\n\nEdit: sorry i was replying as if you were OP. Like grants, its a buyers market. An individual applicant has minimal power in the job market. All it takes is a whiff of doubt for them to move to someone stronger. This is especially true of STEM fields that need large startup packages. A math department might take a flyer on someone if all they need is a computer and an office. But if you need mid-six figures to start up your lab you can bet they dont want a reluctant applicant.",
              "author": "joejimbobjones",
              "created": 1594700710,
              "upvotes": 3,
              "replies": {
                "fy14nb7": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy14nb7/",
                  "text": "But search committees are a weird thing. They may have found only one person they believed was qualified for the position. If OP turns them down they may have to wait a year to get approval to do the search again. At which point, they may be on a freeze.",
                  "author": "Pop_pop_pop",
                  "created": 1594730667,
                  "upvotes": 2,
                  "replies": {
                    "fy17lyg": {
                      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy17lyg/",
                      "text": "Man those committees *are* weird. I haven't sat on a lot of committees (as above I'm mostly out of academia now), but in my experience there is no second choice. Once they decide that someone is not *the best* they will pass. Even if their first choice takes a better offer. I have never understood the no-left-over rule, but I've seen it in action several times.\n\nEdits: all kind of spellings",
                      "author": "joejimbobjones",
                      "created": 1594732559,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "fy08gwa": {
                  "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy08gwa/",
                  "text": "I hire researchers in industry, also for \"low six figure propositions\" and our roles also get dozens to hundreds of applicants.\\* It depends on what people mean by picky, of course, but I *want* candidates to carefully consider the conditions of taking the role and whether they would be happy in the job.\n\nIt's *because* hiring is such an expensive and time-consuming proposition that I want this. First and foremost, I want my colleagues and team members to be happy - because I'm human, but also because happy colleagues do better work. On the other side, I do not want a person to come here only to realize one year later that they are very unhappy and leave, restarting the arduous hiring cycle yet again (and risking the role getting cut - that happens in industry, too).\n\nAnd in this particular case, we are talking about a candidate that turns down *one* offer from *one* place - a place that's not even *my* place. That's a blip on the radar. There are a thousand reasons that a person turns down a job and the vast majority of them are likelier than \"this person does not really want a steady income and benefits; they just want to turn down offers for funsies.\"\n\nThis person is, wisely, deciding whether they'd rather sacrifice the things that they currently think they really care about for something else; you have to explore how badly you want it at that point. That is a good thing. Thinking deeply about whether you'd be happy in a job is not acting \"too good\" for it. It's just normal.\n\n*\\*I'm not saying it's the same as academic hiring, because it's not. I'm merely responding to the parameters that you set up here - those parameters are not what makes people have this attitude, or at least they shouldn't.*",
                  "author": "roseofjuly",
                  "created": 1594701505,
                  "upvotes": 2,
                  "replies": {
                    "fy0aaze": {
                      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0aaze/",
                      "text": "Sorry i should have been clearer. The recruitment costs for the department runs in low sixes. And its a cost sink, and the dean wont let them do it again next cycle so they have to choose from the couple of candidates that they've invited.\n\nIts different in industry and public sector (also where i am right now,  mostly). Outside we worry about best fit and do multiple rounds of interviewing and want people to consider the alignment with their goals etc.  It's just a different mindset with departments. They want someone who is going to bring a skill, win grants, and stick around. And they have one interview round to get it right.",
                      "author": "joejimbobjones",
                      "created": 1594702890,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fxzyty7": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzyty7/",
      "text": "If all the numbers are within your predetermined range, why not take it?",
      "author": "easy_peazy",
      "created": 1594695139,
      "upvotes": 2,
      "replies": {}
    },
    "fy067vq": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy067vq/",
      "text": "Would your spouse be open to you taking it for a year? It might all work out better than you imagined, and if not, at least you will know. I agree with the others that if you truly want an academic job, this is likely your path into the profession.",
      "author": "down_home_girl",
      "created": 1594699912,
      "upvotes": 2,
      "replies": {
        "fy1gqg9": {
          "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1gqg9/",
          "text": "[deleted]",
          "author": null,
          "created": 1594737751,
          "upvotes": 1,
          "replies": {
            "fy3abb9": {
              "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy3abb9/",
              "text": "That’s a good point. My lab space is more just a space with computers, not fancy equipment. We’ve had faculty leave my department after three years several times, but not sooner than that. That seems like such a short time to me that it might be worth it as a test run (assuming everything seems just okay now, as OP suggested). If it seemed like a depressing situation, my recommendation would probably be different.",
              "author": "down_home_girl",
              "created": 1594770088,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fy0d97s": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0d97s/",
      "text": "Definitely do not turn that shit down. That’d be dumb as fuck.",
      "author": "antoniofelicemunro",
      "created": 1594705276,
      "upvotes": 2,
      "replies": {}
    },
    "fy0xhm2": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0xhm2/",
      "text": "In my experience, never turn down a certain job for the prospect of maaaaaybe getting a better one. It is almost ALWAYS better to be looking for a job when you already have one.\n\nThere is no guarantee your applications will even be looked at or considered in the future. As you have noted, now is probably not the best time to be \"holding out for something better\".",
      "author": "PointsGeneratingZone",
      "created": 1594725011,
      "upvotes": 2,
      "replies": {}
    },
    "fy10lrm": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy10lrm/",
      "text": "Personal experience: my first tenure-track job was a nightmare. Found a better one in a year. Found another, really great job 3 years after that. My \"career\" was slowed somewhat. And that first year was a year in hell. But now I'm in my 50's, still at that 3rd job, tenured long ago, well-liked, working with a great bunch of people; I've done some good research, won 2 teaching awards, gotten really good at being a thorn in the side of pencil-pushers. Also managed to get our dream home about 10 years back. I'll never be famous; but I'm very happy.\n\nOf course, I started out in the mid-90s, and times were different then.\n\nBut, IMHO, a job is a job. The experience - even if it's a bad one - will make you wiser in the long run.",
      "author": "salustri",
      "created": 1594727697,
      "upvotes": 2,
      "replies": {}
    },
    "fy14u3z": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy14u3z/",
      "text": "All things being equal, you never turn down a job in academia. It’s easier to find a job when you have a job.",
      "author": "reversechinlock",
      "created": 1594730795,
      "upvotes": 2,
      "replies": {}
    },
    "fy1ai92": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1ai92/",
      "text": "You will likely regret this. But that’s one more open position for your peer. So do what you want by all means.",
      "author": "geometer2015",
      "created": 1594734297,
      "upvotes": 2,
      "replies": {}
    },
    "fy1t52a": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1t52a/",
      "text": "Hi,\n\nI obviously don’t know anything about your position but I turned down an objectively good TT offer because it wasn’t right for me and my family. It was an extremely hard decision and I still wonder if I made the right choice  but overall I am happy that I did it. We are not obligated to make decisions that are bad for us just because the job market is insane. There is one caveat - I am lucky that my research area leads to (some) jobs in industry so while I am going to go on the market again, I would be happy also taking an industry job. All this to say, it is difficult, but necessary to understand your own priorities.",
      "author": "plaiddest",
      "created": 1594743995,
      "upvotes": 2,
      "replies": {}
    },
    "fxzza0y": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzza0y/",
      "text": "If you don't want the job, don't take the job. \n\nIf there's a part of you that does want to job, even if its maybe not perfect, consider that maybe you can adjust some of those things/make up for it in other ways. Or, perhaps this would be good experience for eventually transitioning into your dream job. \n\nAs far as the other things: if your saying taking this job might impeded your spouse's happiness/ability to have THEIR dream job, then that's a whole other thing. \n\nWe need more info, OP.\n\nEDIT: also, as an aside, this is one of those big life decisions that may be clearer talked out with a therapist if you have one.",
      "author": "saruhhhh",
      "created": 1594695414,
      "upvotes": 3,
      "replies": {}
    },
    "fy07wo5": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy07wo5/",
      "text": "I agree with almost everyone else here. It is so much easier to get a job when you already have one; I have been on the job market for the past 4 years and have always tried to look up who actually got hired for a given position (because why not torture myself more?! /s), and I would say that somewhere above half of them have gone to assistant profs. It’s a brutal realization when you’re looking for that first position. I get why you don’t want to take it (I interviewed for a job I knew I’d turn down if it were offered to me) and you should “do you”, but damn I wouldn’t turn down a job in academia right now— assuming that’s your true goal/dream. \n\nThe main reason being, who knows what is going to happen to the job market in the next few years as COVID and this recession exact their full toll. The job market is in all likelihood wrecked, and it wasn’t in good shape to begin with. \n\nThe spouse happiness issue is something important to be considered, of course.  But if the plan isn’t to stay at that position for the long term maybe they are also willing to try it; but that’s up to you guys.",
      "author": "TourmalineTart",
      "created": 1594701097,
      "upvotes": 1,
      "replies": {}
    },
    "fy0t8t4": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy0t8t4/",
      "text": "> The salary and start-up are reasonable for the school but on the low end of the range I told myself I would take. Everything else is good just a little off for my particular situation (teaching load, location, department fit, spousal happiness/job prospects ). But, if I took the job I'd only be treading water in until I could start applying other places.\n\nWait, so is money the only problem?  You know you can get raises right?  And sometimes housing assistance?",
      "author": "dampew",
      "created": 1594720781,
      "upvotes": 1,
      "replies": {}
    },
    "fy14ufj": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy14ufj/",
      "text": "All things being equal, you never turn down a job in academia. It’s easier to find a job when you have a job.",
      "author": "reversechinlock",
      "created": 1594730802,
      "upvotes": 1,
      "replies": {}
    },
    "fy1ookj": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy1ookj/",
      "text": "It sounds like you want to be talked out of turning down the job offer, and while I'd love to talk  you out of it, it's a conversation better suited to have with your spouse. The biggest red flag you raised, in my opinion, is the spousal happiness. Is this temporary enough that you'd consider living in different cities for a while? If so, that's a consideration. \n\nI'm not going to make a decision for you or push one decision or another, but I will remind you that past 5 years in a post-doc position, it can become increasingly difficult to find faculty positions. I don't have the numbers, but my understanding is that if you're in a post-doc position (or several) for a long time, colleges will assume that it's because nobody else would hire you and may discard your application. This happened to a couple of my friends, though I don't think anyone officially listed that as the reason for them not getting hired. \n\nAnyhow, good luck.",
      "author": "Esmereldista",
      "created": 1594741802,
      "upvotes": 1,
      "replies": {}
    },
    "fy36k2n": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fy36k2n/",
      "text": "Which is worse, going after a different TT position a few years down the line, or trying to get an initial TT position a few years down the line? Your honest answer to that is the only advice you need.",
      "author": null,
      "created": 1594767952,
      "upvotes": 1,
      "replies": {}
    },
    "fyufvjs": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fyufvjs/",
      "text": "OP, I thought about you today! Can we get an update? What did you decide?!",
      "author": "TourmalineTart",
      "created": 1595396075,
      "upvotes": 1,
      "replies": {}
    },
    "fxzxdze": {
      "link": "/r/AskAcademia/comments/hqqxlw/so_im_getting_ready_to_turn_down_a_tt_job_offer/fxzxdze/",
      "text": "Academia is dying. Flee.",
      "author": "TakeOffYourMask",
      "created": 1594694260,
      "upvotes": -4,
      "replies": {}
    }
  }
}