{
  "sid": "jahdb1",
  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/",
  "title:": "I really enjoyed my Master's. Is that a sign I should apply for a PhD?",
  "text": "I did a 1-year Master's and really enjoyed it. I worked long hours, but getting to choose what to study and what to do research on was really fun. I especially enjoyed getting to do independent research with original data. It was especially a joy after having spent 10 years in the workforce, and feeling really ground down by the lack of intellectualism, the lack of rigour of thought and just plain repetitiveness that seems so common in office culture.\n\nBut I suspect a PhD would feel different than a Master's, I'm just not sure exactly how. Can you give me any insight into how I would know whether I'd enjoy the PhD experience?",
  "author": "BayAreaDreamer",
  "created": 1602607967,
  "updated": 1634081165,
  "over_18": false,
  "upvotes": 158,
  "upvote_ratio": 0.95,
  "comments": {
    "g8ppslu": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8ppslu/",
      "text": "If you liked the independent research aspect, then you might enjoy a PHD. The people in my program who left early often did well in the classes at the beginning of the program, but had no idea how to work independently on research projects. \n\nThe main consideration when starting a PHD is what next? For a PHD in Biomedical Science, I think less than 15% of graduates remain in academic research. What type of job do you want? Will having a PHD open up mobility in that job? It's very field specific.",
      "author": "Lomelinde",
      "created": 1602611940,
      "upvotes": 103,
      "replies": {
        "g8pwel5": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8pwel5/",
          "text": "Well, I'm in Social Sciences. From what I read on this subreddit, the job prospects for most social sciences fields are not great with a PhD. However, I read that if you can get into a business PhD program in something like Organizational Behavior it would be much better. So I guess maybe I would try and reorient toward something like that? Previously I've studied more Political Science and Public Policy though.",
          "author": "BayAreaDreamer",
          "created": 1602615214,
          "upvotes": 31,
          "replies": {
            "g8pxaf6": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8pxaf6/",
              "text": "I would work backwards from the jobs you might be interested in having post-graduation. If the job would be better with a PHD, go for it. If not, it might not be worth the time and years lost gaining rank/experience and pay. Don't get me wrong, I love academia for the sake of it, but it doesn't pay well and in some fields you might be better off taking a higher paying job.",
              "author": "Lomelinde",
              "created": 1602615649,
              "upvotes": 42,
              "replies": {
                "g8pzxo7": {
                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8pzxo7/",
                  "text": "I think I'd enjoy being a professor. I don't care too much about the prestige of the hypothetical institution I'd work at, but I think getting to do some combination of teaching and research, and have lots of schedule flexibility over the summers would be great. The pay for my education and skills outside of academia is also not so great. Like usually 60K-80K in a high cost of living area. Professors seem to earn at the high end of that or higher. But also, I know not everyone gets to be a professor. And I'm not sure what usually happens to the ones who don't. So, that's one thing I'm trying to figure out...",
                  "author": "BayAreaDreamer",
                  "created": 1602616973,
                  "upvotes": 11,
                  "replies": {
                    "g8qd7n7": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qd7n7/",
                      "text": "Your plan A can't be proffessor. The odds against it are very, very high. Your default plan must be something else and if the stars align proffesor.\n\n95% of PhDs don't become proffesors, its like going into a sport's science degree and thinking \"well I'd like to be involved in coaching the England world cup team they seem to pay well\". It's not realistic.",
                      "author": "drinkermoth",
                      "created": 1602623153,
                      "upvotes": 34,
                      "replies": {
                        "g8qgbds": {
                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qgbds/",
                          "text": "Yes. To add to the analogy, it's like saying \"well if I can't coach the English in the world cup maybe I can coach the American team. I don't mind something less prestigious.\"",
                          "author": "IamRick_Deckard",
                          "created": 1602624605,
                          "upvotes": 12,
                          "replies": {
                            "g8qh6dy": {
                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qh6dy/",
                              "text": "Any it's not to say don't do the degree or anything else, but go into it open eyed about the actual jobs 95% of graduates end up in (it's not tenured academic positions). Those other jobs can be great... if those are the jobs you'd like to do.",
                              "author": "drinkermoth",
                              "created": 1602625054,
                              "upvotes": 5,
                              "replies": {
                                "g8qovpc": {
                                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qovpc/",
                                  "text": "Is the figure really 95% in STEM? That's terrible.",
                                  "author": "IamRick_Deckard",
                                  "created": 1602629214,
                                  "upvotes": 2,
                                  "replies": {
                                    "g8qri7n": {
                                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qri7n/",
                                      "text": "The number varies, but it's not in STEM its just a rule for academia. There are only so many permanent academic jobs.\n\nLets imagine that there are 100 permanent academic jobs. Each permanent academic, over thier lifetime will have between 1 and 4 PhD students every year, lets say it takes 4 years to finish a PhD (ok for the UK), so thats a PhD completion rate of between 0.25 and 1 a year. \n\nLets say the average academic is in post from 35 - 60 (many stay n into their late 60s or 70s or may start from even earlier), thats 25 years thats between 6 and 25 PhD students from that academic over their career.  When they retire thats 1 job back into the pool. Each year we might expect 3-4 of the 100 PIs to retire, thats 3-4 positions for this potential 25 - 100 PhD graduates. \n\nIn reality those numbers aren't quite right, and some estimates are that only around 12%^1 to 3.5%^2 of students will end up in permenant positions (~88% do other brilliant things). But it still takes many, many years to get to a permenant position. Years of struggle to get to the top isn't something to be surprised at, but years of being the world's expert on a topic before your first permenant job is not healthy for you as a person. \n\nThis isn't a STEM issue. And it's even worse when you think about the ratios for undergraduates or Master's students where the chances of success are fractional. Again, PhD students, by getting to where they are have already demonstrated themselves to be among the most suited to academia our of a pool of people who have chosen to spend 3-4 years of their life studying a topic. Successful PhD students are amoung the 1% of most educated (not neccessarily the smartest 1% though!) people on the planet, yet they are still years and years from their first permenant positions.  \n\nedited for sense\n\n^1 https://pubmed.ncbi.nlm.nih.gov/25642132/\n\n^2 https://www.nature.com/articles/d41586-018-06873-5",
                                      "author": "drinkermoth",
                                      "created": 1602630729,
                                      "upvotes": 7,
                                      "replies": {
                                        "g8qru93": {
                                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qru93/",
                                          "text": "I know it's bad out there, but had never heard a figure. But I think your numbers are off (or maybe UK-focused?) There are many permanent academics that will never have a PhD student. They teach at an undergrad-only institution, or their dept doesn't have any grad students. Or stops at master's level.",
                                          "author": "IamRick_Deckard",
                                          "created": 1602630920,
                                          "upvotes": -1,
                                          "replies": {
                                            "g8qs31i": {
                                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qs31i/",
                                              "text": "The numbers I gave are published figures for the USA\n\nEdit: actually the first is the USA estimate for engineering degrees, the seconds is the UK. it comes from the following published report: https://royalsociety.org/~/media/Royal_Society_Content/policy/publications/2010/4294970126.pdf\n\nI thnk you're right that those academics exist, but they don't change the fact that overall, there are far too few permenant academic jobs for the graduates.",
                                              "author": "drinkermoth",
                                              "created": 1602631059,
                                              "upvotes": 2,
                                              "replies": {
                                                "g8s4jou": {
                                                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8s4jou/",
                                                  "text": "Also, you assumed that whenever a permanent academic retired, their position is given to somebody else and not simply closed.",
                                                  "author": "CaptainCornerCamper",
                                                  "created": 1602667475,
                                                  "upvotes": 4,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "g8rlyhc": {
                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rlyhc/",
                          "text": ">Your plan A can't be proffessor. The odds against it are very, very high. Your default plan must be something else and if the stars align proffesor.  \n>  \n>95% of PhDs don't become proffesors, its like going into a sport's science degree and thinking \"well I'd like to be involved in coaching the England world cup team they seem to pay well\". It's not realistic.\n\nExcept from what I've read on this sub, it's different if you go to a business PhD program. Supposedly, if you can get into one of those programs, your odds of becoming a professor afterward are very good. That's why I specifically addressed it in my post up above.",
                          "author": "BayAreaDreamer",
                          "created": 1602648965,
                          "upvotes": 1,
                          "replies": {
                            "g8rqk4g": {
                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rqk4g/",
                              "text": "As a business PhD, my view is that it's not that different really. It's probably easier to become a professor than with, for instance, an anthropology degree, but still super difficult and competitive. As others have said, don't count on the professorship plan. If you decide to pursue the degree and it happens, good for you, but typically it requires a lot of sacrifice and luck and still most likely doesn't work out.",
                              "author": "toutain",
                              "created": 1602652623,
                              "upvotes": 8,
                              "replies": {
                                "g8tcii0": {
                                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8tcii0/",
                                  "text": "Agreed that it's different but not *that* different. Here is one article comparing relative ranks of placements in business and computer science (both very in-demand) with history (very not): https://advances.sciencemag.org/content/1/1/e1400005.full. That's among people who go into academia, not what share go on to academia, but still informative.\n\nLook at your potential schools' placement records. Then bear in mind that probably 1-2 people a year aren't listed because they haven't found a job yet at the time the site was put online - maybe even up to 5-6 depending on if the school cheats by \"hiding\" bad placements (e.g. obscuring that a position is a post-doc or lecturer position). Then count how many got academic jobs at an institution you'd be happy with - maybe you'd be happy only in a certain country or major city, maybe you'd truly be happy anywhere. While some people go into the PhD thinking they want to do the private sector afterwards, *very few do* (else they could get farther ahead by working - the PhD effectively lowers their salary, compared to a master's or MBA, especially in business). So you have to assume that *most*, but not all, of the people with private sector jobs didn't want that.\n\nI agree that the average in business will get a job that pays upwards of 100k in academia. But, you should think hard about the 25th, 50th, 75th percentile and not assume you'll be in the upper half, because everyone else who is coming in will have the same background and track record of always doing well. Basically, if 50% get a well-paying, desirable tenure-track job and 50% don't, I'd be worried, even if that is much better than other fields.",
                                  "author": "uniadminthrowaway",
                                  "created": 1602696375,
                                  "upvotes": 2,
                                  "replies": {}
                                },
                                "g8rrujh": {
                                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rrujh/",
                                  "text": "\\>  As a business PhD, my view is that it's not that different really. \n\nAre you familiar with \"the PhD project\". That is the source that does worldwide surveys of business PhDs, and upon which people in this sub seem to base the assertion that the average business PhD will receive a tenure track job upon graduating that pays upwards of 100K. This is compared to Anthropology, where most will not find a tenured track position at all, and the lucky ones will find an adjunct position for 60 or 70K. That seems like a pretty dramatic difference. Are you suggesting that the information in \"the PhD project\" is bad or misleading somehow?",
                                  "author": "BayAreaDreamer",
                                  "created": 1602653744,
                                  "upvotes": -2,
                                  "replies": {
                                    "g8s68ky": {
                                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8s68ky/",
                                      "text": "Based on this reference, I'm unable to evaluate the methodology of the PhD project. Nevertheless, the idea that an average PhD graduate would receive any tenure track job seems highly implausible. The number of new PhDs every year is vastly higher than the number of open positions. Now with Covid-19, the situation is getting even worse.\n\nTenure track positions are few and far between and highly competitive. You easily get hundreds of applications for a single open position at a decent university.",
                                      "author": "toutain",
                                      "created": 1602669450,
                                      "upvotes": 3,
                                      "replies": {
                                        "g8szjer": {
                                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8szjer/",
                                          "text": "Have you looked at the outcomes of recent business PhD grads at your school, and is that what you're using to form an opinion here?",
                                          "author": "BayAreaDreamer",
                                          "created": 1602689915,
                                          "upvotes": 0,
                                          "replies": {
                                            "g8vr8zx": {
                                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8vr8zx/",
                                              "text": "My view reflects the shared understanding and sentiment of academics in my field. While I'm naturally biased as well, I can confidently say that no one that I've discussed the job market with has disagreed over the basic situation.\n\nIt is also supported by common sense as /u/drinkermoth explained. A vast number of new PhDs graduate every year, whereas only a few professors retire or leave academia. For every new PhD to get a tenure track position, the size and funding of business schools would need to grow at a massive pace. In practice, most PhD's don't even try to get academic positions and most of those who do need to be willing to travel globally for short (often low-paying) postdoc positions while applying for professorships. This requires a lot of personal sacrifice and flexibility, and still, the results are not guaranteed.\n\nAcademy of Management recently posted stats from their job board that showed how the ratio of applicants to open positions had increased drastically. While not the whole truth, it indicated increasing competition in the field. I tried to google the stats that I saw, but couldn’t find them at a first try.",
                                              "author": "toutain",
                                              "created": 1602751199,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        },
                                        "g8t6d52": {
                                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t6d52/",
                                          "text": "The PhD project for their part actually links to the AACSB site (the business accrediting institution) which is where I guess a lot of their salary information comes from: \n\nhttps://www.aacsb.edu/-/media/aacsb/publications/data-reports/global-salary-survey/scds\\_exec\\_summ\\_2020\\_final.ashx?la=en&hash=532C30A666D5CFF96C951BACCE75407A2BEF2F53",
                                          "author": "BayAreaDreamer",
                                          "created": 1602693330,
                                          "upvotes": 0,
                                          "replies": {
                                            "g8vqcjo": {
                                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8vqcjo/",
                                              "text": "I don't question the salary info, although it varies a lot by country and region. The AASCB report appears to report mainly the situation in the US. I would say that the more relevant question is what are the chances of getting a permanent position.",
                                              "author": "toutain",
                                              "created": 1602750161,
                                              "upvotes": 1,
                                              "replies": {
                                                "g8vtodc": {
                                                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8vtodc/",
                                                  "text": "That is fair. I had read a comment in another thread on this sub at one point that asserted that the average business school PhD would have two tenure track offers upon graduating. But whether that information is totally up to date, and whether it depends more on sub fields, etc. I could not tell you.",
                                                  "author": "BayAreaDreamer",
                                                  "created": 1602754054,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "g8vukuk": {
                                                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8vukuk/",
                                                      "text": "Two tenure track offers upon graduating sounds like a fantasy. I would strongly suggest evaluating critically whether that can be possible as it is in strict contrast with the mainstream view of the academic job market.",
                                                      "author": "toutain",
                                                      "created": 1602755104,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "g8yhvma": {
                                                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8yhvma/",
                                                          "text": "I believe that different fields could operate differently from one another though. Why would it be otherwise? The same person who made that claim also said that AACSB tries to regulate how many people are admitted to PhD programs at their institutions, because they don't want a flooded job market. But maybe 2 tenure track offers per person isn't the norm, maybe that was the case at his institution because it was a top-ranked one or something. That I don't know...",
                                                          "author": "BayAreaDreamer",
                                                          "created": 1602810393,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "g8z43qr": {
                                                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8z43qr/",
                                                              "text": "If you're at a top-ranked programme and have a good supervisor who will support/co-author with you in publishing in A+ journals, you will have a great starting point for an academic career. Unfortunately, most aren't in such a good position. The game has gone tougher in the last decades. A+ publications were before something that a professor would maybe land once in their career, if lucky. Now they're practically expected from a recent PhD graduate if you want to land a tenure track position at a good uni. It's really a crazy world, and many brilliant people spend many years trying, burn themselves out, and still don't succeed. \n\nThe number of new PhDs is increasing, also in business fields. This data shows a 36% increase in their numbers in the US from 2010 to 2015 and a 101% increase from 1985 to 2015. https://www.nsf.gov/statistics/2017/nsf17306/ \n\nI believe that if you wish to pursue a PhD, the only sane plan is to aim for a healthy work-life balance and try your best. Becoming a professor is a great goal to have, but it can't be the only possible option. You can't plan your life on winning the lottery either.",
                                                              "author": "toutain",
                                                              "created": 1602824855,
                                                              "upvotes": 1,
                                                              "replies": {}
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "g8s8oxk": {
                                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8s8oxk/",
                                      "text": "I can't see any links to any primary research in this area on their website (which is genuinely unusual for an org that provides surveys), they don't appear to be a verifiable source of information.\n\nI'm not saying that they are bad operators, but they do not appear to be somewhere you can get unfiltered, unbiased sources of information, they appear to be providing resources and encouragement (which are good things too!).\n\nBasically, show me the peer reviewed paper, as I have done for you, and I'll belive it.",
                                      "author": "drinkermoth",
                                      "created": 1602672146,
                                      "upvotes": 5,
                                      "replies": {
                                        "g8t3m1f": {
                                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t3m1f/",
                                          "text": "> Basically, show me the peer reviewed paper, as I have done for you, and I'll belive it.'\n\nWait, you've done that for me? I can't see a link in any of your comments. The PhD project for their part actually links to the AACSB site (the business accrediting institution) which is where I guess a lot of their salary information comes from: https://www.aacsb.edu/-/media/aacsb/publications/data-reports/global-salary-survey/scds_exec_summ_2020_final.ashx?la=en&hash=532C30A666D5CFF96C951BACCE75407A2BEF2F53",
                                          "author": "BayAreaDreamer",
                                          "created": 1602691950,
                                          "upvotes": 1,
                                          "replies": {
                                            "g8t9py5": {
                                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t9py5/",
                                              "text": "These were the peer-reviewed papers that I have linked to in my other comments:\n\n1 https://pubmed.ncbi.nlm.nih.gov/25642132/\n\n2 https://www.nature.com/articles/d41586-018-06873-5\n\nAnd this report on PhD prospects \n\n3 https://royalsociety.org/~/media/Royal_Society_Content/policy/publications/2010/4294970126.pdf\n\nAll of these indicate that the chances of getting a permenant academic position after a PhD are not in anyones favour. \n\nI read your report, the Staff Compensation and Demographics Survey of 2019-2020(https://www.aacsb.edu/-/media/aacsb/publications/data-reports/global-salary-survey/scds_exec_summ_2020_final.ashx?la=en&hash=532C30A666D5CFF96C951BACCE75407A2BEF2F53). It doesn't comment on the empolyment prospects of graduates at all, only the history of those currently employed. \n\nOnce again I say: it might be that case that for buisiness degrees buck the trend and its really easy to get a full time permenant academic position after a PhD. I see no evidence of that but if you have any I'll be happy to take a look at it.",
                                              "author": "drinkermoth",
                                              "created": 1602694983,
                                              "upvotes": 2,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "g8rn99c": {
                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rn99c/",
                              "text": "While this could be true, I'm really not entirely sure as I'm in an agriculture program and the ag business professor jobs are relatively competitive, I would still suggest looking at multiple options. \n\nIt's ok to want to be a professor. You can still apply and maybe get the job! But don't pick a PhD JUST based on that. Think of a few options with some research on jobs that you would be just as happy with. There's so many niche positions with good salaries many don't know about. \n\nTo sum what I'm saying, it's a great goal to be a professor, but try to find a few more things you're interested in as well before picking what specific field you want to research. That way, you wouldn't spend years on research and hard work for one job outlook that you may or may not be able to get.",
                              "author": "Philosophicalchicken",
                              "created": 1602649951,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "g8r0zay": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8r0zay/",
                      "text": "Most phd’s don’t become professors. Get a more realistic plan A, is my suggestion.",
                      "author": "planetbyter",
                      "created": 1602636151,
                      "upvotes": 7,
                      "replies": {}
                    },
                    "g8r936g": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8r936g/",
                      "text": "I have my PhD in the social sciences, and I work in industry. There's no one thing that \"usually\" happens to the people who leave academia, other than the fact that we are overwhelmingly employed (the unemployment rate for PhD holders is very low). My field, UX research, is a major destination. So is market research, which is a related field. Other than that, there's a very wide range - and not even everyone remains in research-focused roles.\n\nThat said, \"I think I'd enjoy being a professor\" is *not* the same thing as \"I want to be a professor.\" To lomelinde's point, working backwards from what you want to do is more about identifying the career you want to have and then getting the credentials you need from that career. Deciding that you would probably enjoy one thing you could do with a PhD...that's not really working backwards.",
                      "author": "roseofjuly",
                      "created": 1602640605,
                      "upvotes": 3,
                      "replies": {
                        "g8rma66": {
                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rma66/",
                          "text": ">Deciding that you would probably enjoy one thing you could do with a PhD...that's not really working backwards.\n\nWell, of the careers I'm aware of, I think being a professor is what I might enjoy most. But I'm not saying that with total certainty, because I'm not sure how I'd know with certainty without, well, doing the job first. \n\nUX Research is actually something that somewhat interests me as well, and that does not seem to require a PhD, so has the advantage of less sunk cost. However, the folks over on the UX Research sub are also very negative regarding current job prospects in the field for newcomers. It seems like social science related opportunities that don't have lots of folks feeling discouraged are few and far between.",
                          "author": "BayAreaDreamer",
                          "created": 1602649211,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "g8sp13b": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8sp13b/",
                      "text": "If pay is an important consideration for you, I’d recommend considering the business PhD instead of the social sciences. At my university (R1, urban, but lower-tier public), the salaries in the business school are MUCH higher than those in the social sciences. Social scientists here are mostly in the 60K-80K range (a few full professors make more, but not too many - the major exception is economics), while B-school (and econ) assistant profs routinely start at over 100K. This makes sense from a market perspective, since these fields are also in demand in the private sector. All that said, our pay is on the low end for our peer institutions in the US.\n\nI can’t speak to how difficult it is to get TT professor jobs in all fields, but I can say that in my own field the supply of new PhDs now greatly exceeds the demand. None of my former PhD students have TT jobs. I would recommend that you do your research on the fields that interest you, but you also have to take into account that higher education has been in crisis for some time. (My own university isn’t hiring at all this year, and even before the pandemic, there were only a few lucky departments getting to conduct searches for assistant professor positions. It has been this way for at least five years, and probably more.)\n\nAs for the experience of PhD vs masters, there are some great comments elsewhere, but I’ll add a couple of thoughts based on my own experience and my experience as an advisor. For many students, doing a PhD can feel like running a marathon, but late at night on an unmarked and unlit track, with no one else around except the occasional competitor. It’s a long and often lonely haul, and the challenge of figuring out what your research is all about can be draining. If you run up against the pettiness and narcissism that are so common in academia, it can be even worse. But as with all things, your mileage may vary. If you have a supportive advisor and a collegial cohort of fellow grad students, you can have a great experience.\n\nFinally, as for being a TT professor, it’s very, very different from being a student. Many professors love their jobs, to be sure, but many of us feel disillusioned. It’s a career that is easy to romanticize. I’d recommend talking to as many academics as you can to get a sense of what the job is all about. And as others have said, have alternative plans at the ready.",
                      "author": "tlamaze",
                      "created": 1602684338,
                      "upvotes": 1,
                      "replies": {
                        "g8sykap": {
                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8sykap/",
                          "text": "What things about your job (other than pay) make you feel disillusioned?",
                          "author": "BayAreaDreamer",
                          "created": 1602689417,
                          "upvotes": 1,
                          "replies": {
                            "g9afa46": {
                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g9afa46/",
                              "text": ">I worked long hours, but getting to choose what to study and what to do research on was really fun. I especially enjoyed getting to do independent research with original data. It was especially a joy after having spent 10 years in the workforce, and feeling really ground down by the lack of intellectualism, the lack of rigour of thought and just plain repetitiveness that seems so common in office culture\n\nThat's a good question, and it's a tough one to answer easily. I think it's a combination of many things.\n\nFirst, I know that many professors are fortunate enough to remain excited about their research topics after several years of working on them. But many of us are not. There are a lot of associate professors (this is my rank) who find themselves burned out and floundering. What seemed exciting in graduate school may no longer seem worth the trouble.\n\nSecond, even if you have a TT job at an R1 institution, it's very difficult to find the time to work on your research anyway. When I was working on my dissertation, I was fortunate enough to have a fellowship that just let me work full time on my research. I see now what a luxury that was. Now, we have to squeeze that in, in between all of the other responsibilities that take so much time: grading, reviewing papers, serving on committees, filling out endless paperwork, etc. Again, some of these things felt exciting at first, but after 10 years, they lose their luster. \n\n(You mentioned the \"plain repetitiveness\" in office culture. Well, that also applies to teaching the same course 20 times. Yes, you can and must modify your courses to keep them fresh, but every time you make a major change to your course, you're making a major investment of time - and that's inevitably going to cut into your time for research. You simply can't reinvent the wheel and come up with entirely new assignments every time you teach your course.)\n\nIt's also frustrating (and this may be an R1 problem) to care about teaching, and to strive to do it well, but to find that so many of your peers do not. At many R1s, teaching plays absolutely no role in promotion decisions, for example. It's deeply frustrating to see people who are known to be terrible, uncaring teachers get promoted.\n\nIt's true that some professors are fortunate enough to find the kind of intellectual community that I fantasized about (my father was one of them), but for me, that just hasn't been the case. There's not a lot of intellectual community in my own department, and my efforts to find it elsewhere on campus have never led anywhere. \n\nWhen I was a graduate student, I was excited about guest lectures and conference papers. At this point, I've decided that most academics simply aren't very good at presenting their research.\n\nAnd then there are the other well-known foibles of academic life. Not all professors are arrogant narcissists with no social skills, but there are enough of them around to make life hell sometimes. You see all kinds of petty behaviors that I'm sure are just as common in the world of industry. I could get into the frustrations of dealing with university bureaucracies too, but that would get tedious fast...\n\nFinally, there's the fact that the higher education landscape is changing so much and so rapidly. We've been the target of budget cuts and political attacks, and this can be extremely demoralizing. There have been a few years in which you could practically smell the collective unhappiness on campus.\n\nAgain, I know I'm lucky to have my position, and the job has given me some opportunities I've been grateful for. I'm certainly not utterly miserable or anything like that (although I did seriously consider leaving the profession shortly after receiving tenure, and I am still planning on an early retirement if possible). And I do like the slower pace and freedom of the summers, even if it's never actually \"time off.\"\n\nBut the bottom line is that the life of many (maybe even most?) professors seldom takes the form of a joyful \"life of the mind\" or an exciting intellectual adventure. A lot of it is a grind, just like any other job.\n\nYou might want to read some of the articles that have come out about associate professors - in general, I strongly encourage you to read the Chronicle and Inside Higher Ed. Here are a couple of interesting ones about unhappy associate profs: [https://www.chronicle.com/article/why-are-associate-professors-so-unhappy/](https://www.chronicle.com/article/why-are-associate-professors-so-unhappy/) (it has a paywall, unfortunately) and [https://www.insidehighered.com/news/2012/06/04/associate-professors-less-satisfied-those-other-ranks-survey-finds](https://www.insidehighered.com/news/2012/06/04/associate-professors-less-satisfied-those-other-ranks-survey-finds).",
                              "author": "tlamaze",
                              "created": 1603076966,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "g8r8t6d": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8r8t6d/",
                      "text": "Depending on your area, I'll disagree with the other commenter. A PhD in Economics from a top 100 US program (so like 70% of programs in the US) will almost certainly lead to a career in academia (if you want it to). This is especially true if you're a native English speaker and/or from the US. (I'm not saying it necessarily _should_ be that way, but there does actually seem to be some preference given.) It sounds like your policy background might make you a good candidate for an Econ PhD if you're interested, depending on your math interests/abilities.",
                      "author": "NotMitchelBade",
                      "created": 1602640452,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g8qaa7t": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qaa7t/",
              "text": "This is true. My PhD is in organizational behavior. The job market is hard this year but not as hard as in other fields. You can ask me specific questions if you want.\n\nOh and make sure you get into a aacsb accredited program.",
              "author": "ThatProfessor3301",
              "created": 1602621922,
              "upvotes": 3,
              "replies": {
                "g8qemm8": {
                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qemm8/",
                  "text": "Hey! Can i also PM you? I have an MS in organisational psychology and thinking about a PhD",
                  "author": "bombaysparkle",
                  "created": 1602623755,
                  "upvotes": 3,
                  "replies": {
                    "g8qvbwz": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qvbwz/",
                      "text": "Yes.",
                      "author": "ThatProfessor3301",
                      "created": 1602632942,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "g8rn2h6": {
                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rn2h6/",
                  "text": "Hey, I'd love to chat more about your experiences. I think my questions would include things like: \n\n\\- Do I need to have some sort of formal psychology or organizational behavior education before applying for this in order to be a competitive candidate? Would studying public policy and anthropology and having read a lot of books on certain aspects of psychology count for something?\n\n\\- I read that for business PhD programs it's actually discouraged to reach out to specific professors to discuss their research interests before applying. Was this your experience, or do you think trying to reach out to individuals first would be a good idea?\n\n\\- Are there certain subfields or focuses that are more \"hot\" than others right now, and thus areas you'd recommend I focus on for a proposal?\n\n\\- While I have years of real work experience, and some experience hiring and training other staff, I've never worked in an HR function. Do you think the lack of having worked in HR or a related function or having done research directly related to organizational psychology would hurt me? \n\n\\- If the answer to either of the above is yes, what kind of experience do you think would best help prepare someone? Formal classes in the area? Trying to get some kind of research assistantship in the area, paid or unpaid? Seeking an HR role? Etc...\n\n\\- Most of my existing work experience is for non-profits, small and large. Do you think basing a proposal off of the kinds of organizations I've worked with is viable, or are business schools more interested in PhD candidates with corporate experience or focus?\n\n\\- I've seen that PhD acceptance rates at top schools are pretty competitive - like 3% or something. Do you have any idea what the acceptance rate range is for AACSB business schools? How do I know which schools might be less competitive? \n\n\\- If you get a PhD from an AACSB accredited school outside the U.S., does that hurt your employment chances inside the U.S.?  \n\n\nThank you very much for offering to share your experience. I am truly very interested in learning more!",
                  "author": "BayAreaDreamer",
                  "created": 1602649806,
                  "upvotes": 1,
                  "replies": {
                    "g8ssw99": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8ssw99/",
                      "text": "> - Do I need to have some sort of formal psychology or organizational behavior education before applying for this in order to be a competitive candidate? Would studying public policy and anthropology and having read a lot of books on certain aspects of psychology count for something?\n> \nFor a decent school, you need to score in the top 10% of GMAT/GRE.\nFor a top school, you would probably have to have some research experience in psych or business.\nReading is not going to put you ahead of anyone.\n\n> - I read that for business PhD programs it's actually discouraged to reach out to specific professors to discuss their research interests before applying. Was this your experience, or do you think trying to reach out to individuals first would be a good idea?\nI think it would be a good idea for sure.\n> \n> - Are there certain subfields or focuses that are more \"hot\" than others right now, and thus areas you'd recommend I focus on for a proposal?\nIt all depends on who you want to work with. If a professor focuses on x, she won't care how hot field y is. \n\n> - While I have years of real work experience, and some experience hiring and training other staff, I've never worked in an HR function. Do you think the lack of having worked in HR or a related function or having done research directly related to organizational psychology would hurt me?\n> Work experience is not important. It may matter when you teach but not at this stage. \n\n> - If the answer to either of the above is yes, what kind of experience do you think would best help prepare someone? Formal classes in the area? Trying to get some kind of research assistantship in the area, paid or unpaid? Seeking an HR role? Etc...\n> \n> - Most of my existing work experience is for non-profits, small and large. Do you think basing a proposal off of the kinds of organizations I've worked with is viable, or are business schools more interested in PhD candidates with corporate experience or focus?\n> A PhD is about training you to do research, not to work in industry.\n\n> - I've seen that PhD acceptance rates at top schools are pretty competitive - like 3% or something. Do you have any idea what the acceptance rate range is for AACSB business schools? How do I know which schools might be less competitive?\nYou want to go to the best school you can get into. If you have a strong application, go for the top 10 schools in your research area. \n> \n> - If you get a PhD from an AACSB accredited school outside the U.S., does that hurt your employment chances inside the U.S.?\nNo. It goes by ranking of your school and your own publication record, not location. If you graduate from a school outside of the US, you may want to put in the CV that it is aacsb accredited.",
                      "author": "ThatProfessor3301",
                      "created": 1602686459,
                      "upvotes": 1,
                      "replies": {
                        "g8sxxzn": {
                          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8sxxzn/",
                          "text": "Thanks for your responses! Regarding the GMAT, I have taken it and scored a 96% overall, although more heavily weighted toward verbal (99% at 47 for verbal vs. 49% at 44 for math).\n\nI actually tried applying to a few top MBA programs last year, and got interviewed at most and then rejected from all. In retrospect, it was probably for the best, because I'm not sure a professional business position would suit me that well.\n\nFor my Master's in public management, which I wound up pursuing instead,  I have something equivalent to like a 3.7 U.S. GPA, with strong grades in a few stat classes. My BA was weaker but also a long time ago. \n\nI also have independent research experience, but no classwork or research experience in the areas of psych or business. I have to imagine that might count significantly against me? \n\nHow would you recommend I go about figuring out which schools I'd have a chance at and/or closing that gap in experience? I'd assume either way I should probably familiarize myself with the work of the professors at the schools I'm looking at, to understand their focus and methodology, etc...",
                          "author": "BayAreaDreamer",
                          "created": 1602689095,
                          "upvotes": 1,
                          "replies": {
                            "g8t0awz": {
                              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t0awz/",
                              "text": "For an mba, especially a top mba, you need strong work experience but not for a PhD. They are very different degrees with different requirements. \n\nThe lower quant score may hurt you in some schools but not in others. Don’t be afraid to contact a PhD director with specific questions.\n\nAdded: if you are black, Hispanic or indigenous, consider joining the PhD project.",
                              "author": "ThatProfessor3301",
                              "created": 1602690299,
                              "upvotes": 1,
                              "replies": {
                                "g8t3dxz": {
                                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t3dxz/",
                                  "text": "> if you are black, Hispanic or indigenous, consider joining the PhD project.\n\nI am not. I am a woman, but imagine in a field like Organizational Behavior that isn't as rare.",
                                  "author": "BayAreaDreamer",
                                  "created": 1602691836,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "g8rdq1z": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rdq1z/",
              "text": "Hi. Currently poli sci major here considering grad school - what field is your masters in?",
              "author": "pettytally",
              "created": 1602643390,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g8qdrl9": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qdrl9/",
      "text": "It's hard to say given the information you've provided, and it's important to understand how different one's mileage will vary on these things. One general key distinction to keep in mind is that Masters students generally pay their way through the coursework. As such, your responsibilities are basically limited to being an active, engaged student in seminar.\n\nConversely, PhD students are generally paid positions of employment. You might be required to teach an undergraduate course, to clean data for your advisor, etc. Your work assignment will likely be tied to your research interests in some way, but \"getting to choose what to study\" rarely comes into the picture here, and certainly not all of it is \"really fun.\" Doctoral students are still, of course, students -- but they're also assigned a job as a consequence of being paid to be there.\n\nNow, speaking to more personal experience here, I will say that my PhD program is simply far more rigorous and demanding than my Masters program; simply put, the originality of work is incredibly important. As a Masters student, I was afforded the luxury to pursue, for the lack of another way of putting it, \"vanity\" projects. I spent each of my seminars researching certain things simply for my personal enjoyment. As a PhD student, I'm still pursuing work I find compelling, but I am also expected to justify the work I am doing and to explain how my work contributes to the literature. Pretty much everything I do is still driven by my personal interests, but I have to regularly explain how the work I am doing _is significant._\n\nThere are just certain political, technical, and interpersonal realities I deal with as a PhD student that I did not as a Masters student. To put it bluntly: as a Masters student, I did a lot of the work I did simply for personal fulfillment; as a PhD student, I do a lot of the work I do in response to what others are doing (or not doing).\n\nOne last thing, and it's really a small thing, but as a Masters student I still looked at seminars as if they were undergraduate classes. I did things for the grade, and I completed my degree in the pursuit of a job. To some extent my PhD is still a marker of employment status, but my primary motivation for pursuing a PhD is to perform research. None of the grades really matter, and pretty much all the work I do in my courses either feeds into some kind of publishable project or ties into my dissertation. Generally, the most successful PhD students have a pretty clear idea of why they're applying to a program and have some inkling of an idea of what they want their dissertation to be.\n\nEven if that's not what your dissertation actually ends up becoming, there's a much bigger emphasis on big-picture thinking at the PhD level that is rarely expected of Masters students, and that is one of the integral qualities that separates good PhD students from good Masters students.",
      "author": "Im_A_Quiet_Kid_AMA",
      "created": 1602623389,
      "upvotes": 22,
      "replies": {
        "g8rnat6": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rnat6/",
          "text": "This is a really good, nuanced response. Thank you!",
          "author": "BayAreaDreamer",
          "created": 1602649984,
          "upvotes": 4,
          "replies": {}
        },
        "g8qpcdf": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qpcdf/",
          "text": "So some of the comments say to think of the job you want afterwards when deciding on doing a PhD.  For you it sounds like your end goal was doing research and a PhD was just a part of that.  How much did the kind of job you get once finished influence your decision going in?  And can I ask what field you’re in?",
          "author": "crispycabbages",
          "created": 1602629483,
          "upvotes": 1,
          "replies": {
            "g8rdtuk": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rdtuk/",
              "text": "When I meant that I completed my Masters degree in the pursuit of a job, I meant that a Masters degree was just a means to an end to jump-start my career. I was not particularly invested in the coursework beyond my identity as a student.\n\nI am working on a PhD because I am actively pursuing a career _in research_, and what I do now is directly tied to the kind of work I want to do on the other side of my PhD. That is not always the case for a Masters degree.",
              "author": "Im_A_Quiet_Kid_AMA",
              "created": 1602643457,
              "upvotes": 3,
              "replies": {
                "g8s80xj": {
                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8s80xj/",
                  "text": "Hey! Completely off topic, but I noticed that your PhD is on education. Is it okay if I dm you to ask you more questions about the subject?",
                  "author": "ravenpaw_15",
                  "created": 1602671427,
                  "upvotes": 1,
                  "replies": {
                    "g8shqeg": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8shqeg/",
                      "text": "Certainly.",
                      "author": "Im_A_Quiet_Kid_AMA",
                      "created": 1602679845,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g8qe9gg": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qe9gg/",
      "text": "I think you should identify a job you want, and decide whether a PhD will help you obtain it or qualify you for it.",
      "author": "isaac-get-the-golem",
      "created": 1602623603,
      "upvotes": 10,
      "replies": {}
    },
    "g8qfhgk": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qfhgk/",
      "text": "The degree of affection on studying becomes progressively smaller and smaller as you go further. \n\nBachelor, you love it. It's a lifetime of opportunity where you can study the unknowns and find the love of your life. \n\nMaster, you enjoy it. It's an another notch up in the unknown and professors love you. It's because **you paid the tuition fee.**\n\nPhD, you'd either enjoy or hate it. It's because you'd get paid for the tuition fee and your advisor might abuse you.\n\nPostdoc, you'd definitely hate it.",
      "author": "yourseck",
      "created": 1602624167,
      "upvotes": 11,
      "replies": {
        "g8qi6pc": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qi6pc/",
          "text": "Most of my colleagues would say the opposite.  Bachelors is unfocused, MS a bit better, PhD you get to delve into what you want, and postdocs are the best because you're full time research, paid better, and less BS responsibilities compared to faculty.\n\nSo I guess YMMV.\n\nAs to the original question, I'd echo the rest - it really depends if a PhD is important for where you want to be.  It's a temporary job; don't take it if it's not the direction you want to go long-term, even if the temp job is fun.",
          "author": "thuja_plicata",
          "created": 1602625590,
          "upvotes": 9,
          "replies": {
            "g8r9b69": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8r9b69/",
              "text": "I enjoyed the *intellectual* experience of the PhD much more. However, I definitely enjoyed the *overall life* experience of getting a bachelor's more.\n\nI think that might be what yourseck was getting at.",
              "author": "roseofjuly",
              "created": 1602640731,
              "upvotes": 5,
              "replies": {
                "g8rb9b1": {
                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rb9b1/",
                  "text": "Ah, sure.  I see that point now. Thanks.",
                  "author": "thuja_plicata",
                  "created": 1602641865,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g8rngex": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rngex/",
          "text": "Man, I did \\*not\\* enjoy my BA at all, and found MA to be much better. So I cannot relate to you on the BA front. For me life maturity, experience in the real world and realizing how much that actually sucks, and also getting to focus more narrowly on my interests in MA all played a significant role though I think.",
          "author": "BayAreaDreamer",
          "created": 1602650100,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8qg59z": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qg59z/",
      "text": "I echo others who say that you should determine whether the career/life you want will require a PhD. If so, I strongly recommend you go for it! I was in a similar position. I did a one year Master's and loved it! Then, I spent two years in the workforce and found the lack of intellectual rigor a total slog. I went into my PhD with a huge amount of energy because I was so happy to be there! I entered a PhD in a brand new discipline, and within my second year, I published two first authored papers in flagship journals. Based on what you said, I think you will find a similar excitement/intrinsic motivation coming into the program. I had a blast during my PhD, but only because I was so happy to be there after the workforce. Whatever you do, good luck!",
      "author": "memento_mori_92",
      "created": 1602624514,
      "upvotes": 4,
      "replies": {
        "g8rnrja": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rnrja/",
          "text": ">I entered a PhD in a brand new discipline, and within my second year, I published two first authored papers in flagship journals\n\nHow did you do this? (Both entering the PhD in a new discipline, and publishing quickly, I mean). What discipline were you in originally, and which did you switch to, if you don't mind me asking? \n\nAnd what did you wind up doing after the PhD?\n\nThanks again, and I appreciate the encouragement!",
          "author": "BayAreaDreamer",
          "created": 1602650337,
          "upvotes": 2,
          "replies": {
            "g8rpcd4": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rpcd4/",
              "text": "No problem! I have a very strange path, indeed. I was a professional actor for a number of years. Then, after discovering an interest in medicine (specifically, how arts and humanities can be used in medical contexts), I entered a master's degree in medical humanities and bioethics. After graduating from the one year master's program, I worked as a medical secretary for two years. While working as a secretary, I applied to PhD programs in a variety of disciplines, because no doctoral programs existed in medical humanities. I was accepted to several programs, none of which I had studied before, including medical anthropology and communication studies. I eventually went with the communication studies program because its emphasis was in health communication. During my master's program, I fell in love with end-of-life communication, so I figured this would be a great place to study my new passion and learn how to create research that could make an impact on the way we communicate about death in healthcare settings. As for publishing quickly, I was extremely energized and lucky. Because I was so happy to be there, I had an absurd amount of stamina, and conducted entire studies for my classes that were nearly ready for journals. The first thing I ever submitted to a journal, the flagship journal in my discipline (highest impact factor), was accepted with minor revisions. I was gobsmacked. A month later, another study I did in a class was accepted into the other flagship journal in my discipline. I am lucky, because my research is in a topic that is easy to justify the value of it. I am currently finishing my dissertation and applying for academic positions. I am humbled that people like my work at this stage of my career, and I completely attribute my success in the program to the fact that I came in hungry to learn. It sounds like you are also in a great state of mind to do something similar! Most importantly, the real reason that I was able to publish so much, is that I found a great friend and co-author. Two years ago, I had never even heard the term p-value, and now all of my publications are quanitative lol. That could have never happened without my good friend and co-author. Find someone else who is hungry and willing to work hard and do not miss opportunities to collaborate!  Sorry for the novel! I hope this is helpful. :)",
              "author": "memento_mori_92",
              "created": 1602651590,
              "upvotes": 1,
              "replies": {
                "g8rs4bg": {
                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rs4bg/",
                  "text": "I think that is a very cool story. I am actually currently working as a research assistant for a study on how social media is affecting the development of medical knowledge around COVID19, and the professor I'm working for has talked about trying to get my work published in a medical journal. I have a lot of independence in how I'm driving the project. It certainly seems like medical knowledge is one of the areas where there is potentially some real interest/value.",
                  "author": "BayAreaDreamer",
                  "created": 1602653990,
                  "upvotes": 2,
                  "replies": {
                    "g8rvgle": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rvgle/",
                      "text": "Awesome! Aim high. The worst they can say is no, and even if they do you will get feedback to improve the paper for a different journal submission.",
                      "author": "memento_mori_92",
                      "created": 1602657178,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g8r3vvq": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8r3vvq/",
      "text": "If you can have the job you want without a PhD, it's not worth it",
      "author": "yourmomdotbiz",
      "created": 1602637735,
      "upvotes": 4,
      "replies": {}
    },
    "g8qh37o": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qh37o/",
      "text": "Did your current PI ask you if you are interested in continuing as a PhD?",
      "author": "igon86",
      "created": 1602625007,
      "upvotes": 3,
      "replies": {
        "g8rnsrn": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rnsrn/",
          "text": "What is \"PI\"?",
          "author": "BayAreaDreamer",
          "created": 1602650363,
          "upvotes": 1,
          "replies": {
            "g8s8925": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8s8925/",
              "text": "Principal investigator. Basically, the person who's in charge of the lab you're at (i.e., your advisor).",
              "author": "Seankala",
              "created": 1602671674,
              "upvotes": 1,
              "replies": {
                "g8szd2q": {
                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8szd2q/",
                  "text": "Oh. In that case, I don't think things work that way in the country where I got my master's and from which I'm assisting in research. But I also don't want a PhD in the area that I'm currently doing research (it's enjoyable but perhaps not so tenable from a longterm career perspective).",
                  "author": "BayAreaDreamer",
                  "created": 1602689824,
                  "upvotes": 1,
                  "replies": {
                    "g8t7nqn": {
                      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t7nqn/",
                      "text": "Yes but they might be helpful in making up your mind and give you insights about longterm career perspectives in related fields.",
                      "author": "igon86",
                      "created": 1602693971,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g8t7evv": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t7evv/",
              "text": "Principal investigator = head of the lab = advisor.",
              "author": "igon86",
              "created": 1602693850,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g8rq6z2": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rq6z2/",
      "text": "I think this depends on so many things. I loved my MA and doing independent research for my thesis. Unfortunately, I did not have as much independence during my PhD to focus on research I cared about and I really didn’t get what I wanted out of the program. I think had I had a different advisor from the start, it would have been much different, though... so just choose your path carefully and wisely.",
      "author": "mirabelle7",
      "created": 1602652308,
      "upvotes": 3,
      "replies": {}
    },
    "g8t25kj": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t25kj/",
      "text": "Don't do a PhD, it's too risky for your mental health. Look up some stats about how many people are negatively affected compared to other professional groups. You have to be positively insane, brainwashed or naive to start one, IMO. Go for the money instead, and pay close attention to your work/life balance.",
      "author": "Javlington",
      "created": 1602691208,
      "upvotes": 2,
      "replies": {
        "g8t5ctx": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8t5ctx/",
          "text": "> Don't do a PhD, it's too risky for your mental health. Look up some stats about how many people are negatively affected compared to other professional groups. You have to be positively insane, brainwashed or naive to start one, IMO. Go for the money instead, and pay close attention to your work/life balance.\n\nI think you may underestimate the difficulty of making good money without a PhD too :P I'd say most women I know in their early and mid-30s have some mental health struggles. We're all well-educated, but not in a field highly in demand (pretty much mostly just tech these days from what I can tell), have difficulty getting promoted or making enough money to feel secure, start a family, etc. Really, this isn't only an academia struggle...",
          "author": "BayAreaDreamer",
          "created": 1602692819,
          "upvotes": 1,
          "replies": {
            "g8ucqf8": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8ucqf8/",
              "text": "Do what you want of course, but if you ask for advice, take it on board!",
              "author": "Javlington",
              "created": 1602714942,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g8qevv3": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qevv3/",
      "text": "depends on where you did your masters, some countries and programs focus more on independent research rather than theory and writing reports. but, tbh, it depends on you. take some time off to get a job and do regular work. compare work life and academic life and choose what's close to your heart. Also, think about finances and moeny",
      "author": "spacemangoes",
      "created": 1602623864,
      "upvotes": 1,
      "replies": {
        "g8rnvyy": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rnvyy/",
          "text": "> take some time off to get a job and do regular work\n\nAs mentioned above I have already spent nearly 10 years working outside academia, and that is absolutely influencing my interest in the latter",
          "author": "BayAreaDreamer",
          "created": 1602650429,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g8qwbwk": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8qwbwk/",
      "text": "I’m in my 6th year of the PhD (was full-time with GRA for the first 2.5 years, then slowed down to part-time when finances dictated I needed to go back to a full-time job) — I defend proposal at the end of this month and hope to graduate next fall.\n\nJust know that things can change drastically and what you imagine a program will be like can change over time. My committee chair and advisor who I started studying under suddenly retired one year in, and I didn’t get along with my new chair (who thankfully also left, and now I’m with someone I really like). Funding can change for grants thus affecting your pay, which is never great to start with, depending on your financial situation. I wouldn’t recommend a part-time program...I enjoyed the program the most when I was full-time, for sure. And I’ll echo what others have said about self-motivation...That’s been the toughest part, as I reach the end. I’m pretty much on my own, and being a perfectionist, I’ll constantly want to rework things or think “I need to work on this section more,” thus pushing the timeline back. \n\nDespite all this, I have enjoyed the program....and can not wait to finish. I never wanted to go into academia....and don’t plan to. I’m in the education field and knew I wanted to work at the state level with policy makers, and a PhD will really open the doors for me. That’s what started the whole process! Looking back, an EdD would’ve probably sufficed, but I’m happy I’ll stand out amongst others. \n\nGood luck to you, whatever you decide!",
      "author": "TannersPancakeHouse",
      "created": 1602633511,
      "upvotes": 1,
      "replies": {}
    },
    "g8raldw": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8raldw/",
      "text": "A master's degree is dating, and a Ph.D. is comparable to marriage.  It can be far better and reshape your life.  But if it goes wrong, you will find new enemies, some financial problems, and will have to deal with regret.  At the same time, you may benefit from a partial experience.\n\nThere are rigorous firms and workplaces with a research bent.  Consulting is interesting because you find out just how much your thinking is worth on the open market.  However, do not expect academic institutions to be on the cutting edge of knowledge.  When they are, it is great.  Many institutions are treading water and maintaining paradigms.\n\nIn some fields (psychology), it isn't easy to be a practitioner without a Ph.D.\n\nAcademic institutions have their own corporate culture and views of what is acceptable and unacceptable.   As someone with extensive work experience, this may not be seen as an attribute outside of a professional school.\n\nYou are probably about two job changes away from what you want to do.  A Ph.D. may not get you there.   However, active publications in professional research journals do tend to advance people. \n\nOverall this really depends on your field.  In economics, a Ph.D. matters, and in statistics, not as much.  It is hard to say",
      "author": "DamCraftyBeaver",
      "created": 1602641470,
      "upvotes": 1,
      "replies": {}
    },
    "g8rlm45": {
      "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rlm45/",
      "text": "I'm going to deviate a little bit from what others are saying about questioning if you will need a ph.d for your career. That's definitely something to ask yourself for sure. If part of the reason you're thinking about this is you think you might want to be a professor, then you need to know the sobering truth that it was already excruciatingly difficult to get a tenure track position before COVID-19 hit -- and now it's even harder.\n\nBut, there are reasons you might want to do one -- even if its not necessary for your career. If it's not in a field like clinical psychology where it's required to practice, ask yourself this: do I enjoy this enough to make very little money for six years or so. For some people, the answer may be yes.\n\nI like the analogy another person made about a masters being like dating while a ph.d is like marriage. It's certainly more intense in that regard. What's expected of you in terms of the quality of your dissertation is more rigorous. Most institutions, you will also have a teaching or research obligation to cover your tuition and give you a (meager) salary -- unless you are independently wealthy. Teaching is usually something completely new as a doctoral student, and it's a skill that you need to hone. My responsibilities as a doctoral student were far greater than those of my friends who were a TA during their masters. \n\nI would strongly recommend ***not*** doing a ph.d program unless you are offered funding, and are offered enough that you won't accrue any debt. It's an incredibly expensive endeavor if you have to take out a loan. This usually means you'll be living very modestly, and that can be a turn off for some people. I'd also recommend against doing a ph.d while you work full-time to make ends meet. That tends to make a ph.d completely unmanageable, and ultimately not a great experience because you need to go all in for a ph.d.\n\nSo it's like this. Imagine you're not going to gain anything from your ph.d. Is the ph.d itself something you find personal value in? Do you feel like the experience itself will be something that makes you happy/will make you happy? Are you ok with being poor for almost a decade while you devote your life to academics? The answer is different for everyone. But economically, a ph.d will only have value if either a). it's necessary for a job (like a clinical psychologist) or b). you're extremely skilled at marketing yourself and can somehow position yourself as somehow being a greater candidate for a job when the market ***OVERWHELMINGLY*** would prefer that time had been spent working in industry by a long shot.\n\nIf you think you do want to do a ph.d, the next step is talking to your masters advisor and seeing what they think. Not only do you need a reference from them (and a strong one), but they will also be able to tell you if they think you have what it takes to do a ph.d. They also might help direct you to a good program or to an advisor who would be a good fit.",
      "author": "JapanOfGreenGables",
      "created": 1602648709,
      "upvotes": 1,
      "replies": {
        "g8rofbj": {
          "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rofbj/",
          "text": "> you're extremely skilled at marketing yourself and can somehow position yourself as somehow being a greater candidate for a job when the market   \n>  \n>OVERWHELMINGLY  \n>  \n> would prefer that time had been spent working in industry by a long shot.\n\nI think this is really dependent on your field, either academically or non-academically. I have been working for around 10 years, and my financial situation has really not improved hugely over that time. Living in a high cost of living area, it has gone something like 30k->40k->60k->55k->80k->70k\n\nAnd while I don't know if I could get into a business PhD program, the average salary for new business PhD grads in academia seems to be over 100k.\n\nI think people who have spent all their time in academia can romanticize how easy it is to get promoted outside of academia, as much as I understand that the academic job market sucks for many/most fields now.",
          "author": "BayAreaDreamer",
          "created": 1602650846,
          "upvotes": 1,
          "replies": {
            "g8rvckh": {
              "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rvckh/",
              "text": "Oh, it's not that I think it's easy to get promoted. I'm referring to getting hired, since you'd have to leave wherever you're working to do a ph.d. It's that, if you were applying for a job, an employer would take a candidate who had spent that time working in industry over someone who spent that time doing a ph.d. That's what I've found anyways.",
              "author": "JapanOfGreenGables",
              "created": 1602657065,
              "upvotes": 1,
              "replies": {
                "g8rw8s0": {
                  "link": "/r/AskAcademia/comments/jahdb1/i_really_enjoyed_my_masters_is_that_a_sign_i/g8rw8s0/",
                  "text": "> an employer would take a candidate who had spent that time working in industry over someone who spent that time doing a ph.d. That's what I've found anyways.\n\nTo an extent that's probably true. But once you spend a certain number of years working roughly the same job at roughly the same level, the value of additional years of experience diminishes quickly I've found.",
                  "author": "BayAreaDreamer",
                  "created": 1602657962,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}