{
  "sid": "l6s4fw",
  "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/",
  "title:": "Conducted my first lecture today. It did not go well",
  "text": "I’m a TA and this term I am conducting classes for one of the intro lectures for first years. It’s like a general knowledge module on my country (so we cover history, econ, politics etc). \n\nI had my first independent lecture today on a topic I’m not familiar with at all. And it was so bad. I couldn’t pronounce a few names (it was on the origin of our language), my explanations were all over the place and I couldn’t answer a question a student had (I did answer it later though). I found out the topic yesterday so I didn’t have enough time to prepare. \n\nI’m not sure how to deal with this. This was their first impression of me and I’m a little worried that I’ll make things worse for them. \n\nWas anyone ever in a similar situation? How do I recover from this?",
  "author": "ravenpaw_15",
  "created": 1611823882,
  "updated": 1634080201,
  "over_18": false,
  "upvotes": 291,
  "upvote_ratio": 0.98,
  "comments": {
    "gl2fe56": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2fe56/",
      "text": "Oh, the first time standing in front of a class of students is hard!! You go in so confident, thinking you are prepared, and then as you begin you start seeing all the gaps, and then leave feeling so deflated.\n\nIt is actually one reason why getting students to teach each other concepts is a great learning tool.\n\nIt gets easier, you work on your gaps, you find your strengths (and play to them) etc etc.",
      "author": "tea-cup-stained",
      "created": 1611824404,
      "upvotes": 220,
      "replies": {
        "gl2ui84": {
          "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2ui84/",
          "text": "I really liked that my first \"real\" teaching experience involved me sitting behind a computer (programming related course) rather than literally standing infront of a lecture hall :D",
          "author": "noknam",
          "created": 1611836425,
          "upvotes": 23,
          "replies": {}
        },
        "gl50spz": {
          "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl50spz/",
          "text": "That’s great that you went in with confidence. I just had my first TA experience and even though my mentor did so well helping me, I still lacked confidence and it showed. However, all in all, I made it through relatively unscathed and that is because I had a mentor in my undergrad advisor. She told me of her 1st time, in her own words: “I sucked and nobody could argue that fact.” She said she was prepared as an ‘expert’ in her field, but no one taught her how to teach. And the university did not provide mentors. To make matters worse, she was hired in Dec, 1 week before the semester started due to a faculty’s death. Thanks to her, I know to focus on the positive and build upon that every time, as you will do!",
          "author": "Bi-sex-bi-me",
          "created": 1611864692,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gl2qxyb": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2qxyb/",
      "text": "[deleted]",
      "author": null,
      "created": 1611833897,
      "upvotes": 106,
      "replies": {
        "gl2xly6": {
          "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2xly6/",
          "text": "Agreed, not on OP for this one.",
          "author": "GetCookin",
          "created": 1611838322,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "gl2mzuy": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2mzuy/",
      "text": "Own it. Don't marinade in it. It happens. \n\nRolling into the next class with some version of \"Full disclosure guys, I don't know what you thought but I felt like last class was rough. That's not my usual style. Here's how today is going to go differently ... \"\n\nPraise them for asking good questions that stumped you. That means their listening and thinking critically. \n\nDon't make excuses or ask for forgiveness but take some reasonable steps to do better using your personal strengths. \n\nIf they ask a question and I don't know the answer, I tell them it's a great question and ask if anyone else in the class knows. If not, I joke \"me neither - haha! Let's find out. Who can search up the answer fastest?\"\n\nEdit: now that a re-read your post Idk. Opening the door for possibility while maybe not your ideal lecture, it wasn't as bad as it seems?  We're often our own worst critic, especially when we're nervous and being observed. None of what you've described sounds terrible. You didn't insult anyone or make them cry ... Ive had professors do that and still recover. This will be okay for you too.",
      "author": "Psylobin",
      "created": 1611830882,
      "upvotes": 149,
      "replies": {
        "gl2r2lc": {
          "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2r2lc/",
          "text": ">That's not my usual style. \n\nThen go on to deliver a lecture even worse than the first one.",
          "author": "Seber",
          "created": 1611833996,
          "upvotes": 125,
          "replies": {
            "gl2sjcl": {
              "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2sjcl/",
              "text": "yeah i would like this advice in the case of someone with experience, but learning how to teach is a process. it takes a while. the next one could be worse! I remember feeling off-balance for at least the first half of my first semester teaching.",
              "author": "LinearBeetle",
              "created": 1611835054,
              "upvotes": 34,
              "replies": {
                "gl2tlis": {
                  "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2tlis/",
                  "text": "Could be worse but likely won't be. That's largely anxiety talking. \n\nWe learn every time. \n\nWe speed up that process when we pause to reflect on what went well / poorly and decide to try something a bit different next time.",
                  "author": "Psylobin",
                  "created": 1611835794,
                  "upvotes": 11,
                  "replies": {
                    "gl2vcou": {
                      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2vcou/",
                      "text": "I think it's totally reasonable, given how difficult teaching is, to not expect improvement every class. There will certainly be improvement over time, probably in leaps and bounds, but you're setting someone up to question their own abilities by stating so assuredly that improvement will happen from class-to-class. That might have been your experience, but it certainly wasn't mine. I doubt I am in the minority.",
                      "author": "LinearBeetle",
                      "created": 1611836980,
                      "upvotes": 7,
                      "replies": {
                        "gl33egy": {
                          "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl33egy/",
                          "text": "If you feel that there wasn't one single thing that improved the second or third time you did something hard I'm not going to try to convince you there was. \n\nTeaching is easy to do poorly and very hard to do well. We're all going to mess up in different ways on different days. We will repeat mistakes we've made in the past. But if we're intentional about reflection and action we will always always grow in some way.",
                          "author": "Psylobin",
                          "created": 1611841054,
                          "upvotes": 4,
                          "replies": {
                            "gl4ck0s": {
                              "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl4ck0s/",
                              "text": "not everything is a straight line towards progress",
                              "author": "LinearBeetle",
                              "created": 1611855070,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gl2t7nc": {
              "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2t7nc/",
              "text": "Baha! Thank you for the morning chuckle",
              "author": "Psylobin",
              "created": 1611835532,
              "upvotes": 2,
              "replies": {}
            },
            "gl2u5fc": {
              "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2u5fc/",
              "text": "Sums up my three years of teaching high school.",
              "author": "Matterials",
              "created": 1611836176,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gl2kjgy": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2kjgy/",
      "text": "My first time leading full classes was last semester. I've been in a similar situation with my teaching experience so far. I've TAed for 3 courses all of which I hadn't taken before. I was trusted to just lead classes anyway (which I guess is normal but I still find that super weird). For the first course I TAed for, I led class every other week plus review sessions. It felt super overwhelming to me at first, but I got used to it pretty quickly. \n\nMy main source of worry before every session is that I will not know the answer to student's questions and that I am somehow letting them down. There have been times I didn't know the answer but I have never had an issue just telling them \"I'm not sure but I will find out for you\" -- just make sure you actually do find out for them. It feels weird to admit to students that you don't know something, but I try to remind myself that I am a student too and I am also learning (especially so for courses that I have never actually taken lol). \n\nWhen I get worried about them judging me I try to remind myself of when I was in undergrad. Most of the class, myself included sometimes, half payed attention for most lectures. Chances are if you mess up many of them won't even notice. And even if they do, they won't likely remember it -- I can't think of a single time that my professors/TAs messed up during my classes in undergrad.\n\nEach time you do this you will get more confident and it will get easier!",
      "author": "hippyaltaccount",
      "created": 1611828808,
      "upvotes": 15,
      "replies": {
        "gl2rpid": {
          "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2rpid/",
          "text": "I started teaching for the first time last fall, for a subject I knew pretty well and had professional experience in, I felt super confident. Until the one student in class that was hell bent asking me every “what if” question imaginable started interjecting. Questions I didn’t have answers to... to say it was a confidence  breaker was an understatement. I really wasn’t sure how I’d recover from what felt like (to me in my student’s eyes) was my inability to have answers. It was a rough semester, the student in question challenged me and actually ended up scoring the best in the class and wasn’t a pain in the ass intentionally, he just wanted to learn and was inquisitive. I learned you should always have a canned response for when you don’t know the answer (mine is, “great question! We’ll be touching on that very soon!” Or “let me get back with you on that”) so it doesn’t ruin your confidence for the class. Most of the time, they forget they asked or it does come up in a future class lecture. Honestly I’m glad it (the inquisitive student) happened to me last semester because nothing can unsettle me in class again, lol.",
          "author": "tabbykiki",
          "created": 1611834461,
          "upvotes": 11,
          "replies": {
            "gl5kc4s": {
              "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl5kc4s/",
              "text": "I am that student :/ I like to know All the Things. Thankfully most of my professors have been the sort to take it in stride and it turns out interesting/useful.\n\nOne strategy is to address that questions relevant to the entire class you’ll do your best to answer, but if it’s that person’s specific interest and will not be relevant, have them write it down and bring it to office hours. This gives you time to research it if necessary.\n\nI don’t find anything wrong with professors saying they don’t know. It’s impossible to know everything even about one subject. I’ve also seen classes where a question’s answer isn’t known, the student can earn extra credit by researching and posting the answer (with citation). I like this because it encourages their curiosity and skills in independent research.\n\nThe most annoying are those who ask questions they know the answer to just to show off imo.",
              "author": "bronwyn_",
              "created": 1611871659,
              "upvotes": 2,
              "replies": {}
            },
            "gl4j5fx": {
              "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl4j5fx/",
              "text": "I wouldn't use \"let me get back to you on that\" unless you intend to follow through. If you hope it goes away and it doesn't, that's not a great look.",
              "author": "deong",
              "created": 1611857687,
              "upvotes": 1,
              "replies": {
                "gl4mfzt": {
                  "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl4mfzt/",
                  "text": "For sure - good point. If you promise to follow back, you should.",
                  "author": "tabbykiki",
                  "created": 1611859404,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gl32f7z": {
          "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl32f7z/",
          "text": "This is a good point! Also, while it is easier to say than to do: relax. You will improve with time. I have taught for ten years or so, and my first lectures, seminars etc were complete disasters. A  cheap tip may be to embrace learning as a process requiring active student participation. I usually tell my students that the lectures are only superficial walk-throughs of some of the important stuff. In order to learn something they will have to read the books. And assign plenty of assignments where the students present/explain things for the class.",
          "author": "toru_okada_4ever",
          "created": 1611840651,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gl2k03w": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2k03w/",
      "text": "I don't think that's very representative of most first experiences, I started giving short guest lectures in my supervisors classes, then doing seminars discussing their lectures, then later my own lectures on content I had made myself; that way is a much more smooth transition. \n\nSo don't take it as a bad sign for the future, just be honest about your experience with whoever assigned you to teach something you didn't know so it doesn't happen again. \n\nIt might be harder to build up relationship with students again, but you still have the whole semester to do so. Good luck!",
      "author": "bluethirdworld",
      "created": 1611828326,
      "upvotes": 18,
      "replies": {}
    },
    "gl2ndzm": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2ndzm/",
      "text": "My first lecture sucked bad. Second one still sucked. Third one sucked a little less. Around the fifth one I started delivering something decent. It's a process, don't worry too much about it. And all of the above on a topic I knew  well. If you could deliver anything at all with just one day of preparation... well I'd say you are pretty good!",
      "author": "Poppidoc",
      "created": 1611831199,
      "upvotes": 7,
      "replies": {
        "gl5ija4": {
          "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl5ija4/",
          "text": "I was pretty bad for the first semester. Then I got better and better and ... now I’m pretty decent. I almost never lecture though. Students present definitions and give examples and I add to what they do.\n\nBest teaching advice I ever got is that if you are working harder than your students, you are doing it wrong.",
          "author": "ThatProfessor3301",
          "created": 1611870997,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gl2n62y": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2n62y/",
      "text": "Just be honest with them next time you have them in class no ?\nYou'll get more confident over time. It will be better. :)",
      "author": "Barbifioutre",
      "created": 1611831024,
      "upvotes": 5,
      "replies": {}
    },
    "gl2xq07": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2xq07/",
      "text": "Hopefully this is reassuring. I remember being a student when what you described happened to an T.A. (I'm sure everyone else forgot it, but it was a field I was thinking of going into and I wanted to know what the heck a first job looked like.) I thought \"Wow, I feel kinda bad for them.\" And then two days later they got up again, did fine, and they became one of my favorite people to learn from.\n\nSo the first impression doesn't stick. Students'll remember how well you went on to do.",
      "author": "dcgrey",
      "created": 1611838387,
      "upvotes": 6,
      "replies": {}
    },
    "gl310sl": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl310sl/",
      "text": "I just finished my PhD in curriculum studies, and have continued teaching high school during grad school. When I became a teacher 15 years ago, it was through an accelerated process, that involved a ton of mentoring during my first year of teaching.\n\nOne of my mentors mentioned, kind of off-handedly, that it was somewhere around his 7th year of teaching the same, narrow subject (chemistry, in his case) that he was able to walk into the room and teach pretty well, without doing several hours of prep for each hour of class. \n\nAs others have said above, you were put into an unreasonable position, because you didn't have time to prep. Hopefully, you know (or have control over) the content of the second class, and can put the prep in. \n\nThere's lots of good advice above (even though the suggestions move in several very different directions) on how to address day 1. Pick the one that most appeals to you, and include it as part of how you prepare for the second class. \n\nI'll just add to that advice: It's okay to tell your students that you weren't given enough time to prep the first class, and you have prepared much more thoroughly for the second. That can help your students reconcile the different experiences, if they were concerned about your trustworthiness as a TA after that first class, and to recognize that you're better than that first impression might have left.",
      "author": "jamey1138",
      "created": 1611840052,
      "upvotes": 6,
      "replies": {}
    },
    "gl2u4zt": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2u4zt/",
      "text": "A couple things. First, as u/imaginary_character said, you weren't set up to succeed. Second, my grandfather said that the best response to a question you can't answer is: 'i'm not sure. i will look it up and get back to you.' I've followed this advice. I think it works. You're modeling to students that you are human as they are. Third, lecturing for the first time is really hard. Takes a a few months to really settle in, tbh. \n\nHave an outline. Ask yourself, what do I want to the students to remember from this lesson? Try and produce a narrative. \n\nImportantly, students can't distinguish mediocre teaching from bad teaching, in my experience. You experience your own faults at a much higher magnification than they do. What you see as huge mistakes, most don't even notice. \n\n&#x200B;\n\nHonestly, just keep plowing forward, step-by-step. You will improve! It's clear from your post that you care a lot about your students and want the best from them. That's a great place to start.",
      "author": "LinearBeetle",
      "created": 1611836168,
      "upvotes": 4,
      "replies": {}
    },
    "gl2uzwx": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2uzwx/",
      "text": "Honestly: no one will remember.  one lecture over the course of an academic year? they hear literally hundreds of lectures, it all blurs together. they won't have any recall of it in two weeks.  Just be better moving forward.",
      "author": "printandpolish",
      "created": 1611836754,
      "upvotes": 3,
      "replies": {}
    },
    "gl2ytfo": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2ytfo/",
      "text": "Teaching is difficult. It takes time to learn what techniques work best for you and the population of students you are teaching. Think of teaching like research. You are probably going to be bad at it at first. As you put time in, you will get better. Don’t beat yourself up about a bad class. Think about how to use your experience to do better next time. If you would like, you can address the first class with your students. \n\nI don’t even like to think of my first class or really first couple years of teaching. After 15 years, my bad lectures are few and far between.",
      "author": "fuubear",
      "created": 1611838983,
      "upvotes": 3,
      "replies": {}
    },
    "gl2po2n": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2po2n/",
      "text": "It happens. Reflect on what you could do differently or something that would have helped given the circumstances. Remember that and do a little better next time. Your first lecture is a starting point, not representative of your ability as a lecturer.",
      "author": "DarkMaesterVisenya",
      "created": 1611832935,
      "upvotes": 2,
      "replies": {}
    },
    "gl2vunj": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2vunj/",
      "text": "I've been teaching for years and still have the occasional train wreck lecture. Sometimes it's even on material I've covered hundreds of times. The best advice I can give is be honest with your students and laugh it off. It's amazing how a little self-deprecating humor can diffuse an awkward classroom. Especially when you mispronounce something. I'm super bad about that.\n\nAs for not being able to answer all questions off the top of your head... someone else already mentioned admitting that you're not sure but promising you'll look it up and get back to them. This is great advice. Not only does it ensure you give them the proper information it's teaching your students that's it's okay not to have all the answers all the time. My mentor in grad school taught me a lot but the thing that has stuck with me all these years is that unless you have a photographic memory you're never going to remember every little thing about your subject. What you need to learn is what questions you should be asking and where to find the answers. It's a philosophy I live by both in research and teaching.",
      "author": "archyslayer",
      "created": 1611837291,
      "upvotes": 2,
      "replies": {}
    },
    "gl2wyyi": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl2wyyi/",
      "text": "As my professor said to me when I first started teaching (with 11 days notice, 4 classes, I had never taught before), \"you only have to be one chapter ahead of the students\".\n\nI gave a lecture once somewhere in my 3rd year of teaching and realized that it made no chronological or thematic sense. I made a mental note to fix it for next time and then a few years later *gave the same lecture without the corrections*.  \n\nI also gave a lecture at the beginning of the semester, and realised halfway through that I had lost them (the curse of teaching non-history majors!) and the class was an absolute nightmare for the entire semester, so you just have to soldier on.  Sometimes you are Principle Skinner, sometimes it's the kids.",
      "author": "Flubb",
      "created": 1611837953,
      "upvotes": 2,
      "replies": {}
    },
    "gl43sd4": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl43sd4/",
      "text": "not only is it common for a TA to experience this,  I think it is almost required. Been there, done that.\n\nOne of the really strong aspects of grad work and teaching/giving lectures/running tutorials is how much it solidifies your own understanding of the subject.    It also teaches you to be prepared, lol!  \n\nI wouldn't even worry about \"recovering\" for it.  At most, simply state a sentence the next time and say \"The start was a bit bumpy last week because i was suddenly dropped into this class,  so I apologize for not being able to fully explain some of the concepts,  but moving forward things will definitely smooth out.\"",
      "author": "arachnidtree",
      "created": 1611852278,
      "upvotes": 2,
      "replies": {}
    },
    "gl44s58": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl44s58/",
      "text": "Am just an undergrad TA but it gets better over time! I started reviewing material / practicing small speeches on things I thought I’d have to lecture on before class and that helped a bunch! \n\nAlso, not super easy to do but, I really pretend to exude confidence when I speak and interact and it’s helped so much. I feel like I’m lying out my teeth sometimes because internally I’m so nervous but the students mostly pick up what you put down and a lot of them told me I seemed so sure of myself :) That only worked to instill real confidence in me over time. Fake it til you make it works!!!",
      "author": "szvcne",
      "created": 1611852586,
      "upvotes": 2,
      "replies": {}
    },
    "gl310zz": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl310zz/",
      "text": "Congratulations. You are on the path to greatness. This is part of growing. You’ll be okay. Besides, the students probably weren’t listening anyway.",
      "author": "Fantum_Dook",
      "created": 1611840054,
      "upvotes": 1,
      "replies": {}
    },
    "gl31d4e": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl31d4e/",
      "text": "My first lecture was TERRIBLE. Finished 10 pages of notes in approx. 5 minutes, then made up the most non-sensical groupwork to make up the time. So shake it off, and see each class as its own thing. I’ve been teaching for 16 years now, and there are still days when I text my colleagues to say, “Well, that was a disaster.” It’s all just part of teaching.\n\nBut the situation you were in does not sound right. Were you teaching from someone else’s lecture notes? That never works. Convert the material into your own voice / style, and don’t ever try to teach something you don’t fully understand at least well enough to explain to someone. That doesn’t mean you have to know everything - I regularly say, “I don’t know, I’ll get back to you”, or “I hadn’t thought of that, what do all of you think?” But you do need to understand the material you are teaching and be able to present it in your own words. \n\nIf a prof is asking you to teach things you don’t understand, set a meeting with them to work through the concepts. If like me, you were hired to teach a variety of courses and one of them was less familiar to you, then get ready to read a lot of primers and call your old professors.:)",
      "author": "Felixir-the-Cat",
      "created": 1611840202,
      "upvotes": 1,
      "replies": {}
    },
    "gl31fsp": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl31fsp/",
      "text": "I  TAed as well in my Master's and I can tell you that this is absolutely normal. The first session is hard. Really hard. You are nervous, anxious and imagine all the things that can go wrong. But it will get better and you will gain more confidence. Try out different ways of teaching, play around with your ideas a bit and be honest. In my first course, I told my students that I had never done this before and that I'm trying things out a bit and they completely understood that.\n\nDon't try to hide if you don't know the answer to a question. Admit that this is a good question and tell them you will find out the answer to it. Then you can start the following session discussing this question. Another technique is to try and find out the answer to that question together (initiate a group discussion or look it up yourself). Not knowing an answer is nothing to be ashamed of!\n\nWhat also helps is to have a little feedback session at the end of your course. That way you can find out what they liked, did not like and you can adjust your plans for the next semester.\n\nYour confidence will grow and your explanations will get better over time. No one starts teaching already an expert. Give it time and prepare well. You'll soon find that teaching is fun and can start enjoying your session! Good luck :)",
      "author": "310793matt",
      "created": 1611840235,
      "upvotes": 1,
      "replies": {}
    },
    "gl35fwe": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl35fwe/",
      "text": "I am an excellent lecturer. I'm not trying to brag, it's one thing I do well while I suck at several other things related to my career. However, I was awful the first year. Thank goodness I had kind and gentle students that year. One group of Seniors in particular really carried me. So, have faith. One lecture does not a career make.\n\nAlso, you're a TA. They weren't expecting much. Don't feel bad. I would be frustrated at whoever gave me the topic with one day to spare, though.",
      "author": "Ike_hike",
      "created": 1611841844,
      "upvotes": 1,
      "replies": {}
    },
    "gl375rh": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl375rh/",
      "text": "Sorry you didn't have a good experience. If you really care about your students and their learning (versus just saving face/your reputation), your first step is to investigate the science behind teaching, learning and pedagogy. Most academics know very little about these things as research, publishing, etc. is prioritized. The science of simply \"lecturing\" is quite clear. It is boring and many people do not learn from it.",
      "author": "SpearandMagicHelmet",
      "created": 1611842487,
      "upvotes": 1,
      "replies": {}
    },
    "gl39f18": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl39f18/",
      "text": "You found the answer to the student's question and answered it for him in the end. I might be mildly annoyed at having a new teacher, but I would gladly overlook some of it for that. I once asked my rather old teacher in our design of machinery course how we would lubricate gears, and he didn't know either, but I don't think I ever got an answer later.",
      "author": "OoglieBooglie93",
      "created": 1611843241,
      "upvotes": 1,
      "replies": {}
    },
    "gl39o1h": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl39o1h/",
      "text": "Don't be hard on yourself. Lecturing is a skill that developes with time and for some people it takes years to feel confident in front of an audience.",
      "author": "lulalilikabaloo",
      "created": 1611843323,
      "upvotes": 1,
      "replies": {}
    },
    "gl3bsv2": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3bsv2/",
      "text": "Students care a lot less than you think.\n\n> I couldn’t answer a question a student had\n\nThat happens all the time. There isn't actually an expectation that you should be able to answer any and all questions on the material. It's fine to tell them you don't know and will have to look it up - or, as more seasoned people tend to do, challenge them to look it up.",
      "author": "thegreenaquarium",
      "created": 1611844002,
      "upvotes": 1,
      "replies": {}
    },
    "gl3cmrq": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3cmrq/",
      "text": "I have been teaching for 16 years, and you know what? The first class of the semester NEVER goes the way I want it to. Stage fright is still a thing, and I realize that I reeeeeally should have looked up this thing that I always forget to look up, what will the new kids think, and oh man I’ve totally forgotten how to play the piano over break even though I played every day but now Humans Are Looking At Me, and I thought that joke was hilarious when I wrote it but it didn’t get more than a giggle oh crap now they all hate me and I’ve set up the entire semester for failure....yeah, no. It’s fine. \n\nJust as a general life thing, not necessarily a teaching thing, think back to the most embarrassing moment you’ve had. Ouch. Makes you cringe, right? Now try to remember someone else’s most embarrassing moment, the one that defined everyone’s opinion of them and that they never lived down.....probably aren’t going to come up with too much. We don’t remember this kind of stuff, so an awkward first lecture isn’t going to stick in anyone’s head. \n\nYou WILL absolutely find your feet - but it does take a minute, and that’s okay.",
      "author": "themathymaestro",
      "created": 1611844257,
      "upvotes": 1,
      "replies": {}
    },
    "gl3gbyc": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3gbyc/",
      "text": "It's totally OK!! Your first day of independent teaching is already nerve-racking enough, and finding out about the topic only one day in advance sounds horribly stressful. I've found in situations where a student asks a question and I don't know or don't remember the answer, that being honest in a certain way is key. I would usually say something like, \"That's a great question. Honestly, I'm not sure, but I think it's important to consider! What does everyone else think?\" Starting a class discussion helps to not only engage students, but also inspire critical thinking. Through class discussions, an answer to the question may also arise!\n\nFrom this point, there are definitely things you can do to increase your credibility. If possible, try appearing as confident as possible for the other classes going forward. While you can't fix what has already happened, you can appear confident from here on out, which in my opinion, is absolutely critical for increasing credibility. I have personally experienced this myself. Last semester, I started teaching a class I wasn't familiar with, in a format I wasn't familiar with. It was nerve-racking to say the least, and I won't lie, I definitely came off pretty nervous the first day... which is something I actively try to avoid. However, I found that practicing my lectures and activities helped me, at the very least, feel confident in my wording and presentation, so that when I got to class, I demonstrated confidence in myself and therefore seemed more credible. I hope this helps!! I believe in you, and I hope things get better.",
      "author": "BonnieviewDrive",
      "created": 1611845329,
      "upvotes": 1,
      "replies": {}
    },
    "gl3keaf": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3keaf/",
      "text": "Practice after practice",
      "author": "safehea",
      "created": 1611846470,
      "upvotes": 1,
      "replies": {}
    },
    "gl3lzln": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3lzln/",
      "text": ">  I couldn’t answer a question a student had (I did answer it later though).\n\nThis is huge, this is enough. When you show students that you're willing to admit that you don't know something but that you are willing to find out -- that's a good professor. Don't try to puff yourself up and be some infinite well of knowledge, it's okay to not know things (especially if its' a topic that you didn't know existed until 24 hours ago). \n\nYou don't need to know everything, you just need to be one step ahead of the students. And when you don't know something there's nothing wrong with answering it later! Good job!\n\nThe stage fright gets better with time.",
      "author": "ChezJason",
      "created": 1611846914,
      "upvotes": 1,
      "replies": {}
    },
    "gl3q7gl": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3q7gl/",
      "text": "The first few times teaching are hard. And even years later, I'm still learning and growing. The important thing is that you left that lecture knowing you needed improvement and with ambition to do just that--that tells me you're already a good educator.  \n\n\nIt could help to find a teaching mentor. Someone who's lectures you can sit in on. Or someone willing to sit in on yours to give feedback (though I know that can be very intimidating).  \n\n\nYou are going to do really well so long as you keep seeking improvement. Bravo.",
      "author": "chlcwelc",
      "created": 1611848088,
      "upvotes": 1,
      "replies": {}
    },
    "gl3t0vr": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3t0vr/",
      "text": "Make a joke about it and move on. Going forward, come prepared to answer the hard questions you couldn't answer last time, let the students know you only had a day to prepare and appreciated that they were able to stump you, challenge them to keep doing it, and then always try to stay at least ten minutes ahead of them  (as we all do).",
      "author": "bigrottentuna",
      "created": 1611848932,
      "upvotes": 1,
      "replies": {}
    },
    "gl3u4w9": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3u4w9/",
      "text": "The fact that you care already speaks volumes of you. You will get better. No doubt.",
      "author": "chiesazord",
      "created": 1611849293,
      "upvotes": 1,
      "replies": {}
    },
    "gl3uqqt": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl3uqqt/",
      "text": "Hey firstly, I hope you got some time to relax after the lecture. \n\nSecondly, welcome to teaching, to the other side. We’ve all (well most of us) have faced this. \n\nDuring the first semester of teaching students most of who were elder to me, I ended up fumbling a lot and was generally all over the place. My colleague told to to take things in stride. She told me: look at it this way, in your career as a lecturer you’ll probably take some hundred lectures, if not a thousand or more. A few bad ones wouldn’t matter as much as it does now. \n\nThe best way to salvage the situation is to keep moving on. Not to overcompensate or pine on the fact that the first one wasn’t as great as expected. \n\nWish you luck. And hope the next one is way better and upto your expectations. Keep us updated.",
      "author": "Ron_Because_Why_Not",
      "created": 1611849490,
      "upvotes": 1,
      "replies": {}
    },
    "gl428ld": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl428ld/",
      "text": "Relax the expectation that you have the answer to everything on the spot in the classroom. When you don't know, look it up (or bake it into an assignment for them to look up).\n\nWith practice you'll get much better and preparing for things short notice.",
      "author": "ph0rk",
      "created": 1611851818,
      "upvotes": 1,
      "replies": {}
    },
    "gl4cunr": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl4cunr/",
      "text": "Hello, I am also a TA, I am supposed to have my first independent lecture next week Friday. I am so nervous, I almost fell infront a class on my first day on the job with my Professor. And I am also not confident that I can teach well",
      "author": "Select_Mood2368",
      "created": 1611855171,
      "upvotes": 1,
      "replies": {}
    },
    "gl4ge92": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl4ge92/",
      "text": "OK, I am going to share a super embarrassing moment in my life about my first class. I was teaching a recitation section in the basement of the psych building in a room that was freezing cold, while wearing a non-padded bra. I thought the lesson went decently, and the students were chatty, etc.  At the end of the session, one of the female students came up to me and said: \"so, it looks like you were pretty cold, huh\"? while staring at my breasts. Now, I know in retrospect this student was being super inappropriate, but to this day I still never wear bralettes when teaching and always wrap myself in a cardigan.\n\nAnyway, I know this is a very different situation than the one you faced today, but I am here to tell you it does get better and easier :)",
      "author": "Mizzy3030",
      "created": 1611856439,
      "upvotes": 1,
      "replies": {}
    },
    "gl4naxa": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl4naxa/",
      "text": "You'd be surprised at how supportive the undergrads are. I have never felt like I crushed it and they are all always positive about their experience.",
      "author": "MercuriousPhantasm",
      "created": 1611859749,
      "upvotes": 1,
      "replies": {}
    },
    "gl55pzo": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl55pzo/",
      "text": "Hey, performing is hard, teaching is hard, teaching outside of your comfort zone is hard, teaching a course or a topic for the first time is hard! Don't be hard on yourself!! I'm sure you'll be great, and you'll be fine, and your course will go better, and your courses (plural) will go better! You're in this \"first Nicaraguan Deaf kids brought to this school for the first time\" stage right now, if you know what I mean. Don't dwell on it. Take note, and try again :) Practice makes perfect!\n\nAnd as a short-term solution, think of adapting more open, vulnerable approach to teaching, where you are more of an older peer and \"person responsible for the group\" in a hike, than an omniscient sage. Here's my absolute favorite book on the topic: [\"Teaching what you don't know\" by Therese Huston](https://www.amazon.com/Teaching-What-You-Dont-Know/dp/0674066170)  I love this approach, and found it really liberating, when I started myself :) Good luck!!",
      "author": "ampanmdagaba",
      "created": 1611866447,
      "upvotes": 1,
      "replies": {}
    },
    "gl58xpb": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl58xpb/",
      "text": "Ask yourself what you did right and how far you have come along.",
      "author": "WaqarSeyal",
      "created": 1611867591,
      "upvotes": 1,
      "replies": {}
    },
    "gl5a4om": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl5a4om/",
      "text": "Ohhhhh it happens!  Some times it takes practice to fall into your teaching groove.  I suggest overpreparing as much as possible, where possible.  Students have a way of poking holes in your knowledge--they are particularly good at finding questions to ask that you simply don't know off the top of your head. THAT IS OKAY! Don't be afraid to tell them, \"Let me look into that for you\" or \"That's an excellent question and I need some time to answer it properly\".  Never try to bullshit your way out of such a situation--i.e. don't pretend you have knowledge that you don't have.  In my situation, I teach physics and so I always make sure to have many ways to solve the problem at the tips of my fingers. I've also learned how to do all the questions incorrectly (the most common mistakes) this way I can immediately point to a reason for their mistake and where to try again. \n\nYou will definitely get used to it and start to feel more at ease. I used to be terrified of public speaking, now I have no issue speaking at length in front of large crowds. It definitely doesn't help to not have much time to prepare, but given enough time, as long as you stay calm and have a general plan to stick to, you will be just fine. \n\nI find that, after some time, talking to a large group of people is no different from just chatting with 4 or 5 people.  Feel free to ask them for feedback or to answer questions as you're lecturing to keep engagement up--just remember, you're just having a conversation.",
      "author": "PhysicsVanAwesome",
      "created": 1611868010,
      "upvotes": 1,
      "replies": {}
    },
    "gl5ewin": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl5ewin/",
      "text": "My first ever class of teaching Geometry at the high school level my lesson plan began and ended with me writing the word \"Geometry\" on the board, and saying \"That means Earth Measure!\" \n\nI have no idea why I thought that would be enough for a 45 minute class. I guess I thought they would all be blown away and it would inspire a riveting discussion. \n\nIn my fifteen years teaching, I've seen lots of first year teachers not do particularly well. Fortunately, the hard working passionate ones usually get better fast.",
      "author": "jbt2003",
      "created": 1611869695,
      "upvotes": 1,
      "replies": {}
    },
    "gl5hsjg": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl5hsjg/",
      "text": "You can't change the past but you can use the experience to learn for the future. Stay focused on the present and what you can do now and don't spend time beating yourself up. It doesn't achieve anything.",
      "author": "xXxlandvaluetax69xXx",
      "created": 1611870739,
      "upvotes": 1,
      "replies": {}
    },
    "gl5id4q": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl5id4q/",
      "text": "My advisor told me my first class thought would be a train wreck because it always is. And indeed it was. I would say that my first few courses taught were pretty terrible overall. I would also say that I’ve turned into a pretty amazing teacher by all accounts.",
      "author": "nc_bound",
      "created": 1611870939,
      "upvotes": 1,
      "replies": {}
    },
    "gl5ie5x": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl5ie5x/",
      "text": "My advisor told me my first class thought would be a train wreck because it always is. And indeed it was. I would say that my first few courses taught were pretty terrible overall. I would also say that I’ve turned into a pretty amazing teacher by all accounts.",
      "author": "nc_bound",
      "created": 1611870949,
      "upvotes": 1,
      "replies": {}
    },
    "gl5vqzu": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl5vqzu/",
      "text": "Everyone has given great advice for dealing with the experience, but there is also a lot of great resources out there for learning how to be an effective professor. Some universities have started to build resources for improving teaching and my program (anthropology) actually has a class on teaching anthropology that was incredibly helpful. The Chronicle of Higher Ed is good for keeping up to date with things happening in teaching. They also have helpful stuff like this: [https://www.chronicle.com/article/how-to-teach-a-good-first-day-of-class/?cid2=gen\\_login\\_refresh&cid=gen\\_sign\\_in](https://www.chronicle.com/article/how-to-teach-a-good-first-day-of-class/?cid2=gen_login_refresh&cid=gen_sign_in). \n\nIt's also good to think about your pedagogy and how you want to teach, like do you want your students to be doing collaborate learning([https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5132366/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5132366/)), active learning([https://www.northeastern.edu/graduate/blog/active-learning-higher-education/](https://www.northeastern.edu/graduate/blog/active-learning-higher-education/)), universal design ([https://www.washington.edu/doit/sites/default/files/atoms/files/Universal%20Design%20in%20Higher%20Education\\_Promising%20Practices\\_0.pdf](https://www.washington.edu/doit/sites/default/files/atoms/files/Universal%20Design%20in%20Higher%20Education_Promising%20Practices_0.pdf)). There's a ton of stuff out there that can really help you dial in what YOU want to do as a teacher. Basically, if teaching is going to be part of your future plans, it can be really helpful and even empowering to figure out what sort of teacher you want to be. Knowing what you want students to get out of your lectures/classes can help you figure out how you want to set them up and what you want to focus on.",
      "author": "AgentFuzzButt",
      "created": 1611876415,
      "upvotes": 1,
      "replies": {}
    },
    "gl72tc7": {
      "link": "/r/AskAcademia/comments/l6s4fw/conducted_my_first_lecture_today_it_did_not_go/gl72tc7/",
      "text": "I am lucky that I had my first teaching experience last year when all classes were being done remotely via zoom. Even then I was quite nervous in my first couple of sessions. And I have to admit that a couple of times I pretended having internet connection issues in the middle of the class just so I could leave the zoom session and lookup the answer to a students' question. I then rejoined the session and impressed everyone with my crystal clear explanation :p",
      "author": "attackseek",
      "created": 1611895862,
      "upvotes": 1,
      "replies": {}
    }
  }
}