{
  "sid": "oqsq19",
  "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/",
  "title:": "What happens when as Assistant Professor applies for tenure and is rejected?",
  "text": "From my understanding, we have 6-7 years to put together a dossier worthy enough of tenure. If one is not approved, what are the typical next steps for said professor (at your institution or from your knowledge/experience)?",
  "author": null,
  "created": 1627142282,
  "updated": 1634082446,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 0.86,
  "comments": {
    "h6dkm2s": {
      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dkm2s/",
      "text": "at my institution (outside the US) they will be asked to leave. most of them find a TT or tenured role at another (lower-ranked) university. i know one who decided to retire early/become a SAHM.",
      "author": "victoria-lobster",
      "created": 1627142337,
      "upvotes": 23,
      "replies": {
        "h6dmeao": {
          "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dmeao/",
          "text": "I read the same at another institution that they have one year to “pack up their things and go” if being denied tenure. \n\nThis is something, as a PhD student, I discovered on my own. I think this is something that should be told to all Ph.D. students when going into the academic job market so they know that “or perish” is very real.\n\nAt first I thought it was if you fail tenure review on the first try, you can attempt again x number of years later. Now I know… it’s if you don’t get tenure you’re literally done for. 😳😰😱",
          "author": null,
          "created": 1627143199,
          "upvotes": 22,
          "replies": {
            "h6dsewn": {
              "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dsewn/",
              "text": "In most places in the US it is an \"up or out\" system and you do not get a \"second go.\"\n\nHere's how my institution words it: you cannot be in a TT position for more than 7 years without having been approved for tenure by the P&T committee. You can apply for tenure before your 7 years are up, and if you are rejected, you can still stay if you have more time on your \"clock.\" In my institution you can then apply again the next year assuming you went up early. Some people have done this here, but it almost always means that people get rejected if they go up early, because there are no consequences to rejecting someone and one can always wish for \"more\" in a candidate. (I did not go up early because I saw this was the clear pattern — I didn't want them to play games with my file. I did get tenure last spring, hooray.)\n\nIf you go up in your 7th year, you will get notice by the early spring semester that you got it or didn't. If you didn't get it, you finish up the semester but you will not be back in the fall as TT faculty. There is nothing that prevents them from hiring you as NTT faculty (e.g. a short-term contract), but if you are out of TT time, you can't ever work as TT faculty there ever again.\n\nI tell undergrads about the \"up or out\" nature of it and their eyes get big... I think it's important for them to understand how academia works (and why their TT professors look so stressed).",
              "author": "restricteddata",
              "created": 1627146095,
              "upvotes": 35,
              "replies": {}
            },
            "h6e3oyr": {
              "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6e3oyr/",
              "text": ">**I think this is something that should be told to all Ph.D. students** when going into the academic job market so they know that “or perish” is very real.\n\nI mean...it broadly is?",
              "author": "r3dl3g",
              "created": 1627151596,
              "upvotes": 23,
              "replies": {}
            },
            "h6e7beo": {
              "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6e7beo/",
              "text": "The vast majority of PhD students and recent PhDs going onto the job market will never be in that position since they will never get even a sniff of a tenure track position. Still good advice for the tiny few that do get that chance.",
              "author": "CaptainCornerCamper",
              "created": 1627153395,
              "upvotes": 23,
              "replies": {
                "h6e8ol1": {
                  "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6e8ol1/",
                  "text": "That’s crazy, the 2 2021 graduates from my program just landed TT positions, although they may be outliers?",
                  "author": null,
                  "created": 1627154086,
                  "upvotes": 7,
                  "replies": {
                    "h6e9xhg": {
                      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6e9xhg/",
                      "text": "Probably outliers, or you are from a super prestigious program.",
                      "author": "CaptainCornerCamper",
                      "created": 1627154715,
                      "upvotes": 14,
                      "replies": {
                        "h6fcc48": {
                          "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6fcc48/",
                          "text": "I would love to think it’s the 2nd, but it’s more likely a combination of 1 and the fact that our program is built solely for those going into academia.",
                          "author": null,
                          "created": 1627175081,
                          "upvotes": 3,
                          "replies": {
                            "h6gkr2a": {
                              "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6gkr2a/",
                              "text": "I don't think you mentioned your topic. It could be you are in one of the tiny minority that actually have good academic job markets.",
                              "author": "CaptainCornerCamper",
                              "created": 1627207714,
                              "upvotes": 3,
                              "replies": {
                                "h6gxyeq": {
                                  "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6gxyeq/",
                                  "text": "Management (Organizational Behavior).",
                                  "author": null,
                                  "created": 1627218466,
                                  "upvotes": 2,
                                  "replies": {
                                    "h6j3vou": {
                                      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6j3vou/",
                                      "text": "Yeah I'm an HR/OB professor and the job market is bad but not terrible. Way better than most other fields. We've actually been able to replace our last three retirements!",
                                      "author": "Dr_Pizzas",
                                      "created": 1627258001,
                                      "upvotes": 3,
                                      "replies": {
                                        "h6j546x": {
                                          "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6j546x/",
                                          "text": "I’m an HR/OB student ironically. We may even cross paths at AOM. Who knows, we may be at the same program? 😂😂",
                                          "author": null,
                                          "created": 1627258670,
                                          "upvotes": 1,
                                          "replies": {
                                            "h6j5rvs": {
                                              "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6j5rvs/",
                                              "text": "I'm pretty confident I'm not at your school but our paths certainly could cross at AOM.",
                                              "author": "Dr_Pizzas",
                                              "created": 1627259029,
                                              "upvotes": 2,
                                              "replies": {
                                                "h6j8301": {
                                                  "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6j8301/",
                                                  "text": "What are your interests? 👀",
                                                  "author": null,
                                                  "created": 1627260289,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "h6h8jkp": {
                                      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6h8jkp/",
                                      "text": "It could be one of them. Don't know but somebody here probably does.",
                                      "author": "CaptainCornerCamper",
                                      "created": 1627224527,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "h6dnb2c": {
              "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dnb2c/",
              "text": "Did it not come up in any undergrad research courses or career dev stuff as a PhD student? I'm surprised, I definitely was explicitly taught the tenure process a few times",
              "author": "mediocre-spice",
              "created": 1627143637,
              "upvotes": 14,
              "replies": {
                "h6dnrk0": {
                  "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dnrk0/",
                  "text": "same here, i was told/taught about the tenure process as part of my postgrad (masters) education",
                  "author": "victoria-lobster",
                  "created": 1627143857,
                  "upvotes": 9,
                  "replies": {}
                },
                "h6gh5d4": {
                  "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6gh5d4/",
                  "text": "It's part of our senior seminar class that all undergraduate students have to take to graduate.",
                  "author": "rockyfaceprof",
                  "created": 1627204259,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "h6dqqki": {
              "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dqqki/",
              "text": "I wouldn't spin it that negatively. First, with a very few exceptions (that are of course the horror stories told), whether you get tenure or not should not be a surprise. Similar to a PhD defense, you usually don't get to the point where you'd be going up for tenure unless you are expected to be successful. There are clear guidelines you get when you are deciding to accept a job on what the tenure criteria are in your department. You have yearly reviews and a bigger mid-tenure review to let you know if you are on track and areas to improve to get you on track. \n\nPeople make academia out to be some horrible beast, but the job security in a tenure track position is quite incredible compared to industry. You don't have the tenure process but it is very easy to lose a job in industry!",
              "author": "AwkwardAccountant5",
              "created": 1627145285,
              "upvotes": 27,
              "replies": {
                "h6duhq1": {
                  "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6duhq1/",
                  "text": "I second this. Most places have annual evaluations and a bigger evaluation in your third year, both of which give you a good idea of how you’re doing and provide you with feedback about what to do better. Missing tenure is not usually a surprise (with some exceptions of course)… usually you know if you’re a clear approval, clear rejection, or borderline. Most people who will clearly be rejected just leave beforehand, and many people who were borderline early on either leave or step it up by tenure time. It’s truly not usually a complete toss up unless there is something political going on, and you can’t control that.",
                  "author": "WitnessNo8046",
                  "created": 1627147096,
                  "upvotes": 14,
                  "replies": {
                    "h6e4pix": {
                      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6e4pix/",
                      "text": "I agree it's usually not a surprise but it's still really hard. One person I know who didn't get tenure became an adjunct, another now works at a tiny remote school (she left after third year review, which might have helped since she didn't have to say she didn't get tenure). It's not easy to find academic jobs.",
                      "author": "guitair",
                      "created": 1627152100,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "h6ghhb7": {
                  "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6ghhb7/",
                  "text": "Yep. I was a chair of social sciences at a 5000 student state baccalaureate college. First, we hire very carefully, second the mid-tenure review (3rd year) is critically important, third if somebody isn't doing well at that review, we basically give them another year to start doing REALLY well or they are released at the end of their fourth year. In my 36 years at our college there were 2 people that I know (campus-wide) who didn't get tenure when they came up. That statistic, of course, never impressed the TT faculty on their way up. It's always very stressful until you get the letter congratulating you on earning tenure.",
                  "author": "rockyfaceprof",
                  "created": 1627204579,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h6dqldg": {
      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dqldg/",
      "text": "At every school I’ve ever heard of in the US, if you don’t get tenured you’re essentially fired. It’s usually phrased as your contract not being renewed or similar. Some schools give you one year to get a new job, others fire you at the end of the year you applied for tenure, but you’re out, period.",
      "author": "WoodwardHoffmannRule",
      "created": 1627145216,
      "upvotes": 12,
      "replies": {}
    },
    "h6dqvcm": {
      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dqvcm/",
      "text": "You get a one-year terminal contract. During that year, you try to find a new job. Most go for lower ranking universities, some even end up moving with tenure. I mean, it really depends. If you get denied at Harvard, you are good. You will get a job. \n\nBut if you get denied [at University of Alabama, Huntsville….](https://en.m.wikipedia.org/wiki/University_of_Alabama_in_Huntsville_shooting)",
      "author": "whistlerredd",
      "created": 1627145351,
      "upvotes": 32,
      "replies": {
        "h6drjt9": {
          "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6drjt9/",
          "text": "For context, I laughed before clicking the link… I didn’t know she got denied tenure and murdered her department. That shit is crazy.",
          "author": null,
          "created": 1627145680,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "h6dqpl6": {
      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6dqpl6/",
      "text": "Candidates get one additional year—or a teach out—as you note above. Tenure denials are very rare where I teach, but the teaching and service expectations remain for that time.",
      "author": "profpetitfours",
      "created": 1627145272,
      "upvotes": 6,
      "replies": {}
    },
    "h6eqwo0": {
      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6eqwo0/",
      "text": "Depends on the institution. I’m TT. I have a contract for 4 years. At the end I’m evaluated and can get a 2 year extension. At the end of that I get evaluated again and either get tenure or my contract ends and I need to find a new job.",
      "author": "sci-prof_toronto",
      "created": 1627163397,
      "upvotes": 5,
      "replies": {}
    },
    "h6egq8v": {
      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6egq8v/",
      "text": "At my place, you have to go up no later than the 6th year. If denied, there is a lengthy appeal process and sometimes it is overturned. Otherwise, you can apply for a terminal year which is usually granted. Then you're gone. It has happened both ways in my experience here.",
      "author": "UfoTofu130",
      "created": 1627158173,
      "upvotes": 3,
      "replies": {}
    },
    "h6f5nx2": {
      "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6f5nx2/",
      "text": "At our school (in Canada), you go up for renewal first. At that point, the committee should really let you know if you are on track or in trouble. You have two years after that before you go up for tenure, and if you don’t get it then, you’re done.",
      "author": "Felixir-the-Cat",
      "created": 1627171321,
      "upvotes": 5,
      "replies": {
        "h6rzy69": {
          "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6rzy69/",
          "text": "do most TT profs get tenure in Canada? in the US I've heard some universities hire more people than they intend to give tenure",
          "author": "PM_me_ur_floof",
          "created": 1627435204,
          "upvotes": 1,
          "replies": {
            "h6s465o": {
              "link": "/r/AskAcademia/comments/oqsq19/what_happens_when_as_assistant_professor_applies/h6s465o/",
              "text": "I don’t think that’s the case here. If you get the job and do the job, you’ll get tenure. Promotion to fill professor is harder, but I feel like most people get tenure if they fulfill the expectations. I know at some Ivy Leagues in the Stated that is definitely not the case.",
              "author": "Felixir-the-Cat",
              "created": 1627437303,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}