{
  "sid": "m2a983",
  "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/",
  "title:": "Took a postdoc after PhD but I want out. How to transition successfully into industry?",
  "text": "How do I approach jobs that might view me as over qualified? How do I explain why I want to transition out of academia without explicitly saying that I hate the career path, the long hours, little pay, and endless stress?\n\nAnyone successfully leave their postdoc for industry? My background is in genomics (worked with fish so not even humans or viruses or anything useful for medical/pharmacy fields).\n\nI just want out I can't do this anymore.",
  "author": "Lowzenza",
  "created": 1615414032,
  "updated": 1634080762,
  "over_18": false,
  "upvotes": 181,
  "upvote_ratio": 0.99,
  "comments": {
    "gqie2mw": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqie2mw/",
      "text": "Just apply for jobs. There are plenty of jobs with a PhD as either a job requirement, or listed under “preferred qualifications.” There’s not necessarily a need to explain why you’re leaving academia; in general, only academics care about that",
      "author": "ProbabilisticWorld",
      "created": 1615420784,
      "upvotes": 131,
      "replies": {
        "gqkn1rs": {
          "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqkn1rs/",
          "text": "Yep and some jobs require a post doc lol, especially in the medical industry. 😂😗\n\nThere is no big hurdle, you arent really more overqualified then a fresh phd \n\nWayyy overthinking this, no one asks why you’re leaving in interviews and if you start talking about it you’re going to be shooting your self in the foot .\nThey want to know what you can do for them and why you want to work for them",
          "author": "RaddishEater666",
          "created": 1615471289,
          "upvotes": 11,
          "replies": {
            "gqun2sd": {
              "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqun2sd/",
              "text": "For the most part you’re probably right, but apparently my current boss almost rejected my application because they were worried that I would “get bored” in an industry position. Mentioning that you’re looking for stable work at a place that you can feel invested in might assuage some of those concerns. \n\nThey ended up taking a second look at my application and I’m so glad, but it really scared me when I found out how close I came to being overlooked.",
              "author": "Variance__",
              "created": 1615681124,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gqksjtm": {
          "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqksjtm/",
          "text": "In my experience, if you're asked why you're leaving academia or a early-stage startup, \"money\" is a perfectly acceptable answer that moves the conversation along to more productive topics really quick.",
          "author": "McFlyParadox",
          "created": 1615474055,
          "upvotes": 6,
          "replies": {}
        },
        "gqkyxoz": {
          "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqkyxoz/",
          "text": "I recently left academia. I was (still am a bit) a senior research fellow in the UK, so fairly senior. I moved into a different sector (healthcare policy from health research). They didn't ask me why I'm leaving, but did ask me why I want the job. I said to do something more applied/with more direct impact. \n\nIf they had of asked me more questions about why I'm leaving, I would have said because the path for progression in my current place of work is a shit show (obviously not those exact words) - that I would need to take a route that offered poor job security and would require me to work entirely independently, and I prefer working in teams. Plus I want to work on more applied issues.",
          "author": "zz_07",
          "created": 1615476998,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gqi8nh8": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqi8nh8/",
      "text": "I just started applying for industry jobs... no one asked me too much about why I wanted to leave academia, they focused on asking why I wanted the job I’d applied for and that was always easy enough to answer. \n\nI’ve jumped back and forth (not always through choice)- industry straight after my PhD, then back to academia for a post doc and then 3 years after that back to industry and I never had a problem.\n\nFor the record I made the move to industry for all the reasons you mentioned 😂\n\nPs I’m in a pharmacology related STEM field",
      "author": "cisco521",
      "created": 1615417995,
      "upvotes": 120,
      "replies": {
        "gqih9fg": {
          "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqih9fg/",
          "text": "[deleted]",
          "author": null,
          "created": 1615422472,
          "upvotes": 19,
          "replies": {
            "gqjm5pm": {
              "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqjm5pm/",
              "text": "Intellectual reasons- I never wanted to go the TT track route, even from the start my plan was to go to industry. I went back for a post doc after I was laid off from my industry job before returning back to industry.",
              "author": "cisco521",
              "created": 1615445771,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "gqirc0t": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqirc0t/",
      "text": "My postdoc ended in June. I got a temporary \"assistant research scientist\" position because the pandemic killed my in-progress interviews last spring. My background is neuroscience/computer science and I ended up getting a data analyst position in finance.   \n\n\nFor the most part, all you really have to say is that you realized that the academic track doesn't fit your life goals and that you want X (where X is something that the new position offers). This doubles as an explanation for why you're interested in the position they have available. My current position has nice set hours, an enjoyable work environment, and no looming make-or-break deadlines decided on in a completely arbitrary fashion. It's a lot less stressful, if perhaps not as stimulating. The pay is, unfortunately, on-par with my post-doc, however. That \\*should\\* change, but it's also important to consider that you may need to spend a year or two building skills to match what industry wants.",
      "author": "AFK_MIA",
      "created": 1615427771,
      "upvotes": 39,
      "replies": {
        "gqirh7p": {
          "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqirh7p/",
          "text": "To clarify - be careful not to be negative about academia, make your explanation positive about why you want the job you're applying to.",
          "author": "AFK_MIA",
          "created": 1615427848,
          "upvotes": 30,
          "replies": {}
        }
      }
    },
    "gqitapo": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqitapo/",
      "text": "I left my postdoc for an industry job back in January. Best decision I've ever made. Just start applying - I know networking is important, but I applied cold and ended up with a choice of offers. \nDon't focus on the \"I'm overqualified\" bit, because you're not. When you write your cover letters and interview, focus on those personality and work ethic traits you developed over the years. Put effort into that cover letter to convey those things and why you want to transition out of academia. \nMy background was in cardiovascular inflammation, but I work with people from all sorts of backgrounds. In my experience, they're way more interested in your work ethic and passions than your actual set of skills (depending what you're looking for!). You'll find the right fit if you just start going for it. Best of luck!",
      "author": "Team_Cap",
      "created": 1615428790,
      "upvotes": 16,
      "replies": {}
    },
    "gqiu7rw": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqiu7rw/",
      "text": "You have a Ph.D. + postdoc in a computational discipline? Congrats, you are a rare specimen that finally satisfies those crazy LinkedIn Data Science job requirements... start applying. Don't mention the fish, state that you worked in computational genomics. You are hungry and highly qualified. They will grab you eventually. If it gets tricky do a course in web development. That will prime you up for recruiters.",
      "author": "chiesazord",
      "created": 1615429270,
      "upvotes": 28,
      "replies": {
        "gqkgwt7": {
          "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqkgwt7/",
          "text": "I just started my postdoc so it wouldn't be something I completed.",
          "author": "Lowzenza",
          "created": 1615467701,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gqiryr2": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqiryr2/",
      "text": "Regarding your statement about \"fish = useless for medical fields\", that's not totally true. I know what you don't want from your post but don't see what you DO want (besides shorter hours/more pay/less stress). I can't tailor the answer to you without knowing more specific stuff but I can say in my case, my job is done by people with science, medicine, journalism, literature, regulatory affairs, law school, and a bunch of other backgrounds - all for the same job. So don't think your fish experience can't land you somewhere very different.",
      "author": "share_a_bellum",
      "created": 1615428099,
      "upvotes": 18,
      "replies": {}
    },
    "gqiqntu": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqiqntu/",
      "text": ">How do I explain why I want to transition out of academia without explicitly saying that I hate the career path, the long hours, ~~little pay~~, and endless stress?\n\nBetter work / life balance.\n\nLow pay is the postdoc. All roads lead to better pay. Everyone in industry understands that. No need to bring it up. When pay does come up, it will be with a recruiter or HR as they go over potential salary range. Do your homework to know what that will likely be ahead of time and that is the pay you discuss (if needed).\n\n>Anyone successfully leave their postdoc for industry?\n\nYep. Though the transition is different depending on if you are looking for a bench vs non-bench role. I've only now caught up to my fellow bench scientist colleagues salaries with comparable experience - took about five years in industry.\n\nAny ideas what you want to do in industry?\n\nI'm in genomics now. But not at the bench. I left the postdoc for similar reasons. Worked mainly with C. Elegans during that time. So don't feel like it limits you.",
      "author": "wondert",
      "created": 1615427423,
      "upvotes": 15,
      "replies": {
        "gqkh75x": {
          "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqkh75x/",
          "text": "I thought I wanted to stick with genomics work but honestly I just need an environment that is willing to train me on tasks. I can no longer keep up with the demand of self learning 30 new things to please my lab. It's stressful and I am way more successful learning from others than solely being self taught.",
          "author": "Lowzenza",
          "created": 1615467889,
          "upvotes": 4,
          "replies": {
            "gsy3na2": {
              "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gsy3na2/",
              "text": "Likewise!",
              "author": "NatH502",
              "created": 1617217989,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gqjiq52": {
          "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqjiq52/",
          "text": "Can you speak more to unappreciated differences between bench and non-bench roles and responsibilities in industry and if there’s any differences in work/life balance or intellectual satisfaction ?",
          "author": "phedder",
          "created": 1615443653,
          "upvotes": 3,
          "replies": {
            "gqn8pdc": {
              "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqn8pdc/",
              "text": "Intellectual curiosity will be the most variable and dependent on the individual. If doing science is what fills that need, not the specific topic, a bench role can be very fulfilling. But you don't really pick your projects in the same way. Even if you work in discovery. \n\nWith non-bench roles, you typically need to learn a lot of new skillsets upfront. Or work on polishing ones that were underdeveloped. Academic training values bench skills above all else - writing and effective communication come in a distant second. So if you take a role in marketing or product management or sales, anything visible in the business or customer facing, you will need to work on those things a lot. So intellectual curiosity is usually not a problem. \n\nWork / life balance is largely the same. Both roles offer opportunities to skew that balance and take on more responsibility - so you can choose to do a more 9 - 5 job (typical of most roles) or something that takes up more of your day.",
              "author": "wondert",
              "created": 1615514942,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gqis111": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqis111/",
      "text": "I went from postdoc, to startup, back to postdoc, now applying for professorships. Got a few industry job offers before 2nd postdoc as well. Your skills will translate well in industry, there are lots of people looking for basic bioinformaticians. I did frog genomics for example. You'll need to learn how to sell yourself to each company, generally you'll need to show you have the skills in Python, R, etc, and understand how to do the basic analyses needed. Sometimes that is population genetics (GATK or freebayes with a sample data set can teach you what you need), or just being able to do hardcore stats in R. Whatever your specialty is between those focus on jobs asking for those skills.\n\n&#x200B;\n\n Don't say you hate academia, but you can say you wanted to apply your skills in a more practical manner, etc. Basically you can say you know you want to leave academia because you don't see a future there, but it has to be phrased as \"your company fits what I would like my career to go into\". This is part of learning to sell yourself, it didn't come to me easily but after failing a few times I got good at the interviews. That may seem a bit depressing, but I assure you its less failures before seeing success than I've had interviewing for TT positions.",
      "author": "WockoJillink",
      "created": 1615428132,
      "upvotes": 9,
      "replies": {}
    },
    "gqjfgyz": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqjfgyz/",
      "text": "Leaving academia is NORMAL. That’s what most people do. Start looking at job descriptions (just search “PhD” or other relevant words for your skill set in LinkedIn Jobs) to find out what you like.",
      "author": "flagondry",
      "created": 1615441697,
      "upvotes": 8,
      "replies": {}
    },
    "gqix1f6": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqix1f6/",
      "text": "if you did genomics in anything you can apply it to any genomics subject. the tooling is common.",
      "author": "bigvenusaurguy",
      "created": 1615430762,
      "upvotes": 3,
      "replies": {}
    },
    "gqj2cwt": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqj2cwt/",
      "text": "I did this. I went into industry after doing a year of a postdoc. My field is in the social sciences, and I transitioned into UX research in the technology industry.\n\nBefore you can transition out successfully, you need to figure out what you want to transition *to*. It's not enough to just know you want to leave: what do you want to do? Since you know you want to leave, begin to safely scale back your work as much as you can so you can devote some cycles to investigating other job options for people in your field, with your background. There are some jobs that will directly use your skills in industry, particularly in national labs or government agency research, and some that will engage them more indirectly, like management/strategy consulting or data science.\n\nConsider joining a professional organization in your current city (or online) in fields in which you're interested; in my field, the equivalents are groups like UX Professionals Association and SIG-CHI. They sometimes will let you know about jobs before they are posted, and you can meet professionals in whatever field you're interested in and do informational interviews. \n\nYour undergrad or graduate university career center may still offer their services to alumni, so I'd check to see if they can do resume review or if they have an alumni job listserv (and if either of them are any good). Or the career services offices at your current institution might welcome postdocs at their events. Many large universities with graduate programs have non-academic career fairs and events for doctoral students.",
      "author": "roseofjuly",
      "created": 1615433703,
      "upvotes": 3,
      "replies": {}
    },
    "gqjsa1y": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqjsa1y/",
      "text": "Everyone here is right when they say to focus on what you want, but if you don't know what you want, just start applying for jobs and then listen to your gut when you think about whether that job is something you actually want to do.\n\nDoing a PhD gives you a ton of general skills that are valuable in the workplace, but it also encourages tunnel vision about your specialty, so you really do need to take a step back and think about your knowledge in a broader context.\n\nIndustry employers really don't care much about your PhD, and they sure as shit don't care about the specific topic. We have a guy right now causing all kinds of administrative issues because he didn't technically complete his degree but his employer doesn't care.",
      "author": "Unicormfarts",
      "created": 1615449795,
      "upvotes": 3,
      "replies": {}
    },
    "gqjv20r": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqjv20r/",
      "text": "You don't have to explain why you want to leave academia. The people hiring you have PhDs, too. They know why.",
      "author": "IAmVeryStupid",
      "created": 1615451710,
      "upvotes": 3,
      "replies": {}
    },
    "gqj4s4k": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqj4s4k/",
      "text": "Since you have a genomics background, let me ask: do you know analysis of transcriptomics and proteomics data? If you do, you are in good demand. There are so many jobs out there that require expertise in this area. You are not overqualified for those jobs.",
      "author": "KS_tox",
      "created": 1615435190,
      "upvotes": 2,
      "replies": {}
    },
    "gqj9pyc": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqj9pyc/",
      "text": "All of the ‘omics people I know are in either industry or government. By far the easiest way to transition is to look for a postdoc at the company you want. Do you want a contract research organization? Check out Eurofins or IFC or similar. Do you know what industry you’d be interested in? Many have postdoc positions to assist in the translation from academia. Or as many have said, apply directly as a senior scientist I or equivalent. \n\nI recommend reaching out to your university’s career center as well as picking up the “2hr Job Search.”  You might also find resources from the national postdoctoral association and government entities like the NIH to have some helpful resources as well.",
      "author": "graygoohasinvadedme",
      "created": 1615438307,
      "upvotes": 2,
      "replies": {}
    },
    "gqj4dnl": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqj4dnl/",
      "text": "Take what I say with a grain of salt because I’m a PhD student who’s ~1 year away from defending (haven’t really explored the job market yet)\n\nI don’t see the problem here and think you should think about this positively! Yeah, you didn’t enjoy your postdoc and, while that in itself doesn’t feel great, take pride in the fact that you went out of your comfort zone, hopefully picked up some new techniques/type of research, and have now taken away the fact that this isn’t for you. That’s not bad! If anything it’s solidified your interest in working in industry and makes you that much more confident that your next step is going to be amazing.\n\nDon’t worry too much about your research not being 100% applicable to your future career. I think 99.9% of grad students have this fear but the truth is our PhD/postdoc work is extremely specialized and will not completely apply to most jobs out there. I’ve heard from a couple people in the pharma industry that some relevant exposure is certainly helpful but they’re mainly looking for candidates who show the ability to grow and think critically. If you feel like you’re really not prepared, maybe something like an industrial postdoc might be of interest? Would give flexibility to work with multiple groups and explore/pick up relevant skills. Job security isn’t guaranteed but might be an option to consider along with a full time job depending on where you get interviews",
      "author": "raulu95",
      "created": 1615434923,
      "upvotes": 1,
      "replies": {}
    },
    "gqjkvcr": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqjkvcr/",
      "text": "I honestly just told possible employers here in Germany exactly that: while I did enjoy my PhD and the work, I am looking for a more stable career, where I don't have to move every few years, constantly worry about my pay and so on. I got lucky early on, so I talked to less than 10 people but they all understood, nodded and some said they often hear that.  \nIn my opinion it's actually a good answer because your new company very likely can give you a lot of that.   \nSo pick out which skills you have you can apply in the new job and spin it like that:   \n*In my academic career I always enjoyed the lab work but I am looking for a more secure career. I think the products you produce are great and I'd be excited to work in your lab to develop these new drugs and help people improving their quality of life\". Or you enjoyed travelling/networking (customer contact as consultant/salesman), writing/documentation (medical/technical writer), programming (Software Engineer), testing (Software Tester), communicating/presenting your research (Science Communication/Press Releases), ....  \nLeaving science because the job market is shit is a valid reason and one employers can relate to. The hard part is actually to twist why this now different career is not only exciting for you but why you'd be a perfect match for the position. Because you usually can't claim job experience, so you need to argue about your skills and your years of experience applying them \"in a different field\".\n\nYou can also find some resources and examples on r/LeavingAcademia.",
      "author": "LittlePrimate",
      "created": 1615444949,
      "upvotes": 1,
      "replies": {}
    },
    "gqjld7v": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqjld7v/",
      "text": "If you can't answer that question, and instead saying because you hate academia, I suggest you do more digging into under standing the industry. Once you read more, you'll start to build up your personal reason of why industry and why not academia",
      "author": "kiz97",
      "created": 1615445246,
      "upvotes": 1,
      "replies": {}
    },
    "gqkyf4a": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqkyf4a/",
      "text": "Did a postdoc for 4.5 years. Now in industry (pharma). Postdocs are basically required for a lot of industry jobs these days. They aren't advertised as such, and they don't pay you extra for your postdoc experience (only industry experience counts after PhD) but for a lot of positions they are only interviewing candidates who have done a postdoc. Now this might be in part due to academia being a ponzy scheme where more and more people are accumulated through the system in longer postdocs or second postdocs or non-TT positions, therefore there is a glut of more experienced people that pharma can hire for cheap. They did ask me why I wanted to leave academia and my answer was that I had always done both and was interested in doing great science with a huge impact and didn't care if it was in the industry or academia.",
      "author": "ThyZAD",
      "created": 1615476759,
      "upvotes": 1,
      "replies": {}
    },
    "gqjr202": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqjr202/",
      "text": "Depends a lot on location and also whether the jobs you are applying for are closely related to your current knowledge and skills. In my experience (phD in theoretical physics, living in Australia) it is very difficult to transition from academia to industry because people in industry don't see the value to high-level education, at least not in my country.\n\nThe only avenues for me have been closely related fields, literally R&D in Theoretical and Mathematical Modelling of very specific stuff (e.g. photonic systems), but the jobs for this are so scarce it is like trying to win the lottery: there are thousands of people applying for the same 10 jobs, so chances are near to none especially if you don't have a strong experimental component to your research.\n\nIn your case, I am not sure how it would play out. Nearly everyone I know from the genomics community went unto other universities (either moved states or countries altogether) to pursue more postdoctoral positions, or landed a job that is literally genomics-related in a private institution or government facility. Chances of moving to a field outside of genomics, let alone in industry are zero to none.\n\nEven if a job asks for a \"phD\", chances are they won't take most people because most companies these days are specifically interested in people with a Machine Learning or Data Science background, so unless you can prove you are very proficient at those things: forget about jobs in business/finance/data analysis. Again your chances may vary depending on where you live. Apparently many companies in the US hire just about anyone with a phD because they think it's equivalent to having worked at NASA or something, so maybe luck would be on your side.\n\nThe main advice I can give you though is: choose a job you really like and that really aligns with your skills/interests. A lot of people I know from STEM moved to data science because this seems to be the only field in industry that is willing to take in people from academic backgrounds. I tried to do the same, but to be honest data science is extremely boring unless you LOVE programming Python/R and using packages like Pandas and Scikit-learn. For the most part, it's a very business-focused profession, there's little innovation or profound knowledge in it, and because it's so overhyped these days you will probably be competing with at least 100 other people for any job you apply with the words \"data\" in it, even if it is entry-level.\n\nA better option would be to apply for R&D jobs, since you come from a more \"practical\" area than me, I think you probably have better options in those. If you really don't want to do research, then I guess try out data science or something to do with \"Statistics\". But be fore-warned: you might be going for a job you are not only overqualified for, but will also completely undermine your level of expertise and you will end up getting paid the same as someone who barely made it through a Bachelor's degree. Truth be told, businesses in the HR/consulting/financial/banking sector don't need more people with PhDs, they are already oversaturated with people that are \"good enough\" to do the jobs they have.",
      "author": null,
      "created": 1615448995,
      "upvotes": 1,
      "replies": {}
    },
    "gqijc5o": {
      "link": "/r/AskAcademia/comments/m2a983/took_a_postdoc_after_phd_but_i_want_out_how_to/gqijc5o/",
      "text": "A friend of mine is working on this after he moved to industry while working in London. You may want to check his website out: https://libertadconciencia.com/",
      "author": "yulipetrus",
      "created": 1615423594,
      "upvotes": 0,
      "replies": {}
    }
  }
}