{
  "sid": "qzki7g",
  "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/",
  "title:": "Freaking out! I have an interview for Associate Professor! What do you have to prepare? What kind of presentation you have to have? It's my first time and I need help!",
  "text": "As in the title. I scored an interview and I want to ace it but I have no idea what should I put in my presentation. How's the interview process? They're flying me from Europe to North America aaaahhhhhhh helppp",
  "author": "Practical-Confusion7",
  "created": 1637584678,
  "updated": 1637688585,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.41,
  "comments": {
    "hlmv45t": {
      "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/hlmv45t/",
      "text": "Well, if you were the interviewer, what would you be looking for?  Dont stress;  stress makes you stupid.  Just work.  Prepare, knowing there are plenty other universities out there.",
      "author": "sngle1now2020",
      "created": 1637586888,
      "upvotes": 5,
      "replies": {}
    },
    "hlmrqo9": {
      "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/hlmrqo9/",
      "text": "What kind of university is it? An R1? R2? Smaller school? \n\nWhat kind of appointment will it be? How much teaching? How much research?",
      "author": "NomadicHijabi",
      "created": 1637584827,
      "upvotes": 5,
      "replies": {
        "hlmtr50": {
          "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/hlmtr50/",
          "text": "Top 3 Canadian university, in one of the campus away from the main city. Expected to involve undergrads in research, tenure track. Doesn't really say how many hours you should teach but it stated that you are expected to teach your core area (microbiology)",
          "author": "Practical-Confusion7",
          "created": 1637586081,
          "upvotes": 5,
          "replies": {}
        },
        "hlmuscz": {
          "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/hlmuscz/",
          "text": "I'm sorry I sound so unprepared. I wasn't really expecting to get an answer from this university, although I was hoping for the best and I put all my efforts on the application.",
          "author": "Practical-Confusion7",
          "created": 1637586695,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hln7587": {
      "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/hln7587/",
      "text": "I think the title might be confusing to people - is it assistant or associate? \"It's my first time\" kind of implies the former even though you said the latter.\n\nYou'll get a schedule telling you what you'll be doing, but you should expect to give a research talk and a teaching talk. The former is a seminar style presentation of your research, followed by questions. The latter will be to a (hopefully) relevant class of (hopefully) students. Make sure you target this talk to your undergraduate audience. Redoing your research talk is a mistake I've seen several times.\n\nAnother thing to mention from a Canadian perspective (which you mention in the comments) is that the final part of the interview is a literal panel interview where they will ask you a set list of questions. This is the same for all candidates for fairness reasons. They shouldn't be too surprising and will fall along the lines of \"why do you want to work here?\", \"what's your 5 year research plan?\", \"how will you set up your lab?\", \"how much funding will you need?\" etc. The funding model here is quite centralized. You should look up NSERC, since it will be your main funding body. If you're setting up new infrastructure (i.e. your department has attached major equipment buys to your position) then that will be something else again.\n\nIn Canada, you can expect that anyone you speak to will be welcomed to send in their feedback to the hiring committee, but that they will be responsible for making the decision.",
      "author": "Frelaras",
      "created": 1637593003,
      "upvotes": 3,
      "replies": {
        "hlncikm": {
          "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/hlncikm/",
          "text": "Jesus, I'm indeed freaking out because I wrote Associate and it's \"Assistant\". My apologies, it's a bit overwhelming...\n\nThey told me that they will like me to go there within 1 month, and I am afraid it may be kind of a short notice for preparing myself. It can be argued, however, that I should be ready. The problem is that in my current lab it is not really allowed to openly apply for positions and practice for interviews. Our PI does not like that you are not 100% in the work and he has not given very positive reference letters to other postdocs. Besides, the environment is quite toxic, so you cannot openly talk with colleagues about your plans. \n\nI appreciate your answer very much, you provided me with direct and compassionate answers. May I ask, perhaps, whether I can do my teaching talk about a microbiology (which would be my core area) close to my research area? For instance, my teaching seminar would focus on in vitro models of the gut environment, while my research talk can deal with the advances I have got in my current postdoc. Would that work? Thanks so much for your patience!",
          "author": "Practical-Confusion7",
          "created": 1637595361,
          "upvotes": 4,
          "replies": {
            "hlnegii": {
              "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/hlnegii/",
              "text": "The short answer is yes; your proposed division sounds reasonable.\n\nThe research talk in North America is a fairly coherent genre of presentation and you can find lots of outlines and advice out there. The goal is to establish yourself as an independent researcher with a coherent and promising line of research. -Probably-, you will draw a line between your PhD and your current work with some discussion of each -- weighted towards the most recent project.\n\nThe teaching talk should establish that you know how to convey material to students. Once you know the class you'll be addressing, do your best to reach that grade level. If they put you into a first-year course, you need to try really hard not to speak in graduate level terms which assume a lot of earlier learning.",
              "author": "Frelaras",
              "created": 1637596177,
              "upvotes": 5,
              "replies": {
                "hlngpfr": {
                  "link": "/r/AskAcademia/comments/qzki7g/freaking_out_i_have_an_interview_for_associate/hlngpfr/",
                  "text": "Thanks so much for the feedback!!! I will surely take it into consideration, thanks again!!!",
                  "author": "Practical-Confusion7",
                  "created": 1637597101,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}