{
  "sid": "oq0xur",
  "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/",
  "title:": "Did I cheat in my masters thesis?",
  "text": "Some years ago I finished my degree, did I unintentionally plagiarize?   \n\n\nHere is the story, I've been working for the past years with my degree in a field, which went great until I decided to take a break. However during my break period, I started wondering if what I did was cheating, and now I feel awful, because I am sure what I did was academic misconduct, and if found out my degree will be revoked. Which I am not interested in.  \n\n\nWe were encouraged to read other peoples master thesis, and I in fact decided to do that, I read the master thesis of several previous students within the same field as me and used 3-4 of these in terms of figuring out how I could construct my own thesis. One of them was VERY good, it was not only within the same field but also a very relatable topic and this is where it starts to get messy.   \n\n\nOur method and theory sections are looking very alike.   \nI use the same research method as theirs, and likewise the same theory, I even recall taking a reference from their thesis, as it was a really good one, and was basically all I needed to reference through my thesis. As we have the same educational background with the same lectures, a lot of the references they used were from the classes, and therefore some of those I would naturally have used with or without the inspiration of that thesis. However my theory section is structured just like theirs, I have naturally added something to mine, as it was not entirely a relatable topic, and naturally, I added some theories that they did not use, and I did not use all the same theories as they did, but it was darn close. So generally my thesis is structured like theirs, and if they compare the two of those, they would, without doubt, see the similarities.   \n\n\nThe major problem you ask?  \nI never cited them, and this is where it gets tricky for me, whether or not I did the right thing.  \n\n\nYes, I looked at the sources they used, and yes I read the thesis they wrote, but after doing so, I always went back to the original source that they used and read what that said, and then I wrote my own. I did not try to copy-paste theirs, and therefore i only cited the original source that they used. As it was empirical studies both of them, the way we conducted it was similar, and I was inspired by them in terms of what was relevant to take into consideration, but I only cited the original source. Was this wrong? Should I have cited the others?  \n\n\nTL;DR - I took the method/theory of how others conducted their master thesis and replicated it towards my own master's thesis, and only cited the original source and not the thesis which I found it in.   \nWhy is my text a mess? Because it is like my current state of mind, I feel like a nobody, a cheating pig, a girl/guy why cheated his way into his degree. No plagiarism checker such as Turinit found anything wrong with it, but I am so afraid that someone will figure out and report me, even though my thesis is not public.   \n\n\nSomebody lynch me for being a shitty person.",
  "author": "PeterRVir",
  "created": 1627041727,
  "updated": 1634081896,
  "over_18": false,
  "upvotes": 107,
  "upvote_ratio": 0.86,
  "comments": {
    "h68pwjp": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68pwjp/",
      "text": "Do I understand it correctly that what you \"copied\" from the thesis is merely the structure and references?\n\nYou read the original sources and you cited them where appropriate, and wrote the whole thing in your own words, right? \n\nI wouldn't call that cheating. I take ideas and references from other papers a lot and then don't cite the paper where I found the reference if the aim or novelty of that paper isn't relevant for whatever I'm writing.",
      "author": "OscarThePoscar",
      "created": 1627043848,
      "upvotes": 217,
      "replies": {
        "h69we01": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69we01/",
          "text": "It really depends on what op actually borrowed and what they actually wrote. \n\nThink about like this. You wouldn't be able to take the script of Star Wars, paraphrase the whole thing, and publish it as your own (parody not withstanding). However, you could write your own space opera around the hero's journey/call to action, following similar plot points using the same narrative tropes.",
          "author": "makemeking706",
          "created": 1627063046,
          "upvotes": 47,
          "replies": {
            "h6a9ckx": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6a9ckx/",
              "text": "Yes, and it sounds like OP did the latter; using the same structure to discuss their own theories and ideas.",
              "author": "OscarThePoscar",
              "created": 1627068811,
              "upvotes": 14,
              "replies": {
                "h6bgpub": {
                  "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6bgpub/",
                  "text": "Undergrad major was sociology: research. I often constructed analysis templates. I Did it when writing training procedure manuals at Soc.Sec. & Red Cross. In grad school our prof, who was a pompous ass, had a terrible form 4 reviewing books & papers so I totally re-did-it. I was always polite but it's not fair that he expected students 2 use such a flawed form. Of course he was ticked\n& tried 2 push me around in retaliation but I got my A....so. And he wasn't a stupid man but he didn't have my background in research &  survey construction . He should've been grateful.   But he retired the next semester so I couldn't know if he would've  continued 2 use his junk form.",
                  "author": "MarisaWalker",
                  "created": 1627090159,
                  "upvotes": -14,
                  "replies": {
                    "h6c67nn": {
                      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6c67nn/",
                      "text": "…what does this story have to do with the post?",
                      "author": "HoodiesAndHeels",
                      "created": 1627105810,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h6c0vd8": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6c0vd8/",
              "text": "No, you really could just paraphrase Star Wars, maybe change it from a sci fi epic to a fantasy? Maybe with a dragon?",
              "author": "Arentanji",
              "created": 1627101965,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "h68y8a4": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68y8a4/",
          "text": "It wasn't relevant, I did not use their conclusion, analysis or discussion or anything like that. Merely the methods. My worry is that the first 20 pages are identical in terms of structure the things within it, is not the same, as my wording is like a 15-year-old, and theirs were more academic. The content was to some extent not the same either, however, the methods were 5-7 pages, so I doubt it can actually differ that much. But if I found something they had used, i naturally went directly to the source and paraphrased and included it, and where i paraphrased it kinda looks like each other, as we are using the same 2-3 lines and trying to paraphrase those, while trying to be true to the original author and using the theoretical terms they were using.",
          "author": "PeterRVir",
          "created": 1627048200,
          "upvotes": 18,
          "replies": {
            "h69elh6": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69elh6/",
              "text": "That's just how scientific writing works. There's generally a specific order in which you present your narrative, and if your field is even slightly niche, you all regurgitate the same main theory using the same terms and try to vary it slightly.",
              "author": "OscarThePoscar",
              "created": 1627055443,
              "upvotes": 58,
              "replies": {}
            }
          }
        },
        "h6bfnaj": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6bfnaj/",
          "text": "When in doubt ALWAYS cite, in fact always cite. Hawking did. And collobated 2.",
          "author": "MarisaWalker",
          "created": 1627089586,
          "upvotes": 2,
          "replies": {
            "h6c1emx": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6c1emx/",
              "text": "Sure, but OP's thesis has been handed in and graded. They can't change it anymore, and in this case not having cited the thesis he readas inspiration will very likely not count as academic misconduct.",
              "author": "OscarThePoscar",
              "created": 1627102306,
              "upvotes": 9,
              "replies": {
                "h6deilk": {
                  "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6deilk/",
                  "text": "whether it \"counts\" as academic misconduct to the degree that his MA would be revoked seems to me to be beside the point.  Almost no institution would revoke an MA, unless there were something hugely egregious. \n\nBut to use a source heavily and NOT cite that source (but instead cite it's sources, making it look like the synthesis was original rather than borrowed) is ABSOLUTELY unethical and unprofessional. \n\nCite.  Every.  Source.  That. You.  Use.   \n\nIt's simple.  If there's no direct quotation or equation to cite, then find another way to cite it. \n\nI think you're really skating on ethically-dubious territory yourself, here, by seeming (?) to excuse transparently unethical behavior.  And that you're the top-upvoted comment is, to me, really disturbing.  (and a sign that it's students, not professors, who populate this subreddit.)",
                  "author": "DerProfessor",
                  "created": 1627139399,
                  "upvotes": 1,
                  "replies": {
                    "h6dfcm6": {
                      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6dfcm6/",
                      "text": "OP is asking whether they should be worried their degree will be revoked, NOT how they should have cited. \n\n\nI generally cite all the sources I use, except Wikipedia etc., but I am also conscious about not inflating the number of references.",
                      "author": "OscarThePoscar",
                      "created": 1627139800,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "h6bfp54": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6bfp54/",
              "text": "Even when not in doubt CITE",
              "author": "MarisaWalker",
              "created": 1627089613,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h69100n": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69100n/",
      "text": "> I looked at the sources they used, and yes I read the thesis they wrote, but after doing so, I always went back to the original source that they used and read what that said, and then I wrote my own.\n\nThis is normal operating procedure in research. Should you have cited the thesis that pointed you in the right direction? Yeah, probably, but nobody really cares about how many citations a masters' thesis has and thus would probably rate somewhere around \"accidentally bumped into me on the subway\" levels of harm. (If you did cite the thesis, I'd bet $20 that the person wouldn't have even noticed)",
      "author": "Tagost",
      "created": 1627049495,
      "upvotes": 28,
      "replies": {
        "h6b4qde": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6b4qde/",
          "text": ">If you did cite the thesis, I'd bet $20 that the person wouldn't have even noticed\n\nI can remember the name of every person / paper that's cited my masters thesis lmao. All three of them.",
          "author": "Jacqland",
          "created": 1627083754,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "h68q5iq": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68q5iq/",
      "text": "> I took the method/theory of how others conducted their master thesis and replicated it towards my own master's thesis, and only cited the original source and not the thesis which I found it in\n\nThis is mostly the correct way to do it, you went and read the original source and used them. \n\nYou should have found if the person had published anything relating to their Master's and cited their published work when reasonable. If they had no publications it is academically grey as it is bad practice to cite non-peer reviewed work when peer-reviewed work is available.  This doesn't rise to the level of plagiarism, at worst it you are in very complicated grey area that has no-clear correct way to do it.",
      "author": "entropyStable",
      "created": 1627043994,
      "upvotes": 91,
      "replies": {}
    },
    "h69dpij": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69dpij/",
      "text": "If you're only worried several years later that you *might* have plagiarized, then you're probably fine. If you had intentionally cheated then you would obviously know it, and literally nobody is going to go back and look at your Master's thesis again. Just forget about it and move forward doing your best work. We all improve over time, no point worrying about the quality of your work from several years ago when you didn't know any better.",
      "author": "EmeraldIbis",
      "created": 1627055067,
      "upvotes": 18,
      "replies": {}
    },
    "h691ctz": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h691ctz/",
      "text": "Why is no one bringing up that this was years ago? Why is this suddenly on your mind OP?",
      "author": "ze_shotstopper",
      "created": 1627049657,
      "upvotes": 11,
      "replies": {
        "h693ewh": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h693ewh/",
          "text": "Shame and guilt. I feel like I plagiarized once I read both of them again due to me taking some time off work.",
          "author": "PeterRVir",
          "created": 1627050589,
          "upvotes": 6,
          "replies": {
            "h696xsy": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h696xsy/",
              "text": "Look man, at the end of the day it's in the past and there's nothing you can do about it. You worked hard to achieve your masters degree and the general consensus in this thread has been that you are fine. My words will not do anything to alleviate how you feel but one mistake doesn't invalidate the rest of the work you've put in. The best thing you can do is to learn from this moving forward.",
              "author": "ze_shotstopper",
              "created": 1627052137,
              "upvotes": 14,
              "replies": {}
            },
            "h6bhctc": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6bhctc/",
              "text": "I don't think u should b ashamed. U have a conscience. We live & learn & grow.",
              "author": "MarisaWalker",
              "created": 1627090499,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h68wt29": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68wt29/",
      "text": "As you describe it, no, I wouldn’t say so. Two things: 1. you *should* look to others who were successful and use their work **as a template**, by which I mean take note of the structure, what was included and not included, level of detail, etc. That’s part of learning to be a better writer. And 2. methods sections are understood to be dispassionate and neutral, with little room for originality or creativity (unless you invented a new procedure or something). Almost everyone will want just a retelling of your steps, as they were performed, without added frilly details or linguistic flourish. There’s only so many ways to write that way and convey the proper amount of detail. The discussion is where you can be more creative and express your ideas in your own voice (within limits of course).\n\nThe obvious exception is copy/pasting or claiming others’ work as your own.",
      "author": "tamelotus",
      "created": 1627047510,
      "upvotes": 8,
      "replies": {}
    },
    "h693358": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h693358/",
      "text": "It's a master's thesis and you were probably trying to cite original sources, but I do agree with you that what you did is objectively of concern.  Still, it's more a thing to learn from and to keep in mind for next time, given that it's now locked away.  At the very least, assuming you continue in academia, you can learn from this and do things differently.    \n\n\nWhat would have been best for you was to cite the other thesis with a brief statement of how you are working with their concepts and methods, but also differentiating your work from theirs.  Such a statement would only be a few lines, but is not only ethical, it will protect you from claims of plagarism (keep in mind that plagarism need not be simply copy-paste) . It then shows you are conversant not just with original sources, but also in conversation with the work of contemporaries.    \n\n\nIn the math world, for instance, we sometimes write proofs whose structure is nearly identical to other proofs, but just in a different context.  When I did something like that, I would say something like, \"the terms and structure of the following proof are based on Theorem 2.3 in \\[X\\]: \"  Even if  X was more \"intermediate.\"",
      "author": "Lagrange-squared",
      "created": 1627050442,
      "upvotes": 9,
      "replies": {}
    },
    "h68zago": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68zago/",
      "text": "I’m I the only one who thinks this is borderline at best? The thesis should have at least been cited as a source of inspiration. You essentially treated it like a parts shop without ever letting a reader of your work know where you sources those parts. Simply going back to the original sources and citing them is not an appropriate form of attribution. The knowledge required to know who to cite and who not to is important and of value. I am currently dealing with a professor who is taken a literature review I wrote and has now included it in what seems to be a publication where he will be sole author. He might have now, after being showed how it all fits together, read the originals. I would say this is maybe not plagiarism but it’s far from good.",
      "author": "Minori_Kitsune",
      "created": 1627048704,
      "upvotes": 48,
      "replies": {
        "h69jupr": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69jupr/",
          "text": "Yes, in my field, we cite the source we found something in. I'm shocked people here say what happened here is 'correct.'",
          "author": "IamRick_Deckard",
          "created": 1627057682,
          "upvotes": 23,
          "replies": {
            "h6g1zy3": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6g1zy3/",
              "text": "I felt I was the only one ! Reading the above comments were shocking",
              "author": "Minori_Kitsune",
              "created": 1627191136,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h69jb1d": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69jb1d/",
          "text": "Methods are building blocks, there is a natural sequence to reporting theory -> methods. They came from the same institution, there was likely influence from how they were taught the material. The methods and the theory provide the context for the current investigation (whether that is in a unique application in a different population or further developing the methodology). I take it you are also a student in a Master's or PhD degree program. As your career develops and you have more exposure to the literature you see very similar reporting of theory/methods because... it is what it is. Read 5 books on a topic and compare their indices, 9/10 they follow the same structure establishing the theory and methods. Conveying theory is hard, trying to vary on sequences of communicating that theory is even harder. I would argue is not relevant to the study at hand for intellectual contributions to the field. Plagiarism is not meant to impose constraints on HOW it is reported, but WHAT is being reported and deter people from taking credit for works they did not generate. In this case, it's clear that the student had an understanding of the theory and methods, otherwise it would be abundantly clear to the examiners evaluating their results, conclusions and discussion. My take - sounds like a case of insecurity/ imposter syndrome than any failing of academic obligations.",
          "author": "growing_boylight",
          "created": 1627057451,
          "upvotes": 8,
          "replies": {}
        },
        "h6ao4hc": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6ao4hc/",
          "text": "Agreed!",
          "author": "TrishaThoon",
          "created": 1627075510,
          "upvotes": 2,
          "replies": {
            "h6g0w1p": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6g0w1p/",
              "text": "Good to hear someone agrees 🙏",
              "author": "Minori_Kitsune",
              "created": 1627190301,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h69obym": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69obym/",
      "text": "I'm going to disagree with the majority here. OP you absolutely should have cited the thesis you read. It doesn't matter if you ultimately found the original material. That original thesis was your pathway to said material.\n\nCitation and Plagiarism are not narrow technical things. Its about giving credit to those who have helped you on your journey. All research is achieved by standing on the shoulders of giants. And nothing ever is really unique. The point of referencing and citations is to give credit where its due. You might not have technically cheated by institutional standards. But you owed the person who helped you the necessary acknowledgment.\n\nAnd that's where your guilt is stemming from I think.\n\nAll that said, I think the issue here is to use this experience as a learning lesson. If you'd like to try and make amends, consider looking up the thesis and maybe sending an email to the author. Its been many years sure, but a simple note explaining that you wanted to thank them for how helpful their thesis was when you were a student is hardly a big deal. And try and make sure you're being thorough with giving credit going forward. And if you're in a position to help explain this to others, your actions can help others learn too.\n\nWe don't really ever teach academic ethic with this sort of nuance. We just expect people to pick this stuff up, or do it informally from advisor to student. And something can be unethical and yet be on the right side of formal rules. What you did was, IMO, unethical. But its also an understandable mistake to make. Don't beat yourself up over it. Don't forget about it, but certainly don't let it haunt you. You're not a shitty person, just someone who made a mistake and wasn't as thorough in recognizing credit as you could have been. Use it to grow as a scholar and help others too.",
      "author": "boringhistoryfan",
      "created": 1627059581,
      "upvotes": 44,
      "replies": {
        "h6a8gqr": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6a8gqr/",
          "text": "I agree with this take entirely. I'm not sure it quite crosses the line to academic misconduct (although the failure to cite is problematic) but it's very weak scholarship and as you say unethical.\n\nThe advice to read other theses is precisely so you can see how others have done it and learn from it but when you take one thesis and basically use it as the template for your own as closely as OP seems to have done, that's too much. \n\nThis may be a little bit harsh but I find myself quite irritated when people wallow in guilt - it's rather self indulgent without actually changing anything. OP's attitude of inviting everyone to attack and suggest they should have their degree revoked rubs me up the wrong way - it strikes me as disingenuous because if he truly believed he plagiarised he wouldn't be here asking us, so I feel that he's really asking us to make him feel better.  OP did wrong, but rather than seeking to get their degree revoked - which I don't believe they'd actually try to do - they should be doing what you say, which is seeking to do better in future and ensuring that those they mentor formally or informally also learns these things.",
          "author": "ACatGod",
          "created": 1627068411,
          "upvotes": 10,
          "replies": {}
        },
        "h6b4z8o": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6b4z8o/",
          "text": "I agree but it’s too late to do anything about it now",
          "author": "Useful_Bread_4496",
          "created": 1627083882,
          "upvotes": 2,
          "replies": {}
        },
        "h6bw03f": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6bw03f/",
          "text": "This is the best take in the thread, IMO",
          "author": "leyla212",
          "created": 1627098830,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h69uqsi": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69uqsi/",
      "text": "Here's a word of advice, take it your grave and dont tell the university",
      "author": null,
      "created": 1627062330,
      "upvotes": 4,
      "replies": {}
    },
    "h68rs5i": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68rs5i/",
      "text": "No, this does not sound like a case of plagiarism to me.\n\n\"I use the same research method as theirs, and likewise the same theory.\"\n\nThe important question is: was the research method their original invention? If so, then it is plagiarism to use it without giving them credit. If it was a method that they obtained from another source, then you've done all you need to do with regard to honesty by citing the original source.\n\nLikewise with theory.\n\nIf you did find that their thesis was very high quality and helpful, then it's a courtesy to give them a citation in your paper, usually in the \"related work\" section. But failing to do so is not plagiarism or academic dishonesty.",
      "author": "radams78",
      "created": 1627044917,
      "upvotes": 20,
      "replies": {
        "h69d07l": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69d07l/",
          "text": "While I agree it's not a terrible move, it *is* kind of mean not to cite your colleagues papers if you were reading them and using them to aid your research. It's just the nice thing to do to help further each other's careers and build some relationships.",
          "author": "SlothRogen",
          "created": 1627054768,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "h68psvj": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68psvj/",
      "text": "As I see Master's are a introduction to research, and PhD when you actually learn how to become a researcher and create something new. A master's thesis  does not need to be original work like a doctoral dissertation. If you feel that you have an idea how to start a research, read other people's work, and talk about a paper you read, you are at Master's level. Coming up with a methodology to create something new is hard, and is learnt during a PhD.",
      "author": "trustyourtech",
      "created": 1627043788,
      "upvotes": 17,
      "replies": {}
    },
    "h68rp9p": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68rp9p/",
      "text": "What you did was correct. It's fine to use the structure of another thesis, as long as you then use your own words. Citing the original work is also the correct thing to do - when possible you should always cite those who made the original discovery. I would add that for many types of work on the same topic, such as a Master's thesis, there aren't that many 'good' ways to structure the text; you will very frequently recreate the same text structure independently, because it's simply the best way to do so. \n\nPlagiarism would be to copy-paste entire segments of another thesis/work. Which according to your explanation, you did not do. So you are fine.\n\nIn addition, I would add that nobody, literally nobody, will take the time to read all these different theses and compare then to find out if someone cheated (especially if Turnitin didn't find any concerns). You would need to be a politician or celebrity with journalists out to get you for someone to take the time to do that. At the end of the day, whether it's a Master's  or a PhD, almost no one will ever read your thesis. It will be you, your supervisor, and the examiner(s). That's pretty much it.",
      "author": "Cell_Division",
      "created": 1627044872,
      "upvotes": 16,
      "replies": {
        "h68wggw": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68wggw/",
          "text": ">I would add that for many types of work on the same topic, such as a Master's thesis, there aren't that many 'good' ways to structure the text; you will very frequently recreate the same text structure independently, because it's simply the best way to do so.\n\nPlus institutions usually have expectations for what a thesis will look like. It's normal for everyone in a department or across the whole university to have a very similar looking document because that's what the department/university wants to see. They even make and hand out templates with the exact layout they prefer. If you *don't* match the standard then you're setting yourself up for trouble.",
          "author": "officially_anxious",
          "created": 1627047337,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "h68ukmf": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68ukmf/",
      "text": "To people concerned.   \n\n\nYes, I naturally wrote it all myself, and but I perhaps emphasized and included the same items as the other thesis. I noted down what they believe was relevant, and then I read the original source, hence why the structure is alike (I did not include everything which I wrote down in my notes, as some of the topics they covered weren't relevant for me). But as I recall i made a quite big mistake by writing my theory section first, as it was just plain and basic stuff, half of it I did not even end up using in my thesis, however, this did not reflect in my grade which was great.   \n\n\nNeither the methodology nor the theory was based upon something they created, they cited other people, their new creation was in the \"Analysis\" which I didn't even bother to read, because i conducted my own study with a smaller sample, and with another focus but using the same method. The results for them was to generalize, mine werent, however the results look a like as we use the same theory.  \n\n\nBut when i read it, i can see that the thing we put forward are almost identical. Not in wording (Their wording is much more academic than mine, i write like a toddler, hence why it perhaps werent flagged in turninit).  \n\n\nI also realized that I was sloppy with my references in general, there was no doubt where the information came from, but i failed to properly cite it multiple times, as i only cited it in the indtroduction, and sometimes in the end of each sector, was this also wrong?  \n\n\nMust admit, i get stressed over small things, and someplace in my heart, I know that I might have unintentionally plagiarized which is killing me. Could literally be what would amount to one full page, simply because i can't recall it, and it is bugging me, and almost got me to turn myself in to the school.   \n\n\nI have no aspiration within the academic world, i only took a degree to get a job, and i know i am capable of doing the job, but my imposter syndrome perhaps kicks in.",
      "author": "PeterRVir",
      "created": 1627046395,
      "upvotes": 8,
      "replies": {
        "h6975cj": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6975cj/",
          "text": "Please go see a therapist and chat about this, your reaction honestly seems really out of proportion. You've said this has only come up for you recently as a concern, and as you can see, most people in this thread - professionals that you're asking for advice - are saying it doesn't sound concerning, yet you seem unable to hear that and keep doubling down with very harsh words about yourself. Your anxiety about it is clearly causing you distress and I think you should talk to someone about it. All the best.",
          "author": "The-very-naughtyduck",
          "created": 1627052226,
          "upvotes": 16,
          "replies": {
            "h69genh": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69genh/",
              "text": "Also I would like to address that it's ok to be self-judge. We all do it even got our PhD. However do not be paranoid. You \\*\\*might\\*\\* did something wrong with your paper/thesis/etc. ~~If it's ok you are ok~~. If it's not cheating or faking, it should not be a big career problem. \n\nIf you become paranoid, somehow it would be toxic to your academic career.",
              "author": "Metalpen22",
              "created": 1627056212,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h69edi0": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69edi0/",
      "text": "You are overthinking things. Move on.",
      "author": "Whtzmyname",
      "created": 1627055351,
      "upvotes": 9,
      "replies": {}
    },
    "h68xwrv": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68xwrv/",
      "text": "I think you're fine.\n\nIn our group there's a whole series of PhDs going back 2 decades now that follow similar stuctures in their background/theory chapters. There's only so many ways you can structure it.",
      "author": "Broric",
      "created": 1627048049,
      "upvotes": 4,
      "replies": {}
    },
    "h6926nt": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6926nt/",
      "text": "You're fine. People read other people's thesis all the time. Think about how other people read others journal articles and also copy their structure. \n\nAbout method, there's only so many ways that one person can structure or conduct it. For example, those conducting quantitative research in the same faculty, doing the same method across different batch will tend to have similar structure for chapter 3/4. There really isn't THAT many way to write research methodology chapter, honestly. As for theory (lit review in chapter 2), that one is slightly different as there is a diverse way to write that chapter. But if you only copied the structure, that isn't plagiarism.\n\nPeople read from other people's thesis all the time. I personally do not think you have to cite a thesis that you read from. What exactly are you even going to cite them on? On top of that, citing a thesis is generally not encouraged. The only thing I feel odd about is you not knowing your friends also reading from other people's theses ;)",
      "author": "givemeyourdonut",
      "created": 1627050032,
      "upvotes": 3,
      "replies": {}
    },
    "h69xh7e": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69xh7e/",
      "text": "No, it's not plagiarism. It was pretty shitty not to reference their work, and I can't for the life of me think why you didn't, but unless you actually passed off their work as your own, then you are fine. But you have your master's now, it's over.\nBut give people the credit they are due in future yeah.",
      "author": "Commercial-Sir3385",
      "created": 1627063520,
      "upvotes": 2,
      "replies": {}
    },
    "h6agafe": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6agafe/",
      "text": "If it is just structure, that is completely fine. As long as you did not copy a finding, statement, or claim from them that wasn’t your own. Thesises tend to follow similar structures anyways - it’s all about presentation.",
      "author": "cm0011",
      "created": 1627071914,
      "upvotes": 2,
      "replies": {}
    },
    "h6cjoy2": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6cjoy2/",
      "text": "Isn’t this just imposter syndrome? \n\nYou should be more worried about your birth certificate being revoked and being told you don’t actually exist",
      "author": "TheUltimateParadox",
      "created": 1627117595,
      "upvotes": 2,
      "replies": {}
    },
    "h68tq1n": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68tq1n/",
      "text": "Honestly, if you're asking \"did I cheat?\" on the internet (where you'll be putting the best possible 'spin' on your intentions and actions), \n\nthen you almost certainly cheated. \n\nThe big question is:  why on EARTH did you not cite that thesis??!!   That is professional misconduct right there.  You not only read the thesis, but you used it *heavily*.    But you didn't ever cite it.  Why not???\n\nOf course you went back to the original sources that the other MA thesis cited.  But it would have been just *so* easy to cite the MA thesis as well.  In fact, you're ethically obligated to find a way to cite it.   Why didn't you just have one of your earliest footnotes be a shout-out to the original thesis-writer?   i.e.  \"I am indebted to Smith, 2017, for both references to outstanding sources and, in a larger view, as a model for my own work.\"   presto, done.   Easy as pie.  \n\nThe reason why you didn't, most likely, is that you probably borrowed/lifted much more heavily than you are admitting here (or admitting to yourself), and didn't want to offer a trail of breadcrumbs back to your (self-perceived) crime-scene.\n\nWill your MA be revoked?  I don't know.   \n\nBut if I had written that original thesis, and saw someone basically borrow a lot from it without citing me, I would be really, really pissed.  \n\nWhat you did is not only totally unethical, but self-sabotagingly unprofessional.",
      "author": "DerProfessor",
      "created": 1627045958,
      "upvotes": 9,
      "replies": {
        "h698470": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h698470/",
          "text": "You're being downvoted but I completely agree with you.\n\nThe fact that OP spent so much time sifting through the paper's original sources, but chose not to cite the very author itself indicates that they already knew what they were doing was wrong. It seems like years later their newfound guilty conscience allowed them to realize the weight of their actions, and now they are desperately seeking reassurance from people online that they haven't done anything wrong. Which won't help at all because deep down, they know they did.",
          "author": "spicytofu8",
          "created": 1627052652,
          "upvotes": 16,
          "replies": {
            "h69lg2w": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69lg2w/",
              "text": "absolutely.",
              "author": "DerProfessor",
              "created": 1627058366,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "h6aok1o": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6aok1o/",
          "text": "Agreed!",
          "author": "TrishaThoon",
          "created": 1627075714,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "h6a8it6": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6a8it6/",
      "text": "I'm with u/boringhistoryfan on this topic.\n\nThere are generally two reasons to cite something in any academic work. The first is if you use  someone else's work directly: you quote it, you rely directly on conclusions they reached to build your own, you directly rely upon an experimental method that comes from a prior study.\n\nThe second is when you are significantly influenced by a prior scholarly work. It doesn't even have to be \"my work is like that prior work in some important ways\", it could be \"I disliked this work so much that I decided to do research against that prior work's conclusions or methods\". If you actually read something closely and thought, \"I really find this approach useful and I'm going to do it myself\", it's important to cite that work as an influence. In STEM work, in fact, you're doing another researcher a favor if you robustly demonstrate the replicability of their research by doing some of the same research they did with different goals or end conclusions in mind. \n\nFailing to do the first is generally going to be regarded as academic dishonesty without much debate--if you directly reproduce or tightly paraphrase the words and ideas of another scholar without attribution, you've made a serious mistake.\n\nFailing to do the second is a grey area, however. For one, scholars sometimes follow a similar research design because that's the only way to do it--e.g., their resemblance is convergent rather than lineal (e.g., they have a similar problem to resolve within the same disciplinary space and they just happen to do the same things). It's actually important to know that when you read two similar studies--if they're convergent rather than one study being influenced by the other, the results are arguably even more robust. (Kind of like Darwin and Wallace hitting on the idea of natural selection independently from one another.) But there's nothing *wrong* with looking at a study and saying, \"I want to do a lot of what that scholar did\". You just have to say so--it's about acknowledging the road you travelled to do your work and highlighting specifically where you think your original contributions to the field are. We put citations in our works for a reason: so that others can read what we read, consult what we consulted. \n\nThat said, it's slightly bad form--not, I think, academic dishonesty--to largely limit yourself to someone else's citations even IF you cite their work, and somewhat worse if you do that without even saying you did. You are trying to show a committee with a master's or doctoral thesis that you know your field well enough that you composed your own range of references in doing research. You can look at everything another researcher relied upon, but you want to show that you looked at other things beyond that too. Generally, scholars do try to do something that is \"value added\", to go beyond a previous study; part of the job of any dissertation or thesis is to clearly underline what that is. You don't have to reinvent the wheel, but if what you've done is primarily to add a new hubcap and deeper treads on the tires, that should be made clear to any reader of any research work.",
      "author": "swarthmoreburke",
      "created": 1627068437,
      "upvotes": 2,
      "replies": {}
    },
    "h698tpt": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h698tpt/",
      "text": "UPDATE:\n\nI have reread the whole thing, and I've come to the conclusion that around 1% of the entire thesis would likely stem from the plagiarism of the other thesis. Its one of the methods i have, where there are some parts i think i might accidentally have plagarized.  \nThey are not worded the same way, but they mean the same thing, I searched it up, and it looks to me that I perhaps made some mosaic plagiarism. And now I'm in the gutter, how do i move on from this?   \n\n\nTalked to my wife, she said i should just let it go and be happy about the degree while i feel like i am a lying cheat. The only issue is, coming clean does not really seem like an option for me, i feel ashamed already now, and once i have to tell my family i would be even more ashamed. Can I move on from this and count it as a \"mistake\", or should i just come clean and see my life fall apart?  \nNo one will never figure it out as it is not public, and i doubt anyone even has a copy (Perhaps the school)",
      "author": "PeterRVir",
      "created": 1627052965,
      "upvotes": 0,
      "replies": {
        "h69onpe": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h69onpe/",
          "text": "wtf dude why are you so dramatic.",
          "author": "yakiguriumai",
          "created": 1627059719,
          "upvotes": 12,
          "replies": {}
        },
        "h6ca1qz": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6ca1qz/",
          "text": "Hi, I stumbled on this and I doubt that you are guilty. I am not an academic but I have OCD and I have struggled for many years with reviewing past potential wrongdoings and worrying myself into oblivion about what harm/ repercussions I may have caused. I would never attempt to diagnose someone else but your thought process sounds an awful lot like mine. And I also tend to come up with/remember new past wrongdoings to worry about when I have a break. I think it might be helpful to talk to a mental health professional (perhaps with some knowledge of OCD?) to help you manage your worrying. I hope you can find some peace about this.",
          "author": "cosmiclatte100",
          "created": 1627108831,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h6aifii": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6aifii/",
      "text": "I feel like I need more information to tell you my opinion, such as what results you’re looking for or what type of population you’re recruiting and how similar they are to this other source.\n\nHowever, I will say that for most studies in my field looking at my dissertation interest, I usually see the same two research models used and the same data analysis used. What tends to change is participant population, a certain control variable, etc.\n\nKeep in mind, you’re research is SUPPOSED to be built off of the research of others. The future research section of papers is literally a roadmap for others to use. If the other person says that a change in population age might be in order, then that technically opens the door for others to try the same test with a different aged population.",
      "author": "pinky_monroe",
      "created": 1627072881,
      "upvotes": 1,
      "replies": {}
    },
    "h6b2czs": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6b2czs/",
      "text": "Since you went to the source material, you are good to go. You read it all on your own and came to your own conclusions. Plagiarism is not what you described. Plagiarism would be if you took their conclusions or words and passed them off as your own. You didn't need to cite them because you weren't taking anything from their papers that was theirs, however you did cite what you needed to. You are fine!",
      "author": "Robo0000222",
      "created": 1627082515,
      "upvotes": 1,
      "replies": {}
    },
    "h6b7kj0": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6b7kj0/",
      "text": "You should have cited it, but also just move on. Just don't do it again.",
      "author": "colddarkstar",
      "created": 1627085261,
      "upvotes": 1,
      "replies": {}
    },
    "h6bfec7": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6bfec7/",
      "text": "Ur have a conscience so ur not s-----. But I think telling students 2 read others' work is bad advice. Can't u cite the others' work.",
      "author": "MarisaWalker",
      "created": 1627089454,
      "upvotes": 1,
      "replies": {}
    },
    "h6cogbm": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h6cogbm/",
      "text": "I suggest you talk it over with a friend who was not with you in university. Decide what to do as at the moment you are the worse, should I shouldn't I . If you decide to find out if you were very wrong, find someone here or Facebook who is a senior lecturer and ask them. If they say it is ok then talk to your lecturer.",
      "author": "Eternal_Hippy",
      "created": 1627122187,
      "upvotes": 1,
      "replies": {}
    },
    "h7pf1yj": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h7pf1yj/",
      "text": "If you find sources in someone else's paper, read and cite those, but don't use anything from the paper itself, then you don't need to cite their paper, right? ...right?",
      "author": "utakirorikatu",
      "created": 1628100523,
      "upvotes": 1,
      "replies": {}
    },
    "h68mkb1": {
      "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68mkb1/",
      "text": "Yes and its ok… the system is designed to cheat",
      "author": "Puzzleheaded_Sell870",
      "created": 1627041778,
      "upvotes": -33,
      "replies": {
        "h68qer9": {
          "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68qer9/",
          "text": "At no point did they misrepresent others ideas as their own or fail to credit the person who originally created the idea. The Master's thesis maybe should have got a reference in the intro talking about similar studies but that is it.",
          "author": "entropyStable",
          "created": 1627044144,
          "upvotes": 8,
          "replies": {
            "h68s7jt": {
              "link": "/r/AskAcademia/comments/oq0xur/did_i_cheat_in_my_masters_thesis/h68s7jt/",
              "text": "Ok my bad jeez i was jk",
              "author": "Puzzleheaded_Sell870",
              "created": 1627045152,
              "upvotes": -13,
              "replies": {}
            }
          }
        }
      }
    }
  }
}