{
  "sid": "qn8shk",
  "link": "/r/AskAcademia/comments/qn8shk/wherehow_can_i_learn_how_to_properly_write_the/",
  "title:": "Where/How can I learn how to properly write the 'methodology' section of a humanities PhD proposal?",
  "text": "Hi, so I'm a masters student studying musicology and currently writing a phd proposal for a music history phd (which would have more emphasis on the 'history' side than the 'music' side), but I'm really stuck on writing the methodology section. I've had feedback from various professors (and I'm pretty happy with the rest of the proposal) but even when directly asking how I should write this section, I've had little helpful feedback. I've had a few methodological phrases chucked at me (like qualitative analysis, textual analysis, paleography) but given that I only started my masters 2 months ago, I've had no experience using these terms or methodologies and I'm really stuck on how to write this section. I've looked at many different university's guidelines on writing PhD proposals and they all just vaguely state that you need to include your methodology, without explaining how to write the section, especially if you're unclear on what methodology you need to be using.\n\nI'm not necessarily asking for someone to explain to me how I'm supposed to write it (though that would be fantastic) but if anyone can point me towards a place that can help explain this, I would be incredibly grateful.\n\nThanks very much!",
  "author": "nunkyfun",
  "created": 1636110630,
  "updated": 1636136892,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.86,
  "comments": {
    "hjeoec7": {
      "link": "/r/AskAcademia/comments/qn8shk/wherehow_can_i_learn_how_to_properly_write_the/hjeoec7/",
      "text": "A methodology is just a literature review of methods. Break down various other methods researchers are using to look at your topic (broadly and narrowly) and discuss their strengths and weaknesses and then use that to defend why you're using what method you're using.",
      "author": "bluethirdworld",
      "created": 1636115697,
      "upvotes": 11,
      "replies": {}
    },
    "hjezes6": {
      "link": "/r/AskAcademia/comments/qn8shk/wherehow_can_i_learn_how_to_properly_write_the/hjezes6/",
      "text": "I'm a music theory PhD (and VAP at a liberal arts college):\n\n2 pieces of advice:\n\n1-Get prospectuses from other students in the department to model yours after. Preferably from students with your particular advisor. What faculty members want from a methodology (and a prospectus more broadly) can vary significantly. \n\n2-Start writing now and produce a document as quickly as possible. Get it to your advisor for feedback. And then re-write it. It's much easier to get concrete guidance that way.\n\nIf you were writing for me, I'd want almost no literature review in the methodology and an instead an explication of your own course of action (alongside a proof a concept which is where you'd engage a secondary literature).",
      "author": "FarKaleidoscope9",
      "created": 1636120960,
      "upvotes": 5,
      "replies": {}
    },
    "hjexno1": {
      "link": "/r/AskAcademia/comments/qn8shk/wherehow_can_i_learn_how_to_properly_write_the/hjexno1/",
      "text": "Also the methodology section gets easier to write when you have a deep understanding of what you're doing and why. I highly recommend taking classes on this!",
      "author": "nemicolopterus",
      "created": 1636120179,
      "upvotes": 4,
      "replies": {}
    },
    "hjfblt2": {
      "link": "/r/AskAcademia/comments/qn8shk/wherehow_can_i_learn_how_to_properly_write_the/hjfblt2/",
      "text": "I agree with others that you should ask to look at other proposals from your department. In mine, the methodology section was very short, typically a paragraph, and did just consist of the kind of phrases you mention weaved into a paragraph. What kind of questions are you asking and what are the techniques you'll use to answer them? Initially, I had no citations in that paragraph, but one of my committee members wanted me to add a single reference, along the lines of: \"My question is ultimately of type *X*, where I mean what (*A*&*B,* 2012) mean by *X*.\"\n\nIn my program (might be totally different for you), we also had to include what languages we'd be reading in that section. I guess \"read stuff in German\" is a method!",
      "author": "CruxAveSpesUnica",
      "created": 1636125888,
      "upvotes": 3,
      "replies": {}
    },
    "hjft6t0": {
      "link": "/r/AskAcademia/comments/qn8shk/wherehow_can_i_learn_how_to_properly_write_the/hjft6t0/",
      "text": "Adding to all the great points and suggestions:\n\nThere are tons of literature on methodology that you can peruse and that will help. I've read some stuff on different ethnographical methods and close reading during my Bachelor's and Master's. Check your uni library. Some of them are structured in a very informative textbook-esque manner and you can even potentially cite them in your text to add some citation-flavor.",
      "author": "Vkmies",
      "created": 1636132670,
      "upvotes": 1,
      "replies": {}
    },
    "hjf7r3r": {
      "link": "/r/AskAcademia/comments/qn8shk/wherehow_can_i_learn_how_to_properly_write_the/hjf7r3r/",
      "text": "Lmao you’re in the wrong place buddy",
      "author": "grandpassacaglia",
      "created": 1636124361,
      "upvotes": -8,
      "replies": {}
    }
  }
}