{
  "sid": "jrxatp",
  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/",
  "title:": "Female Grad Student in Engineering having Challenges working with Men",
  "text": " \n\nI’m noticing this pattern where I get sidelined by men who take over something I was working on, or male colleagues opening talking down to me in front of our superiors, or even the male students that I TA blaming their mistakes on me and I am getting extremely frustrated. Even with the men in my cohort that I consider my friends, I have moments where I am talked down to, talked over, or my input is not taken as seriously. These moments like often derail me for the rest of the day, and reinforce all the icky imposter syndrome feelings I have going on. I tried to google but all I got was icky misoginistic “lean in” type rhetoric that just tells me to have less feelings and be one of the boys. Do you have any advice? Or any good reading material that you have found on this topic?",
  "author": "1okshow",
  "created": 1605054207,
  "updated": 1634080118,
  "over_18": false,
  "upvotes": 360,
  "upvote_ratio": 0.9,
  "comments": {
    "gbw1mfu": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw1mfu/",
      "text": "> Do you have any advice?\n\nFor my postdoc I joined a group that was half women. Made a world of difference. As a PI, I am trying to create the same environment.\n\nI realize this advice doesn't work in the short term but it's something to think about when applying for future positions. I'm sorry this is happening to you and it sucks.",
      "author": "harper_kentucky",
      "created": 1605057281,
      "upvotes": 210,
      "replies": {
        "gby5f3j": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gby5f3j/",
          "text": "I recently switched advisors in my physics PhD program and I went from a group where I was the only woman and my advisor had never graduated a female student in 40 years of working, to one where there were two other women working in the lab and the advisor had graduated many female students in the past. The environment is SO much better in the new lab even though there's still a majority of men. Finding an advisor that cultivates a supportive lab culture for women is so important.",
          "author": "geosynchronousorbit",
          "created": 1605112591,
          "upvotes": 19,
          "replies": {}
        },
        "gbwmnoh": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwmnoh/",
          "text": "dude that is the plan",
          "author": "1okshow",
          "created": 1605069513,
          "upvotes": 64,
          "replies": {}
        },
        "gbwxtvq": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwxtvq/",
          "text": "Sometimes even groups of half women aren't enough. 60-40 women to men tends to balance out well since even outnumbered men often over do it",
          "author": "fedawi",
          "created": 1605078430,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gbw9pcz": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw9pcz/",
      "text": "Here are some things you can do:\n\n1. Understand that they are part of a larger culture and it is so normal to them, they often don't even realise they are doing it. So, if you want to do something about it you have decide whether you want to draw their attention to it and when and how. Or you have to suck it up. You may make this choice from incident to incident - you don't have to choose one path always. \n2. Understand you work in an environment where most people are socially and emotionally immature or even have disabilities in that area. They get away with it because they deliver something of value and they have privledge. So, factor in that not only are they unaware, when they become aware they may not care or understand what you are talking about. \n3. Find allies. There are people who likely don't treat you that way. Gravitate toward them as much as possible. \n4. Find mentors. There are leaders who are encouraging and supportive. They might not even be in your discipline. Find them and utilise their support. \n5. Go to HR/Guild/Student Council. Join groups that further women's issues or women in STEM. Go through appropriate channels to recommend that training on conscious and unconscious bias is part of the routine where you are. \n6. When you have a situation where you are sidelined and you want to speak up do it respectfully (note Kamala Harris in one of the VP's debates. Mike Pence didn't even realise he was cutting her off as he is so used to it, but she held her ground) but firmly. \n7. Don't wait for anything to be handed to you.\n8. Don't all them into your personal life or do anything that is not 100 percent professional.\n9. Ensure if someone is taking credit for your work you immediately remedy the situation with evidence of your contribution and then query with the individual why they would say it was their work? (This is theft in academia and should be taken very seriously)\n10. Write down every incident you experience and then put it in a drawer. It creates a record in case you want to go formal with someone for repeated behaviour but you can also show it to someone else to determine if you are being too sensitive. \n11. Understand that women do this to other women as well - personally and professionally. it is a human condition that when you have privilege to want to hang on to it.There is no nirvana where everyone gets what they deserve. Determine what you need to do to succeed (network, self-champion, etc) in your field and do it. It is really up to you to be resilient and positive.",
      "author": "ourldyofnoassumption",
      "created": 1605061759,
      "upvotes": 30,
      "replies": {
        "gbwfg74": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwfg74/",
          "text": "there's some good stuff in here, thanks I appreciate it.",
          "author": "1okshow",
          "created": 1605065055,
          "upvotes": 9,
          "replies": {}
        },
        "gby7d0z": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gby7d0z/",
          "text": ">note Kamala Harris in one of the VP's debates. Mike Pence didn't even realise he was cutting her off as he is so used to it, but she held her ground\n\nI will also note, this can be a difference in just how conversation flows in a given culture, not just a misogyny thing. I won't speak to Mike Pence, but I know that I personally do that a lot, because that's the normal flow of conversation where I'm from -- moving to the Midwest was a bit of a shock, and I had to (attempt to) adjust how I converse because otherwise the other participants in the conversation (not just women, I've been called out by guys for this) would never be able to get a word in edgewise.",
          "author": "TrekkiMonstr",
          "created": 1605113549,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gbvy34y": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbvy34y/",
      "text": "Not in the exact same situation, but I feel you. Men consciously or subconsciously do still treat women as inferior in STEM. It sucks.",
      "author": "flyingoverunder",
      "created": 1605055304,
      "upvotes": 180,
      "replies": {
        "gbw7c1t": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw7c1t/",
          "text": "It's actively reinforced. Bay area startup culture is moving toward being really fratty.",
          "author": "greengiant1298",
          "created": 1605060433,
          "upvotes": 70,
          "replies": {
            "gbxlotq": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxlotq/",
              "text": "Toward? I think it’s always been that way. The misogyny of that tv show “Silicon Valley”, as disgusting as it is, is probably a truthful reflection of the culture.",
              "author": "level1807",
              "created": 1605101669,
              "upvotes": 27,
              "replies": {
                "gby182b": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gby182b/",
                  "text": "I think that is part of the point of the show - to highlight the good and the bad aspects of Silicon Valley, perhaps in a slightly exaggerated way. I wouldn't say that the show itself is mysoginistic.",
                  "author": "caakmaster",
                  "created": 1605110480,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbwcz0t": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwcz0t/",
          "text": "What I have noticed is that some - certainly not all - of the men who do this women, also do it to other men. Assholes are going to asshole, regardless of gender. Not excusing or justifying any of the behavior, just jumping on the bandwagon to point out that everyone needs to work together when you run into someone like this, to shut them down. Even if it's not you today, it may be you tomorrow that finds yourself dealing with someone like this.",
          "author": "McFlyParadox",
          "created": 1605063613,
          "upvotes": 34,
          "replies": {
            "gbxxl4z": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxxl4z/",
              "text": "> What I have noticed is that some - certainly not all - of the men who do this women, also do it to other men. Assholes are going to asshole, regardless of gender.\n\nIt sounds like you might already be aware of this, but there is substantial evidence that men do this to women more than they do to other men. You're right that it's bad behavior either way, but it does have a disproportionate effect on women due to this imbalance.",
              "author": "phsics",
              "created": 1605108607,
              "upvotes": 30,
              "replies": {
                "gby2mk7": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gby2mk7/",
                  "text": "Yup. I have done it effective though to get some 'fencer sitters' on board by making it a 'both sides' issue. \"A rising tide raises all boats\", so to speak.\n\nUnfortunately, some men simply never will care about women. They're just too set in their ways. But if you make it \"care about men. Oh, and women too\", you can have some greater success in getting them on board. It kind of just makes the best of a shitty situation.",
                  "author": "McFlyParadox",
                  "created": 1605111188,
                  "upvotes": 8,
                  "replies": {}
                },
                "gbyf5e6": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbyf5e6/",
                  "text": "Evidence aside*, I really like the strategy he recommended. \n\nIt's somehow analogous to the \"solve the problem before asking whose fault it is\" mentality: was this guy talking over that woman because he's rude or because he's misogynistic? You'll get a much better response by telling a guy he was rude in one instance (often perceived as an error) than misogynistic (often perceived as a character flaw).\n\n*Evidence aside is meant half as a joke, and half to suggest that a statistical average isn't a good starting point for a problem solving conversation.",
                  "author": "pressed",
                  "created": 1605117361,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gbxrz9q": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxrz9q/",
              "text": "Well, bullies bully the vulnerable. So they may be selective in who they treat badly.",
              "author": "DavidDPerlmutter",
              "created": 1605105563,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "gbwtg0w": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwtg0w/",
          "text": "I have noticed this behaviour in the student team I used to work in. There were two girls out of 35 students and they usually were treated different, like weak or incapable of working in the workshop. The problem was, none of guys stood up to support them (I'm guilty of this too, but now I realize how toxic the environment was in the team). This continued and one of the girls had to quit, but the other wasn't aware that the problems she faced was due to toxic masculinity. After months, now I feel ashamed to not be open about this. But if I had, I would have got no support and would've been called a simp and probably treated inferior too. This is the main reason why no one ever even talks about it.",
          "author": "garlic_bread_thief",
          "created": 1605074563,
          "upvotes": 15,
          "replies": {}
        },
        "gbxcry5": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxcry5/",
          "text": "Sorry to hear your experience but that's not been my experience at all in the 14 years I've been either studying STEM or working on STEM.",
          "author": "monster_peanut",
          "created": 1605094228,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gbw5ngv": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw5ngv/",
      "text": "Find a woman mentor. I am a female professor (geology) who used to work in a Civil Engineering department.  There were 2 other women faculty,  and the rest were men. I spent a lot of time trying to increase the number of women in our program. The key to survival is to find other women in your program (ideally professors,  or more advanced grad students) and connect with them. They don't necessarily need to be doing what you do, and I'm not suggesting you should switch advisors (based on what you wrote so far), but you need to find a safe space to commiserate, give guidance for actions you can take, etc., etc. \n\nAnd to all the men in STEM reading this, you also need to be active in the fight for equality in STEM!  If you see a male colleague/fellow student talking over a female, or taking over a project, or making an off-color joke, speak up! The \"boys club\" mentality will never change unless the \"boys\" are also fighting for the change!\n\nHang in there, OP, you are not an impostor!",
      "author": "jsliko",
      "created": 1605059499,
      "upvotes": 70,
      "replies": {
        "gbw98tk": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw98tk/",
          "text": "Just want to +1 this. My wife (academic field but not faculty) saw a world of difference mentally and professionally once she got plugged into groups with other women. I don't want to say mentorships just suddenly \"happened\" after that, but she simultaneously found senior people she could go to and became that same person for junior people and students.",
          "author": "dcgrey",
          "created": 1605061500,
          "upvotes": 18,
          "replies": {}
        },
        "gbw8eq4": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw8eq4/",
          "text": "Thanks! this is good advice to the boys and good advice on the mentor front. working on it immediately.",
          "author": "1okshow",
          "created": 1605061034,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gbvy4df": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbvy4df/",
      "text": "I can only speak from my experience, but I frequently get talked down/over in my lab group as well. It is hard to ignore, but after 4 years I realized it is a lot easier just to learn to not worry about it, plus realistically what can you do? I think my advice for not taking it personally is trying not to stew, when I sit and think about what happened for hours at a time it just makes me feel awful, but if I actively just move on right after it happens and try not to stew it seems to help me not feel so belittled.\n\nIt may be worth noting anecdotally that lots of people in academia are condescending as fuck; I think a common theme is people thinking they are always the smartest person in the room and implicit biases don't help this. I am a male in an all male group with a female advisor, so there aren't really the same misogyny vibes of your lab, but I find it easier just to not worry about it myself versus trying to talk to/change people who are just going to be assholes by default.\n\nJust my two cents.",
      "author": "robedude",
      "created": 1605055324,
      "upvotes": 49,
      "replies": {
        "gbvz3w9": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbvz3w9/",
          "text": "Yes I totally agree that some of it is the general atmosphere of academia, and is on me to sort out my own internal dialogue rather than stewing all day.   \n\n\nOn the other hand, the project I was basically leading and then sidelined on reflects poorly on me. I fear that my advisor sees that and might think that I just didn't contribute rather than the reality which was I was not invited to the table.",
          "author": "1okshow",
          "created": 1605055875,
          "upvotes": 31,
          "replies": {
            "gbw0ore": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw0ore/",
              "text": "Please tell your advisor what happened",
              "author": "johnnydaggers",
              "created": 1605056762,
              "upvotes": 34,
              "replies": {
                "gbw3k72": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw3k72/",
                  "text": "Please do tell your advisor.  PIs should take this kind of thing seriously, and if they don't, that's a useful thing to know.  Them taking it seriously could still be them finding fault with the way you handled it (and that can be a successful outcome of that meeting), but they should still be watching for this sort of thing and listen carefully as you describe.  When I worked in this role, I would needle my staff to debate anyone in the group as long as it was technical, especially if it was me.  Training students/staff to excel with (or in spite of) bad colleagues is one of the most rewarding aspects of managing a team, and if we don't already know someone is being a poor colleague, we should.",
                  "author": "gainmargin",
                  "created": 1605058340,
                  "upvotes": 24,
                  "replies": {
                    "gbwl3k5": {
                      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwl3k5/",
                      "text": "Agreed I am going to tell my advisor.",
                      "author": "1okshow",
                      "created": 1605068493,
                      "upvotes": 9,
                      "replies": {
                        "gbwsbwb": {
                          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwsbwb/",
                          "text": "Also, this is an admin issue too--like sexism across the department, so try to find other departments or some sort of ombudsman or something as well.\n\nMeanwhile, there are ways to do things like calling out interruptions, credit etc. explicitly which you obviously sensed/have been doing/posted here for. So in case seeing some description of it in someone else's words isn't redundant and actually helpful here's what I might try for:\n\n I'm not the most versed/practiced in that kind of boundary assertion/quit the BS at this point but as much as it sucks, being able to retort about how toxic their inability to listen,lead in service to team members, and genuinely collaborate is is still the way to go--or just know that it doesn't fly in some workplaces where good communication and social skills tend to be more important than  \nSolely being a brilliant problem solver.\n\nEdit: in case you haven't seen this before (neither have I till tonight), a former US female secret service agent covers topics on presence, confidence, and how to assert even when folks try talking over you, I'm guessing it may be relevant on a direct note.\n\nhttps://m.youtube.com/watch?v=FmMTb2lF7jM\n\n\nAlso, try cross posting part of your situation to r/askhr to see how other folks in the field navigate from an academic institutional, professional organizational, and self-advocacy point of views. \n\nFrom an organizational/student point of view (inspired by the woman Geology/former civil engineer's mentorship post elsewhere in the comments), also look at organizing advocacy with other women+diversity in STEM/STEAM orgs + any unions that may be at the University, or even professional societies.\n\nLike literally find folks who are willing to coordinate hosting a handful of events with you in a way that holds the University's claims to diversity, equity, inclusion, etc. to the fire. Maybe even collaborate with marketing/PR student orgs to get it promoted to the media as well. Invite the Deans and vice chancellor plus chancellor and other department heads. Convene to get some kind of timeline-bound commitments, and if they don't make the agreed upon changes by the next half year or so, take the coals and put it on blast with the media again in a follow-up event or strike or something.\n\nI don't know what flavor of engineering you do but the Engineering Society of Detroit has a huge list of national and international professional societies and associations etc. In their affiliate council directory. Check their website to see what stands out in addition to obvious women's professional societies too.\n\nGood luck--the world needs way more people like you and fewer ignorant and arrogant engineers who try to float a misplaced sense of superiority based on their perceived technical prowess.",
                          "author": "messyredemptions",
                          "created": 1605073665,
                          "upvotes": 9,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gbw19pi": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw19pi/",
                  "text": "I agree! I think that if you advisor would be understanding of the situation that would definitely be a good person to talk to.",
                  "author": "robedude",
                  "created": 1605057086,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gbxkuae": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxkuae/",
              "text": "My suggestion as a male PhD student about to finish is: pick your battles. The entire experience you describe sucks, but realistically, you can’t spend all of your time “fighting the system”, otherwise when will you do your research which will eventually let you be in a position of authority to do things differently?\n\nSo, if your cohort is being condescending to you in a lunch conversation, ignore them. If they are trying to bulldoze you and take over your project (as you mention happened), I would say that’s the time to make a stand and push back. To this effect, I suggest always keeping evidence of your work, meetings, and communications, such that you have the tools to make it right.",
              "author": "Dash83",
              "created": 1605101085,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "gbvxarb": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbvxarb/",
      "text": "As long as you keep evidence of the way you practice and work there should always be evidence to back you up and let them know that they can't blame their mistakes on you. On the other hand regarding the comments and treatment you can try to escalate things: correct them either in the spot or privately as it fits the situation, make a stand of your view and why x behaviour is offensive, take things up with a superior if things go out of control, and take note of the policies of where you are at so you can be protected. You can check r/twoxchromosomes and post in there to, is quite a supportive community and I have seen posts alike where other women offer their insights and experience.",
      "author": "See-My-Eyes",
      "created": 1605054862,
      "upvotes": 12,
      "replies": {
        "gbvyw5u": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbvyw5u/",
          "text": "Cool thanks I'll check it out!",
          "author": "1okshow",
          "created": 1605055755,
          "upvotes": 5,
          "replies": {
            "gbxnf6s": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxnf6s/",
              "text": "Some smaller communities I'd recommend that are relevant to academia or engineering are /r/LadiesofScience and /r/xxstem",
              "author": "LeopoldTheLlama",
              "created": 1605102800,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gbw445b": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw445b/",
      "text": "Welcome to the boys club called Engineering. Firstly congratulations on being here, we need women in engineering and there is an epic lack of female perspective in the area.  I can understand that you are finding the environment challenging and hostile, and a lot of your male colleagues find your presence unusual from the status quo, however, this is not something that should stop you. \n\nYou must take control and stand by your work. You have to stand up for yourself. If your little shits of students are blaming their mistakes on you, plainly point out their mistakes to them, don't be shy about it. Try to explain their mistakes to them FIRST and If they behave in a way that it is your fault, let them know you won't be afraid to penalize their sloppy work or escalate the matter accordingly. You are not their MOM. \n\nIn the lab where you work, you need to make sure that you establish boundaries on what your projects belong to you with your advisor and other folks at the lab. As a male student who is doing a Ph.D. in engineering, I  often found my senior colleagues at the lab try to take over my work in the final days in the name of \"collaboration\" etc.  Whenever this happened to me, I made sure to have a joint meeting with the entire team to establish the work and contributions they would be making, and when you do this these people fuck right off. They are freeloaders trying to get authorship.  it is important to establish the authorship and contributions in your projects early on. \n\nAssert yourself, don't be intimidated. You belong in the field don't let the biased field make you feel otherwise. Definitely make friends in and outside your department, be part of IEEE Women or women in Engineering groups, they can advise you much better.",
      "author": "Cowboy_Yankee",
      "created": 1605058647,
      "upvotes": 37,
      "replies": {
        "gbw4zr8": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw4zr8/",
          "text": "Ok do I correct a student for their shitty behaviour in front of the whole class and the professors, or is that something that should be handled behind closed doors?",
          "author": "1okshow",
          "created": 1605059135,
          "upvotes": 14,
          "replies": {
            "gbw7h1r": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw7h1r/",
              "text": "So first and foremost you have to be calm and collected when dealing with a hostile student. If you are not then you will get fired.\n\n1. Do not raise your voice\n2. Do not touch them\n3. Do not use foul or street language\n\n1.If they are misbehaving during class which is causing interruption to your teaching and the rest of the students, politely ask them to leave the classroom. Stop teaching for a moment till the person exits, if they are not leaving you can ask the building security/ department facilities staff to help you, either way, make sure to file an incident report with your department and immediate supervisor.\n\n2. If they are misbehaving when you are having one on one interaction with the student, ask them why they are agitated, if there is something wrong, ask if they would like to speak after class. If they can express the problems to you, maybe you can help maybe you cant you have to proceed accordingly. If they are not engaging with you, let them know that you would want to help them but you will not put up with unprofessional treatment so you will let the supervising professor or department know about the misconduct.\n\nWhatever you do make sure, to always be professional, courteous, and always try to resolve matters before escalating them, so that you can say you tried.",
              "author": "Cowboy_Yankee",
              "created": 1605060509,
              "upvotes": 25,
              "replies": {}
            },
            "gbw7qbe": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw7qbe/",
              "text": "Correct them. Be polite, but everyone in the room is an adult. They can handle it.",
              "author": "ILikeLeptons",
              "created": 1605060653,
              "upvotes": 16,
              "replies": {}
            },
            "gbwd619": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwd619/",
              "text": "If you did that to me and embarrassed me, male or female i would belittle you in front of everyone 10x worse.\n\nDefinitely do not embatass people lest you have it reciprocated.\n\nEngineering, as you know, is about professionalism.\n\nYou will get more bees with honey than vinegar.",
              "author": "cashcow89df",
              "created": 1605063725,
              "upvotes": -21,
              "replies": {}
            }
          }
        },
        "gbx9qm8": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbx9qm8/",
          "text": ">  I often found my senior colleagues at the lab try to take over my work in the final days in the name of \"collaboration\" etc. Whenever this happened to me, I made sure to have a joint meeting with the entire team to establish the work and contributions they would be making, and when you do this these people fuck right off. They are freeloaders trying to get authorship.\n\nSounds like a toxic environment... I blame Publish or Perish mentality in our sector.",
          "author": "advanced-DnD",
          "created": 1605090996,
          "upvotes": 3,
          "replies": {
            "gby2511": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gby2511/",
              "text": "Ya we need to publish or get out of the lab. Our advisor is quite particular about that.",
              "author": "Cowboy_Yankee",
              "created": 1605110946,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gbwc05j": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwc05j/",
          "text": "Engineer here. Some of the best engineers i know are woman, bit stop pandering. What we need is merit and skill. There isn't anything a woman could do better than a man and vice versa. The fact you think wether or not  a penis or vagina will have an influence on quality of code or bridge design is laughable, you pleb.\n\nThe whole \"we need more X in field Y\" is retarded. Why, exactly? Have you advocated for more female garbage collectors, or more male nurses/yoga instructors. The answer is a resounding NO.\n\nYou're encouraging identity politics. We can certainly encourage people of every race, sex and creed to pursue their ambitions, academically or otherwise. To say we 'NEED' it though? Like, we prioritize skin color or sex or gender over merit? \n\nCome off it.\n\nIf two candidates were about to be brain surgeons, do you want the merit based one or the identity politoc one to operate on you?\n\nI rest my case.",
          "author": "cashcow89df",
          "created": 1605063061,
          "upvotes": -28,
          "replies": {
            "gbwhree": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwhree/",
              "text": "Obviously, you are missing the point. The point of diversity in a field like engineering is to get diverse points of view into the design. [Remember when NASA did not have space suits available for women astronauts](https://www.cnbc.com/2019/03/26/nasa-cancels-1st-all-female-spacewalk-due-to-spacesuit-availability.html).  Even something as critical as [vaccines](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4157517/#JIU066C1) are also designed with Males in focus, so there is bias and these can have adverse effects. \n\nI am not saying prefer a woman over a man. But underrepresentation has its issues. For e.g.[facial recognition systems are often biased against people of color and females](http://sitn.hms.harvard.edu/flash/2020/racial-discrimination-in-face-recognition-technology/).\n\nSo of course I don't think I am encouraging identity politics here. Maybe you need to relax a little. \n\nHowever, you failed to address the challenge this person is having with respect to mistreatment in a male-dominated field. You would serve everyone here better if you addressed the issue instead of being a hateful little bitch.",
              "author": "Cowboy_Yankee",
              "created": 1605066412,
              "upvotes": 19,
              "replies": {
                "gbwj29p": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwj29p/",
                  "text": "And yes, obviously I failed to adress the challenge. That's because I was addressing you, not them..... I thought that was evident.",
                  "author": "cashcow89df",
                  "created": 1605067205,
                  "upvotes": -7,
                  "replies": {}
                },
                "gbwi2pd": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwi2pd/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1605066601,
                  "upvotes": -5,
                  "replies": {
                    "gbwld7h": {
                      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwld7h/",
                      "text": "the only one who sounds like an incel is you little buddy",
                      "author": "1okshow",
                      "created": 1605068668,
                      "upvotes": 8,
                      "replies": {
                        "gbwli02": {
                          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwli02/",
                          "text": "See? That's the sort of courage and spark you can't seem to muster in the real world. Once you do, there will be not stopping you",
                          "author": "cashcow89df",
                          "created": 1605068754,
                          "upvotes": -3,
                          "replies": {
                            "gbwlsu5": {
                              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwlsu5/",
                              "text": "So that's your advice to me? I thought you just came here to comment on other people's advice and talk shit",
                              "author": "1okshow",
                              "created": 1605068950,
                              "upvotes": 8,
                              "replies": {
                                "gbwlvwe": {
                                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwlvwe/",
                                  "text": "I'm actually curious, since you're probably the exact worse kind of asshole to deal with, what do you think I ought to do ?",
                                  "author": "1okshow",
                                  "created": 1605069004,
                                  "upvotes": 8,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gbwl2gz": {
                      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwl2gz/",
                      "text": "The fact that you think you think students can't be adults or a male trying to help a female for the sole reason to \"smash\" reflects your closed-mindedness and nothing else.  All in all great job exposing yourself, this is the kind of mentality and hostility that gives engineering the bad rap it has. Incidentally, OP was talking about this kind of attitude and bullshit in her post. Get some help.",
                      "author": "Cowboy_Yankee",
                      "created": 1605068474,
                      "upvotes": 8,
                      "replies": {
                        "gbwldau": {
                          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwldau/",
                          "text": "Thank you stipened T.A. I will take what you have said into consideration.",
                          "author": "cashcow89df",
                          "created": 1605068669,
                          "upvotes": -1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gbwl67n": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwl67n/",
              "text": "Fuck off",
              "author": "1okshow",
              "created": 1605068541,
              "upvotes": 8,
              "replies": {}
            },
            "gbwi6h5": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwi6h5/",
              "text": "So, I understand your point. But I maybe have some things to share for you to consider...\n\nSo I get where you coming from and ultimately advocate for skill and expertise being a big factor obviously.\n\nI will also add that I am a male who is finishing up his clinical psychology PhD (I’m on my clinical internship). I realize that I don’t know shit about other academic areas, only clinical psychology. \n\nThe reason why, at least in clinical and counseling psychology we need a variety of people is because the variety of people that we serve. I will of course stand by the data that states that having shared cultural/background data with a client for psychotherapy is not at all related to efficacy of treatment- this is a fact. However, having a diverse staff at a community mental health clinic (just as an example) makes people of diverse backgrounds comfortable going into counseling. A lot of places where I work have few ethnic minority therapists and, while research would indicate this won’t influence efficacy of therapy per se, it may contribute to a decreased likelihood of ethnic minority clients coming to the office to be seen.  \n\nObviously I realize that your situation is differently than mine (psychology compared to engineering). But I could certainly think of situations in some areas where it might actually be important to have more diverse representation on a team. For example, in biomedical engineering I can think of situations where, as a male, I’d prefer to be meeting with another male (and I’m sure some females feel similarly) to talk about some sort of fake limb or something (I don’t know shit about engineering so bear with me here). Same goes for any education perspective- I would for sure prefer to speak with an engineer prof who is a POC to get their experience of being one of the only non-white people in graduate school if I was a POC applying for a graduate school in said field.\n\nAgain, I do get your point. I think the complete opposite of your view you’re advocating for is when people state that you should hire someone who is a diverse applicant over non-diverse individuals who are more qualified purely because they are a diverse person (an argument I’ve heard). I disagree with this point as well- I would just advocate for their diversity being just one other factor to consider when hiring and not the end-all be-all\n\nEdit: sorry about spelling/grammar errors. My wife always gets after me for being on Reddit when we are hanging out so I gotta be quick.",
              "author": null,
              "created": 1605066665,
              "upvotes": 7,
              "replies": {
                "gbwiwky": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwiwky/",
                  "text": "Congrats on your achievements, sincerely. \n\nYou make a valid point.\n\nI do sincerely think that diversity in the social sciences are significantly more important than diversity in engineering. In engineering, it could be all female or all male, and the equations will still produce the same results.\n\nA girl I had a crush on (now engaged lol) was a biomedical eng. One of the most intelligent people I knew. 100x smarter than myself. Easily. I know her dissertation had no gender application, but it's possible there are some that do.\n\nI'd be dubious of committing an apex fallacy though, taking an extreme case and likening it to the norm.",
                  "author": "cashcow89df",
                  "created": 1605067108,
                  "upvotes": -6,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gbxcq4d": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxcq4d/",
      "text": "You need to stand up for yourself. \n\n\"I wasn't finished yet\"\n\"I'd like to hear your feedback after I've finished my point.\"\n\"You can't blame me for mistakes you made. Perhaps paying more attention next time I'm giving instructions will help. You are always free to ask questions, too.\"\n\"As you are aware, this is a project I'm leading. If you have any ideas, please schedule a meeting or send them via email and we can discuss later.\"\n\"Thank you for your input on my project but since this is my project, you won't be able to take it over.\"",
      "author": "monster_peanut",
      "created": 1605094177,
      "upvotes": 7,
      "replies": {}
    },
    "gbw0oy4": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw0oy4/",
      "text": "As a male researcher, I know I probably do this inadvertently and I would appreciate knowing when I’m doing it so I can train that behavior out of myself. I know it’s not fair to ask this of you, but I think we would all benefit from being told when we’re stepping on our female colleagues.",
      "author": "johnnydaggers",
      "created": 1605056765,
      "upvotes": 19,
      "replies": {
        "gbw5wr1": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw5wr1/",
          "text": "From my own experiences as a grad student and as a professional engineer in a male dominated space, \n\n1.don’t talk over people. Of course it’s just polite and should be extended to everyone, but I notice that men talk over/interrupt me Far more than women do or just hijack the conversation outright and sort of butt me out of further discussion. I know this isn’t malicious 99% of the time, but it’s still difficult to work with since effort on my part to regain control will be seen as “pushy” or “taking myself too seriously.” And of course makes people think I am less competent/don’t have leadership qualities/don’t work well with others and is harmful for performance reviews/LORs. \n\nMy advice to all men (and women): wait until we’re done speaking even if what we’re saying is Ridiculously wrong, wait until we finish to contribute. Not sure where I read this but it’s summed up beautifully “listen to someone speak to understand them, don’t listen just waiting for your chance to talk” (Horribly paraphrased but I hope it makes sense).\n\n2. If someone interrupts us, bring attention back to us and find a way to integrate us into further discussion. One of my male advisors used to do this and it was amazing “Hang on everyone, TheRealAelin isn’t done with her point/has more to share/will address the point you brought up later/take notes on your points and we’ll discuss them all at the end” and “Interesting point RandomPerson made. Aelin, what do You think about this.” Asking our thoughts on a point first if someone interrupts before other people jump in is really powerful as showing you value our ideas and are willing to listen, and giving them back control over the discussion. Also shut down any misogyny/sexism/condescending behaviour as you see it. Not sure what the best approach is for that, but not saying anything in this case is tacit approval and creates that culture. \n\nJust you asking how to change is really wonderful, thank you! Your students are lucky to have you 😊",
          "author": "TheRealAelin",
          "created": 1605059643,
          "upvotes": 27,
          "replies": {
            "gbxqqry": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxqqry/",
              "text": ">1.don’t talk over people. Of course it’s just polite and should be extended to everyone, but I notice that men talk over/interrupt me Far more than women do or just hijack the conversation outright and sort of butt me out of further discussion. I know this isn’t malicious 99% of the time, but it’s still difficult to work with since effort on my part to regain control will be seen as “pushy” or “taking myself too seriously.”\n\nAs a person with (quite mild actually but still) social anxiety I can't help but wonder... How are you expected to talk in a meeting? I see just people talking when they have something to say, so I might end a 2h meeting without having said a single word except for the single time when I was directly asked a question. \n\nHow is this theoretically supposed to work? I just see people \"talking\"",
              "author": "lucaxx85",
              "created": 1605104845,
              "upvotes": 1,
              "replies": {
                "gbyojrq": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbyojrq/",
                  "text": "I have the same problem! And it translated to me apologising every time I opened my mouth to say anything or like you, not saying anything unless directly asked. I personally just try to wait until I think they’ve completed the sentence to interject with my point instead of stopping them midway. And if they’re not done and keep talking after I start or interrupt me, then I’ll just ask them to go ahead with what they want to say and/or explicitly state that I’ll share my thoughts when they’ve finished their point. The latter doesn’t need to be done but I find it’s helpful to make sure you’re heard and that people know you have something to share, especially when you’re in meetings with people who like to hear themselves speak. Again not a communication expert by any standard, but this is what I found works for me. Jury is still out on the effectiveness of it.",
                  "author": "TheRealAelin",
                  "created": 1605122025,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gbw3epf": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw3epf/",
          "text": "[deleted]",
          "author": null,
          "created": 1605058256,
          "upvotes": 7,
          "replies": {
            "gbwcijn": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwcijn/",
              "text": "This is a really pernicious notion about how social relationships work, and seems to assume that undesirable behavior is always carried out intentionally/maliciously. It's not a good attitude to have.\n\nIt is *never* easy to know exactly how one looks from the outside, on anything. That's why we need each other's input to help us steer ourselves.",
              "author": "my_stupidquestions",
              "created": 1605063354,
              "upvotes": 14,
              "replies": {
                "gbwj4ib": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwj4ib/",
                  "text": "Very well said.",
                  "author": null,
                  "created": 1605067243,
                  "upvotes": 4,
                  "replies": {}
                },
                "gbwy86p": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwy86p/",
                  "text": "Then men can tell other men. Listen. Watch facial expressions. Call out poor behavior.",
                  "author": "WDersUnite",
                  "created": 1605078801,
                  "upvotes": 3,
                  "replies": {
                    "gbxwy4p": {
                      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxwy4p/",
                      "text": "It is difficult for others to know when someone is bothered by behavior, also. \n\nIf behavior is egregious, it makes sense for someone else of any \"category\" to say something. \n\nAgain, though, this attitude reflects a poor understanding of social behavior.",
                      "author": "my_stupidquestions",
                      "created": 1605108275,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gbwn134": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwn134/",
      "text": "Check our /r/LadiesofScience",
      "author": "darthmolecule",
      "created": 1605069763,
      "upvotes": 3,
      "replies": {}
    },
    "gbxjdw0": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxjdw0/",
      "text": "My sis used to face this issue when she was an engineering undergrad. This one time in her group, a guy kept using some tool wrong (i think it was some kind of saw, and there is a particular way you use it, idk for sure, i'm not an engineer). She kept telling him that he's doing it wrong, but he wouldn't listen. Dude broke two of those things before another guy came and told him how to use it correctly.\n\nSo yeah, it's a very common situation. People didn't take her seriously, even though she did very well in exams. What my sis did was to be *very* assertive in these situations. A lot of times guys have this bias so ingrained that they don't even do it consciously. They automatically assume that the girl doesn't really know what she's talking about. Sometimes girls speak very softly and timidly, and this doesn't help either. So when my sis told them firmly (and quite bluntly) that that weren't letting her participate, they actually listened and realized what they were doing. Or pretended to. Who cares? My sis got to do her share, and that's enough.\n\nI'm not a girl, and maybe I don't understand your situation completely. But being assertive, and talking loudly when the need arises works wonders. Also, my sis was once told at a group discussion that while all her points were very good, she needs to speak loudly and not let people talk over her all the time. So I think that's a good starting point. Call them out when they talk over you. Don't be timid in these situations. Of course, you don't have to be an aggressive asshole, but speaking in a firm tone usually prevents others from talking over you.",
      "author": null,
      "created": 1605100034,
      "upvotes": 3,
      "replies": {}
    },
    "gbwf9xn": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwf9xn/",
      "text": "I definitely feel you on this. I've had to pick and choose my battles before with this stuff, and it's a tough balance between losing my temper and not saying anything and stewing. In the right situation when I can manage the courage to say something calmly, I've been direct and said things like \"you're interrupting me\". \n\nMy personal favorite is when I say something at a normal volume and everyone ignores me, and the tallest, whitest idiot man in the room heard it and says it like it was his own, and everyone claps like orangutans. I could have an aneurysm when this happens because then I have to call it out and then I'm a \"bitch\". or \"not congenial\".\n\nAhem anyways...are they your friends, or people that you spend time with? I'm guessing you're mistaking them as actual friends when they're just classmates, and that's probably why it hurts so much.\n\nI saw this game recently and played through it, it's a short narrative game about male computer engineering students basically just being creepy assholes to the only woman in the class. You might find it cathartic, I know I did  [http://www.gamergirl.games/game/playtest](http://www.gamergirl.games/game/playtest)",
      "author": "yourmomdotbiz",
      "created": 1605064954,
      "upvotes": 10,
      "replies": {
        "gbwgz6c": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwgz6c/",
          "text": "Yep, this exactly. Stewing versus losing my temper and saying something \"bitchy\" or not-professional. I would say they are between friends and classmates, people that I want to have personal relationships with since we spend a lot of time together. Ya it hurts more when it's \"one of the good ones\", definitely not the first time I have had the experience of someone I was friends with treat me not great in a professional setting.",
          "author": "1okshow",
          "created": 1605065951,
          "upvotes": 3,
          "replies": {}
        },
        "gbz5v80": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbz5v80/",
          "text": "One thing I find very useful when guys interrupt you or don’t let you finish your sentence, just continue speaking. Don’t stop, finish your argument as if nobody had said anything. That will lead to a few awkward seconds where both of you speak at the same time, but the other person will eventually stop and let you finish. In time they learn that they can not talk over you that easily. I am still practicing this, it is quite hard to follow through sometimes, but it is really effective. You don’t even have to speak loudly, just be persistent.",
          "author": "FruityTeam",
          "created": 1605132213,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gbwkohz": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwkohz/",
      "text": "sigh this is why im rly looking for a female PI for grad school. i hope u can find ur group, OP",
      "author": "sdbabygirl97",
      "created": 1605068226,
      "upvotes": 2,
      "replies": {}
    },
    "gbxdi6d": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxdi6d/",
      "text": "The only, very useless thing I can tell you is to get older and get good at what you're doing. Unfortunately, there is little support and you will not change other people's behaviour fast enough for it to make an immediate difference for you. The only thing in your control is to be persistent and get to the place they can't do anything to you (and then you can work on making it better for the next generation). And it's hard and not fair.  \n\n\nWhen I was in my 20s I had problems with male students, professors, colleagues. Harassment, discrimination, not following instruction - on daily bases. 15 years later they don't even try - I have a way better position, unique experience and confidence, so I can shoot down any, even slightest attempt on harassment or belittling targeted towards me or any other woman in my group. The institutional discrimination is still there and I do what I can to hold on despite added hurdles, but at least at direct interpersonal level I can manage.",
      "author": "Why_So_Slow",
      "created": 1605094957,
      "upvotes": 2,
      "replies": {}
    },
    "gbww37z": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbww37z/",
      "text": "Check out the book Men Explain Things To Me. It helps one to realize that this shit happens to every woman who works with a lot of men, and it has nothing to do with you or your intellect/capabilities. It takes some practice but when you get interrupted, it’s important to pick your battles between deferring and letting them speak (and often times, they’ll make themselves look stupid if they’re just interrupting for the sake of interrupting) and continuing to make your point. It’s enormously frustrating. But having to be on your toes defensively means you’re already two steps ahead. Good luck.",
      "author": null,
      "created": 1605076849,
      "upvotes": 4,
      "replies": {}
    },
    "gbwepsi": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwepsi/",
      "text": "I’m graduate school it may not be because you are a woman (though it might be) it might be because grad school brings out some of the worst traits in people in the “I have to show I’m the smartest” which is counterproductive to being a researcher since research is collaborating \n\nThe best advice is to be confident and direct when you are taking about your work and back that up with results \n\nAs for the students, they do that to everyone, male or female",
      "author": "k0np",
      "created": 1605064630,
      "upvotes": 4,
      "replies": {
        "gbwfgxu": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwfgxu/",
          "text": "fair enough",
          "author": "1okshow",
          "created": 1605065067,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gbw0bw0": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw0bw0/",
      "text": "Can you tell us more about how you got sidelined on this project?  Usually it's the advisor's job to make it clear who is in charge of which project.  Don't let people just take things from you...\n\nI think the best thing you could do is to try to find a female professor to discuss your problems with.  Doesn't even need to be in the same department.  Either send them a cold email or show up to their office hours sometime and ask if they wouldn't mind talking to you about a couple of these kinds of things.\n\nI'm a guy so take it with a grain of salt.",
      "author": "dampew",
      "created": 1605056561,
      "upvotes": 3,
      "replies": {
        "gbw41m4": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw41m4/",
          "text": "Ya weirdly there are like no women faculty in my department I have met in my 1.5 years in the department, at least more than peripherally. But ya agreed probably would be useful.",
          "author": "1okshow",
          "created": 1605058608,
          "upvotes": 6,
          "replies": {
            "gbw6qus": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw6qus/",
              "text": "What about the question in the first paragraph though?",
              "author": "ColourlessGreenIdeas",
              "created": 1605060104,
              "upvotes": 5,
              "replies": {
                "gbw9fvc": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw9fvc/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1605061611,
                  "upvotes": 1,
                  "replies": {
                    "gbwah7p": {
                      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwah7p/",
                      "text": "It's not so much someone taking credit for my work, it's more someone taking over what we were at the very least working on together and the very most I was  leading. For them to completely exclude me from the work they have been doing feels not great, and I am sure does not look great from the outside",
                      "author": "1okshow",
                      "created": 1605062196,
                      "upvotes": 2,
                      "replies": {
                        "gbwydbb": {
                          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwydbb/",
                          "text": "Like I said, we'd like to understand how this is possible because usually it's the advisor's job to decide who is in charge of which project.  Does your advisor know that this has been happening or is your lab a free-for-all?",
                          "author": "dampew",
                          "created": 1605078934,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gbw490o": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw490o/",
              "text": "Not surprised, that's why I said not necessarily the same department :)",
              "author": "dampew",
              "created": 1605058723,
              "upvotes": 2,
              "replies": {}
            },
            "gbx9xdx": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbx9xdx/",
              "text": "Would be nice if you can give an example of your experience.",
              "author": "advanced-DnD",
              "created": 1605091202,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gbwpsku": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwpsku/",
      "text": "We’re a dime a dozen. I’m not great at being assertive, so my most successful strategy is to absolutely shut up until they ask. After all, they’re paying me and they need to know what I’ve done. Once everyone quiets down again it’s much easier to participate in the discussion.",
      "author": "EM-spec",
      "created": 1605071717,
      "upvotes": 1,
      "replies": {}
    },
    "gbxrti4": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxrti4/",
      "text": "I bet there is a writing group of women  faculty at your U. Great mutual support resource for progression through lagging culture.\n\nThere are women Engineering societies as well.",
      "author": "DavidDPerlmutter",
      "created": 1605105475,
      "upvotes": 1,
      "replies": {}
    },
    "gbxsmi5": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxsmi5/",
      "text": "I'm a bit late to this thread and others have already given good advice, but as a female grad student in engineering, I've definitely dealt with this too, and might have another insight to share. \n\n* Certainly find out other women through groups: Women in Science and Engineering is a common one. \n* If there are certain situations/groups that consistently leave you feeling like this, try to avoid them or change them to your advantage. For example, when I started grad school, I was on a project team with all older men who were all working full time while I was taking a full course load. Project meetings made me feel terrible about myself and presenting my minor progress. Looking back, I wish I had asked my PI to have fewer group meetings and more individual meetings where my work had context with the rest of my responsibilities and I wasn't being compared to people with much more experience and much more time.\n* On imposter syndrome - the straightforward way to deal with it is logic: almost everyone feels it, obviously you aren't an imposter as you are as smart and capable as everyone else, etc. Recognize that much of the dominating behavior exhibited by men is often due to their own insecurities. \n* Sometimes though, that imposter feeling persists despite all logic. When I'm feeling like that, I lean in to it - not in the typical lean in way of \"just work harder and don't have emotions\" - I like to lean in to the \"imposter\" character and try to feel like I'm a feminist spy infiltrating this patriarchal society. So I'm feeling like an imposter today? OK great, what would a badass Jane Bond-style engineer/scientist do in this situation? It's a bit of fake it til you make it, but try to spin it to your advantage and have fun with it.",
      "author": "mimariposa",
      "created": 1605105931,
      "upvotes": 1,
      "replies": {}
    },
    "gby8guc": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gby8guc/",
      "text": "r/womenEngineers\n\nThe sub is full of such things and advices! Ask away.",
      "author": "_saiya_",
      "created": 1605114082,
      "upvotes": 1,
      "replies": {}
    },
    "gbyi1bz": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbyi1bz/",
      "text": "I'm not sure if it's a difference of the level of academia or my country, or something else, but miraculously I did not notice any (or any obvious) mistreatment of women when I was in college for IT, now mind you in my country 'college' is technically lower than university (it's sort of similar to American community college, except a bit more advanced than that, so between those two) and there were quite a strong ratio of women to men! I felt like the men were lazier when it came to lab work, however.",
      "author": "Hardcore90skid",
      "created": 1605118795,
      "upvotes": 1,
      "replies": {}
    },
    "gbyj24a": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbyj24a/",
      "text": "Good luck.  My partner has been project lead for billion dollar projects and she still gets railroaded and sidelined.  Payed 30% less than her male counterparts and is constantly required to pull overtime at the detriment to our family.\n\n\nThe nature of working for megacorps is not beneficial to anyone but upper management.",
      "author": null,
      "created": 1605119299,
      "upvotes": 1,
      "replies": {}
    },
    "gbyke4x": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbyke4x/",
      "text": "Who has had the resting bitch face comment after dealing with pissing match chauvinists for years?",
      "author": null,
      "created": 1605119965,
      "upvotes": 1,
      "replies": {}
    },
    "gbzhmy0": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbzhmy0/",
      "text": "As a volunteer firefighter, and later as a legal assistant in a mostly male office, I've dealt with some similar behavior from men. What usually works for me is to call out the bad behavior in a tongue-in-cheek way as soon as it happens. For example, if a male colleague were to interrupt me now, I might say \"Mr. Vice-President, I am speaking\" (a la Kamala Harris) and then finish my thought. Using a bit of humor, but still being firm, sends a subtle message that you're playing nice now, but if they persists in their poor behavior, you might just rip them a new one.\n\nAs another example, when a male firefighter would talk down to me, I'd say \"you know we both took the same class, right??\".  He'd usually sheepishly laugh and say sorry. In the majority of cases, in my experience, these guys don't realize what they're doing and are appropriately embarrassed when it's pointed out.",
      "author": "HouseNegative9428",
      "created": 1605138531,
      "upvotes": 1,
      "replies": {}
    },
    "gcb3x28": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gcb3x28/",
      "text": "There's been some excellent advice given here already, but I figured I would chime in my two cents as a woman who's worked in a male-dominated comp sci lab.\n\nOne thing I've found has worked for me has been lowering my voice. I have no idea why this works. But once I drop the timbre of my voice, men don't brush me off, talk over me more than they talk over other men, or ignore me.\n\nAlso don't be afraid to throw in an incredulous, \"Excuse me?\" when someone, especially in your cohort, talks down to you. The delivery is key: you can't be riled up or high pitched. Calm and low-toned makes people go \"Oh wait.\" I once had a professor tell me I was a coquette (I wasn't, he was just a disgusting dude), and when I pulled out the \"excuse me?\" in a calm, flat tone, he immediately started back pedaling.",
      "author": "small_blue_battery",
      "created": 1605399515,
      "upvotes": 1,
      "replies": {}
    },
    "gcg97yp": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gcg97yp/",
      "text": "About being talked over: \n\n1) Stand your ground by interrupting them back and right away. \"Hold on, I'd love to hear from you after I finish my point.\" or \"Can I finish my point real quick? Thanks\"\n\n2) Create allies by fostering a \"no interruption\" culture. Stick up for other people who get interrupted — even if they are other men. \"I think Eric was saying something. Eric do you want to finish your point?\" People won't forget that and when the time comes they WILL do the same for you. \n\n3) Ask others for help. Usually, one or two people are the problem and everyone else is just complacent and oblivious. Ask others in your group for advice or help. If you confide in them and place trust in them they will likely respond. \n\n4) Make an announcement at the beginning of the meeting without naming names. \"I've noticed people are often getting interrupted when they speak, even though it may be unconscious. I think it would be beneficial if we paid more attention to this as a group and made an effort to listen to each other.\"",
      "author": "Significant_Tomato_6",
      "created": 1605491427,
      "upvotes": 1,
      "replies": {}
    },
    "gmiuhuh": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gmiuhuh/",
      "text": "I feel disgusted !! Stand your ground and let them hear that you are having an issue with the way they are treating you. But keep it professional. You don't have to afford that courtesy to the students you TA though (keep it polite), make sure that they know that they are the ones who messed up.\n\nBut also keep an open mind to discussions, don't treat open discussions where someone who has better experience explaining something to you as Mansplaining. Some people get so callous that this kind of thought is all they will have. Don't fall into that line of thought.",
      "author": "doctorlight01",
      "created": 1612740765,
      "upvotes": 1,
      "replies": {}
    },
    "gbw9ixk": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbw9ixk/",
      "text": "Misogyny will be your counterpart. Do not fight this.   \nFirst: Any ‘friend’ who speaks down at you is *not* a friend.   \nSecond: You will *have* to find your voice. I promise that this is *not* easy, but it *is* doable!  You owe it to yourself to stand up for *you*!    \nThird: *Imposter Syndrome* is, essentially *you* saying you aren’t good enough. I **refuse** to believe this!!!  And so should you!!!  (P.S.  You are welcome to discuss with me in dm about this one. It can be debilitating).   \nAt the end of the day, you **must** give yourself permission to stand up and demand compensation and consideration for your contributions. No one is a better advocate than you!!",
      "author": "GrandOpening",
      "created": 1605061660,
      "upvotes": -1,
      "replies": {
        "gbx9zhf": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbx9zhf/",
          "text": ">  First: Any ‘friend’ who speaks down at you is not a friend.\n\nYou clearly have not live in a culture where praises are rare among friends and family.",
          "author": "advanced-DnD",
          "created": 1605091265,
          "upvotes": 3,
          "replies": {
            "gc60xl8": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gc60xl8/",
              "text": "I curate my surroundings. Those who speak down at me are not given residence in my life or mind.",
              "author": "GrandOpening",
              "created": 1605286585,
              "upvotes": 0,
              "replies": {
                "gc693ta": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gc693ta/",
                  "text": "So you would live in self-made bubble.\n\nBecause I have a feeling you have a very light definition of \"speak down at me\", that any slight criticism will ended up in that category and, in your words, will not be given residence in your bubble.\n\nI do not think this is healthy.",
                  "author": "advanced-DnD",
                  "created": 1605290570,
                  "upvotes": 0,
                  "replies": {
                    "gc7xudo": {
                      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gc7xudo/",
                      "text": "I don’t think it’s healthy to make an ass of yourself through assumption....  \nbut here you are",
                      "author": "GrandOpening",
                      "created": 1605323584,
                      "upvotes": 0,
                      "replies": {
                        "gc8uqra": {
                          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gc8uqra/",
                          "text": "Pretty sure you're the the centre of the exhibition. But since you are that self-absorbed already, I guess nothing will be able to penetrate that thick wall of yours.",
                          "author": "advanced-DnD",
                          "created": 1605354231,
                          "upvotes": 1,
                          "replies": {
                            "gckl8s2": {
                              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gckl8s2/",
                              "text": "Boundaries are healthy",
                              "author": "GrandOpening",
                              "created": 1605581556,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gbwlxyy": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwlxyy/",
      "text": "Okay I’m also an engineer with PhD, but why aren’t you calling them out?\nGetting blamed for a misrake, say actually I did not do xyz that was Greg’s responsibility but I will pass along your feedback to him.\nPeople talking over you ? Say excuse me I was speaking.\nCredit stealing say actually I did this xyz things and have it documented in my lab notebook, did you also do xyz ? Can I see your results? Why did you repeat the work?\n\nWould it be better if you had nice colleagues who didn’t do this? Of course. But if students are treating you like a doormat, it sounds like you need better social strategies to stick up for yourself. Whether counseling, therapist, even professional women events have loads of panels of speaking for yourself. DO ITT.",
      "author": "RaddishEater666",
      "created": 1605069041,
      "upvotes": -5,
      "replies": {
        "gbwxdoh": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwxdoh/",
          "text": "These aren’t really general, across-the-board management tactics, as they are dependent upon the other people’s personalities. Escalating can easily work against you in an already judgmental environment. Honestly, if these have worked for you across the board this far, you’re lucky.",
          "author": null,
          "created": 1605078017,
          "upvotes": 4,
          "replies": {
            "gbwyb2l": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwyb2l/",
              "text": "Really cause its not just me. Ive seen it work well for nearly all my friends too. A lot of it is interpersonal skills on how you approach the situation. \n\nThe only friend in who had repeated problems with sexism with the same colleagues refused to ever confront her coworkers. I cant fight her battle for her.\n\nEscalating is tricky i agree and not always the right now. I know well im from the south of US. Especially if you escalate to another sexist, there is no point. Thats why it’s important to have a mentor that can help you.  \n\nAlso so many people underestimate firm polite directness.",
              "author": "RaddishEater666",
              "created": 1605078875,
              "upvotes": -2,
              "replies": {
                "gbwyr00": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwyr00/",
                  "text": "You’re victim blaming. If you think you’ve somehow evaded the sexism, you’re just not seeing it explicitly. Not all sexism is overt...maybe especially in the south, where politeness is used to smooth over a lot. Interpersonal is important but it’s far from the solution.",
                  "author": null,
                  "created": 1605079291,
                  "upvotes": 4,
                  "replies": {
                    "gbwzeeq": {
                      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwzeeq/",
                      "text": "Im not blaming the victim for sexism, thats the mens fault. Im saying in order to stop sexist comments you have to shut them down. If you never say anything or even something the majority of the time, sexist men will keep making sexist comments . \nAlternatively if the op wants to change the mens mind she could try having a debate, perhaps it would work\nAlso being from the south im vastly aware of the non explicit sexism.",
                      "author": "RaddishEater666",
                      "created": 1605079912,
                      "upvotes": -1,
                      "replies": {
                        "gby7b97": {
                          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gby7b97/",
                          "text": "No one was saying that you don’t have to address it. If you think taking the time to have debates with coworkers will change minds, go for it. But for many of us, that’s not a realistic use of energy or time at work. Logical solutions to illogical problems are often futile.",
                          "author": null,
                          "created": 1605113526,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gbwmj5j": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwmj5j/",
          "text": "Sure agreed, there are times that I should call them out. But also not super professional to call out a student in front of the entire class. I am by no means a timid person, I am just super grated by the constant questioning of my intelligence. There's also a super delicate balance of being assertive and being a bitch when you're a woman. Believe me, I will stop someone interrupting me or point out if someone says exactly what I said 5 minutes before. Hey can I ask, what are you doing in the field to hold men accountable for this behavior, since you have so much advice on what I should be doing I am sure you have thought about how to better instruct men on being less shit.",
          "author": "1okshow",
          "created": 1605069429,
          "upvotes": 2,
          "replies": {
            "gbwplt1": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwplt1/",
              "text": "Actually you can nicely point out an students errors in front of whoever.  Thr whoever shouldn’t matter, it just how you do it.\n\nAnd in regards to hold them accountable.  I shut any comments or actions down at first sign and never have a problem with it afterwards for fellow coworkers or students.  Yes there a couple guys who try to keep passing stuff as jokes at first, but they either change fast or I elevate the matter. Hence the second point\n\nProfessors are tricky due to the power imbalance.  I have had the luxury of choosing a professor to work with who isn’t misogynistic.  However most of them aren’t at my grad school program in engineering so it wasn’t difficult.  And having mentors and people in your corner on the professor level male or female is vital.  So if I did have a problem I could talk to them.",
              "author": "RaddishEater666",
              "created": 1605071579,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "gbwetzv": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwetzv/",
      "text": "Would you mind telling me in which country you're studying?\n\nI'm asking because of all the female students I've been friends with and more recently also the few I supervised I've never heard anything about this (labs and master student, she did great work btw).\nDoesn't mean it didn't happen just haven't been exposed to it.\n\nI was in an honours program as an undergrad student where we had student from all different engineering studies at the university with a pretty diverse and mixed group (~ 25 people total, ~10girls), especially when considering STEM and attending a technical university. In that group I didn't see it but also never heard any of my female friends say anything about it.\n\nNote I also don't specifically looked for.\nJust curious to know.",
      "author": "Baronofmyname",
      "created": 1605064698,
      "upvotes": -4,
      "replies": {
        "gbwfl4v": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwfl4v/",
          "text": "US\nAlso you might just not be hearing about this stuff if you aren't asking. I generally don't discuss with male colleagues or my advisors.",
          "author": "1okshow",
          "created": 1605065135,
          "upvotes": 12,
          "replies": {}
        },
        "gbxfdea": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbxfdea/",
          "text": "> In that group I didn't see it but also never heard any of my female friends say anything about it.\n\nThat's probably because they aren't telling you. Sometimes when we bring up experiences of sexism with our male colleagues they can be dismissive, argumentative about every single little aspect of our experience, or agressive about telling us how wrong we are.  Even if only a small minority of people respond like this, it's so exhausting and irritating to have to deal with it that it's often just not worth taking the risk of having this kind of interaction.",
          "author": "polyphonal",
          "created": 1605096742,
          "upvotes": 2,
          "replies": {
            "gh1ocq3": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gh1ocq3/",
              "text": "Yeah but as soon as it's a minority doing it then it wouldn't be systematic anymore. Sure still super frustrating and annoying but at that point it's not a general thing and it shouldn't be generalized.\n\nThey might not have told me but some of them were really straightforward and would **probably** have said something about it at some point when venting. These are/were good friends not simply some colleagues or study mates. It is still very possible they didn't and that this is still an issue (in my field+location) however if people don't mention it or say anything about it WHEN it happens then it becomes that much harder to change and address. I understand it's complicated but people can't help when they don't know there's a problem.\n\nSo I can understand that if someone has already complained about it before that at some point they get sick of saying it or don't care anymore. However if it's really bad and you just let it go then it's unlikely it will change. \n\nI might have also just gotten \"lucky\" to end up in departments and places were it didn't happen (much).\n\nAlso people tend to underestimate how much difference there can be between countries, I've lived in 4 countries (2 continents) and in each 2 years or longer. It takes a long time to really get to know a country and its culture (about 1.5 years from my experience).",
              "author": "Baronofmyname",
              "created": 1608956095,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gbwiqo2": {
      "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwiqo2/",
      "text": "What area of engineering are you in? I’m a physics major in my last year of undergrad (will begin graduate work in MechE next fall) and quite honestly the women in my program are much smarter than I am lmao",
      "author": "JoeyLing",
      "created": 1605067007,
      "upvotes": -6,
      "replies": {
        "gbwkuql": {
          "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwkuql/",
          "text": "not saying I am not smarter than them? Just saying I get treated like shit",
          "author": "1okshow",
          "created": 1605068336,
          "upvotes": 9,
          "replies": {
            "gbwlen8": {
              "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwlen8/",
              "text": "Maybe some of them have a secret crush on you? Back in elementary, I used to ‘bully’ the girls I liked. Think about it. There aren’t many girls in engineering to begin with, so they’re shooting their shot. So to speak.",
              "author": "JoeyLing",
              "created": 1605068693,
              "upvotes": -17,
              "replies": {
                "gbwm1pe": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbwm1pe/",
                  "text": " I don't think that is the problem and even if it was, adult men getting graduate degrees should not be acting that way. At the very best it's childish and at the very worst it's sexual harassment.",
                  "author": "1okshow",
                  "created": 1605069110,
                  "upvotes": 15,
                  "replies": {}
                },
                "gbynu60": {
                  "link": "/r/AskAcademia/comments/jrxatp/female_grad_student_in_engineering_having/gbynu60/",
                  "text": "This is how abuse gets normalized.",
                  "author": "Linewate",
                  "created": 1605121666,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}