{
  "sid": "nf5564",
  "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/",
  "title:": "Have you ever felt that you are falling behind with respect to your researchers colleagues?",
  "text": "Hi, \n\nI would like to share this looking for some advice. \n\nMost of my colleagues have published many more articles than I have and are involved in very high-level research. I have made some contributions with other colleagues, but they could be considered as minor. Also, In my case I have not published in more than a year and I feel that I am getting stuck in my academic career.  \n\nHave you been through the same thing?  \n\nHow have you handled it?\n\nThanks for your feedback.\n\n**Edit: Thanks to all to take your time to answer me. They only that I can do right now is checks where are my weak point and try to correct them.**",
  "author": "mklsls",
  "created": 1621326275,
  "updated": 1634080698,
  "over_18": false,
  "upvotes": 199,
  "upvote_ratio": 0.99,
  "comments": {
    "gyk7qo8": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gyk7qo8/",
      "text": "[deleted]",
      "author": null,
      "created": 1621341058,
      "upvotes": 82,
      "replies": {
        "gymm58x": {
          "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gymm58x/",
          "text": "The award was free so it was the only one I had to give but I do indeed find the honesty to be \"wholesome\" ha. Glad I am not the only one!",
          "author": "ncRNA",
          "created": 1621377950,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gykaajh": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykaajh/",
      "text": "Every career is different. Every project is different. Every lab is different. Some of these things hold you back. You may catch up later. Some of those accomplishments may have been handed to them because of their environment. It’s important not to compare and not to get discouraged. You do the best you can every day and take pride in your work.",
      "author": "drhepburn89",
      "created": 1621342422,
      "upvotes": 68,
      "replies": {
        "gykgkfp": {
          "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykgkfp/",
          "text": "I agree with this comment. Every lab, every project, every team is different. Some labs are very collaborative where everyone is on everyone else's paper, making it easier for everyone to constantly publish. Some labs just aren't like that. I think it's very hard to compare your situation with others. \n\nIf you really feel stuck, ask yourself what exactly is it that you feel \"stuck\" about? The publications? Teaching experience? Number of techniques known? Number of students you mentor? Number of grants written? Number of conferences you have attended? And so on... and then I would try to make plans to resolve those feelings of inadequacy by actively hunting down or creating opportunities (if at all possible) to meet those needs. Find the training, analyze that data, make the graphs, write the paper, volunteer on that committee board, etc.",
          "author": "HamstersWithJetPacks",
          "created": 1621345533,
          "upvotes": 21,
          "replies": {}
        },
        "gymemjp": {
          "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gymemjp/",
          "text": "Also sometimes some of your colleagues are actually just better than you, and that's okay! Not everyone is going to be a superstar or nobel prize winner. That doesn't mean that the work you're doing isn't good or valuable or important.",
          "author": "LeopoldTheLlama",
          "created": 1621374399,
          "upvotes": 10,
          "replies": {
            "gyo47y8": {
              "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gyo47y8/",
              "text": "I think this is so often unspoken but for me, personally, acknowledging that I'm not the most brilliant or best was a weight off my shoulders. I lived in fear that I wasn't good enough for ages until I finally accepted that, yeah, other people are smarter than me. They can grasp and utilize theory better. They publish more, and get more funding. So what? I'm still good enough and I have my own skills. I don't have to pretend to be the best because I'm not and that's ok! Reframing that kicked my imposter syndrome out and made me relax so much more, backwards as it may sound.",
              "author": "Fleur-du-jardin",
              "created": 1621408249,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "gykbptt": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykbptt/",
      "text": "\"Have you been through the same thing?\"\n\n* Absolutely, I suffer this from time to time. It's part of being human. It's a sign of inner struggle with your life. If you had no problems advancing with your research then you would not be caring about the number of publications or the research level of your fellow scientists. You would be busy having fun and making progress.\n\n\"How have you handled it?\"\n\n* When I self-diagnose my inner motivations and review my feelings towards science and engineering then the achievements of my other colleagues stop mattering and I can keep focusing on myself. ",
      "author": "chiesazord",
      "created": 1621343154,
      "upvotes": 29,
      "replies": {}
    },
    "gykn0q2": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykn0q2/",
      "text": "Sometimes I feel this way, especially because I am on mat leave and watching my cohort continue to progress while I'm not. Just remember, someone else's success is not your failure.",
      "author": "naughty_bunny",
      "created": 1621348379,
      "upvotes": 23,
      "replies": {
        "gykst08": {
          "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykst08/",
          "text": ">Just remember, someone else's success is not your failure.\n\nA very healthy attitude to have!",
          "author": "__x0x__",
          "created": 1621350793,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "gykkc6e": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykkc6e/",
      "text": "Yes and the whole \"you are only as good as your network\" quote is very true. I'm a particularly reserved person and I don't network much. But I think that has to change or else I won't find success as an academician. I have friends who have many publications.... I'm handling it by networking and also learning more about the academia path. The good thing is I can always begin to work on myself. I also try to not compare myself to others so much because it can be so dejecting sometimes. I just focus on myself and keep on moving forward.",
      "author": "givemeyourdonut",
      "created": 1621347222,
      "upvotes": 14,
      "replies": {}
    },
    "gykjsly": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykjsly/",
      "text": "The most important thing is to understand that everyone feels this way (p<0.001) and in order to not succumb to the pressures of impossible comparisons, we should all try our damnedest to focus on what we are doing by setting goals and priorities for ourselves and work hard to achieve them. Let's support each other and take time to invest in our mental health, family and friends and celebrate our successes!",
      "author": "Jobediah",
      "created": 1621346979,
      "upvotes": 12,
      "replies": {}
    },
    "gyky2r3": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gyky2r3/",
      "text": "Yes, all the time--especially since I work at a teaching-oriented school, which leaves little time for research during the school year. I'm hoping to get a lot of research done this summer, though, when I won't be teaching. \n\nAlso, I think we have to try our best to not compare ourselves to others, but to instead just make sure we're doing what we need to, be it for tenure or for our next job. Yes, it's easier said than done, but I think it's helpful to remind ourselves of this. :)",
      "author": "Jekiffeleslangues",
      "created": 1621352947,
      "upvotes": 8,
      "replies": {}
    },
    "gykf7tk": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykf7tk/",
      "text": "As an adjunct, I feel this every day. I see colleagues who've gotten post-docs and TT jobs be able to publish steadily, get their names out there, grow their stature. Meanwhile, I'm stuck teaching bottom-rung classes for no money and spending most of my time trying to find a new job. My publications haven't ceased, but they've slowed down significantly, and the idea of being able to get money to go do fieldwork (even if there weren't COVID to think about) seems remote. \n\nIt's utterly crushing.",
      "author": "novht",
      "created": 1621344887,
      "upvotes": 17,
      "replies": {}
    },
    "gymavjg": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gymavjg/",
      "text": "Gunna give the opposite view of most others: no, I don't feel this way currently.\n\nBut I _used_ to, and I am insanely lucky that I don't feel that way anymore.\n\nI have won the dice roll to the point that my primary limiting factors are now just my inherent laziness and just general life stress.\n\nI do not know if this is helpful at all, but, for what it's worth, I _can_ confirm that what you are feeling is not fun.\n\nIt's little consolation, but I did not come from an elite school and my advisor was great but not a superstar. Whatever success I have today is due to a fair degree of luck, but perhaps more so due to being dumb enough to not give up, giving me enough dice rolls to catch a few 20s in a row.",
      "author": "worst",
      "created": 1621372778,
      "upvotes": 5,
      "replies": {}
    },
    "gykvw6z": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykvw6z/",
      "text": "Constantly, especially those without kids and/or those who share kids with others (e.g., kids not in the house for days at a time).",
      "author": "thuja_plicata",
      "created": 1621352056,
      "upvotes": 4,
      "replies": {}
    },
    "gylbxl8": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gylbxl8/",
      "text": "I’m behind. It doesn’t bother me. I happen to be in a discipline where I can have a job and tenure without working myself to death.",
      "author": "ThatProfessor3301",
      "created": 1621358598,
      "upvotes": 4,
      "replies": {}
    },
    "gylimb0": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gylimb0/",
      "text": "I definitely feel a bit behind -- I'm a postdoc at the moment -- but there's also just this dreadful sense that I have no idea where my career is going, where I'll end up, or if there's even any point to keeping going. Some days I feel really encouraged by some of the things I've done and projects I've worked on. Other days, I see people slated for talks at conferences on minor topics when I got rejected, and I start thinking \"How can I ever hope to get ahead when they've got MIT/Columbia/Prestigious Institution at their back and I don't?\" And I've seen other friends who were more talented, who didn't even go the postdoc route like I did.\n\nI think that's what I dislike most about academia, the non-stop uncertainly about careers and where you might end up. I think people imagine it will be like Star Trek or the military or something, and that success simply comes from competence, dedication and hard work, but over time it becomes clear that that's only half the story. This is not meant to disparage colleagues any coworkers, the vast majority of whom I think are quite talented.",
      "author": "DrSpacecasePhD",
      "created": 1621361300,
      "upvotes": 5,
      "replies": {}
    },
    "gylkfkn": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gylkfkn/",
      "text": "Yes, of course! \n\nIt's important to remember that no matter how smart and driven you are, the nature of research is such that there is absolutely no guarantee that what you are doing is significant, will get you a publication, or will contribute to your degree. It's not a reflection of yourself - it's just the game we are all playing. \n\nThere is also incentive for people to present their work as if they had masterminded every great thing they have discovered, even if it was just a set of one-off experiments that ended up with some extremely lucky results. \n\nI've dealt with this sort of stuff by not comparing myself with others, even if they are working on similar stuff within my own lab. It's 10% effort/cleverness and 90% luck that produces the great research - no reason to compare my luck with someone else's.",
      "author": "BoogerFeast69",
      "created": 1621362035,
      "upvotes": 5,
      "replies": {}
    },
    "gyl4y3k": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gyl4y3k/",
      "text": "All the time",
      "author": "awkwardkg",
      "created": 1621355771,
      "upvotes": 3,
      "replies": {}
    },
    "gyl7n7u": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gyl7n7u/",
      "text": "Yes, I submitted my Dissertation paper and honestly I have no idea what I did. I'm all blank,  it's like hard work gone down somewhere .",
      "author": "Elma92",
      "created": 1621356864,
      "upvotes": 3,
      "replies": {}
    },
    "gyn054a": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gyn054a/",
      "text": "I have felt the same way, especially regarding researchers who I see studying topics that are \"sexy\" or trendy in the literature right now. Those people get a lot more interest in their research due to capitalist forces that fund science/ engineering research. It helps to evaluate your own motivations for doing research, and checking if your motivations are coming from a good place, ie: Do you really care about your topic/area? Why? Is it helping people?",
      "author": "notjennyschecter",
      "created": 1621384835,
      "upvotes": 3,
      "replies": {}
    },
    "gyksmw6": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gyksmw6/",
      "text": "Honestly, I don't care anymore, although I am arguably a \"high level\" guy. I just do my thing, and so long as I have funding (minor issue /s) I don't care. Already did the tenure/promotion to full thing, now I'm just a soft funded research scientist, having (mostly) fun just sciencing (without the teaching and committee meetings haha).",
      "author": "__x0x__",
      "created": 1621350723,
      "upvotes": 2,
      "replies": {}
    },
    "gymgng9": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gymgng9/",
      "text": "Every damn day!",
      "author": "apl2291",
      "created": 1621375326,
      "upvotes": 2,
      "replies": {}
    },
    "gykym1g": {
      "link": "/r/AskAcademia/comments/nf5564/have_you_ever_felt_that_you_are_falling_behind/gykym1g/",
      "text": "\"falling behind in respect\"? yea i respect them less and less with every passing day",
      "author": "A_Brown_Crayon",
      "created": 1621353164,
      "upvotes": 2,
      "replies": {}
    }
  }
}