{
  "sid": "jpcfrn",
  "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/",
  "title:": "Does anyone else get really sleepy about 20 minutes into any Zoom call?",
  "text": "I find it's impossible for me to stay alert during colloquiums or presentations, and sometimes even for more dynamic conversations where I'm actually participating, for more than about 20 minutes into a video call. I feel like my brain gets exhausted very quickly by the low-quality, compressed audio/video. I'll have a coffee during these events and that still doesn't help. Has anyone else suffered from this, and do you have any tricks for remaining alert?",
  "author": "TheJadedEmperor",
  "created": 1604693486,
  "updated": 1634080086,
  "over_18": false,
  "upvotes": 436,
  "upvote_ratio": 0.99,
  "comments": {
    "gbeccvx": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbeccvx/",
      "text": "Not all calls, but many. You’re not alone.",
      "author": "mmenzel",
      "created": 1604704095,
      "upvotes": 75,
      "replies": {}
    },
    "gbeqzmv": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbeqzmv/",
      "text": "Yes.I’m the professor so it’s a problem.",
      "author": "ThatProfessor3301",
      "created": 1604712261,
      "upvotes": 54,
      "replies": {}
    },
    "gbeg586": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbeg586/",
      "text": "Not sleepy, but I get a resting bitch face in zoom calls and its extra awkward because I haven't met most of my new colleagues yet. If the university building ever reopens, I want to visit every office and go like \"see, I am nice in person!\"",
      "author": "sollinatri",
      "created": 1604706145,
      "upvotes": 41,
      "replies": {}
    },
    "gbe7usj": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbe7usj/",
      "text": "I try to stretch different muscles 10 min. before the zoom call begins to get the blood flowing around before I sit down & focus.",
      "author": "i_saw_a_tiger",
      "created": 1604701750,
      "upvotes": 78,
      "replies": {
        "gbensz8": {
          "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbensz8/",
          "text": "That is a great idea!",
          "author": "BananasonThebrain",
          "created": 1604710425,
          "upvotes": 5,
          "replies": {}
        },
        "gbfp0u2": {
          "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbfp0u2/",
          "text": "Started doing this too. Push-ups or body weight squats.",
          "author": "sinngularity",
          "created": 1604736375,
          "upvotes": 3,
          "replies": {}
        },
        "gbeykou": {
          "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbeykou/",
          "text": "Once I'm sitting down and on the call, usually do some kegel exercises at intervals throughout the call.",
          "author": "SeNoR_LoCo_PoCo",
          "created": 1604716666,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gbeic6m": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbeic6m/",
      "text": "You can make it for 20 whole minutes!?!",
      "author": "HoosierTrip",
      "created": 1604707365,
      "upvotes": 26,
      "replies": {}
    },
    "gbehaj0": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbehaj0/",
      "text": "You are definitely not alone. I have 8 hours of classes twice a week, roughly 45 minutes in between if the first doesn’t go over to get up and move around. Halfway through the first I’m tired — by the time that last class starts I’m already exhausted. I thought I’d have a really productive grad semester this year but in reality I’m so exhausted.",
      "author": null,
      "created": 1604706792,
      "upvotes": 16,
      "replies": {}
    },
    "gbg3s9a": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbg3s9a/",
      "text": "Absolutely... and the NY Times had a great article on this about 6 months ago as to why.  \n\nIt turns out that, when we engage with people in real life, our brains are absorbing a *massive* amount of almost-imperceptible information (small gestures, posture, foot-shuffling, smells, pheromones, etc.), most of it subliminally.   \n\n(Because our lizard-brains need to know:  is this person about to attack me?  is this person a potential mate?  is this person a member of my in-group?  And our civilized-brains are constantly-evaluating on every level, from the utilitarian to the social to the abstract.) \n\nBut even on a high-quality, non-lagging Zoom call, practically NONE of this information is being captured by the software or otherwise conveyed.   You can't see their posture;  you can't smell their pheromones, etc.   So, your brain starts revving up to try to pick up the signals...  and this is exhausting. \n\n(It's sort of like how your cell phone battery drains faster when you're in an area of poor coverage, as it tries to grasp onto a useable signal.) \n\nIt goes the other way, too:   when I was Zoom-lecturing, I quickly learned to \"over-emote\"... to exaggerate the facial expressions emotions I was trying to get across, because the students seemed to respond much better when I did.  But this itself was exhausting... a 50 minute Zoom \"lecture\" felt as exhausting as giving a 2-hour in-person lecture.",
      "author": "DerProfessor",
      "created": 1604751779,
      "upvotes": 15,
      "replies": {
        "gbgy015": {
          "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbgy015/",
          "text": "Oh I relate to the last point so well! I teach Arabic language, and I have to use a ridiculous intonation (as if talking to kids sometimes) to get my students attention. Afterwards, I’m so exhausted... in April, I had the days when I taught 14 hours in one day (two departments with poor scheduling made me do so), I ended up voiceless. \nNow I have few online classes but yes.. keeping students concentrated is hard",
          "author": "millionsofminutes",
          "created": 1604770727,
          "upvotes": 3,
          "replies": {}
        },
        "gbgb2th": {
          "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbgb2th/",
          "text": "I was about the write this, but you’ve saved me the energy and likely did a better job than I would have.  Thank you!",
          "author": "username12746",
          "created": 1604757264,
          "upvotes": 2,
          "replies": {}
        },
        "gbgbj85": {
          "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbgbj85/",
          "text": "Thank you for the great explanation!",
          "author": "-Gravitropism",
          "created": 1604757572,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gbemysz": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbemysz/",
      "text": "All the time. Writing notes during the call definitely  helps me stay focused.",
      "author": "meadowsg636",
      "created": 1604709950,
      "upvotes": 9,
      "replies": {}
    },
    "gbf8v51": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbf8v51/",
      "text": "For me, Vitamin D deficiency was the culprit.",
      "author": "coronnial",
      "created": 1604722907,
      "upvotes": 6,
      "replies": {}
    },
    "gbfbp9n": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbfbp9n/",
      "text": "Yes - I started shortening my own lectures into smaller chunks when I realized that listening to anyone on Zoom for more than 20 minutes straight is mentally exhausting.  I don’t have a short attention span, either, so I don’t know why I find it so draining.",
      "author": "AcademicX",
      "created": 1604724835,
      "upvotes": 7,
      "replies": {}
    },
    "gbesyk3": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbesyk3/",
      "text": "Make coffee or any other drink for the call. I find that taking a sip or so whenever I start to drift helps me refocus.",
      "author": "damutantman",
      "created": 1604713397,
      "upvotes": 7,
      "replies": {}
    },
    "gbeqcq5": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbeqcq5/",
      "text": "yeah :/ it’s rly hard for me to go to talks and symposiums now, especially when they’re webinar format and i cant even discuss things or see others’ responses",
      "author": "sdbabygirl97",
      "created": 1604711896,
      "upvotes": 5,
      "replies": {}
    },
    "gbetuhr": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbetuhr/",
      "text": "Absolutely. There's a couple of strategies you can use. Try and set up somewhere where its possible to get up in long zoom calls. I do it in my classes. I just tell people I need to stretch, and step up as I keep speaking. Its easier when I'm conducting the class. When I'm in a meeting or a conference or something, and I'm not the one on the spot, its easier to just blank the screen, keep listening, and keep going. I've found that people are really accommodating about this in Academia. My students have been insanely supportive.\n\nAnother strategy, as someone mentioned below, is some exercises to get the blood flowing before you settle down.\n\nI realize it seems counter-intuitive, but I also find that doing something for just a few seconds when someone is speaking, and then letting your attention come back helps. Attention peaks and falls, and I think going with the natural flows a bit helps. With me, I sometimes take a minute in a long lecture to shift screens. Just refresh on Reddit. Maybe see the headlines on the news. Maybe look up an interesting source related to what we're discussing. When you've got 2-4 hour zoom classes like mine, I doubt looking away for like 5 minutes would break your ability to participate.",
      "author": "boringhistoryfan",
      "created": 1604713906,
      "upvotes": 7,
      "replies": {}
    },
    "gbex2v5": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbex2v5/",
      "text": "Every time I'm on a call.",
      "author": "ganadaIf",
      "created": 1604715789,
      "upvotes": 2,
      "replies": {}
    },
    "gbfjpcn": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbfjpcn/",
      "text": "Only if it's with my boss :)\n\nI actually like Zoom.  Most of the presentations I listen to have slow points and I don't feel as bad about opening up another tab and browsing reddit during them if I'm not doing it in public.",
      "author": "dampew",
      "created": 1604731167,
      "upvotes": 1,
      "replies": {}
    },
    "gbfql2e": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbfql2e/",
      "text": "Exactly! I think the problem is online classes are very new and instructors do not know how different it is from physical classes. There should be a lot of variety in the content, many intervals and breaks in order to keep the class (well, not lively, but) manageable. Stretching before and during the class also helps.",
      "author": "Additional-Cat-3317",
      "created": 1604737963,
      "upvotes": 1,
      "replies": {}
    },
    "gbfxlgu": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbfxlgu/",
      "text": "I get really sleepy 20 minutes into the day",
      "author": "SnooLobsters6596",
      "created": 1604745692,
      "upvotes": 1,
      "replies": {}
    },
    "gbg3yqd": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbg3yqd/",
      "text": "Is it only zoom calls or do you get this in, for example, lectures too? If you are otherwise sleeping well and have no underlying physical health problems, I really suggest looking at other aspects of your life and consider whether you might have ADHD. One of the big ways my ADHD affects me is that if I have to concentrate on only one thing for a long time, and I don't find it naturally engaging, then it literally exhausts me and I'm super prone to just falling asleep. Lectures, tutorials, zoom calls, the cinema, you name it I probably fell asleep in it. By the way, the subject itself could be super interesting to me, but if I'm not 'engaged' it doesn't matter... It just requires so much brain power to keep my focus, it feels like I'm trying to run some kind of mental marathon, but I've only got one leg and that one poor leg gets tired trying to hop while everyone else runs. Since starting medication I'm now a lot better able to pay attention to things without getting so overwhelmed. Not saying you necessarily do have this, and I certainly don't want to contribute to the \"college kids with adderall\" stigma, but if you also struggle in other areas I'd considering seeing a Dr.",
      "author": "wonderingloz",
      "created": 1604751917,
      "upvotes": 1,
      "replies": {}
    },
    "gbgbmvm": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbgbmvm/",
      "text": "Not really.\n\nI've been teleconferencing for work for well over a decade; and gaming with voice chat and/or videoconferencing for about as long.\n\nThe biggest difference is there is less social pressure preventing you from looking at your phone or just opening a web browser window than there would be in a seminar room.\n\nI'd suggest a computer solely for work, without any browsers configured to access social media, shop, whatever. If you only have one computer, make a different user account for this purpose, and leave your phone elsewhere.",
      "author": "ph0rk",
      "created": 1604757641,
      "upvotes": 1,
      "replies": {}
    },
    "gbgg30m": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbgg30m/",
      "text": "I find doing something with my hands can help fend off that itchy boredom feeling. I usually knit on zoom calls where I'm just listening, or take notes by hand if it's a really relevant topic for me.",
      "author": "queennbee",
      "created": 1604760478,
      "upvotes": 1,
      "replies": {}
    },
    "gbezddu": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gbezddu/",
      "text": "Play around with all the options of the call: screen sharing, waving, etc.",
      "author": null,
      "created": 1604717139,
      "upvotes": 0,
      "replies": {}
    },
    "gusj2um": {
      "link": "/r/AskAcademia/comments/jpcfrn/does_anyone_else_get_really_sleepy_about_20/gusj2um/",
      "text": "I get major zoom fatigue after about 20 minutes yup.",
      "author": "Napalm32",
      "created": 1618622319,
      "upvotes": 1,
      "replies": {}
    }
  }
}