{
  "sid": "qr59es",
  "link": "/r/AskAcademia/comments/qr59es/would_an_interdisciplinary_ma_in_something_like/",
  "title:": "Would an interdisciplinary MA in something like Liberal Arts / Liberal Studies / Humanities look bad to PhD programs?",
  "text": "I posted in here a while back asking whether I should go to grad school for philosophy or English. My undergrad is in philosophy, I'm a high school English teacher now, I love both and don't know how to choose. I've found some really interesting looking MA programs that are interdisciplinary and would fuse the two along with like sociology, psychology, religion etc. etc. etc. and I think I would really love those programs, but I guess I wonder if it would look bad when I go to get my PhD (prob in English literature or philosophy) that I have an interdisciplinary degree rather than being more of an \"expert\" in something. What do you think about this? I think the liberal arts MA would maybe help me orient myself towards what I'll ultimately want to do for my PhD. Help!",
  "author": "yungrobot",
  "created": 1636581361,
  "updated": 1637381286,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hk4v7aj": {
      "link": "/r/AskAcademia/comments/qr59es/would_an_interdisciplinary_ma_in_something_like/hk4v7aj/",
      "text": "I did an interdisciplinary MA in the UK because it got me closer to the skills I needed to pursue my PhD. You frame your doctoral application along those lines, namely that it's all part of your master plan,  it will be fine. As a lecturer now,  I look for PhD prospects that will work hard and finish their degree, but also can contextualise their progress against the backdrop of larger professional and intellectual ends. If you can show those things you can do what you want.",
      "author": "Fardays",
      "created": 1636587366,
      "upvotes": 3,
      "replies": {}
    },
    "hk6h8z6": {
      "link": "/r/AskAcademia/comments/qr59es/would_an_interdisciplinary_ma_in_something_like/hk6h8z6/",
      "text": "Interdisciplinary master's programs (especially self-designed ones) are excellent for students who want to transition from one academic discipline (their undergraduate major) to another (their desired PhD field), or who want to explore possibilities.\n\nIf you were certain about earning a PhD in the same field as your BA, then you'd be best off just applying directly to PhD programs.\n\nBut if you want exposure to other disciplines (esp. the kind of preparation in  method and theory that you would need for PhD admissions), then an interdisciplinary master's program makes sense. \n\nFeel free to message me - I direct an interdisciplinary MA program in the US.",
      "author": "matthewsmugmanager",
      "created": 1636617985,
      "upvotes": 2,
      "replies": {
        "hk733tu": {
          "link": "/r/AskAcademia/comments/qr59es/would_an_interdisciplinary_ma_in_something_like/hk733tu/",
          "text": "Thank you so much!!",
          "author": "yungrobot",
          "created": 1636635096,
          "upvotes": 1,
          "replies": {}
        },
        "hk95igk": {
          "link": "/r/AskAcademia/comments/qr59es/would_an_interdisciplinary_ma_in_something_like/hk95igk/",
          "text": "I think I had a misconception that PhD programs would be less likely to accept me coming straight out of undergrad. I have a 3.5 GPA with a 4.0 in my major. Do you think I could get into PhD programs? (In philosophy or literature, for example)",
          "author": "yungrobot",
          "created": 1636666764,
          "upvotes": 1,
          "replies": {
            "hkasxwn": {
              "link": "/r/AskAcademia/comments/qr59es/would_an_interdisciplinary_ma_in_something_like/hkasxwn/",
              "text": "Do you have really solid preparation in method and theory in your PhD field, an outstanding writing sample that demonstrates this, and could you get three excellent letters of recommendation from your former professors?  If so, you have a good shot right out of undergrad.",
              "author": "matthewsmugmanager",
              "created": 1636694992,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk8hj9c": {
      "link": "/r/AskAcademia/comments/qr59es/would_an_interdisciplinary_ma_in_something_like/hk8hj9c/",
      "text": "I got an interdisciplinary MA from an expensive American private university. I regret doing so because I am now saddled with a ton of debt that I'll pretty much have to really on PSLF to get rid of. On the other hand, it got me where I wanted, which was into a top PhD program. I'm not sure I had the chops to achieve that without it.",
      "author": "pipkin42",
      "created": 1636656916,
      "upvotes": 3,
      "replies": {}
    }
  }
}