{
  "sid": "otvvtd",
  "link": "/r/AskAcademia/comments/otvvtd/how_to_present_at_a_community_engagement_event/",
  "title:": "How to present at a community engagement event?",
  "text": "I've volunteered to present to a community oversight group organized by my institution. From my understanding it's  a group of people from the public, industry, local government, etc. that can provide feedback on our work. I'm in the early stages of a project looking at the impact of environmental pollutants on health in our city. The organizers have asked for specific questions and discussion points for the group, but I don't really know what to ask for feedback on. I'm relatively new to the institution and only have a masters, so this project was planned entirely by the PI and approved before I started working on it. I'll probably have specific questions about the actual analysis, but I don't think that's something the general public can help with. Has anyone done something similar and can advise on how to approach it? My presentation is going to be a bit of background on the research questions and a quick high-level overview of what we plan to do.",
  "author": "pinkienickel",
  "created": 1627559111,
  "updated": 1634082396,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "h6y2jwn": {
      "link": "/r/AskAcademia/comments/otvvtd/how_to_present_at_a_community_engagement_event/h6y2jwn/",
      "text": "Ugh. My criticism isn't aimed at you but this kind of set up needs to be properly planned out with a clear strategy from the outset about where and what stakeholder views will be sought on. Co-design and its variants are very popular at the moment and it can be very powerful but only when done properly. Organising an event for public engagement where there's no clear goal is counterproductive to the aims of public engagement. \n\nThis does not help you though. Depending on the broader context and progress of the project I'd either turn it into a Q&A session and drop the pretence of seeking feedback, or I'd give a high level overview of the aims of the project and then throw it over to the floor and find out what problems they see in their areas, ask what they think about the goals of the project - are they relevant, are they achievable, are there gaps, are there other local initiatives and are there opportunities for collaborating with them, what updates would people like and in what format.",
      "author": "ACatGod",
      "created": 1627559842,
      "upvotes": 6,
      "replies": {
        "h6zbvlz": {
          "link": "/r/AskAcademia/comments/otvvtd/how_to_present_at_a_community_engagement_event/h6zbvlz/",
          "text": "Ah thanks. That's sort of what I was thinking as well. I think if I was either earlier in the planning stages or later in the dissemination stage it would be more clear-cut. But I'm really just cleaning the data and hoping to start the analyses soon, so maybe I should wait for the next one of these group meetings to present? I jumped on it thinking it would be good practice and good to get involved, but maybe now isn't the right time.",
          "author": "pinkienickel",
          "created": 1627580485,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h6yxkpl": {
      "link": "/r/AskAcademia/comments/otvvtd/how_to_present_at_a_community_engagement_event/h6yxkpl/",
      "text": "Are you an urban planning student? If so, gonna follow this thread for comments because I'm about to be in the same boat!",
      "author": "laundrycroissant",
      "created": 1627574647,
      "upvotes": 1,
      "replies": {
        "h6zc18e": {
          "link": "/r/AskAcademia/comments/otvvtd/how_to_present_at_a_community_engagement_event/h6zc18e/",
          "text": "I'm in environmental epidemiology but I suppose they go hand in hand!",
          "author": "pinkienickel",
          "created": 1627580548,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}