{
  "sid": "qjviuz",
  "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/",
  "title:": "Gaining confidence with presentations",
  "text": "I have an annual review and unrelated project presentation coming up and I realise my public speaking/presenting skills are very sub par.\n\nDoes anyone have some tips on how to confidently present and answer questions in an academic setting? I often freeze up if asked a difficult question and I occasionally blank tbroigh nervousness too :(",
  "author": "Weekend_metalhead",
  "created": 1635704836,
  "updated": 1635779274,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.88,
  "comments": {
    "hisx760": {
      "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/hisx760/",
      "text": "Think of questions as an opportunity to show what you know. Generally, you can’t fit everything you know into a single presentation, so questions give you a chance to show your knowledge. As well, as a previous commenter pointed out, people aren’t usually trying to trip you up and may even be quite nervous about asking a question. \n\nGeneral good rules when answering questions: restate their question, briefly, just to make sure you are addressing what they want (people often ramble, so this gives them a chance to clarify); say some version of “that’s an interesting question,” or “you bring up a good point,” etc.; then answer as concisely as you can. If someone asks you something you don’t know, it’s okay to say, “Oh, I’m not familiar with that, but it sounds interesting,” or “While I can’t answer that specific point, it is related to this issue, which I can clarify.” No one expects you to have all the answers, and people often ask off topic questions, so just focus on being generous to the questioner. Also: it’s totally okay to scrawl quick notes when people ask you questions, to make sure you address them, and I often pause to take a sip of water when I need to think. Hope this all helps!",
      "author": "Felixir-the-Cat",
      "created": 1635710513,
      "upvotes": 6,
      "replies": {}
    },
    "hisnaks": {
      "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/hisnaks/",
      "text": "Try to approach it with a positive outlook and act like you enjoy it, so make it as fun for yourself as possible.\n\nAs for the questions, try to look past it as a criticism against you or your ability and either treat it as a challenge that you can meet (if you know the answer) or as useful feedback on what to look up at a later date or something to address in the lab (if you're on a STEM PhD). Most of the time, people asking you questions aren't trying to trip you up. They either don't understand, are interested or are trying to get you to think about something in a different way. Also, you're not expected to know everything so if you're really stuck just be honest and say so. \n\nLastly I'd say the person who cares most about what you're talking about is yourself. If you can stop putting pressure on yourself and treat it more casually, it'll really help!",
      "author": "tommeetucker",
      "created": 1635706416,
      "upvotes": 3,
      "replies": {}
    },
    "hisyw2s": {
      "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/hisyw2s/",
      "text": "Get practice responding to questions. You might ask a mentor, peer, or just a family member of friend to listen as you give a mock presentation, and maybe even ask you a few follow up questions.\n\nHopefully a lot of things will go right. There is a whole body of psychological research that shows that having done something successfully before can increase your confidence in doing that thing again in the future. So getting practice in a low-stakes setting is a good way to build confidence presenting for the future.\n\nIt's possible that maybe you do stumble over your words somewhere, or freeze up, or something else undesirable happens when you practice. That's OK! You can also identify areas for improvement when you practice and integrate them into your final presentation.",
      "author": "jogam",
      "created": 1635711215,
      "upvotes": 3,
      "replies": {}
    },
    "hiu0gw1": {
      "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/hiu0gw1/",
      "text": "If you can take improv classes or join a toastmasters club - those things tremendously helped my scientific presentation anxieties.",
      "author": "MisterMarge",
      "created": 1635729344,
      "upvotes": 2,
      "replies": {}
    },
    "hiuaz5e": {
      "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/hiuaz5e/",
      "text": "Just practice. 15 years in, I'm still absolutely terrified by public speaking, but these days I can hide it well, no-one can tell. \n\nAlso, don't be afraid of a moment of silence - if you need time to consider a question and formulate an answer, say \" hmm, that's a great question, let me think about that for a second\" and take a beat.",
      "author": "The-very-naughtyduck",
      "created": 1635734801,
      "upvotes": 2,
      "replies": {}
    },
    "hitjvur": {
      "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/hitjvur/",
      "text": "There's a podcast episode on presenting skills here: [https://your-digital-mentor.simplecast.com/episodes/presenting-skills](https://your-digital-mentor.simplecast.com/episodes/presenting-skills)",
      "author": "BigBagBoom1233",
      "created": 1635720842,
      "upvotes": 1,
      "replies": {}
    },
    "hiuwrr2": {
      "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/hiuwrr2/",
      "text": "Memorize your delivery for the first 5 minutes of the presentation. Typically memorized presentations feel canned, but if you limit it to the first few slides, the good momentum from nailing the beginning can carry you through the end. That, practice and memorize the slide order!",
      "author": "Oscardexterfelix",
      "created": 1635749531,
      "upvotes": 1,
      "replies": {}
    },
    "hiv5zhs": {
      "link": "/r/AskAcademia/comments/qjviuz/gaining_confidence_with_presentations/hiv5zhs/",
      "text": "Maybe try find somewhere to regularly present in a more casual setting, maybe a group meeting or journal club type of thing? It's rubbish but after a certain amount it just doesn't seem like a big deal anymore...",
      "author": "Responsible-Sir3396",
      "created": 1635758463,
      "upvotes": 1,
      "replies": {}
    }
  }
}