{
  "sid": "ddngzf",
  "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/",
  "title:": "LPTs for faculty phone/skype/zoom interviews (please add to!)",
  "text": "Remember you can have notes available and refer to them, but do not read significantly from them or appear to have something memorized. I would avoid preparing slides to show unless they are asked for, they often come across as cumbersome.\n\n1. **When scheduling the call, ask who will also be on the call.** Look them up and know who they are and what research they do.\n2. **Speak clearly and at a pace that can be understood.** You can ask if they can hear you clearly and ask them to speak up if you have trouble hearing them, but make sure you do so politely.\n3. **Do not shadow your accomplishments, but do not be boastful**. If you have a publication in a significant journal or received impressive funding, mention it, but do not repeatedly mention it again and again. Bring up accomplishments that have occurred since your application, which can be done when contacted for the interview via email and/or during the call.\n4. **Be patient if technical difficulties occur.** Do not be afraid to make idol chit chat if there is a delay where people are just sitting and waiting. How is the weather there?\n5. **Concisely and succinctly explain your research** ***past***, ***present***, and ***future***.  Be able to discuss the significance and innovation of your research, what you specifically did, and what were the highlights of your results in 3-5 sentences each (1-2 minute/each). If you have several research projects, try and elaborate on the most appropriate or significant. Avoid a monologue going on for several minutes, people lose interest after a couple minutes and you want to make the call interactive, not one way. If they want to know more about your research, they can always ask.\n6. **Be able to discuss and/or ask smart questions on the area, university, school/college (e.g. College of Engineering), and department/division**.\n   1. For the geographical area, if it has resources nearby have some knowledge of that if applicable. Or even in casual chat that might occur know what there is to do nearby or discuss sports if that is a significant aspect of the university.\n   2. Visit the university’s webpage and know what resources (e.g. core facilities, centers) they have that may help you. See if they have a strategic plan or focus areas they are looking to grow (e.g. cluster hires).\n   3. Know what resources the school/college has that can help. Maybe they also have a strategic plan and areas they want to grow.\n   4. Study the department/division and know who is in that unit, who does related research, what the common research areas are and especially who you could collaborate with. It is okay to want to collaborate with people outside the department/division, but you should know some in the division that you can work with. Know what classes they teach and where you would fit in that curriculum. Perhaps a course you could teach to add to the curriculum.\n7. **Know the ad.** If the ad is specific for a research area, focus on that area of research and not solely on other areas of research. If they request specific things in the ad, let them know you met those criteria.\n8. **Be able to explain why you are interested in the position** and if you are leaving a current position why you are interested in leaving.\n9. **Be prepared for a behavioral question.**\n   1. Tell me about a time when you handled a challenging situation?\n   2. Tell me about a time when you made a mistake and how you handled it.\n   3. Tell me about a time when you were in direct conflict with a peer and how was it resolved.\n10. **Know what resources, generally, you would need to succeed.** An itemized list of the number of pipette boxes is not needed, but what big equipment or shared facilities would you need. Also, is there expertise that you would need in a certain area as a collaborator?\n11. **Be able to answer questions showing the scope of your knowledge in your field.** For an applied field, what similar technology has been commercialized or is in start-ups? Know other individuals (maybe your advisor) who work in this area. How is this work unique from that? Where would you apply for funding?\n12. If you are a coming out of your post doc, think about what **project your first student would do** and how you would help them to accomplish that project.\n13. **Have questions prepared for the interviewers.**\n\n* When you were looking at resources, was everything you need available? If not, ask about the ones you need. Or if they are there, ask for specifications (not too in depth unless the people on the phone use them).\n* When will they get back to you? What is the schedule for on campus visits?\n* For junior faculty, is there a formal mentoring program?",
  "author": "spartan1977",
  "created": 1570283328,
  "updated": 1634081972,
  "over_18": false,
  "upvotes": 99,
  "upvote_ratio": 0.98,
  "comments": {
    "f2kjj2e": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2kjj2e/",
      "text": "If at all possible, use a wired connection.\n\nBefore the call happens, use your 'check video settings' feature to examine the frame to see if you're visually presenting yourself well--lighting, background scenery, etc.",
      "author": "herennius",
      "created": 1570286222,
      "upvotes": 38,
      "replies": {}
    },
    "f2kkdsc": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2kkdsc/",
      "text": "This is a good list, but it is very much focused on a research institution. If you are speaking with a teaching focused school, you need to show you are interested in the students and teaching. You should ask questions about what the students are like (try to make this specific like 'what sort of jobs do they go on to?'), if there are particular courses they are interested in having you fill (if it isn't clear from the ad), what sort of resources they have on campus for improving teaching. \n\nAlso when they ask you about a challenge you've faced teaching, be honest. Bring up a real challenge AND then talk about how you've learned from it. What they want to know is if you really think about your teaching.",
      "author": "geneusutwerk",
      "created": 1570286465,
      "upvotes": 32,
      "replies": {
        "f2ndamd": {
          "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2ndamd/",
          "text": ">If you are speaking with a teaching focused school, you need to show you are interested in the students and teaching. You should ask questions about what the students are like (try to make this specific like 'what sort of jobs do they go on to?'), if there are particular courses they are interested in having you fill (if it isn't clear from the ad), what sort of resources they have on campus for improving teaching.\n\nGood advice!  I'd also strongly suggest questions like \"What do you like most about teaching at \\_\\_\\_\\_\\_\\_?\" and \"How would you describe the typical student at \\_\\_\\_\\_\\_?\" in this setting.  In my experience committees like a chance to talk about themselves and their students a bit, and this is an easy way to signal that you are interested in their core mission and how their students might differ from those you are used to working with.",
          "author": "SnowblindAlbino",
          "created": 1570314644,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "f2l5pqn": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2l5pqn/",
      "text": "1. **Wear proper pants.** Ideally, you'll be sitting down and no one will know if you're wearing suit pants, pyjama pants, or no pants, but this is real life and nothing is ideal. You may have to unexpectedly stand up to open a door, or get something you forgot. It never hurts to put proper pants on, it may hurt you if you don't.\n\n2. **If you're calling from a laptop, place it on a thick textbook or two.** This will elevate the webcam so it can look flat at your face, rather than angling up like it normally would. It'll give you better lighting and a more natural look on camera, and people aren't looking up your nose. \n\n3. **Place information behind the screen.** The interviewers can't see what's on the wall behind your computer, so make use of this space. I put the interviewers' names there when I know them beforehand, just so I don't forget. Don't overload this space with info though, since you can't really read and talk at the same time. \n\n4. **Always use ethernet.** Wi-fi is too unreliable, and even if you *feel* like your connection is normally pretty stable, it's really not and that will be obvious over a platform like Skype where a truly stable connection is needed. Use your university's internet too, since their wired connection is probably much faster than what you have at home.",
      "author": "NoxiousQuadrumvirate",
      "created": 1570292162,
      "upvotes": 28,
      "replies": {}
    },
    "f2ku37d": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2ku37d/",
      "text": "> When you were looking at resources, was everything you need available? If not, ask about the ones you need. Or if they are there, ask for specifications (not too in depth unless the people on the phone use them).\n> For junior faculty, is there a formal mentoring program?\n\nMy rule of thumb is: don't ask questions where the answer might be \"no.\" So unless you know there is a mentoring program for junior faculty, I wouldn't ask the latter. And on resources, I would be very cautious. We've had interviewees ask things like, \"do you have a paid sabbatical?\" and the answer is _no_ (we wish we did, but the search committee is not in charge of such things!) and that makes everyone feel bad and awkward. \n\nThe kinds of questions that I think work better are ones that get faculty to talk about themselves and their school and their students. So things like, \"what kinds of careers do your students typically see themselves going into?\" is a nice one. \"What are the types of students who take your classes — are they all majors, or what?\" These are all nice, innocuous questions that give the interviewers a chance to make their school sound nice, and it makes you seem like you're interested in the \"whole institution.\" And people _love_ to answer questions about their commutes for whatever reason — \"do people live in town, or outside of it, or what?\" works really well because everyone gets to chime in and it also makes you seem like you're thinking about really committing to this place.\n\nI would leave questions about resources, mentoring, etc., to the campus visit, and ask them more informally (e.g., at lunch or dinner or something), in a one-on-one sort of situation, personally.\n\nWhich is I guess a thing to remember: ideally, a Skype/Zoom/Phone interview is a prelude to a longer interview. Your goal here isn't to find out whether you want to work at this school, it's to get your foot in the door for the \"real\" interview.",
      "author": "restricteddata",
      "created": 1570289278,
      "upvotes": 19,
      "replies": {
        "f2nei6s": {
          "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2nei6s/",
          "text": ">The kinds of questions that I think work better are ones that get faculty to talk about themselves and their school and their students.\n\nHonestly, the best question we get from candidates is always a variation of \"What do you like the most about working at \\_\\_\\_\\_\\_\\_\\_?\" It not only provides info for the candidates, but usually triggers a ~~candidate~~ *candid* exchange among the committee members that reads as natural, positive, and collegial. (At least at my institution.) It's also a useful filter I think-- if they all balk or say things like \"I hate it here\" it's probably a sign you don't want to continue in the process.",
          "author": "SnowblindAlbino",
          "created": 1570315055,
          "upvotes": 6,
          "replies": {
            "f2ob23z": {
              "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2ob23z/",
              "text": "Agreed! That's a good one, too. Same philosophy.",
              "author": "restricteddata",
              "created": 1570325453,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f2l1ejh": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2l1ejh/",
      "text": "Look at the camera as much as possible. I have googly eyes around the lens to remind me of this (a post it saying “look here” also worked). Even if you’re really engaged with the interview, it seems that much more so if the interviewers perceive eye contact.\n\nMake sure your top half (at least) is what you’d wear to a normal in-person interview. If you’re wearing pajama pants ... I mean, that can be your secret thrill.",
      "author": "Tagost",
      "created": 1570291062,
      "upvotes": 12,
      "replies": {}
    },
    "f2ncudr": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2ncudr/",
      "text": "Frequent search committee chair and veteran of \\*hundreds\\* of these calls checking in: this is good advice. I will add a few more brief ones based on experience.\n\n* test your connection and hardware in advance\n* know how to operate whatever software is being used (zoom, skype, etc.)\n* DO NOT take a video call from your messy bedroom or apartment; it looks unprofessional\n* DO NOT take said video call in your pajamas or a ratty tshirt; dress like you are at a job interview (because you are)\n* put your dog/cat/bird/whatever in another room; it's not cute when your cat keeps jumping into the frame\n* try to have a reasonable backdrop: a plain wall, bookshelves, etc. rather than a bright window or a Christmas tree or a bathroom (all of which I've seen)\n* DO find an office or even a classroom space to call from if you can; a neutral space is best\n* Hang a sign outside the office door saying \"CALL IN PROGRESS\" or something so your colleagues/friends/roommates don't come crashing in during the call\n* Have some notes handy for key talking points, but don't obsessively turn to them throughout the call-- make eye contact (camera contact) as much as you can\n* Thank everyone on the call at the end.\n* Be sure your connection is closed *before* you say things like \"Thank GOD that's over\" or \"I really blew that!\" to your partner off screen.\n\nOf OP's suggestions above, #6-7-8 are the most important in my experience. If a candidate does not have good questions to ask US they are almost always scored far below candidates who do-- show them you've done your research by asking informed questions that are specific to the position for which you are applying. We will always save time to do this at the end of the call, right after we ask you \"So why do you want to work with us at \\_\\_\\_\\_\\_\\_\\_?\"",
      "author": "SnowblindAlbino",
      "created": 1570314491,
      "upvotes": 7,
      "replies": {}
    },
    "f2m48d7": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2m48d7/",
      "text": "The 1-2 minutes per response is really important. It signals that you value the time of the committee and that you know what your about. Rambling or over explaining isnt good.",
      "author": "cdb3492",
      "created": 1570301495,
      "upvotes": 8,
      "replies": {}
    },
    "f2m1tuh": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2m1tuh/",
      "text": "Ensure you have proper lighting (no weird shadows, face clearly lit) and neutral background.",
      "author": "5pens",
      "created": 1570300612,
      "upvotes": 4,
      "replies": {}
    },
    "f2mw0fg": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2mw0fg/",
      "text": "This is super helpful... great for my Skype interview on Tuesday.  Thanks so much!",
      "author": "crashhelmi",
      "created": 1570309179,
      "upvotes": 4,
      "replies": {
        "f2my53k": {
          "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2my53k/",
          "text": "Good luck with your interview, I bet you will do great!",
          "author": "spartan1977",
          "created": 1570309779,
          "upvotes": 2,
          "replies": {
            "f2ndnds": {
              "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2ndnds/",
              "text": "Thanks!!",
              "author": "crashhelmi",
              "created": 1570314765,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f2oc2ar": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2oc2ar/",
      "text": "I've gotten the behavioral question a few times and I always struggle. I've legit never had a serious conflict with any peers or students. If they ask the mistake question, I can handle that one no problem. But a few times it's been about how I've handled a conflict with a student when my biggest conflict with students has just been dealing with plagiarizers. How do you answer this question if you don't have a good example of the thing that they're asking about?",
      "author": "Jurgioslakiv",
      "created": 1570325889,
      "upvotes": 3,
      "replies": {
        "f2q5pz0": {
          "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2q5pz0/",
          "text": "Well, you say you haven't had conflicts with peers and give the student example.",
          "author": "spartan1977",
          "created": 1570356157,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f2pemgj": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2pemgj/",
      "text": "Just did a dozen zoom interviews this past week.  Please check your connection before hand, and even consider having a backup if possible.  One guy had an issue with sound connecting but not video, and after a restart, he switched to another laptop that (from mac to windows) and it worked.\n\nAlso, and other people have said this, check what your video will look like.  Frame your face from straight on instead of angled up looking up your nose or cutting off half of your face.  Make sure the background looks nice as well (even a plane blank wall is fine which probably most of the interviews had).  The audio connections is another thing to check.  We had a couple of people with really low audio and other person whose audio sounded like it was going through a bad effects system. \n\nI want to reiterate #7 above.  We often have a particular research area or teaching needs indicated in our adds.  I can't tell you how many times we say we need a certain class taught in the ad, and then when we ask a candidate what classes they feel prepared to teach, they say everything other than the class we need.\n\nAnd #13, please do have a few questions, but not too many.  When the candidate has no questions, we tend to score that person lower.  When the candidate has 10 questions, we get annoyed.  \n\nFinally #15, this is not the place to give a 15 min presentation on your research (unless that has been asked).  Brief yet still complete answers will score you points.",
      "author": "manova",
      "created": 1570341843,
      "upvotes": 3,
      "replies": {}
    },
    "f2otkks": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2otkks/",
      "text": "I'm reading through the comments, I'm not sure this is on here-in case it's not - someone told me to be sure I'm dressed professionally from waist down as well, despite that part not being visible. You might need to get up to adjust something or pick something up or walk around and you should be professionally dressed top to bottom.",
      "author": "Onefroginapond",
      "created": 1570333162,
      "upvotes": 2,
      "replies": {}
    },
    "f2oj74b": {
      "link": "/r/AskAcademia/comments/ddngzf/lpts_for_faculty_phoneskypezoom_interviews_please/f2oj74b/",
      "text": "Learn gossips about people you both know, and when the time comes spill them out.",
      "author": null,
      "created": 1570329113,
      "upvotes": -5,
      "replies": {}
    }
  }
}