{
  "sid": "qwbobz",
  "link": "/r/AskAcademia/comments/qwbobz/letter_of_recommendation/",
  "title:": "Letter of Recommendation",
  "text": "*  asked a professor for LOR, he replied back with \"did you send me a letter to complete? Does this mean I am supposed to type a letter of talking points? I appreciate any advice!",
  "author": "Fast_Cheesecake_7006",
  "created": 1637191029,
  "updated": 1637353680,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hl1vlag": {
      "link": "/r/AskAcademia/comments/qwbobz/letter_of_recommendation/hl1vlag/",
      "text": "Sounds like you should send him some talking points. I don’t approve of doing it that way, but some profs do it",
      "author": "Distinct_Armadillo",
      "created": 1637191532,
      "upvotes": 2,
      "replies": {
        "hl1vwbj": {
          "link": "/r/AskAcademia/comments/qwbobz/letter_of_recommendation/hl1vwbj/",
          "text": "How should I format that? Thank you :)",
          "author": "Fast_Cheesecake_7006",
          "created": 1637191665,
          "upvotes": 1,
          "replies": {
            "hl1ypx8": {
              "link": "/r/AskAcademia/comments/qwbobz/letter_of_recommendation/hl1ypx8/",
              "text": "First, tell them what you are applying for, why you think you are a good fit and what you are hoping for from the letter (academic performance, research potential, etc). If your other letter writers are speaking about your research abilities, then maybe this person needs to talk about academic abilities. Then send 3-5 accomplishments to highlight. Presumably the professor has your CV and transcripts (if not, SEND THEM), but there might be important things missing. If you are applying for a social work masters, it might be relevant that you volunteered with a special needs summer camp, but that might not be on your CV.",
              "author": "gracefullygracie",
              "created": 1637192926,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hl4lsp7": {
      "link": "/r/AskAcademia/comments/qwbobz/letter_of_recommendation/hl4lsp7/",
      "text": "The professor is expecting you to draft a letter. Write the letter you would like them to send. The better job you do, the less work it will be for them to write you a great letter—and that’s the idea. Whenever you ask someone busy for a favor, you want to minimize the amount of work they must do to give you what you want.\n\nYou know your background and experiences and can write about them quickly and easily. The professor can then modify your draft to discuss their experiences with you and their opinions about your work and likelihood of future success.",
      "author": "bigrottentuna",
      "created": 1637247983,
      "upvotes": 1,
      "replies": {}
    }
  }
}