{
  "sid": "qo94yg",
  "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/",
  "title:": "Economics of Academic research??",
  "text": "I am looking into the prospect of joining academia, but I am not sure about the economics of academic research. I know basic things like, a postdoc is recommended for the post of an assistant professor. And institutions pay the faculty salary. Now I am not sure how research and publications play a part in it. Could anyone please explain?",
  "author": "GarudOne",
  "created": 1636232351,
  "updated": 1636654691,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hjlun2g": {
      "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjlun2g/",
      "text": "You need to provide more details and context regarding your question. \n\nInstitutions often give starting professors a pool of money that they can use to start their lab and research (a startup, which may be between $500k and 2 million depending on discipline). Research is often paid for through grants.",
      "author": "moderneros",
      "created": 1636238708,
      "upvotes": 3,
      "replies": {
        "hjlxj2b": {
          "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjlxj2b/",
          "text": "I'm not very clear about the field myself. But since you answered, if research is paid through grants, then what lets in an inflow of grant money? Is it research publications, or desired results expected by those who give the grant, or is it the number of graduates you are an advisor to. Or do you take up a project from some industry?   \n\n\nIn the context of STEM fields",
          "author": "GarudOne",
          "created": 1636240042,
          "upvotes": 1,
          "replies": {
            "hjm2w2i": {
              "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjm2w2i/",
              "text": "You apply for grants and they are reviewed by a panel of experts. Generally other people who have received that grant in the past. They evaluate the strength of the proposal, including the actual methods and your track record of previous work. Generally they come from the government, but can also come from industry. \n\nJust advice, but I think you might be hugely overthinking this. Assuming you are an undergraduate, it would be 5-7 years of intense work before you'd even begin to think about this issue. Your advisor would have a grant (hopefully), then you'd likely do another 2-10 years working on other grants as a postdoc and maybe applying for your own, all the while trying to get a permanent job. THEN you'd be applying for grants yourself, and by then you'd have a decade or two of experience. \n\nAnd if you don't end up in a grant-heavy environment (i.e., the rarified air of a prestigious research university) you may never have to worry about grants. By far the most common job in academia involves teaching and doing some research that you don't necessarily need grants to do.",
              "author": "logouteventually",
              "created": 1636242489,
              "upvotes": 5,
              "replies": {
                "hjmq85m": {
                  "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjmq85m/",
                  "text": "Ok that clears up a lot of questions. Thank you",
                  "author": "GarudOne",
                  "created": 1636253709,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hjnf61e": {
          "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjnf61e/",
          "text": "Uh. That figure only goes in top institutions - other places start up may be between 50K or 0",
          "author": "Fabulous_Ad_4788",
          "created": 1636270552,
          "upvotes": 1,
          "replies": {
            "hjnwrsd": {
              "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjnwrsd/",
              "text": "True ^. I can only speak of what I’ve know for new professors and in my field; I have no doubt this varies tremendously between university and disciplines.",
              "author": "moderneros",
              "created": 1636286340,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjlyjd5": {
      "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjlyjd5/",
      "text": "What country are you in? This really depends on how the educational system is set up in your country, and if in the U.S., which state?",
      "author": "stop_taking_my_user",
      "created": 1636240513,
      "upvotes": 4,
      "replies": {}
    },
    "hjlxe12": {
      "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjlxe12/",
      "text": "[deleted]",
      "author": null,
      "created": 1636239976,
      "upvotes": 1,
      "replies": {
        "hjmsv4f": {
          "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjmsv4f/",
          "text": "I never thought of learning about  *\"economics of post-docs vs PhD students\"* after posting here, that's something totally new.",
          "author": "GarudOne",
          "created": 1636255116,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjocu7y": {
      "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjocu7y/",
      "text": "I mean;\n\n1) The precise nature of this is *highly* dependent on what country you'd be working in and what field you're going into. And saying \"STEM\" broadly isn't sufficient; it's too broad.\n\n2) If you don't know, you really need to get \"the talk\" from your advisor, as they'll have the best insights as to the specifics of your field. This is not something you can idly \"decide\" to go into; it takes a hell of a lot of preparatory work because of how hypercompetitive the hiring process is, due in major part to the obscene ratio of doctoral degrees granted to academic job openings (something on the order of 35:1 right now, and that's actually the best it's been in decades; it's normally on the order of 50:1 to 100:1 year-over-year).\n\n>a postdoc is recommended for the post of an assistant professor.\n\nA Postdoc is literally a job where a major part of your job is getting a different job. It's essentially meant to be a transitionary period between your PhD and whatever you do *after* your PhD, and is basically meant to shore up your resume with things that you couldn't necessarily do while working under your former advisor.\n\nIn practice, that means showing you can work independently, showing you can work collaboratively with others with whom you had no real prior interactions, and continuing to publish papers until you feel you have \"enough\" to go after a tenure track position.\n\n>And institutions pay the faculty salary.\n\nInstitutions pay the base salary; additional income is typically taken out of your grants (and no, you don't really get a choice in this; there will basically be a hard-and-fast rule that you will take X% of your grant funding as added income on top of your normal salary, no more, no less).\n\n>Now I am not sure how research and publications play a part in it.\n\nYou get grant funding by writing to grant funding agencies and saying you want to tackle problem X, and you have the knowledge and experience required to tackle that problem. You demonstrate that experience with publications, and you get those publications via doing research.",
      "author": "r3dl3g",
      "created": 1636295202,
      "upvotes": 1,
      "replies": {
        "hjswmx0": {
          "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjswmx0/",
          "text": "If what you say is accurate then it does not seem like a lucrative career option. Take a Job within a Job. And if the intake ratios are that tight, then I'm pretty sure the other PhDs do get employment in R&D Labs of industries. The only sense of stability comes from the Base salary. Next, research based on projects taken need getting in students and Post Docs to work in the lab, so it looks like Managing a mini office firm. And the major influence comes from the quality of students and postdocs which in turn depends on the University. I see you have a PhD in Mechanical Engineering. Could you share your experience in brief. If you want to that is.",
          "author": "GarudOne",
          "created": 1636379226,
          "upvotes": 1,
          "replies": {
            "hjt8b05": {
              "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjt8b05/",
              "text": "> If what you say is accurate then it does not seem like a lucrative career option.  \n  \nCorrect",
              "author": "brett_hoover_wx",
              "created": 1636384639,
              "upvotes": 3,
              "replies": {}
            },
            "hjv545u": {
              "link": "/r/AskAcademia/comments/qo94yg/economics_of_academic_research/hjv545u/",
              "text": ">If what you say is accurate then it does not seem like a lucrative career option. \n\n...Duh?\n\nThe value in academia is the freedom, as well as the high levels of job security post-tenure. In addition, while the pay isn't fantastic, it's still good enough to be comfortable, and you have a lot of freedom to supplement it with grants and consulting.\n\n>Next, research based on projects taken need getting in students and Post Docs to work in the lab, so it looks like Managing a mini office firm.\n\nAgain, duh.\n\n>Could you share your experience in brief.\n\nWent to a mid-tier R1. My advisor fought tooth and nail for funding in a crowded field in order to fund his lab. Graduated a while ago, now work for the Feds doing combustion research.\n\nGrad school was an absolute blast, but I'm not really sure I want to go for a tenure-track position, at least not now.",
              "author": "r3dl3g",
              "created": 1636412451,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}