{
  "sid": "axbrct",
  "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/",
  "title:": "Professors: what questions do you wish prospective/new PhD students would ask you?",
  "text": "I am visiting the campus of a PhD program that has offered me admission. Since their offer, I have Skyped for an interview, corresponded via email with various faculty members in my field of interest, with current graduate students, and with the GPD. So my basic questions about funding, research, resources etc have already been answered. This Open House is a two day event where I will be interacting with potential advisors and peers for most of the day each day. I was wondering what kind of events take place, what kind of questions I should be asking during one on one conversations with faculty as well as during panel sessions. Please help! Thank you!!!",
  "author": null,
  "created": 1551730508,
  "updated": 1634081462,
  "over_18": false,
  "upvotes": 125,
  "upvote_ratio": 0.99,
  "comments": {
    "ehslez2": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehslez2/",
      "text": "If you haven't already discussed this with your potential supervisor, I'd definitely make it a point to ask them and other students--How often does your supervisor contact their students? How often do they meet with their students? What's their average turnaround time for comments on a chapter draft? Do they usually initiate contact with their students, or is it expected that you will be the main driver of the relationship? How many students have they graduated, and where are they now? Do they co-author with their students? Do they bring students with them to conferences? What's their position on mental health issues in grad school/academia?",
      "author": "riotous_jocundity",
      "created": 1551733898,
      "upvotes": 115,
      "replies": {
        "eht6cw1": {
          "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/eht6cw1/",
          "text": "As a PI I would love it if someone asked all these questions. Mostly because I really value mentoring so my answers are good! A lot of people end up in places that make them miserable. Sure like any job it’s stressful and unlike a lot of other jobs it can be consuming. But I believe in boundaries and science should be fun!",
          "author": "oneiria",
          "created": 1551749513,
          "upvotes": 9,
          "replies": {}
        },
        "ehsu8xw": {
          "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehsu8xw/",
          "text": "These are definitely important, but I feel asking too many questions makes the prof feel like I'm interrogating them or something :/",
          "author": "FlyingQuokka",
          "created": 1551740064,
          "upvotes": 23,
          "replies": {
            "ehsuf6c": {
              "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehsuf6c/",
              "text": "You should be interrogating them--your relationship with them will influence the rest of your life. I can't tell you how many grad students I know who are absolutely miserable and delayed in finishing because they didn't have these conversations.",
              "author": "riotous_jocundity",
              "created": 1551740190,
              "upvotes": 63,
              "replies": {
                "ehsutht": {
                  "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehsutht/",
                  "text": "I’ve asked some of these questions via email/on the phone. I am, however, struggling to find a way to bring up the mental health questions without first knowing that they would be accepting. I already know I struggle with clinical depression and anxiety, and on bad days it does affect my work. I just don’t know how to ask about resources without freaking them out. ",
                  "author": null,
                  "created": 1551740483,
                  "upvotes": 18,
                  "replies": {
                    "ehswg1e": {
                      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehswg1e/",
                      "text": "A sideways way of getting a sense of how supportive they may be is to mention the plethora of recent studies showing that graduate students have some of the poorest mental health out there and ask your supervisor if they can offer any insights. If their \"insight\" is that millennials are lazy or lack gumption, then run.",
                      "author": "riotous_jocundity",
                      "created": 1551741719,
                      "upvotes": 44,
                      "replies": {}
                    },
                    "eht5aej": {
                      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/eht5aej/",
                      "text": "This is a question to ask AFTER they've made you an offer. Asking other students is a good idea as well.",
                      "author": "fatfreemilkman",
                      "created": 1551748679,
                      "upvotes": 12,
                      "replies": {}
                    },
                    "ehtomyc": {
                      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehtomyc/",
                      "text": "I would not bring it up until you know them very well. You could casually ask students if it is true that many PhD students suffer from anxiety and depression. If there are good relevant resources they will mention them on their own. If not, don't ask. \n\n\nSadly, there is a lot biased against students with mental / behavioral health issues in the academia. That's very unfortunate, but true, even if people deny it...",
                      "author": "polished_iconoclast",
                      "created": 1551766528,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "ehu0f9o": {
                  "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehu0f9o/",
                  "text": "Let’s face it, 99% of grad students accept the first PhD position they are offered. \n\n",
                  "author": null,
                  "created": 1551785336,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "eht0cyo": {
              "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/eht0cyo/",
              "text": "Some of these are better questions for the current students imo.",
              "author": "mediocre-spice",
              "created": 1551744762,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "ehspw2a": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehspw2a/",
      "text": "What is the job placement rate.",
      "author": "IamRick_Deckard",
      "created": 1551736938,
      "upvotes": 23,
      "replies": {
        "ehsvi8p": {
          "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehsvi8p/",
          "text": "100% success rate... at PT adjunct positions. ",
          "author": "Tatta_Tatta",
          "created": 1551740999,
          "upvotes": 29,
          "replies": {}
        }
      }
    },
    "ehsqfk3": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehsqfk3/",
      "text": "I'm a student, but here are the questions I asked:\n\n1. What are reasons people left the program in the past?\n2. What rates do your students get tenure-track jobs?\n3. What are your expectations for productivity in terms of papers? What about on a weekly basis?\n4. How often do you meet with students?\n5. What are the prospects for going to conferences/giving talks/etc?\n6. What year/semester within the program would you give your student a real research project (i.e. after classes are finished or during classes)?\n7. What is funding like? How much would you be teaching vs. doing research?\n",
      "author": "Podinaut",
      "created": 1551737328,
      "upvotes": 45,
      "replies": {}
    },
    "ehsqh9c": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehsqh9c/",
      "text": "Is there anything I can do before I start working with you to come in better prepared?",
      "author": "BananasonThebrain",
      "created": 1551737362,
      "upvotes": 30,
      "replies": {
        "ehsul4k": {
          "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehsul4k/",
          "text": "That’s an excellent question. Thank you!!!",
          "author": null,
          "created": 1551740314,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ehsjvsa": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehsjvsa/",
      "text": "In the humanities, I'd certainly ask questions related to the strength of the *community*. What kinds of informal activities take place in the department? How are the offices and lounges organized? Does the program run on a cohort model? How frequently does the department organize group trips to conferences? When was the last happy hour?",
      "author": "nwfisk",
      "created": 1551732870,
      "upvotes": 42,
      "replies": {
        "ehst6lo": {
          "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehst6lo/",
          "text": "This is a great question. My cohort and colleagues were a huuuge part of my success in grad school (and after!). We had all you are talking about- happy hour, informal events, cohorts, writing groups, etc. I didn't realize it until after getting my degree how rare that was!",
          "author": "ekochamber",
          "created": 1551739299,
          "upvotes": 19,
          "replies": {}
        },
        "eht4hm8": {
          "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/eht4hm8/",
          "text": "The quality of the academic environment in the department/school makes a huge difference. Having done my masters in a department with only one other grad student and my PhD in a department with over 50 I can tell you the support/fellowship of other people that are as crazy interested in what you are passion about makes the whole experience one million times better.  ",
          "author": "matthuntgardner",
          "created": 1551748047,
          "upvotes": 10,
          "replies": {}
        },
        "ehtqc03": {
          "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehtqc03/",
          "text": "+1 for social sciences as well\n\nIt can make the difference between the some of the best or worst years of your life.\n\nThe atmosphere and attitude of a department is key. You want to find a group of productive, happy people that generally like one another or at least don't have open beef. ",
          "author": "middledeck",
          "created": 1551768725,
          "upvotes": 5,
          "replies": {}
        },
        "ehts3lu": {
          "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehts3lu/",
          "text": "For my department \"organizing trips to conferences\" meant assuming students already knew about them, applied to them by the deadlines without notification, and maybe sort of seeing them if you managed to book a flight and room and remembered to RSVP for the department after party they only email about as an afterthought the day before. \n\nI found out about the first conference when I got an email saying \"come find us at the after party tonight!\" It was in Florida, I guess.",
          "author": "Prof_Acorn",
          "created": 1551771268,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "eht07nz": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/eht07nz/",
      "text": "During one on one conversations, I would ask faculty more details about their research. They do this for a career, so it's the kind of thing most of them love to talk about. You say you've already covered research questions, but get to really know the interests of the people around you. There's no way you can know everything about every research experience they have ever had, so there will always be room for the conversation to grow naturally in whatever direction is a common interest between you. Find out more specifics about their projects and techniques. Ask questions that show you're engaged in the conversation and interested in what they are saying. I find this is a great way to interact with people who are judging whether or not they will enjoy working with you for years to come. They want to know you have the potential to bring new insights and ideas into the department.\n\nI'll add the caveat that you don't want to come off as aggressive or know-it-all. If you are familiar with a topic, that's great. If you're not, it's an opportunity to learn something. Don't pretend you know their research if you don't. To me, a graduate program is all about learning how to ask appropriate questions, to make sense of difficult concepts. It's not about pretending how much you know. It's about using a common base of knowledge to expand into new areas you haven't thought much about before. That's what you want to convey to the faculty - that you're interested and engaged in the material and can offer the ability to think critically about topics.",
      "author": "Melkovar",
      "created": 1551744649,
      "upvotes": 11,
      "replies": {}
    },
    "eht9uqp": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/eht9uqp/",
      "text": "I was advised to ask (this only works in a fairly informal one-on-one situation) if they've ever \"gone to bat\" for a student they've supervised, how invested they are in the projects/people they're working with. This helped me get matched with someone that was extremely activist in his field and very pro-researcher, not just pro-research. :)",
      "author": "hello_shiawase",
      "created": 1551752232,
      "upvotes": 7,
      "replies": {}
    },
    "eht4q82": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/eht4q82/",
      "text": "You should also consider what it is you actually want to do as a dissertation and choose the faculty member at the school who is most passionate about that same topic. My friends who chose the school over the advisor, and ended up with an advisor who was mismatched to their dissertation topic end up having a horrible time. ",
      "author": "matthuntgardner",
      "created": 1551748240,
      "upvotes": 2,
      "replies": {}
    },
    "ehxjgmq": {
      "link": "/r/AskAcademia/comments/axbrct/professors_what_questions_do_you_wish/ehxjgmq/",
      "text": "What sort of institutional support do they provide to grad students for conference and archival travel? What competitive grants have been won by students in the program?",
      "author": null,
      "created": 1551894857,
      "upvotes": 1,
      "replies": {}
    }
  }
}