{
  "sid": "qmcdx7",
  "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/",
  "title:": "Switching from a master's to a PhD",
  "text": "Hi,\nI was wondering if anyone has had experience with quitting a master's program (one not connected to PhD) and going into a PhD program instead. \n \nI am in a psychology masters program right now and have realized that I wish to get my PhD or PsyD also in psychology. Would it be bad to not finish my master's and instead just start a PhD/Psy? There is a lot of overlap between the master's and PhD content so it feels a bit like a waste of time to finish up the master's before starting.\n\nThanks for your help.",
  "author": "Nothingtoseehere68",
  "created": 1635998629,
  "updated": 1636136907,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hj9lyiq": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hj9lyiq/",
      "text": "others have made good points, I suppose my main question would be why not finish the masters and then do a PhD, you're unlikely to start a PhD before September so you've got time",
      "author": "tc1991",
      "created": 1636023043,
      "upvotes": 6,
      "replies": {}
    },
    "hj9hp4t": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hj9hp4t/",
      "text": "I will first give you my opinion to a question you are not asking. I think you might be able to use some of the courses you are taking now for waiving future PhD requirements. I did that with stats and cognitive psych from my masters to my PhD.\n\nI do not konw if it will look bad. Are you asking for the application process or for general career resume impression?",
      "author": "pkollias",
      "created": 1636019664,
      "upvotes": 4,
      "replies": {}
    },
    "hj97384": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hj97384/",
      "text": "It will look bad. If you quit your masters, they will wonder if you will quit a PhD/PsyD. I would absolutely not advise doing this.",
      "author": "adorationn01",
      "created": 1636010130,
      "upvotes": 10,
      "replies": {}
    },
    "hj9qajt": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hj9qajt/",
      "text": "Where are you studying? This kind of thing differs between countries. Here in the UK, the PhD would have very little taught content, and the MSc would be good preparation, both in terms of learning skills and as a way of making it more likely that you will get a PhD place and funding. If you could quit your MSc today, get all or most of your money back, and go straight into a PhD tomorrow without needing a masters, then that would be great. But that seems pretty unlikely. My advise would be to use the masters to get a head start on the PhD.",
      "author": "another_secret_prof",
      "created": 1636025983,
      "upvotes": 2,
      "replies": {}
    },
    "hjag377": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hjag377/",
      "text": "Typically a masters is 30 hours after finishing a bachelors and a PhD is 60. For the masters most of that is made up in coursework that can transfer to a PhD or otherwise earn you credit. \n\nI actually dropped a masters to do a straight to PhD (under the same advisor because she had a specific project for me) and ended up taking more classes than if I just finished the masters. Ymmv. \n\nAlso a masters will make you a more competitive applicant",
      "author": "little_grey_mare",
      "created": 1636038346,
      "upvotes": 2,
      "replies": {}
    },
    "hjcjo1y": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hjcjo1y/",
      "text": "Current psych PhD student who was in a psych masters program beforehand- I would not recommend quitting your masters. Many psych PhD programs allow you to earn your masters along the way, and if you have a masters before entering a PhD program you might place out of certain classes to lessen your time in the PhD program and/or not be required to do another masters thesis (if you’re doing one now).\n\nEdit: also many PsyD programs and some PhD programs require you to pay tuition. Shaving off time from your program means you pay less $",
      "author": "Coxarooni",
      "created": 1636068250,
      "upvotes": 2,
      "replies": {}
    },
    "hjd67gp": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hjd67gp/",
      "text": "Reach out to a colleague who already has their PhD in psychology, and ask them for their perspective—either a mentor from your masters program, or a professor from the prospective PhD program.  I recommend reaching out to both, so you can compare and contrast their replies.",
      "author": "Goudaloop",
      "created": 1636078200,
      "upvotes": 2,
      "replies": {}
    },
    "hj8rxh3": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hj8rxh3/",
      "text": "So you’re switching to an MS-PhD program? Hmmm I think that’s okay but I think you still have to do the MSc coursework. I think you should ask your study advisor about this switch if your current credits would be counted.",
      "author": "nessroein",
      "created": 1635999005,
      "upvotes": 1,
      "replies": {}
    },
    "hj8rre2": {
      "link": "/r/AskAcademia/comments/qmcdx7/switching_from_a_masters_to_a_phd/hj8rre2/",
      "text": "I don't think it would hurt you, especially if you explain why you're wanting to switch into a PhD in your application materials. That said, is the masters at a good school? It's fairly common nowadays for grad students to get masters degrees first and then apply to PhD programs with the hope that they are able to get into a better program than if they applied straight out of undergrad.",
      "author": "BandiriaTraveler",
      "created": 1635998902,
      "upvotes": 0,
      "replies": {}
    }
  }
}