{
  "sid": "qv0gvm",
  "link": "/r/AskAcademia/comments/qv0gvm/offered_independent_study_by_professor/",
  "title:": "Offered independent study by professor.",
  "text": "I am an undergraduate Jazz-specialized music student double majoring in anthropology. After speaking to a large number of faculty and graduate students at other universities about my interests, one of the schools faculty that I had a long discussion with, an ethnomusicologist, offered to supervise independent study after her sabbatical this spring. I was told by one of my professors that this was very uncommon. How should I approach this situation going forward? I know a clear cut answer is impossible but any advice would be greatly appreciated since nobody I am close to has had this experience.",
  "author": "Jazzy9786",
  "created": 1637040499,
  "updated": 1637180885,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hktjhzh": {
      "link": "/r/AskAcademia/comments/qv0gvm/offered_independent_study_by_professor/hktjhzh/",
      "text": "That sounds pretty cool. Are you interested in it? Is it something you think you’d like to do? I don’t think it’s that uncommon for profs to offer independent studies to undergrads who seem like they share interests with the prof and/or have a promising academic future. What specific questions do you have about it?",
      "author": "tiredstrudel",
      "created": 1637040901,
      "upvotes": 3,
      "replies": {
        "hktkf2y": {
          "link": "/r/AskAcademia/comments/qv0gvm/offered_independent_study_by_professor/hktkf2y/",
          "text": "It is absolutely something I am interested in. I have wanted a course were I can dedicate my time to something that I am truly interested in and develop research skills to help in further academic pursuits. The main questions I have are what exactly independent study entails and how should I go about my research. The professor did say that she was willing to work with me on whatever I was interested in related to musicology, but that feels overwhelming.\n\nThe serious question I have is how do I navigate academia appropriately? I feel like I might ruin my chances. I speak my mind. I am not afraid to challenge conventions if I feel I have the information to do so. I know that sometimes my eagerness and directness can put many people off. I am looking for ways to approach the situation tactfully and to learn greater, professional social skills.",
          "author": "Jazzy9786",
          "created": 1637041464,
          "upvotes": 1,
          "replies": {
            "hkxn0cs": {
              "link": "/r/AskAcademia/comments/qv0gvm/offered_independent_study_by_professor/hkxn0cs/",
              "text": "I think that you will get the most out of this experience by working closely with the prof to define what your research will look like. Every independent study and research project is different, so I can’t really tell you what to expect. Only that it’s great to go into this with an open mind. I know studying “anything you want” can be really overwhelming so I would make a list of a few things and then go over those with the prof to see what’s realistic and feasible. If you aren’t sure where to start with the list, doing some research online can help you to see what’s being done in the field first. \n\nI think taking the prof’s lead will help you with developing your social skills in academia a bit more. Though I don’t think that being direct and eager are antithetical to academic success either. I’m a first gen student from a low income background so I still have a lot of difficulty navigating the “social norms” of academia, but the vast majority of people are helpful and open if you’re honest with them about where you’re coming from.",
              "author": "tiredstrudel",
              "created": 1637114206,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hku7e1w": {
      "link": "/r/AskAcademia/comments/qv0gvm/offered_independent_study_by_professor/hku7e1w/",
      "text": "Through my 38 years at my college, the overwhelming number of independent studies I offered were for students who had messed up and not taken a particular class they needed for graduation. In those cases I'd simply print out a syllabus with the assignments, give it to the student and tell him/her that they needed to learn the assigned materials. Exams were always essay exams and were focused exclusively on the text and other assigned materials. I was available during office hours for consultation and I was happy to answer questions but if a question came that clearly demonstrated that the student hadn't studied the materials I'd refer the student back to the assigned materials. In those cases, an independent study was truly independent and didn't require much additional work on my part.\n\nHowever, over the years I did offer independent studies in my specific research area (classes weren't taught in my specific area on my college campus) that were part of \"Special Topics\" classes. These were for students who had expressed an interest in my area and asked if there were courses available. I spent a lot of time on those, developing materials and a syllabus (we need a syllabus for all classes taught) and having weekly meetings with the student regarding the materials. I treated those much more as seminar classes that were discussion-based. There were no exams; grading came from the weekly discussion of the materials as well as 2 major papers due (one at midterm and the other at finals). I didn't have to spend much time preparing for each of our weekly meetings because it was my academic area and I was very familiar with the assigned materials in class. But I did spend a lot of time in those weekly meetings with the individual students as well as reading the 2 assigned papers that the students wrote. It was always very clear when a student didn't prepare for our meetings and, in fact, a couple of times I suggested that a student drop the class because s/he wasn't preparing for it. There's no place to hide in individual weekly meetings!\n\nIf you know that you need work on professional social skills, you're already on your way to doing better. One aspect of abruptness that irritates the hell out of me are people that simply declare, \"You are wrong about X!\" in one way or another. I know that I'm wrong often in my life but in my experience when a student has told me that about an academic issue, I am very typically correct and the student is not interpreting the information correctly. That's perfectly fine--it's in the nature of being a student to be figuring stuff out and to not be correct all the time. A much better way of expressing disagreement is to say something like, \"As I read A, it seems to me that Y and Z are correct rather than X being correct.\" It's a much more gentle and socially-appropriate response if you think somebody is wrong about something. And it would allow me to help you understand that Y and Z are not, in fact correct. Or, it would let me learn that I was, in fact, wrong about X!",
      "author": "rockyfaceprof",
      "created": 1637059209,
      "upvotes": 1,
      "replies": {}
    }
  }
}