{
  "sid": "oorxrq",
  "link": "/r/AskAcademia/comments/oorxrq/curious_about_academia/",
  "title:": "Curious about academia",
  "text": "I'm a second-year Ph.D. student in Counseling Psychology. I have an interest in pursuing academia after grad school but am concerned with the competitiveness and (as a woman) limited work-life balance. Does anyone know much about pursuing academia but in a non-tenured way? Aka adjuncting, being on staff, etc.? Thanks for any advice!",
  "author": "Big-Entrepreneur872",
  "created": 1626880504,
  "updated": 1634082478,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.54,
  "comments": {
    "h60juv5": {
      "link": "/r/AskAcademia/comments/oorxrq/curious_about_academia/h60juv5/",
      "text": "i don’t think you earn a comfortable wage by adjuncting. maybe look at community colleges or undergrad-focused institutions where you can focus on teaching, if that’s what you want?",
      "author": "victoria-lobster",
      "created": 1626882420,
      "upvotes": 4,
      "replies": {}
    },
    "h60qxab": {
      "link": "/r/AskAcademia/comments/oorxrq/curious_about_academia/h60qxab/",
      "text": "Hey there -- my Ph.D. is in counseling psychology!\n\nThere are plenty of academic opportunities in counseling psychology outside of tenure-track positions. Many graduate institutions in clinical/counseling psychology do not work on the tenure system, and you can find either full-time work teaching courses / supervising graduate student clinicians, or part-time and adjunct work. Some institutions employ lecturers and professors of practice, which are likewise focused entirely on teaching and supervision of clinical work, without research expectations. And there are certainly opportunities to adjunct courses. It is perfectly reasonable, for example, to have a full-time job as a clinician that pays the bills and provides your insurance, and adjunct a class on top of that (for extra money, or so that you can see a couple fewer clients per week).\n\nFor what it's worth from a competitiveness standpoint: while academic positions in counseling/clinical psychology are absolutely competitive, the fact that most folks earning this degree go into clinical work and not academia means that academic positions are not as competitive as they are for many other fields. In other words, if you do want to work in a tenure-track position or non-tt full-time academic position, it's not like winning the lottery in the way that it is in certain other fields.\n\nAs a second-year Ph.D. student who knows you want to work in academia but likely not in a tenure-track position, my recommendation would be to get the kinds of experience that will make you competitive for the future positions you are seeking. Take advantage of opportunities to teach or serve as a T.A. for courses in counseling and clinical psychology. If your university offers coursework or other training in pedagogy, seek it out. And if you have opportunities to provide clinical supervision as part of your program, definitely do that. These kinds of experiences can hopefully contribute to a strong application when you are applying for future positions, whether it be to be an adjunct, to work in a training program, or for a lecturer or other non-tt position.",
      "author": "jogam",
      "created": 1626885375,
      "upvotes": 3,
      "replies": {}
    }
  }
}