{
  "sid": "q9717m",
  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/",
  "title:": "Thesis student likely not getting a passing grade now. 15 years ago I loathed my supervisor for that. How do I assess who's being wrong today?",
  "text": "I've got a case of maybe misaligned perceptions between student and supervisor. And I always promised myself that I would never treat students like my supervisor treated me. Anyway, this dude is one of the first students I have, so I'm also unexperienced. And the previous ones were all excellent and I felt like I never had to even manage them.\n\n**What I'm perceiving as the supervisor:** I've got a master thesis student who's not working well. He's perennially living in a parallel fantasy world and not really responsive. He does not communicate not even when directly questioned, let alone when he's working on his own even if told \"the first istant that you get stuck contact me\". In July I started telling him \"you should be finishing the first draft of the thesis, with some place holders for results we're waiting for by August 31st. And there's the summer break, it's already a bit late\". He kept saying \"I'm about to finish the chapter\" and never sent anything if not very late, like introduction by 10 september, methods by 1st of october... In 4 days he needs to have the final manuscript and he sent 2 days ago the biggest chapter and... it's unreadable in style and it reads like he didn't understand what he did. I'm sure he did understand something, even if I'm not 100% sure as he didn't talk. \n\nHis university supervisor (I'm the external lab one) said that this thesis is unacceptable and we're \"pondering the options we have\".\n\n**what I've perceived as a student 15 years ago**. I gave my first draft of the thesis 3 months before the deadline to my supervisor I didn't get any feedback. He kept dragging me on, and complaining about me not doing my part while he wasn't reading what I wrote nor giving feedback... When I put together something badly written and sent it to the senior supervisor he said it was unacceptable and I had to graduate at a later session. \n\n\nSo... How do I know \" *who's being wrong* \" today? Because of course I would think that I'm the one working 100% correctly in all situations\n\nedit: The thesis is an european MsC one, so a 10 months project from day 1 to thesis submitted. Not a 4 years PhD one, where of course it makes sens to have very different deadlines",
  "author": "lucaxx85",
  "created": 1634368483,
  "updated": 1636172311,
  "over_18": false,
  "upvotes": 118,
  "upvote_ratio": 0.97,
  "comments": {
    "hgukaeg": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgukaeg/",
      "text": "I had a doctoral committee member nearly not sign off after my defense, even though I made all the changes they recommended in the weeks and months prior. My supervisor talked them into it; I got lucky. Now I've got tenure, publish regularly, and have just started to get over the self-esteem hit after over a decade. \n\nThe committee needs to communicate to the student just how important these steps are, what can happen if they aren't met, and how well the student is meeting them.",
      "author": "AerosolHubris",
      "created": 1634383094,
      "upvotes": 98,
      "replies": {
        "hgukh0o": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgukh0o/",
          "text": ">I had a doctoral committee member nearly not sign off after my defense, even though I made all the changes they recommended in the weeks and months prior.\n\nWhy wouldn't one sign if you did everything that was asked? Were you asked something else that didn't get communicated to you clearly?",
          "author": "lucaxx85",
          "created": 1634383234,
          "upvotes": 26,
          "replies": {
            "hgukopo": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgukopo/",
              "text": "No. This committee member was actually more thorough in their suggestions than even my supervisor, and I took every one of them. I still don't know why, though in retrospect I suspect it was their own lack of experience and them wanting to be harsh early in their own career.",
              "author": "AerosolHubris",
              "created": 1634383395,
              "upvotes": 33,
              "replies": {
                "hgvik07": {
                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvik07/",
                  "text": "I also added one person who actually cared to my committee, a MacArthur genius, I assume she was the only one to read it. I was thankful for her comments and also very scared because I knew she wouldn’t rubber stamp it.",
                  "author": "GetCookin",
                  "created": 1634401503,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hguqv8d": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hguqv8d/",
      "text": "It’s not too late to suggest that the student ask for an extension. I had a family emergency during the month that my MSc thesis was due (a 1-year masters program), and I received a month long extension. It absolutely would not have been a readable/acceptable thesis had I turned it in at the original deadline. \n\nAlso I disagree with any commenters saying that you were responsible for holding the student to any internal/informal deadlines. Maybe during a US PhD with program-required deadlines, you might be responsible for setting consequences for missed deadlines. But on a European style taught or research MSc it’s my understanding that the final thesis deadline (and any soft internal deadlines) is mainly the student’s responsibility.",
      "author": "crunchycyborg",
      "created": 1634387675,
      "upvotes": 28,
      "replies": {}
    },
    "hguwcrp": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hguwcrp/",
      "text": "What you need to do:\n\nProvide guidance \n\nProvide information they may not have\n\nProvide support\n\nWhat they need to do:\n\nWrite\n\nMeet deadlines\n\nDo the research\n\nThey are walking a new path, one you know because you have been down it before. Your role is to give them a map, point out any pitfalls or known issues, and help pick them up after they fall. \n\nThey need to walk the path. \n\nYou gave them guidelines and pointed out pitfalls. They wandered off the map and now need help to get back on track. \n\nYou can help them by not being harsh, but still giving criticism. Point out that the paper is not submit able as is and show them how to request an extension. Talk them through what the paper is missing. Get them back on track. \n\nBut this issue is their fault. You should apply lessons learned to the next student. Don’t hint to this one that you have any blame. Maybe next time provide more guidance or ask for more deadlines.",
      "author": "Arentanji",
      "created": 1634390847,
      "upvotes": 26,
      "replies": {}
    },
    "hgv8vb5": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgv8vb5/",
      "text": "I just want to say, as a grad student, that I love seeing your interest in being a better supervisor and considering your role in the problem.\n\nI know you said he is really not communicating at all, but I wonder if you asked to meet with him to chat, if you could just kind of check in on him as a person. I’m not saying it’s your responsibility to make him tell you why he’s struggling, but if he’s got something going on maybe he doesn’t feel he has someone to turn to in the program to talk about it. If he can explain what is going and and what he feels is holding him back, you can begin addressing those barriers as a team and move forward with the project. I might just be projecting though lol.",
      "author": "3kittymeow",
      "created": 1634397157,
      "upvotes": 15,
      "replies": {
        "hgvfamn": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvfamn/",
          "text": "Agreed. I'm a postdoc and this is the biggest thing I appreciate now between my current boss and former advisor. My current boss is kind and understanding but tries to support me, though he's rather hands off as far as lab stuff goes. My former boss was completely uninvolved, never went into lab, but very demanding. The support makes a world of difference, both for my research and mental health.",
          "author": "DrSpacecasePhD",
          "created": 1634400061,
          "upvotes": 4,
          "replies": {}
        },
        "hgvljx5": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvljx5/",
          "text": "> I know you said he is really not communicating at all, but I wonder if you asked to meet with him to chat, if you could just kind of check in on him as a person\n\nI'm an extreme introvert and I'm super bad with reading social signals. I don't think I'm good at that. \n\nBut I did try putting myself out and telling repeatedly how he could contact me over multiple channels, asked him questions when he was not contacting me for multiple days etc... And tried to stress him as little as I could",
          "author": "lucaxx85",
          "created": 1634402833,
          "upvotes": 3,
          "replies": {
            "hgvuas2": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvuas2/",
              "text": "If you would like to get better at the social side of things, I would really recommend doing workshops on communication, active listening, conflict resolution, leadership, and motivational interviewing.\n  \nTeaching is unfortunately not a competency academics are trained for despite the fact it is a huge part of their role. Despite who might be wrong in this situation, if you can recognize your communication is poor, then it must be part of the issue.\n  \nEvery student is unique and at different stages of their development. Some students are great, know what they want, and can organize themselves independently. Other students have anxiety, or depression, or chaotic personal lives, or are just legitimately in over their heads. To be an effective mentor, it is a valuable skill to be able to recognize these kinds of red flags and have a sense about how to approach people and encourage them to open up so you can make the best possible decisions with them.\n  \nIf you want to know more please let me know! I did a lot of training on this because I used to manage some residence buildings at my school and would regularly meet with young students who struggled with the transition to post-secondary.",
              "author": "PM_ME_A_ONELINER",
              "created": 1634406550,
              "upvotes": 3,
              "replies": {
                "hgx0vkm": {
                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgx0vkm/",
                  "text": "I don't know... I'm about to start going to therapy (just trying to find out who and where among a couple of options) because I'm 100% not in control of my emotions/anxiety in my private life. \n\nAnd I also had lots of bad experiences in the past with these kind of workshops that I felt were teaching me from above because they knew better, and they were all based on asking me to do the things that made me the most uncomfortable. So I never felt like they gave me a way to improve at all. As I'll transition to tutor many more students the next academic year, I'll study the options I have.",
                  "author": "lucaxx85",
                  "created": 1634425266,
                  "upvotes": 4,
                  "replies": {
                    "hgxq8gd": {
                      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgxq8gd/",
                      "text": "I am sorry you had such a bad experience, but I would love to know more about what made you uncomfortable. \n  \nThat is great news though that you are finding support for yourself. Academia is already so challenging and to have to also manage your own health can sometimes feel impossible. Therapy, anti-depressants, and mindfulness have been fundamental in my recovery so I hope you find success as well.\n  \nIf you have questions about ways to communicate or navigate strategies to engage with people, please send me a PM. I really like talking about communication and would love to share my insight.",
                      "author": "PM_ME_A_ONELINER",
                      "created": 1634437396,
                      "upvotes": 2,
                      "replies": {
                        "hgys1go": {
                          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgys1go/",
                          "text": "I suffer *a lot* of embarassement by proxy. So \"pretend situations\" give me huge anxiety. I cringe watching others do that. And I mean *a lot*. Being told how to communicate is a terrible concept for me. Especially given that the way it's explained and the way \"it's supposed to be done\" are the ones that make me most uncomfortable. And it's all based around concept that I'm not sure are really scientic, they just sound made up. And they all talk about things I don't understand and \"reading the other\" like one is just able to do that.\n\nAlso, in general I'm not comfortable \"engaging\" people. If I'm asked to speak I'll tell you all about my passion, hoping that you can get motivated by hearing why I love this. But there's no way I'll act first to try to motivate you. That's not how I work.\n\n>Therapy, anti-depressants, and mindfulness have been fundamental in my recovery so I hope you find success as well.\n\nEspecially as someone working in molecular biology... Don't anti-depressant and drugs scare the shit out of you? Do you trust them? They're a deal breaker for me... (I've done statistics and modelling in a neuroscience team for 7 years and it only made me more skeptical). But I don't use *any* psycoactive substance whatsoever",
                          "author": "lucaxx85",
                          "created": 1634462514,
                          "upvotes": 1,
                          "replies": {
                            "hh00zle": {
                              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hh00zle/",
                              "text": "This is hard to respond to just because I think we have some fundamental differences of opinion on some of these topics.\n  \nI think therapy will be a real eye-opening experience. It really helps build up an intuition about your own internal mental and emotional health.",
                              "author": "PM_ME_A_ONELINER",
                              "created": 1634488192,
                              "upvotes": 1,
                              "replies": {}
                            },
                            "hh8d2ah": {
                              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hh8d2ah/",
                              "text": "> Especially as someone working in molecular biology... Don't anti-depressant and drugs scare the shit out of you? Do you trust them?\n\nYou don't need to have drugs for therapy at all. Psychology has progressed a lot in recent years. Depending on your mental health state, you can have completely drug free talk therapies, where they use things like structured CBT (taking advantage of neuroplasticity) to help change your brain's behaviours (and in turn, the way your brain reacts to stimuli in thoughts and emotions). Saying this as both a psychology PhD student and someone who got therapy. (I recommend going to a psychologist rather than just generic psychotherapists though.)",
                              "author": "valryuu",
                              "created": 1634651203,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hguvr4l": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hguvr4l/",
      "text": "Based on what you said, you've clearly communicated with the students on what he had to do and the resources / help that he had so if it's anyone's fault it should be the student's. Some people suggested maybe the student had personal reasons for his poor performance, be it family matter or health matter, but if these were indeed true, it was up to the student to communicate them with the supervisor. I feel like you've done everything you could, if the student refused to do what they were told, there really wasn't much that you could do as a supervisor.",
      "author": "SubcooledBoiling",
      "created": 1634390513,
      "upvotes": 10,
      "replies": {}
    },
    "hgujchn": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgujchn/",
      "text": "Sorry to say this but I think you've handled this poorly. You clearly know the student's attitude and mentality. You gave him deadlines (which were already very generous/late) and he completely missed them. You then left him to his own devices without using any authority to push him forward or hold him accountable to those deadlines. The decision should have been made months ago whether there's a viable thesis there and whether an extension request was required/possible. Getting into the last week before submission and not having seen the entirety of the thesis in some form is really bad.\n\nOn the other hand, some students may well be a lost cause and you can only do so much before it's their own responsibility to pass or fail.",
      "author": "Broric",
      "created": 1634382352,
      "upvotes": 62,
      "replies": {
        "hguk6xm": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hguk6xm/",
          "text": "> then left him to his own devices without using any authority to push him forward or hold him accountable to those deadlines.\n\nWhat should I have done? (actually asking). Interested because I've been super lucky till now but I guess problematic/just suboptimal students do happen. \n\nI kept telling him what the \"internal deadlines\" were and told him to drop everything and just write. By internal deadlines I mean \"if by Oct 19 we need to have the final manuscript then chapter 1 draft should be ready by the first week of August\". What else can I do? Also, due to covid he was coming in just once per week, I can't go look what he's doing at home.",
          "author": "lucaxx85",
          "created": 1634383022,
          "upvotes": 37,
          "replies": {
            "hgukpe0": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgukpe0/",
              "text": "It’s tough (and I got the impression you’re not his main supervisor?). There needs to be a decision made at some point about whether a submission is realistic and that should have been a few months ago. “Get us x,y and z by this date so we can make a decision on whether you submit or not”. If he doesn’t then it’s on him, if he does and it’s crap you have time to work on it with him.",
              "author": "Broric",
              "created": 1634383409,
              "upvotes": 32,
              "replies": {
                "hgum6da": {
                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgum6da/",
                  "text": "First I need to make it clear that this is an european style master thesis (10 months from day 0 of work to thesis submitted). So much, much shorter deadlines than a PhD!!\n\n>and I got the impression you’re not his main supervisor?\n\nDepends on the definition. I'm the one responsible for supervising him day to day in the lab (of a research institute and not university) he's been assigned to. So the one who's actually seen him and supervised him. But I'm not the senior internal in the university who's going to \"mainly sign the approval the thesis\" (we both sign actually)",
                  "author": "lucaxx85",
                  "created": 1634384491,
                  "upvotes": 22,
                  "replies": {}
                },
                "hgv72j8": {
                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgv72j8/",
                  "text": "> Get us x,y and z by this date so we can make a decision on whether you submit or not”\n\nThat doesn't really work in the EU / UK system though. Supervisors have no say on when or if students submit theses. Supervisors guide students through the process, but the thesis submission is a hard target and deadline required by the university. You don't just 'not submit' because your supervisor said you couldn't.\n\nFor a research degree the only sign off a supervisor does is to confirm whether it's their work or not.",
                  "author": "OrbitalPete",
                  "created": 1634396295,
                  "upvotes": 9,
                  "replies": {
                    "hgvbvge": {
                      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvbvge/",
                      "text": "I'm in the UK. We absolutely can STRONGLY advise a student that their thesis is not passable and that they need to request an extension and then support them in that request. At the end of the day it's their choice if they disagree and ignore the supervisor and submit prematurely.\n\nAll our students got extensions this year (with COVID and WFH being the mitigating circumstances). Some would not have passed if we'd made them submit on schedule.",
                      "author": "Broric",
                      "created": 1634398566,
                      "upvotes": 9,
                      "replies": {
                        "hgvu2kj": {
                          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvu2kj/",
                          "text": "An extension is only going to come with extenuating circumstances,  not simply from not being up to scratch.\n\nYes,  covid is a special example here,  although covid mitigations for this year's M level students generally had to be applied for in the early summer at latest in the institutions I supervise /cosupervise with.",
                          "author": "OrbitalPete",
                          "created": 1634406447,
                          "upvotes": 2,
                          "replies": {
                            "hgvuehm": {
                              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvuehm/",
                              "text": "Not sure if you missed it but the past year or so we’ve had a little global pandemic… I assume that’s led to students not being on campus, no access to labs, no (or limited) office hours, no access to library or other resources, etc.",
                              "author": "Broric",
                              "created": 1634406595,
                              "upvotes": 2,
                              "replies": {
                                "hgwgube": {
                                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgwgube/",
                                  "text": "I can only imagine that you only read the first part of my response.\n\nThere is nothing in the OP that suggests covid was a central factor here.",
                                  "author": "OrbitalPete",
                                  "created": 1634416258,
                                  "upvotes": 2,
                                  "replies": {
                                    "hgwi7xh": {
                                      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgwi7xh/",
                                      "text": "I didn't say COVID was a factor, I said it meant anyone who's asking for one is getting an extension as it's counting for \"mitigating circumstances\" whether it really was or not. Also, we work completely the opposite. You can only apply for an extension when close to finishing (in my view, that's far too late to plan properly but that's academic bureaucracy for you).",
                                      "author": "Broric",
                                      "created": 1634416854,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hgul5p7": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgul5p7/",
              "text": "Uhh.. actually demand to, and then look at the thesis at those \"internal deadlines\"? And then you tune leeway you give them, as per the responsibility they display in sticking to their word.",
              "author": "chloeia",
              "created": 1634383746,
              "upvotes": 15,
              "replies": {
                "hgvqw6k": {
                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvqw6k/",
                  "text": "And when you demand to see it and it's a blank sheet of paper...then what?\n\nThere aren't any actual consequences that you can impose here...",
                  "author": "queue517",
                  "created": 1634405101,
                  "upvotes": 2,
                  "replies": {
                    "hgvtl1a": {
                      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvtl1a/",
                      "text": "Well of course there are total lost causes. OP here is asking how they can do a good job of being a mentor who can be good at it and manage to help out someone who just hasn't got it all figured out, but isn't a absolute waste of time.",
                      "author": "chloeia",
                      "created": 1634406234,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hgvh002": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvh002/",
          "text": "I cant help but feel that you are making it seem like it's OP's responsibility to hold the student's hand and push him toward the thesis completion. Once the student has been given their deadlines, its up to them and that's it. If they dont communicate, well, they cant really be helped. And even if they were communicating - deadlines are deadlines, if you cant meet them, you have to try and work out a solution before, not after...",
          "author": "LawnmoverJockey",
          "created": 1634400810,
          "upvotes": 6,
          "replies": {
            "hgvhm2v": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvhm2v/",
              "text": "I mean, it is to some extent. Like I’ve said multiple times, at the end of the day some students just can’t be helped however much you try but “here’s the deadlines, see you in 3 months” isn’t a good approach either. If at regular check-ins every internal deadline is missed and there’s nothing substantive produced, you don’t leave it to the final week to see what they have. It’s a bit different if there were no checks being conducted at all but the student here seems like they are (meant to be) giving in chapters before submission for feedback.",
              "author": "Broric",
              "created": 1634401088,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "hgviks4": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgviks4/",
          "text": "I did my bachelor, masters and PhD in Europe and I strongly disagree with that. Students starting their bachelor's are usually 19 years old. By their last year of master's when they're expected to do the majority of the lab work and to write their thesis, they are 23. They are adults and they had 4 years to understand that their education is their personal responsibility, that deadlines exist and have to be met and that submitting work of unacceptably low quality will result in them not passing. It is not the responsibility of the supervisor or the university administration to handhold them. If the deadlines were communicated to them and they didn't meet them, then it's on them. Leaving an adult to their own devices is a perfectly valid thing to do, I would think.",
          "author": "yoreh",
          "created": 1634401514,
          "upvotes": 4,
          "replies": {
            "hgvj4k9": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvj4k9/",
              "text": "A PhD is training. What training do you receive if you’re told to just get on with it? I’ve had excellent feedback from world-leading experts on work I’ve done which has change my perspective on the good and bad ways to do things. A PhD (or research masters) is not about passing, it’s about being trained to be a competent scientist and is a two-way relationship.",
              "author": "Broric",
              "created": 1634401761,
              "upvotes": 4,
              "replies": {
                "hgvlxv7": {
                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvlxv7/",
                  "text": "I think you're conflating PhD with masters. Master's in continental Europe is often a more advanced bachelor's thesis, especially when the student has no intention of continuing to do PhD after that. From OP's post it seems pretty clear that he tried to communicate with the student and establish a two-way relationship, but the student didn't reciprocate.\n\nEdit: to expand on the MSc/PhD difference. There are plenty of students that do Master's because they want the degree, but don't want to be trained as a scientist. They take their courses, do the thesis work that is required of them and that's it. I get the impression that you're assuming that the OP's student treated their work as serious research and training, and as prelude to a PhD but there is no indication of that.",
                  "author": "yoreh",
                  "created": 1634403007,
                  "upvotes": 6,
                  "replies": {
                    "hgw0i96": {
                      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgw0i96/",
                      "text": "It's important to remember the different options in master's degrees in Europe though. My country has industry-focused 1 or 2 year programs, programs with a mixed industry/research focus and also very research (PhD as next step) focused programs, and I know several other European countries have similar systems. So this student can be in any of those and we have no way of knowing what they want out of the program",
                      "author": "HaircutRabbit",
                      "created": 1634409244,
                      "upvotes": 4,
                      "replies": {
                        "hgw2ekm": {
                          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgw2ekm/",
                          "text": "Yes, exactly, which is why making a definitive statement that OP failed in supervising the student is unwarranted.",
                          "author": "yoreh",
                          "created": 1634410051,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgv4wup": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgv4wup/",
      "text": "There seem to be very significant differences between what you’re experiencing now and what you experienced fifteen years ago. \n\nYou say that you turned in a draft of your thesis and never received feedback on it. That’s either a failing of your supervisor (most likely case) or it’s a situation in which he gave you feedback and you didn’t take it as such. \n\nBut in this case, you’re saying the student simply hasn’t been turning things in. Did you provide feedback on the introduction and methods when he did send those (if I’m reading your post correctly)?\n\nIf you’ve made sure he knows the deadlines, made yourself available, and provided feedback when asked, then you have done your job. You can’t write the thesis for him, and you can’t force him to turn things in.",
      "author": "EconGuy82",
      "created": 1634395264,
      "upvotes": 6,
      "replies": {
        "hgvgjad": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvgjad/",
          "text": "I feel like a lot of ppl are missing the point of what it means to be a master's thesis supervisor. You provide counsel and guidance, your responsibility is to respond to the questions the student poses and notify them of their mistakes. But of course the students have to communicate and ask first... This is not primary school, or even high school, this is university. In my opinion, OP's responsibility ended the moment he told them of the deadlines... The rest is up to the student",
          "author": "LawnmoverJockey",
          "created": 1634400605,
          "upvotes": 6,
          "replies": {}
        },
        "hgvni58": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvni58/",
          "text": "Well, the thing is that **I feel** that back then I did everything correctly. But maybe I was just perceiving this due to miscommunication",
          "author": "lucaxx85",
          "created": 1634403681,
          "upvotes": 1,
          "replies": {
            "hgx899t": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgx899t/",
              "text": "That’s possible. Sometimes students fail to understand the feedback they’re given. But that doesn’t really change things here. You still seem to have fulfilled your obligations to this student. If he can’t meet deadlines, then that’s on him. Some students aren’t cut out for grad work, regardless of the qualify of their advisor(s). It’s not for everyone.",
              "author": "EconGuy82",
              "created": 1634428722,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgvee80": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvee80/",
      "text": "I don’t know your system well enough to advise on the details, but in general, this student is not you, and applying your personal experience to this situation may help you be more compassionate, but should not skew your judgement. The student has obviously failed to do what they need to do to graduate at this time. The only question now is what can and should be done about it.",
      "author": "bigrottentuna",
      "created": 1634399672,
      "upvotes": 3,
      "replies": {}
    },
    "hgvf4fo": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvf4fo/",
      "text": "Firstly, I would say, don't compare your experience as a student to your experience as a supervisor. It's like comparing apples and oranges. That's one of the most common mistakes supervisors do. \"When I was a student...\" is the wrong frame of reference to follow.\n\nSecondly, I would highly recommend that you have a meeting with your trainee to understand what they want out of this masters, why they haven't been able to perform and what could help them perform better. Unless they are being arrogant about it, it's very much possible that they are not able to perform due to anxiety. Covid has really messed up people's mental states and I have no idea if this person has had any issues recently.\n\nAlso consider if your trainee comes from a different culture. There can be cultural differences stopping them from communicating with you. I have personally experienced that. \n\nFor your training as a supervisor and for the future of this trainee, I hope you can both reach a suitable conclusion.",
      "author": "shekyboms",
      "created": 1634399989,
      "upvotes": 3,
      "replies": {}
    },
    "hgumync": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgumync/",
      "text": "Could the student have ADHD/other mental health issues that makes them behave the way they have done?",
      "author": "Melodic-Plankton-896",
      "created": 1634385055,
      "upvotes": 6,
      "replies": {
        "hguo52o": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hguo52o/",
          "text": "I shouldn't be making a call as I'm by far not trained in this. Anyway, he's got like maybe 30% of the typical symptoms of an ADHD but I wouldn't bet on it.\n\nNonetheless, he's still responsible for meeting deadlines. *Especially* in the last work-like experience he'll have before having to find a job",
          "author": "lucaxx85",
          "created": 1634385889,
          "upvotes": 16,
          "replies": {
            "hgup97a": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgup97a/",
              "text": "> he's still responsible for meeting deadlines\n\nYes. Don't underestimate the student's responsibility for doing their work. It's their job to do their job. If the supervision is adequate but the results are lacking, it's on the student. And of course you are responsible for supervising adequately.",
              "author": "rauhaal",
              "created": 1634386648,
              "upvotes": 13,
              "replies": {}
            },
            "hgvaxgx": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvaxgx/",
              "text": "From personal experience, the lack of communication and the late deadlines may be a sign of high anxiety rather than ADHD. When I get overwhelmed, I have a tendency to hit shut down mode and start avoiding everything. \n\nIn my case, one of my advisors was at least a partial cause -- his constant nit-picky criticisms took the form of \"academic negging\" that made me physically ill ever time I even checked email. That was not his only issue though. We had a very poor relationship and I almost had him removed from my committee.\n\nAs you said, that doesn't excuse him from deadlines, but those behind-the-scenes dynamics and how they affect a student's performance might be something to consider.",
              "author": "sheath2",
              "created": 1634398131,
              "upvotes": 4,
              "replies": {
                "hgwd5pv": {
                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgwd5pv/",
                  "text": "Anxiety is actually one one of the symptoms of ADHD, so its not an either-or .",
                  "author": "AnthroPluto",
                  "created": 1634414656,
                  "upvotes": 1,
                  "replies": {
                    "hgwe2b6": {
                      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgwe2b6/",
                      "text": "You're right; they're often co-morbid. But I was responding to OP's statement that the student didn't seem to fit the criteria for ADHD as they understood it. Anxiety could still be a possibility even if ADHD is not.",
                      "author": "sheath2",
                      "created": 1634415054,
                      "upvotes": 1,
                      "replies": {
                        "hgwjiuv": {
                          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgwjiuv/",
                          "text": "I get where you are coming from, but lack of communication and late deadlines (especially due to executive dysfunction) are very common signs of ADHD. Just because you have anxiety and also experience this does not rule out the potential that somebody else has ADHD. \nThough, we are not in a place to be diagnosing the student in either case.",
                          "author": "AnthroPluto",
                          "created": 1634417413,
                          "upvotes": 1,
                          "replies": {
                            "hgwltb1": {
                              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgwltb1/",
                              "text": "I feel like you're misreading me. I didn't say the student didn't have ADHD -- that was the OP's comment. What I said was that even if it wasn't ADHD that something like anxiety might explain the students behavior instead. I was trying to offer alternatives so that hopefully OP wouldn't dismiss mental health as a contributing factor.\n\nAnd no, we're not in the position to diagnose, but at least in the US, as faculty we MAY be in a position to refer students to disability services for testing so that they CAN be diagnosed and appropriate resources given.",
                              "author": "sheath2",
                              "created": 1634418422,
                              "upvotes": 1,
                              "replies": {
                                "hgwp35a": {
                                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgwp35a/",
                                  "text": "Yeah you're right, sorry. I just re-read the thread and I mistook OPs post and thought you were arguing with him. You did say that lack of communication and missing deadlines may not be a sign of ADHD, which I was arguing against and got carrier away in. \nI'm fully on board with what you're saying. There are so many misconceptions about ADHD, and the mainstream understanding by the general public is generally grossly simplified (likewise with anxiety). \n\n It sounds like the student in this post would be much better served with a supportive approach that tries to understand the underlying issues, with the potential of help through disability services or other resources.",
                                  "author": "AnthroPluto",
                                  "created": 1634419885,
                                  "upvotes": 1,
                                  "replies": {
                                    "hgx9egl": {
                                      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgx9egl/",
                                      "text": "Agreed on all points. I really think we need better mental health awareness, particularly in higher education. I teach first- and second-year composition. I usually see 3-4 kids a semester who are struggling with mental health, and I've had more than one crying during office hours. Most of them don't even recognize the signs well enough to reach out until it's too late and they're struggling academically. I wouldn't have recognized the anxiety myself if a good friend hadn't pulled me aside and told me \"Uh, wanting to puke when you check email is not normal...\"",
                                      "author": "sheath2",
                                      "created": 1634429253,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgvfrzo": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvfrzo/",
      "text": "Hey! i have shared my thoughts on the subject in a PM to you. In short - you have objectively done what you can, it is up to the student to write the thesis, ask the questions and communicate. If they do not do that, there is nothing for you to do. It is not like they have given you a well written and thought out thesis just days before the deadline, they have done no work and are (very poorly) attempting to salvage their thesis now. Some students you just can not help. And to be honest - it might be best for them if you fail them now, so they learn the consequences of their actions before it costs them much more later in life.",
      "author": "LawnmoverJockey",
      "created": 1634400269,
      "upvotes": 2,
      "replies": {}
    },
    "hgvihdo": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvihdo/",
      "text": "I think it's fair to look at your own experience and ask if the student will eventually look back and perceive this year as one in which they were let down. However, it sounds like they are letting themselves down. We don't get into post grad programs without having some level of potential. I would hope that the student met the minimum requirements and was selected for this, versus getting in by merit of applying. I know that's a thing too. Since they are not meeting requirements, I have to wonder what else is going on in their lives? Is this one of those self discovery things where they are about to walk away from it all to live on hiking trails and sell pot to tourists? Or are they struggling with mental health issues and thoroughly self sabotaging? No matter how many times you tell me to ask for help, if I'm in a bad place, I'll never say a word. It's a thing and it's part of many disorders. Or, maybe the student just isn't into it any more and is biding time til the money runs out. It sounds like there are two supervisors involved here, so I'd maybe set a time to sit down with all three of you and maybe someone from OEA or mental health, just to be certain that whatever does come out, you have a subject matter expert that can provide appropriate resources on the spot.",
      "author": "SemanticBattle",
      "created": 1634401470,
      "upvotes": 2,
      "replies": {}
    },
    "hgvkxhs": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvkxhs/",
      "text": "I would guess that the student is dealing with some pretty serious anxiety and/or depression and is likely not working very much (if at all at all) and then rushing things out last minute—you might need to scaffold for them with very explicit instructions and frequent check-ins, essentially forcing progress to be fine grained but making it feel more manageable for them",
      "author": "dcnairb",
      "created": 1634402557,
      "upvotes": 2,
      "replies": {
        "hgvltd3": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvltd3/",
          "text": "I'm generally anxious and I've struggled with anxiety so I try to understand that in others as much as I can. He does seem socially awkward/socially anxious... But not currently struggling with anxiety. At least not giving out any signal",
          "author": "lucaxx85",
          "created": 1634402951,
          "upvotes": 1,
          "replies": {
            "hgvu93v": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvu93v/",
              "text": "idk, is not sending any updates and rushing a chapter out last minute not a signal?",
              "author": "dcnairb",
              "created": 1634406529,
              "upvotes": 2,
              "replies": {
                "hgx09gq": {
                  "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgx09gq/",
                  "text": "He always seems super relaxed and cheerful whenever he comes in person (at least once per week. And we sit in the same room the whole day and eat together) . Doesn't give any anxiety \"vibes\".",
                  "author": "lucaxx85",
                  "created": 1634424984,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hgvyhd3": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvyhd3/",
      "text": "I feel bad for your student. He sounds like he's struggling with mental health issues. (talking from my own experience as a student.)\n\n&#x200B;\n\nEdit: typo",
      "author": "Mylaiza",
      "created": 1634408396,
      "upvotes": 2,
      "replies": {
        "hgvziu7": {
          "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvziu7/",
          "text": "Why for students *plural*? I strive to do my best and I'm trying to see if I can do better for the first one who's under performing...",
          "author": "lucaxx85",
          "created": 1634408837,
          "upvotes": 1,
          "replies": {
            "hgw4zbd": {
              "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgw4zbd/",
              "text": "Sorry, that was just a typo.\n\nIt's a difficult situation for sure.",
              "author": "Mylaiza",
              "created": 1634411150,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgw3hgx": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgw3hgx/",
      "text": "IMO, identifying \"who is being wrong\" is a frivolous exercise that isn't helping anyone.\n\nA better thing to ask and wonder about is \"how do we make this right?\". (even if this may be too late to help this student, this thought exercise can help you with future students)\n\nThis could come in the form of clearly communicating the consequences if your student continues down this path and that your hands are tied if they don't meet their expectations, but also providing support in the way of more regularly scheduled check-ins (in person or live video, not just through email). More structured deliverables that are maybe more well defined than a full paper of a dissertation, like maybe an outline, or some charts, etc.\n\nYou may need to break down the process a bit more for this student.\n\nEveryone here can argue about responsibility or lack thereof but the end result is that student of yours doesn't pass. If you don't care if your student doesn't pass, then don't give this student a second thought, but if you want to be a better advisor, instead of arguing about what is whose responsibility, just do everything you can think of to help this student succeed.\n\nThis is my personal opinion, but if a student has failed, you have failed the student.",
      "author": "peregrin5",
      "created": 1634410507,
      "upvotes": 2,
      "replies": {}
    },
    "hgvf2ak": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvf2ak/",
      "text": "I appreciate many of the comments here. I just want to add, it's true you could have managed this a little more directly, but it's also kind and reasonable to give students a bit of leeway - they're adults after all. That said, it sounds like this student is in a rut, and the events of the past year or two have made things psychologically tough for many people, so it's understandable. It's also fair to say he's not \"you,\" so to speak.\n\nYou are not to blame. You are not being too harsh. However, it is definitely time to have him apply for an extension and to communicate that you set proper deadlines and he blew past them. It doesn't have to be the end of the world and if he or she reacts poorly, that's on them. I mean this in a kind way, but grad school is stressful and there's always the counseling center. They'll be OK.",
      "author": "DrSpacecasePhD",
      "created": 1634399963,
      "upvotes": 1,
      "replies": {}
    },
    "hgvta12": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgvta12/",
      "text": "What is your relationship to this? Like are you an external examiner? My reply is pretty blunt but please don't be insulted, I like to just talk about things pretty directly.\n  \nI think the student has accountability to their actions but I also think the supervisor has a lot of responsibility. A student getting this far with these many issues tells me their supervisor was probably disengaged. I would imagine if there was a supervisor who scheduled regular meetings, made real progress to connect with the student, and mentored them and encouraged them to take responsibility in their education, none of this would be happening.\n  \nThat being said, it is hard to expect supervisors to have this kind of insight because they aren't explicitly trained on how to recognize conflict and be able to communicate. Similarly, it is hard to expect young people to have the self-awareness to recognize the impacts of their behaviour and their need to address internal conflict.\n  \nAt this point I would probably start asking what the likelihood is of this student being able to produce acceptable work. If not and this student truly seems like they are in over their heads, it might be worth it to start talking to the graduate program coordinator about whether or not this student should be encouraged to leave.\n  \nBut if you believe this student is just struggling, it would also be worth it to discuss with the coordinator some kind of (very non-judgemental) meeting with the student to express tangible concern, give them the opportunity to open un about it, and then maybe look to do some kind of academic probation. I am not sure what the policies are like at his school, but I would ask about either suspension with the opportunity to enrole at a later date with the idea that the student uses the time to get themselves in a better place. I have also experience some situations where we have made a student's enrolment conditional on regular counselling meetings.",
      "author": "PM_ME_A_ONELINER",
      "created": 1634406101,
      "upvotes": 1,
      "replies": {}
    },
    "hgw02lu": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgw02lu/",
      "text": "My 2 cents: content itself might not even be the issue; rather he may need serious help with work habits. (What you've described is fairly consistent with adhd, but that's neither here nor there.) If you feel comfortable, ask him if he had a hard time with completing college papers. A tendency to procrastinate & write under time pressure won't kill you with structured essays for classes, but with something as selfdirected as a master's thesis, it can land one in serious trouble. If you sincerely want to figure out what's going wrong, I'd pursue that line of questioning with him. Let him know that you're 'on his team' (so to speak) and that you want to help him get over the finish line with a thesis he's proud of.",
      "author": "Serious-Telephone142",
      "created": 1634409062,
      "upvotes": 1,
      "replies": {}
    },
    "hgw8nzf": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgw8nzf/",
      "text": "Idk what the standard is for grad school where you are but where I am, the kid is basically up to their own devices. The only thing you should have done differently is told him earlier on that he probably wasn’t going to make it through the program. Sounds like you had an inkling for a while. Otherwise he’s an adult, you made the requirements clear, the ball was in his court",
      "author": "sophi529",
      "created": 1634412711,
      "upvotes": 1,
      "replies": {}
    },
    "hgv0cqu": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgv0cqu/",
      "text": "😭",
      "author": "Reddit_reader_2206",
      "created": 1634392952,
      "upvotes": 0,
      "replies": {}
    },
    "hgxqamn": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgxqamn/",
      "text": "Option C: Both were/are right.",
      "author": "Doctor_HowAboutNo",
      "created": 1634437426,
      "upvotes": 2,
      "replies": {}
    },
    "hgwxzje": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgwxzje/",
      "text": "I don't know anything about the student and their capabilities.  I do know that isolation and lockdown can hit some people a lot harder that others.  Your student exhibits pretty clear signs indicating he might very well be in a clinically depressed state.\n\nFrom your description, he appeared to be struggling greatly with motivation & task initiation; depression is in biological terms effectively a demotivating state which takes hold to prevent us from making a bad situation worse.  \"I'm about to finish the chapter\" is the timeless response of someone stuck in a rut, unable to grind through, but perhaps hoping a last minute burst of panic effort will emerge and push them over the finish line.\n\nYou said \"contact me the instant you get stuck,\" but if one's not getting anything done, they're not getting stuck, at least with anything within the instructor's job skill set. Reaching out and saying \"Hey, I'm doing nothing\" probably held an expected result of shame for this individual, as it would for most students, particularly one who'd pushed themselves all the way to a masters program.   And if one is depressed, it's entirely likely they lack the mental resources to keep themselves together in the face of an advisor's disapproval.  The lack of responses, even to direct emails, rings of classic avoidance as a coping strategy.\n\nSo if there's some sort of deferral/extension/resubmission process the school allows on mental health grounds, I'd obliquely mention that as an aside, and put the ball in their court.",
      "author": "S_Belmont",
      "created": 1634423934,
      "upvotes": 1,
      "replies": {}
    },
    "hgzabxk": {
      "link": "/r/AskAcademia/comments/q9717m/thesis_student_likely_not_getting_a_passing_grade/hgzabxk/",
      "text": "if you're on reddit and/or in Academia you're probably biased liberally\n\ndo not give a pass grade if not earned",
      "author": "Responsible-Idea-847",
      "created": 1634475772,
      "upvotes": 1,
      "replies": {}
    }
  }
}