{
  "sid": "crl637",
  "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/",
  "title:": "I am moving abroad (Italy to Netherlands) in 10 days for my master degree. Although I was extremely confident in this choice one year ago, I am now experiencing fear, extreme anxiety and great sadness. Did anybody of you go through something similar?",
  "text": "Hi, as the title says, I am really worried. I am afraid this was a bad choice, not because of the academia I am going to, but because I am losing family and friends behind. I am afraid, I don't want to go. Do you have any words of advice for somebody in this situation? Deep down I like the idea of traveling a little, seeing the world, going out of the comfrot zone, but right now emotions are running wild\n\n&#x200B;\n\nEDIT: thank you very much guys, sincerly. All your love and support truly helped me. I reached out with a close person I didn't spoke in a lot and that helped a lot too. I am still scared but in a more positive way. Thank you, truly, xx",
  "author": "Menesio",
  "created": 1566042450,
  "updated": 1634080945,
  "over_18": false,
  "upvotes": 169,
  "upvote_ratio": 0.98,
  "comments": {
    "ex6en6m": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6en6m/",
      "text": "Hey ! I moved halfway across the world from Singapore to England when I was 20 to do my Bachelor’s. I had no one there, and once the initial excitement wore off (within the 10 mins I moved into my dorm really), I cried. Very hard. \n\nI felt like I made the worst mistake of my life, I should have just stayed home. I have no friends or family. They are 8 hours away from me in terms of time zone and I couldn’t talk to them very often. I was very alone. And my mum already told me that because flight tickets are so expensive, I won’t be able to fly back more than once a year. \n\nI spent the first week in my room avoiding my flat mates. My door was always closed, I listened to people’s voices to know when it was safe to go to the common areas, I figured out everyone’s living patterns so I could avoid meeting them. \n\nThen after that, I realised. Am I having regrets ? Yea. Did I come all the way here to isolate myself and not make a single Friend ? Hell no. \n\nSo I opened my door when I’m in so my flat mates could talk to me. So I sat in the same room as them and watched TV together. I asked if I could go for dinner with them. And I made friends with them ! We went on to have the best 3 years of my life and let me tell you, if you let the fear paralyse you and you don’t make the effort to do what is needed to make your MSc years worthwhile, you would end up exactly like what you feared and end up hating it. \n\nIt’s okay to be fearful, it’s normal to be fearful. What matters most is that you learn to breathe and just put in tiny efforts to make friends. I did my MSc in Sheffield, a different city from my undergrad and I started from zero all over again. But it’s okay. Once you do it, you can always do it time and time again. \n\nIt would get better. Figure out some sort of FaceTime/Skype schedule with your family and friends, think about all the times you are going back to spend time with them. Make new friends and make the most out of your MSc years. You can do it !",
      "author": "freyari",
      "created": 1566044374,
      "upvotes": 122,
      "replies": {
        "ex6f7hu": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6f7hu/",
          "text": "Thanks mate. And congrants on your strength. I hope I'll be able to manage to do this :)",
          "author": "Menesio",
          "created": 1566044652,
          "upvotes": 21,
          "replies": {
            "ex6giiv": {
              "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6giiv/",
              "text": "You would be able to ! It’s normal to get incredibly homesick and get cold feet. You just have to remember it’s a phase that you have to will yourself to overcome and make friends. Once you have some friends in the country (while maintaining regular contact with your friends and family), it would get easier and you would enjoy your time. \n\nAnd remember, Xmas is only 4 months away. You’ll be home before you know it !",
              "author": "freyari",
              "created": 1566045291,
              "upvotes": 7,
              "replies": {
                "ex6i1xh": {
                  "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6i1xh/",
                  "text": "Thank you again :)",
                  "author": "Menesio",
                  "created": 1566046030,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ex6cno3": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6cno3/",
      "text": "Change is scary, even a good change. It’s totally normal to feel some last minute anxiety and uncertainty. And remember, if it’s really awful, you can quit and come back home. Sometimes it helps to have an exit strategy, even if it’s just to help you feel better about things right now.",
      "author": "GrandmaMabelGrey",
      "created": 1566043382,
      "upvotes": 24,
      "replies": {
        "ex6f0va": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6f0va/",
          "text": "Change is truly scary, it's true. And maybe without changing I'd have regretted staying home. Who knows. Thanks mate",
          "author": "Menesio",
          "created": 1566044561,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ex6f2rl": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6f2rl/",
      "text": "I moved from the USA to the Netherlands for my MA as well! I felt similarly - excited about this new adventure but also terrified by the thought of moving to a country where I had never visited, didn't know anyone, and didn't speak the language. I think that \"I don't want to do this\" feeling is a gut response a lot of people have before a major life event that involves a lot of unknowns. Remember that at this point it's easier to go along with the plan you've made, which you made for a reason, and see how it turns out. If you really give yourself time and still find it a miserable experience, you can take the steps to find a new path and shape the life you do want. I often find this Kurt Vonnegut quote helpful when embarking on new adventures: \"we have to be continually jumping off cliffs and developing our wings on the way down.\" Give yourself some time to develop these wings. DM me if you'd like to talk more about life in the Netherlands as a non-Dutchy! It's a lovely country to live in, and be sure to eat lots of stroopwaffel and bitterballen!",
      "author": "cdaviii",
      "created": 1566044588,
      "upvotes": 21,
      "replies": {
        "ex6fi6f": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6fi6f/",
          "text": "Nice words thank you very much. Are you still there?",
          "author": "Menesio",
          "created": 1566044799,
          "upvotes": 2,
          "replies": {
            "ex6g83h": {
              "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6g83h/",
              "text": "Nope, I moved back to the States after I graduated, but I'm hoping to go back and visit in the next few years!",
              "author": "cdaviii",
              "created": 1566045151,
              "upvotes": 3,
              "replies": {
                "ex6gdai": {
                  "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6gdai/",
                  "text": "Great!",
                  "author": "Menesio",
                  "created": 1566045221,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "ex6gx43": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6gx43/",
          "text": "I second the bitterballen. I wish that my PhD application to do my PhD in Netherlands went through xD",
          "author": "freyari",
          "created": 1566045484,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ex6jv9u": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6jv9u/",
      "text": "I moved from the states to Wales for my masters degree. I was terrified, but honestly it’s been the best decision of my life. The hardest part is actually leaving, your friends and family will still be able to talk to you and they will. The first week was hard, but I made an effort to go to any of the silly opening events, and talk to my flatmates, so I suggest the same. The department I was in had them as did the graduate school. You’ll adjust to your new norm. Just remember to breathe, I know it sounds silly, but just take in the fact you’ve had this opportunity and make the best of it. It’s scary for sure, but I promise you it’s worth it. ❤️",
      "author": null,
      "created": 1566046873,
      "upvotes": 10,
      "replies": {
        "ex6lp2l": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6lp2l/",
          "text": "Thank you very much for this :)",
          "author": "Menesio",
          "created": 1566047710,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ex6wr5i": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6wr5i/",
      "text": "Cold feet are normal I guess. But you got this and there's a 99.9% chance that it will be a positive and life-changing experience for you.\n\nI uprooted my family (wife, young son, and dog) from London to Denmark and then Hamburg for my MA, and I'm still in Hamburg three years later. Bless them all for their support. My wife and I were pretty sick of London anyway (I grew up there and my wife lived there for thirteen years) so shifting location was quite inviting for us .\n\nI'm a \"mature\" student, and have a family to support and be with, so there were several personal struggles connecting with my (much younger) fellow students at points but it worked itself out in the end. We have made plenty of friends (locals and expats/migrants) both in Denmark and in Germany and have both found plenty employment opportunities here in Germany (much easier than I would have back home). We were on a terribly low budget at first and any kind of funding to support me during the MA was scarce, but we survived by hook or by crook, and now, after settling in Hamburg for a while we are more or less comfortable. My son goes to a German school and pretty much mastered the language after a year (he speaks much better German than us!). \n\nIt was scary, it was a struggle (especially financially and finding accomodation, etc.), but we got there in the end and right now I can safely say we are really happy we made the choice to uproot. It has been a blast, and I think I can safely say that it will be for you, too. \n\nMaybe you are more rooted to your home country than I was when I made the jump (and the idea of going back to the UK at the moment, with the political and cultural climate there right now) just makes me shudder. We still left behind friends and family but we are never *that* far away, and regular contact is very simple to maintain.\n\nI think these are just last-minute nerves you're experiencing, but I suggest you overcome them and dive in head first.\n\nGood luck mate!",
      "author": "elymuff",
      "created": 1566052668,
      "upvotes": 11,
      "replies": {
        "ex6zlf2": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6zlf2/",
          "text": "Thanks mate!! you too :)",
          "author": "Menesio",
          "created": 1566053921,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ex7yjnn": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex7yjnn/",
      "text": "I’ve totally been there: moved from the US to Germany for a post doc. I was a mess beforehand. So much crying. So much fear.  I was leaving a year into a relationship with a great guy. My dad got sick a few weeks before the move, and he lives even further away (California adds another 5 hours onto a flight). Finding housing was intimidating. It was incredibly stressful. \n\nBut once I was there for a few months it was alright. Boyfriend was working odd hours so we could actually talk, my dads  surgery went well, I found a cool apartment for me and my cat, and I made some really good friends. Now, 8 years after leaving for Germany I’m marrying the guy, we live in a cool city in the US, and things are ok. You’ll be alright. Be open to the experience and ask for help and support when you need it.",
      "author": "calicliche",
      "created": 1566066449,
      "upvotes": 10,
      "replies": {}
    },
    "ex6ufiu": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6ufiu/",
      "text": "I moved across the US for my PhD. It was terrifying at the time, but it was the best decision I ever made. The great thing about grad school is that you have a cohort of peers, so it’s easy to meet new friends. Some of my best friends I met in grad school. Best wishes and good luck!",
      "author": "RadDadJr",
      "created": 1566051622,
      "upvotes": 6,
      "replies": {}
    },
    "ex83rcb": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex83rcb/",
      "text": "Something made you look for more in your life and abandon your comfort zone. If you choose to stay I guarantee you that \"thing\" is going to bug you for the rest of your life. In my case all my fears and insecurities disappeared THE MINUTE I landed in Europe. You will be in shock by your new life, you will have no time to process things emotionally. New people, new society, new foods, new traditions, new parties, new research environment. You will meet people in your same situation and you will have a lot of things in common with them. You will have a great time I assure you. You will grow psychologically. I wish you a great journey.",
      "author": "chiesazord",
      "created": 1566068361,
      "upvotes": 5,
      "replies": {}
    },
    "ex8h0im": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex8h0im/",
      "text": "I moved from Italy to the Netherlands for a PhD and, while of course I'm experiencing ups and downs, I have absolutely no regrets about it. The Netherlands is a very welcoming country and especially in a University environment you will be able to make a lot of new friends and connection.\n\nI was incredibly scared the few days before moving, and very emotional, it's totally understandable to get cold feet! \n\nOverall it has been one of the best decisions of my life :)",
      "author": "Polemarco",
      "created": 1566073194,
      "upvotes": 6,
      "replies": {
        "exawf5c": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/exawf5c/",
          "text": "thank you very much :)",
          "author": "Menesio",
          "created": 1566117495,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ex6x6zf": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6x6zf/",
      "text": "Hi! \n\nI understand what you are going through. I made the decision during my second year to do a year abroad, without even thinking about finances or whether I would be mentally up to it. \n\nI would be so anxious about all the formalities that I avoided applying for modules, finding accommodation and attending prep meetings. \n\nI know you have not specified any of this, but I want to emphasise that the best thing to do is to tell someone that you are really nervous/worried/anxious. \n\nI wish I had done this. I arrived in Krakow and I only lasted a week out there. I came back to the UK and had to withdraw from my 3rd year of study. I got a part time job and put myself together. That was over 2 years ago and now I am due to graduate. \n\nPlease talk to someone! I hid all my anxieties and I ended up having a breakdown abroad, in a place that I did not know too well. The best thing is to vent and share. I hid all my anxieties to the last moment. I do not wish to scare you, I just hope you tell your year abroad tutor or personal tutor, so that options can be discussed. \n\nWhat you are experiencing is completely normal when you’re about to study abroad, but if you feel like you are preoccupied by these anxieties, please talk to someone!",
      "author": "chughes33",
      "created": 1566052864,
      "upvotes": 5,
      "replies": {
        "ex6zjds": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6zjds/",
          "text": "> I would be so anxious about all the formalities that I avoided applying for modules, finding accommodation and attending prep meetings. \n\nThis is soooo true!!! I have been through this.\n\nI have been talking with some of my friends and tomorrow I'll talk with my mom. Thank you for your tips. Good luck with your graduation.",
          "author": "Menesio",
          "created": 1566053897,
          "upvotes": 2,
          "replies": {
            "ex8ez6s": {
              "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex8ez6s/",
              "text": "The hardest bit is confronting the things you’ve been avoiding, then it gets easier! \n\nI hope everything works out, I’m sure it will!",
              "author": "chughes33",
              "created": 1566072485,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ex72nf4": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex72nf4/",
      "text": "Hey, I live and study in the Netherlands (and I love Italy, but that's not the point here). I don't have any advice for you on this subject, I do want you to know that if you have any questions about Dutch culture, academia, or anything at all, I would be more than happy to help you out!\n\nOut of curiosity: mind sharing which university you will attend?",
      "author": "EditPiaf",
      "created": 1566055133,
      "upvotes": 5,
      "replies": {
        "ex73aco": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex73aco/",
          "text": "Hi! in fact that's helpful and I will pm if you don't mind :) I will study at the UvA!",
          "author": "Menesio",
          "created": 1566055388,
          "upvotes": 2,
          "replies": {
            "ex75fph": {
              "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex75fph/",
              "text": "I don't mind at all. Ah, Amsterdam! I study at the Rijksuniversiteit of Groningen, so from an Amsterdam perspective, that's near the world's edge, from an American perspective, I study \"near Amsterdam\", but I am not sure about the Italian view on this subject. The student culture is much the same though, as is the housing problem.",
              "author": "EditPiaf",
              "created": 1566056221,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ex77c21": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex77c21/",
      "text": "First of all, this Dutchie would like to welcome you to the Netherlands! It is absolutely normal to feel frightened. When I did fieldwork for my research in South Africa, I cried my eyes out the first day and I know a lot of people who did the same in a similar situation. Everything changes overnight; new country, new house, new university, new food, no friends and family around etc. Bút a lot of Dutch people are very welcoming, we speak a fair amount of English and you will not be the only international student at the UvA. I work at a business school where we have new excited and anxious international students every year and they all turn out fine. Start making your room personal as soon as you arrive, Skype with friends and family and start exploring the city. Before you know it, you will be busy with courses, hang out with new friends and telling toerists the quickest way to the Van Gogh Museum! All the best to you!",
      "author": "JFoudraine",
      "created": 1566056912,
      "upvotes": 5,
      "replies": {}
    },
    "ex8hk2i": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex8hk2i/",
      "text": "It is really, really common to feel the way you are. I personally have moved around in the US several times in my academic career and I've gone through the same arc of feelings as you. I recently had to again, and I was feeling the same apprehension when it came time to actually do it. My friend pointed out to me this time that I had the same complaints about not wanting to leave/feeling comfortable where I was currently when it came to the move. It was an eye opener for me because I had forgotten, and still can not remember not wanting to go. The mind forgets the fear after it passes.\n\nRemember that you sought this experience because for a lot of positive reasons. When it comes down to actually doing it, it is totally normal to feel apprehensive and sad. Leaving the comfort of \"home\" or you usual routine is emotionally disruptive. People are creatures of habit. It's okay to feel what you are feeling, but DO NOT let it stop you from doing what you have planned. Don't make any decisions based on your feelings at this time. DO let your feelings make you more prepared; like if you're nervous about being far from family, do your research on the best airports or train stations or driving route to be able to visit on holidays. DO NOT let your feelings decide for you if you are \"happy\" in your new position until you've given yourself enough time to create a new routine. This usually takes about a year.",
      "author": "dege369",
      "created": 1566073382,
      "upvotes": 6,
      "replies": {}
    },
    "ex6vvah": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6vvah/",
      "text": "I moved from the U.S. to Norway to pursue an education. What you are experiencing is so normal. Just remember, it's not forever. You can move back. And that feeling does fade as you get into study and make new friends.",
      "author": "minitrojanhottub",
      "created": 1566052270,
      "upvotes": 4,
      "replies": {}
    },
    "ex745zn": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex745zn/",
      "text": "I don't have any advice, because you're me from the future. In about a year I'll be moving from the US to the U.K. for my master's. \n\nGood luck to you!!",
      "author": "ArcticAlbatro55",
      "created": 1566055732,
      "upvotes": 5,
      "replies": {
        "ex8hg8c": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex8hg8c/",
          "text": "you too!!",
          "author": "Menesio",
          "created": 1566073342,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ex6vgjc": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6vgjc/",
      "text": "I don't have time to write a too long answer because I'm in the office (though it's Saturday, lol, PHD struggles), but I want to assure you that you won't regret it. No matter what your mind is telling you right now, this will be a life changing experience for you. Wish you best luck.",
      "author": "9december3",
      "created": 1566052084,
      "upvotes": 3,
      "replies": {}
    },
    "ex6w69x": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex6w69x/",
      "text": "I think it's normal to be afraid of such a great change, I moved from my countryside home to a big city half a country away I felt the very same. Keep in mind that not taking the chance would make you regret it it in the long run. in bocca al lupo! (Also, two years will pass so fast, it will feel more like a long Erasmus)",
      "author": "nutsaboutcats",
      "created": 1566052410,
      "upvotes": 3,
      "replies": {}
    },
    "ex7lzpd": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex7lzpd/",
      "text": "Welcome to our precious country.\nI cannot offer you my own experiences abroad, because I haven't (yet). However, I think it is very natural to have these thoughts. It's a big step out of your comfortzone, but that's only a small hurdle you need to cross! You'll gain so much (life) experience, stories and new friends! Don't be afraid of this, just by the mere fact you chose to go abroad this will happen! \n\nGet into social things with collegues first and join a club: sport, music, anything. Try to get out of Italy/home by not checking social media of your friends constantly, not calling home every night, etc. \n\nAnyway. If you happen to be in Rotterdam or Utrecht, I can meet if you want. And feel free to dm me for questions.",
      "author": "FugitiveFromHeaven",
      "created": 1566061969,
      "upvotes": 3,
      "replies": {
        "ex8hd6p": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex8hd6p/",
          "text": "sadly I'll be in amsterdam :(! thank you very much i'll pm you if i'll have questions!!",
          "author": "Menesio",
          "created": 1566073312,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "exaaxts": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/exaaxts/",
      "text": "I also had similar feelings before moving countries, but in my case I was travelling 18,000 km and knew I wouldn't see my family again for some years. \n\nRemember, Italy and Netherlands are quite close. You can make regular trips back home.",
      "author": "D49A1D852468799CAC08",
      "created": 1566103647,
      "upvotes": 3,
      "replies": {}
    },
    "exb1fi5": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/exb1fi5/",
      "text": "You're going to be fine. It's going to be a great adventure. You will make awesome new friends, and get to explore amazing new places. Home will be there when you get back, and your family is just a call away. :)",
      "author": "sinenox",
      "created": 1566120627,
      "upvotes": 3,
      "replies": {}
    },
    "exdhuon": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/exdhuon/",
      "text": "I completely sympathise with you - I felt the same way 8 months ago when I was accepted to do my PhD in NZ (from UK). I was so confident and excited and no negative emotions even dared enter my mind.\n\nNow I have been here for 3 weeks and I have experienced the anxiety, the fear, the regret that I made the wrong decision, the stress of getting on my feet in a new country so far away from home etc.\n\nEveryday is tough however I am here with my partner (which brings with it its own positives and challenges), we are feeling settled into our new home and feeling extremely grateful and blessed to have such a fantastic opportunity.\n\nYou have lots and lots of new challenges to face and these will make you a better person, a more accomplished academic and more stories to tell. Change is scary but people don't grow when they remain in their comfort zones! Enjoy the experience of living in this new place!\n\nAlso, in this day and age you can never truly leave people behind if they're important to you. I am 11 hours ahead of people at home and I have a schedule set up with my mum for Skype calls so I can speak to her (and see the dog) and I regularly keep in touch with other family members on WhatsApp.",
      "author": "CR-Aesthetics",
      "created": 1566177076,
      "upvotes": 3,
      "replies": {}
    },
    "ex7qgt2": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex7qgt2/",
      "text": "Big hugs to you! I do empathise and am also experiencing something similar. I am flying from Singapore to New York tomorrow (!!!) to pursue my masters and while I was initially really excited last week, today I've just been feeling completely anxious, scared, sad to leave my family and I just feel like vomiting the entire day. I don't know a single person in New York and it's such a huge city that I am honestly feeling scared whenever I think about having to make new friends all over again. Will love to be in touch and check in in a couple of weeks to see how things go for us! Hoping you find your footing in your new space soon! :)",
      "author": "squiffsquiddled",
      "created": 1566063557,
      "upvotes": 2,
      "replies": {
        "ex8h96i": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex8h96i/",
          "text": "good luck mate!!! have fun in the us!!!",
          "author": "Menesio",
          "created": 1566073274,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ex816xy": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex816xy/",
      "text": "Nope. Getting to experience new places as a local is awesome, and I feel that moving away has given me skills that people who spend their whole lives tethered to their parents and native place never develop. Also, Netherlands is really close to Italy and flights are cheap. You'll be okay.",
      "author": "thegreenaquarium",
      "created": 1566067420,
      "upvotes": 2,
      "replies": {}
    },
    "ex884dt": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex884dt/",
      "text": "You'll be fine :-)\n\nI can imagine how you feel right now. I spent several years at different universities in different countries pursuing an academic career. Every time I packed my bags, I felt the way you do right now. Every time things turned out fine. \n\nAnd remember: it's \"only\" for a year (or two). Now, that might seem like a long time if you're lonely, but in the grand scheme of things, it's not that long and will probably fly by. Your friends and family will not forget about you that soon!\n\nIf you're looking for new friends in the Netherlands, join the study association of your master programme (in Dutch: studievereniging) or if you're going to Amsterdam as a Erasmus student, join the Erasmus Student Network (ESN). Good luck!",
      "author": "matroeskas",
      "created": 1566069988,
      "upvotes": 2,
      "replies": {
        "ex8h3d3": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex8h3d3/",
          "text": "thanks mate!! :)",
          "author": "Menesio",
          "created": 1566073221,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ex8x3ay": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex8x3ay/",
      "text": "My family and I are moving from Canada to Scotland in about three weeks so I can begin PhD studies. It’s been a rollercoaster too, and sometimes I’ve really questioned if it’s the right thing to do. \n\nA huge thing that’s helped us stay the course in this move is the encouragement and support from family and friends to go for the adventure. So I hope I can encourage you too! You’ve got this. It’s an incredible opportunity and I hope it’s incredibly rewarding. \n\nGlad you’ve found support from some Dutch folks here too.",
      "author": "SheridanThur",
      "created": 1566080055,
      "upvotes": 2,
      "replies": {}
    },
    "ex93f53": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex93f53/",
      "text": "In the days leading up to my arrival to Amsterdam, I was also extremely nervous about moving. I put in so many hours at the gym to try and get rid of the anxiety, couldn’t really eat, I was just too nervous to even think straight while even packing. But then I arrived here. First days at the UvA with my literary studies RMA classmates were a blast. Fast forward three years, and I’m still here, thinking this was the best decision I ever made. \n\nChange is scary, but everything will fall into place. :)",
      "author": "almamont",
      "created": 1566082913,
      "upvotes": 2,
      "replies": {}
    },
    "ex97itq": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex97itq/",
      "text": "I cannot thank you enough for putting up this post! I will be moving to Germany in a month to pursue my Masters.  More than the academics, I am a bit worried about dealing with the language barrier. All thanks to these comments, I get a positive vibe :)",
      "author": "sanelyinsanewoman",
      "created": 1566084705,
      "upvotes": 2,
      "replies": {
        "exawc5n": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/exawc5n/",
          "text": "yes. everyone has been very helpful truly",
          "author": "Menesio",
          "created": 1566117434,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ex9kl77": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex9kl77/",
      "text": "[deleted]",
      "author": null,
      "created": 1566090281,
      "upvotes": 2,
      "replies": {
        "exawb7h": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/exawb7h/",
          "text": "you too!!",
          "author": "Menesio",
          "created": 1566117417,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ex9srkf": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/ex9srkf/",
      "text": "I remember moving to my new dorm in a new state and just bawling my eyes out for hours after my parents flew home. I was terrified. But, it wears off. I promise. You’ll have an amazing time. Embrace the change and recognize that everyone is as scared as you.",
      "author": "circuspunk-",
      "created": 1566093833,
      "upvotes": 2,
      "replies": {}
    },
    "exaocs9": {
      "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/exaocs9/",
      "text": "I'm also moving to The Netherlands in the next few weeks for a PhD (from Scotland) and of course, I am shitting it. What's really helped is chatting to my friends and family who are all extremely excited FOR me: they convinced me that it was the necessary next stage in my life, that it was time to put myself out there, and time to be a little uncomfortable.\n\nOne thing helping me massively is planning, loosely planning the first few days such that I know what I'm doing when I wake up in the morning, I know where to go for shopping etc. I also have set a couple of goals - I want to join a gym and find running routes within the first few days, I want to attend flat viewings and then (once I have a house) fix the flat with furnishing.\n\nIt is important to keep in touch with people back home, however you need to make friends in The Netherlands too. Find a few groups within the university that you want to try our, be it music or drama or sports, and look at what social events are happening too. Don't completely cut out everyone from home, but definitely pay attention to how much time you're spending chatting to them when you could be out making new pals. You could also join Dutch classes, you'll definitely meet people there and also learn Dutch, kind of useful. \n\nGood luck!",
      "author": null,
      "created": 1566112136,
      "upvotes": 2,
      "replies": {
        "exaw9zx": {
          "link": "/r/AskAcademia/comments/crl637/i_am_moving_abroad_italy_to_netherlands_in_10/exaw9zx/",
          "text": "you too!",
          "author": "Menesio",
          "created": 1566117396,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}