{
  "sid": "qcxmj9",
  "link": "/r/AskAcademia/comments/qcxmj9/how_do_i_find_peer_reviewers/",
  "title:": "How do I find peer reviewers?",
  "text": "I have a feeling I just have to submit stuff to journal articles but I'm writing a non-fiction book based on research I've done. A simple Google search didn't land me to any place where I can submit it for peer reviewers. Is there a place that I can submit my manuscript to? Is there a process for getting peer reviews I'm not aware of? I just want to make sure I'm not talking out of my ass or missing important pieces of already published literature.",
  "author": "ItsSamsFault",
  "created": 1634839376,
  "updated": 1634849150,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhippxv": {
      "link": "/r/AskAcademia/comments/qcxmj9/how_do_i_find_peer_reviewers/hhippxv/",
      "text": "What area(s) of expertise do you need reviewers for?",
      "author": "brett_hoover_wx",
      "created": 1634839829,
      "upvotes": 6,
      "replies": {}
    },
    "hhis4gj": {
      "link": "/r/AskAcademia/comments/qcxmj9/how_do_i_find_peer_reviewers/hhis4gj/",
      "text": "Is the research you have done published? If so, was it peer-reviewed?   \nReviewing an article, let alone a book, is hard work. you are looking for a fact-checker on a book you then want to sell? Why would anyone do that? You can hire someone to proof-read and fact-check, sure. but that will probably cost you.\n\nWhy do you not submit your research to peer-reviewed journals first?",
      "author": "spots_reddit",
      "created": 1634840801,
      "upvotes": 4,
      "replies": {}
    },
    "hhj5v7m": {
      "link": "/r/AskAcademia/comments/qcxmj9/how_do_i_find_peer_reviewers/hhj5v7m/",
      "text": "I don't think peer-reviewers are what you are looking for here. (The publisher will deal what that when it comes to it -- if they use peer review for whole books, not just book proposals.)\n\nYou want content editing by a subject expert. Are you associated with a university? Could you find a research seminar that deals with similar topics? One way could be to present different parts at different seminars.\n\nTo fact check a whole book is a huge undertaking and not something someone can be expected to do on their own time if it isn't done from inside the \"system\", where the reader gets paid as advisor, examiner, gets co-authorship, write and publish a review of the published book, or any of the other ways that make it at least somewhat worthwhile. \n\nTo get someone to do the work out the goodness of their heart is like asking a mechanic to fix your car for the same reason.",
      "author": "molobodd",
      "created": 1634846379,
      "upvotes": 3,
      "replies": {}
    },
    "hhj30as": {
      "link": "/r/AskAcademia/comments/qcxmj9/how_do_i_find_peer_reviewers/hhj30as/",
      "text": "What's the point of publishing a book over a research article in your opinion? Peer reviews are not sourced from the author of the material to be reviewed, typically academic journals recruit reviewers for articles so they achieve the gold standard: double blind peer review (where the authors do not know the reviewers and the reviewers do not know the authors). Some journals also publish book reviews (of published works) but this is not technically peer review.\n\nI also am wondering since you labeled this as social science, did you conduct research on humans? If so, did your research receive some for of ethics approval (in the states, it's IRB) before working with participants and collecting data? If not, it is going to be impossible (and unethical) for this work to be peer reviewed and published.\n\nIn short, if your research was approved by an ethics board, I would just try to publish a journal article since the journal will handle the peer reviews and other researchers will find/use your work at a greater rate than a book.",
      "author": "proper-peony",
      "created": 1634845233,
      "upvotes": 2,
      "replies": {}
    },
    "hhj1l07": {
      "link": "/r/AskAcademia/comments/qcxmj9/how_do_i_find_peer_reviewers/hhj1l07/",
      "text": "From you post history you might be well advised to identify a few different academics who publish in your area. Ideally, they would be well connected with the topic as it is currently experienced, rather than one who is more historical.\n\nSend them an email describing what you have done, and ask for comments. Make sure not to send a long email or a copy of your work until you know they're interested.",
      "author": "dapt",
      "created": 1634844651,
      "upvotes": 1,
      "replies": {}
    }
  }
}