{
  "sid": "q2yt7r",
  "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/",
  "title:": "GRE Scores",
  "text": "Hi I am applying for PhD programs in the US primarily in Sociology but also looking at Political Science and Anthropology. A number of top programs have made the GRE optional but I took the GRE over the summer and got a subpar score 308. I am wondering a) whether I should submit my GRE scores b) retake the GRE. I have a decent GPA and couple of strong research projects under my belt but I am confused about the GRE\n\nAny advice would be highly appreciated",
  "author": "stk3293",
  "created": 1633571805,
  "updated": 1634078744,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.2,
  "comments": {
    "hfojwe0": {
      "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfojwe0/",
      "text": "What is your split, and do you know what methodological specialty you want to go with? I'm a soc PhD and can tell you verbal matters more than your quant score.",
      "author": "pepperonirollss",
      "created": 1633572839,
      "upvotes": 5,
      "replies": {
        "hfp5coz": {
          "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp5coz/",
          "text": "During my undergrad l got trained in both quant and qual methods. But I am looking to ne trained in qual with a focus on soc of migration and identity",
          "author": "stk3293",
          "created": 1633585731,
          "upvotes": 1,
          "replies": {
            "hfscduu": {
              "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfscduu/",
              "text": "If you say in your statement of purpose you want to use qual methods, they will probably care a little less about your quant score.",
              "author": "pepperonirollss",
              "created": 1633646905,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfp4gv8": {
      "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp4gv8/",
      "text": "Are you the poster from Grad Cafe in the Sociology forum? If so, the advice you got there was good, and I’d recommend listening to it. If not, go find it. No, I wouldn’t send that score to top programs that didn’t require it. Some schools have strict cutoffs, so obviously send for those that require it, but no reason to send something weaker when you don’t have to. (I’m a Soc PhD student.)",
      "author": "elosohormiguero",
      "created": 1633585059,
      "upvotes": 2,
      "replies": {
        "hfp56ss": {
          "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp56ss/",
          "text": "No I am not from Gradcafe! But thank you for the advice. I got a 155 V, 153 Q. I am worried about my Quant score. Apart from GRE my profile is top notch. I am just confused about how to proceed?",
          "author": "stk3293",
          "created": 1633585602,
          "upvotes": 1,
          "replies": {
            "hfp5uug": {
              "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp5uug/",
              "text": "The quant isn’t the end of the world. Verbal is a bit low for elite programs. Honestly I wouldn’t submit where it’s optional. Why send something not strong? Send it where you have to and that’s it.",
              "author": "elosohormiguero",
              "created": 1633586125,
              "upvotes": 2,
              "replies": {}
            },
            "hfp60uc": {
              "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp60uc/",
              "text": "Feel free to DM me the schools if you want. Some are more score-invested than others. For example, schools like Stanford care deeply about the scores. Berkeley doesn’t give a shit about quant scores.",
              "author": "elosohormiguero",
              "created": 1633586252,
              "upvotes": 1,
              "replies": {
                "hfp665e": {
                  "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp665e/",
                  "text": "So my top choice is Princeton Soc and I have met couple of Grad students from there apart from Princeton. I am looking at \n\nUCLA\nBerkeley \nUPenn\nNorthwestern \nRice \nUW Madison \nDuke",
                  "author": "stk3293",
                  "created": 1633586368,
                  "upvotes": 1,
                  "replies": {
                    "hfp6e6v": {
                      "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp6e6v/",
                      "text": "So I wouldn’t send scores any of those places if they make them optional. All of those schools will have score averages for admitted students above yours. If they require it, there’s nothing you can do, really. Your list is very selective but a strong profile can overcome a lower GRE. You certainly make it above any hard cutoffs for schools that require the scores. (Hard cutoffs tend to be 150/150.) I wouldn’t worry about it being prohibitive for UCLA and Berkeley, even though it will be below their averages. Penn and Princeton will be more difficult, especially Penn given the quant focus there last I checked. Make sure your writing sample is strong and they’ll stop caring about verbal. I think your biggest problem would be if you’re pitching yourself as a quant researcher here. If so, the quant score is a bit worrisome. But I assume given Berkeley that you’re qualitative or mixed methods?",
                      "author": "elosohormiguero",
                      "created": 1633586542,
                      "upvotes": 1,
                      "replies": {
                        "hfp6hv0": {
                          "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp6hv0/",
                          "text": "Thank you so much. I really appreciate the advice. I was sick worried about what to do. It was getting hard to focus on other components. Hopefully everything turns out well",
                          "author": "stk3293",
                          "created": 1633586622,
                          "upvotes": 1,
                          "replies": {
                            "hfp6tny": {
                              "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp6tny/",
                              "text": "And if it doesn’t, remember that most people apply multiple cycles, and later get into programs that previously rejected them. While it’s not fun, worst that happens is you try again! I got rejected from all but one program and ended up getting NSF. My friend got rejected from all programs for three years before getting into UMich on the third try. It happens. But hopefully it will work out on the first go. :)",
                              "author": "elosohormiguero",
                              "created": 1633586878,
                              "upvotes": 1,
                              "replies": {
                                "hfp6z1h": {
                                  "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp6z1h/",
                                  "text": "Yes and I think it also comes down to the fit. I am trying to reach out to as many people as I can to better understand the department and the work they do. So hopefully I get in. I am also applying straight out of undergrad. So my chances are anyway pretty slim.",
                                  "author": "stk3293",
                                  "created": 1633586998,
                                  "upvotes": 2,
                                  "replies": {
                                    "hfp7c7i": {
                                      "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfp7c7i/",
                                      "text": "I was straight out of undergrad too! Some programs like that more than others. You can get a feel for that going through the CVs of current students and seeing if they seemed to have a gap between undergrad and grad school. (Most programs confer the MA after year 2 en route to the PhD.)",
                                      "author": "elosohormiguero",
                                      "created": 1633587289,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfqfnwl": {
      "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfqfnwl/",
      "text": "Do not submit a subpar score. Better to not submit at all. Since GREs are option in many programs, the applicants who submit them tend to have outstanding scores. You are better off to omit the GRE unless you have an outstanding score. There will be many applications without GREs. Good luck.",
      "author": "professorbix",
      "created": 1633617924,
      "upvotes": 2,
      "replies": {}
    },
    "hfov73v": {
      "link": "/r/AskAcademia/comments/q2yt7r/gre_scores/hfov73v/",
      "text": "A 308? Isn’t it out of 1500 or 1600? That’s the kind of scores I see from ESL speakers.",
      "author": "ohnoyoudin",
      "created": 1633579202,
      "upvotes": 0,
      "replies": {}
    }
  }
}