{
  "sid": "mibupd",
  "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/",
  "title:": "My favorite professor is having a health crisis",
  "text": "Hi ya'll.\n\nLooking for some advice; my favorite professor is having a health crisis; a tumor was found and nobody knows yet how serious or benign it might be.\n\nI'm just an undergrad, so I don't know her super personally, though she has been a support person for me in reporting a different professor. She's an absolute gem, not just for her department but for the entire university. I know for sure that I'm not the only one who feels this way at all.\n\nI want to do something nice for her; anything to bring her some comfort or at least a pick-me-up amidst this clusterfuck. My first thought was to collaborate with the rest of her class and get flowers and cards sent to her room when she's in the hospital, but I'm wondering if there are more/better ideas.\n\nAny ideas or advice would be much appreciated.\n\n&#x200B;\n\n\\###UPDATE EDIT:\n\nJust thought to edit this with an update even though I know it's a pretty old post now; my professors surgery went well, it turned out to be benign, and she seems to be feeling much better and has been recovering really well. It's been a relief for the entire department and all of the students who know her! We all ended up sending in a hodgepodge of gifts and some money for food during her recovery. Thank you all for your advice and encouragement. ",
  "author": "shwoopypadawan",
  "created": 1617333834,
  "updated": 1634080746,
  "over_18": false,
  "upvotes": 184,
  "upvote_ratio": 0.97,
  "comments": {
    "gt3uwxl": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt3uwxl/",
      "text": "Flowers and cards are actually probably the right move.  It might seem simple or easy or traditional but the medical staff are taking care of immediate needs and for many people something simple is probably the best (lowest stress) option.  You could talk to the main admin for the dept and see if there is something being coordinated at that end (so the cards can be co-delivered).",
      "author": "crkrshx",
      "created": 1617334400,
      "upvotes": 148,
      "replies": {}
    },
    "gt3yutx": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt3yutx/",
      "text": "Flowers or a card would be amazing to receive. What matters is knowing that a group of people went out of their way to pay tribute to someone. When you’re sick and feeling alone, knowing that people are thinking of you and appreciate you is everything. \n\nI once compiled a list of a favorite professor’s funniest or most memorable things said in class. She was a HOOT. I gave it to her, and she loved it. Playing on that theme, you could email students and ask them to write 2-3 sentences about their favorite moment in class, a favorite memory of her, something they learned from her, etc. Professors often don’t know the impact they have, and this is a way to bring it home.",
      "author": "humble_pir",
      "created": 1617337093,
      "upvotes": 75,
      "replies": {
        "gt4jqrz": {
          "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt4jqrz/",
          "text": "As a professor, I love this idea. It's thoughtful, impactful, and different.",
          "author": "drLilu",
          "created": 1617356508,
          "upvotes": 20,
          "replies": {
            "gt5wqat": {
              "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt5wqat/",
              "text": "Thanks! I was trying to think what would make me feel seen and valued in this instance. I’m grateful for students like this one, who care and will do something to show it!  Mad props, OP!",
              "author": "humble_pir",
              "created": 1617386728,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gt3v8u1": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt3v8u1/",
      "text": "What you said here is pretty nice for her to hear :) I would just send beautiful flowers and a card of appreciation to her.",
      "author": "awkardlyjoins",
      "created": 1617334624,
      "upvotes": 40,
      "replies": {}
    },
    "gt3z3jn": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt3z3jn/",
      "text": "Very kind thoughts. Keep in mind many hospitals don’t allow flowers, so be sure to check hospital policies first.",
      "author": "woohoo789",
      "created": 1617337264,
      "upvotes": 17,
      "replies": {}
    },
    "gt481s0": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt481s0/",
      "text": "Definitely a card with her students' well wishes. Are you guys doing remote? You could do a zoom gallery and screenshot everyone holding up a sign for her then print that as part of the card.",
      "author": "drelizabethsparrow",
      "created": 1617344352,
      "upvotes": 17,
      "replies": {}
    },
    "gt4va3h": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt4va3h/",
      "text": "Having just gone through a similar health crisis myself, I have two comments. \n1. It's unclear how you found out about this health crisis, and I would not take any course of action (i.e. organizing something from the whole class) that involves a telling a bunch of people what is going on,  unless you are sure they already know (Professor sent mass email or something). Before I had surgery, I told only the people I work closely with, and I figured I would tell the whole department if I had cancer, but it didn't seem worth getting a bunch of people involved while things are up in the air. Fortunately I have a tumor type that is treated with surgery with a 99% 10 year survival rate but it was still a lot of emotional work to tell everyone I had told about the surgery the good news. Please remember this is someone else's personal health information which is not yours to disclose, even if you are trying to do something nice for this person. \n2. Flowers are nice and I love them but I have now received 6 bouquets and have run out of places in my house to put them.  Consider sending a potted plant, which will last longer. I have received several bouquets with really strongly fragrant flowers (daffodils and Easter lilies), please try to avoid those. \nBut honestly the best gift we got was a Harry and David box with pears and snacks.  So consider sending food as an alternative to flowers.  I love all manner of sweet treats but the pears were nice because they are healthy (and delicious).",
      "author": "DrZ_217",
      "created": 1617366869,
      "upvotes": 22,
      "replies": {
        "gt7d0fu": {
          "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt7d0fu/",
          "text": "Thanks for your comment! So many people left awesome comments!\n\nShe told me and 3 of my friends who regularly go to office hours, and today the rest of the class and the department were informed by the department head as per my professors request. We wound up gathering gifts and cards as well as an online card; one of my friends delivered the gifts this morning. I made some cookies, and gave a card that I originally wanted to give her as a thank-you card; hopefully I'll be able to thank her for the things she's done for me properly with a new card in the future.\n\nAlso thank you for the advice about flowers! It turned out the hospital section she's in doesn't allow live flowers anyway but I was able to order some artificial ones to be delivered. I never would have thought about how overpowering scented flowers could get if you're stuck with too many, so I'm glad you brought it up!",
          "author": "shwoopypadawan",
          "created": 1617414805,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gt4f2uy": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt4f2uy/",
      "text": "Hi! Really nice of you to think of this!\n\nI'm going to advise against fresh flowers. If it is indeed something she has already started treatment for, she is likely immunocompromised and is susceptible to having strong reactions and allergies. I'd recommend a signed card and a gift card — that way, she can get anything that she needs and likes. Treatments (even prospective ones) can be stressful, expensive affairs, and support might really help.",
      "author": "akarameek",
      "created": 1617351381,
      "upvotes": 13,
      "replies": {
        "gt53h0u": {
          "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt53h0u/",
          "text": "Flowers are actually banned in UK hospitals.",
          "author": "Monsoon_Storm",
          "created": 1617371972,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gt4rmq9": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt4rmq9/",
      "text": "Do you know if they have a favourite character, a piece of lab equipment they use all the time, or a pet they love? You could commission someone to crochet/knit/sew a plushie of it for them. r/crochetrequests is a useful sub I know of.",
      "author": "Dear-Old-Shit",
      "created": 1617364114,
      "upvotes": 5,
      "replies": {}
    },
    "gt4xr2j": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt4xr2j/",
      "text": "Edible arrangement is where it's at. Especially if you think chemo will be involved in the future. It's nice to enjoy foods before the chronic nausea kicks in.",
      "author": "Dismal-Wallaby-2",
      "created": 1617368533,
      "upvotes": 4,
      "replies": {}
    },
    "gt7deid": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt7deid/",
      "text": "I just want to thank everyone for all these awesome comments and all the advice! My whole class was informed by the department chair and we signed a card and sent in some stuff to hopefully distract her from the stress. I ended up baking some cookies and getting her artificial flowers since it turned out her hospital doesn't allow fresh flowers due to some patients being immunocompromised, as I saw someone wisely point out here as well! \n\nThanks everyone!",
      "author": "shwoopypadawan",
      "created": 1617415038,
      "upvotes": 2,
      "replies": {}
    },
    "gt4xpt1": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt4xpt1/",
      "text": "flowers and a card are perfect.  if she's not on campus due to health issues talk with your department secretary or someone in her office pod to figure out how to get them to her.",
      "author": "printandpolish",
      "created": 1617368511,
      "upvotes": 1,
      "replies": {}
    },
    "gt5amfu": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt5amfu/",
      "text": "First check to see if she is allowed flowers in her room. Some hospitals don’t allow them. I’m not kidding. Sending her heart felt thought, prayers, poetry....can’t go wrong. I wish you all well.",
      "author": "SwarminGizards",
      "created": 1617375784,
      "upvotes": 1,
      "replies": {}
    },
    "gt5mipt": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt5mipt/",
      "text": "Assuming this is information she's ok with you (and other students having), a card or multiple cards would be lovely. I'd advise against flowers for many reasons, including, you don't know if she's allergic, she has to figure out what to do with them, the hospital may not allow them, etc.",
      "author": "RoyalEagle0408",
      "created": 1617381704,
      "upvotes": 1,
      "replies": {}
    },
    "gt5rc2i": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt5rc2i/",
      "text": "Flowers are definitely appreciated. Cards mean a lot too! My students got me flowers when my dad died. It was a little corner of happy in my office.",
      "author": "gmann5092",
      "created": 1617384068,
      "upvotes": 1,
      "replies": {}
    },
    "gt5t2s1": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt5t2s1/",
      "text": "A nice card.",
      "author": "garulous",
      "created": 1617384926,
      "upvotes": 1,
      "replies": {}
    },
    "gt5w6x8": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt5w6x8/",
      "text": "I am often uncomfortable when students buy me things.  My husband went through a health crisis last year.  I was also trying some new teaching things during that semester.  I really could have used a break as I was barely hanging on by a thread.  A few of my students were complete a\\*\\*holes, giving me looks and smirks went something went wrong.  Mostly senior male students that thought they were not going to have work in my class.  Most students were cool but it was those few that completely gave me a breakdown at the end of the semester.  I just collapsed.    \n\n\nSo maybe just try to keep the a\\*\\*holery down across the board.  Not sure how but that would have been the biggest help to me.",
      "author": "Amateur_professor",
      "created": 1617386460,
      "upvotes": 1,
      "replies": {}
    },
    "gt77ex9": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt77ex9/",
      "text": "Organizing support is good. Aside from the flowers and cards, you may want to consider organizing meal support (especially if the professor goes through treatment like chemo and surgery). And, if you are in a certain relationship, you can also ask directly the professor what support would be most helpful; but, start with stating that your group desires to support her during this period.",
      "author": "Kind_Matter_2117",
      "created": 1617411522,
      "upvotes": 1,
      "replies": {}
    },
    "gt3x2vi": {
      "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt3x2vi/",
      "text": "Are they on the older side? With age, it usually becomes difficult to combat these issues. \nI'm hoping they make a strong recovery,and experience an overshoot,in that they come back stronger than before! It can be done with the right surgical intervention/drug regimen/positive, resilient mentality.",
      "author": "Int_traveller",
      "created": 1617335860,
      "upvotes": -21,
      "replies": {
        "gt4af7w": {
          "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt4af7w/",
          "text": "Dude what the fuck.",
          "author": "mechnight",
          "created": 1617346593,
          "upvotes": 14,
          "replies": {
            "gt4trnz": {
              "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt4trnz/",
              "text": "Oh sorry",
              "author": "Int_traveller",
              "created": 1617365768,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "gt7qklp": {
          "link": "/r/AskAcademia/comments/mibupd/my_favorite_professor_is_having_a_health_crisis/gt7qklp/",
          "text": "I'm not sure why everyone got kinda mad at this comment but I know you mean well! Thanks for commenting! She's pretty young, just unlucky. I think she's in good hands at the university hospital though at least.",
          "author": "shwoopypadawan",
          "created": 1617423279,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}