{
  "sid": "dxju6s",
  "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/",
  "title:": "I don't know how to explain to my advisor the reason for my withdrawal",
  "text": "I'm studying master & working at the same time. I also have to look after my siblings studies\nOn the 2nd week of the subject I started to get stress from work, home & studies I thought I could handle it on the end of week 3 I thought I couldn't do it I need a break. \nOn Thursday of last week it was the last day to withdraw from subject without academic penalty. However on Friday afternoon I just had break down and my mental health went down & I thought I wouldn't be able to complete the subject. I couldn't keep up my studies (I'm very late) or research with what happening at home\n\nI'm planning to call my advisor and explain if I can withdraw from the subject for these reasons without asking for pity or sympathy \nI want to withdraw without academic penalty if possible I'm fine with not getting refund but I don't want the penalty to affect my GPA",
  "author": "sk8er_girl90",
  "created": 1573977174,
  "updated": 1634081708,
  "over_18": false,
  "upvotes": 122,
  "upvote_ratio": 0.95,
  "comments": {
    "f7ra8mw": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7ra8mw/",
      "text": "Like you said, you're not looking for pity but that doesn't mean you shouldn't get some sympathy. Grad students are unfortunately notorious for having mental health breakdowns and odds are your advisor has been through something similar. Just remember, there are probably mental health care resources at your school. Utilize them. And don't feel bad for asking to take a break due to personal reasons. There's no reason to suffer in silence any longer.",
      "author": "tttruckit",
      "created": 1573977657,
      "upvotes": 1,
      "replies": {}
    },
    "f7rfez3": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7rfez3/",
      "text": "As an advisor and as someone who felt similarly during his masters, PhD, and quite a few projects in between and after, I'd suggest telling them exactly that. Most advisors are aware of the strains a thesis puts on you (as it did to them) and will understand.  \n\n\nDon't ask for an immediate withdrawal. If your subject isn't time sensitive, ask for a mental health break. Lock away your things, hang your lab coat if you have one, and take a break. Go hiking for a day, away from it all, relax, rethink, refresh.   \n\n\nYou can always get another stab, but your mental health always should come first.",
      "author": "doc_dormicum",
      "created": 1573980384,
      "upvotes": 1,
      "replies": {}
    },
    "f7rg1hq": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7rg1hq/",
      "text": "Agree with comments above. The important thing is to have the conversation as soon as possible with your supervisor. We've seen this a lot - don't sweat it and let the stress of the conversation delay having it.",
      "author": "25ausguyme",
      "created": 1573980719,
      "upvotes": 1,
      "replies": {}
    },
    "f7shjoo": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7shjoo/",
      "text": "I went through a very similar experience twice during my master’s degree. The professor that chaired our department was able to help the first time. He found me another small scholarship so I wouldn’t be as stressed about working every available second. And he helped me calm down about feeling behind. The second time I went to the professor whose class I was struggling with. I explained calmly that I wasn’t able to make much progress on the paper and felt stuck. He helped me realize that I was on the right track but just needed a break. I turned the paper in a few days late and he still allowed me to earn a B. Just talk to them and ask what they recommend. It always worked out for me.",
      "author": "musicStan",
      "created": 1573994784,
      "upvotes": 1,
      "replies": {}
    },
    "f7sy4bv": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7sy4bv/",
      "text": "I withdrew from a master’s program because I needed to sleep (working full time, part time graduate program, family life, and some serious avocations). I was able to be re-instated later, and the withdraw was noted on my record, but no employer has ever asked about it. If you can’t take care of yourself, you can’t take care of anyone else. Your school has people whose job it is to help people like you through things.",
      "author": "bkozuma",
      "created": 1573999256,
      "upvotes": 1,
      "replies": {}
    },
    "f7szsaa": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7szsaa/",
      "text": "Have you considered switching over to part-time study?",
      "author": "Meltdown00",
      "created": 1573999714,
      "upvotes": 1,
      "replies": {}
    },
    "f7t4flo": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7t4flo/",
      "text": "You don’t owe them an explanation. It’s your life and if you feel the program isn’t a good fit, it’s your right to withdraw. I quit a PhD program after a year and it took me a while to come to terms with this, so I definitely know it’s not easy. But I think “this program is not a good fit due to demands at my job and it’s taking a toll on my mental health” is a good way to approach it. Just remember it’s your life and if the program isn’t good for you, it’s your right to stop doing it",
      "author": "broken_symmetry_",
      "created": 1574000935,
      "upvotes": 1,
      "replies": {}
    },
    "f7tm17y": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7tm17y/",
      "text": "> I'm planning to call my advisor and explain if I can withdraw from the subject for these reasons without asking for pity or sympathy \n\nYou will get, and deserve, some pity and sympathy. That is the nature of academics, pretty much all of us care for our students a fair bit.",
      "author": "symes",
      "created": 1574005566,
      "upvotes": 1,
      "replies": {}
    },
    "f7trdqz": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7trdqz/",
      "text": "Why do you need to look after your sibling’s work? That’s their responsibility and your parent’s. I have three younger siblings in a Chinese household and honestly looking after their studies had been too stressful for me and likely stressful for them too because sometimes they just don’t get it even if you explain something a dozen different ways. If you’re talking about tuition, you’ve pulled your weight and they should learn to pull their’s else they may never learn.",
      "author": "migamume",
      "created": 1574006937,
      "upvotes": 1,
      "replies": {
        "f7uwh7r": {
          "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7uwh7r/",
          "text": "what exactly does it mean to look after one’s studies?",
          "author": "paul_f",
          "created": 1574018545,
          "upvotes": 1,
          "replies": {
            "f7vcouf": {
              "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7vcouf/",
              "text": "Probably make sure they’re getting their work done, helping them with homework, etc.",
              "author": "symbaray617",
              "created": 1574022609,
              "upvotes": 1,
              "replies": {}
            },
            "f7w1hmf": {
              "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7w1hmf/",
              "text": "Making sure the work is complete. Like homework or making sure they understand certain topics that will be tested.",
              "author": "migamume",
              "created": 1574028965,
              "upvotes": 1,
              "replies": {
                "f7w1ya4": {
                  "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7w1ya4/",
                  "text": "Basically helping with their understanding.",
                  "author": "migamume",
                  "created": 1574029021,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f7trqff": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7trqff/",
      "text": "If you need to complete your masters to help you career wise I would say keep up with your masters and ask your professors and your admin to see if there are financial aid you could qualify for. Anything to take pressures off.",
      "author": "migamume",
      "created": 1574007053,
      "upvotes": 1,
      "replies": {}
    },
    "f7trxdq": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7trxdq/",
      "text": "Yes, part-time study could also greatly help.",
      "author": "migamume",
      "created": 1574007114,
      "upvotes": 1,
      "replies": {}
    },
    "f7u99up": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7u99up/",
      "text": "You can withdraw from a course and you do not need to explain anything. But I think it is better to give a face to face explanation to your advisor. Here are the reasons. \n\n- As an advisor it helps to know why a student left and if as an advisor she could have helped. \n\n- Most advisors with sympathize (not pity) with your issues and they can provide you with valuable advise.\n\n- By communicating you create a better impression. If you ever needed help from that person you are more likely to get it.\n\n- They might be willing to help you so that you get some refund.\n\n- On the other hand, if your advisor comes of as a total douche then you know who to avoid next time.",
      "author": "omeow",
      "created": 1574012791,
      "upvotes": 1,
      "replies": {}
    },
    "f7ucorw": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7ucorw/",
      "text": "(For future assistance) If you have to look significantly after your siblings, you probably qualify for family assistance. Sometimes this is through the university, and other times it is through your graduate student association.",
      "author": "ArrayToGo",
      "created": 1574013627,
      "upvotes": 1,
      "replies": {}
    },
    "f7uldkb": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7uldkb/",
      "text": "One thing I might suggest is to not be apologetic. It's completely OK to have a life outside of school and nobody can reasonably expect you to be a robot. So instead of saying things like \"I'm really sorry but I can't do this and I'm failing and I'm trying and I'm miserable and I'm sorry,\" I'd strongly suggest saying something along the lines of \"Due to the increase of the work I have to do outside of my graduate studies, I've realized that I cannot afford to have this class at this time.\" That, I think, would yield respect (rather than pity or empathy) and it's something I feel would work better in the long run.",
      "author": "akrasuk",
      "created": 1574015804,
      "upvotes": 1,
      "replies": {
        "f7uw5v7": {
          "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7uw5v7/",
          "text": "thank you everyone for your reply I've got a lot of great advice it's really helped me a lot to gather my thoughts and help me prepare for meeting my advisor thank you again",
          "author": "sk8er_girl90",
          "created": 1574018450,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f7ux3m1": {
      "link": "/r/AskAcademia/comments/dxju6s/i_dont_know_how_to_explain_to_my_advisor_the/f7ux3m1/",
      "text": "OP, this is the kind of thing medical leaves are for. You should talk with your office of student affairs or equivalent and see about doing a medical leave and perhaps starting to see a therapist.",
      "author": "Catenane",
      "created": 1574018741,
      "upvotes": 1,
      "replies": {}
    }
  }
}