{
  "sid": "daf4pp",
  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/",
  "title:": "Do you think universities are becoming too \"business-minded\"?",
  "text": "I'm referring to a growing trend where universities are churning graduates without any regard for jobs or educational achievement. Equally frightening is this over-reliance on International students, solely for the money they can charge them. \n\n\nIt feels thats universities have stopped becoming higher education centres and are profit generating businesses. \n\n\nDo you agree and if so which country are you referencing?",
  "author": "SoybeanCola1933",
  "created": 1569672316,
  "updated": 1634080115,
  "over_18": false,
  "upvotes": 371,
  "upvote_ratio": 0.98,
  "comments": {
    "f1p75bb": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p75bb/",
      "text": "\"Are becoming?\"\n\nI'd say they've been too business-minded for decades.",
      "author": null,
      "created": 1569673958,
      "upvotes": 319,
      "replies": {}
    },
    "f1p7yic": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p7yic/",
      "text": "Yes. United States.\n\nOn the one hand, academic ideals were perhaps a bit too idealistic; after all, somebody does have to pay to keep universities running. \n\nAs I see it (which may not be especially well) there are 3 problems. \n\n1. Students who just want jobs and don't care about learning. They just want to pay for a certificate.\n\n2. Administration should not be separate from faculty. Some admin is necessary, but when people talk about a university, they often mean the administration.... They should mean the faculty and students but the power has been taken (and perhaps given) away from them. Students should take more responsibility for things like housing, while faculty, the same people who teach, should be making many of the decisions presidents or provosts do. \n\n3. State governments who don't properly fund institutions who then have to take business like approaches to keep the lights on.",
      "author": "Average650",
      "created": 1569674531,
      "upvotes": 178,
      "replies": {
        "f1pcwai": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pcwai/",
          "text": "I think #1 stems from entire generations of kids being told \"go to college so you can get a good job\". That's what I was told during my entire childhood. Most of my cohort went to college and surprise! no jobs. Some went and got basic jobs to lick their wounds and pay back debt. Some went to trade school, which was for some reason stigmatized despite being the good jobs we were seeking in the first place. Some, like me, went on to graduate school. Through hard work, I don't have any student loan debt, which is good because every business in my state that isn't an academic institution is terrified of hiring a Ph.D. and the schools don't want me because I'm from this state.",
          "author": "gritzy328",
          "created": 1569677804,
          "upvotes": 72,
          "replies": {
            "f1phlt8": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1phlt8/",
              "text": "\"[...] every business in my state that isn't an academic institution is terrified of hiring a Ph.D. and the schools don't want me because I'm from this state.\"\n\nWould you mind elaborating on these last points? I am in Canada currently trying to enter grad school, and I would like to get a PhD after master's. I heard comments that having a PhD is a double-edged swords for jobs but I don't think I fully get it. Also, what about you being from the state? Is it somehow seem as a problem in the US?",
              "author": "braznadian",
              "created": 1569680692,
              "upvotes": 24,
              "replies": {
                "f1qda4l": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1qda4l/",
                  "text": "If you have a PhD, and apply for a job that doesn’t require one, the assumption is you don’t actually want that job, it’s just temporary until you find a better job that actually uses your degree. \n\nAlso, I haven’t heard it applied to a whole state but many schools don’t want to hire their own PhD alumni. They want more diversity and to bring in people with different expertise. A new PhD has basically the same expertise as the prof who trained them.",
                  "author": "Maddprofessor",
                  "created": 1569698481,
                  "upvotes": 22,
                  "replies": {}
                },
                "f1r0rr8": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1r0rr8/",
                  "text": "another issue is best explained by telling you the situation my girlfriend's dad is going through.\n\ncivil engineer. super qualified, lots of education, additional master's degrees in business, can't find a job. no one will interview him because, presumably, he costs too much. lots of employers will see that and think \"damn he must be expensive.\"",
                  "author": "_coffeeblack_",
                  "created": 1569709600,
                  "upvotes": 10,
                  "replies": {}
                },
                "f1s9d4n": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1s9d4n/",
                  "text": "I see some others have given good answers, but I'll go ahead and put my reply here:  \n\n\nFor the first point, I have talked to over 20 employers that are certain it would cost too much to hire me. I'm in a low-income state where most people make less than $40k per year and people with Ph.D. degrees are considered to be philanthropically rich in general, mostly because the vast majority of those that live here never encounter someone with an advanced degree. I'm in the USA, Canada may be different.  \n\n\nFor the second point, I've talked to about 4 universities in the state, public and private. All of them expressed that they prefer hiring professors from other states or countries because there's a blanket belief that all universities in the state are teaching basically the same things and they want new ideas. I've known exactly two professors total that were hired in the same state in which they were educated. Both were considered exceedingly lucky and it was noted that they did post-docs in other states or countries, so the university felt they might still have new ideas. This mentality even held true for a university with almost no publishing/research pressure on its faculty.   \n\n\nAs someone that went to graduate school for personal reasons, I would HIGHLY encourage you to shadow people in your desired field before ever even applying to graduate school. Find out the dirt, the nitty-gritty, the nasty side of whatever it is you think you want to do. I thought I wanted to be a professor, but it turns out that most professors (at least in my field of study) spend 90% of their either terrorizing students for data or writing the grants in which they want to use said data. The funding rate, last time I checked, was around 4%. I'm not a grant-writer and that isn't the career I wanted, so now I'm working a low-paying state job until I find something local that pays better. I'm location bound for family reasons and not willing to move states for a post-doc position to extort me or for a job that only provides monetary benefits.",
                  "author": "gritzy328",
                  "created": 1569725894,
                  "upvotes": 8,
                  "replies": {}
                },
                "f1se9vn": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1se9vn/",
                  "text": "I’ll counteract the doom and gloom other people are sharing. I have a PhD in statistics and had no trouble finding a non academic job. None of my peers did either. \n\nThat’s not the norm for all PhDs, but it is the norm for some fields.",
                  "author": "webbed_feets",
                  "created": 1569727676,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "f1powvf": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1powvf/",
              "text": ">I think it might be self-reinforcing too; if a B.A. is needed for most professionals jobs and you have to take on debt that pretty strongly incentivizes majors and fields with an \\*immediate\\* payoff.",
              "author": "farquier",
              "created": 1569685458,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "f1p8dmo": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p8dmo/",
          "text": "> Administration should not be separate from faculty. Some admin is necessary, but when people talk about a university, they often mean the administration.... They should mean the faculty and students but the power has been taken (and perhaps given) away from them. \n\nI'd be interested to see if there's any statistics on the ratio of administrators to faculty/students over time. I'm guessing it's far outpassed the growth of enrollment.\n\nSomething is responsible for the exponential growth in costs, and it isn't faculty salaries.",
          "author": "Overunderrated",
          "created": 1569674827,
          "upvotes": 31,
          "replies": {
            "f1pn705": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pn705/",
              "text": "There are.  Here are a few links (specific to U.S. data though):\nhttps://nces.ed.gov/programs/digest/d99/d99t229.asp\nhttps://robertkelchen.com/2018/05/10/is-administrative-bloat-a-problem/\nhttps://www.insidehighered.com/news/2017/07/25/acta-wants-trustees-watch-administrative-spending-ratio",
              "author": "rakawido",
              "created": 1569684404,
              "upvotes": 9,
              "replies": {}
            },
            "f1xpskh": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1xpskh/",
              "text": "I remember reading about the number of admin staff doubling in a ridiculously short time, while student numbers only went up a bit. I know that it was in David Graeber's *Bullshit Jobs*. I'd check the numbers/scholarly sources, but I don't have my copy here.\n\nMy experience with academia (scroll down, there's my long post there somewhere) is that the academics end up doing far more of the admin than they should/know how/are willing to do and it just makes them too busy to do their actual jobs properly and we all drown in bullshit.",
              "author": "Beeblebroxologist",
              "created": 1569802098,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "f1pxhpa": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pxhpa/",
          "text": "> They just want to pay for a certificate. \n\n100% Accurate.  People do not value learning they only see education as a means to and end for job placement.",
          "author": "Johndope2402",
          "created": 1569689680,
          "upvotes": 18,
          "replies": {}
        },
        "f1r9fhv": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1r9fhv/",
          "text": "I’m a grad student who also works for my university. I’m required to take a “Student Affairs and Administration” course. I can absolutely attest to number 2: My textbook continually has to make argument for why the field even exists. I received the poorest mark in grad school after I turned in my report, “Student Affairs: The Non-Essential Administrator.” My own institution has more admin/staff than faculty/instructors. The VP of Student Services and Affairs receives a higher salary than the dean of my college. It is complete hot garbage.",
          "author": "thegiantbadger",
          "created": 1569712794,
          "upvotes": 7,
          "replies": {
            "f1xqptp": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1xqptp/",
              "text": "I am now imagining you, dressed as a giant badger, handing in that report. And getting a bigger raised eyebrow from the title than the costume.",
              "author": "Beeblebroxologist",
              "created": 1569802552,
              "upvotes": 4,
              "replies": {
                "f2063nf": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f2063nf/",
                  "text": "This is the best imagined scenario anyone could have hoped for",
                  "author": "thegiantbadger",
                  "created": 1569855751,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "f1pta04": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pta04/",
          "text": "Absolutely agree about putting faculty at the center of decision-making. I saw how well this can work during a recent controversy that required authoritative criticism of the administration. Student criticism was too easily dismissed, given 1) they have no significant role in university governance and 2) a quarter of them leave every year. Staff are loathe to air criticism publicly, given the perceived precariousness of university employment. (There's a huge variation across schools on that point.) So the faculty become the \"guardians of the mission\", but unfortunately I've only seen that at times of crisis.\n\nIt was interesting reading the minutes of the most recent all-faculty meeting. There was this sudden realization that they shouldn't be delegating power to deans, provosts, and presidents, that the first and last word needs to come from the faculty body, especially on the question of what standards are set for who the school accepts money from and whether it's acceptable to them that those standards might mean a scaling back of ambitions, financial aid, etc.",
          "author": "dcgrey",
          "created": 1569687758,
          "upvotes": 12,
          "replies": {
            "f1pu9jg": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pu9jg/",
              "text": "I wish we had that choice. Our president, who I actually think is a good president, can basically do what he wants.",
              "author": "Average650",
              "created": 1569688239,
              "upvotes": 1,
              "replies": {
                "f1pyf3a": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pyf3a/",
                  "text": "The one I'm speaking of, that was pretty much the same until the recent faculty meeting. It was striking to hear about. I kind of wonder if the humility shown by the president afterward was in part because they came up through the faculty, as opposed to being an outside hire from the non-academic world.",
                  "author": "dcgrey",
                  "created": 1569690166,
                  "upvotes": 7,
                  "replies": {}
                },
                "f1rglnt": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1rglnt/",
                  "text": "Hey, sometimes they're supervised by a board of all the people that donated a bunch of money to the governor's campaign!",
                  "author": "Homomorphism",
                  "created": 1569715410,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "f1pqecc": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pqecc/",
          "text": "I'm in college solely for a job. Ain't nobody got thousands of dollars laying around so they can learn for fun. Well, Bill Gates does. But I'm not Bill Gates. But seriously, I don't have the money to waste. I had to drop out twice because I couldn't get a student loan without a cosigner for so long. I was even denied a third time before what was supposed to be the final year. But for once in my life, I was able to get the hours at the summer job I picked up to work out with school. I didn't have night classes available, so I had to quit the jobs I picked up when I was forced to stop school before. But I was finally able to brute force my way through with a job while in school. I am still bitter and spiteful from what I had to go through last year because of that. I nearly killed myself on my commute from the sleep deprivation! It's taken me 8 and a half years to finish this goddamn degree because of that (even with 2 years of community college and transferring to the local state school). I don't have the time or money to care about learning topics completely unrelated to my degree. Anthropology and music history are completely worthless to me. It's useful to some people (I'm not saying the entire field is worthless, as it is useful for stuff other people care about), but not for me. And they cost me time and money, so I get negative use.\n\nNow, I don't hate learning. I generally like my classes for my major (mechanical engineering). I took quantum physics for fun because I had a choice of linear algebra or quantum physics and I already did linear algebra in community college (it didn't transfer over though). I'm even taking relativity for fun this semester, and taking 18 credit hours for my last semester despite only needing 9 to graduate, because I figured the extra 400 level classes would be useful (and since I don't hate my major, I do have some interest in them anyway. Except HVAC. But I don't have to take HVAC). If I can get straight A's this semester and the extra classes contribute to my GPA, I should even be able to finish with a 3.7 GPA.\n\nIt doesn't help that my generation is basically told that we have to go to college or we'll be stuck with crap jobs. I did those crap jobs to build up credit history and help pay for school. Have you ever worked in a factory on a hot humid day with powdered corn syrup? There's no dehumidifier or air conditioning. That stuff gets everywhere, and it would mix with my sweat and get everything sticky. I used to go home with cocoa powder and cinnamon in my underwear. I'm not here to expand my mind. I'm here so I can stop being the loser living in their mom's house and get on with my life.",
          "author": "OoglieBooglie93",
          "created": 1569686317,
          "upvotes": 16,
          "replies": {
            "f1pu3pt": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pu3pt/",
              "text": "Oh I totally understand. I'm not saying they're wrong exactly, just that it has the net effect of making the while thing more business like,and less purely educational.",
              "author": "Average650",
              "created": 1569688163,
              "upvotes": 10,
              "replies": {
                "f1sn294": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1sn294/",
                  "text": "For me the message has to be: you can get a good education _and_ get a job. We've got to be doing both, really. And they're not mutually exclusive. \n\nThe current generation of students have been told since they were little kids that if they don't lock in a career ASAP they are going to end up living in their parents' basement. And they are taking on a phenomenal debt load. I'm not at all surprised they see it in economic terms.",
                  "author": "restricteddata",
                  "created": 1569731186,
                  "upvotes": 5,
                  "replies": {
                    "f1ur7a4": {
                      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1ur7a4/",
                      "text": "I agree. I would like it to be about education only, but that is really not practical, and I certainly didn't see it that way when I was an undergrad.\n\nAnd I get why people see it in purely economic terms, but we've got to inject some amount of joy of learning or it won't even be very good at getting them jobs.",
                      "author": "Average650",
                      "created": 1569762517,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f1ri7z8": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1ri7z8/",
              "text": "I don't think there's anything wrong with acknowledging that people come to college solely so that they can get a job.  I have no issue with that.  That's why I went to college.  But what drives me up a wall in the classes that I TA for are the students who seems to suffer the delusion that college is a purely transactional \"pay to play\" and they are automatically entitled to As even if they do not do the work or perform well on learning checks like exams because they pay tuition.  Not that this descriptor applies to you - it sounds like you're hardworking with a solid level of personal accountability.",
              "author": null,
              "created": 1569715968,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "f1ppos8": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1ppos8/",
          "text": "Somehow universities paid for themselves running just fine in the close to 1000 years of their existence as an institution, and the 500 or so spent without capitalism having been invented yet. I wonder how is it that capitalism makes it harder not easier?",
          "author": "kinderdemon",
          "created": 1569685927,
          "upvotes": 6,
          "replies": {
            "f1ptid2": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1ptid2/",
              "text": "I mean, only the rich used to be educated at this level. That's changed. A lot of good comes with that, but educating so many people, who are not wealthy, is expensive. I'm not saying it can't be done but it is an extra barrier.",
              "author": "Average650",
              "created": 1569687870,
              "upvotes": 14,
              "replies": {}
            },
            "f1snt5x": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1snt5x/",
              "text": "Medieval and early modern universities, if that is what you are referring to, were either paid directly by students (so, rich parents), by the Church (so, rich clergy), or the state. Take your pick. They were not inclusive in the slightest. They were only for training new members of the elite. They were also not research institutions.\n\nThe modern research university dates only to the 19th century or so, in which tuition, partnerships with industry, and (increasingly greater amounts of) state funding kept the lights on. The relative shares and amounts of those have changed dramatically, and vary by national context quite a bit.",
              "author": "restricteddata",
              "created": 1569731486,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "f1p9whx": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p9whx/",
      "text": "obviously.\n\nJust from a very simple \"big picture\" perspective.  USA government gives money (student loans) to people for university,  universities increase student costs to soak up all that extra money.\n\nOther independent point:   USA college sports is BIG BUSINESS.  It is a billion dollar industry,  and its raw resource is 18 year old kids.  They are consumed,  universities chew them up and spit them out, and profit.",
      "author": "NiceSasquatch",
      "created": 1569675888,
      "upvotes": 51,
      "replies": {}
    },
    "f1pbz1z": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pbz1z/",
      "text": "Masters programs in the US. Yes 100%.",
      "author": "debacchatio",
      "created": 1569677234,
      "upvotes": 32,
      "replies": {}
    },
    "f1p8mzn": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p8mzn/",
      "text": "Australia leads all other countries in this case.",
      "author": "Pathfinder15",
      "created": 1569675030,
      "upvotes": 28,
      "replies": {
        "f1pdvys": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pdvys/",
          "text": "From NZ - can confirm our brothers across the ditched are on a path towards getting absolutely fucked.\n\n&#x200B;\n\nWe're only half a decade behind in NZ I believe.",
          "author": "fatesjester",
          "created": 1569678393,
          "upvotes": 20,
          "replies": {}
        },
        "f1pelsb": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pelsb/",
          "text": "I second this. \n\nAnd as a student you can really feel the consequences of this. Very uninspiring for an aspiring academic.",
          "author": "throwaway444545437",
          "created": 1569678827,
          "upvotes": 19,
          "replies": {
            "f1piwoj": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1piwoj/",
              "text": "Thirding this -  my university made some big business-minded changes and the repercussions have certainly put me off academia. Based on my chats with students and employees from other universities, it seems to be quite consistent across the country.",
              "author": "Neyface",
              "created": 1569681716,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "f1s8iel": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1s8iel/",
          "text": "It's honestly disheartening. You can see it with the way certain courses are structured, the shift to trimester instead on semesters to allow for more admission periods etc.",
          "author": "LatteFairy",
          "created": 1569725576,
          "upvotes": 4,
          "replies": {
            "f1wqtbu": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1wqtbu/",
              "text": "Which Unis shifted to trimester?",
              "author": "Pathfinder15",
              "created": 1569788297,
              "upvotes": 1,
              "replies": {
                "f1yf01k": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1yf01k/",
                  "text": "Recently its been UNSW with a shift to trimesters for undergraduate degrees (they already had trimesters for masters degrees). It's been inconvenient for both staff and students and there have been protests.",
                  "author": "LatteFairy",
                  "created": 1569815042,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f1piqz0": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1piqz0/",
      "text": "Education is a commodity. The ivory towers fell long ago.",
      "author": "mrsloth86",
      "created": 1569681601,
      "upvotes": 18,
      "replies": {}
    },
    "f1p64af": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p64af/",
      "text": "Yes. United States. [NYU](https://www.huffpost.com/entry/william-r-berkley-nyu_n_5788318?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAJ53qtfqDE37TrIepFDbXfkb3rBkN3plG4RSQcneCibD7WFmRwRFb0QS5NqZrGz_f-XdIIPqTZL1MnO7WjYnuLdyag0CjLNs4rt_WpRYZLsTM84pdUFAIjctCvxu7wIKhShDDYsdiqiVSQZzwZD_NMXnhrg622MjGSWEAttS7NWG)",
      "author": "AnFaithne",
      "created": 1569673196,
      "upvotes": 28,
      "replies": {
        "f1p7z4i": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p7z4i/",
          "text": "[Also NYU](https://www.nytimes.com/2018/08/16/nyregion/nyu-free-tuition-medical-school.html)",
          "author": "Milagre",
          "created": 1569674544,
          "upvotes": 6,
          "replies": {
            "f1p9myo": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p9myo/",
              "text": "For a critique of NYU’s free med school deal see [this] (https://slate.com/business/2018/08/nyu-medical-school-plans-free-tuition-for-all-what-a-waste-of-money.amp) article",
              "author": "AnFaithne",
              "created": 1569675714,
              "upvotes": 11,
              "replies": {}
            }
          }
        },
        "f24lhcx": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f24lhcx/",
          "text": "NYU is so awful. Their expansion into Shanghai and Abu Dhabi is particularly an abomination.",
          "author": "RubusPhoenicolasius",
          "created": 1569954991,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1pgz5s": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pgz5s/",
      "text": "tldr: Holy fuck yes.\n\n(not so)Little story. I'm a PhD student at an English university (I won't get too specific, but some of you might still be able to guess where - then again, I think a lot of this is true everywhere). The UK government allowed uni's to charge up to £9000 per year tuition a few years ago (while also cutting lots of government support for university). The typical amount beforehand was £3k (for domestic students at least; internationals were often 1.5x higher or more). Immediately, pretty much every uni put their fees up to £9k. \\[From what I understand of US universities/collages, it's only a few elite expensive ones that change anything equivalent or more, and even then very few students pay all of that top-whack themselves due to various grants and scholarships - there is still gov or scholarships in the UK, but you're not coming out of uni without a big fat debt\\] \n\nFortunately, I was in Scotland where tuition was (& is) free for long-term residents of Scotland or EU...just not England, which was hilarious. Anyway, this change happened while I was in my second year of 5 (inc. Master's). The class size when I started was about 30-35. This gradually whittled down to around 20 getting Batchelor's degrees and 5 of us getting Master's there. The year group after us was about 40 in first year, and the one after that started with 70. I heard the lecturers worrying how they were going to accommodate so many students in all the practicals, and where they could possibly lecture (I think there were only 5 lecture theatres at the uni that were designed to accommodate more than 55 at once - most rooms had only \\~30 seats at most, though I guess they could've packed more chairs into some of them if they made the desks smaller). It wasn't just our department facing the massive influx.\n\nCut to my current institution, where I did some lab demonstration and marking of the first years (oh my god. the marking. If you're reading this and you still have some essay's to write, please for the love of god put some effort into it; you may only have to write one, we have to mark a hundred and try to keep our faith in the future of humanity intact - also, if they give you a guide on how to write an essay; ffs read it). I therefore had contact with all 200 new students in my department. My current uni is bigger than my old one, but not THAT much bigger, so most departments were bursting at the seams. It was so full, the uni decided to move the start times to half past the hour; allowing them to start at 8:30 & finish at 5:30. Literally no one like this. Except possibly the bean counters who could now get maximal utility out of their lectures ... oh, I don't believe they saw a pay increase commensurate with these longer hours by the way. Couple all this with the already stressful conditions many academics face nowadays, and it's hardly surprising that it's been getting quite fraught the last few years. I've been here 3 years, every year's new intake has been about 200 to my department alone. They are franticly trying to build more space for everything.\n\nMeanwhile, my uni was in the news for one of the largest payouts to a retiring vice-chancellor ever (equivalent to around 93 student's tuition that year) on top of his pension. One day I was bored of analysing my own data, so I spent a harrowing afternoon looking up all the properties the uni had available for rent (the uni, or it's subsidiaries, none of the many private companies parasitising off the students' housing needs). I worked out that they had a turnover of around £25 Million a year, just in rent. They are currently building more student housing. I later looked up the uni's publicly available accounting document; the last financial year had a turnover of £400M, and a profit of £40M (even after all the building work across multiple campuses and paying massive bonuses to top staff I've never seen). Despite this, the finance department are busily bullying the academic staff into cutting costs while delivering better lectures and bringing in even more grant money (bit more difficult what with Brexit looming over our heads), and they are not-so-quietly threatening to close either the physics or engineering department (physics has been struggling to meet their student recruitment targets, so they fined them...no, I don't know how an institution can fine itself for not getting enough money either - BUT - Engineering, despite getting more students in and exceeding their targets, is more expensive to run per student and the building is currently having the asbestos removed...again, so it's still a toss up). That's not an empty threat either; they've closed a department before (and NOW some of you know exactly where I'm at). What we can be fairly confident in is that the business school is safe. All their students need is Excel, and that may go some way towards explaining why they get all the new comfy chairs and plush carpets.\n\nOne last example, because I think it is particularly germane: In order to charge £9k/year, the universities must demonstrate to the government that they are 'committed' to outreach to young people from disadvantaged backgrounds. As part of my PhD program I am required to carry out a certain number of hours of outreach (I'm not complaining, it's mostly pretty fun, but that it was a requirement was confusing to me until I found out the finial incentive). I have therefore met many people from the uni's outreach team, and every single one of them when I 'sarcastically' suggest 'Maybe not charging them nine grand a year would encourage these students to come here,' they all (unironically) agree with me. They know exactly what is needed, but whenever they propose grants for disadvantaged local students, or similar, it is immediately shot down as too expensive. It's all especially fervent in STEM, where there is a special box you get to tick if your outreach event would encourage young girls to come to you (and yea, it really does sound that creepy in the meetings too) - it's all pretty ineffectual though, because to get science students at all, they need to take the science classes at school; so really we'd need to target children before they're 11 (after this pupils in the UK pick their subjects for high school, and if you don't pick sciences then, most schools won't let you take it later \\[because they're worried you'll drag their average marks down\\]). Despite this, most of our outreach is targeted at high schools and specifically 16-18 year olds (because that yields more immediate results in student uptake). I was involved in a multi-university effort in this vain, so I know it's not a unique issue to us. All of this activity, which is good as far as it goes, could be massively improved by the university as a whole having a genuine desire to educate rather than primarily be to make money. \n\nOh, did I forget to mention they're all registered charities?\n\nI could go on about how the profit-driven attitude provides some very perverse incentives for everyone, or specifically talk about how much they are courting Chinese students obsessively (I am of course happy we're educating the world, but they are targeting China more than the the non-European world combined, and it's nakedly about money), and I won't go into too much detail about the companies (who have no internal training programs) I've heard complain graduates don't have the exact specific skills they need, but sufficed to say; I am getting my doctorate and fucking off to be unemployable somewhere else.",
      "author": "Beeblebroxologist",
      "created": 1569680238,
      "upvotes": 27,
      "replies": {
        "f1ph0aw": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1ph0aw/",
          "text": "wow. that got away from me",
          "author": "Beeblebroxologist",
          "created": 1569680256,
          "upvotes": 3,
          "replies": {}
        },
        "f1u24kd": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1u24kd/",
          "text": "Just FYI you mentioned in the US that only private universities charge anything near 9k a year, and I would love to see one cost that much. Private unis cost on average 30-45k USD a year in tuition, and yes SOME students might get a full scholarship but most will on average take out 15-20k in loans per year at most private universities. Public universities can cost as much as 15k a year. I go to one and let me tell you a lot of students (even low income ones) are paying close to that amount without any aid except loans.",
          "author": "conceptalbums",
          "created": 1569753448,
          "upvotes": 2,
          "replies": {
            "f1xnjgn": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1xnjgn/",
              "text": "Thank you. It's always nice to find out things are even worse than you expected. I'm sure our chancellors are looking over at the ivy league thinking 'one day, maybe we too can be as extortionate as you'\n\n(seriously I was expecting 'expensive' to be about $22k+...what the hell do you even get for $45k? plus rent, textbooks, food, and most importantly booze to forget how much you're overpaying Almost all the information in the classes is on Youtube now)\n\nI'd like to thank our corporate overlords for saddling an entire generation with insurmountable debt at the exact moment in history when radical change is necessary. yay.",
              "author": "Beeblebroxologist",
              "created": 1569801057,
              "upvotes": 2,
              "replies": {
                "f1yxbaw": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1yxbaw/",
                  "text": "Surprisingly the ivy leagues actually are typically generous with aid if you are lower or middle class. I know a lot of people who go to these universities practically for free (who are also incredibly smart and represent like 0.01% of students). However there are a lot of private universities in the US that aren't that prestigious and charge 45k a year while not being able to give so many scholarships. And a lot of naive teenagers sign up to go them and pay near full price.",
                  "author": "conceptalbums",
                  "created": 1569827076,
                  "upvotes": 2,
                  "replies": {
                    "f21gb05": {
                      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f21gb05/",
                      "text": "That sounds like pure debt trap.",
                      "author": "Beeblebroxologist",
                      "created": 1569871891,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f1p7odv": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p7odv/",
      "text": "We are all part of the neo-liberal machine.",
      "author": "reversechinlock",
      "created": 1569674328,
      "upvotes": 37,
      "replies": {}
    },
    "f1qdyra": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1qdyra/",
      "text": "what choice do they have? Universities used to be heavily publicly funded. Increasingly they are not. If they cannot rely on public funds they must rely on donations, asset management and look to their students as sources of income. They have to essentially operate as hybrid businesses/charities if they wish to continue existing. Ultimately universities can remain sites of debate and education if the general public wishes them to be so. Politically I'd say at the the trend is against that\n\nI will say though that many western universities, for all their business minded characteristics, are still nonetheless critical sites of education. If you want to compare, look at what passes for university education in countries such as India. Bad as things are with the Americas, Brits or Australians, they could be much much worse. A college student still retains a much higher chance of accessing diverse opportunities if they graduate from a mid-tier American university in contrast to even a top tier Indian university.",
      "author": "boringhistoryfan",
      "created": 1569698822,
      "upvotes": 5,
      "replies": {}
    },
    "f1p9d5y": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p9d5y/",
      "text": "YES. Ireland.",
      "author": "lacanimalistic",
      "created": 1569675522,
      "upvotes": 11,
      "replies": {}
    },
    "f1pgrii": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pgrii/",
      "text": "Go read Bill Reading’s The University in Ruins, published in 1996.",
      "author": "amishius",
      "created": 1569680106,
      "upvotes": 3,
      "replies": {}
    },
    "f1qgohh": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1qgohh/",
      "text": "All the admins sitting on the board of my university (40,000 undergrads in a big city) all are CEOs or executives for large companies in my province.",
      "author": "PM_MOI_TA_PHILO",
      "created": 1569700401,
      "upvotes": 5,
      "replies": {}
    },
    "f1r8nm8": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1r8nm8/",
      "text": "Yes!!!  United States.\n\nEven though most traditional institutions are not-for-profit, it doesn't mean that there is not someone getting rich. I was fortunate enough to have a professor in my Ph.D. program who was also on the board of trustees.  He was not afraid to tell it like it was and said that one of his main functions on the board was to wine and dine alums to get them to increase donations postmortem (i.e. in their wills). And....he got paid over 500,000 a year to do that (in addition to the perks of the fancy office, designated parking spot, etc.). \n\nHe talked about how much football and basketball coaches make, and how sports directly impacts admissions (which he supported with institutional historical data).  \n\nHe talked about how he was the ONLY member on the board with a background in education.  All the others were businessmen, lawyers, finance people, etc. Given how much power the board has, and the fact that it was run by a bunch of businessmen, it made total sense that the university essentially is a business.  Just instead of making stockholders rich, the money is used to increase salaries of higher admins, expand the campus in some way, or increase endowments for future endeavors.",
      "author": "fresnel_lins",
      "created": 1569712525,
      "upvotes": 4,
      "replies": {}
    },
    "f1s7tob": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1s7tob/",
      "text": "Have been for awhile. Australia.\n\nFor example, the Masters of Engineering courses in this country are condensed bachelors courses minus the support with very little prospect for integrating into industry. Theyre cash grabs attracting international students mostly. Engineering degrees are almost always bachelors here with an integrated internship component while the graduate version is obsolete and only really attracts international students.\n\nIt's highly unethical.",
      "author": "LatteFairy",
      "created": 1569725309,
      "upvotes": 5,
      "replies": {}
    },
    "f1ss9jx": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1ss9jx/",
      "text": "In a capitalist society, it would be foolish to think that universities would not eventually be decoded by flows of capital.",
      "author": "sereptie",
      "created": 1569733340,
      "upvotes": 4,
      "replies": {}
    },
    "f1pj0kq": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pj0kq/",
      "text": "All North America for sure. The desire to link degrees directly to jobs is strong with new mandates every week it seems.  \"Yes, I'd like you to pay me for work in my field of research which is the semiotics of French literature\". \"Uh, no. We hired you to serve coffee.\" \n\nAdministrators are frequently, usually, complicit in this goal.  It is a form of violence against learning and especially against humanities.",
      "author": "gutfounderedgal",
      "created": 1569681790,
      "upvotes": 3,
      "replies": {}
    },
    "f1pt2ar": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pt2ar/",
      "text": "absolutely agree with this 100%, I'm in the US",
      "author": null,
      "created": 1569687659,
      "upvotes": 2,
      "replies": {}
    },
    "f1q6h5w": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1q6h5w/",
      "text": "US University here, with a reputation for this type of behavior.  \n\nHowever our new president has declared an enrollment cut in order to counter this trend, so it looks like there is movement from the top to reverse it.  \n\n[https://www.gwhatchet.com/2019/09/23/enrollment-decrease-could-boost-rankings-decrease-revenues-experts/](https://www.gwhatchet.com/2019/09/23/enrollment-decrease-could-boost-rankings-decrease-revenues-experts/)",
      "author": null,
      "created": 1569694505,
      "upvotes": 2,
      "replies": {}
    },
    "f1q259p": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1q259p/",
      "text": "[deleted]",
      "author": null,
      "created": 1569692116,
      "upvotes": 4,
      "replies": {
        "f1roh1f": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1roh1f/",
          "text": "Personally I have heard this argument from many well intentioned folks. I must say, critical thinking is the cornerstone of sciences, and I often find that a lot of folks making pro - humanities / social sciences arguments (typically from humanities departments) sorely lack critical thinking, and are driven more by social injustice related and emotional arguments. As an example, anthropology is no longer classified as a science in US. The field has been taken over by folks who want to use the subject for social change. This movement increasingly makes me think that humanities have lost their place in modern universities. Sciences and mathematics have and deserve to be the center.",
          "author": "pravaasi2019",
          "created": 1569718133,
          "upvotes": 0,
          "replies": {
            "f1rqir3": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1rqir3/",
              "text": "We cabtvhave just sciences or just humanities at the center. They're all necessary.",
              "author": "Average650",
              "created": 1569718885,
              "upvotes": 6,
              "replies": {}
            },
            "f1u2vfj": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1u2vfj/",
              "text": "Hasn't humanities and social sciences fields ALWAYS been used for social change? Isn't the sole point of any academic field to create positive change through acquisition of knowledge (for both sciences and humanities)?",
              "author": "conceptalbums",
              "created": 1569753711,
              "upvotes": 3,
              "replies": {
                "f21ayz5": {
                  "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f21ayz5/",
                  "text": "Simply trying to understand doesn't necessarily mean trying to change something (except, of course, in the butterfly-effect else). \n\nNaturally, most people do want to change something about something, because of human experience and human nature being what they are. But not everyone wants to change the same things about the same things. Positivity is in the eye of the beholder. \n\nNevertheless, humanities and social sciences have increasingly become echo chambers by bullying and shaming those with the \"wrong\" perspectives and priorities. Some of that is economically driven. Incentives are always ultimately economic.\n\nAnd in the arts, newer doesn't mean better, it just means newer. (It also doesn't mean worse--it still just means newer.)",
                  "author": "Vaux_",
                  "created": 1569870056,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f1pvrob": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pvrob/",
      "text": "They are a business though.",
      "author": "Doofangoodle",
      "created": 1569688946,
      "upvotes": 2,
      "replies": {}
    },
    "f1qkeel": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1qkeel/",
      "text": "I want to take issue with the definition of \"business minded\" in the OP. To refer to \"business-minded\" as \"churning graduates without any regard for jobs or educational achievement\" is a really inaccurate picture of how successful and effective businesses work. It's a good picture of bad businesses, however. \n\nBackground: I did a sabbatical in 2017-2018 with a business -- global corporation, traded on the NYSE -- and I was shocked at how great it was. The workplace culture valued creativity, hard work, and intellectual achievement. Everyone was valued. There were no politics, no drama, no BS. Good ideas were welcome and went from discussion to prototyping within weeks (instead of months or years in academia). Yes, the bottom line was shareholder value and making money. But this place really cared about the means by which this was achieved and the people who made it happen, from bottom of the org chart all the way to the top. It was most certainly not mindlessly pumping out product with no regard for quality or process. \n\nI've learned that there are a _lot_ of companies out there like this. Also lots of companies that are terrible. But also lots of universities that are terrible -- and even the universities that aren't terrible wouldn't be killed by looking at businesses and asking what they do that really works, and how the effective practices could be forked into something that works for academia. \n\nSo in the sense of the company I worked for being innovative, creative, and caring toward its people, I'd say that universities are not nearly business minded _enough_.\n\nMore here: https://rtalbert.org/sabbatical-lessons-part-4/",
      "author": "Rtalbert235",
      "created": 1569702467,
      "upvotes": 2,
      "replies": {}
    },
    "f1rlg1h": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1rlg1h/",
      "text": "Uhh yeah..",
      "author": "norar19",
      "created": 1569717071,
      "upvotes": 1,
      "replies": {}
    },
    "f1tz3yw": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1tz3yw/",
      "text": "Being \"industry minded\" can be beneficial, as long as the ethics are the best of industry.\n\nWith regards to students, a lot of UK universities see them as customers now, which is a telling fact in and of itself.  However, some universities look after their customers, but others do just milk them and sell a shoddy product.",
      "author": "HexesOfVexes",
      "created": 1569752288,
      "upvotes": 1,
      "replies": {}
    },
    "f1s34bw": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1s34bw/",
      "text": "Absolutely not. On the contrary, they’re more like inefficient and wasteful government bureaucracies in which individuals seek to maximise self-interest.",
      "author": "cilbirwithostrichegg",
      "created": 1569723539,
      "upvotes": 1,
      "replies": {}
    },
    "f1p9dqb": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1p9dqb/",
      "text": "No. United States. \n\nUniversities _aren't_ just churning out graduates without regard for job or educational achievement. Almost all universities offer a wide range of programs, some specifically for educational purposes where jobs are slim and don't pay much (music programs come to mind). They give you, a free thinking individual, a choice in what you want to pursue in your education, while also making you aware of the job availability and earning potential of that degree path, especially if you ask. \n\nYour comment about international students seems extremely out of place. What does it matter to you and your earning potential or educational pursuits if the university is accepting more international students for the additional money? Why would you assume the university isn't interested in providing educational opportunities to international students the same way they are for you? Do you know if the profit margin between the two is that much different (ie its more expensive for the university to accept international students). \n\nThe university has always been a business. They still manage to serve a public service and provide educational opportunities that don't directly translate to profit.",
      "author": "thenickpick",
      "created": 1569675533,
      "upvotes": -18,
      "replies": {
        "f1pgvux": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pgvux/",
          "text": "[deleted]",
          "author": null,
          "created": 1569680181,
          "upvotes": 10,
          "replies": {
            "f1qjdnh": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1qjdnh/",
              "text": "The chancellors and any other academic faculty of universities get paid quite reasonable amounts for the job they do, a few 100,000 dollars usually, rarely a million. FAR lower than CEOs of actual corporations. The highest paid employees of universities are usually in the athletic program, football and basketball coaches, etc., who get paid multi-million dollar salaries, which has always baffled me. Only in US. In a university, the academic faculty should be the highest paid.",
              "author": "smilingbuddhauk",
              "created": 1569701986,
              "upvotes": 2,
              "replies": {}
            },
            "f1phg9y": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1phg9y/",
              "text": "I don't see how any of the salaries of university leaders impacts your own earning potential or educational pursuits.",
              "author": "thenickpick",
              "created": 1569680571,
              "upvotes": -6,
              "replies": {}
            }
          }
        },
        "f1pl1qc": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1pl1qc/",
          "text": "I disagree.  Higher Ed is becoming more akin to a business than it used to be.  That's why we see so many useless degrees being created.  Those degrees attract students who aren't forward thinking enough to see how their degrees won't lead to a good income.  Accepting international students for the higher tuition is also a dirty secret of academia.",
          "author": "powerman5002",
          "created": 1569683055,
          "upvotes": 3,
          "replies": {}
        },
        "f1qiye9": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1qiye9/",
          "text": "Lol, US? The home of the hypocritical free market is the biggest culprit of all. There are many other countries which do it as an actual public service without regard to profit because they are not run like businesses. Bad for them but good for society.",
          "author": "smilingbuddhauk",
          "created": 1569701713,
          "upvotes": 3,
          "replies": {
            "f1qnevf": {
              "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1qnevf/",
              "text": "Why is there such an insistence for things to be bad for nonprofit and public services? Why can't they provide great services and get paid well for it? How would that be any less good for society as a whole?",
              "author": "thenickpick",
              "created": 1569703698,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f21c4xq": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f21c4xq/",
          "text": ">while also making you aware of the job availability and earning potential of that degree path, especially if you ask.\n\nThey really don't, most of the time. They mislead, misdirect, and stonewall. The population we serve is among the most vulnerable in society.  Our students turn to the university for help and guidance, and it responds by deceiving and robbing them. It has become a real tragedy.",
          "author": "Vaux_",
          "created": 1569870460,
          "upvotes": 1,
          "replies": {}
        },
        "f24mcxm": {
          "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f24mcxm/",
          "text": "US universities often recruit international students for one reason: the tuition money. To do so they often loosen their admission standards. A friend is an administrator at a well-known relatively expensive private university. This is discussed explicitly. They've actually hired more ESL tutors with experience in particular languages to account for the under-prepared and less than english-fluent students they're bringing in to account for all the American students eligible for financial aid. Curriculum rigor (especially their Masters programs) has suffered.",
          "author": "RubusPhoenicolasius",
          "created": 1569955532,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f1sp721": {
      "link": "/r/AskAcademia/comments/daf4pp/do_you_think_universities_are_becoming_too/f1sp721/",
      "text": "They are becoming too liberal and denying free speech!",
      "author": "Bhopali2",
      "created": 1569732057,
      "upvotes": -2,
      "replies": {}
    }
  }
}