{
  "sid": "p4hevg",
  "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/",
  "title:": "Does it make sense to do another master, or should I apply for a PhD?",
  "text": "I graduated in March 2021 with a master's degree in International Relations. I am currently working full-time as a trainee but the job does not fit with my studies at all. As soon as my contract expires I would like to pursue another degree.\n\nThe fact is that I am interested in doing a PhD concerning war studies or military history. However, I do not feel prepared at all. The degree in international relations that I got covered a great variety of topics without going into detail. Therefore, I am thinking about doing another master which specifically deals with war, strategy and/or military history. \n\nDoes it make sense? Or should I start reading loads of books and literature reviews in order to familiarize with those topics to finally find a research gap on which I could work on in a PhD?",
  "author": "Abi55o",
  "created": 1628979674,
  "updated": 1634079599,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "h8z60pk": {
      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h8z60pk/",
      "text": "What's your goal with all these degrees?",
      "author": "mediocre-spice",
      "created": 1628988714,
      "upvotes": 14,
      "replies": {
        "h90cjm3": {
          "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h90cjm3/",
          "text": "Good question. One of my goals is to work in think tanks as a researcher or an analyst. The most renowned and prominent institutes that deals with IR and geopolitics require high level of education to work there... Many analysts/researchers have PhDs or at least got a MA degree in prominent universities. Working in the field of international relations is extremely competitive therefore the titles you have make the difference...",
          "author": "Abi55o",
          "created": 1629015270,
          "upvotes": 1,
          "replies": {
            "h924vck": {
              "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h924vck/",
              "text": "I guess it's worth thinking about if it's the title or the actual experience/skill set. Usually working for 2 years in the field is more valuable than a second master's. What valuable employable-at-a-think-tank thing are you gaining from a master's or PhD in history that you don't have from your IR master's or spending equivalent time working at a think tank or even doing a PhD in IR? In general, a history PhD is going to be training to be a professor in history and you'll have to think about if that transfers.",
              "author": "mediocre-spice",
              "created": 1629051466,
              "upvotes": 4,
              "replies": {
                "h9291w0": {
                  "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h9291w0/",
                  "text": "After some thinking, I ended up with your same conclusions. It doesn't make sense to do another MA, especially in a subject like history. I should move on to do a PhD in IR or related fields (e.g. war studies, security studies etc.).",
                  "author": "Abi55o",
                  "created": 1629053256,
                  "upvotes": 2,
                  "replies": {
                    "h92h1jc": {
                      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h92h1jc/",
                      "text": "Good luck!",
                      "author": "mediocre-spice",
                      "created": 1629056756,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h8zbjdl": {
      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h8zbjdl/",
      "text": "No, try to wiggle into a job with the education you have. I don't recommend taking on debt for the chance of an opportunity in such a narrow area. Have you considered teaching? You might want to market yourself to some of the elite private schools. You'd be surprised of the opportunities that come to teachers. Many don't have the interest or ability to pursue them, but you seem like you would. I've seen grants for teachers to study abroad, etc. Further, you could get scholarships and professional development funding to help you increase your expertise. This might help you build a bridge toward the direction you want to go. Through all of this, you might land yourself a nice museum job or something. Get a master's in library science, and you might secure yourself a job in a library. And don't think small about libraries. You could land in one of the military libraries or one of many special archival institutes that exist. Good luck on pursuing your dream!",
      "author": "Hot-Pretzel",
      "created": 1628991486,
      "upvotes": 6,
      "replies": {
        "h90d1gs": {
          "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h90d1gs/",
          "text": "I would not disdain to work in libraries or museums! However, as I said in another answer, my main goal is to work as an analyst/researcher in a think tank. Teaching is another valid option but I would only consider academia, even though it is a highly competitive environment... I don't know if I want to teach in high schools...",
          "author": "Abi55o",
          "created": 1629015701,
          "upvotes": 2,
          "replies": {
            "h92c6me": {
              "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h92c6me/",
              "text": "Understood. I was trying to think of ways to keep you involved in your area of interest while also growing your expertise and connections in that realm. Sometimes you gotta go through a side door vs. a front door. I hope it all works out for you.",
              "author": "Hot-Pretzel",
              "created": 1629054617,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h8zg8ga": {
      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h8zg8ga/",
      "text": "Military history is a *tough* field, because a lot of people are interested in pursuing it, but there are very few jobs in it.  (I say this as a professional historian.)\n\nSo, do think about your potential career.  Are you dead-set on becoming a professional historian/academic (in military history)?  \n\nOr is this an interest that can be pursued from other angles?",
      "author": "DerProfessor",
      "created": 1628993900,
      "upvotes": 5,
      "replies": {}
    },
    "h90fq6f": {
      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h90fq6f/",
      "text": "Personally, two Masters comes over as a bit indecisive to me.  Seems like you picked the first one wrong, so immediately you get hit with a poor decision making process assessment. \n\nProgressive education is fine (Masters followed by PhD).  Personally (without considering how hard it may be to get a career in this track), I would go for the PhD in military history.  When all said and done, military history IS a subfield of international relations.",
      "author": "Life_time_learner",
      "created": 1629018123,
      "upvotes": 5,
      "replies": {
        "h90gdd7": {
          "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h90gdd7/",
          "text": "Yeah, it is what I am thinking... The fact is that I liked my master a lot, but in the end it gave me a broad knowledge in the field of international relations which, on the one hand, is good because I know a bit of everything (security studies, strategic studies, IR theory, history, terrorism and counterterrorism, technology, etc.) but, on the other hand, I don't know anything in detail. Therefore, if I want to specialise in warfare I cannot do it at the moment which is why I was thinking to do another master's degree that deals with that narrow topic. \n\nThat being said, I think you made a good point. A PhD would make more sense.",
          "author": "Abi55o",
          "created": 1629018714,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h8ypaj1": {
      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h8ypaj1/",
      "text": "You should try and see if you can get PhDs in your desired role with the background you have. If you get them at a decent instituted go ahead with it.  A second masters may be needed if a PhD requires you to have a masters in the specific subject. \n\nIf you get a PhD with the degree you have, you'll catch up with most works in the first year and be in a decent position to start actually working and publishing second year onwards.",
      "author": "_TheCosmicPotato_",
      "created": 1628980311,
      "upvotes": 2,
      "replies": {}
    },
    "h90s148": {
      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h90s148/",
      "text": "So you got done at school and work...at learning...and are wondering if you should go back to more or lots more school?  \n\n1) you’d probably benefit from moving across the country, getting a junky apartment, a d working as a waiter for a year.  You wont do this though.\n\nSo\n\n2) the PhD.  Masters are what a Bachelors was ten years ago. Meaningless.",
      "author": "DesertAlpine",
      "created": 1629028375,
      "upvotes": 2,
      "replies": {
        "h90tywo": {
          "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h90tywo/",
          "text": "I think I didn't get the tone of your comment... Are you angrily criticizig my choices? I like my current job but it does not reflect what I've studied at the university. Besides, as a trainee I earn 600 euros per month, which is a misery, so I don't need life lessons :) \n\nI am thinking to return studying to do my dream job. That's all.",
          "author": "Abi55o",
          "created": 1629029708,
          "upvotes": 1,
          "replies": {
            "h90w34c": {
              "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h90w34c/",
              "text": "I gave you two alternate pieces of advice, both solid in my opinion and thus likely to be hated by the comrades if Reddit",
              "author": "DesertAlpine",
              "created": 1629031059,
              "upvotes": -3,
              "replies": {
                "h91rrvz": {
                  "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h91rrvz/",
                  "text": "Telling OP to abandon their home and social network to  go work as a waiter (I like how you assumed OP's gender there) in one of the lowest paying, unstable sectors which would provide no relevant experience for OP is solid advice because?",
                  "author": "ACatGod",
                  "created": 1629045993,
                  "upvotes": 1,
                  "replies": {
                    "h923100": {
                      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h923100/",
                      "text": "What gender did I assume?\n\nIt is solid advice because OP needs to get out of Academia for awhile.  When you have a masters, are in a training program, and are considering getting a second masters.... some fresh perspective would be fitting.  \n\nReading between the lines, it seems things ate not going so hot and OP’s plan, as is a very human and common mistake, is simply to double down.  Maybe it is the right call, but there is no rush. \n\nMeanwhile, while the life of a waitress is not glamorous, it has none of the academia type stresses that OP could use a break from.  It might have other stresses, but my one friend who chose that life says it’s easy and stress free—he works half the year and climbs mountains the other half.",
                      "author": "DesertAlpine",
                      "created": 1629050676,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h95n3xq": {
      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h95n3xq/",
      "text": "You do not need a PhD of any kind to work as an analyst at a think tank. That is a junior-mid position that many people get with a BA and a couple internships. Your MA in IR is more than enough academic preparation for this type of work. If you are striking out in analyst jobs with your IR MA, this is probably attributable to one or more of the following:\n\n* You have inadequate internship/work experience. \n\n* Your job materials need work (resume presentation, cover letter, interview performance...) Sometimes and depending on the type of analysis you want to do, you may need to scrub your social media also.\n\n* You are simply not applying to enough jobs.\n\nThe broad policy field is steeped in credentialism, so I get where people get the idea that they need infinite degrees to enter, but the number one quality it requires is tenacity. Successful early-career applicants have a variety of degrees of different levels and different prestigiousness, but what they have in common is a strong relevant work history (which for those of us who don't have rich parents requires some tightening of the proverbial belt, working two jobs, living with 5 roommates...) and good networking skills (and probably some zygote of a professional network). Certainly a prestigious master's program can help you access internships, alumni, other opportunities - but the HKSs of the world pump out hundreds of grads who end up never working a day in their field, whereas the actual policy field is simultaneously full of grads of the University of Bosnia and Herzegovina and similar. \n\nWhich is to say, who's to say whether you should do a PhD, a masters, or whatever -but you should def do more thinking about it.",
      "author": "thegreenaquarium",
      "created": 1629121748,
      "upvotes": 2,
      "replies": {
        "h9622oh": {
          "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h9622oh/",
          "text": "Thank you very much! The fact is that I feel that among many candidates I won't be chosen... I think that people who got their degrees in more prestigious universities will always have the priority, especially for jobs in renowned, highly competitive think tanks (e.g. ISPI, Carnegie, RAND, CFR, IISS, etc.). However you centred the key point: I do not have the required working experience needed to increase my chances. Moreover, I do not came from the last university of the world, on the contrary it is one of the most important in Italy and Europe (University of Bologna). I need to find more motivation and believe more in my capabilities of course. \n\nThank you, you have been very useful!",
          "author": "Abi55o",
          "created": 1629127999,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h9ejies": {
      "link": "/r/AskAcademia/comments/p4hevg/does_it_make_sense_to_do_another_master_or_should/h9ejies/",
      "text": "If you are considering continuing your studies with an additional master but you are not sure of pursuing the PhD, I invite you in evaluating the research master as an intermediate solution.\n\nThe main reasons are the following: \r  \n•\tIn the end you will get another master degree as any other master \r  \n•\tThe classes are very personal and small \r  \n•\tYou have the chance to study all the argument of any other master but in a more personal and fine-tuned manner if compared with another master \r  \n•\tYou may access to the PhD in case you decide to continue your studies",
      "author": "flelli",
      "created": 1629291049,
      "upvotes": 2,
      "replies": {}
    }
  }
}