{
  "sid": "potwzp",
  "link": "/r/AskAcademia/comments/potwzp/how_to_transition_out_of_grad_program/",
  "title:": "How to transition out of grad program?",
  "text": "First of all, my PhD. Has been a nightmare and I think I'm ready to finally just call it quits and leave with a masters. I don't want to really go over the reasons why I'm leaving (if you're interested check out my post history), but I probably should have left a long time ago. \n\nI'm mostly looking for advice on how to leave gracefully. I can definitely get a job as an engineer, hopefully closer to my family, but there are people here who don't want me to leave. Whether it's because it would reflect really poorly on them or because I do a significant amount of their jobs I don't know. \n\nHas anyone else been in a similar situation? I'll definitely burn bridges no matter how much I try not to.",
  "author": "AlternativeNeat124",
  "created": 1631724417,
  "updated": 1634078983,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hczhlj9": {
      "link": "/r/AskAcademia/comments/potwzp/how_to_transition_out_of_grad_program/hczhlj9/",
      "text": "I had 2 friends in my PhD each leave. One because she was just tired of a laundry list of things and the other to pursue cannabis cultivation (which he is crushing it in now). In both cases there was a bad taste in the mouth of the PIs over their students leaving, of course none of the grad students cared because we all secretly wish we would just give in and do the same. You need to do what is best for YOU. You really only need to find 2-3 people willing to provide you with a letter of recommendation for your next job. There will be pushback, but if you are determined and have made up your mind they will eventually accept your decision.",
      "author": "BronzeSpoon89",
      "created": 1631732940,
      "upvotes": 3,
      "replies": {}
    },
    "hdaey65": {
      "link": "/r/AskAcademia/comments/potwzp/how_to_transition_out_of_grad_program/hdaey65/",
      "text": "\"Burning bridges\" means that you do something that sabotages your relationship with people. People simply being upset about you choosing to leave one job for another isn't really you burning any bridges; you can't control how other people react.\n\nI didn't leave my PhD, but I did leave a postdoc I'd planned to do for 2-3 years after one year because I realized that academia was not for me. After I had secured a job, I just sat down with each of the people who needed to know and straight out told them. I had negotiated about six weeks of notice with my role, so I had come up with a plan for how to wrap up my projects and to whom to hand them over. I didn't give a reason, and nobody asked me to.",
      "author": "roseofjuly",
      "created": 1631934500,
      "upvotes": 3,
      "replies": {
        "hdajg75": {
          "link": "/r/AskAcademia/comments/potwzp/how_to_transition_out_of_grad_program/hdajg75/",
          "text": "I'm glad everything worked out for you, but I know if I leave I can't count on any kind of reference from anyone I've worked with. My name will probably be removed from any of the research I've already done. I know it's not ethical, but my advisor is a big enough name to get away with it.\n\nI was already talked out of quitting once, and I've heard all the threats. This really will be me throwing a lot of work away. I guess I just need to convince myself I'm ok with that.",
          "author": "AlternativeNeat124",
          "created": 1631937013,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hczr5o8": {
      "link": "/r/AskAcademia/comments/potwzp/how_to_transition_out_of_grad_program/hczr5o8/",
      "text": "I don’t have all the answers here, but if you don’t want any room for them to negotiate to keep you, an “I’ve decided to complete my education at the masters level and so I’ve accepted a great job and will be moving closer to my family.” is pretty hard to argue with (on their end) as far as reasons for resigning/leaving the program. Maybe a “What do I need to wrap up in my last two weeks here?” would be a nice touch. Good luck! Let us know how it goes.",
      "author": "REC_HLTH",
      "created": 1631736743,
      "upvotes": 2,
      "replies": {
        "hdcx0j6": {
          "link": "/r/AskAcademia/comments/potwzp/how_to_transition_out_of_grad_program/hdcx0j6/",
          "text": "Thanks, still looking for a job but I'm trying to be hopeful. I actually did try to quit about a year ago but I was talked out of it. Not sure how I'm going to handle leaving, but it's probably not going to be a two weeks notice thing, I'm just going to have to leave. I'm expecting retaliation.",
          "author": "AlternativeNeat124",
          "created": 1631988281,
          "upvotes": 2,
          "replies": {
            "hddfa84": {
              "link": "/r/AskAcademia/comments/potwzp/how_to_transition_out_of_grad_program/hddfa84/",
              "text": "I hope it all works out for you. I’m sorry it’s a hard time.",
              "author": "REC_HLTH",
              "created": 1631995799,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}