{
  "sid": "kfkybb",
  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/",
  "title:": "Quitting Prof job",
  "text": "Hi all, i was wondering if I could get some opinions or advice to the following situation: i’m in my seventh year of assistant professorship, three of these tenure track US and four of these in a permanent position (UK).   I am getting ready to apply for promotion. However there are a few issues. First my spouse and child absolutely do not like it here and want to go back to previous country. Second, i’ve been working my ass off especially post covid. I have ten undergrads, five PhD students, led two courses this semester with over 100 students in them. I do the grant applications (not going great but there are small steady funding amounts) and the publishing thing (very productive despite not having many resources or time).... I had to remodel my two courses to work remotely because of  Covid whilst homeschooling. Well: just got my evals back and students loved the first module but absolutely hated the second! That one is a difficult, technical subject which is mandatory and half of them usually really loathe it even during non covid times. Others who are more interested love it—- smh. The spread of these evaluations goes from “best course i ever had” to “i’m gonna change my degree now”... I think I might be having an oncoming burnout or something but I just ... want to quit..... right.... NOW! I’m normally calm and rational but i feel like I am trapped in a nightmare. \n\nI got scared of myself and have just taken leave over the holidays to let all of this settle - i normally never take any time off since i started in academia about 20 years ago- but i think i want to try getting into a different job. I’ve applied to a museum job on a whim the other day and they want to interview me. The more i think of it the more i like the idea of doing something practical that isn’t such a terrible 80 hour/week slog all the fucking time. I’m so tired and nothing is ever good enough. \n\nOn the other hand it’s a secure job with benefits and they allow me to do my “research” at night times and weekends .... \n\nI’m so confused.",
  "author": "Fabulous_Ad_4788",
  "created": 1608297454,
  "updated": 1634080683,
  "over_18": false,
  "upvotes": 204,
  "upvote_ratio": 0.99,
  "comments": {
    "gg93qbb": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg93qbb/",
      "text": "I think the middle of an extremely stressful pandemic is a)not the time to get down on yourself for bad student evals b) not a great time to make snap major life decisions.  \n\nI would take a long vacation over winter break and then do next semester and see how you feel next summer.",
      "author": "abandoningeden",
      "created": 1608301328,
      "upvotes": 255,
      "replies": {
        "gg9hra4": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9hra4/",
          "text": "Okay.. i needed to hear that. Just keep going on and make plans in the meantime. Thank you.",
          "author": "Fabulous_Ad_4788",
          "created": 1608308508,
          "upvotes": 85,
          "replies": {
            "ggaeaao": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggaeaao/",
              "text": "btw u shouldn't care too much about evaluations. If some student had problems with distance learning (taking tests with cameras etc.) they tend to reflect it on these evaluations.\n\nIn fact, I didn't even know schools cared about evaluations. I kinda just fill them whatever.",
              "author": "ergele",
              "created": 1608322307,
              "upvotes": 23,
              "replies": {
                "ggagh9i": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggagh9i/",
                  "text": "Evals are necessary for most of us to keep our jobs...",
                  "author": "Fabulous_Ad_4788",
                  "created": 1608323252,
                  "upvotes": 31,
                  "replies": {
                    "ggc57mo": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggc57mo/",
                      "text": "Undergrads don't know that. They're burned out and frustrated too and that definitely comes out in evals. I thought it was just venting into the ether and helping future students (ours were public for course registration) as an undergrad.",
                      "author": "mediocre-spice",
                      "created": 1608358631,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gg90n7o": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg90n7o/",
      "text": "What you describe is a classic stress/ poor MH response to the work conditions you are in right now. Revisit this after your leave, talk with your family and see how you feel.",
      "author": "dr_LauraM",
      "created": 1608299442,
      "upvotes": 77,
      "replies": {
        "gg9hvob": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9hvob/",
          "text": "Thank you - i never had any mental health probles but maybe they can creep up unnoticed?",
          "author": "Fabulous_Ad_4788",
          "created": 1608308562,
          "upvotes": 28,
          "replies": {
            "gg9z1xr": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9z1xr/",
              "text": "This is how mental health issues usually reveal themselves.  They’re creepy AF.",
              "author": "MrsAlecHardy",
              "created": 1608315743,
              "upvotes": 42,
              "replies": {
                "ggaa4nk": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggaa4nk/",
                  "text": "I feel like my brain suddenly blew a fuse. Its a bit scary...",
                  "author": "Fabulous_Ad_4788",
                  "created": 1608320500,
                  "upvotes": 17,
                  "replies": {
                    "ggai23f": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggai23f/",
                      "text": "Are you possibly peri-menopausal? Peri-menopause can be a big blow. I’m not at all trying to invalidate your feelings and experiences, just asking whether it may be helpful to view them through the lens of menopause. If you’re in your 40s or 50s, it might be helpful to visit the menopause subreddit.",
                      "author": "boldolive",
                      "created": 1608323947,
                      "upvotes": 15,
                      "replies": {
                        "ggaipo9": {
                          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggaipo9/",
                          "text": "No, not yet. But a good idea.",
                          "author": "Fabulous_Ad_4788",
                          "created": 1608324230,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    },
                    "ggbqfjk": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbqfjk/",
                      "text": "please be very careful. The last time I felt my mind blew a fuse, I went into a long spell of depression!",
                      "author": "sudthebarbarian",
                      "created": 1608348342,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ggaca70": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggaca70/",
              "text": "Yep, absolutely. I went to my doctor a few years ago and said I felt like I was heading for burnout. She was saying that I shouldn’t work anything over 50 hours a week, and I said, “You don’t understand. I feel like I can’t work 20 hours a week.” She responded, “Oh, you’re already burned out!” So it’s good you’re taking a leave - you need to heal, and then reassess.\n\nAs well, remember that everyone is fragile right now - I was very distressed to find that my students HATE online teaching. It took quite a few of my colleagues reminding me that a) them hating online teaching isn’t a direct reflection on my teaching, and b) they hate all their classes, every year, at the end of the term. \n\nSo hang in there. You can leave the profession, head held high, if it’s not giving you what you need, but don’t make any big life decisions until you are well.",
              "author": "Felixir-the-Cat",
              "created": 1608321436,
              "upvotes": 23,
              "replies": {}
            }
          }
        }
      }
    },
    "gg9lovy": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9lovy/",
      "text": "The students can really wear you down. Same fir one of my classes — the interested l,engaged students love it, the rest despise it, and me. \nThis is, unfortunately, the job.\nBe strong, but follow your heart.",
      "author": "mmilthomasn",
      "created": 1608310164,
      "upvotes": 19,
      "replies": {
        "gga1yy5": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gga1yy5/",
          "text": "As someone deeply wise once said: \"h8ers gonna h8 m8\".\n\nYou'll never please everyone. Focus on the ones who love your classes.",
          "author": "peregrin5",
          "created": 1608316981,
          "upvotes": 9,
          "replies": {
            "ggal0e8": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggal0e8/",
              "text": "They saw you rollin' (out the exams), they hatin'",
              "author": "fuckwatergivemewine",
              "created": 1608325223,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gga2nx1": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gga2nx1/",
      "text": "A crisis either clarifies or confuses. You have to decide which one this is for you.\n\nYou have already been working eight years then you know what it was like before the crisis. Honestly, none of us know what it’s going to be like years down the road.",
      "author": "DavidDPerlmutter",
      "created": 1608317279,
      "upvotes": 16,
      "replies": {
        "ggaxrcn": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggaxrcn/",
          "text": "Your flair claims “dean”. If this was the response from my dean, I’d walk.",
          "author": "DeadMeat-Pete",
          "created": 1608331632,
          "upvotes": -3,
          "replies": {
            "ggb0k2t": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggb0k2t/",
              "text": "Even deans get it tough. Let's cut her/him some slack. They have less teaching, but as a senior administrative person myself, managing academics is like hearding cats.",
              "author": "schumpter81",
              "created": 1608333168,
              "upvotes": 9,
              "replies": {
                "ggbbdkh": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbbdkh/",
                  "text": "Yeah and when someone comes to you in crisis do you tell them to suck it up or get them help.  \n\nBest advice is to take leave, talk to someone (psychologist), and negotiate reduction in workload.  If it means teaching then there will be less research or vice versa.  \n\nYes us academics is very much like herding cats.   I find that admin people have literally no idea of what we do and how much time work takes up for us.  Academics are either burnt out or highly driven people, all of us want to lead our research domain.  Inevitably that means lots of hours that go unrecognised by the institution and if you have a shit boss, which this person clearly has, you end up burnt out.\n\nTeaching is not just a few hours face to face, as a minimum you need to double for prep time, plus admin load plus out of hours student contact plus marking.  Then you add on research student management, honours students.  \n\nThen there’s research\n\nThen there’s networking\n\nThen there’s industry engagement \n\nThen there’s assessing and reviewing journals, grants etc\n\nThen there’s dealing with administrative work that people like yourself create without thinking who it impacts.  \n\nI’m not surprised this poor person is doing 80hrs a week.  I stopped doing that years ago and said fuck promotions.  I’ll do my best, but I’d rather enjoy my family.",
                  "author": "DeadMeat-Pete",
                  "created": 1608339364,
                  "upvotes": 2,
                  "replies": {
                    "ggbvevb": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbvevb/",
                      "text": "I mean, does your institution have deans that aren’t faculty members?",
                      "author": "sunlitlake",
                      "created": 1608351561,
                      "upvotes": 1,
                      "replies": {
                        "ggc4cnq": {
                          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggc4cnq/",
                          "text": "[No](https://en.m.wikipedia.org/wiki/Dean_(education))",
                          "author": "DeadMeat-Pete",
                          "created": 1608357920,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "ggbbbje": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbbbje/",
              "text": "I’m saying that this person should not make a hasty decision until they know what they really want. What advice would you give?",
              "author": "DavidDPerlmutter",
              "created": 1608339331,
              "upvotes": 5,
              "replies": {
                "ggbe1ph": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbe1ph/",
                  "text": "Negotiate with your boss, if the boss says no, go to their boss. it’s a work health and safety issue,  the institution is liable (they are in my country).  I know I can press the HR button and seal mediation. You are a dean you should understand mechanisms that a person in crisis can use. Give good advice that helps not general bs.",
                  "author": "DeadMeat-Pete",
                  "created": 1608340923,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gga0lfj": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gga0lfj/",
      "text": "I've been there.  I tried applying to museum jobs and talked to museum employees about it and my sense was that it was basically impossible to get a job, and there was no money once you did.  I couldn't even convince my local science museum to let me volunteer.  Plus museums aren't even open right now...\n\nI think there's nothing wrong with wanting a different job.  A lot of the people I've met from the US who went to England for academic positions really regret it.\n\nThe main thing is to figure out what you want to do.  Maybe there are data-related industry jobs that will be interesting for you and high paying?",
      "author": "dampew",
      "created": 1608316394,
      "upvotes": 14,
      "replies": {
        "ggahkig": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggahkig/",
          "text": "What do the other UK transplants complain about?",
          "author": "Fabulous_Ad_4788",
          "created": 1608323731,
          "upvotes": 5,
          "replies": {
            "ggasdlf": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggasdlf/",
              "text": "My friends were Asian in STEM, so they primarily complained about the cultural issues of living in small towns (eg Cambridge or Oxford or smaller).\n\nBut I think they also feel trapped on more than one front.  They don't get a ton of funding, salaries are low, and they don't have a huge local research community.  So they don't have a ton of personal funds saved up, they don't have a lot of research results that can help them move somewhere, and it can be difficult to find productive collaborations.",
              "author": "dampew",
              "created": 1608328747,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "gga2wic": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gga2wic/",
      "text": "Did you move from UK->US or the other way around? \n\nI'd recommend never making drastic moves that cannot be undone. Changing positions, especially when under strain, could lead to an even worse situation. The job security of a tenured (equivalent) position is nothing to scoff at these days.\n\nYou've pointed out some nasty aspects of academia. The final backbreaker by your account is student evals after some hard effort. I'd take those with a grain of salt. It's hard to please everyone, especially in trying times (especially in the US, if that's where you are). \n\nRegarding the work hours (80). It really depends on whether you still like your academic work. Maybe you're taking on too much, and have to say \"no\" to more things?\n\nBest wishes.",
      "author": null,
      "created": 1608317382,
      "upvotes": 13,
      "replies": {}
    },
    "ggac83l": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggac83l/",
      "text": "Protip: Wait til you're promoted before you do anything drastic, then you hopefully won't be starting from scratch later.",
      "author": "leftseatchancellor",
      "created": 1608321410,
      "upvotes": 10,
      "replies": {
        "ggaj2v7": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggaj2v7/",
          "text": "Yes. I will try to hang on till then.",
          "author": "Fabulous_Ad_4788",
          "created": 1608324389,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gg91v96": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg91v96/",
      "text": "As soon as I read the statement about your spouse and children not liking US, I was convinced that you should leave. Academia will eat up your whole life if you let it! Also there is a r/leavingacademia  that might be helpful to you and a recently published book called leaving academia. I’m reading it now and it speaks to my soul. I’m planning my exit and will do it soon!",
      "author": "curlzzz545",
      "created": 1608300206,
      "upvotes": 24,
      "replies": {
        "gg99t2t": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg99t2t/",
          "text": "The way I read it, they're currently in the UK and the spouse and kid want to go back to the US.",
          "author": "icantfindadangsn",
          "created": 1608304608,
          "upvotes": 23,
          "replies": {
            "gg9egiv": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9egiv/",
              "text": "If they're in the UK, I would highly consider moving back to US because of brexit and the chance that funding may be extremely harder to get once all EU grants are off the table (which is what it looks like may happen).",
              "author": "rosealyd",
              "created": 1608307023,
              "upvotes": 22,
              "replies": {
                "gg9i6pi": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9i6pi/",
                  "text": "This is also very stressful. At least in the US we have a stake in the game. But the working conditions... ugh.",
                  "author": "Fabulous_Ad_4788",
                  "created": 1608308690,
                  "upvotes": 13,
                  "replies": {
                    "gg9jktj": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9jktj/",
                      "text": "What about Canada?",
                      "author": "rosealyd",
                      "created": 1608309275,
                      "upvotes": 8,
                      "replies": {
                        "gg9l32g": {
                          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9l32g/",
                          "text": "Thats where i have the interview next week. We shall see how it goes.",
                          "author": "Fabulous_Ad_4788",
                          "created": 1608309908,
                          "upvotes": 20,
                          "replies": {
                            "ggakane": {
                              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggakane/",
                              "text": "Best of luck!",
                              "author": "icantfindadangsn",
                              "created": 1608324911,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "ggatswn": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggatswn/",
                      "text": "If you really hate higher ed in the US, you might consider private K-12. You have control of your curriculum, and the benefits and the pay us usually equivalent. All without the expectation that you will write grants, run research groups, or serve on committees.",
                      "author": "Lady-Jenna",
                      "created": 1608329515,
                      "upvotes": 5,
                      "replies": {
                        "ggbgscu": {
                          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbgscu/",
                          "text": "How does a professor find a job in private K-12?",
                          "author": "curlzzz545",
                          "created": 1608342506,
                          "upvotes": 2,
                          "replies": {
                            "ggd18d3": {
                              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggd18d3/",
                              "text": "When I was planning my exit from academia, I was approached by a headhunting service called Carney Sandoe and Associetes. I recommend approaching them if you're interested. Schools pay them to find qualified candidates, and they do all of the leg work to find you a slate of positions you might be interested in. I cannot recommend them highly enough.",
                              "author": "Lady-Jenna",
                              "created": 1608388538,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gg9h8bj": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9h8bj/",
              "text": "Yes that’s the way it is",
              "author": "Fabulous_Ad_4788",
              "created": 1608308285,
              "upvotes": 6,
              "replies": {
                "gg9x41h": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9x41h/",
                  "text": "As a Brit, I’m sorry we have been a bit shit :(",
                  "author": "Pinkisnotmyfavcolour",
                  "created": 1608314924,
                  "upvotes": 9,
                  "replies": {
                    "gga9roc": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gga9roc/",
                      "text": "No its okay there are some really nice people here but my significant other has an accent and there is a lot of xenophobia towards him at his job. I understand that he’s sick of it.",
                      "author": "Fabulous_Ad_4788",
                      "created": 1608320341,
                      "upvotes": 9,
                      "replies": {
                        "ggabkgu": {
                          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggabkgu/",
                          "text": "This makes me so sad. I’m sorry he has gone through this. \n\nMy boyfriend was born in the UK to Italian parents. He is slightly brown and gets abuse for it. People are awful.",
                          "author": "Pinkisnotmyfavcolour",
                          "created": 1608321124,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ggaa7uf": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggaa7uf/",
          "text": "Thanks for the sub referral and the book- will read it now.",
          "author": "Fabulous_Ad_4788",
          "created": 1608320540,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gg9rb0v": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9rb0v/",
      "text": "Feel your pain brother. Same here - but senior lecturer. I would ignore all evaluation during this period. Stop wasting time on grants and cut down the publishing to the minimum to meet ref. Also, renegotiate a lower teacher workload with your Dean. Frame it as a \"don't abuse me or risk losing me\" conversation.",
      "author": "schumpter81",
      "created": 1608312529,
      "upvotes": 7,
      "replies": {
        "gg9yqhp": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9yqhp/",
          "text": "Sister. \nThe issue with slowing down is it makes one less competitive to move elsewhere. I had the “stop loading more duties onto me” talk with the DeptHead twice but to no avail. Zero changes. There is a group of friends who give each other teaching reductions and the rest gets loaded on us. I also don’t think threatening to leave will do anything- i already figured out that I’m just cheap labor. If I go they will hire someone for less salary to do my job- its an absolute buyers market.",
          "author": "Fabulous_Ad_4788",
          "created": 1608315609,
          "upvotes": 19,
          "replies": {
            "gg9z6bc": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg9z6bc/",
              "text": "Ha. Sorry, just an expression (I think brother can be gender neutral in this case!). \n\nSeems like you're in a toxic department. That sound rubbish. If your profile is as you say have you thought about moving. If it's buyer's market you sound like you are at the right end of the market from your comments. My h index is not sadly. Too much admin and teaching over the years...",
              "author": "schumpter81",
              "created": 1608315795,
              "upvotes": 4,
              "replies": {
                "gga9wne": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gga9wne/",
                  "text": "Yes I’m browsing jobs. Just not sure if i really like academia anymore.",
                  "author": "Fabulous_Ad_4788",
                  "created": 1608320401,
                  "upvotes": 2,
                  "replies": {}
                },
                "ggadphg": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggadphg/",
                  "text": "Well, just to throw out the implicit assumption that Reddit is all men + academics are all men, and also I am pretty dang sure brother is very, very gendered. It’s all ok but just pointing out gender dynamics (with no judgement)!",
                  "author": "tacobellisadrugfront",
                  "created": 1608322056,
                  "upvotes": 4,
                  "replies": {
                    "ggahfpu": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggahfpu/",
                      "text": "There's no assumption Reddit is all men. Not on my part. It's just an expression (maybe poorly phrased). My response is and was the same regardless of gender. These issues effect us all... (Overworked, ref etc) Jesus I feel exactly the same as the poster. It's been a crappy year.",
                      "author": "schumpter81",
                      "created": 1608323674,
                      "upvotes": 5,
                      "replies": {
                        "ggaio0u": {
                          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggaio0u/",
                          "text": "I didn't mean you in particular! Just my experience as a woman on this site for 5+ years.",
                          "author": "tacobellisadrugfront",
                          "created": 1608324210,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ggbgo4j": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbgo4j/",
          "text": "I’d be careful about negotiating. Somebody in my department negotiated and he was let go just like that.",
          "author": "ProfessorNoChill99",
          "created": 1608342438,
          "upvotes": 2,
          "replies": {
            "ggcbm9l": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggcbm9l/",
              "text": "In the UK higher ed is highly unionised. it would be hard / expensive for the uni to do this. Not impossible, but unlikely.",
              "author": "schumpter81",
              "created": 1608364516,
              "upvotes": 1,
              "replies": {
                "ggcddml": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggcddml/",
                  "text": "We’re unionized too. Contract not renewed just like that. Gone.",
                  "author": "ProfessorNoChill99",
                  "created": 1608366289,
                  "upvotes": 1,
                  "replies": {
                    "gghhb39": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gghhb39/",
                      "text": "Oh I see, it was a fixed term role. Sorry my misunderstanding.",
                      "author": "schumpter81",
                      "created": 1608477950,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "gghhu5w": {
                      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gghhu5w/",
                      "text": "Oh I see, it was a fixed term role. Sorry my misunderstanding.",
                      "author": "schumpter81",
                      "created": 1608478166,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ggbahej": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbahej/",
      "text": "I’m tenured and thinking about the same things. The ONLY reason I’m staying on is that I’ve time to do my research. If you don’t absolutely live for your research, get the fuck out. It’s thankless and academia is in absolute peril. I say get out while you are marketable. Get raises every year so you can actually retire one day.",
      "author": "glitterbomb80",
      "created": 1608338849,
      "upvotes": 3,
      "replies": {}
    },
    "ggcc9ji": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggcc9ji/",
      "text": "Regarding the museum opportunity find out how they are funded. So many museums are having issues now with funding drying up you want to ensure you’d have a job in a year. \n\nWe are in a pandemic world right now. I don’t think it’s a good time to make a move in any industry. If you have job stability in your current position which you apparently do, try to stick it out until the global economy stabilizes.",
      "author": "Emily_Postal",
      "created": 1608365162,
      "upvotes": 3,
      "replies": {
        "ggcesrh": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggcesrh/",
          "text": "Thank you for your comment- the museum job is an endowed position, i calculated it would pay around 10 yrs of my salary. Our uni had to cut jobs last year already.",
          "author": "Fabulous_Ad_4788",
          "created": 1608367768,
          "upvotes": 3,
          "replies": {
            "ggcf1vp": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggcf1vp/",
              "text": "That’s reassuring. Disregard my previous comment as it doesn’t apply and good luck with whatever you do.",
              "author": "Emily_Postal",
              "created": 1608368040,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ggarcgu": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggarcgu/",
      "text": "Which semester were these courses in? Tbh, if those evals came from sbd out of the first semester, let them change their degree, it's definitely not your fault! Maybe they changed their decision on the subject after their first real insights...",
      "author": "GreeenPeppper",
      "created": 1608328211,
      "upvotes": 2,
      "replies": {}
    },
    "ggb6b5z": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggb6b5z/",
      "text": "I had a nervous breakdown 2 days ago. I am glad to hear you took some time of by yourself. The things that you are saying got me worried. I'm glad you took the time off",
      "author": "loser-two-point-o",
      "created": 1608336405,
      "upvotes": 2,
      "replies": {
        "ggstksa": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggstksa/",
          "text": "Thank you for your support",
          "author": "Fabulous_Ad_4788",
          "created": 1608734693,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ggbe8cg": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbe8cg/",
      "text": "Don't think that you should base your assessments on evaluation from the students. If the promotion doesn't depend on that, I wouldn't care. \n\nIf it's a secure job, speak to your family. In these times, many are jobless.",
      "author": "ommahakaal",
      "created": 1608341030,
      "upvotes": 2,
      "replies": {}
    },
    "ggbfh8r": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbfh8r/",
      "text": "Hmm, it depends on your culture. In my culture, family is paramount (given that their reasons for hating life where my career is at are legit reasons, and not fluffy snowflake reasons). Fuck Academia if it means divorce and my kid wasting their future.\n\nNow, if you're going to go for the direction of \"Screw Academia,\" make sure you don't screw those under you. Talk to them, give them honest plans (no, don't hide shit, don't hide the big picture, don't hide \"information you think isn't necessary for my students to know because they'll underperform if they know it\"-assumption based information. Prepare for all of them a plan of what they have to do, and even after you leave - you don't formally have the duty to, but - I believe you're obligated to help them and not waste years of their lives.\n\n====== Now this is a part that has heaps of assumptions and is a bit biased against you, don't feel offended by any of that though; just consider it part of the reddit collective ======\n\nAnyway, that's for my culture. But since you've mentioned that you've been working your ass off, maybe that's why your family is pissed. I'd suggest to get closer to your family and have a long talk with them (you're already in tenure, you know, it's a good thing) and understand their perspective, understand their problems, and then see a way to solve these problems.\n\nYou're a goddamn professor. If you do half the therapies you do with your PhD students with your family, you'll find a billion solutions. Just calm down, don't take more than you can handle (assistant professors, unfortunately, have to act like rabid dogs after publications to get to the next step. Just slow down and relax or you'll lose a lot, being a year late for the promotion on a tenure track isn't the end of the world) and get your shit together. Leaving a country - and a career set in stone - is a big decision.",
      "author": "EgyptianPhD",
      "created": 1608341752,
      "upvotes": 2,
      "replies": {}
    },
    "ggb14ck": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggb14ck/",
      "text": "No one else gonna point out “post-covid”? Lmao it ain’t done yet esp in the US/UK",
      "author": "guttata",
      "created": 1608333482,
      "upvotes": 1,
      "replies": {}
    },
    "ggbjoqq": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbjoqq/",
      "text": "Rather than quit academia, perhaps you could make time off a regular part of your routine?",
      "author": "nrnrnr",
      "created": 1608344217,
      "upvotes": 1,
      "replies": {}
    },
    "ggbwl8z": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggbwl8z/",
      "text": "COVID has made everyone rethink their life and evaluate the pros and cons of the choices they’ve made. Personally I had a panic of job security and was desperately seeking for a new position. Even though my job wasn’t in jeopardy at the time, it could have been if certain factors (which Covid affected later on) changed. I managed to move up the chain with help from a VP in the company. Turns out if you’re nice, well-liked, and ask for help, good things may come to you. When you’re seeking change, if you do your best you can find your perfect place. I happened to love my new job, able to work remotely and there plenty of overtime if I want it, or plenty of time off if I prefer to have short days for myself. Pretty much found my niche in life and I hope you do too! Try not to stress out too much and make a risky decision but if it seems like a good idea, it’s best to try and see how it goes. I always weigh the pros and cons but everyone’s situation is different. Best of luck! 👍",
      "author": "IcyYouThere",
      "created": 1608352349,
      "upvotes": 1,
      "replies": {}
    },
    "gg8y0s7": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg8y0s7/",
      "text": "Edit: this is a throwaway account",
      "author": "Fabulous_Ad_4788",
      "created": 1608297681,
      "upvotes": 1,
      "replies": {
        "gg91607": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg91607/",
          "text": "Is there still something you want to know? You created yourself by your writings. Is there something you would miss afterwards? Would you stop writing? What would you read instead if you got an other job? What forces would it liberate and how would you invest your free time?  Are there more important questions to you? What would you like to explore next? Becoming an academic is an exceptional creation of a self. Who would you become afterwards? .. Just ask and let it flow. Don’t judge.",
          "author": "laplanda",
          "created": 1608299771,
          "upvotes": 10,
          "replies": {
            "gg93nqr": {
              "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gg93nqr/",
              "text": "These are very great thoughts thank you very much! I will take time to work through them once i submitted my grades. \n\nI think for me the situation is a bit different from some other academics- i’ve basically constantly been running away from poverty and unemployment. There wasn’t a lot of opportunity to pause and think about what else I could do. But i don’t have that much of an ego or feeling of self worth in the sense that I get gratification from status or the promises of big research grants or people liking my papers. I’d be just as productive and happy if not more in any other job. The main reason of why i ended up in academia is a sense of curiosity and ability to understand numbers well, and i like to serve by solving problems, and doing project work. just need to think about whether this could be done in some other type of employment.",
              "author": "Fabulous_Ad_4788",
              "created": 1608301286,
              "upvotes": 9,
              "replies": {
                "ggadrtu": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggadrtu/",
                  "text": "You've got a great perspective on this, I think. End of the day, it's a job. It's not who you are, it's not a \"calling\"-- which means a job where you're underpaid and underappreciated. Like driving a truck or sitting behind a cash register-- it's a job. \n\nMy s.o. and I did not have the location discussions and went where the work was. Increasingly I think this was a bad call. In particular, it's really been a bad problem with local schools and opportunities for enrichment with the family. Definitely talk stuff over with your s.o.\n\nAlso, please consider posting here again when you make the decision. There are far too few stories about the outcomes of decisions like these, and it would really help those of us considering similar moves.",
                  "author": "7Sax",
                  "created": 1608322085,
                  "upvotes": 8,
                  "replies": {}
                },
                "gggvnu6": {
                  "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/gggvnu6/",
                  "text": "Your post just crossed my mind agin because I am taking a difficult decision right now, too. \n\nBefore even answering questions and making decisions, I will try to come up with my own way of thinking (because that’s the way we people in the humanities are being trained, we have to think about our thinking first..) So I just decided to use all non-academic ways of thinking I have access to in order to think about academia itself. I just took this decision because I easily get trapped into my rational thinking (even while having an emotional decision to make about my career). \n\nSo I bought a book about visual thinking and tried some other creative techniques to link metaphorical thinking towards rationality. It helped me a little to come up with new ideas but then, I tried to apply my very own method of decision making. In your case, it would be something like making 4 lists with either good or bad aspects in both ways (quitting or staying). Cross out the intuitively/emotionally more easily to find least important arguments for quitting or staying on each list. The result should be a positive list with the most important arguments for leaving or staying. \n\nIf you think about the problem in the traditional way (by asking “what are the best arguments on both sides” “why should I stay/quit”) you tend to use a way of thinking that has already been criticised by Ancient Greeks. But it’s ‘via negativa’ - by reversing your question - that you can find other solutions you would never have thought of in an active way by asking positively. This strange mixture of using logic and emotion tricks you into following your intuition while using an intellectual framework.. and it even uses negative emotions for rationality.\n\nWell, have fun taking your decision, I will just take a walk and discuss my lists again with a friend :)",
                  "author": "laplanda",
                  "created": 1608467513,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ggac1mq": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggac1mq/",
      "text": "[deleted]",
      "author": null,
      "created": 1608321330,
      "upvotes": -1,
      "replies": {
        "ggafeut": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggafeut/",
          "text": "I don’t mind this comment because I know the insane competitiveness very well and what it does to people. Good luck stranger forging your path in Academia.",
          "author": "Fabulous_Ad_4788",
          "created": 1608322794,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ggajgmq": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggajgmq/",
      "text": "How anybody could prefer the US over the UK is beyond me. Really? I’d move out of here in a heartbeat if I could.",
      "author": "TeeDiddy324",
      "created": 1608324554,
      "upvotes": -3,
      "replies": {
        "ggakm3x": {
          "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggakm3x/",
          "text": "Family",
          "author": "Fabulous_Ad_4788",
          "created": 1608325051,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ggayhkw": {
      "link": "/r/AskAcademia/comments/kfkybb/quitting_prof_job/ggayhkw/",
      "text": "As a student who’s dealt with burnt out professors, take that break, and leave if you don’t feel the burning desire. Please and thank you.",
      "author": null,
      "created": 1608332025,
      "upvotes": -4,
      "replies": {}
    }
  }
}