{
  "sid": "qvl5k4",
  "link": "/r/AskAcademia/comments/qvl5k4/is_getting_a_degree_in_science_education_worth_it/",
  "title:": "Is getting a degree in Science Education worth it?",
  "text": "Hello everyone, I am a current undergraduate in physics going to a state school and am currently looking through different options for grad school. One I see is potentially going into a PhD in Science Education. Ultimately I want to become a college professor (university or community college) but I don't know if a degree in Science Ed will help me be on that track. Ideally I would like to teach physics, but my problem with getting a PhD in Physics is Physics education research programs are extremely limited in California and my true passion is with researching education. Any advice or input would be extremely helpful! Thank you!",
  "author": "CabinLeaderAdrian",
  "created": 1637105079,
  "updated": 1637180876,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkxmcim": {
      "link": "/r/AskAcademia/comments/qvl5k4/is_getting_a_degree_in_science_education_worth_it/hkxmcim/",
      "text": "If you get a PhD in science education, you'd be qualified to be an education professor, not a physics professor. You'd be teaching people to teach science.",
      "author": "apple-masher",
      "created": 1637113916,
      "upvotes": 5,
      "replies": {
        "hkymopc": {
          "link": "/r/AskAcademia/comments/qvl5k4/is_getting_a_degree_in_science_education_worth_it/hkymopc/",
          "text": "It seems you could also be hired into a teaching-intensive position. I know of someone like that. TT, teaching stream.",
          "author": "user963852",
          "created": 1637133353,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl0mgbx": {
      "link": "/r/AskAcademia/comments/qvl5k4/is_getting_a_degree_in_science_education_worth_it/hl0mgbx/",
      "text": "In general, if you want to be a professor, you would need a PhD in that field and perform research. In fact, most of your time will be spent on research, not teaching.",
      "author": "NorthAd7013",
      "created": 1637173110,
      "upvotes": 1,
      "replies": {}
    }
  }
}