{
  "sid": "hpvh00",
  "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/",
  "title:": "Using title 'Dr.' on resume",
  "text": "If you hold a PhD and were applying to non-academic jobs, would you include the title 'Dr.' before your name on the top of the resume? (Dr. John Doe)\n\nOr would you write as follows? (John Doe, PhD.)\n\nOr would you just list that you have a PhD in the education section? (John Doe)\n\nOn my academic CV I just write my name (John Doe) because education is the first item listed. From what I've seen my supervisors format their CVs the same way.\n\nFor a resume in a non-academic sector however, education is often listed further down the resume and is easily lost under nebulous headings like \"skills\".\n\nI couldn't find any authoritative take on the matter published online. Links or suggestions are welcome.\n\nI want to foreground the fact I have a PhD as this would likely separate me from many other candidates. However I am concerned about coming across as too formal or elitist.\n\nWith more PhD holders pushing non-academic careers I wonder what the convention is regarding this question.\n\nEdit: Thank you everyone who replied. The most popular opinion is to write John Doe, PhD (when crafting a CV in North America).\n\nThat's also what I agree with and will do.",
  "author": null,
  "created": 1594565020,
  "updated": 1634081149,
  "over_18": false,
  "upvotes": 165,
  "upvote_ratio": 0.99,
  "comments": {
    "fxu1cfu": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu1cfu/",
      "text": "I've seen \"John Doe, PhD\" but not \"Dr. John Doe\". \n\nYou could also just list education first if that's what you want to emphasize. If you've recently finished, your PhD is your most recent job. You can rearrange/deemphasize it once you have relevant industry jobs.",
      "author": "mediocre-spice",
      "created": 1594566268,
      "upvotes": 211,
      "replies": {
        "fxu8yjq": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu8yjq/",
          "text": "I could be wrong but I wonder if this is somewhat country dependent because I've very rarely seen the [name], PhD format in the UK or Europe, I've mainly seen this with people from the US/Canada. I always felt it looked a bit... excessive until I realised that it must be normal over there.",
          "author": "Chlorophilia",
          "created": 1594570455,
          "upvotes": 60,
          "replies": {
            "fxuii6a": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuii6a/",
              "text": "Having trained and worked on both sides of the Atlantic, my impression is that the suffix (PhD, MD, etc etc) is more frequent in North America. The exception is is medical doctors in the UK (FRCS etc), and honors (FRS, OA, MOF, xBE etc)\n\nThis is a complete guess based on personal experience, but much of bio/medical science in North America happens in medical schools. In that context it’s useful/important to distinguish medical doctors from doctoral level scientists, which the prefix Dr doesn’t.",
              "author": "ccots",
              "created": 1594575382,
              "upvotes": 38,
              "replies": {}
            },
            "fxvtdod": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvtdod/",
              "text": "Yup. Name, PhD is the standard in the US. Dr. Name comes off as a tad pretentious, so Masne, PhD is low-key.",
              "author": "karenaviva",
              "created": 1594601360,
              "upvotes": 14,
              "replies": {}
            },
            "fxubalh": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxubalh/",
              "text": "I don't think it's typical even in the US. Just the name is more standard.",
              "author": "mediocre-spice",
              "created": 1594571698,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "fxu3802": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu3802/",
      "text": "I'd go with John Doe, PhD because it's less ambiguous. Dr. John Doe could hold an MD, DBA, EdD, or even a JD.",
      "author": "croak_monsieur",
      "created": 1594567346,
      "upvotes": 66,
      "replies": {
        "fxvvlsz": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvvlsz/",
          "text": "JD would be John Doe, Esq., there's not a single JD in the USA that would be referred to as Dr. John Doe.",
          "author": "IIIIllllllIIIll",
          "created": 1594602720,
          "upvotes": 7,
          "replies": {
            "fxvze1j": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvze1j/",
              "text": "[deleted]",
              "author": null,
              "created": 1594605036,
              "upvotes": 10,
              "replies": {
                "fxw0dn5": {
                  "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxw0dn5/",
                  "text": "Maybe he had another degree. And a JD is not referred to as Dr. in the US - I don't care what examples of crackpots people come up with.",
                  "author": "IIIIllllllIIIll",
                  "created": 1594605646,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "fxvwhbx": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvwhbx/",
              "text": "The only reason I included that one is that I've actually worked with a guy who had a JD and signed his correspondence as Dr. Doe. He was adamant that a Juris Doctor degree meant just that.",
              "author": "croak_monsieur",
              "created": 1594603257,
              "upvotes": 3,
              "replies": {
                "fxy6r0s": {
                  "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxy6r0s/",
                  "text": "Best counter to that argument: ask them why a masters degree (LLM) comes after the JD.",
                  "author": "ManInBlackHat",
                  "created": 1594661840,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "fxw1git": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxw1git/",
              "text": "Tell that to some German clients that my father had a little while ago.",
              "author": "1121314151617",
              "created": 1594606318,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fxu1y5q": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu1y5q/",
      "text": "I do Jane Doe, Ph.D. Putting the doctor before would be like having Mr. Joe Doe on your resume, which is weird",
      "author": "NeuroscienceNerd",
      "created": 1594566620,
      "upvotes": 128,
      "replies": {
        "fxud906": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxud906/",
          "text": "I have definitely seen \"Mr. John Doe\" as a convention in other countries, but in the U.S., Jane Doe, Ph.D. is most appropriate.  I also think Prof. Jane Doe would be appropriate if that applies.",
          "author": null,
          "created": 1594572719,
          "upvotes": 16,
          "replies": {
            "fxuiqks": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuiqks/",
              "text": "My take: professor is a title associated with my current job; PhD is a qualification and effectively my license to practice my profession, so I go with John Doe PhD.",
              "author": "ccots",
              "created": 1594575503,
              "upvotes": 36,
              "replies": {}
            },
            "fxuxxpw": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuxxpw/",
              "text": "I've seen Mr. -name here- in cases when the professor only has a master's degree or a JD. At least at my university.",
              "author": "comped",
              "created": 1594583529,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fxu2ide": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu2ide/",
      "text": "Outside of academia I generally use PhD rather than dr, people assume dr means medical and some people get really weird about it, beside I feel that PhD is the info I want/need to convey. That said if your web form requires a title then I'm putting Dr because I didnt go through all that work to be Mr",
      "author": "tc1991",
      "created": 1594566944,
      "upvotes": 95,
      "replies": {
        "fxwmyal": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxwmyal/",
          "text": "> I'm putting Dr because I didnt go through all that work to be Mr\n\nI only have a M.S. but I remember a family friend being so excited when she received her first piece of junk-mail with Dr. $HerName on it.",
          "author": "ochaos",
          "created": 1594622246,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fxucbcf": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxucbcf/",
      "text": "English professor, resume consultant, and former technical writer here. If the job you're applying for requires a PhD, or if your PhD is relevant to the job, then go with John Doe, PhD. If you're changing careers altogether and your advanced degree isn't relevant to the job, then go with John Doe.  If the doctorate isn't required for the job, then styling yourself as a PhD at the top of the resume could strike the hiring manager as pretentious. People outside the academy and the hard sciences tend to have a different view of PhDs than those of us in the academy. \n\nIf you're an American, do not go with Dr. John/Jane Doe because, as one commenter pointed out, people will think you're a medical doctor. When they find out you're not, they won't think of it as a misunderstanding; they'll think you misled them.  I can't speak to how any other countries assume about terminal degrees, but in the US, the title \"Dr\" means medical doctor to most people.",
      "author": "Opening_Doors",
      "created": 1594572236,
      "upvotes": 41,
      "replies": {
        "fxuulro": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuulro/",
          "text": "I just wrote this below, it's exactly like that even in central Europe. If you use just Dr., people automatically assume you are an MD.",
          "author": "thesecondproject",
          "created": 1594581753,
          "upvotes": 7,
          "replies": {}
        },
        "fxuxct5": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuxct5/",
          "text": "So the only downside of using dr in front is people will think you mislead them and that would have a negative effect on you? But that’s not gonna be something that matters to most people that much is it, if you explain in one sentence that you’re a professor then they’re immediately gonna recognize: that’s the second thing I was thinking of and then you’re off the hook.",
          "author": "clgfangoneawry",
          "created": 1594583221,
          "upvotes": -2,
          "replies": {}
        }
      }
    },
    "fxu3odj": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu3odj/",
      "text": "In Germany (by far) and some other European countries (less so than Germany), it is ‘Dr.’ before the name in any everyday situation such as train ticket bookings. \n\n‘Name Surname, PhD’ is common in Britain and US only in non-academic sectors where ‘signalling’ matters such as company boards.\n\nIt’s quite unnecessary on a resume as your education section makes that clear.",
      "author": "cilbirwithostrichegg",
      "created": 1594567604,
      "upvotes": 47,
      "replies": {
        "fxufdp5": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxufdp5/",
          "text": "Actually in the UK it is always Dr surname. It is very uncommon to use name surname, phd. I have worked in two universities and all email signatures and CVs ive seen are Dr whoever and then sometimes post nominal letters like  FHEA or PG CERT.\n\nEdit: realised i didn't make it clear: this is true for recruiting outside academia as well.",
          "author": "need2getaclue",
          "created": 1594573814,
          "upvotes": 17,
          "replies": {}
        },
        "fxup70r": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxup70r/",
          "text": "> In Germany (by far) and some other European countries (less so than Germany), it is ‘Dr.’ before the name in any everyday situation such as train ticket bookings. \n\nAs a general rule, the degree holder gets to choose if and when he uses their \"Dr.\". In some situations, it might be wise to avoid it, for example, on a plane, where there can be some confusion when the crew needs a medical doctor and then asks the Dr. on board (yes, that happens in real life). The only time I ever used my degree deliberately was when looking for apartments.",
          "author": "ColourlessGreenIdeas",
          "created": 1594578875,
          "upvotes": 7,
          "replies": {}
        },
        "fxvmz3w": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvmz3w/",
          "text": "> 'Name Surname, PhD’ is common in Britain\n\nIt's actually very rare. I assume anyone here in the UK who styles their name this way is an American.",
          "author": "Glaselar",
          "created": 1594597447,
          "upvotes": 8,
          "replies": {}
        },
        "fxu8zsr": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu8zsr/",
          "text": "Yes I’ve heard that being common especially in East Europe (particularly Germany) - a lot of status comes from your job and title, and how you interact with others depends not as much on age, but on title.",
          "author": "cm0011",
          "created": 1594570474,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "fxu2fxh": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu2fxh/",
      "text": "I prefer (and have used) the \"John Doe, PhD\" format, as I was applying to non-academic positions after grad school. I personally wouldn't advise going with \"Dr. John Doe\", my impression being that it comes off as pretentious.",
      "author": "CamelToad13",
      "created": 1594566905,
      "upvotes": 34,
      "replies": {}
    },
    "fxu390g": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu390g/",
      "text": "For a non-academic job, I would recommend \"John Doe, Ph.D.\"\n\nIf you put \"Dr. John Doe,\" the average person is likely to think you are an MD.",
      "author": "bigrottentuna",
      "created": 1594567363,
      "upvotes": 15,
      "replies": {}
    },
    "fxu6lxg": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu6lxg/",
      "text": "> If you hold a PhD and were applying to non-academic jobs, would you include the title 'Dr.' before your name on the top of the resume? (Dr. John Doe)\n\nI hold a PhD and applied for non-academic jobs. I do not use 'Dr'. \n\n> Or would you write as follows? (John Doe, PhD.)\n\nI would/do not.\n\n> Or would you just list that you have a PhD in the education section? (John Doe)\n\nI do this.",
      "author": null,
      "created": 1594569204,
      "upvotes": 15,
      "replies": {}
    },
    "fxu72ur": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu72ur/",
      "text": "I never use titles in my c.v. or resume. The top line is education and that lists all four of my degrees.",
      "author": "SnowblindAlbino",
      "created": 1594569455,
      "upvotes": 6,
      "replies": {}
    },
    "fxv0gf4": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxv0gf4/",
      "text": "The PhD can separate you among candidates, but not always positively. Especially if people think you're overqualified for the role. Thus, I wouldn't put your phd in the name section at all unless you feel it's extremely necessary. I usually don't put any degrees after my name.\n\nIn addition, you don't need a skills section. Three sections (education, work experience, and interests or the same three but work first) can be enough. Your PhD won't get lost in a one page resume.",
      "author": "0102030405",
      "created": 1594584886,
      "upvotes": 6,
      "replies": {}
    },
    "fxu4j6m": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu4j6m/",
      "text": "It might be my bias, but I always feel like qualification lists after names come across as gauche. I'm a person, not a list of certificates.\n\nI just use my plain name, and they'll see I have a PhD in the relevant section.",
      "author": "DhatKidM",
      "created": 1594568088,
      "upvotes": 15,
      "replies": {}
    },
    "fxuw549": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuw549/",
      "text": "Outside of academia the connotation of \"doctor\" is \"medical doctor.\" You take the of risk coming off as odd, and the best case scenario is that it's neutral. Your name, comma, PhD has the same benefit with none of the risk.",
      "author": "LisneyDand",
      "created": 1594582562,
      "upvotes": 4,
      "replies": {}
    },
    "fxvd07i": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvd07i/",
      "text": "John Doe, PhD",
      "author": "photon_blaster",
      "created": 1594591704,
      "upvotes": 4,
      "replies": {}
    },
    "fxuti4j": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuti4j/",
      "text": "I think a PhD entitles you to be addresses as Dr. but most people only consider MDs to be \"doctors\". I get the point, I don't think you would win any friends calling yourself Dr. though.",
      "author": "Leptonshavenocolor",
      "created": 1594581160,
      "upvotes": 3,
      "replies": {}
    },
    "fxuuf91": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuuf91/",
      "text": "Don't know about your location but if you do this here, people automatically assume you are MD. MDs can do with just a Dr., Everyone else has to add their flavour",
      "author": "thesecondproject",
      "created": 1594581658,
      "upvotes": 3,
      "replies": {}
    },
    "fxvvgw6": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvvgw6/",
      "text": "John Doe, PhD is preferred.",
      "author": "IIIIllllllIIIll",
      "created": 1594602637,
      "upvotes": 3,
      "replies": {}
    },
    "fxu09qm": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu09qm/",
      "text": "I honestly don't know... but you're right to look for answers/perspectives. Applying for a job in a company is radically different than in academia",
      "author": "Beren__",
      "created": 1594565643,
      "upvotes": 7,
      "replies": {}
    },
    "fxuqlo5": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuqlo5/",
      "text": "I would not for the following reason. PhD indicates a level of training/learning that you achieved. Since this is a resume, I assume that it would be apparent at the top of the resume on the education section. Therefore, having it after your name is somewhat redundant. Furthermore, if this is a non-R&D position, PhD might not matter that much. \n\nI would use Name, PhD in my email signature (since there is no education description there), but absolutely not on a resume.",
      "author": "Damark81",
      "created": 1594579614,
      "upvotes": 5,
      "replies": {}
    },
    "fxu303s": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu303s/",
      "text": "A few colleagues who've applied for (and gotten) industry jobs reccomended putting it towards the back rather than right up front. From what they said, industry jobs often don't require that level of education and industry employers may be afraid to hire a PhD because they'll want a higher salary. If your degree is listed at the back at least they'll have to look at all your other credentials first rather than seeing your PhD and immediately passing you over. I have no idea if this is the norm or not since I haven't applied to anything non-academic but it does make intuitive sense.",
      "author": "asemption",
      "created": 1594567223,
      "upvotes": 8,
      "replies": {}
    },
    "fxv9jck": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxv9jck/",
      "text": "Sometimes it really comes down to the hiring manager.  I work in engineering and I have some colleagues who have turned down excellent candidates simply because they have a PhD.  In some cases I knew the candidates personally from school and knew they would be excellent on the job.  The reason for the rejection?  Managers were concerned that the PhD candidate would be spending too much time ‘theorizing’ than just getting work done.\n\n\nFor my resume, I typically go by John Doe, PhD.  But then I’ve only applied for industry positions where a PhD was a preferred qualification.",
      "author": "SleepySuper",
      "created": 1594589843,
      "upvotes": 2,
      "replies": {}
    },
    "fxvdrwz": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvdrwz/",
      "text": "On the CV, I use , PhD. In the cover letter, I use nothing, since both myself and the search chair have PhDs, so there’s no reason to indicate a level of attainment we both share.",
      "author": "mljohnson119",
      "created": 1594592126,
      "upvotes": 2,
      "replies": {}
    },
    "fxuq39i": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxuq39i/",
      "text": "in the US, First Last, Ph.D.",
      "author": "FoCoCS",
      "created": 1594579344,
      "upvotes": 1,
      "replies": {}
    },
    "fxvl9o5": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvl9o5/",
      "text": "Don’t people try to hide their PhD (as much as ethically allowed) when applying to nonacademic jobs? Most people who are more familiar with professional degrees assume that PhD is just 3-4 extra years of classes. They’d tell me after my fifth year into PhD, it is somehow because of my personal “agenda” against capitalism and wall street that I am refusing to graduate and get a real job.",
      "author": "geometer2015",
      "created": 1594596431,
      "upvotes": 1,
      "replies": {}
    },
    "fxwhslz": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxwhslz/",
      "text": "John Doe\n\nEducation: Doctor of Engineering (Information Science), XXXX OOOO University, Kingdom of Trivago\n\n------\n\n* Dr. is usually seen as M.D.\n* Using Dr. in Germany is illegal unless you graduate from their accredited universities (E.U. only?) or go through some hoops. Dr. (Dr. rer. nat. and others) is a reserved title.\n* Using Dr. is highly pretentious.\n* In my case, my awarded degree is spelled out as Doctor of Engineering (with no official abbreviation, so I usually go with D.Eng.), but I'm not a qualified/legally engineer, so I included the actual study program in parentheses to avoid squabbles against \"real\" engineers.\n* If they don't need a PhD it won't be in their face. If they do need it, they should check the education section.",
      "author": "lunaticneko",
      "created": 1594617729,
      "upvotes": 1,
      "replies": {}
    },
    "fxwrzc0": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxwrzc0/",
      "text": "In my understanding, one refers to oneself in letters/emails/etc as \"John Doe, Ph.D.\" and is referred to by others as \"Dr. John Doe\".",
      "author": "saltsage",
      "created": 1594627101,
      "upvotes": 1,
      "replies": {}
    },
    "fxwx98d": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxwx98d/",
      "text": "I think it may depend on the country where you apply. In Germany and many other european countries, the PhD title is pretty new. We usually use Dr. rer. nat. for Natural Sciences, Dr. med. for Human Medicine, Dr. iur. for Law, etc.. \nBut applying as a PhD or MD would also work in Germany since the MD is seen as an equivalent of the Dr. med. (Human Medicine), the Dr. med. dent. (Dentistry) and I think also the Dr. med. vet. (Veterinary Medicine) and the PhD is seen as an equivalent of all the other Dr. titles.\nSo at least in Germany I think it wouldn't matter if you write \nDr. John Doe, PhD or\nJohn Doe, PhD",
      "author": "Seb0rn",
      "created": 1594632542,
      "upvotes": 1,
      "replies": {}
    },
    "fxu9m2v": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu9m2v/",
      "text": "I haven't yet finished PhD, but when I have applied to the job which i got, I haven't even mention that I'm doing PhD.",
      "author": "anabdera",
      "created": 1594570804,
      "upvotes": 1,
      "replies": {}
    },
    "fxu8b6p": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxu8b6p/",
      "text": "If you're a guy then I would put PhD after your name. I encourage women to put Dr though bc, even if you put PhD after your name, a lot of people will still call you miss our mrs and not really comprehend that the PhD puts you at the same level as Dr so and so.",
      "author": "bugnerd87",
      "created": 1594570106,
      "upvotes": -1,
      "replies": {
        "fxvn5wt": {
          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvn5wt/",
          "text": "> ...and not really comprehend that the PhD puts you at the same level as Dr so and so.\n\nIf they simply don't comprehend what PhD means, why would they suddenly get it right for a man?",
          "author": "Glaselar",
          "created": 1594597559,
          "upvotes": 3,
          "replies": {
            "fxvokjp": {
              "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvokjp/",
              "text": "People assume men in higher level positions are doctors. They assume women are not. It's nothing to do with understanding and everything to do with internalized misogyny.",
              "author": "bugnerd87",
              "created": 1594598411,
              "upvotes": 1,
              "replies": {
                "fxvpa72": {
                  "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvpa72/",
                  "text": "> It's nothing to do with understanding\n\nYep, this was my point.",
                  "author": "Glaselar",
                  "created": 1594598841,
                  "upvotes": 2,
                  "replies": {
                    "fxvppcw": {
                      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxvppcw/",
                      "text": "So then you agree with me that women should put Dr. but it doesn't really matter if a man does? I'm sorry but your comment does not read like that was your point at all. Comprehending and understanding are not the same thing...",
                      "author": "bugnerd87",
                      "created": 1594599100,
                      "upvotes": -2,
                      "replies": {
                        "fxwo5i0": {
                          "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxwo5i0/",
                          "text": "I can see why you'd suggest it to another woman, but I don't agree with the approach to take. [This sort of explains my point - the whole thing is worth watching, but the relevant part comes around 4:30](https://youtu.be/J7GWHgVZJQU).\n\n> Comprehending and understanding are not the same thing...\n\n[Sure they are. They have been for over 1100 years!](https://i.imgur.com/YebOcgf.jpg)",
                          "author": "Glaselar",
                          "created": 1594623354,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fxv4nqq": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxv4nqq/",
      "text": "just your name. I would only use it in a signature. example: Yours Sincerely, Dr John Doe.  \n\n\nIn a CV I think it is selfexplanatory whether you have a PhD or not.",
      "author": "frugalacademic",
      "created": 1594587170,
      "upvotes": 0,
      "replies": {}
    },
    "fxv4jub": {
      "link": "/r/AskAcademia/comments/hpvh00/using_title_dr_on_resume/fxv4jub/",
      "text": "Bitch please, I earned that doctorate so call me Dr. Jane Doe. Your Resume/CV is the only chance you get to show off to random strangers. Wouldn’t you want to stand out among the other applicants and catch the eyes of employers. Just do what ever is comfortable to you. Everyone who thinks that it’s pretentious or inappropriate to have a title before or after your name, may be very old-fashioned in they’re ways of thinking. Also you earned that shit, flaunt it, it’s not like you we’re just handed the title. You worked your ass of and you deserve to call yourself whatever you want! Congratulations on your accomplishments and good luck!",
      "author": "rockhorr128",
      "created": 1594587111,
      "upvotes": -2,
      "replies": {}
    }
  }
}