{
  "sid": "f8fu4g",
  "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/",
  "title:": "Editor pulled book from award consideration, failed to tell contributors that she had written a book that was nominated in the same category",
  "text": "I'm a few years out of my graduate program, but I still feel like I'm figuring out the unwritten rules of academia. I have a unique situation here that I was hoping others could comment on. \n\nAbout two years ago, I was invited to submit a short piece (1,000 words) to an anthology of topics in my field. Over 50 of us had pieces included in the book. We were not paid (which we were all told upfront,) nor were the 20 or so people who edited our entries. This was a somewhat unusual situation where the person originally putting together the anthology passed away suddenly. A colleague of his (\"Dr. Smith\") took over the project and recruited all of the writers/editors. \n\nThe book did fairly well and was even nominated for an award from a well-known association in our field. Dr. Smith emailed us all with the news that the book had been nominated, but explained she was pulling it from consideration for the award. Her reasoning was that because so many of us contributed, we would unfairly skew the voting. (Association members can all vote, non-members can also vote but their votes are counted as 1/2 a vote each.) \n\nThis seemed a little weird to me, but I was going to let it go until another contributor to the book emailed all of the contributors and said that they had discovered that Dr. Smith had written a book which was nominated for the same award in the same category as our anthology. (There are only 10 nominees per category.) Dr. Smith failed to disclose this information to us in her email explaining that she was removing our anthology from consideration. The contributor who flagged this also said they had reached out to the association hosting the award and they were told that it is not a conflict of interest and Dr. Smith was within her right to pull the anthology. This contributor didn't suggest any course of action, just said they thought everyone deserved to know. \n\nWhat would you do if you found yourself in this situation? On the one hand, the anthology is technically Dr. Smith's. The cover lists her as the editor. On the other hand, she was clear in her emails as the book was being put together that she did not have much time to devote to the project, so editors and authors were encouraged to communicate directly with each other. This makes me uncomfortable about the idea that the book is \"hers,\" even though her name is the one on the cover. I'm hesitant to contact her or the award association because she is a BIG fish in our little pond. I'm also hesitant to express my concerns to the award association for the same reason, and I'm wondering if this was why the contributor who flagged this was stonewalled. \n\nThanks for sticking with my saga. Thoughts?",
  "author": "Carmelized",
  "created": 1582491804,
  "updated": 1634081285,
  "over_18": false,
  "upvotes": 145,
  "upvote_ratio": 0.98,
  "comments": {
    "filbw95": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/filbw95/",
      "text": "I would just move on, honestly, and not worry about it. \n\nSince her name is on the book, and she has another book she'd rather push, there's not much you can do but complain. And it sounds like that will only possibly hurt your career and make her and the organization mad. \n\nYou have a publication from it, and the book has been well received. That's a huge accomplishment already given how little academic publications are read. \n\nFocus your energy on your work since it sounds like this situation has progressed as far as it can.",
      "author": "gggggggggggfff",
      "created": 1582498093,
      "upvotes": 114,
      "replies": {
        "fimb6z9": {
          "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fimb6z9/",
          "text": "I agree with this. I’m a new-ish PhD and am still learning to “choose my battles” in academia. I’ve been burnt by standing up to a former advisor - big wig type person at my Uni and beyond who was abusive/toxic, etc. And it nearly led to me having to leave my program... There are SOOO many battles to choose from  - especially when it comes to transparency, equity, and power. \n\nBut, try and let this go - sometimes easier said than done. I agree it’s a odd move. But focus on the positives - you got a pub AND were initially nominated for an award. That’s still pretty awesome! And remember this if you’re ever in Dr. Smith’s shoes in the future (and do not replicate her behavior).",
          "author": "mirabelle7",
          "created": 1582523716,
          "upvotes": 17,
          "replies": {}
        }
      }
    },
    "filtjw3": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/filtjw3/",
      "text": "Congrats!  You've just learned something about Dr. Smith!  Even big fish can have big insecurities...\n\nJust be happy you contributed to such a great book, and use this to guide what projects you do with Dr. Smith in the future.",
      "author": "colohan",
      "created": 1582509995,
      "upvotes": 25,
      "replies": {}
    },
    "fildnsx": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fildnsx/",
      "text": "Welcome to academia...\n\nAs others mentioned, you can't do much here. And you'd just be bothering yourself anyways. But do keep this in mind for upcoming occasions. People in academia are also well... people, some nice and honest, some not so much... And thus such not-so-pleasing occasions are fairly common, and the best way to deal with them is to prevent them in the first place (which to be honest wouldn't be so easy with your particular situation).",
      "author": null,
      "created": 1582499234,
      "upvotes": 30,
      "replies": {}
    },
    "filhih9": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/filhih9/",
      "text": "People get into the academy with an idea that those that participate are somehow a more evolved and altruistic sort of human. In the end, people reveal themselves to be people, regardless of the circle.",
      "author": "stolid_agnostic",
      "created": 1582501711,
      "upvotes": 31,
      "replies": {
        "fincvoj": {
          "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fincvoj/",
          "text": "I’ve actually found that people higher up in academia are in general shittier than the general populace.",
          "author": "theoneandonlypatriot",
          "created": 1582560936,
          "upvotes": 5,
          "replies": {
            "find4jz": {
              "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/find4jz/",
              "text": "Perhaps a touch entitled?",
              "author": "stolid_agnostic",
              "created": 1582561085,
              "upvotes": 4,
              "replies": {
                "finnvic": {
                  "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/finnvic/",
                  "text": "Who, me or academics?",
                  "author": "theoneandonlypatriot",
                  "created": 1582566801,
                  "upvotes": 2,
                  "replies": {
                    "finodg6": {
                      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/finodg6/",
                      "text": "Academics!\n\nWow, Reddit really has become toxic if that becomes the first reading.",
                      "author": "stolid_agnostic",
                      "created": 1582567090,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fim5yo9": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fim5yo9/",
      "text": "I don't see anything particularly untoward here and I'm going to disagree with people here who are suggesting this says anything particularly negative about our Dr. Smith. While the contributor that emailed you certainly seems to see it as such, I don't think their intimation adds up to much. \n\nIf this collected volume wins the prize, it's Dr. Smith that's getting the award (as the lead editor). How does going from having a two out of ten chance to a one out of nine (or even ten) increase her odds? **Especially** as Dr. Smith notes that the voting for the collected volume would likely weigh in its favor.\n\nHonestly, this feels like Dr. Smith just doesn't want to spend time promoting an edited volume while she has another manuscript making waves. That is *entirely* acceptable and well within her rights.",
      "author": "WrestlingStuffGuy",
      "created": 1582519114,
      "upvotes": 23,
      "replies": {
        "fimxbcc": {
          "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fimxbcc/",
          "text": "> Honestly, this feels like Dr. Smith just doesn't want to spend time promoting an edited volume while she has another manuscript making waves. \n\nI agree\n\n> That is entirely acceptable and well within her rights.\n\nI mean, sure, but it's still a dick move.",
          "author": "thegreenaquarium",
          "created": 1582550006,
          "upvotes": 3,
          "replies": {
            "finbi4g": {
              "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/finbi4g/",
              "text": "> I mean, sure, but it's still a dick move.\n\nHow? \n\nAt least in my field and in cognate disciplines, if the collected volume **did** win the award, the **only** person getting any recognition out of it is Dr. Smith. The contributing editors can put it on their CV, I suppose, but it's not like it's going to move the needle for them in any real way. \n\nThis is just the lead editor signalling the volume was never the highest priority in her work, that's hardly shocking.",
              "author": "WrestlingStuffGuy",
              "created": 1582560084,
              "upvotes": 2,
              "replies": {
                "fincdav": {
                  "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fincdav/",
                  "text": "I mean, an edited volume is a priori a publication of lesser prestige, so that's our baseline for calculating needle movements. So I don't think anyone expected this to have much magnitude; in that context, I think the needle does move. Further, it sounds like a lot of the contributors might be very early-career, where general CV paucity makes everything matter more.\n\nBut, most importantly, I didn't say that OP or his collaborators should fight her on this - I just said it was a dick move. I think something doesn't stop being a dick move just because it's only a little one.",
                  "author": "thegreenaquarium",
                  "created": 1582560619,
                  "upvotes": 3,
                  "replies": {
                    "fink3td": {
                      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fink3td/",
                      "text": "Perhaps we simply have different definitions of what constitutes a \"dick move.\"\n\nYou seem to be suggesting this is a relatively minor one and I suppose I can agree to a degree there. For me, this is just a \"Enh, sure, fair enough\" matter where you shrug and move on; I don't think I'd personally hold it against Dr. Smith in any way. If you think OP might be better served to be a bit leery of working with/for Dr. Smith in the future, that's reasonable; just not the conclusion I'd necessarily draw.",
                      "author": "WrestlingStuffGuy",
                      "created": 1582564783,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fin04me": {
              "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fin04me/",
              "text": "> but it's still a dick move\n\nMeh. Dr. Smith has two volumes out right now. She can spend time and energy pushing one or the other. If she believes more in the other one, then I don't see a problem. \n\nGiving the thin \"you might manipulate the vote\" excuse is kind of crummy, but that could easily be seen as a white lie that sounds better than \"this project always had lower priority to me.\"",
              "author": "fleemfleemfleemfleem",
              "created": 1582552338,
              "upvotes": 2,
              "replies": {
                "fin0ye4": {
                  "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fin0ye4/",
                  "text": "> She can spend time and energy pushing one or the other. \n\nLeaving both nominated doesn't require any extra time or energy. Pulling one, on the other hand, not only requires energy but openly screws over its contributors, who will remember what she did forever. I'm sure no one expected her to *promote* the collection, but pulling it when it was already nominated is not the same as \"not promoting\" it. I can't begin to imagine the politics behind this decision, but I disagree that this is super casual, nothing to see here kind of stuff.",
                  "author": "thegreenaquarium",
                  "created": 1582552987,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fim66lm": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fim66lm/",
      "text": "So Dr. Smith has two books to her credit, both of which were nominated for the same award. \n\nDr. Smith could apparently have let both books compete, but was concerned that the sheer number of contributors voting for a book their writing appeared in would unfairly skew the votes toward that book. \n\nI don't know if I need to write a conclusion statement for that. It seems like a reasonable and ethical decision. Now the book that wins will be competing only against other books that are presumably not anthologies with 20 potentially self-interested voters. \n\nIn light of the potential unfair advantage of the anthology, it seems that Dr. Smith is trying to protect herself against accusations of unethical behavior by withdrawing it.",
      "author": "Weaselpanties",
      "created": 1582519293,
      "upvotes": 26,
      "replies": {}
    },
    "findayv": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/findayv/",
      "text": "If she's concerned about vote manipulation in favor of a manuscript why wouldn't she be concerned about alienating 70 people who can vote against her own? I think there's more to the story.",
      "author": "binarysaurus",
      "created": 1582561195,
      "upvotes": 3,
      "replies": {}
    },
    "fimkc91": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fimkc91/",
      "text": "There are a lot of comments here saying that there's nothing you can do. This is untrue. Yes, you're not going to get anywhere with the association that clearly does not know what a conflict of interest is. However, even big fish in small ponds have reputations. \n\nThe big fish in my small pond uses outlandish, verbally-abusive reviews to try to block everyone from publishing and presenting at conferences in what she deems her intellectual territory. And she got away with it because well, she's the specialist that you have to call every time someone submits something for review. Luckily, people are catching on and hopefully the tide will turn. Before her was another big fish who acted the same way until people got sick of *his* nonsense too.\n\nI don't think this is something that you have to suppress for anyone's sake. If someone says to you, \"hey, did you hear Dr. Smith's book won an award?\", you have every right to tell them that she took over your project and sabotaged it. She is not entitled to an artificially-pristine reputation, and she is not entitled to future collaboration with people who would prefer not to work with her given this behavior.",
      "author": "papayatwentythree",
      "created": 1582534139,
      "upvotes": 2,
      "replies": {
        "fin6wyo": {
          "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fin6wyo/",
          "text": "Pulling the work from the award is not sabotaging it. It is also not ethical to slander someone without the full details. Dr. Smith gave a reasonable defense for her decision. Even if it may be incorrect, to call it sabotage with no proof is jumping to many conclusions.",
          "author": "cm0011",
          "created": 1582557202,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fin0i58": {
      "link": "/r/AskAcademia/comments/f8fu4g/editor_pulled_book_from_award_consideration/fin0i58/",
      "text": "Wait, so, you are able to vote the book you authored?",
      "author": "Existenceisfutile1",
      "created": 1582552634,
      "upvotes": 1,
      "replies": {}
    }
  }
}