{
  "sid": "l9pqxa",
  "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/",
  "title:": "Do I have to become a professor? And why does anyone want to be a professor?",
  "text": "It seems like everyone in academia aims for professorship, and starting in undergrad everything you do is to make you more competitive for tenure. \n\nBut what if I don't care for tenure? As far as I can tell it is good for two things: job stability and prestige. The former is not important for me personally, and the latter... well, I can't say that I will never need it, but is certainly not something inherently important to me or anyone I know. \n\nNot to mention that being a professor is described as more administrative and managerial than involving research. This sounds dreadful because I am not suited for it and it isn't something I'd enjoy. I already dislike writing and non-science oriented discussions: I only want to spend my time learning things. I can't imagine making an even bigger sacrifice of the latter for the former. Not to mention that I have zero interest in teaching, mostly because again I have no talent for it.  \n\nIt seems like most people go into academia with the same mindset as mine: a desire to learn more about their science and nothing else. I'm not sure at what point such people decide they would rather administrate than research, or whether they just don't have the freedom to decide.\n\nIs there no next step after postdoc other than becoming a professor? Is there at least a way to be a professor where my life is not overtaken with non-research things? \n\nI myself am in STEM, but feel free to comment on the situation in your field even if it's non-STEM. I'm sure someone with thoughts similar to mine will appreciate it.\n\nEdit: to clarify, I was implicitly leaving out the option of moving into industry since I like research and academia, just not the idea of spending lots of time on non-research things",
  "author": "herklowl",
  "created": 1612137871,
  "updated": 1634081852,
  "over_18": false,
  "upvotes": 112,
  "upvote_ratio": 0.92,
  "comments": {
    "gljexqa": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljexqa/",
      "text": "You could work as a full time soft funded scientist. Many universities have positions for this. The only caveat is you have to raise enough grant money to support your entire salary/benefits and other students/postdocs etc. It can be done and as someone who did the professor thing for 15 years I can say that it's great. I don't miss the other things and really like focusing completely on research.",
      "author": "__x0x__",
      "created": 1612138750,
      "upvotes": 55,
      "replies": {
        "gljip6f": {
          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljip6f/",
          "text": "Thank you, I hadn't heard about this. But why would I need to raise money for other students/postdocs if I'm not a professor? Is it regarded as strange to not be supervising anyone as a senior scientist?",
          "author": "herklowl",
          "created": 1612140529,
          "upvotes": 10,
          "replies": {
            "gljtkfp": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljtkfp/",
              "text": "It basically comes down to cost and maximizing productivity. PIs are a lot more expensive than grad students / post docs. My position is best described as \"research professor\" and that allows me to mentor grad students and pay for them to research with/for me. NSF (where I get most of my funding) won't let me cover my full salary with one grant; I end up having to get four or so just to cover myself. So to keep 4 grants going it's got to be very collaborative, at least for me, and I have to show enough productivity from the grants to keep them coming in, and I can't do that completely solo. NSF likes students being involved, and I my current position allows me access to the best out there.\n\nThere are different ways to make it work. I work in a research center closely tied to a department at an R1. We get tons of federal money.  All of my collaborators are external, as it turns out, but there are local collaboration possibilities here as well.",
              "author": "__x0x__",
              "created": 1612145765,
              "upvotes": 26,
              "replies": {
                "glk4bzu": {
                  "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glk4bzu/",
                  "text": "I have never heard of this and I am super intrigued. Are you in medical research? A long term plan as a soft money researcher would be an oxymoron in the dept I came from. Especially in the current funding ecosystem. IE it would be incredibly precarious...\n\nIt makes total sense though. Much cheaper than a PI, while the uni can still get ~40% off your grants. Do you share lab space? Do you get health insurance from the school? Our grants were super sketchy about funding personnel costs.",
                  "author": "beeporn",
                  "created": 1612151000,
                  "upvotes": 4,
                  "replies": {
                    "glk5rmm": {
                      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glk5rmm/",
                      "text": "No, not medical research, think more on the earth science side. I do computational/simulation work, so lab space isn't a thing for me. I get all the benefits that you'd expect as a regular faculty but I am academic staff. \n\nThe research center I work in is world famous and it's a great place to work, people come here and never leave LOL. But don't get me wrong not having the security of a regular faculty position (where funding only gets you summer salary, not your full salary) is the worst part of the job. It has taken years to spin up to where I am fully self funded. It's a wild ride sometimes... you certainly get used to rejection/failures fast haha.",
                      "author": "__x0x__",
                      "created": 1612151721,
                      "upvotes": 9,
                      "replies": {
                        "glk6bjd": {
                          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glk6bjd/",
                          "text": "Great to hear that you are jazzed about it. Doing everything insilico is probably a game changer but still could cost if you are using stack or aws time to run shit.\n\nBest of luck with it. The situation is whack with So few R1 professorships and so many PhDs. So much good work to get done though. I hope the “R1 system” can figure out a way to allow for more research profs",
                          "author": "beeporn",
                          "created": 1612152016,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "glnbeqe": {
                      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glnbeqe/",
                      "text": "I come from the medical/health sciences and this kind of setup is pretty common there. My postdoc was supervised, in part, by a research scientist in this situation. Long-term soft money researchers are very common.",
                      "author": "roseofjuly",
                      "created": 1612212558,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "glkgfq9": {
          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkgfq9/",
          "text": "As an undergrad working in a lab, this is what my PI does! He's employed by the university as a Research Scientist (R1 institution) and he has appointments in different departments but research is his full time job. To my knowledge he very much enjoys it and he has more time to put towards outreach and mentorship.",
          "author": "archerbean",
          "created": 1612158088,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gljekqo": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljekqo/",
      "text": "Maybe I'm just an outlier, but I got into academia to teach. Research is all well and good, and I enjoy it, but I'm seeking a teaching heavy position.\n\nSounds like you are going to move to industry after school, and that's fine, valid, and common.",
      "author": "Ancient_Winter",
      "created": 1612138585,
      "upvotes": 115,
      "replies": {
        "gljhr5j": {
          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljhr5j/",
          "text": "I wish I were good at teaching, I may be less adverse to professorship if I were. \n\nAlso, I was leaving out industry because I otherwise like research and academia. I was wondering whether I had any options other than becoming a professor or leaving academia.",
          "author": "herklowl",
          "created": 1612140086,
          "upvotes": 7,
          "replies": {
            "gljjhh1": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljjhh1/",
              "text": ">I wish I were good at teaching\n\nJust like anything, it is a skill. If you are wanting to stay in academia maybe look into courses at your uni that help with teaching? Example like [this](https://www.purdue.edu/cie/CTDP/index.html)",
              "author": "mrt1416",
              "created": 1612140907,
              "upvotes": 24,
              "replies": {}
            },
            "glk5ozd": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glk5ozd/",
              "text": "> I wish I were good at teaching\n\nNobody is born good at it. It's a skill you develop.",
              "author": "lucianbelew",
              "created": 1612151684,
              "upvotes": 22,
              "replies": {
                "glk7w3w": {
                  "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glk7w3w/",
                  "text": ">Nobody is born good at it. It's a skill you develop.\n\n100% This. Some of us have personality types and innate skillsets that make it easier, but that just removes a bit of anxiety and leaves us where we have to hone our craft.",
                  "author": "MisplacedLonghorn",
                  "created": 1612152874,
                  "upvotes": 13,
                  "replies": {}
                }
              }
            },
            "glkqxpz": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkqxpz/",
              "text": "You should look into RnD positions in the industry. They would be a better suit for you.",
              "author": "pomt98",
              "created": 1612165816,
              "upvotes": 4,
              "replies": {}
            },
            "gllayti": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gllayti/",
              "text": "You can take a staff scientist role in academia or industry. Industry pays more.",
              "author": "professorplum77",
              "created": 1612182611,
              "upvotes": 1,
              "replies": {}
            },
            "glnbmof": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glnbmof/",
              "text": "You can do research outside of academia, and there are many facets to industry that actually may be similar to academia. It'd be helpful to know what you like about academia/being a professor that makes you want to stay despite disliking core parts of the job.",
              "author": "roseofjuly",
              "created": 1612212640,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gljeln5": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljeln5/",
      "text": "There's lots of things you can do other than being a professor! But if you want to have COMPLETE control over what you research, being a prof is going to give you the most freedom in that regard (although still limited by resources, grants available, etc).\n\nBut you can also do things like work as a staff scientist or research assistant professor, where you just do research, usually under a professor who has a large lab and lots of money. But sometimes the research assistant professors are associated with cores and do still write grants, decide on research directions etc. If you like a specific technique, you can work in a core facility and do that all the time.\n\nIn the US, federal government run labs also need scientists, and there is often less pressure to write grants there. You can also transition to industry and work at the bench for a biotech or pharma company.\n\nAnd those are all options just if you want to stay at the bench. There's tons more careers where you still use your scientific knowledge and interact with the scientific community, but aren't at the bench doing the research yourself. And just based on statistics, most people with stem phds don't become professors. A lot more phds graduate each year than there are faculty positions available.",
      "author": "colbierose",
      "created": 1612138597,
      "upvotes": 23,
      "replies": {
        "glkee0z": {
          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkee0z/",
          "text": "I'm a research assistant professor and so far I like it. I tend to oversee the work of staff research assistants/associates, serve as Co-PI on grants within my domain, and have the freedom to pursue my own grants if I see the opportunity. \n\nOccasionally, if the teaching bug gets me, I will accept a minor summer teaching role in the associated department for some supplemental salary. Not too bad.\n\nThe only thing that ever gets to me is what to do when the funding runs out. One day it will I'm sure. Will likely return to industry where I worked for a couple of years not too long ago.",
          "author": "angelicpariah",
          "created": 1612156741,
          "upvotes": 3,
          "replies": {}
        },
        "gljicsi": {
          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljicsi/",
          "text": "This is encouraging to hear, thank you. I hadn't considered federal labs but will definitely keep an eye out for those now. As for research in industry, it's not really an option for me as I'm in cogneuro, but it sounds like a nice option for fields where there's demand (i.e. the ones you stated, pharma and biotech. Not sure if there are many others)\n\nI thought that even though more PhDs graduate than become professors, those that don't become professors typically don't stay involved with research, i.e. leaving academia usually means leaving the science behind, or at the very least not having a position centered around learning and generating new knowledge. Do you mind elaborating on the career options where I can still do that, even if I'm not doing experiments myself?",
          "author": "herklowl",
          "created": 1612140369,
          "upvotes": 2,
          "replies": {
            "gljyizy": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljyizy/",
              "text": "There's tons of industry research in cog neuro. The questions aren't as interesting imo, but lots and lots of opportunities in pharma, tech, biotech. I know psych/cog neuro phds at Facebook, Google, various pharma companies, consulting firms for UX and data science.",
              "author": "mediocre-spice",
              "created": 1612148108,
              "upvotes": 6,
              "replies": {}
            },
            "gljm050": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljm050/",
              "text": "The one career that immediately comes to mind would be working at a scientific non-profit. The positions at non-profits can vary A TON (esp depending on the size of the non-profit), but it's often a great place to remain connected to science and feel like you're having an impact. Another option might be something like a scientific review officer at the NIH--you get to interact a lot with grantees and see a lot of innovative science come through. \n\nThere's also options like a regulatory affairs, various sales positions at companies like Nikon, Thermo, etc. If you have any interest in legal things, being a patent agent. \n\nThere's far more career options than people think with a PhD. If you already know that you feel \"meh\" about being a professor, look out for career development program and opportunities--the NIH BEST program has some good resources available",
              "author": "colbierose",
              "created": 1612142100,
              "upvotes": 4,
              "replies": {}
            },
            "glkz74g": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkz74g/",
              "text": ">I thought that even though more PhDs graduate than become professors,\n\nMany many more.\n\n>those that don't become professors typically don't stay involved with research,\n\nMany people leave academia for non-academia research positions and I would love to know the statistics for how many. I have seen both sides of this (academia and non-academic research) and there is lots of variation in both. Many people with non-academic research jobs are doing far more actual research than typical modern day professors, who spend their times doing administrative tasks like faculty meetings and fund raising.\n\n>i.e. leaving academia usually means leaving the science behind, or at the very least not having a position centered around learning and generating new knowledge.\n\nTypically it will mean leaving behind the specific research topic that you were interested in as an academic, but that does not mean not having a position centered around learning and generating new knowledge. This belief is part of the mythology of academia and the arrogance of academics.",
              "author": "CaptainCornerCamper",
              "created": 1612172946,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gljxm2o": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljxm2o/",
      "text": "No, of course not. \n\nMost people want to be professors because there are limited opportunities in their field to do research or teaching if they aren't. If options outside of academia look interesting, go for it. The paycheck is a lot better. \n\nI also wouldn't describe mentoring trainees and writing grants as administrative and managerial. That's still teaching and research, just in a leadership big picture role rather than something more hands on.",
      "author": "mediocre-spice",
      "created": 1612147671,
      "upvotes": 13,
      "replies": {}
    },
    "gljeyte": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljeyte/",
      "text": "Very few of the people in my cohort wanted to be faculty. Most are very happy in industry.",
      "author": "Eigengrad",
      "created": 1612138763,
      "upvotes": 10,
      "replies": {}
    },
    "gljfpvp": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljfpvp/",
      "text": "You could be a research scientist - working in someone else’s lab as a permanent researcher or at a national lab.\n\nI’m a prof because I do love it all - research both doing the math and developing students; teaching; and service. The freedom of what to research and how to spend my time is also huge.\n\nI’m not in it because of tenure - its just how the system is set up. For me, I just view it as a step allowing me to let me keep doing what I like doing. I’m a bit surprised you said starting in UG, folks start doing things for tenure. I don’t know anyone like that. Literally none. Not to say it’s not hard to get, it is, but it’s generally more about doing things to get to the next stage than focused on tenure particularly. \n\nI’m glad you’re thinking about this. Folks don’t have to love teaching to be a good prof or to love the admin side or to love writing etc. No one likes everything. But it is a job with a lot of hats and if you only like one part of it, it can be a huge bummer. Also some profs try to treat it as all research (and they tend to be bad colleagues) but even then research includes - grant writing, hiring and managing students, writing papers. It’s not all benchwork/data collection/proving theorems.\n\nAll the best to you! It’s hard to figure out career directions but I really hope you can find something that’s fulfilling - whether that’s as a prof or something else.",
      "author": "clemson_throwaway2",
      "created": 1612139110,
      "upvotes": 8,
      "replies": {
        "gljjbem": {
          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljjbem/",
          "text": "Maybe it's just the circle I'm in that makes a big deal out of tenure. I come from a family of academics of varying success, and seeing them is what sparked my concern that I might not like some or most aspects of being a professor. I hadn't considered that it might make me a bad colleague to not be willing or eager to engage in other responsibilities but that sounds like an important factor too. Thank you for the advice, I appreciate it.",
          "author": "herklowl",
          "created": 1612140825,
          "upvotes": 3,
          "replies": {}
        },
        "gllavl4": {
          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gllavl4/",
          "text": "What’s research work at a National lab like? Do you largely get to decide the direction of your research or is it through a long chain of command?",
          "author": "Sckaledoom",
          "created": 1612182548,
          "upvotes": 2,
          "replies": {
            "glohsaw": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glohsaw/",
              "text": "The research at a national lab has to focus on the “lab’s mission,” and every lab has a particular mission, some are more broad than others. That still leaves a large range of research topics to research. There really isn’t much dealing with the chain of command in terms of selecting projects.\n\nFor example, Sandia National Labs mission is “to develop, engineer, and test the non-nuclear components of nuclear weapons and high technology” (From their wiki page), but they make a widely used computational chemistry package (LAMMPS) that is used in many fields (the developers aren’t what I would consider “nuclear scientists”).",
              "author": "jpc4zd",
              "created": 1612231012,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gljwhwz": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljwhwz/",
      "text": "Autonomy is the best argument for staying in academia.\n\nIf you don’t mind being told what to do, there is much more money to be made elsewhere.",
      "author": "ph0rk",
      "created": 1612147162,
      "upvotes": 8,
      "replies": {
        "gljzf1u": {
          "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljzf1u/",
          "text": "[deleted]",
          "author": null,
          "created": 1612148534,
          "upvotes": 12,
          "replies": {
            "gllc6g6": {
              "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gllc6g6/",
              "text": "I've spend time in both, and while there is within-group variance, the amount of autonomy *available* in academia is hard to touch.",
              "author": "ph0rk",
              "created": 1612183430,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "glkgl1u": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkgl1u/",
      "text": "It sounds like you would be more interested in industry R&D or working at a government lab (DoE national labs, NASA, NIH intramural, DOD, VA, etc.).  There are also non-profit research institutions (Woods Hole, Allen Institute, SRI, etc.).  Depending on the type of STEM you are in, non-medical doctor faculty at medical schools do not typically teach and focus on research, though they are often on soft-money meaning they have to cover their salary through grants (if you do teach, it can be as little as 1-2 lectures per year).  Universities also have positions called research professors that focus 100% on research and are also soft money.  \n\nIn other words, it is completely possible to do the things you want.  You can often do a post-doc at any of these types of institutions to get your foot in the door and see if that is the right life-style for you.",
      "author": "manova",
      "created": 1612158186,
      "upvotes": 6,
      "replies": {}
    },
    "glk1cpu": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glk1cpu/",
      "text": "You get to be the \"type\" of professor you want to be. There are tenured faculty who have small research groups. They are very happy being deeply-involved in the the science. \n\nOn the other hand, there are massive groups where the PI is more like a CEO. Obviously, there is overall strategy, but the day to day technical stuff is delegated to research staff. \n\nMost people know what type they want to be.",
      "author": "arknado1",
      "created": 1612149502,
      "upvotes": 4,
      "replies": {}
    },
    "glkkiuq": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkkiuq/",
      "text": "If you don’t want to teach, I don’t recommend becoming a professor",
      "author": "rboller",
      "created": 1612160943,
      "upvotes": 3,
      "replies": {}
    },
    "glk39dl": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glk39dl/",
      "text": "I think it depends on what you mean by \"research\" and \"non-research\" things. If you only define research as the actual bench/lab work, then it is hard to have a job that is intellectually stimulating (not just doing the same protocols over and over again) but keeps you at the bench. As you grow, research has a broader definition. Research is writing grants and papers. Research is training postdocs and grad students. That lets you do more things. Instead of just doing one project yourself, you are like a project manager overseeing lots of different projects. With that, there is administrative things that creep in, but I'm not sure of any job in any field that doesn't have an administrative burden. If you don't want to teach, you can look at more soft-money positions, but then it's a eat what you kill situation that can be quite stressful in today's funding climate.",
      "author": "AwkwardAccountant5",
      "created": 1612150451,
      "upvotes": 3,
      "replies": {}
    },
    "glka3m8": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glka3m8/",
      "text": "I was definitely the outlier in my cohort and my family. I’m a biomedical engineer. My father, an engineering PhD, spent one semester as a visiting professor and devoted his life to industry. I was the only person in my graduate cohort +/- 2yrs who wanted to be a professor. \n\n1 is very happy in a “classic” industry position, and describes her current position as more similar to academic research than she expected but without the grant grubbing and academic politics. (Industry politics are a different basket.) \n\n3 are working for contract research organizations (Leidos, ICF, and Eurofins) and really enjoying their time so far.\n\n2 are now in government research work - 1 NIH and 1 FDA. They send me regular updates on position openings and say postdoc training is a very important and protected position - so I’m assuming they like it and don’t send me the positions out of dislike for me, haha. \n\n2 are doing the start-up gig based off research and business work they started during their time as graduate students. \n\nAs other commenters have mentioned, there are also research institutes, national labs, and other research-primary facilities around rather than just “academia vs industry.” Take this time to explore where others with your field specialty have landed.",
      "author": "graygoohasinvadedme",
      "created": 1612154126,
      "upvotes": 3,
      "replies": {}
    },
    "glkdmco": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkdmco/",
      "text": "Become a fed! They have a ton of jobs and usually have a decent work-life balance. If you can deal with the all bureaucracy of working for the government, then that's the way to go. That's my plan anyway.",
      "author": "Possible_Aardvark299",
      "created": 1612156253,
      "upvotes": 3,
      "replies": {}
    },
    "glktb0p": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glktb0p/",
      "text": "It's a ponzi scheme. You study it, you teach it, you profit.  \n\n\nPls downvote gently",
      "author": "antonis_273",
      "created": 1612167796,
      "upvotes": 3,
      "replies": {}
    },
    "glkv02l": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkv02l/",
      "text": "Maybe it's different for you, but for the social sciences and humanities, there are not really a lot of jobs in academia besides professor and the jobs leading towards it. \n\nAnd why is job stability not important for you? We are not talking about tenure here, but about not having to deal with 4-months contracts and god knows when and where you will find a job when it ends.",
      "author": "doornroosje",
      "created": 1612169249,
      "upvotes": 2,
      "replies": {}
    },
    "gll7m19": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gll7m19/",
      "text": "Get the jacket with the elbow patches",
      "author": "AlanRickshawRider",
      "created": 1612180127,
      "upvotes": 2,
      "replies": {}
    },
    "glkb1au": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkb1au/",
      "text": "I’m an economics PhD student and have absolutely zero interest in teaching or getting tenure, and I made that clear during the application process. I was fully supported by the program I ended up in. Most of my cohort wants to teach at liberal arts schools doing limited research, living a family-oriented life. It seems that family is a major concern for them and they have a passion for teaching. I can’t relate, but I understand their reasoning.",
      "author": "Econolana",
      "created": 1612154675,
      "upvotes": 1,
      "replies": {}
    },
    "glkbx54": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkbx54/",
      "text": "You can be a staff scientist...",
      "author": "dampew",
      "created": 1612155205,
      "upvotes": 1,
      "replies": {}
    },
    "glkc56x": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkc56x/",
      "text": "Definitely check out national labs if you like the research aspects. Also, depending on your field, some private companies may have people doing blue sky research",
      "author": "cybersatellite",
      "created": 1612155342,
      "upvotes": 1,
      "replies": {}
    },
    "glkcutv": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkcutv/",
      "text": "One of the best conference presentations I went to was a panel of people who went into industry after their PhDs and were still able to do research full time. Some planned it that way and others it was just how it happened but no, you don't have to go the route of professorship! I think if everyone with a PhD did there definitely wouldn't be enough spots open but still. There are a lot of industry positions that are looking for that higher level of education and that offer the same experience research wise and would be a great option if you're not interested in academia long-term.",
      "author": "shortmage",
      "created": 1612155774,
      "upvotes": 1,
      "replies": {}
    },
    "glkir6a": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkir6a/",
      "text": "I'm only in grad school right now, but academic position give researchers some freedom of research topics etc... To do anything professionally, someone has to fund it, and in academics that comes from mostly government grants, which give more room for fundamental research than the usual industrial funding. At some universities there are adjunct research faculty, and some universities let professors essentially buy their teaching time back. If they want to teach less and have enough grant funding, they can pay the university in exchange for not teaching. \n\nWith all of that, if it's the research you love, I would suggest looking into national laboratory work if in the US. The funding comes from much the same places and have the institution behind you gets you access to conferences and publishing still etc... If you are in Europe then you can still look into national research institutions. If that track doesn't wok for you, then industry research is alive and well. There are plenty of companies funding internal research, but only for certain areas. If it's materials then you in luck, but if it's astronomy then there's not much corporate money there. \n\nI am in physics personally but this still applies to other areas of STEM. Engineering will probably have the easiest time finding outside funding.",
      "author": "morePhys",
      "created": 1612159679,
      "upvotes": 1,
      "replies": {}
    },
    "glkmdim": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glkmdim/",
      "text": "There's few positions between postdoc and professor, sadly. Academia really thrives on their MLM scheme. On a more serious note the nature of grants makes it hard to really create a lot of in-between positions as they are designed to find people for one project and then kick them out. In Germany Universities also use the same reasons (need for specialised personal for each project as it might require different skill sets), basically treating academic employees below professor-level as hired-out workers.  \n\nYou shouldn't dismiss industry completely, you sound as if you might like being a researcher in industry. Depending on your exact field you might still be able to work on similar projects.  \nMy new job in a R&D department actually doesn't feel that different from lab work. We are more focused on getting sellable results for the big projects but also conduct some more \"proof-of-concept\" things that are basically just playing around and seeing what sticks.",
      "author": "LittlePrimate",
      "created": 1612162295,
      "upvotes": 1,
      "replies": {}
    },
    "gll31ng": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gll31ng/",
      "text": "Sounds like you'd rather be on an innovation team for a private company. There's plenty of scope for research-oriented practice outside of academia which, as you say, depending on the institution you're at varies wildly.",
      "author": "zante2033",
      "created": 1612176364,
      "upvotes": 1,
      "replies": {}
    },
    "glmj69c": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/glmj69c/",
      "text": "But you do want to design and execute your own research projects, don’t you? Learning the research techniques only gets you so far. Eventually you need to manage and fund a big enough project to get grants. And most of these grants can’t be completed solo. Also, you won’t be able to get your own lab unless your individually funded and a professor. Unless you spend the rest of your life under a PI, which comes down to being a glorified technician most of the time, becoming a professor or an R1 researcher is the only path you have to that kind of freedom.",
      "author": "SocietyUnable726",
      "created": 1612201712,
      "upvotes": 1,
      "replies": {}
    },
    "gljssaw": {
      "link": "/r/AskAcademia/comments/l9pqxa/do_i_have_to_become_a_professor_and_why_does/gljssaw/",
      "text": "Become a data scientist.",
      "author": "fdsnjhk",
      "created": 1612145377,
      "upvotes": 0,
      "replies": {}
    }
  }
}