{
  "sid": "r1wwdy",
  "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/",
  "title:": "Dumb problem but I genuinely can't tell if I'm actually interested in the research area I'm into or if it's just because I feel inspired by the professors I like who ARE into those areas, and I don't know how to find out before it's too late to change what I'm doing",
  "text": "Simply put: how did you know what you're interested in, and that you were *actually* interested in it? As in, it's not just a whim or a small interest that can change if your situation, or amount of knowledge changes? Especially before even starting grad school (I'm in my senior year right now and it's stressing me out so much more now). What made you all actually feel like you *want* to work in a particular niche part of your main subject area? \n\nI'm in math (particularly, applied), and there's so SO much I haven't even learned yet with regards to both pure and applied math and I'm scared that even if I supposedly like the areas that I'm looking at right now, I don't even know if other stuff that I've never even worked on or studied could be things that I'd like. And I feel like I'm more interested in subject areas of professors whose teaching/classes I liked more. And then after reading what they work on, I found myself gravitating towards those areas but I'm honestly not even sure if that's me actually liking those topics or if it's me just being impressed by my professors 😔",
  "author": "megahypochondriac",
  "created": 1637848048,
  "updated": 1638206322,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 1.0,
  "comments": {
    "hm1c17i": {
      "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm1c17i/",
      "text": "Passion for a subject is cultivated over time, the amount of interest you have right at the beginning isn’t all the passion you’re capable of having for it.",
      "author": "brett_hoover_wx",
      "created": 1637850390,
      "upvotes": 26,
      "replies": {
        "hm1lrg8": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm1lrg8/",
          "text": "Ahhhh this is nice to know. I'm actually extremely interested in some things, but I'm honestly just scared that the more I learn about it, I might end up liking it less :/ \n\nThank you for this though, I'm hoping I'm still capable of letting my interests grow",
          "author": "megahypochondriac",
          "created": 1637855032,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hm1us1y": {
      "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm1us1y/",
      "text": "Researchers and their research interests aren't like star-crossed lovers. You aren't destined to be interested in one thing or another. There are hundreds of topics that you could develop a deep interest in if you start working on them.\n\nI am deeply interested in my field of research, which I have been working on for over a decade. But it was mostly just happenstance that lead me into this field as a prospective grad student. I could have just as easily ended up in a different field if some cards had fallen differently. And I would very likely be just as interested in that field today.",
      "author": "ProfOnTheMove",
      "created": 1637858960,
      "upvotes": 14,
      "replies": {
        "hm2nldd": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm2nldd/",
          "text": "Huh. Interesting. I probably should have looked at it like this as well, this is a really good perspective on my entire problem tbh. \n\nThis is genuinely really nice+helpful to read though, thank you for this comment!",
          "author": "megahypochondriac",
          "created": 1637871181,
          "upvotes": 1,
          "replies": {
            "hm3vq90": {
              "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm3vq90/",
              "text": "The above comment really reads like the most accurate take on here. I feel the same way.",
              "author": "Sr4f",
              "created": 1637893127,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hm19y4q": {
      "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm19y4q/",
      "text": "Don't overthink it. It doesn't have to be an either-or thing.",
      "author": "molobodd",
      "created": 1637849319,
      "upvotes": 11,
      "replies": {
        "hm1lffu": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm1lffu/",
          "text": "I understand that. I just feel like I'm rushing into liking something that seems nice on the surface level but I don't know if I'll actually continue to be interested in it the deeper I get? If that makes sense? \n\nAlso, yeah, gonna try not to overthink, it's a terrible habit but yeah, you're right 😔",
          "author": "megahypochondriac",
          "created": 1637854884,
          "upvotes": 4,
          "replies": {
            "hm22gkr": {
              "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm22gkr/",
              "text": "You'll be surprised how much your interest in a topic grows according to how much effort you put into it.   Go ahead and jump into the deep end of the pool.",
              "author": "blakehannaford",
              "created": 1637862196,
              "upvotes": 5,
              "replies": {
                "hm2nqem": {
                  "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm2nqem/",
                  "text": "🥺🥺 \n\nThank you for this, getting ready to dive in head first now 🥺😊",
                  "author": "megahypochondriac",
                  "created": 1637871245,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm1a4bg": {
      "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm1a4bg/",
      "text": "If you haven’t started grad school or a career yet, you will have time to change your mind and follow your developing interests along the way moving forward.\n\nHere are three thoughts:\n\nSome people find it extremely useful to work at least 1-3 years between undergrad and grad school. (I took 10 in between those two degrees, but that’s not for everyone). When you work and apply the things you’ve learned you tend to know pretty quickly what you like, or at least what you don’t like, and what you may want to become qualified to do.\n\nWhen you begin grad school you may have a different type of connection with your professors than you did in undergrad. assuming you went to the same sized school for both. (If you went to a small undergrad your closer connection may be more comparable.) Anyway, as you take more specialized courses, work on projects, read, write, etc., you’ll likely find a true interest, or again eliminate more things you don’t enjoy as much. Your professors can also serve as good sounding boards for your ideas and aspirations. (On that note, if you have two degree choices and you know one team is full of amazing and supportive people and the other is full of discouraging and unorganized people, I personally would go for working with/learning from the better team any day.)\n\nIf you make a decision you don’t like, you can make another decision. It’s okay. My degrees are in three different but “related” areas, not because I changed my mind or didn’t like the programs (mine were excellent), but because I continued to develop and grow and follow those interests. One of my colleagues stayed in her PhD program longer to add on an additional masters to fulfill her needs and interests. An extra year may have felt like a long time for her, but in the grand scheme of things, it isn’t.  \n\nBest of luck as you enjoy the journey and discover what you love.",
      "author": "REC_HLTH",
      "created": 1637849413,
      "upvotes": 4,
      "replies": {
        "hm1serd": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm1serd/",
          "text": "Thank you for this super detailed reply 🥺\n\nTaking a gap year would be ideal personally but my family's situation kind of makes me want/need to finish my master's at least in one go so that I can either go onto getting a job or decide to do a PhD right afterwards. Mostly the job but if I'm still interested in academia and research, maybe the PhD route. \n\nAlso yesss, I'm doing a research project and I've noticed that the level of conversation I have with that one professor is a LOT better, and closer than any connections I have with other professors I haven't worked directly with. I'm worried that I'm going down a rabbit hole of taking a lot of specialized courses in one area without exploring others tbh. An example is that I'm interested in differential equations, so until now, I've taken around 4 courses, and I'm taking another DE course next semester. However, that leaves me no space to take other fields and I don't even have the chance to now. I'm really hoping what you say is true. I guess I'll continue to wait and see where my classes and stuff take me, both right now and when I go for my masters at least. Also also yesss, I've heard a LOT about how important it is to have a supportive team to work with. Before, I honestly wouldn't have thought of what difference it made since imo you're just doing your own work but now, I'm genuinely realizing how important it must be. \n\nYour last paragraph is so encouraging, thank you. It definitely makes me feel better. I'm in a pretty competitive university in my country, so usually everyone just seems like they're so pur together and they have all their plans for the future set out by their junior years, and I'm nearing the end of my degree scared about what I'm even going to end up doing, or scared about how I might make a mistake by choosing too quickly. \n\nBut honestly, thank you so much for this, it's really helpful 🥺",
          "author": "megahypochondriac",
          "created": 1637857953,
          "upvotes": 2,
          "replies": {
            "hm1tk7b": {
              "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm1tk7b/",
              "text": "Do what you need to do. It will all work out. Some paths are more direct than others, but life isn’t all about getting from A to B. If you’re improving yourself and enjoying your work and your team, you are among the most fortunate. Let yourself enjoy it.\n\n(Side note- I would have chosen a different masters degree if I went right after undergrad. And…that would also have been a good degree to have. I’m glad my path took me where it did, but both would have been absolutely fine decisions.)",
              "author": "REC_HLTH",
              "created": 1637858439,
              "upvotes": 3,
              "replies": {
                "hm2nbmv": {
                  "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm2nbmv/",
                  "text": "Thank you for this 🥺",
                  "author": "megahypochondriac",
                  "created": 1637871060,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm3biiu": {
      "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm3biiu/",
      "text": "Pursue what you're interested in.  If you fall out of interest later, that's fine. You can always learn what you can and move into the next thing. I have gone to class with people in their 80s, it's never too late to be passionate or interested in something.",
      "author": "PlainText87",
      "created": 1637882579,
      "upvotes": 6,
      "replies": {
        "hm4zu8s": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm4zu8s/",
          "text": "Ooof thank you for this 🥺",
          "author": "megahypochondriac",
          "created": 1637919062,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hm3d82d": {
      "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm3d82d/",
      "text": "Few thoughts - \n\nFirst, one sign grad school would be a good idea: as you study, you realize how much you don’t know and are interested in diving further into the topic. If that drive is there, hell yeah. But no worries if not. Grad school can be hard and unforgiving, but being intellectually engaging makes it worthwhile. \n\nSecond, if it is primarily the people, then it may be worthwhile to consider what conditions, either in terms of colleagues or in math, that are a good fit for you. I realized way later than I could have that what was I after in a faculty route could be achieved in a lot of ways that did not involve being a faculty member.",
      "author": "octaviousearl",
      "created": 1637883441,
      "upvotes": 3,
      "replies": {
        "hm50c2r": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm50c2r/",
          "text": "Ahhh yes, thank you for this comment. \n\nReally hoping that my current drive to learn more stays there, and that further grad school is worth it after on. This is why I'm doing a masters first before a PhD, really need to see if this is really what I want or not. But I do want to be intellectually challenged, so I'm hoping it turns out good 🤞\n\nAlso ahh yess, I guess it'll take some time to figure out what works for me. Also, if you don't mind me asking, what were you looking for exactly? Was being a faculty member something that you disliked?",
          "author": "megahypochondriac",
          "created": 1637919485,
          "upvotes": 2,
          "replies": {
            "hm555r5": {
              "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm555r5/",
              "text": "Don't mind at all - for me, here's what attracted me to being on the faculty somewhere: making a difference through teaching (which I don't mean idealistically as over half my family has or works in education, ranging from K-20), a set community of colleagues, all with decent pay allowing for a relatively chill/quiet life-style. Research was always kind of interesting, but I always loved learning more. \n\nThroughout grad school , which was two masters in the humanities and one phd in social sciences, I saw more and more phds that were (a) miserable, (b) not getting jobs,  (c) high variance with regard to mentorship from older faculty, and (d) little to no control over where they lived. The market wasn't just tight for jobs, a lot of smart people failed to thrive because no one supports their chances. I got inspired for faculty as an undergrad because the faculty in the department of my major (religious studies) were 100% incredible. Loved each class, the materials, and just had a blast with lessons that I still draw meaning from even today a few decades later. \n\nI ultimately went the administrator route, though I've been able to consistently teach and produce some research. I respect a lot of my colleagues and chill lifestyle unlocked. That said, I now see I could've accomplished my goals in more ways - identifying fields where PhDs are more in demand therefore solving somewhat for b, c, & d above, or working beyond academia in intelligence, hospice, computer science (my original goal when entering college), etc... AKA jobs where you can make a difference with loads of opportunities to continue learning, have relative professional stability, and live a decent life. \n\nAfter I got my PhD, a number of us with doctorates were standing around and sharing war stories from our studies. One administrative support person, who did not have a doctorate, was nearby and asked us if we'd do it all over again if given the chance. A lot of us said, probably not for a variety of reasons. \n\nGiven your interest is in math, there's A LOT of possibilities to consider: the traditional academic route, digging into emergent tech like blockchain or the growing field of data science, exploring effective altruist charities like Give Directly that need mathematicians, etc... \n\nUnsolicited advice: highly recommended networking as much as possible (and people LOVE to talk about themselves, as evidence by my post above), and you'll be fine no matter what path you choose. If you're at a college/university, career centers can help. Alternatively, jump on LinkedIn or Google, research companies/faculty doing shit you find exciting, and cold contact someone. Time cost, minimal. Worst case scenario, no response. Reasonable case scenario, you get 20-30 minutes to chat with someone and learn more about what they are doing,",
              "author": "octaviousearl",
              "created": 1637923717,
              "upvotes": 2,
              "replies": {
                "hm71ya9": {
                  "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm71ya9/",
                  "text": "Ohhhh I seee, this is a really interesting route ngl, and I wouldn't have even thought it was something that happened, but thank you for sharing! I'm really hoping you continue to enjoy what you're doing now! \n\nAlso, completely agree with everything you've said. Definitely looking into a lot of fields that require people who can do math, since I'm kinda worried about if the academic route will even be fruitful for me. \n\nAlso also COMPLETELY agree with the networking advice! I had a class on business communication once and honestly, 80% of it was just learning to network and communicate properly. Being an introvert and extremely socially awkward, this is honestly the hardest thing to do, but I do understand the importance, so thank you for mentioning it! I'll definitely take up your advice and start talking to people as soon as I can!\n\nThank you again for the replies. This was helpful!",
                  "author": "megahypochondriac",
                  "created": 1637959938,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm466al": {
      "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm466al/",
      "text": "Don't worry so much, you're overthinking it. There's no way to no ahead of time what you'll be interested in, and interests change over time anyway. Being interested in a subject because you're inspired by your professors is a perfectly valid reason and I'd guess it's actually pretty common. There isn't some perfect niche subject waiting for you to discover it, you just have to explore different things over the course of your career and hopefully you will enjoy some of them enough to stick with them. I essentially ended up in my research field by accident, and it's working out for me so far.",
      "author": "CootaCoo",
      "created": 1637898702,
      "upvotes": 2,
      "replies": {
        "hm500ms": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm500ms/",
          "text": "This is really reassuring, thank you 🥺  \n\nI was honestly just really worried that everything I'm interested in currently might just be because I'm momentarily adopting the interests of professors/people i know while not *actually* being interested in them, and that it'd be way too late to change anything when I realize I don't like it :/ \n\nThank you again though, this comment helps 🥺",
          "author": "megahypochondriac",
          "created": 1637919213,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hm4v9z3": {
      "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm4v9z3/",
      "text": "i really loved genetics as an undergrad because of the professor.\nthen as a grad i chose genetics and molecular biology for my major but went to another school and I fucking hate it, i wish i never steped into that building ever in my life.\n\n\n\nworking as a biochemist right now\n\n\nbut secretly wish i was doing something related to languages",
      "author": "dipling_who",
      "created": 1637915271,
      "upvotes": 2,
      "replies": {
        "hm50ig7": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm50ig7/",
          "text": "Huh- 👁👄👁\n\nOkay this scares me lmao 👁👄👁\n\nUmm, if you're okay with me asking... Did you end up hating the subject itself, or did it have to do with the different school/faculty? What do you hate about it?",
          "author": "megahypochondriac",
          "created": 1637919636,
          "upvotes": 1,
          "replies": {}
        },
        "hm50kat": {
          "link": "/r/AskAcademia/comments/r1wwdy/dumb_problem_but_i_genuinely_cant_tell_if_im/hm50kat/",
          "text": "Also, hoping that you get the chance to do something related to languages soon, I hope it works out for you! 🥺",
          "author": "megahypochondriac",
          "created": 1637919680,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}