{
  "sid": "qw01gb",
  "link": "/r/AskAcademia/comments/qw01gb/how_to_ask_better_questions_in/",
  "title:": "How to ask better questions in workshops/conferences?",
  "text": "Hi all, recently graduated master student here.\n\nI just attended a very interesting panel in a conference today. Their topics are similar to my research. So I asked a question, but I felt like it was very poorly worded because the presenters made weird faces and someone in the chat said \"what an asshole\" right after I asked my question. Seemingly directed to me due to the fact I was the only one asking. \n\nI admit I was thinking out loud. A bit surprised I received that response, but I suppose I sounded like rambling or my question came off the wrong way.\n\nDo you have any tips? Anything I should consider before asking? Some difficulties I might need help with:\n\n* What to ask if there are many interesting to ask - should I focus more just ask a broad stroke question?\n* Very limited time for Q&A (10 mins or less) - should I not ask at all if I could not form my sentences well?\n* If I lost some parts of the speakers' presentation - should I said something along the line, \"I didn't understand this part of your talk, could you elaborate and could it be related to [my actual question]?\"\n* Trying to translate some words in my language to English - this always gets me\n\nThanks!",
  "author": "1khtilaf",
  "created": 1637158058,
  "updated": 1637180866,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hl0u8jb": {
      "link": "/r/AskAcademia/comments/qw01gb/how_to_ask_better_questions_in/hl0u8jb/",
      "text": "It's really impossible to comment without being there and knowing what happened, but I'll try and give a few thoughts on what goes wrong with questions.  \n\nFirst, I think it's a mistake to try and ask questions to be interesting. This is very close to asking a question to show how smart you are. We've all had those people and it's very tedious. The question should be about the work, not about you. \n\nSecond, try and avoid an essay before getting to the point. This is often a variation of the first point where the questionner loves the sound of their own voice and is using the opportunity to talk about their own opinions in the guise of a question. \n\nThird, if you did miss a bit of the talk it's not great to ask them to repeat it. It suggests you just weren't listening and it doesn't contribute to the broader discussion. \n\nFourth, \"I have a comment not question\". Ugh. There are times this is appropriate but conference talks are rarely it.\n\nYou mention you were thinking out loud, is there a chance you might have rambled a bit and taken a while to get to a point? I think we all inadvertently have done it, but it can be a bit oblivious to be taking up question time and the speaker's attention while we waffle our way to some semblance of a question. \n\nLast, you don't have to ask a question. If you don't have one, don't try and ask one just for the sake of it. \n\nI once was at a big meeting where a speaker called on someone in the audience and their response was \"I'm here listening today and learning so I hadn't planned to speak on anything\". I think they were probably covering up for not paying attention but I did like the idea of focussing on listening rather than thinking about the next thing you're going to say.",
      "author": "ACatGod",
      "created": 1637176153,
      "upvotes": 3,
      "replies": {
        "hl15wwj": {
          "link": "/r/AskAcademia/comments/qw01gb/how_to_ask_better_questions_in/hl15wwj/",
          "text": "To add to this, good questions are ones that the presenters have specifically said they want; that help the presenters clarify their work; or that gently and constructively raise issues that are likely to come up if they submit their work to a journal. \n\nIf there is a panel of papers being presented, then another type of good question is those that get panellists talking with each other about common themes in the work that they're sharing.",
          "author": "cdougherty",
          "created": 1637180812,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}