{
  "sid": "g155l5",
  "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/",
  "title:": "How bad is it to be a \"Jack of all trades\" in academia?",
  "text": "Hey!\n\nWhile I think I'm doing relatively OK in terms of the sheer number of publications, something that's been bugging me lately is the fact that my publication are far from being concentrated around one topic (or even area within the discipline).\n\nDue to the fact that my country has a somewhat messy academic system, I found myself working on project A (one area within my discipline) and project B (another area within my discipline) for financial reasons, while trying to conduct my own PhD-thesis related research (let's call this \"project C\" - again, another area within my discipline). The situation becomes even more complicated because of additional random collaborations and because I also work on some extra stuff with my academic advisor (this stuff is a bit closer to my PhD-thesis than other projects).\n\nSo ... How bad is it to be a \"Jack of all trades\" in academia? Does it look a bit better if you are only the first author of publications that are close to your area of interest (and a middle author on other publications)? Can it even be advantageous to be a \"generalist\"? What would you suggest?",
  "author": "Curriana_Grande",
  "created": 1586869470,
  "updated": 1634081299,
  "over_18": false,
  "upvotes": 142,
  "upvote_ratio": 0.98,
  "comments": {
    "fndhttu": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndhttu/",
      "text": "So long as you can spin a yarn about how some top-level theoretic perspective ties together all your work you're fine.\n\nIf you can't do that - find a way to do it.",
      "author": "ph0rk",
      "created": 1586870336,
      "upvotes": 344,
      "replies": {
        "fndp57l": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndp57l/",
          "text": "Now *this* is academia.",
          "author": "ecnad",
          "created": 1586874807,
          "upvotes": 230,
          "replies": {
            "fneengh": {
              "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fneengh/",
              "text": "The key that makes this work is that it's still all \"within your field.\" If you were a \"jack of all trades\" across disciplines, it'd be a completely different story.",
              "author": "Theomancer",
              "created": 1586888010,
              "upvotes": 25,
              "replies": {
                "fnf3o4k": {
                  "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf3o4k/",
                  "text": "True enough, but I'm taking it as given that the current era of publications makes being a Goethe or Burke or even an Asimov impossible.",
                  "author": "ph0rk",
                  "created": 1586900819,
                  "upvotes": 6,
                  "replies": {
                    "fnf4lqi": {
                      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf4lqi/",
                      "text": "there is some interesting writing on interdisciplinarity vs transdisciplinarity that addresses this",
                      "author": "capybarasleigh",
                      "created": 1586901304,
                      "upvotes": 3,
                      "replies": {
                        "fnf5244": {
                          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf5244/",
                          "text": "I don't doubt it, but when it comes to external tenure file reviewers, you are likely to have some or many that are or are even happy to think of themselves as within-silo researchers. If you can string things together in a narrative that situates all the inter/multi/trans/whatthefuckever disciplinary stuff you do in your home (as far as tenure home) discipline, they'll be happy. \n\nIf you leave that work all on the floor for them to do, they will not be happy, and the letter probably won't be as strong.\n\nOn the flip side, when you do it *right* you get letters so strong they may even toss you a bit of extra money. Ok, a course buyout. Ok, a coffee mug.",
                          "author": "ph0rk",
                          "created": 1586901541,
                          "upvotes": 8,
                          "replies": {
                            "fnf87ta": {
                              "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf87ta/",
                              "text": "a new pen",
                              "author": "Murderous_squirrel",
                              "created": 1586903212,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "fnja0hx": {
                              "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnja0hx/",
                              "text": "absolutely, completely agree, just noting there has been good work examining the effects of this\n\neg, teams of experts from diverse disciplines vs individuals with expertise in multiple disciplines who can synthesize diverse ontologies & methodologies, esp as catalysts for innovation in a specific field\n\nalso on the possibility of academe’s emphasis shifting from disciplines to fields (slowly!) over the 21st century",
                              "author": "capybarasleigh",
                              "created": 1586994820,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "fnf4z4i": {
                          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf4z4i/",
                          "text": "Care to share?",
                          "author": "CatMilkFountain",
                          "created": 1586901498,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fndw7if": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndw7if/",
          "text": "This is my line. \"My thesis is on the topic of ~dead field~ I learned a lot of theory stuff that was common in the 70s and 80s. Now I apply it to ~hot field~ and do analysis that no one has thought about since the 80s but is suddenly important again. Now I am attempting to revive ~dead field~ while I apply that work to ~hot field~. Get yourself a girl that can do both!\"\n\n\nSo far that works really well for me. The old white guys love my stuff and approve my grant applications and the up and coming grad students still want to work with me because I am not fully stuck in the dead zone.",
          "author": "harper_kentucky",
          "created": 1586878634,
          "upvotes": 94,
          "replies": {
            "fng6hw9": {
              "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fng6hw9/",
              "text": "This is such a smart approach!",
              "author": "simone_snail_420",
              "created": 1586923506,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fnduwj1": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnduwj1/",
          "text": "u/ph0rk nails it again. This is the correct answer. \n\nI was in a similar situation, with multiple transactions papers each in three distinct areas. Make sure to identify funding opportunities for each focus area, and tie everything together in a nice little package. Discuss transdisciplinary research opportunities, how knowledge in one area drives or informs research in another, etc.",
          "author": "DrLuobo",
          "created": 1586877945,
          "upvotes": 22,
          "replies": {}
        },
        "fne8p0m": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fne8p0m/",
          "text": "This. My publications are more like a mind map of related issues, so I have one very broad overarching theme within my discipline, and one specific area of focus, plus a couple of side projects that fall within the broad theme (a stretch but here we are). I had to work as RA during my PhD, and although that study was only tangentially related to my main topic, I'm now trying to connect these themes. Current institution cares about quality but also stresses quantity, so this is a good balance for now. This would be a risky strategy in a country/at an institution that values focus, though. I've often heard from US colleagues in my field that researchers from certain countries 'lack a coherent contribution to knowledge', so...here we are, I guess.:)",
          "author": "oftheshore",
          "created": 1586885013,
          "upvotes": 1,
          "replies": {}
        },
        "fnf0j4o": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf0j4o/",
          "text": "The painful truth.",
          "author": "GalacticCreature",
          "created": 1586899192,
          "upvotes": 1,
          "replies": {}
        },
        "fnemetm": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnemetm/",
          "text": "What does it even matter? You can't write about different concepts?",
          "author": "ColorsYourHair",
          "created": 1586891965,
          "upvotes": -1,
          "replies": {
            "fneokk4": {
              "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fneokk4/",
              "text": "I could try to explain why it matters, but that's not really that important, is it? It matters - particularly at the first TT job stage and promotion to tenure stage.\n\nThese hiring decisions are largely about potential - what sorts of big things is the candidate going to do in the next 10-20 years? If the candidate has a scattering of five to fifteen projects where not even *they* can see a common thread tying them together, it becomes very difficult to guess what sorts of contributions they'll make in the future - *or if there will even be any at all*.\n\nOn the other hand if they can describe a commonality in those projects that points to some big ideas on the horizon, they look *great*.\n\nBut, TL;DR: it doesn't matter - do it.",
              "author": "ph0rk",
              "created": 1586893060,
              "upvotes": 13,
              "replies": {
                "fnevvqp": {
                  "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnevvqp/",
                  "text": "Your explanation here is circular. You say:\n\n> ... where not even they can see a common thread tying them together,\n\nBut again, why does there need to be a common thread tying them together? What difference does it make if two projects happen to be independent from one another so long as they are impactful?",
                  "author": "ColorsYourHair",
                  "created": 1586896836,
                  "upvotes": -9,
                  "replies": {
                    "fnewava": {
                      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnewava/",
                      "text": "I'm telling OP what they should do. I'm not saying it makes sense. I'm saying that hiring and P&T committees and letter writers like it.\n\nI don't care if you don't like it or if you don't do it.\n\nI am describing an is, you seem to have a preferred ought - but that doesn't reflect the world right now.",
                      "author": "ph0rk",
                      "created": 1586897056,
                      "upvotes": 8,
                      "replies": {
                        "fnexbex": {
                          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnexbex/",
                          "text": "Just pointing out flawed logic, mate. Sounds like you have some projection issues, though.",
                          "author": "ColorsYourHair",
                          "created": 1586897580,
                          "upvotes": -13,
                          "replies": {
                            "fnf04e0": {
                              "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf04e0/",
                              "text": "Again - the logic isn't mine, but a reflection of how things work.\n\nPointing out that you think it doesn't make sense that it works that way won't get anyone a job.",
                              "author": "ph0rk",
                              "created": 1586898991,
                              "upvotes": 8,
                              "replies": {
                                "fnf1g0x": {
                                  "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf1g0x/",
                                  "text": "\"Okay well this calculus thing is pretty impressive, and that theory of gravity idea is a pretty good one, but I just don't see how they are related so we aren't going to be able to give you the job\" - Cambridge hiring committee. Oh wait, that didn't happen. Fancy that. \n\nIn any case, you're obviously just trying to save face by changing the conversation into something else. Before you said this:\n\n>These hiring decisions are largely about potential - what sorts of big things is the candidate going to do in the next 10-20 years?\n\nAnd now it's \"uhh okay well I don't know but you won't get the job!\" I asked why, and you clearly do not have an actual answer for that other than arbitrary politics. That's all you had to say from the start, but instead you tried to make up bullshit and you dug yourself into a ditch.",
                                  "author": "ColorsYourHair",
                                  "created": 1586899659,
                                  "upvotes": -5,
                                  "replies": {
                                    "fnf3aur": {
                                      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf3aur/",
                                      "text": "Are you implying that you are (1) Newton or (2) that the job market now is the same as it was then? Neither is that clever.\n\n> In any case, you're obviously just trying to save face by changing the conversation into something else. Before you said this:\n\nNo, I'm not. \n\n> And now it's \"uhh okay well I don't know but you won't get the job!\"\n\nYes. The point is the same. Either package your work as all tied together for reasons (essentially pitching that through line making it easy for committee members and letter writers to see the unified direction of your work), or risk diminishing your competitiveness by appearing to be a dilettante.\n\n> That's all you had to say from the start, but instead you tried to make up bullshit and you dug yourself into a ditch.\n\nThere is no ditch. This is how the academic job market works. What in the fuck are you even talking about?\n\n> I asked why, and you clearly do not have an actual answer for that other than arbitrary politics. \n\nThe answers are all above. If you can't figure them out, I'm not so sure the academic job market will really be a problem you need to worry about.",
                                      "author": "ph0rk",
                                      "created": 1586900626,
                                      "upvotes": 8,
                                      "replies": {
                                        "fnf4n7i": {
                                          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf4n7i/",
                                          "text": ">Are you implying that you are (1) Newton or (2) that the job market now is the same as it was then? Neither is that clever.\n\nAre you implying that Newton *would* have had trouble getting a job in ~1700 if the job market *was* the same as today? You are lying to yourself if you think someone rolling off ideas of that calibre will have trouble getting a job simply because they don't tick some arbitrary requirement that *you* perceive to exist. \n\nThe fact is that a \"connection\" between work is ultimately immaterial to the quality or impact of the work, and those two things are *far* more important for any job market regardless of whatever erroneous perceptions you might have. \n\nIt sounds like you are very new to science and academia, maybe with some more experience you will get a better understanding of the way the world works. \n\n>The answers are all above. If you can't figure them out\n\nWell the answer was that you don't actually have one, but thanks anyway.",
                                          "author": "ColorsYourHair",
                                          "created": 1586901326,
                                          "upvotes": 0,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "fnf4loc": {
                      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf4loc/",
                      "text": "If they're both impactful and you can get funding in both that's great. But as a PhD student you don't exactly have a track record in getting external funding. So, why exactly did you spend the time and energy specializing in two or three topic areas? Was it arbitrary? Or was there an underlying theme that drove you to research and publish on, oh I don't know, artificial intelligence, high temperature electronic design, and radio astronomy. (Actually, I struggled coming up with three areas that would be tough to connect, but probably someone here will be able to!)\n\nDon't forget the second half of the saying from OP's post - jack of all trades, *master of none*. A hiring committee may be looking for one topic area, and have 200 applicants in AI. If you are a \"jack of all trades, **master of none**\" in AI and two other completely unrelated fields, why on earth would they choose you over the other 200 applicants who *are* Masters in the field of interest? If even you cannot rationalize it, no one else will.",
                      "author": "DrLuobo",
                      "created": 1586901303,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fnfs6zl": {
              "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnfs6zl/",
              "text": "Since you and the other person seem to have gone off on a downward spiral, I’ll attempt to engage this discussion at the question you asked.\n\nThis concept is what my PI in grad school used to explain how I needed advance my own research toward a publication.\n\nAssume the path from 0-10 gets you from start to publication.  I was really good at going from 0-1, and occasionally from 1-2.  However, once I got much higher, stuff wouldn’t work initially and I’d go back down to 0 and try new 0-1 pathways.\n\nIn order to get a publication, it doesn’t matter how many 0-1’s I did or 1-2 or 2-3’s I did.  If I didn’t get to 6, I couldn’t publish anywhere, if I didn’t get to 8, I couldn’t publish in JACS, and if I didn’t get to 10, I couldn’t publish in Science.\n\nSomething like that.\n\nNow apply this same ladder-climbing concept to your career.  In order to truly push the bounds of your field, you need to be able to build up to something truly field changing.\n\nIs it possible you get there in 1 shot?  From 0-10 without going back to the start or having problems getting through some of the intermediate steps?  Sure, but it’s unlikely.\n\nPushing the bounds of your field, for most of us, requires a concerted effort to push one (class of) topic(s) forward by a significant amount.\n\nIf you’re doing lots of different fields of research, it’s possible you go 0-10 with little need to push on any individual sticking point along the way.  However, it’s unlikely.\n\nIf you’re spread thin working on lots of different areas simultaneously, you’ve got that much less thought/human/drive power to push an idea to the forefront of your field and beyond.\n\nThere are certainly people that can do it.  They’re exceptional.  But they’re rare.\n\nIf you’re trying to do it and you can’t routinely surprise your colleagues with some “really cool shit,” it’s often best to focus on one primary area of research in order to push that research as far as possible to demonstrate your ability to push research as far as possible.\n\nIf you can tie multiple projects together, you’re using advances in one field to help push the advances in the other fields forward.  This is where there is some amazing overlap between, for example, artificial intelligence and many other fields at the moment (and for the past several years).\n\nJust a thought.  Could be wrong.",
              "author": "anthony1988",
              "created": 1586914354,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fndprtg": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndprtg/",
      "text": "SLAC here and we tend to hire generalists because we don't have enough faculty to specialize",
      "author": "redredtior",
      "created": 1586875154,
      "upvotes": 30,
      "replies": {}
    },
    "fndhfrh": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndhfrh/",
      "text": "Following - I basically could have written this post! But have spanned disciples 😏just finishing up PhD now, have a post doc but a bit worried about how settling in to a career will go.",
      "author": "drofnature",
      "created": 1586870076,
      "upvotes": 27,
      "replies": {
        "fnf3ta6": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf3ta6/",
          "text": "You can draw a line at the start of the PhD, for the most part, and consider the work after that as a new research program.",
          "author": "ph0rk",
          "created": 1586900894,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fndqx6s": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndqx6s/",
      "text": "The part I don't get is how knowledge in A, B and C would make you the jack of all trades. More likely, you will be perceived as an individual who has some expertise in three particular topics. Three topics still seems like a good number to develop a reasonable level of expertise in all of them. I would be more suspicious if your number of topics rises to 5 and more (as an early-career researcher).",
      "author": "ColourlessGreenIdeas",
      "created": 1586875789,
      "upvotes": 23,
      "replies": {
        "fndwkfj": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndwkfj/",
          "text": "Jack of 3 Trades",
          "author": "bonferronibitch",
          "created": 1586878824,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "fndt0jf": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndt0jf/",
      "text": "Interdisciplinary is highly regarded in many universities. However it sounds like you are staying within your discipline. I would say that having a wide ranging publication record is an advantage for getting and keeping academic jobs as it shows you can teach and research more things than someone with a narrower focus would; this means that whilst you could get asked to teach disparate things you can also go after many different opportunities",
      "author": "johu999",
      "created": 1586876931,
      "upvotes": 14,
      "replies": {}
    },
    "fndus24": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndus24/",
      "text": "When my partner was interviewing for jobs, someone actually  said \"jack of all trades, master of none\" during the interview. He was pretty pissed about that. Long story short, though, he interviewed for 3 tenure track jobs and got offers from all 3.",
      "author": "quarkthestrange",
      "created": 1586877880,
      "upvotes": 9,
      "replies": {}
    },
    "fndr3wp": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndr3wp/",
      "text": "From my experience, it depends on the type institution you are at.\n\nWhen I was at a top tier medical school, laser focus seemed to absolutely be the expectation.  When I was at a top tier R1, a strong focus was important and the most often reason for doing something different was a unique grant opportunity.  When I was at a lower tier R1, it really seemed you just needed to stay in a theme, once again, making deviations due to grants or collaborative opportunities.  At my regional university, it is nice if you have some overall conceptual framework, but research can really swing due to funding, collaborations, or just trying to come up with something that can be done with limited resources.  And when I was at a SLAC, any publication seemed to be fine, related or not.  \n\nGranted, my experiences may not generalize since I really only have n=1 examples of each type of school.",
      "author": "manova",
      "created": 1586875892,
      "upvotes": 9,
      "replies": {}
    },
    "fndy9to": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndy9to/",
      "text": "40 years ago somebody like you might be considered a good candidate due to your broad skillset. Nowadays having a healthy interest and competence in a broad range of subjects can have negative consequences when applying to overly specific TT positions. It's absolutely maddening and demonstrates much that is wrong with contemporary academia.",
      "author": "radionul",
      "created": 1586879723,
      "upvotes": 8,
      "replies": {}
    },
    "fneblgn": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fneblgn/",
      "text": "Ah, you are describing the transdiciplinary approach. Been there, got the tshirt, the impostor syndrome and the tenure-track job!",
      "author": "NeuroDoofus",
      "created": 1586886450,
      "upvotes": 4,
      "replies": {}
    },
    "fnf9c3r": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf9c3r/",
      "text": "The difficulty in what you describe for faculty hires (less so for run of the mill postdocs) is in showing your independence. If your projects are scattered, it can seem like you aren't the real intellectual lead behind them (even if first author) but just the grunt doing the work. The way out of this is single author papers or at least perspectives/commentaries that set you up as the intellectual leader.\n\nAnd as other said, coming up with a post-hoc story that ties your interests together is useful. I had to do this.",
      "author": "DevFRus",
      "created": 1586903801,
      "upvotes": 3,
      "replies": {}
    },
    "fne62rz": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fne62rz/",
      "text": "Ultimately, it depends on where you would like to find a job. As was mentioned, some institutions like to hire generalists who can teach a wide range of coures, because their faculty size is small and they lack the critical mass to specialize, but research focused institutions typically prefer people with a strong record in one area, so that they are competitive for grants, and they have the potential to become leaders in a field.  \n\n\nIt's perhaps a bit different if these different skills allow you to pursue a compelling interdisciplinary research direction, but as was mentioned, one needs to be able to tell a compelling story that ties the various threads together. Also, while many research institutions wish to pursue interdisplinary research directions, keep in mind that hiring is still primarily done at the departmental level, so unless there is a targeted interdisciplinary search, because it is a a field that is very well funded, getting hired as a interdisciplinary researcher can be challenging as well.\n\nEven if your diverse research directions are all in a single broad field, support for your hiring tends to be based on experts in your subfield, and if you lack depth, then it's difficult to find a core group of people who would support your candidacy.",
      "author": "mleok",
      "created": 1586883702,
      "upvotes": 2,
      "replies": {}
    },
    "fngb84k": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fngb84k/",
      "text": "I don’t think it’s so bad if you have the right mindset and attitude. For example, my PI is essentially a jack of all trades. As a new professor, it was initially difficult to find direction but he’s really great at starting up collaborations and finding the “experts” that can help him bridge the gap. He’s also not afraid to admit when he doesn’t know something as well as he’d like. To be honest, I feel like the majority of people are a jack of all trades as opposed to an expert but very few admit to it. Since he is open about subjects he is weaker in, he’s not afraid to ask questions and is so present/engaged in discussions and doing his own background research. Because of that, he’s able to soak up knowledge like a sponge.",
      "author": "raulu95",
      "created": 1586927069,
      "upvotes": 2,
      "replies": {}
    },
    "fndikgf": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndikgf/",
      "text": "it’s quite bad because hiring tends to be within traditional disciplinary fields. \n\nMaybe you are the only person out there doing X and Y together: the trouble is that hiring committees from Dept X and Dept Y may not think you are a good enough fit for them.",
      "author": "Bob_the_blacksmith",
      "created": 1586870816,
      "upvotes": 1,
      "replies": {
        "fndyeks": {
          "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fndyeks/",
          "text": "upvote for you for telling the truth",
          "author": "radionul",
          "created": 1586879791,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fnds373": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnds373/",
      "text": "It can be very good, and certainly a lot of fun! However I think you need to identify a niche for which you are THE expert. It can be a niche that spans disciplines, but think of it as a combination of discipline and subject matter. Maybe you’re the expert on using X and Y for Z. That’s great! Figure out that niche and the generality can be a huge benefit",
      "author": null,
      "created": 1586876425,
      "upvotes": 1,
      "replies": {}
    },
    "fnduok7": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnduok7/",
      "text": "I have a friend who published in a bunch of different subfields as a graduate student, doing pretty advanced work in all of them, but when he hit the job market, he struggled because departments were usually hiring for a person in a specific subfield (eg \"we want someone who studies methods\") and he was too spread-out to fit into any of those buckets well. This is undoubtedly discipline- and country-dependent, though.",
      "author": "pacific_plywood",
      "created": 1586877829,
      "upvotes": 1,
      "replies": {}
    },
    "fnefg9a": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnefg9a/",
      "text": "I think its very possible to be \"good\" at a lot of things but its hard and takes time. Im someone who has a broad and wide understanding of my field, way beyond what. Im supposed to know, but the downfall is that Im not quite sure what I am an expert in. I know enough to dive in to various topics but theres never enough time to master one of them. But then again, my field is very exciting I would need another lifetime to play with everything my field has to offer.\n\n&#x200B;\n\nOne thing I do, is every year I pick a focus, aside from teaching I spend alot of time doing research or side projects when I can.",
      "author": null,
      "created": 1586888420,
      "upvotes": 1,
      "replies": {}
    },
    "fnf3q9s": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf3q9s/",
      "text": "Honestly. There are so many institutional incentives to just find and pursue a really niche and increasingly vanishing subject area, that I don't see how people find this fulfilling over the long run.  That's why you hear people talking about \"research streams.\" It's far better, IMO, to be the kind of person who reads broadly and then finds specific areas of arbitrage: one area might have a method or idea or framework that can substantially develop another. In that way, you're kind of a translator of sorts and really a superhero in my mind. You create new opportunities rather than just foreclosing on existing research opportunities.",
      "author": "kuds1001",
      "created": 1586900850,
      "upvotes": 2,
      "replies": {}
    },
    "fnf4hbe": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnf4hbe/",
      "text": "I'll just chime in to say that when I went on the job market as an associate professor- having already done pretty well in the first 6 years of my career at an R2, with a TON of publications. When I was declined my dream job at an R1 I asked for feedback and the hiring committee chair said \"we can't tell what you do\".",
      "author": "manic_panic",
      "created": 1586901239,
      "upvotes": 1,
      "replies": {}
    },
    "fnflty5": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnflty5/",
      "text": "It probably depends on the country.  But in general the answer is Jack of all trades isn't a good idea. \n\nThere are a few reasons: \n\n- Your results in new area B  are unlikely to be path breaking to experts in area B. They are unlikely to see your entire contribution in areas A,B,C. So you get lower credit. \n\n- Unless your papers are path breaking  the feeling would be - if you didn't focus on B and C you will be doing much better in area  A. It is childish but it is what it is. \n\n\n-  In new hires, the dept has to justify why your are a good hire.  Now they will ask -- we are hiring an expert in A, but this guy seems to do A,B,C. Maybe in a year he will start doing D and our dept will not have the expertise in A. \n\nSean Carroll has a blog where he has mentioned these issues. Academia isn't very open-minded.",
      "author": "omeow",
      "created": 1586910617,
      "upvotes": 1,
      "replies": {}
    },
    "fngg2nw": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fngg2nw/",
      "text": "Wow, so many useful tips and kind comments in this thread! Thank you for your input.",
      "author": "Curriana_Grande",
      "created": 1586931124,
      "upvotes": 1,
      "replies": {}
    },
    "fnhrzse": {
      "link": "/r/AskAcademia/comments/g155l5/how_bad_is_it_to_be_a_jack_of_all_trades_in/fnhrzse/",
      "text": "You're possibly slightly past this career stage so it might not be relevant, but I'd worry about this most in the early stages of the career when hopping from PhD to post-doc to next post-doc. I'm trying to transition to a slightly different discipline for a post-doc, and failing. There's many reasons why my applications might be getting rejected, but I get the impression it might be because they're opting for candidates who already have experience in that precise field. It's frustrating, but if you've got hundreds of candidates to choose from, why *wouldn't* you choose the guy or girl who's already spent years working on the topic? \n\nI might be wrong about that though, so I'd be interested to hear other thoughts on it.",
      "author": "BorisMalden",
      "created": 1586967826,
      "upvotes": 1,
      "replies": {}
    }
  }
}