{
  "sid": "iaz722",
  "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/",
  "title:": "Humanities Profs: How much of a difference does an applicant contacting you before the PhD cycle make?",
  "text": "Just wondering about the above question! Specifically thinking of American Studies/English/Ethnic Studies programs. What are the unspoken rules here? Is it a must to contact profs beforehand whose interests overlap with yours, and if so what does one put in that email? Is it irritating/irrelevant?",
  "author": "indigo77",
  "created": 1597607894,
  "updated": 1634081903,
  "over_18": false,
  "upvotes": 103,
  "upvote_ratio": 0.95,
  "comments": {
    "g1s9rxp": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s9rxp/",
      "text": "I’m surprised by the responses here. While humanities faculty are fine with being contacted by prospective students, it’s unlikely they’ll respond unless you’ve already been accepted into the program. I think those who do respond probably offer a general “Your work sounds great; I encourage you to apply.” Reaching out is certainly not required. Here’s why:\n\n**1.** In the humanities, unlike STEM, students are mentored by professors, but they don’t work alongside them. That is, students don’t generally contribute to our research. So while you should only apply to programs where there are people who could guide you in your own project and speak to the originality of your contributions in a recommendation, the relationship is generally more one-sided and lacks the regular face time necessitated by (most) labs.\n\n**2.** Only a small number of faculty in a given department are on grad admissions. This committee changes every year. They determine who’s accepted.\n\n**3.** On occasion a faculty member who knows a student (i.e. was impressed with them at a conference or perhaps worked with them as an undergrad or MA student at another institution) *might* remember to email someone on the committee and say, “Hey, by the way, I’m a fan of this student for X reason.” We’ll give this application a closer look, but it doesn’t offer any advantage beyond that. That’s because the committee can’t function by catering to faculty who aren’t doing the work of reading 300-500 applications and seeing the whole pool.\n\n**4.** The key to point 3 is they “know” the student—they’re familiar with their work in some capacity and were impressed. So, a conference presentation or a previous advising relationship can accomplish that, but an email from a stranger, no matter how well-written, just can’t.\n\nGrad admissions is an extremely intensive and time-consuming process that happens at an awkward time (essentially spans the entire winter break). What this means is that admissions isn't that interested in input from non-committee faculty, because they have no sense of the **(300-500 applicant)** pool, and we’re doing all the work. There are rare exceptions (mostly covered by the third point).\n\nI’d be curious if those who advised you to contact faculty also think faculty would respond. Even in normal circumstances, I don’t think so. But with the heightened workload that COVID 19 is demanding, I think it’s even less likely.\n\n**If you reach out, make your email as brief as possible.** Aim for the length of a conference paper or article abstract--**250-350 words.** That would demonstrate both your awareness of their limited time ***and*** your ability to talk concisely about a complex project. That would leave a great impression. Good luck with everything!\n\nBackground: Young professor working at intersection of humanities and STEM. Earned doctorate from an Ivy in discipline A, held a fellowship at another Ivy in discipline B, currently a professor at a top public R1. Recently served on grad admissions.",
      "author": "synthesis-synthesis",
      "created": 1597621090,
      "upvotes": 84,
      "replies": {
        "g1sfg8f": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1sfg8f/",
          "text": "Interesting perspective and great point about differences by field. I think the scenario you describe may be common in top programs at R1s, but that’s not representative of all levels and disciplines of academia. I’m in a small dept at an R2, we all review admissions apps, and would all respond to, and possibly even meet with, prospective applicants.",
          "author": "Trulymadlydeeplydo",
          "created": 1597624503,
          "upvotes": 20,
          "replies": {
            "g1t2hzq": {
              "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1t2hzq/",
              "text": "You're absolutely right that I assumed they'd be applying to PhD programs at R1s. You're also right that if a department is small enough, regardless of the university's tier, then basically all the faculty are always on admissions every year.\n\nI suspect response rate could be linked to application pool size. We have one small department here that nevertheless receives over 500 applications a year. I don't know what percentage of applicants contact faculty or how they handle it.",
              "author": "synthesis-synthesis",
              "created": 1597639516,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "g1sikso": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1sikso/",
          "text": "I contacted my POIs in advance to the heavy suggestion of my advisors in my Master's program (both extremely accomplished academics in the field). Your points are completely valid, but my advisors told me to do this anyway because even if you don't get a meaningful response (or a response at all), it proves you have researched and are dedicated to the application process. You're not just some applicant who chose school A because school A is the best school. You understand that your research interests align with school A because professor X is there. \n\nAnd while admission committees might not weigh these emails or the input of their non-admission committee colleagues as vital to the final decisions, it DOES make you stand out from the pool of 300-500 applications. If anything, it's a foot in the door that will let admit committees take note of you even if the professor you emailed was not in the admissions committee. \n\nIn my case in particular (I am an incoming PhD student in the humanities), I reached out to professors in all the schools I applied to and typically received no answer. However, one of the professors (who was not in the school's admission committee that year, but had participated before) that did respond. He encouraged me to send over my application materials and advised me how to make my statement stronger. \n\nThat is to say, even if these emails lead to no boost in your application, you might end up with a professor who is particularly generous with their time to assist you on the application process and you won't know until you email them!",
          "author": "sourlondon",
          "created": 1597626411,
          "upvotes": 10,
          "replies": {
            "g1t1bkl": {
              "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1t1bkl/",
              "text": "I'd just say that it can't prove anything and it can't make you stand out if no one on admissions is made aware that you emailed or that your email indicated anything noteworthy. It's extremely unlikely that any faculty member would mention to someone on admissions that a student they have no previous relationship with emailed to say they were interested. Most applications indicate prospective faculty advisors/mentors, which is a more effective way of demonstrating that you researched our program, since we definitely see all the application materials.\n\nI'm really glad to hear that one professor was a rare exception in your case and provided feedback on your application. I did mention in my initial response that if OP still wanted to contact faculty, they certainly could and that a concise email would make the best impression. Best of luck in your program!",
              "author": "synthesis-synthesis",
              "created": 1597638618,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "g1tdjen": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1tdjen/",
          "text": "While this is generally good advice, I think there are three things that need to be clarified here.   These things would ultimately lead me to change your overall point (that \"Reaching out is certainly not required.\")  Because I think it can be, at least in certain cases. \n\nFirst (and biggest):\n\n>2. Only a small number of faculty in a given department are on grad admissions. This committee changes every year. They determine who’s accepted.\n\nYes, BUT...    While some departments do admissions this way (and leave everything up to the admissions committee) many others--including ours--have a two step process.   Because many subfields in the humanities are quite disparate, and having someone from one subfield admitting a student from a different one can be problematic.  (having historians of modern US history deciding which grads to admit in medieval Chinese history just doesn't work.)\n\n1)  In our department, the files are first sorted by field and/or potential advisor.  The subfield group (say, Early Modern European History, or Roman Archeology) then look through all of \"their\" files, and communicate among each other to rank these files.  Then, the admissions committee generally follows these rankings, but balances them out, i.e. evaluates candidate from subfield A vs. candidate from subfield B, and tries to come up with a balanced admissions picture. \n\nWhat this means, at least in our department, is that an email to a potential advisor i.e me, would be read by me, before I rank a file. \n\n2)  Second, while it's true we don't work as closely as in a lab, a PhD in my field is a seven or eight year commitment to work with that student.  (!)  So ability but also personality becomes important.  (as no one wants to have an insufferably arrogant or neurotically insecure PhD student for 7 years... it is draining.)   A personal communication can be a means for an applicant to convey that they are professional and decent to work with.  (or a warning sign...!  :-)   \n\n3) Finally, in admissions, a stellar file is a stellar file.  No contact necessary.  Similarly, a weak file is just not going to pass admissions, so a personal communication there won't help very much.  Where contact could be really useful--even necessary--is in the middle cases.  For instance, a file that's really borderline for some reason--maybe the student looks strong, but majored in a different field, and you don't know if they really have the background.  Or a research language doesn't look strong enough.   Or, there's some oddness in the file--the applicant has great recs, but was a chef for 6 years, only now wanting to come back to grad school.  In these situations, personal contact can really fill in extra information... and for me personally, that extra information might make me feel like I'm taking less of a 'risk' by admitting a borderline candidate.  \n\nSo, contact can be very useful.!!\n\n  But don't expect much by way of a reply--sometimes you'll be answered in detail, sometimes not at all.",
          "author": "DerProfessor",
          "created": 1597649403,
          "upvotes": 7,
          "replies": {
            "g1vd7e0": {
              "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1vd7e0/",
              "text": "I appreciate your post--it's really thoughtful and nuanced. Your second and third points are especially helpful to include here for OP and others. I didn't mention either because my initial response already ran on for too long.",
              "author": "synthesis-synthesis",
              "created": 1597678428,
              "upvotes": 3,
              "replies": {
                "g1vpi2k": {
                  "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1vpi2k/",
                  "text": "absolutely. \n\ngotta help the kids.  :)",
                  "author": "DerProfessor",
                  "created": 1597683009,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "g1sv4io": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1sv4io/",
          "text": "For every grad program I applied to, I was encouraged to find my prospective supervisor in the department beforehand and that played a big role in the applications. For context, I’m a humanities PhD candidate in Canada.",
          "author": "eyecontactishard",
          "created": 1597634302,
          "upvotes": 4,
          "replies": {
            "g1szwc0": {
              "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1szwc0/",
              "text": "That's great--just a note that I was responding in the U.S. context since that's what OP requested.",
              "author": "synthesis-synthesis",
              "created": 1597637585,
              "upvotes": 2,
              "replies": {
                "g1t3tay": {
                  "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1t3tay/",
                  "text": "Did they say that? I just saw the mention of American studies but we offer that here in Canada too so I thought I would just offer another context in case!",
                  "author": "eyecontactishard",
                  "created": 1597640563,
                  "upvotes": 4,
                  "replies": {
                    "g1vb205": {
                      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1vb205/",
                      "text": "Nope, you're right (and you were so nice about it, too). For some reason my brain made American do double duty.",
                      "author": "synthesis-synthesis",
                      "created": 1597677743,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g1uvhby": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1uvhby/",
          "text": "I'm at an R1, and once the admissions committee has a shortlist, we actually reach out to the faculty who would probably be working with each applicant. They get final say.  Because if there's only 2 prospective advisers and neither wants to work with the student,  or 1 has maxed out their # of advisees for the next few years and the other is about to take an admin job,  there's no use admitting that applicant. \n\nSo those faculty,  once approached,  can say \"oh, C emailed me a few months ago and I think they'd be a good fit\" or \"I've never heard of this person and their writing sample is borderline\".",
          "author": "Readerokie",
          "created": 1597672475,
          "upvotes": 2,
          "replies": {
            "g1vcvbh": {
              "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1vcvbh/",
              "text": "Fair (and interesting) point: we do that if we know a particular faculty member has an especially high number of advisees because they're the only one or one of two in their sub-field, for instance. Or if we're trying to decide between two candidates for a specific sub-field or if we're on the fence about someone. Or if a professor is edging towards retirement but it's not clear what their timeline is. \n\nI wouldn't say--in my own experience--that non-committee faculty as a whole get final say exactly, but in the instances when we do reach out, their feedback is paramount.",
              "author": "synthesis-synthesis",
              "created": 1597678321,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g1saw2n": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1saw2n/",
      "text": "[deleted]",
      "author": null,
      "created": 1597621756,
      "upvotes": 12,
      "replies": {
        "g1snljp": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1snljp/",
          "text": "Certainly, its indicated on the application, but I might consider it a little too formal, maybe slightly rude, to have never received an introductory email before getting the new applications.",
          "author": "bluethirdworld",
          "created": 1597629483,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "g1rxv42": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1rxv42/",
      "text": "Is usual a nice thing, or even necessary, to contact professors before hand, then they have a better idea who you are and it may help the process as long as you have what it takes. Also good way to make a connection if you aren't successful in the application.",
      "author": "bluethirdworld",
      "created": 1597614326,
      "upvotes": 42,
      "replies": {}
    },
    "g1rzej7": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1rzej7/",
      "text": "You have to. There are entirely too many applicants in the pool, and you need to do everything you can to make yourself memorable and interesting to those you want to work with.",
      "author": "tamirabeth",
      "created": 1597615169,
      "upvotes": 38,
      "replies": {
        "g1s0joe": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s0joe/",
          "text": "Thank you, and this makes sense! I'm just worried about not having anything beyond \"I think your work is really interesting and aligns with my areas of study\" to say, since I'd be cold-emailing someone I don't know at all, which seems like it'd be the opposite of a memorable email to receive for a well-known professor during a tough admissions cycle. Is that a silly concern to have?",
          "author": "indigo77",
          "created": 1597615804,
          "upvotes": 13,
          "replies": {
            "g1s0vtd": {
              "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s0vtd/",
              "text": "Not at all, all of your concerns are valid and have reason. \n\nThink carefully and write a couple of drafts. And speak from the heart. What does their work mean to you, and how do you see yourself working with them? What's your project, and how can their specific work help you? What about the university and the department makes you want to be there?\n\nKeep it short-ish, but make sure to say enough. It's all a tricky business, but you can do it.",
              "author": "tamirabeth",
              "created": 1597615992,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "g1s0f8i": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s0f8i/",
      "text": "In philosophy in the US it's frowned upon.  I don't know about elsewhere or in other programs.",
      "author": "willbell",
      "created": 1597615735,
      "upvotes": 17,
      "replies": {
        "g1s2j8o": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s2j8o/",
          "text": "In Australasia and the UK in philosophy it is encouraged.",
          "author": "gladsome2",
          "created": 1597616913,
          "upvotes": 8,
          "replies": {
            "g1s34wt": {
              "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s34wt/",
              "text": "Any idea about Canada?",
              "author": "wackrapconcarne",
              "created": 1597617248,
              "upvotes": 1,
              "replies": {
                "g1s7iap": {
                  "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s7iap/",
                  "text": "In Canada it, as in all things, is department dependant. Generally speaking if you don't know your advisor you will not be getting in. That being said, there are fewer and fewer people applying to most programs and most schools, while the top school has seen their applications skyrocket (as higher ed further bifurcates).",
                  "author": "thegeneralstrike",
                  "created": 1597619750,
                  "upvotes": 4,
                  "replies": {}
                },
                "g1s571p": {
                  "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s571p/",
                  "text": "No idea, sorry. I wonder if the difference is the fact that in Australasia and Europe most PhD programs are straight research (i.e. no coursework), whereas in the US students have to take coursework before starting their dissertations. That difference might account for the difference in whether to contact potential advisers, since the need for an adviser is more immediate if you're going straight into research.",
                  "author": "gladsome2",
                  "created": 1597618411,
                  "upvotes": 3,
                  "replies": {}
                },
                "g1s9yud": {
                  "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s9yud/",
                  "text": "Depends. In my department, students are expected to contact the professors they are interest with before their application",
                  "author": "GrumpyCockatoo",
                  "created": 1597621205,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "g1s1aks": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s1aks/",
          "text": "Good to know, as I’m set to start applying shortly.",
          "author": "JazziMari",
          "created": 1597616218,
          "upvotes": 2,
          "replies": {}
        },
        "g1t4giq": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1t4giq/",
          "text": "This is true, as I wrap up with my MA in philosophy and getting ready to apply to Ph.D. programs. My advisor advised me of this.",
          "author": "TheDevilsYouDont",
          "created": 1597641078,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g1scwwo": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1scwwo/",
      "text": "It's pretty much expected in my program for \"serious\" candidates.  It won't make up for a poor application, but applicants who write in advance are usually more mature and clued-in, which comes through in their app materials and rec letters.",
      "author": "Readerokie",
      "created": 1597622975,
      "upvotes": 7,
      "replies": {
        "g1uvvks": {
          "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1uvvks/",
          "text": "FWIW I'm in a humanities dept in a US R1.",
          "author": "Readerokie",
          "created": 1597672658,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g1ufd1d": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1ufd1d/",
      "text": "Not in the exact fields you mention, but we often have prospective grad students contact faculty ahead of time at my Ivy. \n\nIt's definitely not a bad thing to get in touch with faculty you have researched and are truly a good fit. The email should be detailed and focused, not just \"hey, I'm interested in your program.\" Everyone who applies is interested. \n\nIt's also definitely not necessary.\n\nMost of all, it's not a substitute for a carefully tailored application that tells us why you are a good fit for our department.",
      "author": "HomunculusParty",
      "created": 1597666851,
      "upvotes": 1,
      "replies": {}
    },
    "g1uoi4f": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1uoi4f/",
      "text": "I hope it’s okay if I tag along and add a follow-up question. \n\nI’m in the USA in the Humanities (English). I’m planning to apply for enrollment in the fall for Fall ‘21 or Fall ‘22.\n\nI have three programs in mind and I’ve chosen them because they each have a specific faculty member that has published a body of work that I’ve followed closely. \n\nWould it make sense to reach out? I wouldn’t want to go to those programs unless I knew there was a chance I could work/take classes with these people. I guess I’m hoping I could start a bit of a conversation now and then see how things move forwards towards the application process. \n\nI guess I’m asking much of the same of what’s already been posted, but I’m specifically trying to figure out if it’s better to make contact now or wait closer towards the application process.",
      "author": "nerdhappyjq",
      "created": 1597669812,
      "upvotes": 1,
      "replies": {}
    },
    "g1s5a03": {
      "link": "/r/AskAcademia/comments/iaz722/humanities_profs_how_much_of_a_difference_does_an/g1s5a03/",
      "text": "UK and law so YMMV but its basically required, not only do you need to stand out from the rest of the applicants but I need to feel that you're the right 'fit' for the position (and me) and that's really not something that comes across just from a CV and application.",
      "author": "tc1991",
      "created": 1597618457,
      "upvotes": 1,
      "replies": {}
    }
  }
}