{
  "sid": "qj3jen",
  "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/",
  "title:": "Is this a red flag for potential labs/research groups?",
  "text": "Hello, I hope this is okay to ask here as I don't know anyone I could ask in person. I mean this question in the most respectful way possible.\n\nI am looking into labs looking for potential PIs for a PhD in US schools. I notice in some cases, the lab is comprised virtually 100% of members of the PI's same national? background (telling from their names), in an otherwise multicultural department. Current student, past students, even undergraduate students - all of the same national group. Also the research is often theoretical STEM or mathematical and completely unrelated to any kind of cultural element.\n\nI will not say which national group (and I've seen this happen with more than one group), but it's common enough that it's a trend. The faculty and students of the department as a whole are very multicultural so I don't see how this happens naturally, unless the PI intentionally only picks members from the same group as them. Also looking at the past publications of the group, the trend holds too (so it is not just a random fluke at one point in time).\n\nIt would be analogous to if for example, in my home country of Argentina, there would be labs at the university comprised only of ppl with French names, or only Polish ppl, or only Greek ppl.\n\nI mean no disrespect but, as someone obviously not from that ethnic group (as an Argentine), should I even bother applying to mono-cultural labs? I'm interested in the research but get a sense I won't be welcome. \n\nAlso, is there any legitimate reason why this could turn out so? And Is this okay in terms of university policy and diversity/inclusion?\n\n(Sorry if this is insensitive in some way, I don't really know how things work in the US, but I genuinely just thought US universities are very emphasizing not having bias in nationality or ethnicity in hiring).",
  "author": "ThatNerdOverThere-",
  "created": 1635606958,
  "updated": 1636174053,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.89,
  "comments": {
    "hinqpor": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hinqpor/",
      "text": "I have worked in mono-cultural labs like this and you just have to be prepared to hear mostly the language of the culture that predominates. \n\nThis causes most people in the lab not of that culture to move on because they are missing too much daily communication to fully participate. Many times I was out of the loop because my lab-mates forgot to say an instruction or update in English just for me, even though they tried to include me and were great people.",
      "author": "groveofcedars",
      "created": 1635611404,
      "upvotes": 63,
      "replies": {
        "hinrj7z": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hinrj7z/",
          "text": "This is exactly what I am worried about. (Also instead of busting myself years to pass the toefl, now I would need to know another language, just to have the possibility do my work properly...? it does not seem fair)",
          "author": "ThatNerdOverThere-",
          "created": 1635611747,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "hioomfy": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hioomfy/",
      "text": "It's not a red flag if it is just the current state of the lab. What about alumni from that lab? Were they also from the same nationality? \n\nA certain lab in my department has for some weird reasons ended up with 4 students of the same nationality (2 from different nationalities left the program, 2 others graduated). This isn't a problem. But I know another professor who only hires students from the same nationality as him, and adds a token white guy (or girl) there to proofread the papers. That's fucked up. \n\nThe history of the lab will help you better understand if it is a red flag or not.",
      "author": "anicedayinnewyork",
      "created": 1635625765,
      "upvotes": 16,
      "replies": {
        "hipn3aa": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hipn3aa/",
          "text": "I have definitely heard of PIs that only hire students from a specific nationality (and gender), and it's not so much a red flag as to why, but an open secret. 🤮",
          "author": "Jacqland",
          "created": 1635642284,
          "upvotes": 5,
          "replies": {}
        },
        "hiqhxre": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqhxre/",
          "text": "Oh I meant alumni and publications too, that's why I wrote it's not just at the current point in time. All the labs in question, their past collaborators, publications, alumni, all are of the same national origin too.\n\nIf it were one point in time, or the lab was small (5 members or so), I would probably think it's a coincidence.",
          "author": "ThatNerdOverThere-",
          "created": 1635660739,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hiovsaa": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiovsaa/",
      "text": "IME this is a red flag. Without getting into details because there is an ongoing investigation this became problematic at a federal level because a PI chose only students who would cooperate with what she was doing wrt her home country and this lead to serious breach of national security.\nObviously this is on the extreme end but on a smaller scale I've seen this become an issue with labeling of solutions etc (we have had to implement a \"only label in English for safety\" rule) and with members not of the one ethnic or national group being excluded from meetings, outings, and discussions and as a result missing important information. \n\nIf it's just a coincidence, it's just a coincidence and you might have a wonderful time and do great work.",
      "author": "capybaracreek",
      "created": 1635628969,
      "upvotes": 11,
      "replies": {
        "hiqhtbg": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqhtbg/",
          "text": "I agree; I'm the type to give benefit of the doubt, - so sure if it were 5 or so members, and only at one point in time, I'd try to see how it is a coincidence. But there were some labs of 10-20 members who are ALL that national origin, and then looking at publications, past members over 5-10 years, they are also ALL that national origin. At that point it's hard not to feel it's statistically significant.",
          "author": "ThatNerdOverThere-",
          "created": 1635660634,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hiol86l": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiol86l/",
      "text": "Flip side: it’s possible this is more due to the students choosing to work with someone they feel more comfortable with than the professor being biased.",
      "author": "WoodwardHoffmannRule",
      "created": 1635624234,
      "upvotes": 18,
      "replies": {
        "hiqi2lo": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqi2lo/",
          "text": "Ohh I see. I can empathize with that.",
          "author": "ThatNerdOverThere-",
          "created": 1635660851,
          "upvotes": 2,
          "replies": {}
        },
        "hjawhj9": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hjawhj9/",
          "text": "The professor could still *actively select* a diverse group......",
          "author": "lalochezia1",
          "created": 1636044665,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiop0ye": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiop0ye/",
      "text": "I would take this lab as some sort of \"waitlist\" and look for another one",
      "author": "Rein233",
      "created": 1635625947,
      "upvotes": 7,
      "replies": {}
    },
    "hiqtw6a": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqtw6a/",
      "text": "Certainly, there's the worry about PI bias and others have discussed this quite well already. However, in my estimation the *student* are usually a bigger factor in these situations.\n\nMinority students, especially international students, are reasonably worried about PI bias and therefore have a slight tendency to gravitate toward groups that have a track record of being hospitable to students like them. The sets up a self-perpetuating likelihood that students of a certain background, such as a specific nationality, will enter certain labs. (Other issue: money. In programs where domestic students can be centrally funded, in addition to having more fellowship opportunities, while international students *must* be funded by their supervisor, the international students necessarily have both fewer options of labs and are more vulnerable to exploitation.)\n\nOn the other hand, prospective students who don't belong to that same identity group may worry about missing out on things if they join a lab where they would be a clear minority in the group. Language is poses one of the clearest potential inequalities here---it's harder to participate in a lab environment when your labmates are communicating in a language you can't understand. Social exclusion is another worry, because a lot of collaborations and experiments are born in casual conversation rather than lab meeting.\n\nBasically, lab composition is complicated. It's hard to call relatively homogeneous labs a red flag.",
      "author": "aggressive-teaspoon",
      "created": 1635670842,
      "upvotes": 6,
      "replies": {}
    },
    "hio1mfd": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hio1mfd/",
      "text": "I'd consider it carefully. I work in a country where the native language is not English, and the labs have a majority of locals, even though there are lots of foreigners. They don't like you talking in your native language, because they feel you're \"gossiping\" about them. They do so, anyway. Also, at some point there was the feeling of \"us vs them\", fostered by the toxic PIS. Double check, as a fellow Latin American I would not recommend going to a monocultural lab.",
      "author": "Practical-Confusion7",
      "created": 1635615921,
      "upvotes": 12,
      "replies": {}
    },
    "hinr5im": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hinr5im/",
      "text": "It's not necessarily a problem. As a white female in the US, I was the minority in my lab. Most of the people in the lab were from a particular country. This in itself was never a problem. I think it did enable my PI to create a very toxic lab environment. It's a lot easier to make sure people are despatately doing whatever you want when they are worried about their visas. That being said, most internationals that I knew while I was in academia were not concerned about this, unless they were in a toxic lab. I assume most labs filled with internationals, and most labs in general, are not toxic.",
      "author": "kirby726",
      "created": 1635611589,
      "upvotes": 17,
      "replies": {
        "hiotr57": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiotr57/",
          "text": "This should be a lot higher up for those seeking grad school or postdoc in the US.",
          "author": "some_ether",
          "created": 1635628066,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hirr6fo": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hirr6fo/",
      "text": "It depends why this is happening. If the PI seeks out only international students, ask them questions about their working conditions. Some PIs expect international students to work excessive hours and even do odd jobs like dog sitting for them. The abuse is harder to fight when your visa is on the line.\n\nOn the other hand, sometimes racism or xenophobia play a role in students’ choices of research group. This, unfortunately, happened to a South Korean professor in my old department. Through no fault of his own, he was only able to recruit Korean students.",
      "author": "kittypryderama",
      "created": 1635692641,
      "upvotes": 3,
      "replies": {
        "hirwkrm": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hirwkrm/",
          "text": "I see, this gives a good perspective! Thanks. I myself would be happy to work with any PI from anywhere, as long as the lab is welcoming to me and doesn't treat me like a token, leave me out of collaborations, have my name left out of the paper suddenly (like happened to a friend of mine unfortunately), or everyone talking over my head in a language I can't understand :,)",
          "author": "ThatNerdOverThere-",
          "created": 1635695036,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hio0y15": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hio0y15/",
      "text": "From the other side, it is not always easy to maintain a diverse lab. I've tried for years and it is always trying to tip one way or the other. This is because, (1) at level of individual labs, the sample size is very small. I get maybe 1 to 2 people who want to join my lab in a year. It's not like there are ten applicants from which I can balance diversity. (We have rotation system, so these are already admitted students.) (2) Once things start tilting one way, students tend to avoid your lab with suspicion, especially when you and your lab are ethnic.",
      "author": "unreplicate",
      "created": 1635615636,
      "upvotes": 9,
      "replies": {
        "hiqj1vk": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqj1vk/",
          "text": "I also want to add if you get candidates from trusted collaborators and they are from s particular country, then your lab will likely start filling up with people from that country.",
          "author": "Condimentary",
          "created": 1635661666,
          "upvotes": 3,
          "replies": {}
        },
        "hiorbbx": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiorbbx/",
          "text": "Yes this is definitely something to point out! As a student I've also seen this happen.",
          "author": "Undeadmushroom",
          "created": 1635626963,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hinhq5r": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hinhq5r/",
      "text": "It's rare but not unheard of.\n\nWhy does this happen? Nepotism. \n\nWhy would the university let it happen? Don't underestimate the power of tenure.\n\nShould you try to apply? You can try to confirm whether thr PI is biased. Drop an email to the PI and see if he is interested. If what you allege is true, he/she will reject you right away.",
      "author": "Wise-Replacement7286",
      "created": 1635607600,
      "upvotes": 11,
      "replies": {
        "hinjipf": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hinjipf/",
          "text": "Interesting.. the five or so I came across were all non-tenured professors (or maybe I assumed they are non tenured because it said associate professor)? \n\nIt is very disheartening. Several seem to be right in my topic of intended research, if the PI are biased, I have so many fewer options then in an already niche field : \\",
          "author": "ThatNerdOverThere-",
          "created": 1635608378,
          "upvotes": 1,
          "replies": {
            "hinkmkd": {
              "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hinkmkd/",
              "text": "Usually, associate professor and above are tenured. Assistant professor is not.\n\nIf the topic you studied is niche, you may want to reconsider. Will you be able to secure an academic job / research funding in the future by working on that field? While it is good to continue working on the same topic as your UG or Master, going for a PhD is also a chance for you to change your research topic. It does not have to be an entirely different topic, just enough that you can be sure that it will still be researched for years to come.",
              "author": "Wise-Replacement7286",
              "created": 1635608840,
              "upvotes": 8,
              "replies": {}
            },
            "hinkrxm": {
              "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hinkrxm/",
              "text": "Associate professors are tenured, but to answer your question, it's a yellow flag and I would proceed cautiously but not rule it out.",
              "author": "dr-dead-inside",
              "created": 1635608903,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "hio69g9": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hio69g9/",
      "text": "It could be a very simple reason too. The US has a very diverse name population. Last name nationalities don’t actually mean a lot. Now if the students bios all say they come from that country, I would be worried, but they may also be gravitating towards that group because the PI understands their culture and it’s less isolating. It is hard to go just by last names in the US. And in some universities, PIs don’t necessarily pick their students. There’s a student ranking system and a PI ranking system then the department head matches students with PIs. At least in the department I am working in right now. I would apply to universities where there’s more than one lab you like research wise. Reach out, talk to professors and grad students while getting a feel for how the lab works.",
      "author": "musryujidt",
      "created": 1635617873,
      "upvotes": 6,
      "replies": {
        "hio9e68": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hio9e68/",
          "text": "A drinking buddy of mine is Vietnamese, all 5 of his students are from Bandgledesh.  Makes going out to lunch with them sort of annoying and not a single goddamn one of them can use possessives correctly when writing.",
          "author": "Ashelth",
          "created": 1635619167,
          "upvotes": -6,
          "replies": {}
        },
        "hiqicm2": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqicm2/",
          "text": "That makes sense! That's good to know.",
          "author": "ThatNerdOverThere-",
          "created": 1635661079,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hioifus": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hioifus/",
      "text": "It might be a red flag, it might not be. I personally never looked into joining a lab where everyone was from the same cultural background or the same gender—it was too weird.",
      "author": "Eab11",
      "created": 1635623024,
      "upvotes": 4,
      "replies": {}
    },
    "hion7te": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hion7te/",
      "text": "my current lab was like this and it was not a red flag, they have been very welcoming towards me. maybe its less about whether the lab is all one race or all one gender and more about if you get the vibe the PI wants it that way. also, for instance i'm in the US and it isnt uncommon to see labs of all white people, which may make a person of color feel uncomfortable so it's ultimately also about your perspective.",
      "author": "No_Narwhal7483",
      "created": 1635625127,
      "upvotes": 2,
      "replies": {}
    },
    "hirlhcu": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hirlhcu/",
      "text": "I noticed something similar when I was applying to programs, but what I found was that it wasn’t so much that the PI preferred students from the same nationality as themselves as much as it was that students with the same nationality as the PI felt more comfortable there so chose that lab, which is understandable. Since applicants are skewed and those who accept the position are skewed, you end up with what looks like favoritism when it really isn’t the PI’s doing",
      "author": "PsychedSammy",
      "created": 1635689975,
      "upvotes": 2,
      "replies": {
        "hirp1q8": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hirp1q8/",
          "text": "Wow I'd never considered that before; that makes me feel better though, Ig it's more labs I can apply to without worry!",
          "author": "ThatNerdOverThere-",
          "created": 1635691673,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiom3ep": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiom3ep/",
      "text": "From my experience this is a huge red flag, I work with a advisor where everyone is from a single country. The advisor takes advantage of the situation.",
      "author": "optimization_ml",
      "created": 1635624617,
      "upvotes": 4,
      "replies": {}
    },
    "hip7lo0": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hip7lo0/",
      "text": ">I notice in some cases, the lab is comprised virtually 100% of members of the PI's same national?\n\nIt's *highly* dependent on the nationality in question, as well as the field. For example; all-Chinese math labs are unusual, but generally not a problem. All-Chinese *engineering* labs throw up all sorts of red flags and things can get a bit touchy at times.\n\n>Also, is there any legitimate reason why this could turn out so? And Is this okay in terms of university policy and diversity/inclusion?\n\nAgain, it depends on the nationality in question, as well as the field.",
      "author": "r3dl3g",
      "created": 1635634504,
      "upvotes": 3,
      "replies": {
        "hiq4e55": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiq4e55/",
          "text": ">  All-Chinese engineering labs throw up all sorts of red flags and things can get a bit touchy at times.\n\nSorry, I'm not familiar; why is this?",
          "author": "shardsofcrystal",
          "created": 1635651410,
          "upvotes": 4,
          "replies": {
            "hir9tbs": {
              "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hir9tbs/",
              "text": "IP theft and espionage. US engineering schools tend to have pretty close relationships with the US military in terms of project funding, information sharing, and recruitment pipelines.",
              "author": "r3dl3g",
              "created": 1635683398,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hiqhio8": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqhio8/",
          "text": "I didn't want to mention specifically but yes, 9 out of 10 this is the nationality in question, and the field is computer science adjacent or computer engineering. \n\nCan I ask why it's different for math vs engineering?",
          "author": "ThatNerdOverThere-",
          "created": 1635660393,
          "upvotes": 2,
          "replies": {
            "hir9nlk": {
              "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hir9nlk/",
              "text": "With math it's largely a result of there being so many Chinese students learning higher-level math in the United States. It basically just comes with the territory.\n\nEngineering doesn't skew quite the same way, though, and I *guarantee* you that Chinese faculty and students are being monitored in some way because of espionage and IP theft issues involving Chinese nationals.",
              "author": "r3dl3g",
              "created": 1635683292,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hiqefa1": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqefa1/",
      "text": "You will feel left out. Even if they dont do it on purpose, it is just easier to communicate on our first language. Also, many bad behaviors would often be magnified because they would be shared by most members of the lab. Do yourself a favor a join a lab that is diverse. Also, if you are from argentina then you qualify as a minority. You may be the only minority and your PI will use that label to his/her benefit. So, he/she likely does not really want you there but just wants to use you in the grants.",
      "author": "Outrageous_Ad1882",
      "created": 1635658004,
      "upvotes": 4,
      "replies": {
        "hiqikg4": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiqikg4/",
          "text": "I see; I had heard that minority status only applies to domestic students, I think an admissions counselor mentioned that even in the rare case that a class gets 20 students from Ethiopia or Peru but they're all international, it would still be seen as 0 students from underrepresented backgrounds. So I hadn't thought I might have the issue of being used as the token minority.\n\nIs it different for individual research groups?",
          "author": "ThatNerdOverThere-",
          "created": 1635661258,
          "upvotes": 2,
          "replies": {
            "hirmj90": {
              "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hirmj90/",
              "text": "Officially NIH and NSF you are not a minority. However, during grant writing you can still mention that the lab is diverse because there would be 1 hispanic student. However, that PI would not be able to get supplementary support for it. Nonetheless, it still enhances the grant and yearly report. I think nowadays NIH and NSF is figuring this system but would still rather have a international hispanic professor than none at all. \n\nRemember, you are an asset to the lab. Make sure you pick a lab that appreciates that.",
              "author": "Outrageous_Ad1882",
              "created": 1635690484,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hio2put": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hio2put/",
      "text": "As a male, if I see a lab that all its members are females (10 people or more) I don’t even bother applying. I’m just assuming that the PI want it this way.",
      "author": "Braincyclopedia",
      "created": 1635616375,
      "upvotes": -11,
      "replies": {
        "hio9kuu": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hio9kuu/",
          "text": "That is a very big assumption and you are likely missing out on a lot of opportunities. At time my lab has been almost all men, and at others almost all women. I am a female PI in STEM and do know that that appeals to some female trainees, but I do not purposely seek out females. I think women may be more concerned about biases in labs so when they see a lab with a balance or majority of women, that might be a selling factor, adding to women. But for you to assume they purposely want women only without talking to them/applying is definitely a big assumption.",
          "author": "AwkwardAccountant5",
          "created": 1635619244,
          "upvotes": 18,
          "replies": {}
        },
        "hip4mqp": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hip4mqp/",
          "text": "lol imagine if women thought like this",
          "author": "Mental-Fisherman-335",
          "created": 1635633078,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hiq2exd": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hiq2exd/",
      "text": "If you are basing this on names only, you do not know the nationality and to assume so borders on racist.",
      "author": "professorbix",
      "created": 1635650289,
      "upvotes": -2,
      "replies": {
        "hirpq9u": {
          "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hirpq9u/",
          "text": "Schools of origin too, these are almost all students whose CVs say they came from schools in a specific different country or set of countries.\n\nIs it racist to conclude that ppl with names like Zhou, Wang, Yao etc tend to come from a similar linguistic or ethnic background? Because it's a pretty reasonable assumption that's held in 99.9% of my experience in university in Argentina, except in the very few cases of Chinese-Americans who were studying abroad. How would it be \"racist\" to say that a lab full 100% of ppl with names like Plyshenko, Arbatova, Khondrachov, is a lab of ppl with mostly Russian origin for example? \n\nIt's kind of weird to not notice when literally ALL the names associated from the lab are from the same ethnicity/nationality (whatever the word is for this in English).\n\nI wouldn't think it racist in the least to make a reasonable assumption that if there is a lab with mostly Argentinian last names in the USA, for ex, that most students there are Argentinian or from a nearby cultural background, based on their names *and schools of origin.*",
          "author": "ThatNerdOverThere-",
          "created": 1635691977,
          "upvotes": 2,
          "replies": {
            "hisypys": {
              "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hisypys/",
              "text": "If you have information on school of origin, that is different. But for names, there are people with those last names who are born in European, Canadian, Australian, American, and more, so yes basing such assumptions on last name only is racist.",
              "author": "professorbix",
              "created": 1635711144,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hixfuo9": {
      "link": "/r/AskAcademia/comments/qj3jen/is_this_a_red_flag_for_potential_labsresearch/hixfuo9/",
      "text": "There is an southern European professor in Sweden who only hires people from his country.\n\nI think it is a red flag.",
      "author": "radionul",
      "created": 1635799426,
      "upvotes": 2,
      "replies": {}
    }
  }
}