{
  "sid": "pqwn8t",
  "link": "/r/AskAcademia/comments/pqwn8t/any_tips_for_new_academics/",
  "title:": "Any tips for new academics?",
  "text": "I’m starting a senior lecturer post in November, brand new to academia as moving over from industry (health). What should I expect, good or bad?",
  "author": "stovonmorks",
  "created": 1632006702,
  "updated": 1634078939,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hdg36jx": {
      "link": "/r/AskAcademia/comments/pqwn8t/any_tips_for_new_academics/hdg36jx/",
      "text": "It would be useful to provide a bit of information about your academic area and the level/type of institution that you're going to. It varies a lot in my experience.",
      "author": "rockyfaceprof",
      "created": 1632046348,
      "upvotes": 3,
      "replies": {
        "hdg93lc": {
          "link": "/r/AskAcademia/comments/pqwn8t/any_tips_for_new_academics/hdg93lc/",
          "text": "Hi! I’ll be a senior lecturer in mental health nursing in the UK. My teaching portfolio will cover undergrad / preregistration nursing as well postgraduate / post registration healthcare and nursing courses. I have a pretty small publication portfolio, but I have done a lot of service design, QI, and high profile work for NHS England so I think they valued my hands on practical experience of healthcare transformation in practice in lieu of a traditional academic profile.",
          "author": "stovonmorks",
          "created": 1632050896,
          "upvotes": 2,
          "replies": {
            "hdgayu7": {
              "link": "/r/AskAcademia/comments/pqwn8t/any_tips_for_new_academics/hdgayu7/",
              "text": "Thanks for that information. I don't have any experience with the UK so I'll let others comment on what you might expect.",
              "author": "rockyfaceprof",
              "created": 1632052150,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hdg0orv": {
      "link": "/r/AskAcademia/comments/pqwn8t/any_tips_for_new_academics/hdg0orv/",
      "text": "Your experiences as a former student will only prepare you so much. You were obviously a successful student, and you likely didn't get to hear all that much about the problems (valid and non-valid) of the less successful.",
      "author": "molobodd",
      "created": 1632044326,
      "upvotes": 3,
      "replies": {}
    }
  }
}