{
  "sid": "qgc6zw",
  "link": "/r/AskAcademia/comments/qgc6zw/industry_to_academia_understanding_what_matters/",
  "title:": "Industry to Academia - Understanding what matters most for an Academic CV",
  "text": "Hi all, I'm a computer/electrical engineer who has spent 6-7 years in industry while contributing to ecology research in my free time. I have recently been given an offer to a PhD program at the University of Auckland for interdisciplinary work between electrical engineering and biological sciences (60/40 split or so).\n\nIn the generic Doctoral application, I am being asked to submit an academic CV. I have seen many examples of CVs for folks who have completed thesis-based Bachelors/Masters. I have only done course-based work for both my Bachelors/Masters degree, so I'm unsure of what to put down/prioritize in my CV.\n\nAny advice would be great. Thank you!",
  "author": "fiestapinguino",
  "created": 1635271215,
  "updated": 1635302298,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hi5kk19": {
      "link": "/r/AskAcademia/comments/qgc6zw/industry_to_academia_understanding_what_matters/hi5kk19/",
      "text": "If I were you I'd take a skills-based CV approach to an academic CV (or maybe I mean the other way around...)\n\nSkills based CVs ([example](https://www.prospects.ac.uk/careers-advice/cvs-and-cover-letters/example-cvs/skills-based-cv-example)) are generally used if you don't have a lot of work specific experience, so you spell out how the skills you have developed would apply to the requirements of the role. \n\nWhereas for an academic CV ([example](https://www.prospects.ac.uk/careers-advice/cvs-and-cover-letters/example-cvs/academic-cv-example)) you'd be talking about your research skills/experience and also teaching experience (less relevant for a PhD applicant).\n\nSo in your case, you want to translate the skills you've developed in your job into skills relevant to research. Essentially write a skills based CV that uses an academic CV to inform which areas to focus on.",
      "author": "Honestaltly",
      "created": 1635277196,
      "upvotes": 5,
      "replies": {
        "hi5nxb3": {
          "link": "/r/AskAcademia/comments/qgc6zw/industry_to_academia_understanding_what_matters/hi5nxb3/",
          "text": "Wow, this was exactly what I was looking for! Thank you so much.",
          "author": "fiestapinguino",
          "created": 1635278483,
          "upvotes": 3,
          "replies": {
            "hi5o5nt": {
              "link": "/r/AskAcademia/comments/qgc6zw/industry_to_academia_understanding_what_matters/hi5o5nt/",
              "text": "You're welcome, good luck with your application!",
              "author": "Honestaltly",
              "created": 1635278571,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}