{
  "sid": "hw5p60",
  "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/",
  "title:": "My advisor was sexually inappropriate - how can I get around a letter of recommendation from him for PhD applications?",
  "text": "Background: I finished my undergraduate a few years ago. Research was my passion, but this burned me out and I've been too afraid to go back. I'm also not in the US.\n\nLong story short, my advisor was a creep to me, I don't want to elaborate in case he's on this subreddit. I know he uses Reddit a lot. I didn't really work with anyone else in the department, and I have no interest in reporting it - it's well known, my department doesn't care. I also don't want to bring this up in a new application, I don't want to seem like I'm slandering someone - and frankly, it's probably irrational, but I'd feel unprofessional talking about it.\n\nI'm finally in a place where I want to apply for my PhD, but I don't know how to explain the fact I won't have a letter of reference from the person I did my undergraduate thesis with. I honestly don't even know who else I can ask for a letter from - it's been so long since I left that I don't think any professors would remember me.\n\nDoes anyone have any idea how I can frame this without it coming off as unprofessional, or like *I* did something to sour the relationship?\n\n&#x200B;\n\nThanks Reddit.",
  "author": "metooacademia",
  "created": 1595464070,
  "updated": 1634080715,
  "over_18": false,
  "upvotes": 199,
  "upvote_ratio": 0.98,
  "comments": {
    "fyxlxdi": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxlxdi/",
      "text": "First of all, sorry about what you've had to go through OP. That's extremely serious and it's unacceptable that the department refuses to acknowledge it. There is no place for sexism in academia/science, period.\n\nNow on to the matter at hand, e-mail your old professors with a document containing your CV/accomplishments and let them know that you are interested in applying to graduate school, maybe add a photo to your email profile so they'll remember you. Worst-case scenario, they toss the email. Best case, you get a LOR. Tbh, the LOR probably will not be as strong since it's not from someone who advised you but it's better than nothing and if you have a good CV the professor can still put in a good word for you.\n\nIf anyone asks about your PI during your PhD interview process, I think it's fine to be honest and say that you have broken contact with them due to numerous instances of sexual harassment towards you. If they are understanding, they'll be quick to drop it. If they blacklist you for it, that person was shitty to begin with and you'll probably dodge a few bullets in the long-run.",
      "author": null,
      "created": 1595465874,
      "upvotes": 259,
      "replies": {
        "fyxtjyv": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxtjyv/",
          "text": "Agree with this so much! If you explain that you don't have a LOR from x professor because they were sexually inappropriate, and whatever department you're applying to blacklists you for that, then that's probably a good sign to stay tf away from that department.",
          "author": "ZachTheYek",
          "created": 1595470268,
          "upvotes": 49,
          "replies": {}
        },
        "fyz9pn2": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyz9pn2/",
          "text": "Thank you! That's a good point - if a university blacklists me for that, they probably have the same issues. I really appreciate the help, thank you.",
          "author": "metooacademia",
          "created": 1595512126,
          "upvotes": 11,
          "replies": {}
        },
        "fz0h0bb": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fz0h0bb/",
          "text": "Disagree. Don't mention the harassment because this profession is sexist and that will cloud people's perception of the applicant. Get recs from others, don't explain anything about the advisor. It's not that unusual to have some kind of personality conflict with a professor and not get a letter from them. I doubt there will be questions about it.",
          "author": "raspberry-squirrel",
          "created": 1595533049,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fyxm1lk": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxm1lk/",
      "text": "[deleted]",
      "author": null,
      "created": 1595465941,
      "upvotes": 98,
      "replies": {
        "fyxyndc": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxyndc/",
          "text": "I remember my terror at asking instructors for recommendations, so I’ll share some insight that I wish I had at the time: as a professor, I am happy to write letters for well-qualified students if they take this approach. I always thought I needed to know someone really well in order to ask for a good letter of reference. While that definitely helps, most students don’t have access to that kind of support - especially first gen students or ones without strong existing networks. Or, in your case (and mine), students who apply to grad school after they are out of undergrad. You need someone to vouch for you. If you use the approach described above, most faculty should be willing to help you out. This is a pretty common occurrence. \n\nSomeone may ask more about your former mentor. (I had 1 or 2 people push to know more about why I took off a few years.) If you complain too much, reviewers may perceive you as being high maintenance. So my advice is to be as discrete as possible. There are “coded” ways to indicate sexual harassment. “The environment in his lab wasn’t very supportive for female students” (assuming you are female). \n\nMost people who ask will do so because will they want to either see if there are major red flags or to make small talk (most likely scenario). As long as you weren’t acquiring felony convictions or getting kicked out of labs, you’re fine. If I reviewed your application, I probably wouldn’t even notice that you didn’t have a letter from him. \n\nGood luck!",
          "author": null,
          "created": 1595473292,
          "upvotes": 49,
          "replies": {
            "fyz9vmw": {
              "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyz9vmw/",
              "text": "Thank you so much - that's such a perfect response, and it feels really helpful to have a sort of pre-prepared way to address it. I appreciate it a lot.",
              "author": "metooacademia",
              "created": 1595512223,
              "upvotes": 8,
              "replies": {}
            },
            "fyzf2ld": {
              "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzf2ld/",
              "text": ">I always thought I needed to know someone really well in order to ask  for a good letter of reference. While that definitely helps, most  students don’t have access to that kind of support - especially first  gen students or ones without strong existing networks. Or, in your case  (and mine), students who apply to grad school after they are out of  undergrad. You need someone to vouch for you. If you use the approach  described above, most faculty should be willing to help you out.\n\nThis is great advice. Just ask. I consider it a part of my job to write these kinds of letters. For better or worse, if you were my student and you were in say the top 50% of my class, and you ask nicely, you won't get a bad letter from me. If I felt that I couldn't recommend you for the particular program or position, I would discuss the reasons why with you. Of course there are differences between a good letter and a great letter. The better I know you and the better fit you are for the position, the better letter I can write. \n\nBut to be honest, unless (a) your professors are famous researchers and they say you're the best student they've ever had (which would help your case) or (b) your letters are negative (which is very rare and would obviously hurt your case), the letters of recommendation aren't likely to influence your PhD admission one way or the other.  99% of the time, they just serve as a confirmation of what we already know from looking at your transcript, resume, and personal statements.",
              "author": "DeskAccepted",
              "created": 1595515091,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fyxmt98": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxmt98/",
      "text": "I work at a university as an academic advisor for undergraduates. I would say, ask your other old professors. Explain your academic history and need, future plans. Chances are, even if they don't remember you, they'll write you a good letter. Most faculty want to see students succeed and are adept at writing letters of recommendation. I'm sorry for your experience of inappropriate behavior. You could also ask that professor, but that's up to you. Sadly, chances are, reporting it may be more trouble to you than it's worth, even if it would be just.",
      "author": "MotherHolle",
      "created": 1595466382,
      "upvotes": 27,
      "replies": {
        "fyz9z9v": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyz9z9v/",
          "text": "Thank you!",
          "author": "metooacademia",
          "created": 1595512281,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fyxsfg4": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxsfg4/",
      "text": "I’m sorry that happened to you and you are brave to talk about it with your department. I envy that bravery. I had a similar situation in my undergrad but I never went to the department. He has since retired so now (so yeah it was 42 year age difference at the time) so it just feels pointless to talk to any one from the department about it. \n\nWhat I hate is that all these stories - including mine- is that these professors have a long career and get to retire cause they are tenured. There are 1000s of PhDs waiting for a job- why can’t you just fire the predators and give the jobs to those that are waiting?\n\nWhere our stories differ is that when he asked for a sexual relationship it was after I asked for a recommendation letter. I said no and never contacted him again. I didn’t get into the schools I applied to that round (whether that was because of him, I don’t know) and the next year I asked my other professors. No one was concerned that they were not my undergraduate advisor- no one asked about it. All I can suggest is that you ask the other professors who knew you (took 2 or more classes with them). If it makes you feel better, I’m in a PhD program now so it didn’t hold me back. And with your bravery, it will not hold you back either. \n\nI’m rooting for you and everyone else that has been put in these situations.",
      "author": null,
      "created": 1595469613,
      "upvotes": 16,
      "replies": {
        "fyza72l": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyza72l/",
          "text": "I'm sorry it happened to you too - it's a really painful experience to go through, especially seeing how much they all succeed afterwards.\n\nThank you so much, this reply nearly made me cry. I'm going to try those professors, and I just really appreciate your kind words so so much.",
          "author": "metooacademia",
          "created": 1595512406,
          "upvotes": 2,
          "replies": {}
        },
        "fyz3i8p": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyz3i8p/",
          "text": "> why can’t you just fire the predators and give the jobs to those that are waiting?\n\nBecause no university could afford the new assistant dean and dedicated staff that would be needed to handle all these cases. Let alone all of the legal settlements. It would be worse for the academic industry than COVID.\n\n“We can’t fix it, so we will pretend it doesn’t exist.”",
          "author": null,
          "created": 1595508200,
          "upvotes": 1,
          "replies": {
            "fyz8qmn": {
              "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyz8qmn/",
              "text": "There are new administrative positions popping up all the time at R1s. Universities in the US have HR department - it’s literally their job to handle cases like these. My uni has policies that if the Statement on Professional Ethics and Academic Responsibility is violated (sexual harassment is not listed but it would be in there) action has to be taken. Also, a lot of colleges/unis have a sexual harassment office that handles Title IX cases. There are policies and departments in place to deal with this, but most cases never get that far because no one files them. Also, if you fire the $100k a year prof and then hire the $40k a year assistant prof I’m sure the costs balance out.\n\nI don’t want anyone to think that their situation is “too expensive” for a university. It’s not. That mentality is toxic and helps keep the perps in their positions.",
              "author": null,
              "created": 1595511557,
              "upvotes": 3,
              "replies": {
                "fz00vdf": {
                  "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fz00vdf/",
                  "text": "It’s nice that you haven’t become cynical and jaded. Are you a woman? Because I don’t know any woman in higher education who thinks university policy is going to do shit to protect her. For goodness sake, Brock Turner was convicted of rape and didn’t get expelled from Stanford - he was asked to leave “voluntarily”. \n\nThe odds of a male professor getting fired for this are minuscule. I’ve only ever heard of it happening when men get found with child pornography on work computers. Child. Pornography. After a year or two of investigations and committee meetings, admin will eventually conclude there was no clear evidence of wrong-doing. (Unless someone wrote an email that said “Haha, I harassed another student again!”) Given the time, salaries for all those HR staff, lawyers, special deans, and settlements, there is zero chance of costs balancing out.\n\nSorry to sound so harsh - but policies are only good if they are respected and enforced vigorously. And they aren’t.",
                  "author": null,
                  "created": 1595525630,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fyxlhnv": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxlhnv/",
      "text": "\nThere will be other people on admissions who are more experienced to answer this query, but maybe you could email your professors, head of school etc. with your module marks and some samples of your assignments/ work and grades etc. so they can give you a more meaningful and detailed reference. \nI have a friend who applied for PhDs last year and used the head of school and deputy head of school at my university as academic references, and they didn't know her personally at all.",
      "author": null,
      "created": 1595465624,
      "upvotes": 6,
      "replies": {
        "fyza8m3": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyza8m3/",
          "text": "Thank you!",
          "author": "metooacademia",
          "created": 1595512431,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fyxna5e": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxna5e/",
      "text": "I had a very similar situation happen over the past few weeks. I did not go through any sexual harassment, but emotional abuse. It was in the middle of my PhD, but I also didn't want to name names. About a month ago another professor at my University contacted me and they had several complaints brought up against him, that is the only time I felt comfortable saying anything. No one wants that hanging over their head especially in academia as it is so stigmatized. I eventually had the professor who conducted the investigation write a letter in lieu of my advisor.\n\nObviously, you have a different situation. Up until the call with the other professor I was set on using my advisor as a reference even though I knew it had effected my chances of getting into another school, I didn't trust him to not go behind my back. So you have really 1 of 3 options, you talk to your department/dean/etc., you go ahead and use him as a reference as long as you still have a good relationship(in the sense that he won't say anything negative), and finally you just don't use him use another professor/PhD one that worked with you or published with you.",
      "author": "kingkingzxdyk",
      "created": 1595466655,
      "upvotes": 6,
      "replies": {
        "fyzak53": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzak53/",
          "text": "I'm so sorry you experienced similar. I don't think he would give me a good recommendation - he kind of held minor mistakes (hard to describe without giving away my field, but it essentially boiled down to something that took 5 minutes to fix and was a common error) over my head as a way to keep me in his office and I guess wield his power. I'll definitely seek out others in the department, thank you.",
          "author": "metooacademia",
          "created": 1595512614,
          "upvotes": 2,
          "replies": {
            "fz0ammk": {
              "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fz0ammk/",
              "text": "If there are any postdocs working with him that might be a good route, in my experience they are much more understanding and approachable.  And the head of the department you were at is always a good route, in my own experience they are willing to give letters of recommendation to many of their graduating students.",
              "author": "kingkingzxdyk",
              "created": 1595530078,
              "upvotes": 1,
              "replies": {
                "fz0anvx": {
                  "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fz0anvx/",
                  "text": "It can never hurt to ask",
                  "author": "kingkingzxdyk",
                  "created": 1595530094,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fyyf6dd": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyyf6dd/",
      "text": "Professor here. I'm so sorry for what you experienced. ***No one will care that you don't have a letter from your advisor.*** It's not something we check for or make note of. We only care that the letters are strong, which means they're written by people who know you and your work well. \n\n/u/po2gdHaeKaYk is exactly right. The real issue here is getting a minimum of three solid letters. Based on what you wrote, it sounds like other than your advisor, you don't know who else to ask. So, even if you asked him (don't), you'd still be two letters short. Definitely follow other posters' advice on how to approach faculty and provide them with enough materials to put something together. \n\nWhile I think you should remain optimistic--we really do want to help students--you should also be prepared to hear no. It won't be just because they don't remember you well enough. It's also because writing a letter puts our reputation on the line; we are vouching for you to our colleagues. If we vouch for students who end up plagiarizing, harassing other students, imploding, etc, our colleagues will no longer trust our judgment.\n\n**Candidate interviews are definitely field-specific**, so if your discipline doesn't have them, this may not even be something you ever have to address in person. I'd be surprised if anyone pointedly asked you, but if so, I like /u/sunia42's suggestion. \n\nThe last thing I'll say is that you should think about why you want a PhD. (I don't mean to imply that you haven't, just encouraging you to keep doing so.) If you're considering working in industry, a PhD is rarely needed and the time spent in school can make you less competitive. If you plan to pursue academia, please understand that the job markets (in the U.S.) across the humanities, social sciences, and STEM are terrible and have been for a long time. Tenure track positions are becoming more rare, and recent grads must compete with PhDs who are still on the market 4-5 years after defending. Finally, if you don't know about the exploitation of adjuncts, you should look into it.\n\nGood luck with everything!",
      "author": "synthesis-synthesis",
      "created": 1595485465,
      "upvotes": 5,
      "replies": {
        "fyzaq4p": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzaq4p/",
          "text": "Thank you so much! I really appreciate the honest advice and support.",
          "author": "metooacademia",
          "created": 1595512709,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fyxqb53": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxqb53/",
      "text": "I realize that you don't want to report.\n\nI would suggest you reach out to the dean of the department. \n\nI know it's hard. I know it's not great. But if anyone can get you a rec or actually help negotiate the situation with the schools you apply to it is likely them.\n\nOne of the older grad students in my program had a similar problem, and the \"best\" solution has been for a more senior and respected professor to just write for her. It wasn't ideal.. at all, but she's got a post doc.",
      "author": "justhatcrazygurl",
      "created": 1595468397,
      "upvotes": 5,
      "replies": {}
    },
    "fyxp5ds": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxp5ds/",
      "text": "It makes me so sad that this is not uncommon in academia. Good on you for wanting to go back to school in spite of this bullshit. I hope your next supervised research experience is more positive and professional. \n\nIn my opinion (and others may disagree), I don’t think it would be frowned upon to include a footnote in your application that notes why there’s no letter from previous supervisor. For example, if an application includes a personal statement, you could describe your past research project and literally include a footnote that succinctly (1-2 sentences) explains the situation — sexual harassment happened, not comfortable asking for recommendation. Admissions committees at any school worth attending would not hold this against you.",
      "author": "RadDadJr",
      "created": 1595467730,
      "upvotes": 2,
      "replies": {}
    },
    "fyxppu7": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxppu7/",
      "text": "Sexual abuse in academia needs a hashtag movement more than ever",
      "author": "shindleria",
      "created": 1595468057,
      "upvotes": 5,
      "replies": {}
    },
    "fyy3xs0": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyy3xs0/",
      "text": "First of all, I’m very sorry about what you had to go through, OP. It’s sad it’s still happening in 2020. If you ask other profs who taught a class in which you did well, a very minimal thing they can do is what you were taught in the class and how you did, and what your performance means compared to the general student population. They can also explain the textbook and what they covered in the class. There are so many programs in the world and they vary so much, such information is very helpful for the people who go through students from all over the world. And many schools don’t have academic advisor program anyway so it doesn’t really hurt your case if you don’t get a letter from the creep. \n\nI hope this helps. And I hope you won’t have to deal with such awful people in your future career.",
      "author": "log-normally",
      "created": 1595476695,
      "upvotes": 2,
      "replies": {}
    },
    "fyz7a4x": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyz7a4x/",
      "text": "If you're Dutch, please tell me which professor in a dm.",
      "author": "Ltrfsn",
      "created": 1595510670,
      "upvotes": 2,
      "replies": {}
    },
    "fyy7utb": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyy7utb/",
      "text": "I am so sorry to hear this. Do you have any material that can be evaluated? You could possibly ask some professor to read and write an evaluation of your work, even if it is old \n\nIf you are in the biomed area DM me.",
      "author": "unreplicate",
      "created": 1595479462,
      "upvotes": 1,
      "replies": {
        "fyzaxkv": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzaxkv/",
          "text": "Thank you - I'm tangentially related but not quite. I think I have a few old research projects I could ask some profs about - thank you!",
          "author": "metooacademia",
          "created": 1595512825,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fyyljsx": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyyljsx/",
      "text": "This is probably a long shot for OP, but if you have *anyone* on campus that you worked closely with that was also familiar with your work, it would be worth asking them for an LOR in my opinion. For example, I was *extremely* fortunate to have a supportive and engaged subject/research librarian at my undergraduate institution who I worked with over several years on multiple papers. While she was not a direct supervisor, I met her through one of my undergrad classes where she taught us how to do library research and cultivated a long-term relationship with her. I also reached out to Professors who could speak to my maturity and development as a person (my undergrad career took *forever* so by the time I hit my MA program I had been in college the better part of 13 years.\n\nYou also may want to consider LORs from anyone who could speak to your work ethic and professionalism if you can't find letter writers directly in your field/people you took classes from.",
      "author": "fantasmapocalypse",
      "created": 1595491676,
      "upvotes": 1,
      "replies": {
        "fyzb000": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzb000/",
          "text": "Thank you! That gave me some good ideas about other people to potentially ask :-)",
          "author": "metooacademia",
          "created": 1595512862,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fyzh1cz": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzh1cz/",
      "text": "Professor here.  If you have a strong application nobody will care.  \n\nHowever, being honest: If parts of your application are weak, it might seem odd to some faculty (I would include myself here) that there isn't a letter from the supervisor.  I do know that other faculty in my department have mentioned the lack of a supervisor letter in applications too, so I'm not the only one.\n\nI would encourage you to make the strongest application possible and get strong letters from your other references.",
      "author": "saltsage",
      "created": 1595516140,
      "upvotes": 1,
      "replies": {}
    },
    "fyyy0bn": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyyy0bn/",
      "text": "Id recommend to send an email to the place(s) you plan  to apply asking for guidance. You dont need to go in full detail, but will give you a sense of their mindset as an institution.",
      "author": "avigna",
      "created": 1595503906,
      "upvotes": 1,
      "replies": {}
    },
    "fyy3i4j": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyy3i4j/",
      "text": "I'd reconsider getting the letter, especially if the transgression was mild. \n\nI don't know the details of your situation but it looks like him being a bad person is hurting you a lot more than it needs to.",
      "author": "lednakashim",
      "created": 1595476403,
      "upvotes": -11,
      "replies": {
        "fyyc8up": {
          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyyc8up/",
          "text": "Professor here. There's some good advice in this thread. This suggestion, however, is a bad idea. /u/lednakashim I know you're trying to help, and I'm not trying to attack you. **But there is no way for OP to know what he would write about her.** Frankly, if he's the kind of advisor who would sexually harass a student, he'd have no problem sabotaging her. And she'd never know, because letters are confidential. He could also use this as an excuse to attempt to rekindle communication, to manipulate her, to reassure himself that he didn't really harm her since she's asking him for a letter, etc.\n\nFurthermore, the power asymmetry between professor and student--*and she was an undergrad!*\\--is so large that there's no such thing as a mild transgression. We know the power we (well, some of us) have. It's the power that's allowed him to maintain the status of a respected researcher despite the fact that his sexually predatory behavior is well-known in his department.",
          "author": "synthesis-synthesis",
          "created": 1595482941,
          "upvotes": 10,
          "replies": {
            "fyzbawx": {
              "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzbawx/",
              "text": "Thank you for this - I really appreciate the defence of me not contacting him. I mentioned upthread, but he would routinely look for minor errors in my work to keep me in his office after hours, or to use as a tool to make me do things I didn't want to do (I had 2 male friends in his lab who did not experience the obsession with minor errors that I did - they were corrected over email and not in person, etc. They even commented on it to me without knowing the extent.) so I think he would absolutely hold that over my head and it would be a really bad idea to ask him for one.",
              "author": "metooacademia",
              "created": 1595513033,
              "upvotes": 1,
              "replies": {
                "fyzw11q": {
                  "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzw11q/",
                  "text": "You're welcome. I will add that because your letters may be weaker since you don't have strong relationships with other faculty, your research statement/statement of purpose and writing sample must be exceptional. \n\nIf any of these professors agree to write for you, **don't hesitate to ask for brief comments on how to improve your statement and sample.** If they've decided to write for you, they'll be willing to make at least one or two observations about your materials. (You may have to gently nudge them as a reminder.)\n\nAlso note it's acceptable for one or two of your letters to come from people who were visiting assistant professors, non-tenure track faculty, a research librarian with a PhD, if you did a lot of archival work, etc. As long as they have PhD, work in academia, and know you, they're an acceptable reference.\n\nI'm sure you feel strongly about pursuing academia, but it's worth acknowledging that having weaker letters may ultimately prevent that possibility. Grad school is competitive in general, but unfortunately, it becomes more competitive during recessions. I don't mean to discourage at all! I pointed out the many, serious negatives of academia in my other post just to remind you there many ways to build a fulfilling, intellectually challenging life. \n\nEven if you're accepted into a program, I encourage you to remember that. I'm a young professor, and I've seen too many colleagues and students tie their self-worth to academia. It really hurts them. \n\nTL;DR: Screw that guy; go forth and prosper. Best of luck to you!",
                  "author": "synthesis-synthesis",
                  "created": 1595523464,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "fyyxrgy": {
              "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyyxrgy/",
              "text": "I think you bring up a good point but, ultimately, depending on the severity of the transgression it may be possible to reconcile. \n\nWe really don't know what happened except presumably that the severity isn't enough to warent criminal action.\n\nPerhaps the PI asked for a sexual favor, or misspoke while intoxicated, or routinely made inappropriate sexual jokes of a nonspecific nature to all subordinates, or maybe just starred at the person too much. \n\nPerhaps the PI will feel bad for whatever occurred. \n\nI see absolutely nothing to gain by not engaging.",
              "author": "lednakashim",
              "created": 1595503695,
              "upvotes": -3,
              "replies": {
                "fyzg3ti": {
                  "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzg3ti/",
                  "text": "> Perhaps the PI asked for a sexual favor \n\nI'm not sure, but from the way your comment is written it sounds as if such behaviour would be okay. I hope you did not mean that... Everything you described is an example of gross misconduct. All of what you listed (except for staring, which is still creepy) is disgusting and involves morally wrong behaviour that makes the PI in question not suitable for holding any sort of power over students. Being drunk/sexually attracted to your students is not an excuse... Yikes.",
                  "author": "prc00632",
                  "created": 1595515648,
                  "upvotes": 2,
                  "replies": {}
                },
                "fyzu0k4": {
                  "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyzu0k4/",
                  "text": "I'm starting to believe you're not posting in good faith here. You are pushing someone who was abused by an adult with institutional power--an adult whose job is to *help* undergraduates--to re-engage with their abuser.\n\nEither you're trolling or you have **1)** a skewed view of what constitutes sexually abusive behavior, **2)** a fundamental lack of understanding about power differentials in academia, and **3)** a corresponding lack of basic empathy for the terror and loss of agency that permeates abuse across the spectrum of behavior, whether it's a stranger following you for ten blocks at night, a boss who consistently makes lewd comments about your body, someone groping you on the subway, or a professor demanding sex in exchange for high grades.\n\n**On what basis do you presume the severity is not enough to warrant criminal action?** Beyond the OP's post, we know for a fact that sexually based crimes go unrecognized and unpunished all the time. Sexual violence is routinely dismissed at EVERY level of the criminal justice system--the campus officers or police who decide not to take statements; the extraordinary backlog of untested rape kits in every U.S. city and town; the victims who are silenced, shamed, doubted, coerced, etc; the list goes on. And we know this happens in every sector--academia and Hollywood, the military and Silicon Valley.\n\n**On what basis do you presume the professor would \"feel bad\"** when OP confirmed their behavior is a constant and known variable within the department--*meaning it's been going on for years, with multiple students?* Why would you think this person would suddenly and inexplicably \"feel bad\" when they've never admitted, apologized for, or *ceased their predatory behavior*?\n\n**What OP can gain is twofold**: the assurance they won't get a recommendation letter ***that secretly sabotages them*** *and* the assurance that they can maintain the peace of mind they've gained since cutting off communication with their abuser. \n\nMoreover, **OP doesn't need their abuser to accomplish their goals.** This man no longer has any power in OP's life. He is nothing, and OP will succeed--whether in academia or elsewhere--in spite of his abuse.",
                  "author": "synthesis-synthesis",
                  "created": 1595522535,
                  "upvotes": 1,
                  "replies": {
                    "fz09q2f": {
                      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fz09q2f/",
                      "text": "I'm not advocating for OP to get a letter of recommendation from their rapist but  I think we disagree on the severity of being \"a creep\". \n\nI've heard that word used for a broad category of things that could easily be misunderstandings.",
                      "author": "lednakashim",
                      "created": 1595529666,
                      "upvotes": 1,
                      "replies": {
                        "fz0lk5p": {
                          "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fz0lk5p/",
                          "text": "I do agree \"being creepy\" can cover a wide range of behavior, a percentage of which may be misunderstandings. However, if a professor or other figure in power **over many years** abuses **multiple people** in a **subordinate position** in any capacity, and it's a well-known fact within a department which routinely looks away from that behavior in order to avoid conflict and bad press, then \"misunderstanding\" does not figure into this equation.\n\nI'd encourage you to consider that actual misunderstandings are one-off scenarios. This term can't explain or apply to *repeated* predatory behavior. Other students commented to OP about his behavior, even though they could only see a fraction of it.\n\nConsider that \"mild\" transgressions can still inflict the same enduring psychological harm that \"major\" transgressions do. Someone who blocks you from leaving a room or makes \"jokes\" about rape or requires you to have late night meetings in their home in order to pass your thesis defense **communicates the same threat to life, instill the same fear, and affirm your inability to stop them** as someone who throws things or gropes you.\n\nWe don't need to elide differences in acts of sexual violence in order to note that it's never actually about the sexual threats or behavior. It's about power. If someone effectively strips power away from you, the psychosocial impact is the same. \n\nI'll stop with this post, since I don't want this to devolve into an argument. I absolutely agree with you that creepiness is a broad term (which can be frustrating and unhelpful). At the same time, I think you overstate the role misunderstanding plays in this specific context (it doesn't play one) and more broadly.",
                          "author": "synthesis-synthesis",
                          "created": 1595535153,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fyxmdd4": {
      "link": "/r/AskAcademia/comments/hw5p60/my_advisor_was_sexually_inappropriate_how_can_i/fyxmdd4/",
      "text": "IDK secretly record him being a creep?",
      "author": "derDragonmeister",
      "created": 1595466128,
      "upvotes": -21,
      "replies": {}
    }
  }
}