{"sid": "flonu6", "link": "/r/collegeadvice/comments/flonu6/help_choosing_between_two_schools/", "title:": "Help choosing between two schools?", "text": "For starters, I’m a first generation student, and I will be the first in my family to attend university. It is likely I will be paying for the entirety of this myself, as my family is abusive (a whole other story) and are not in the financial position to do so anyhow. Now to the hard part, I have two options, and no adult to turn to for advice.\n\nMy first option is an ivy tier school that has a sub 10% acceptance rate, they gave me a financial need based scholarship, that leaves about 10k to be paid. Additionally this scholarship requires FAFSA to be filled out each year, and any change in my parent income (which won’t be going to me) will result in a change in the amount I receive.\n\nMy other option is a state school. They’re pretty decent and gave me a merit based scholarship that covers everything minus healthcare which at max would be about 1k. The amount I receive also won’t change based on my family’s income, meaning I essentially won’t need to worry about FAFSA, as long as I maintain the averages necessary.\n\nSome other facts\n\n- I’ve been applying to dozens of scholarships, however option one halves the amount I receive from any, taking it out of my financial aid\n\n- I plan to attend graduate school which obviously is another round of expenses\n\n- I intend to obtain some sort of part time job to save money, and this also may affect the aid received for option 1\n\nSo with all that, I’d be really grateful for any advice you guys have to share, thank you!", "author": "collegetosshelpp", "created": 1584678243, "retrieved": 1632961122, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"fkzxi7z": {"link": "/r/collegeadvice/comments/flonu6/help_choosing_between_two_schools/fkzxi7z/", "text": "What is your major? For a few majors, the name recognition of an Ivy League can be important, but for most (including most careers requiring graduate study) it won’t help you much. \n\nI got into both an Ivy League school and got a full merit scholarship to a State school. I chose the state school and I’m so grateful I did. I don’t have the worry of paying for my education and I’m at the top of my class, rather than being middle or bottom of the pack at an Ivy League. I am a physics/math major and I’ll be going to grad school too... from everyone I’ve spoken to in STEM, the name brand of an Ivy League undergraduate degree doesn’t carry much weight in many fields. It’s about how well you do in undergrad and the connections you make... which is all about your actions and not the school you go to.", "author": "lovely-capybara", "created": 1584683547, "upvotes": 1}}}