{"sid": "g1kdcx", "link": "/r/collegeadvice/comments/g1kdcx/i_need_help_on_my_college_decision_is_fsu_worth/", "title:": "I need help on my college decision... Is FSU worth the $52k student debt?", "text": "After many hours of doing online researching about FSU’s programs, statistics, academics, and campus, I felt that this school best fit me. I applied with a major in biology, but this is subject to change after I experience the classes.\n\nI received my acceptance letter & financial aid, with an Out-of-State Tuition Waiver Scholarship, as well as federal and school-based grants. With this subtracted from my COA, I would be paying about $14-15k my freshman year, considering that I live on-campus and have the cheapest meal plan. If the cost was consistent for 4 years, my student debt would be around $52k.\n\nIs this a good idea to invest in FSU when the cost is this high? One thing to note is that FSU does have a program that allows me to graduate in 3 years if I have enough credits, so that was an option I was thinking about. I took 10 APs in high school and passed every exam. Also, I hope to live off-campus for much cheaper rates during my sophomore year, or maybe even this year. That could easily take off a few thousand off of my COA. In addition, I know that my FAFSA will change next year, hopefully where I get several thousands of dollars more aid because my family has had a significant loss in income. With all of this considered, I feel that next year I can make my cost of attendance cheaper by several thousand.\n\nWith that being said, I could still be at least in $40k in debt. Should I make this investment, considering the loans and student debt? I know I can work to pay some of it off in college, but will it be enough? I won't be receiving contribution from my family, just as a note. I also wasn’t eligible for work-study; how much should I expect to make at a part-time job as a full time college student?\n\nMy other options would be attending GSU or a community college. GSU is supposed to be cheaper, but I have not received any scholarships from them yet & their financial aid package comes out literally the day before admission decisions!! And should I consider community college for a few years and then transfer? I looked it up and it seems it would be even more expensive to transfer into FSU as they didn’t give out many scholarships to transfer students.\n\nPlease let me know what the best option would be.", "author": "Plus_Sprinkles", "created": 1586922298, "retrieved": 1632848312, "over_18": false, "upvotes": 2, "upvote_ratio": 0.67, "comments": {"fo2tmz7": {"link": "/r/collegeadvice/comments/g1kdcx/i_need_help_on_my_college_decision_is_fsu_worth/fo2tmz7/", "text": "Do you mind sharing what you plan to study? I think that should factor in to your decision.", "author": "ouidapowe", "created": 1587473789, "upvotes": 1}}}