{"sid": "cekmqw", "link": "/r/collegeadvice/comments/cekmqw/is_there_an_advantage_to_having_a_windows/", "title:": "Is there an advantage to having a Windows computer for college?", "text": "Hello all. I’m looking at getting my computer for college. My dad offered to sell me his old work computer, a 15” MacBook Pro 2016, for $1400. The other computer that I was looking at is the Dell XPS 15, also around $1400. I’m sure both would be great computers, but does one operating system with better for college than the other? I’m most likely going to be a physics or engineering major, if that changes anything. Thanks in advance!", "author": "Fro5tbyte", "created": 1563406317, "retrieved": 1632960546, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"eu7ko6c": {"link": "/r/collegeadvice/comments/cekmqw/is_there_an_advantage_to_having_a_windows/eu7ko6c/", "text": "There is not much of a difference. It really comes down to personal preference and what programs you will spend the majority of the time using. Personally, I have used a MacBook Pro for school. I use the mac because you can run Windows on them via Bootcamp or via a virtualization program like Parallels. Thus, you get multiple OS systems in one system. I also like the build quality a bit more. \n\nOn the other hand, I also own a Surface Book and that has been a great machine (software and build quality). The question you have to ask yourself is what programs will you be using if you go into a physics/engineering program? If the programs are designed for windows you may run into performance optimization issue with a Mac (rare, but possible). For example, using virtualization will take up more system resources on top of the program you are running. That will likely drain the battery faster, heat, etc. will  If you are going to be using windows software, it may be best to stick to windows so there are no crossover issues with drivers, latest updates, etc. \n\nFinal side note: Unless your dad's MacBook Pro is maxed out in specs, he should lower his price a bit. A 2016 system is approaching 3 years old and new ones (not 15\" but 13\") are around the same price. So longterm it might be better to get a new one with warranty and the the speed is likely faster if the 2016 model is the base spec model.", "author": "Chris_NYU", "created": 1563535028, "upvotes": 1}, "eu4xr50": {"link": "/r/collegeadvice/comments/cekmqw/is_there_an_advantage_to_having_a_windows/eu4xr50/", "text": "I say grab a cheap chromebook sub 200$ and use google suite this is a pure productivity route with the occasional streaming for entertainment I have windows/chrome os/ dabbled with apple products/ and linux\n\nchrome os -is for on the go productivity that just always works\n\nWindows- for gaming/editing\n\nLinux- coding\n\nApple-cause apple", "author": "macoghoul", "created": 1563465559, "upvotes": 1}, "eu3jmxo": {"link": "/r/collegeadvice/comments/cekmqw/is_there_an_advantage_to_having_a_windows/eu3jmxo/", "text": "I have no clue what's best for college but apple has very little hardware but it's almost impossible to break the software while windows allows you to use a greater amounts of content. If I were in your place I would choose the one with better hardware", "author": "krutand", "created": 1563416475, "upvotes": 1}}}