{"sid": "g59q8s", "link": "/r/collegeadvice/comments/g59q8s/help_me_choose_a_college/", "title:": "HELP ME CHOOSE A COLLEGE", "text": "so i’m from the bay area and i’m having a hard time choosing a college to attend, my options are CSU East Bay, Sac State, Arizona State, SJSU, and CSU Fullerton. My intended major is environmental studies, and I know that SJSU has a good program but I also want a good college experience and I wasn’t able to visit any, the location I know is also important for good opportunities but idk :( PLEASE IF ANYONE COULD GIVE ME ADVICE", "author": "jsm00ve01", "created": 1587448702, "retrieved": 1632960386, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"g85qoe8": {"link": "/r/collegeadvice/comments/g59q8s/help_me_choose_a_college/g85qoe8/", "text": "I'm assuming you're in your last year of high school, one of the best things you can do if you're not able to go to college campuses is to talk to Alumni or students at these schools. Each school has their own alumni list and you can even look at alumni who have specifically majored in environmental studies. \n\nAsk them how much going that school helped them in their career and how much did it help them specifically with their major. Ask if their campus was good for whatever you value whether that's extracurricular activities, a great career center, or great future job opportunities.", "author": "Declassified_College", "created": 1602196283, "upvotes": 1}, "g5adrvh": {"link": "/r/collegeadvice/comments/g59q8s/help_me_choose_a_college/g5adrvh/", "text": "[https://medium.com/@yanggatang/is-a-60-000-year-streaming-service-worth-it-is-college-worth-that-much-38eeca0d74b9?sk=98426181a11c9b08a3d94d26e2d36058](https://medium.com/@yanggatang/is-a-60-000-year-streaming-service-worth-it-is-college-worth-that-much-38eeca0d74b9?sk=98426181a11c9b08a3d94d26e2d36058). You can see how many years it would take to pay off tuition :)", "author": "yanggatang", "created": 1600118804, "upvotes": 1}, "g4m70ty": {"link": "/r/collegeadvice/comments/g59q8s/help_me_choose_a_college/g4m70ty/", "text": "Community college, a backpacking trip in the wilderness, or no college and just intern or apply for a job where you would do the same thing in 4 years. Experience is favored over degrees and by the time you get the degree you'll be socially akward and addicted to drugs so...just my two in a half cents.", "author": "Writeyourpaper", "created": 1599705868, "upvotes": 1}, "fphk5dy": {"link": "/r/collegeadvice/comments/g59q8s/help_me_choose_a_college/fphk5dy/", "text": "I don't know about CSUF's program.  However, I am not far from the university so I do know what the area is like and the campus.  It's not an exciting campus but it offers the same things you would find on a campus in a big city.  The city itself is in a suburban area.  You might have to travel to Irvine (further south) for internships.  There is public transportation (bus system) but that will cut into your time to commute by bus. From campus you can take the bus to downtown Fullerton. There are shops and restaurants but it's not a big downtown.  There is however a train station there so you can take the train into downtown LA, head home, or into other parts of SoCal (all the way into San Diego).\n\nI would suggest looking for companies that you could internship for and see where there offices are/if they have an office in the city you want to study in or nearby.  Also just google the campus and see what the area is like.  Don't forget you can also do your internship during the summer so you don't have to worry about trying to balance your schedule.\n\nGood luck.", "author": "philatellie", "created": 1588622700, "upvotes": 1}, "fo5hmwi": {"link": "/r/collegeadvice/comments/g59q8s/help_me_choose_a_college/fo5hmwi/", "text": "My immediate answer is one of the California schools. Is money a factor in this decision? In state tuition is 100% to your benefit. Who really cares in the end where you got your degree from.", "author": "antilollipops2020", "created": 1587525859, "upvotes": 1}}}