{"sid": "apd2ez", "link": "/r/collegeadvice/comments/apd2ez/really_hating_the_college_i_choose_should_i/", "title:": "Really hating the college I choose, should I transfer?", "text": "I’m a Information Systems student at Southern Illinois university Edwardsville and I’m wanting to transfer to Illinois state university. The catch is, I’m currently a “junior” at 82 or so credit hours. I’m wondering I should stick it through here or if I should transfer there\nThe draws are if I transfer I might lose my pellgrabt, it will cost me more money, I will have to pass calculus and applied calculus along with precalc... (I suck at math)\nI’m currently 24, depressed af, honestly losing my mind, and really just bleak about the next 2 years here. I know I hate the area, I hate the people(they’re so damn “uppidy” and not quite sure about the quality to my education here. \nOn the plus side, currently, if I continue here I will have only 25-30k in debt. It is super affordable, the books are included in the tuition, and it’s gorgeous scenic wise. ISU is kind of more suburban and bleak imo. I’m so lost, idk if I want to transfer....\nHas anyone transferred as a junior on here? Anyone transfer from one 4 year uni to another? Any advice?\nShould I suck it up and finish schooling here then move to Chicago?(I want to live there no matter what after school)\nI’m so lost and lonely. I have tried to go to therapy provided at my university, but they said they “don’t have the resources to help me....\nPlease help me out...someone ", "author": "Nazzo222", "created": 1549863357, "retrieved": 1632849304, "over_18": false, "upvotes": 0, "upvote_ratio": 0.5, "comments": {"ehqxkfu": {"link": "/r/collegeadvice/comments/apd2ez/really_hating_the_college_i_choose_should_i/ehqxkfu/", "text": "I would contact admissions and or financial aid at the school you want to get into and see what is possible and what deadlines are.  If deadlines are such you could try to switch, see how much of your aid might transfer and what cost difference might be.  Then make a decision.  If you do stay, try to make the most of it by trying to find some clubs or activities to make it better.  ", "author": "mollymarie123", "created": 1551674550, "upvotes": 1}, "egngz5n": {"link": "/r/collegeadvice/comments/apd2ez/really_hating_the_college_i_choose_should_i/egngz5n/", "text": "And why is it you transferred??(if u don’t mind me asking) <3 ", "author": "Nazzo222", "created": 1550392020, "upvotes": 1}, "egg4lvw": {"link": "/r/collegeadvice/comments/apd2ez/really_hating_the_college_i_choose_should_i/egg4lvw/", "text": "I’m a bit younger than you but I transferred from a state school to a private school.  I can’t say I’m incredibly happy at where I’m at now, but I know it would have been a lot worse if I stayed.  The best advice I could give is to make sure you know where you’re going and why you’re going there. ", "author": "infanu", "created": 1550137071, "upvotes": 1}}}