{
  "sid": "d4dbtd",
  "link": "/r/collegeadvice/comments/d4dbtd/i_feel_like_my_life_is_falling_apart_but_maybe_im/",
  "title:": "I FEEL LIKE MY LIFE IS FALLING APART BUT MAYBE IM BEING A LITTLE DRAMATIC",
  "text": "I don’t know if anyone can help me or give me some advice but these past two years have debatabley been the worst of my life. Let me give you a little backstory. I am a 4th year college student but due to my major I am considered a sophomore. Since the beginning of high school I have worked tirelessly to get into the best college possible. My older siblings graduated from an Ivy League school and I spent every waking moment studying/doing homework in order to get into the best school that I could.\n\nUnfortunately that didn't happen and I ended up at a local college (two hours away from home). It was fine and for the most part a decent experience. I met an amazing group of friends that I consider family and I developed into my own person. However after being at that school for two years and finally figuring out my major, nursing, my school ended up not having it and I had to transfer to my local community college.\n\nI have always been a diligent and hard working student. After getting into my nursing program at my community college on the basis that I pass Anatomy & Chemistry, I decided to take these two classes together and ended up failing the semester (a combination of loneliness, moving back home, sickness and no insurance at the time so I could not go to the doctor). I ended up being kicked out of my nursing program but I retook all my classes over the summer and the following semester and ended up passing both the classes (I just re-applied to the nursing program and I am hoping they will accept me).\n\nI graduated h.s. in 2016 and am supposed to be graduating from college in June 2020, but I’m not. I feel like such a failure because even though I am doing the right things, I won't graduate until approximately 2024. Currently I am going to classes. I feel lonely all the time and have no friends to talk to. It’s super depressing. I just look back at all the times I was studying in my dorm so that I would not fail a class and would graduate in 2020. However, all my studying, not going to parties, and just being a disciplined student feels useless. I did everything right and yet I feel as if I’m the one who has to suffer. I studied every day, and I have been to only 1 college party. I felt like I was doing everything right to get ahead academically so why is it me who has to graduate late? All the time I spent at my old school trying to be an adult when I should have been out partying, like every other college student feels like time wasted. Now I’m 21 applying to an associates degree nursing program just so I can graduate at 23 with an associates and get my bachelors by 24. \n\nI go to class but feel as if I’m the oldest one in the room and can’t relate to the “younger kids”. Maybe I feel like I have more to prove/loose because I feel like I wasted my parents money? I tried to be social by switching my online class to an in person class but I feel as if people look at me all the time because I am older. I feel like I’m scared to talk in class and I have never had that problem until this semester. I’m scared to even open my mouth yet I have such nice professors. I don't want to study sometimes and I feel there’s no point in trying ( I force myself to though). It just feels like my passion is gone and my spirit has been crushed. I started going to therapy/gym to help with my isolation like behavior and to get help with my anxiety and depression. I also volunteer for my church and was recently accepted into a volunteer position at a local hospital. I’m trying to put myself out there more but sometimes I look at my life and I ask “where did I go wrong”. I don’t want to be a woman who perpetually looks back to what she has lost. I want to look forward to what I might become. However, I have been having these thoughts for 2 years and when I look in the mirror I can’t even recognize who I used to be. If anyone could give some advice I would appreciate it.     ",
  "author": "_Scarlet_Witch",
  "created": 1568506557,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "f0qa2yn": {
      "link": "/r/collegeadvice/comments/d4dbtd/i_feel_like_my_life_is_falling_apart_but_maybe_im/f0qa2yn/",
      "text": "I feel you 10000%. I majored in psychology and its been 4 years for me. Ive been between staying in that field and trying out new majors. The 4 years flied by. Now i am senior in psych but i am also enrolled in freshmen classes for other majors i’ve been trying out and i feel like im never going to finish because i dont decide. The longer it takes to finish school the less energy i have. Everyone in my classes are younger and fuller of hopes and energy than me. My advisor said today that at this point i have to graduate in psych and come back to school on my own if i want a second bachelors..and pay it without financial aid..im lonely, sad, feel stupid even with a bachelors..and havent really found a career that truly inspires me. But you know what..not everyone has their life together. We are human. And we have so much to chose from, so much to experience, that we cannot figure out our whole life in 4 years, especially at such a young age. My advice is to push yourself through all the hard classes, find company in yourself bc after all only you will get yourself through this journey. And believe in yourself. Every thing happens for a reason. Our careers do not define us. We define our careers.",
      "author": null,
      "created": 1568856422,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634058425
}