{"sid": "eci2bk", "link": "/r/collegeadvice/comments/eci2bk/got_a_78_because_teachers_registration_didnt_work/", "title:": "Got a 78 because teacher's registration didn't work day that it was due. How can I dispute?", "text": "Hi guys,\n\nI'm a high school senior, but i'm taking dual enrollment classes in my local community college. I took college algebra, a fairly simple class for the GPA boost, but ended up getting a C due to weird circumstances.\n\nBasically we got a math lab online homework to do at the beginning of the semester. However, I needed a book to get the code to login. Well, me, the procrastinator, got it on Thursday of last week. That same class our professor said that he will be extending the math assignment online to Monday at midnight (Originally was due on Sunday Midnight). \n\nSo I waited until monday morning to start working on the assignment right? (i know not amazing). Well, what do you know the teacher code, or his class registration code doesn't work. So I couldn't log into his class. This might've been because he never extended the ability to register into his class, but we were not informed during class that that would be the case. \n\nI was attempting to do the homework before the due date which was at midnight, but the class was locked so there was no way to do it. I then emailed the professor early in the afternoon about it, but he didn't get back to me until the next day (the day after it was due) to tell me that it was closed. Talked to him after the final on tuesday and he said he couldn't do anything about it.\n\nI know that this was partly on me because I didn't get started on it sooner, but it doesn't mean that this wasn't unfair. A due date was said to be on monday by midnight, yet I couldn't work on it at all on monday due to this registration error. \n\nShould I try to contact the math department chairperson and set up a meeting or should I just take the C which would hurt my GPA?\n\n&#x200B;\n\nTLDR: Homework was due on Monday at midnight. Couldn't work on homework on Monday due to teacher's online registration code not working. Emailed early afternoon, no response till next day saying basically \"too bad\". Got a C as a result", "author": "Vlz5435", "created": 1576700677, "retrieved": 1632960370, "over_18": false, "upvotes": 4, "upvote_ratio": 0.75, "comments": {"fbbq3da": {"link": "/r/collegeadvice/comments/eci2bk/got_a_78_because_teachers_registration_didnt_work/fbbq3da/", "text": "Not to be mean but you had a whole semester to do the homework. I would have procrastinated too, I get that. But this seems well deserved. You should have at least got the code and check to see if it was working at the beginning of the semester. It's college so you should probably be more responsible. I personally would take the C if I were in that situation. I'm not sure if the math department chairperson would be that kind to help you out.", "author": "tamashii245", "created": 1576705651, "upvotes": 6}}}