{"sid": "ajkxcl", "link": "/r/collegeadvice/comments/ajkxcl/should_i_live_at_home_during_college_ive_lived/", "title:": "Should I live at home during college? I've lived away from home for almost two years and I feel like it would be weird. help!!", "text": " My family is moving to a college town in another state because my dad got a job at said college. If I go to that school, I can get in-state tuition AND save $10,000 a year ($40,000 by the end of my undergrad) by living at home. However, I'm scared I will have a worse college experience overall, and will be thinking about how I am missing out.  \n\n\nBy the time I graduate high school, I would have lived in dorms for 2 years and I know it would be very strange to go back to living at home. I didn't have many friends freshman or sophomore year so I didn't need to set boundaries with my parents about going out or having friends over. Now, I know how deep friendships can become by living with peers, and how I won't be making friendships like that in the so-called \"best years of my life\" in college. Some of my best friends have been formed BECAUSE I lived down the hall from them. Also at boarding school, I've learned a lot about independence. I know how to balance sleep, friends, and grades; how to utilize office hours; how to keep my room clean without someone telling me to; etc.  \n\n\nOutside of what I've learned at boarding school, I've (obsessively) read tons of academic articles about the psychological differences and effects between commuters and residential students in college. From what I've read, commuters lack in \"enriching educational experiences\" and \"student interactions with faculty members\". It looks like commuting students are less engaged in student life. Will I really have the same probability of making close friends by going to student events or getting an on-campus job as I would if lived in the dorms? Could my grades be better if choose to live in the dorms?  \n\n\nI've tried to research what it's like to commute to this specific school and what the school does for commuters, but I couldn't find much. Is that a bad sign??  \n\n\nEvery time I DO go home, I'm reminded me of all the things I didn't like about living with my family (talking about school an unhealthy amount, chores, feeling socially unproductive (that probably doesn't make sense)).  \n\n\nThat being said, I have a pretty good relationship with my parents (if I didn't, I wouldn't be considering this college), and this school is actually at the top of my list right now (not just because there's a chance I could save a lot of money, but also because of the academics and social life).  \n\n\nHas anyone else experienced any situation similar to this?  \n\n\nTL;DR: Is it worth $40,000 to forgo friendships that can only be made by living in the dorms? Can money buy me a social life? (There's obviously bias in these questions please try to help me with an unbiased answer) ", "author": "chocolatelab19", "created": 1548387367, "retrieved": 1632849341, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"efufhut": {"link": "/r/collegeadvice/comments/ajkxcl/should_i_live_at_home_during_college_ive_lived/efufhut/", "text": "Honestly, saving money is such a huge deal- I can’t emphasize that enough.\nYes, it’s fun to have the typical college experience, but at what cost? \n\nI’m 30, and so many of my friends are knee-deep in student loan debts because they elected to have that experience. \n\nI decided to stay at home, and attend a university here, and graduated debt free. I still had fun, and even joined a sorority, but I lived at home. \n\nBest decision ever ", "author": "mayg09", "created": 1549422733, "upvotes": 2}, "efcwf9q": {"link": "/r/collegeadvice/comments/ajkxcl/should_i_live_at_home_during_college_ive_lived/efcwf9q/", "text": "I think it depends on if the college experience is important to you. I would have been devastated to miss out on something as big as dorm life as a first year student. I don’t know the dynamics of your school, but at mine it was required to live in dorms as a first year and it played a huge role in your future social life just by creating friend groups and finding people with mutual interests. But even after first year, your neighborhood you lived in still determined a lot regarding who you spent time with and what you were doing. If you’re still on the fence, live in dorms your first year at college like someone else recommended. If it doesn’t seem to make a difference to you, then you can go back home. ", "author": "Dirgah", "created": 1548857246, "upvotes": 2}, "ef0pe9e": {"link": "/r/collegeadvice/comments/ajkxcl/should_i_live_at_home_during_college_ive_lived/ef0pe9e/", "text": "I would live at home! It saves you so much money. I stayed with my parents for my freshmen year, then moved out to my own apartment after that year. Colleges require you to either live with parents or go to the dorms but they are small, and extremely expensive. Stay with your parents for a year, then move into an off site apartment. Saves you so much money!", "author": "brookeisgreat", "created": 1548516591, "upvotes": 1}, "eeypyja": {"link": "/r/collegeadvice/comments/ajkxcl/should_i_live_at_home_during_college_ive_lived/eeypyja/", "text": "If you’re about to be a freshman in college I would say live in the dorms! Everyone at my university lives in dorms freshman year and it’s a great way to make friends! Plus it’s a part of the college experience that you’ll never get to have again so you’ll be missing out if you don’t live in the dorms. \n\nAt my college most students live off campus in apartments sophomore to senior year anyway so you won’t be missing out as much if you want to live at home later on. You have another year to make that decision though!\n\nHope this helps :)", "author": null, "created": 1548452448, "upvotes": 2}, "eewn617": {"link": "/r/collegeadvice/comments/ajkxcl/should_i_live_at_home_during_college_ive_lived/eewn617/", "text": "I would, you've got a few years of a ward then decades to be thankful for it.", "author": "Hasemage", "created": 1548396702, "upvotes": 2}}}