{"sid": "ew78zb", "link": "/r/collegeadvice/comments/ew78zb/18_yrs_old_unaware_of_what_to_do_for_college_in/", "title:": "18 yrs old, unaware of what to do for college, in need of guidance", "text": "This would be my first post on this app and i’m still relatively new to this place but i could really go for some advice rn.\n\nHi, my name is Eduardo and i’m senior in high school rn in az. Throughout my high school career i’ve gotten A’s & B’s, my gpa sits at a 3.67, and ive went out of my way to take the ACT and SAT. My issue isn’t that i’m worried about getting accepted, i’ve been accepted by nau, gcu, asu, and those are just the colleges i applied for. My issue is that i have no idea where to go, and i don’t know what i’d be going for. I thought i had an idea; I’d go to gcu and study to be a physical therapist. Then i decided i want to go to nau, then to asu, now i don’t know which college. Not only that, but now i’m unsure if physical therapy is what i want to do. The reason i decided on PT is because i know deep down i wanted to pick an occupation that helps others, i wasn’t looking at if it would be a good fit for me or if it’s something i want to do with the rest of my life. i know it’s not, i don’t feel so emotionally invested, but that’s what i’ve been working up to. Furthermore, i’m also worried about pricing. I’ve done the math, asu would be the least expensive path for school, but i’ve always been told to not decide on college based on price. But how else am I decide where to go if each school has a different value? Would a more expensive college mean a better education? If i go to nau i’d have to quit my job which pays me very well, would it be worth it? Wouldn’t it be better to have a job to pay for college? I mean i would be getting help from my parents, but i wouldn’t want them paying for everything. How much debt would i get into in the future? Which college would give me the least amount of debt? i’m trying to wrap my head around it all but i just can’t decide, and it feels like i’m running out of time. I graduate in almost 4 months and i’ve yet to commit to anything. It stresses me out and it’s scary. if there’s anyone who could give some advice, it’d be greatly appreciated.\n\ntl;dr: I can’t decide on a major or college and i need some advice on what step to take", "author": "Lordpapi48", "created": 1580398896, "retrieved": 1632848351, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"fg1heg3": {"link": "/r/collegeadvice/comments/ew78zb/18_yrs_old_unaware_of_what_to_do_for_college_in/fg1heg3/", "text": "If your high school has a guidance counselor, make appointment to talk things over. \n\nWhen comparing cost, look at cost AFTER any aid you might be eligible for.  That is what most people mean when they are talking about don’t just decide on cost.  For example, a student whose family does not make much, may be eligible for a grant that would make really high priced schools very affordable or even free.  So don’t choose a school based on sticker price, but rather on your actual cost after any aid is applied. \nBy aid I mean grants, not loans. Each school should have a calculator that gives you a rough idea.  \n\nBeing a PT is a very good job.  It pays well, it is gratifying, you can get work in many different places, and you can have flexible hours. But it is too soon for you to decide for certain.  I suggest going to a school knowing that is one possible option.  Look into what is required for that option and plan classes with it in mind, but leave open other options.  \n\nYou don’t have to finalize it. \n\nAnother option is to go to a junior college first two years.  That reduces costs if you do not qualify for much aid.", "author": "mollymarie123", "created": 1580427150, "upvotes": 2}, "fg11seo": {"link": "/r/collegeadvice/comments/ew78zb/18_yrs_old_unaware_of_what_to_do_for_college_in/fg11seo/", "text": "Hi, I'm 22 and just graduated this past May. I will try and give you my take on your questions. \n\nFirst off, I think that it is important to account for the costs associated with college, because, assuming you will be taking out loans, you will be paying for whichever college you choose down the line. When people say you shouldn't choose a college based on price, it goes both ways. Just because a college is more expensive does not mean that it is necessarily better. \n\nI think that what college you choose ultimately relies on several different factors. Have you done tours of any of the colleges you mentioned? That first impression can help narrow down things really quickly. Another thing I think would help you out is really doing some soul searching as to how committed you are to the physical therapy route, as that is a major reason you are looking at GCU, despite it having much higher tuition than the other 2. It is perfectly fine to be undecided going into college. Hell, I have a degree and I still would call myself undecided on what exactly I want to do in life, but I share your desire to help others in whatever I end up doing.\n\nBack on the topic of finances, I think student debt is absolutely a factor you should also consider. At the end of the day, It will be your name on the bill once you graduate. I think that staying where you could work is potentially a good idea, but you must be wary about that time commitment, especially freshman year. It is a time where many struggle to find their footing academically and there are many social distractions as well. Throwing work in the mix would mean committing to some extreme time management, which is something that can be very difficult starting out. Even as you matriculate and classes get more intensive, the time commitment of work may get in the way of your studies. However, plenty of people manage to strike the balance and work in college. I'm not saying it's impossible but I would always say that school comes first and if work cuts into that down the line, then try and lessen your hours, whatever you have to do. \n\nKeep in mind that none of the schools you're currently accepted to is a bad choice, and nothing is wrong with state school. ASU looks pretty nice when I visited. That combined with proximity to your job may set that over as the winner, thinking purely financially. I think overall, you have some soul searching to do, so here are some action items:\n\n* Do some research and find out how committed you are to physical therapy. If you don't see yourself doing that for sure, I see no reason to pay more to go to GCU. There is nothing wrong with going in undecided. Just take a breath, you don't have to have it all figured out at this point. You'll be taking general coursework for at least your freshman year as well. \n\n* See if you can go to some college tours. Actually seeing and hearing what a college is about can help you visualize what going there would be like and help you consider if it's the place for you\n\n* Maybe ask how few hours you could theoretically be able to work at your job if you need to cut back hours at some point to focus on school. Time management is the downfall of many college students.\n\nHope this helps. Good luck!", "author": "Isaiah97", "created": 1580419193, "upvotes": 2}, "fg06zc3": {"link": "/r/collegeadvice/comments/ew78zb/18_yrs_old_unaware_of_what_to_do_for_college_in/fg06zc3/", "text": "Same place as you dude.  I’m a sophomore now at college.  I didn’t know what I want to do with my life so for the beginning of freshmen year I was undecided.  Freshman year is to explore clubs or any activities.  In that first year just explore man.  I thought I was going to do criminal justice but dead wrong, I picked the computer science major.  Rank does matter when applying for colleges but it’s the experience and talent that people are looking for.", "author": null, "created": 1580401573, "upvotes": 3}}}