{"sid": "e2tuav", "link": "/r/collegeadvice/comments/e2tuav/got_scammed_by_a_for_profit_online_school_need/", "title:": "Got scammed by a for profit online school need advice", "text": "Some back ground on the issue I am a 23 year old man i did graduate with my high-school diploma and did well on the SAT my parents dropped a bomb on me my senior year even though they were both making a large sum of money they would not be helping me pay for school. Neither of them had their school paid for and I would get no monetary help. I could live here at home rent free as long as I attended classes at a college but i needed to pay out of pocket. The fafsa was no help when i was under 23 since it took my parents earnings into account and so i was offered nothing since they could afford to help me. My mom got into a screaming match with a financial aid officer at one point when he told her it was an expectation for parents to help their kids. I found one of those online tech school programs offering expedited courses. I thought it was a dream come true i was wrong after a year of courses with A's i didn't know anything about the field i was paying money to go into. (network security) but i could sure as hell write some essays about leadership and confidence. I realized i had been scammed on top of that i had a payment plan to the tune of 10k at this point with them I dropped out and got shitty job after shitty job all while putting my dreams on hold. Im 23 now and i can apply for aid without my parents income blocking me. The problem is I still owe scam chool alot of money and they are threatening to send it to collections if I do not pay them. I am scared having this open account with the scam school will affect my ability to do well at my new community college. or my prospects of finicial aid. Is there any advice going forward.", "author": "OsitoMuerte", "created": 1574921735, "retrieved": 1632961159, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"fbdert6": {"link": "/r/collegeadvice/comments/e2tuav/got_scammed_by_a_for_profit_online_school_need/fbdert6/", "text": "I feel you buddy,\n\n The simplest way to earn money today is with **One biz opp . c om** (remove gaps),\n\nYou will thank me later :)  give it a try if you're in need of a job.", "author": "Secret-Criticism", "created": 1576759814, "upvotes": 1}}}