{"sid": "blwv5k", "link": "/r/collegeadvice/comments/blwv5k/im_not_doing_well_in_college/", "title:": "I’m not doing well in college", "text": "So I am going to be a 5th year senior next year and I am not doing well in school. I have a 2.3 gpa and after this semester I will probably have a 2.2. Every semester since sophomore year I have been getting mostly Ds and a few Cs. My attendance in class isn’t good and I just never want to go to class. I can’t figure out if it’s just me being lazy or if it’s something with my own mind that I am failing to recognize. It doesn’t make sense to me because every time I do bad I beat myself up about it and get really upset so I do care deep down but I never do anything to fix it. I wish I could change my major but I am too far in it to switch. I am just looking for advice. I’m scared I won’t be able to graduate because my major classes gpa has to be a 2.0 or higher and it’s not there. Please help give me some advice on how to get my shit together", "author": "mkj614", "created": 1557266416, "retrieved": 1632960444, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"es10cdp": {"link": "/r/collegeadvice/comments/blwv5k/im_not_doing_well_in_college/es10cdp/", "text": " \n\nYou need to identify why your GPA is what it is. For most people, tbh, it's either laziness/lack of discipline/taking college for granted, or depression.\n\nAre you attending class? Taking good notes? Doing the reading? How much time are you spending studying? How do you study? When you lose points, are they mostly on HW or tests? Are you making use of office hours, free tutoring, paid tutoring, study sessions with people who get the material better than you? Are you too depressed or anxious to do well? Are you too preoccupied with girls or family issues?\n\nIdentify the problems, write them down. For each problem, make a list of ways to address them. Make a daily checklist that ensures you’ve done everything you can. If you do all of this and really stick to it, most people can easily make Bs or As in all their classes at most schools.\n\n&#x200B;\n\nWhat is your major and what do you want to switch to?", "author": "ispariz", "created": 1561486604, "upvotes": 1}, "emse39m": {"link": "/r/collegeadvice/comments/blwv5k/im_not_doing_well_in_college/emse39m/", "text": "I am going through the same exact thing that you are. I don't like my major and none other interests me so I'm not motivated enough to put forth the effort in my classes. I figured the best thing for me to do is to take a semester off of college and try to figure myself out.", "author": "kalechipsmoothie", "created": 1557275683, "upvotes": 1}}}