{"sid": "5wmj0y", "link": "/r/collegeadvice/comments/5wmj0y/transferring_out_of_nyu/", "title:": "Transferring out of NYU", "text": "Hi all,\n\nThis is going to be a long wall of text. I apologize, and bear with me.\n\nI'm in my spring semester of freshman year in LSP at NYU and I've decided that I definitely want to go forward with transferring to another school. I originally applied ED I because I fell in love with \"having the city as your campus\" and the opportunities it could bring.. and it turns out that the school itself just wasn't a fit for me.\n\nSome of it may just be me, but I feel that the social scene, for me at least, is very shallow and expensive, and it has been hard to make friends (I basically hang around the same group every weekend). Many of my friends that I have made seem to have sprung out of superficial relationships. I also have a problem with the fact that there is next to no school spirit at this university (which is understandable since there is no sports, good campus events to really bond around). When there are so many people here are wearing shirts of OTHER schools around campus, you know you have a problem with school spirit.\n\nAdditionally, the specific program I am in is not a good fit for me; as someone who basically knows what I want to do for a career, a program that shallowly covers the liberal arts is something I don't want to keep studying. It is very rigid with requirements which hinder me from studying things related to my intended major sooner. I also realized that my personality is not very compatible with people in the clubs that I want to be involved in; our vision of the club going forward conflicts. \n\nUnfortunately, New York to me now seems like a cold and impersonal city. I feel like I am some random person that just lives in New York City and happens to attend classes here; it does not fit a college experience that I want, and I realize that it isn't the best school that's oriented for my career goals since I am strongly considering working in politics in the Washington DC area as my career choice.\n\n**tl;dr I dislike NYU's atmosphere and what I'm studying; it makes no sense for me to be there. NYU feels like it's run too much like a business, and I absolutely cannot justify spending $65,000-75,000 on a place that doesn't fit me when I can spend $40k at UNC or $50k at UMich.**\n\nCollege Stats:\n\nGPA: 3.575 through 16 credits and whatever I receive this semester (I'll probably have to stay another year barring me getting any applications done before March 1, so my main goal will be to raise my GPA.)\nEC's: NYU Public Policy Symposium, Policy Case Competition, College Republicans, Aviation Club (will probably join more clubs too)\n\n\nHigh School Stats:\nGPA: 3.65 (7 APs, Scholar with Honor)\nACT: 32\nEC's: Debate Team (Congressional Debate), Young Republicans, volunteered in a biochemistry and molecular biology lab at my local hospital, worked on multiple political campaigns including a winning US Congress campaign and a presidential primary campaign\n\nTherefore, I'm trying to look at colleges that have at least 2 of these 3 criteria and that I have a shot at: good school spirit, strong economics/government programs, or proximity to DC. This is my preliminary list:\n\nGeorgetown University,\nGeorge Washington University,\nAmerican University,\nUniversity of Maryland- College Park,\nUniversity of North Carolina- Chapel Hill,\nUniversity of Michigan,\nUniversity of Virginia\n\nThis is just a temporary list, so please feel free to give me advice on what I can improve on / my chances/ add any schools that may be a good fit for me. I'm pretty set on exploring my options (basically having one foot out the door already).\n\nCheers!\n", "author": "justiceneilgorsuch", "created": 1488264358, "retrieved": 1632849516, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {}}