{
  "sid": "fzoz80",
  "link": "/r/collegeadvice/comments/fzoz80/this_online_classes_thing_is_probably_going_to/",
  "title:": "This Online Classes Thing is Probably Going to Boost People's GPA's",
  "text": "It's good that some online classes allow me to boost my own GPA easier than if it would have benn in person.  Now all of my classes are online, and I know that alot of people would cheat and that alot of tests are open book. This semester is probably going to bump my GPA up from a 3.22 to possibly a 3.5 or 3.6 if I get all A's or all A's but one B and having classe online just made it easier. I'm already on the way of getting A's even before being sent online, so I'm probably going to be getting A's right now since classes are online.\n\nThis would help me reach my goals of graduating with high honors at my community college and possibly transferring to UIUC for accounting or biochem. Also, highly likely (but not certain) I would be able to get a bunch of things to wear around my neck during graduation (stole for PTK, 2 cords for Mu Alpha Theta, 2 cords for high honors, 2 cords for scholarship recipient, and 2 cords for being a student leader).\n\nHowever, I am only satisfied with graduating with high honors if it's a achievement that a majority to 50% of people in my demographic (having ample time to study, do homework, and take classes; is a freshman in their first or second semester of college; and have no disabilities) don't get during graduation. Based on watching graduations in the best, it seems like so far this is the case which satisfies me. But now that classes are online for a semester it seems like everybody is going to be getting A's which would in turn suggest that a majority of people would graduate with high honors during graduation. This makes me less satisfied and happy about graduating with high honors since I now discover that almost everybody in my demographic is going to graduate with high honors due to classes being online (which makes it easier to cheat or makes the tests open book). Also, this makes me less competitive for schools even if I do graduate with a 3.5 or above. Also, I usually don't cheat and I can't really guarantee that my grades are going to turn out the way I want.\n\nAny advice on this? Sorry I can't post on the college forum because I got banned for advocating cheating.",
  "author": "chenthehen",
  "created": 1586661182,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "fn5fckh": {
      "link": "/r/collegeadvice/comments/fzoz80/this_online_classes_thing_is_probably_going_to/fn5fckh/",
      "text": "Not everyone will get A’s, many people will struggle with online courses and will not choose to cheat. I have many students not taking classes this summer because their experience with online courses has not been good. We have had discussions about the strong possibility that we will see a decrease in grades for our summer semester based on only online courses being offered.",
      "author": "drock13",
      "created": 1586663389,
      "upvotes": 3,
      "replies": {
        "fn5fit8": {
          "link": "/r/collegeadvice/comments/fzoz80/this_online_classes_thing_is_probably_going_to/fn5fit8/",
          "text": "I mean it shows good character if they don't cheat despite there grades tanking. What's wrong with online classes for some people?",
          "author": "chenthehen",
          "created": 1586663515,
          "upvotes": 1,
          "replies": {
            "fn7y1b8": {
              "link": "/r/collegeadvice/comments/fzoz80/this_online_classes_thing_is_probably_going_to/fn7y1b8/",
              "text": "Everyone has different learning styles and sometimes online doesn’t work for certain students. Online tends also to require more organization and can be problematic for students that struggle due to study habits and work ethic.",
              "author": "drock13",
              "created": 1586729923,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634057752
}