{"sid": "9p37ti", "link": "/r/collegeadvice/comments/9p37ti/collegedating_what_should_i_think_of_this/", "title:": "CollegeDating: what should I think of this?", "text": "2 weeks ago I went to a party and this virgin freshman and I (a junior) just clicked really well and the next morning we went out on a date in the city. \n\nOur feelings for each other developed really fast and he always asked me to come over to spend the night. I became his first and we enjoyed the overall experience of teaching and learning, but we were also extremely intimate in other ways too. \n\nI love everything about this person and he told me he loves me and that he thinks I am perfect. And we decided to become official and spent so much time together\n\nAfter the first week, Without realizing I had spent each night there, his roommates asking if I had moved in. I asked my boyfriend if he felt like his space was being in a fed and if he really was ok with me being around so much. \n\nI felt like maybe he would get bored of me or it would cause strain but he always said he wanted me there as much as possible. \n\nLast night, he finally left to hang out with some friends for some time. He brought up that he’d be hanging out with them very suddenly at the last minute so it took me by surprise.  But when he came back we got extremely high on some edibles from a friend of his. We had a lot of fun and when we woke up I felt like something was different. \n\nHe wasn’t looking me in my eyes like he always does. I tried to brush it off but I could sense it so acutely. When I asked him what was bothering him he said he didn’t think he is ready for a relationship, but that he still likes me. \n\nI feel extremely used and hurt. He said he felt uncomfortable in a relationship...but I don’t know how I made him feel that way. Please tell me what I should think of this. How should I interact with him now? ", "author": "katienexgenacq", "created": 1539814444, "retrieved": 1632960564, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"e8ffnd5": {"link": "/r/collegeadvice/comments/9p37ti/collegedating_what_should_i_think_of_this/e8ffnd5/", "text": "I’ve been there. Freshman guys are usually still very immature and  very hesitant for commitment. My first boyfriend was like this and only after begging him we dated for 4 months. But he just wasn’t right for me and I’m so thankful he broke up with me because Junior year I met someone who I didn’t have to torture myself wondering how could I be good enough. I already was. Be careful with this guy. If he’s able to I would ask why he thinks he isn’t ready. But don’t settle even if it hurts. You have a right to date someone if you want to date. Freshman guys (from my experience)  are terrified of shackling themselves to one girl. You are amazing and deserve the best. I wish you luck", "author": "CoffeeandpuppiesCure", "created": 1540479222, "upvotes": 2}}}