{"sid": "deo5x8", "link": "/r/collegeadvice/comments/deo5x8/dropping_out_biology_bachelors_for_associates/", "title:": "Dropping out biology bachelors for associates degree? Are associates degrees even useful? Other options?", "text": " \n\nI'm currently a sophomore (third semester here) and I'm stressed of everything. I'm doing biology bachelors with ecology concentrations (which I hear from most other people is pretty much a useless degree, so I've been considering dropping out despite my love for nature and wildlife).\n\nHere's the deal: I most likely see myself dropping out or doing something else later down the line because I simply can't see myself doing another 3-4 years of this. At the same time, I don't want to live in an apartment within a trashy ghetto. I'm not asking for a huge salary, all I want is a small house of my own within a decent, non-trashy neighborhood (I want to move out of my current state, somewhere nice and quiet, away from any big cities), with a job I atleast semi-enjoy (tolerate). I'll probably live alone but my brother and I may end up being roommates if we actually agree on a place/find jobs close to eachother.\n\nQuestion is, what am I supposed to do? I wouldn't mind finding an associates degree or trade for something I'm interested in as long as it won't just be another useless degree. Are associates degrees even worth anything? I see some people say they're about as useful as a liberal arts degree and others say it's the best decision they've ever made, making great salaries. Or should I just drop out and hope to god I can find a decent paying job with no degree?\n\n**TLDR;** Fed up with college (doing biology bachelors currently). Is it worth dropping this to pursue an associates degree? If so, which degrees are both interesting/enjoyable and make enough money to move out and buy a house of my own (nothing fancy or big, I just want one in a good neighborhood at least)? Any other options?", "author": "mothking", "created": 1570475651, "retrieved": 1632848832, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"f2yjo7x": {"link": "/r/collegeadvice/comments/deo5x8/dropping_out_biology_bachelors_for_associates/f2yjo7x/", "text": "So, I graduated with a bachelor's in engineering in May. I'm currently working as a technician, which is at the associates/ equivalent trade school or experience level and does not require a bachelors degree. I honestly love it. I make about the same amount as the average starting salary for some of the lower paying engineering positions, without the extra hours and stress that come with the engineering job. I still intend to transition into an engineering position here or elsewhere in the near future, but I would be completely happy in this position as my career. \n\nThere are plenty of openings for associates level education as there are for trade workers. It really depends on what you're interested in for what to go into though because that's not one size fits all. I'm doing electrical work/ testing currently. It will also most likely be more of a physical job than if you had your bachelors, so keep that in mind. Try looking at job postings on indeed/ glassdoor and see what the requirements are education/ experience wise for things you're interested in and have acceptable pay for you. \n\nI have no idea what your debt situation is like, but you also may want to consider transitioning into a program that will transfer most of the courses you've already taken into some sort of credit. Even if it's a different field, there will likely be some programs that will accept a lot of it as electives, if nothing else. Also look into lower level positions at companies you'd like to work for. It's a foot in the door and some of them might pay for you to go to school part time while you're working there. That varies widely by the field you want to go into and the company, however. But plenty have some sort of scholarship program for employees now.", "author": "odactylus", "created": 1570492615, "upvotes": 2}}}