{
  "sid": "g24j51",
  "link": "/r/collegeadvice/comments/g24j51/boyfriend_college_problems/",
  "title:": "Boyfriend + college problems :///",
  "text": "Hi guys, I'm a junior and so I'm obviously thinking about college next year. Obviously, with this comes the question about if my relationship will stick through college.  It's not just a short relationship though, which brings the problem.  We've been dating since right before freshman year, and we planned to go to college together. However, I have better grades and a much better ACT score than him at the moment, and that scares me because I'm looking at top public colleges such as Michigan, Rice, USC, etc. Not only am I scared we won't be able to go to the same college, but I've wanted to join a sorority since middle school, and I obviously couldn't do that if I live with him. I always thought I would never have to make this decision, but the length of the relationship and the amount of love I have for him has changed a lot for me. Anyways, please offer any advice you have. I'll reply as much as i remember to, but this is a throwaway in case he ever looks at my normal reddit account. Thanks for reading if you got this far!\n\nTL;DR:  Even if I've spent a lot of time and love in this relationship, should I break up with him before college to go to a better college and/or have a better college experience?",
  "author": "ThenCurrent7",
  "created": 1586997308,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "fnk08kq": {
      "link": "/r/collegeadvice/comments/g24j51/boyfriend_college_problems/fnk08kq/",
      "text": "I was in a situation very similar to yours, and it lasted until just over a semester in before it went down in flames. All i can say is you need to be 200% sure about whatever decision you do make",
      "author": "iamakillerham",
      "created": 1587011320,
      "upvotes": 1,
      "replies": {}
    },
    "fnk008o": {
      "link": "/r/collegeadvice/comments/g24j51/boyfriend_college_problems/fnk008o/",
      "text": "This answer to this is going to be entirely dependent on the details of yours and your boyfriend's relationship. I'd encourage you to simply talk to him about it! Express your honest thoughts in an as kind and considerate way as possible and I imagine there's a good chance you're both able to come to a reasonable conclusion. \n\nAnd so, honestly- long-distance relationships are tough but not impossible if you prepare yourselves and really want to make the relationship work. Going to different nearby schools is a nice option if possible. Or, if you do end up going to the same school, it's really up to you to do some soul searching and determine what part of the college experience you're willing to give up for your relationship. That might mean giving up the sorority. Or it might just mean not yet living with your boyfriend. \n\nAgain, in the end, I think the real solution is that you need to talk it out with him. Communication is key to any relationship. \n\nI know this is the college advice subreddit and not relationship one though, so in acknowledgment of that, as someone finishing up their third year of college-\n\nThe college experience, if that's what you're looking for, is overrated. Freshman year you might have fun partying or getting messed up in a sorority. But after that year, or maybe two... Most people are switching into real life. Dropping out or focusing on classes and the initial wonder has mostly worn off as you get to looking for jobs and aching to move off-campus. I'd argue you might be missing that boyfriend of yours or wishing you had one by that point even. I'm a guy and never joined a frat or anything but, nonetheless, my understanding of them has always been that, while the bonding and friendships are great and amazing, they just get you into a lot of parties and sleeping around and trying to get into a relationship. You don't need the sorority for any of that. I bonded with plenty of people through clubs and dorms and went to plenty of parties and had the opportunity for a lot more. \n\nAs a final note specifically on the boyfriend vs sorority house living, all colleges and sororities are different and you should look into the rules of your potential options. Some colleges require freshmen to stay on campus so boyfriend living may not be an option right away. Some sororities may allow you to live outside of their buildings.\n\nGood luck with it all though! Just talk to your boyfriend and do some research and I'm sure you can figure it out!",
      "author": "Codiac500",
      "created": 1587011149,
      "upvotes": 1,
      "replies": {}
    },
    "fnjnj07": {
      "link": "/r/collegeadvice/comments/g24j51/boyfriend_college_problems/fnjnj07/",
      "text": "Do not let anyone or anything get in the way of pursuing your goals. If he wants to be with you, he will get that you are looking at different(better) schools. Don’t regret furthering your potential careers for someone. You have so much more in front of you and I know it’s hard to see that right now. But if someone is holding you back, let them go. Things tend to work out for the best",
      "author": "snacksandcomebacks",
      "created": 1587002743,
      "upvotes": 3,
      "replies": {}
    },
    "fnjn44m": {
      "link": "/r/collegeadvice/comments/g24j51/boyfriend_college_problems/fnjn44m/",
      "text": "Men are annoying gross trash. Period.",
      "author": "20kaisera",
      "created": 1587002482,
      "upvotes": 0,
      "replies": {}
    }
  },
  "updated": 1634058492
}