{"sid": "ebrwg2", "link": "/r/collegeadvice/comments/ebrwg2/returning_to_school_after_medical_withdrawal/", "title:": "Returning to school after medical withdrawal", "text": "I withdrew from the fall semester after a concussion the first week of school. I tried resting and then easing myself back into work but even a month after the accident, I couldn’t read or focus without headaches, nausea, and dizziness. The on campus health center was useless and could only write me notes to get out of class. After the suggestion of my academic advisor to withdraw, I did. I spent the fall at home seeing doctors and healing. Physically, I’m doing a lot better- I can read and use my brain again. \n\nHowever, I’m super worried about my ability to get back into school in a really hard program (I’m a sophomore, physics and math major). I feel like I’ve lost my steam and motivation to continue and I’m not sure how I’m going to go from doing nothing to full force sprinting through next semester, taking a really heavy course load to catch up. Any words of advice/ encouragement or stories from people who have been in similar situations would be very appreciated.", "author": "lovely-capybara", "created": 1576562812, "retrieved": 1632848654, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"fb6ytys": {"link": "/r/collegeadvice/comments/ebrwg2/returning_to_school_after_medical_withdrawal/fb6ytys/", "text": "Don't worry about catching up. Start fresh in the  spring with a 12 credit hour load and see how it goes. It's important to ease back into something that is mentally exhausting when you've had some head trauma like this. All it does is push your graduation date out a semester or two. Trust me, it's not the end of the world. I pushed my graduation date out by 2 years because I changed my major after I got my associate's degree. Yes it sucks, but your mental health is more important than finishing \"on time.\"\nI would also suggest before the next semester starts to find some online quizzes, practice problems, homework, or reviewing exams of hard classes you have taken in the past. If you get your mind working on the stuff you've learned it will be easier to get back into school. I would suggest finding exams of whatever math class you took in the spring and copy the questions and then try to do them without looking at the answers. This should help exercise your mind and help it get back into the right mindset of doing school. \n\nI'll be praying for you!! If you ever need to talk I'm always here!", "author": "BrandonBoltfire", "created": 1576565683, "upvotes": 2}}}