{"sid": "ftv0zn", "link": "/r/collegeadvice/comments/ftv0zn/advice_on_college_essays/", "title:": "Advice on College Essays?", "text": "Hey yall, \n\nI'm a super nervous high schooljunior and was just doing research about colleges. I really want to end up at a UC school but my GPA is kinda low for them (3.66). I have a 1560 SAT but am really nervous about college apps. I'm just wondering what people wrote for their college essays and how much it actually takes into account. I really wanted to get into any of the UC's med programs but I am from New York. I have a hardship story but like I don't know how much I should write about that. Mother died when I was 10 and father has Stage 4 Prostate Cancer and I have had difficulties balancing that in my life. 1300 Hours of volunteering at a hospital over the last year just because I love the work.", "author": "___FOOSH", "created": 1585863108, "retrieved": 1632960581, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"fmbjrh0": {"link": "/r/collegeadvice/comments/ftv0zn/advice_on_college_essays/fmbjrh0/", "text": "Check out the guides I have posted in my profile.  You can also check out the wiki page in /r/ApplyingToCollege for more.", "author": "ScholarGrade", "created": 1585927752, "upvotes": 2}, "fm9b70g": {"link": "/r/collegeadvice/comments/ftv0zn/advice_on_college_essays/fm9b70g/", "text": "As long as you make the story’s main focus about you and how you grew everything should be good. A good way to think about it is that often the stories that resonate with admissions are stories where the writer is making an impact or doing something themselves, not as much as something happening to them as they had little control over it. Try and focus on something happening because of your actions, not a reaction of something that happened to you. You’ll do great either way I’m sure\n\nAlso just a little side note I’m a graduating senior of high school right now and I didn’t do anything special for my essay I don’t think but it worked for Northeastern, UNC-CH, Tufts, and Villanova. Not sure how much weight they have in an application though.", "author": "jacobc2070", "created": 1585865218, "upvotes": 1}}}