{"sid": "dlcbpu", "link": "/r/collegeadvice/comments/dlcbpu/cant_decide_if_college_is_for_me/", "title:": "Can’t decide if college is for me", "text": "As the title says, I can’t decide if college is for me or not. I’m a business major and already have a job in the business field that I’m doing right now and will continue to do after college. It does not require a degree. But Ive grown up with this stigma that I must go to college and get a degree, which is why I’m so torn on what to do. I’m currently a sophomore and I’m doing pretty well in my classes, but recently I’ve been thinking about quitting college and just working full time. College is really lonely and I have yet to make any friends. On one hand, I want to just quit and focus on working. On the other, I don’t want to let people down and I’m afraid I’ll regret the decision later in life. Any advice would be helpful. Also, sorry for any formatting issues; I’m on mobile.", "author": "collegeadvice13", "created": 1571716689, "retrieved": 1632848809, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"f4vm1sa": {"link": "/r/collegeadvice/comments/dlcbpu/cant_decide_if_college_is_for_me/f4vm1sa/", "text": "Someone else's comment mentioned the same idea want I want to add here - but it's worth highlighting. \n\nWhy do YOU want to be in college? What is the VALUE of it for you? To get a job? To please your parents? To be educated? Aware? To develop a skill set? Because you feel you have to? You don't know? Can you find a reason? \n\nIt's very difficult to motivate ourselves to work hard (and for a long time) for things we are unmotivated to do. I assure you, *many* others have thought through this same dilemma you're having (I have as well) - it's particularly challenging in the face of the societal and social pressures - but at the end of the day, it is important to locate and understand what is personally driving you. Otherwise, it's going to be a rough few years of possible resentment, bad attitude, and seemingly \"useless\" work. \n\nThere is value in having a degree outside of the *name* of the degree (ie. a Bachelors's in \"Business,\" \"Economics,\" \"English,\" \"Psychology,\" etc.). If your motivation for school is driven by finding work in your future - consider this: companies and employers want to see that you dedicated yourself to something, that you are able to work hard (they know college isn't easy), that you can critically think and analyze, apply yourself, study, and complete challenging tasks. Earning a college degree equips you with more than the knowledge within your major field, it offers you a *skill set* to be able to apply to other challenging tasks and ventures in your future. \n\nAgain, no one can answer these questions for you - so take some time to think through why you decided to attend college in the first place and see if your motivations have shifted or changed.\n\nLastly, the purpose of writing this isn't to solely push for staying in school - I fully recognize its really *not* for everyone (and maybe just not right at this point in time!). But personally, thinking through these questions and finding my personal drive for being in school (because YEAH, it's hard. It's time-consuming. It's a huge time commitment. And I have had oh-so-many breakdowns in the process thus far) was what made the work easier. \n\nI hope this helps. Figure out whatever choice is best for you, be self-assured, and find peace in doing what YOU want (not what someone else wants - life is *much* too short for that).", "author": "eleniray", "created": 1571844493, "upvotes": 2}, "f4q2wnf": {"link": "/r/collegeadvice/comments/dlcbpu/cant_decide_if_college_is_for_me/f4q2wnf/", "text": "Just had to add... I can't tell you how many older students who have worked with their companies for yeaaaars end up coming back to school because they can't move up the chain due to their lack of a degree. \nI see how they struggle because they've been out of school for so long, and now they have responsibilities like a family to support. \nIt's tough, but work on your degree now while you can. Even if it's two classes at a time.", "author": "mayg09", "created": 1571747117, "upvotes": 2}, "f4pc8ub": {"link": "/r/collegeadvice/comments/dlcbpu/cant_decide_if_college_is_for_me/f4pc8ub/", "text": "Facing stigma is rough especially with college and life decisions. On one hand if your career is working out and college is wasting your money and time I’d say drop it.\n\nOn the other hand, while often some degrees are meaningless in the face of experience you can and will get passed up for promotions simply because you don’t have a degree. Changing where you work or how you work without that little certificate can be difficult even If you have the capability required. You could come to regret your decision and the longer time goes the more expensive college gets.\n\nThink about where you want to be in your life 10 or 20 years for now and if you are content with not moving up in the chain as fast then drop college. If you feel like you want to change where or what you do then continue your degree.\n\nWhatever you do, get the notion you must do something because of someone’s else’s expectations out of your head. Do what’s right for YOU. \n\nJust my 2¢", "author": "crayonberryjooce", "created": 1571723586, "upvotes": 2}}}