{"sid": "63c7eq", "link": "/r/collegeadvice/comments/63c7eq/how_can_i_earn_an_associate_degree/", "title:": "How can I earn an associate degree", "text": "I'm 23 and have been trying to earn my associate of science transfer degree so I can eventually transfer to a 4 year college and earn my DVM degree (doctor of veterinary medicine) so I can work in an animal rehabilitation center. First of all does anybody even know if this degree is really what I need? I've done research and talked to counselors/advisors but I don't want to waste years & money if I'm doing the wrong thing. I work 30 hours a week and I have gone through 3 different jobs attempting to find a schedule that works because I am insistent on supporting myself through college, though my parents have a small savings account for tuition. I'm attending community college and my school is the absolute worst when it comes to online/evening classes and it's close to impossible to take all the classes I need beach term which is why this associate degree is taking me so damn long. So my question is does anybody have any suggestions on how someone who has a job can possibly earn an associate degree in a timely manner? Sorry if this is vague but any suggestions are greatly appreciated. ", "author": "oliveindie", "created": 1491282775, "retrieved": 1632960447, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"dfu1rxb": {"link": "/r/collegeadvice/comments/63c7eq/how_can_i_earn_an_associate_degree/dfu1rxb/", "text": "Also the DVM degree sounds like a doctorate but it's actually a masters degree ", "author": "oliveindie", "created": 1491341283, "upvotes": 1}, "dfu1pik": {"link": "/r/collegeadvice/comments/63c7eq/how_can_i_earn_an_associate_degree/dfu1pik/", "text": "Thank you for your advice! The school I want to transfer to is technically a 5 year program that requires an associate of science degree to get into. I know student loans are unavoidable but I was hoping I would be able to work while I'm doing this associates degree because I can barely afford rent/food/gas/utilities now and from watching my friends take out loans through financial aid they end up with only a couple hundred dollars left over each TERM which would just not work for me. Do you have any suggestions on how to get a substantial loan or where to even begin with that? I'm not sure exactly what job I would want all I know is that I would love to work hands on with helping animals maybe even with a job that I can travel to different parts of the world to places where animals need help. That would be my dream job but I'm not sure even where to begin finding something like that. Again thanks for your advice! ", "author": "oliveindie", "created": 1491341206, "upvotes": 1}, "dftxupm": {"link": "/r/collegeadvice/comments/63c7eq/how_can_i_earn_an_associate_degree/dftxupm/", "text": "So you have a couple of good questions here that I will try to answer:\n\n>so I can eventually transfer to a 4 year college and earn my DVM degree \n\nYou are missing a step here. You would get your associates, transfer to a 4-year for two (or more) years to get your bachelor's, then 4 MORE years for DVM.\n\n>First of all does anybody even know if this degree is really what I need?\n\nDepends. Do you want to be the doctor (Veterinarian) at the rehab center? or just work there? You could go for Veterinary Assistant, which is associate's level. \n\n>I am insistent on supporting myself through college\n\nIf you do intend to go for a DVM, I hate to tell you, you are almost certainly going to have to take on student loans and have to either quit your job or go *SERIOUSLY* part-time in order to handle the workload.\n\n>any suggestions on how someone who has a job can possibly earn an associate degree in a timely manner?\n\nUnfortunately, as a working adult, your only options for *timely* are to either look for a community college that does evening/online better, or work with your employer to work around your class schedule. \n\nHope this helps!", "author": "suchdogeverymeme", "created": 1491337097, "upvotes": 1}}}