{"sid": "fybhln", "link": "/r/collegeadvice/comments/fybhln/life_altering_dilemma/", "title:": "Life Altering Dilemma", "text": "hello everyone, this is my first Reddit post ever and I would really appreciate some advice. So I’ve had the same best friend for the last five or so years and last summer we both planned on taking a trip to the Bahamas this upcoming June. Her family has paid for everything and it’s practically set in stone (unless it’s cancelled because of corona) and I’ve been really looking forward to going on my dream vacation with my absolute best friend in the world. Everything seemed fine till I applied to my top choice of school. My junior year was really rocky and my grades slipped so when I applied to go to the school I also applied to start during the summer in order to boost my application. I honestly didn’t think about the trip when I was submitting my application and if anything I was just hopeful that I would get in for regular admittance and I wouldn’t have to start during the summer. I received my letter of approval but I can only go to the school if I start late June for the summer courses. This would consequently clash with our trip and I wouldn’t be able to go with her. I have the option to start at an alternative campus in August and go there for two years before I move to the main campus for the university (I absolutely love main campus and I want to go so so badly) But I really can’t see myself being happy at an alternative campus. I honestly don’t know what to do. It’s my dream to go to this college, but I feel like this is another dream that I could also accomplish by going on this trip with my friend. They’re both once-in-a-lifetime experiences and I honestly am at a crossroads. I don’t know how I could tell my best friend that I can’t go on this trip with her so that I can start at this college during the summer, but I can’t see myself going to the alternative campus for two years before going to main campus. Please help.", "author": "meghan5529", "created": 1586505973, "retrieved": 1632961090, "over_18": false, "upvotes": 1, "upvote_ratio": 0.99, "comments": {"fn05k5d": {"link": "/r/collegeadvice/comments/fybhln/life_altering_dilemma/fn05k5d/", "text": "How long is the trip?", "author": "kylieb209", "created": 1586535827, "upvotes": 1}, "fmz98t5": {"link": "/r/collegeadvice/comments/fybhln/life_altering_dilemma/fmz98t5/", "text": "whatre the colleges if you don’t mind me asking? depends on caliber\n\nAlso, i feel like you should tell her and either push it off to later or have someone else go—your education and future and next 2 years matter more.\n\nunless you contact the summer school to start it online or do it later, as i’m sure the trip won’t take that long and sounds amazing", "author": "adopi35", "created": 1586511437, "upvotes": 3}}}