{"sid": "esy7an", "link": "/r/collegeadvice/comments/esy7an/what_to_major_in/", "title:": "What to major In", "text": "Hay I’m in high school thinking about college and I want to be a chef, but I don’t know what a good major/minor should be as a safe backup that will pare well. Please reply with answers.", "author": "Tbread1k1", "created": 1579808487, "retrieved": 1632848360, "over_18": false, "upvotes": 5, "upvote_ratio": 0.86, "comments": {"ffey55d": {"link": "/r/collegeadvice/comments/esy7an/what_to_major_in/ffey55d/", "text": "Look into Culinary Arts programs at Community Colleges near you.", "author": "drock13", "created": 1579870084, "upvotes": 1}, "ffegowm": {"link": "/r/collegeadvice/comments/esy7an/what_to_major_in/ffegowm/", "text": "Being a chef may or may not require such education. If you plan to major in anything, take a look at the job outlook. And average income of a [chef](https://www.glassdoor.com/Salaries/chef-salary-SRCH_KO0,4.htm).\n\nNow, explore the costs of the college you plan to attend. Do you plan on dorming or studying from home?\n\nThen, ask yourself, how will college be paid for? If you have a full-on scholarship covering everything, then I might say go for it. If not, calculate whether you can work or take a loan while studying. If the stess of three (or more) classes is too much, then cutback (but be sure to recalculate your tuition).\n\nCalculate the overall cost of college with the above choices you made, then calculate if paying back the tuition is feasible. It's a lot of work, but use calculators of expected living costs and factor in how much you must repay per year (loans will have interests).\n\nThis will give you a basic idea of what you can afford in the future. Bear in mind that rural areas and specific states (assuming you're American), have different rates of pay. In the end, you want to obtain a useful skill that can get you employeee anywhere.\n\nNow for a backup major:\nTry thinking about what you have interest in, or take a look online at college majors. I personally recommend a STEM because of the high job outlook, but not everyone can do hard maths. You just have to think: \"what will I enjoy doing in 20 years and not regret doing?\" The last thing you want to end up with is a degree that leaves you unemployeed due to poor job outlook and in debt.\n\nAlso ask yourself: \"is my degree worth four years of college?\" You are a young person making a choice that will affect your future. Ask your parents for advice if you aren't a second generation student.\n\nIf you want to go to a college dorm to party, then college definately isn't for you.\n\nBut take my words with a grain of salt, I'm just a stranger on the internet giving my own practices.", "author": "XiaoMingLi", "created": 1579847311, "upvotes": 2}, "ffdvcox": {"link": "/r/collegeadvice/comments/esy7an/what_to_major_in/ffdvcox/", "text": "Chief of what?", "author": "hamsammmich25", "created": 1579829851, "upvotes": 1}}}