{"sid": "edxwn8", "link": "/r/collegeadvice/comments/edxwn8/should_i_switch_my_major_and_what_should_i_switch/", "title:": "Should I switch my major? And what should I switch it to?", "text": "I'm an Economics Major as a 3rd year in my upper divison courses. And I hate it. My classes are difficult even with tutoring. My intro classes for Econ was basically theory with simple math, but these intermediate and advanced classes are basically Calculus level courses. And while I can do math, I'm not the biggest fan of it. I managed to pass with a c- in one of the major classes and a D in the other major class I'm taking, but I do not enjoy this. Plus, my GPA and my scholarship that's the reason I'm at this school is on dangerous ground after this semester. I might lose it if bad grades in Econ continue to happen.\n\nI am an Econ major due to seeing the potential job and career opportunities in the field but I don't really want to do this as a life job and potentially losing my scholarship. I was thinking of switching to Liberal Arts major like Political Science, International Affairs or History. But I don't know if a stable job can come from that. Honestly, I'm just confused at this point. If anyone could advice or give some insight on the career opportunities on the three majors I mentioned, that would be great. I want to graduate as soon as possible, but my difficulties in major and switching has me stumped.", "author": "RestInZyzz", "created": 1576975040, "retrieved": 1632960369, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"fbqwfr8": {"link": "/r/collegeadvice/comments/edxwn8/should_i_switch_my_major_and_what_should_i_switch/fbqwfr8/", "text": "Can I make a small suggestion? If you’re currently struggling with your classes on said major, but you want to stay in that field...take a semester off and just do personal studying and practice in the areas you’re not doing well in and then return. It’s helped me soooo much when I was struggling in a couple courses. I took free or cheap online courses that wouldn’t hurt my GPA and i went back feeling much more confident.", "author": "ronfrohnson", "created": 1577036427, "upvotes": 1}}}