{"sid": "dauimg", "link": "/r/collegeadvice/comments/dauimg/hi_flash_card_advice_and_tips_and_tricks/", "title:": "Hi! Flash card advice and tips and tricks", "text": "How would you recommend me to make flash card? It’s an science subject and would love to get any tips and advice on how to make them. \n\nThanks in advance :-)", "author": "LoveLifedentist", "created": 1569760214, "retrieved": 1632848841, "over_18": false, "upvotes": 2, "upvote_ratio": 0.75, "comments": {"f2mlos1": {"link": "/r/collegeadvice/comments/dauimg/hi_flash_card_advice_and_tips_and_tricks/f2mlos1/", "text": "I would highly recommend the program \"ANKI\"  [https://apps.ankiweb.net/](https://apps.ankiweb.net/)  but there are many alternatives. \n\nANKI utilizes spaced repetition algorithms which you can also fine tune. [https://en.wikipedia.org/wiki/Spaced\\_repetition](https://en.wikipedia.org/wiki/Spaced_repetition)   \n\n\nI highly recommend using Pimsluer's spacing.   \n [https://en.wikipedia.org/wiki/Spaced\\_repetition#Pimsleur's\\_graduated-interval\\_recall](https://en.wikipedia.org/wiki/Spaced_repetition#Pimsleur's_graduated-interval_recall) \n\n  \nThis just takes advanced of clinically derived memory fade statistics and results with the minimal repetition and maximum retention.  The gist of it is a new chunk of information is retained by your short term working memory for only about 5 seconds. But if you repeat it at the end of those 5 seconds, it lasts about 5 times longer, 25 seconds. Repeat it again, it lasts about another 5 times longer. Repeat a few more times and you are up to months and then years of retention. While you are waiting for the next interval, you are free to learn other things.   \n\n\nAn important part is making good flash cards, our short term working memory can only hold 5 - 7 \"chunks\" of information. A chunk is a very obtuse thing, it can be a single number, a group of numbers, a concept, an image, etc. Break large complicated topics into multiple smaller cards, with each answer limited to 5 - 7 chunks. Utilizing acronyms that are based on crazy stories help as well, the crazier the story the better you'll remember it.", "author": "Matus1976", "created": 1570306548, "upvotes": 2}}}