{"sid": "clpzdq", "link": "/r/collegeadvice/comments/clpzdq/interested_in_majoring_in_computer_science_what/", "title:": "Interested in Majoring in Computer Science, what should I minor in?", "text": "I'm planning to major in computer science, my reasons are mostly because I feel it would be practical and I love working in computers. I have 0 experience in coding or any knowledge beyond just simple tasks in computers/tech, so i feel somewhat inadequate. I also never did well in math back in high school, because it often felt overwhelming and I always lacked any motivation to learn it if it wasn't practical. Geometry was the only class I loved and excelled in, and it was thanks to my teacher explaining it in a way that was grounded and based on logic/reasoning. \n\nThe worst part was that in high school, whenever I attempted to ask why something worked the way it did, I'd usually be frowned down upon for even questioning it, it was like \"how could you not know?!?\" Well shit that's why I'm asking! This in turn has made me lose confidence in any advanced form of math. \n\nI want to know what minor would best compliment a computer science Major?\n\nMy goals in life is to be qualified to become a Police Detective/Officer and in the case that it's not my thing,  have the qualifications and knowledge to also start and run a Business in any industry I'd like (I'd prefer anything culinary or artistic). I want to be able to manage and maintain a business successfully. I'd also like to expand and understand myself so I know my strengths and weaknesses.\n\n\nOptions for my minor/AA to compliment my Major:\n\n1.Business Administration\n\n2.Accounting\n\n3.Computer Science (with the risk of potentially screwing up my college GPA because of my weakness in math).", "author": null, "created": 1564878331, "retrieved": 1632960542, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"ex9419z": {"link": "/r/collegeadvice/comments/clpzdq/interested_in_majoring_in_computer_science_what/ex9419z/", "text": "If you've basically never coded, starting a CS major is a VERY, VERY BAD IDEA. You will be hopelessly lost unless you put in a crapton of hours to catch up. My advice is to be \"undeclared\" your first year, and take all the crap like English, Math, Psych, etc. that you'll need for your CS degree anyway. In the meantime, study Bucky's C++ Tutorials on YouTube and complete all of Khan Academy's CS courses. That should give you a pretty solid baseline for your future CS work.", "author": "Not_Insane_I_Promise", "created": 1566083188, "upvotes": 1}}}