{"sid": "cg8s52", "link": "/r/collegeadvice/comments/cg8s52/complicated_college_situation/", "title:": "Complicated college situation!", "text": "I feel like I’m about to lose my mind over this situation that’s been going for months now so why not seek advice from reddit.\n\nSome background info: I’m a girl with with Arabic  supportive but overprotective parents who are  dragging me out of the US with them to Algeria  I’ve been begging them to not let this affect my education. There is this dumb law that says after a period of time you are supposed to get out of the US and come back but that would cause my parents to be stuck since their visa is expiring soon. It just doesn’t make sense to me that dad would lose his job with Cisco and me and my sisters would be affected because of this so I’m sure they will find a way after a couple of months. \n\nThey also don’t get their green card till January  which means I have to do online this whole year  but I really want the college experience since I’m not even sure about my field, I want interaction to learn much better and online didn't really work for me in the past. I’ve struggled to adapt to English and keep my grades when I came as a sophomore and now my life is flipping over at such an important time. I’ve been arguing with them past months and told them every reason that I should stay from getting loans that I can get part time job paying to how they don’t have to worry about me since I saw that my universities staff is very reliable and the people are nice. I’ve hated my high school experience since we moved every year and sometimes in between semesters so I really want to have an easier time at college and not start in the middle of the year since I might be going into business which means it’s important to get some type of connection with other students. \n\nAnd before you tell, I’ve told them I’m 18 and can make important decision like this in my life but quickly told them I was joking since it got heated I mean they are Muslim so obviously think it’s something bad and when they think of college they think American culture influence, parties, and drinking I don’t know if they really trust me. But regardless they don’t know how much time I’ve  wasted to prepare my way into college to stay in the dorms and now I have to give up on something I was looking forward and excited to experience because I barely had freedom on the past, against they are very religious.\n\nSorry that this is very lengthy but I’m just looking for a miracle that can get me to convince them to just not worry too much since it will just be a few months. What you think I should do to get them on my side", "author": "Linalololo", "created": 1563770930, "retrieved": 1632848909, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"eufjtok": {"link": "/r/collegeadvice/comments/cg8s52/complicated_college_situation/eufjtok/", "text": "[deleted]", "author": null, "created": 1563777366, "upvotes": 2}, "eufjdbl": {"link": "/r/collegeadvice/comments/cg8s52/complicated_college_situation/eufjdbl/", "text": "I recommend posting this on r/advice", "author": "just4aprince", "created": 1563776808, "upvotes": 2}, "eufe50u": {"link": "/r/collegeadvice/comments/cg8s52/complicated_college_situation/eufe50u/", "text": "Please help me as soon as possible they are about to apply online courses and stuff", "author": "Linalololo", "created": 1563770986, "upvotes": 1}}}