{"sid": "f99oqq", "link": "/r/collegeadvice/comments/f99oqq/bachelors_or_interpretertranslator_school/", "title:": "Bachelors or interpreter/translator school", "text": "I’m trying to decide if I want to get a bachelors in Medical Lab or go through an online interpreter/translator program and focus the next few years on building up my language skills. Pros to the Med lab route would be pretty much 100% job guarantee, I’ll know my salary fairly well. Cons are I’ve NEVER wanted to work 9-5, I’ve wanted my own business working freelance since I was little.\nPros to interpreter/ translator route are I could do freelance and hopefully have a business someday, working the hours I want for the most part. Cons are my salary and job status aren’t guaranteed..I’m very stuck on this one. Any advice would help. Thanks so much.", "author": "Abcd_135", "created": 1582634492, "retrieved": 1632848332, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"firbvlm": {"link": "/r/collegeadvice/comments/f99oqq/bachelors_or_interpretertranslator_school/firbvlm/", "text": "It's great that you have both of those options open to you - I'm curious, would you be thinking of doing mostly medical translations? Those jobs can pay pretty well, and there is a HUGE need for them, depending on what language(s) you would focus on through your program. Spanish, Mandarin, Cantonese, Tagalog, Vietnamese, Hmong, Mam, and ASL  translators are always in high demand.  \nIt is a little bit more uncertain at least in the immediate term, but if it's a lifestyle you'd prefer, it is definitely a career than can be quite profitable and one that makes a very important impact in peoples lives. There's also the upfront cost to think about - I don't know which program is more expensive, but I'm going to guess that it's the Medical Lab one. I always advise students I work with to think about the kind of life they want to live, and the structure of your job will effect every decision you make and if you're unhappy with your hours and commute, it can negatively impact your job performance.  \nIt looks like whichever route you choose you're going to be making important contributions to the world while earning a good wage, so I think it would be best for you to choose the job that allows you to live the lifestyle you'd be most happy in. Best of luck!", "author": "Empowerly-Admissions", "created": 1582661402, "upvotes": 1}, "firbke1": {"link": "/r/collegeadvice/comments/f99oqq/bachelors_or_interpretertranslator_school/firbke1/", "text": "It's always better to do what you think will make you happy rather than what will make you money. You can have a completely secure job and be totally financially secure but be completely miserable. It seems like you're choosing between the possibility of happiness and fulfillment or the guarantee of Financial Security, at the cost of that happiness.\n\nI had a similar decision when I decided to be a historian rather than a tradesman, so I'm not exactly objectivehere, but I'd recommend that you go with happiness and fulfillment.", "author": "Hasemage", "created": 1582661220, "upvotes": 2}}}