{"sid": "f2grfo", "link": "/r/collegeadvice/comments/f2grfo/double_major_premed_prepa/", "title:": "Double Major Pre-Med Pre-PA????", "text": "Okay, so, I’m an 18 year old female senior in high school. I will be attending Edinboro University (Good Pennsylvania State school) and I need advice. I’ll be the first in my family really to go to college, so I have no where to turn and I still don’t 100% understand how this all works. I currently have 12 credits due to AP classes going into college (I already know my school accepts them, I got a transcript for them in the mail), and my school also has 2 majors I’m interested in: Pre-Medical, and Pre-Physician Assistant. I’m not quite sure which I want to do, but a lot of the classes I want to take are part of the requirements for PA, but my teacher tells me to do Med in case I want a broader range for Medical schools if I decide I don’t want to be a PA. A lot of the class requirements are EXACTLY the same for both degrees except 8 classes, with a total of 22 credits. My question is, since I have enough credits to not take some basic, gen ed classes and free up my time: is it possible to take the classes needed for Pre-PA and Double Major it with Pre-Med???? I have no idea and would love to know. I want to know if this is possible and if I should do this instead of going for a minor. Thank you so much. Again, I don’t know a lot about any of this, I’m still learning, and really appreciate the advice.", "author": "Yeetus88", "created": 1581461706, "retrieved": 1632848336, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"fhcjiq7": {"link": "/r/collegeadvice/comments/f2grfo/double_major_premed_prepa/fhcjiq7/", "text": "As a college advisor (and currently applying to med school) I just want to say that pre-med is not a major. They probably have a biology pre-med program (similar with the PA). As to what you should do, please don’t be limited to pre-professional majors let yourself choose what is right for you, wether that’s chemistry, biology or whatever you like. Med school and PA school does not care what major you are, as long as you have your pre-requisites you WILL be okay. I have a lot of friends with majors in English, Psych and Literature that are current med students. Focus on what you like and complete the prerequisites that’s all that really matters.", "author": "medicalentusiast", "created": 1581464151, "upvotes": 2}}}