{"sid": "c8j793", "link": "/r/collegeadvice/comments/c8j793/6_college_classes_doable_scary_impossible/", "title:": "6 College Classes? Do-able?, scary?, Impossible?", "text": "Right now I have 5 classes planned \n\nAnatomy and physiology I 4credits\nFit and Well for life 2credits\nCritical thinking 3credits\nMusic Appreciation 3Credits\nBritish Literature I 3credits \n\nI really want to jump into Calculus I right now and don’t know if it’s possible... or Crazy. Advice?\nThe class would be in the evening and I love evening classes. And the Teacher has Amazing reviews\n\nI am Also in High-school and I will be taking \nBand \nChorus \nOrchestra", "author": "cerulean18", "created": 1562125233, "retrieved": 1632961220, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"eueso2y": {"link": "/r/collegeadvice/comments/c8j793/6_college_classes_doable_scary_impossible/eueso2y/", "text": "Hey there!! Take it easy my friend. Enjoy your youth, focus on extracurriculars and regular courses. I always encourage people to take a few college/ ap courses in high school to get ahead, but you gotta put your mental health ahead of that!", "author": "sweetteasnake", "created": 1563752841, "upvotes": 1}, "esq549m": {"link": "/r/collegeadvice/comments/c8j793/6_college_classes_doable_scary_impossible/esq549m/", "text": "Wow. 6 college classes are doable, but I do not recommend it as a high school student. Do a couple of elective courses in stuff you think you want to do. Go volunteer for a local charity or your local library, it looks good on a resume and gets you work experience which will help you later. I did 6 classes my second to last semester of college and wrote over 50 pages of research papers. I pulled it off with schedule sorcery and caffeine addiction.\n\nI recommend looking at accelerated courses. You'll get the credits about 7 weeks. If you are doing 6 classes total, it'll save your sanity.\n\nDo the six when you are on a campus full time. The library is open very late and you can get a lot of stuff done without distraction.", "author": "roguepen", "created": 1562195729, "upvotes": 1}, "esnk7nz": {"link": "/r/collegeadvice/comments/c8j793/6_college_classes_doable_scary_impossible/esnk7nz/", "text": "Woah, partner! I don’t recommend taking more than three college classes per semester as a high school student.", "author": "CharismaticPluto", "created": 1562135803, "upvotes": 2}, "esncwd7": {"link": "/r/collegeadvice/comments/c8j793/6_college_classes_doable_scary_impossible/esncwd7/", "text": "Wait you're in high school and taking 15 units at a college? That is way too much of a load, 15 units is full time, as in 30+ hours a week of class and homework. Calculus is another 4 to 5 units and at most colleges 18 units is the max you can take without special approval. I do not reccomend adding anything else. How many units have you taken before in one semester?", "author": "Delilah-is-done", "created": 1562128783, "upvotes": 3}}}