{"sid": "di2eh5", "link": "/r/collegeadvice/comments/di2eh5/cant_seem_to_find_a_bachelors_program_to_transfer/", "title:": "Can't seem to find a bachelors program to transfer into", "text": "  \n\n· Apologizing in advance for the length. Also, first-time poster, longtime lurker. \n\nHey, guys. I need some advice and was hoping maybe someone out there could help. I wasn’t sure if this was the appropriate place to post this, so if not, someone can (kindly) tell me to F-off to the right place. Haha. \n\nI’ve recently gone back to school, at 25 years-old (yuck), and am having a difficult time staying committed to a major. I am more than halfway through 1st Fall semester and have already put in a request to change my major from Business Management to Office Administration. Luckily, most of my credits I am currently taking are a part of the curriculum for this new program. However, I have realized that Office Administration is basically a “secretary” degree that generally does not go beyond Associates level. I am having trouble finding a bachelors degree that I can transfer into. I am actually surprised that my local community college still offers this program if the transfer counselors can’t exactly provide any information on what sort of degree this can be applied to at a 4-year college. I’m not asking for a definitive answer, just a good ball-park suggestion as to what my degree could somewhat easily transfer into, if any such degree exists. \n\n*For context:*\n\n**Here is the program and the required courses:**\n\n**Office Technology Office Administration**\n\n**Example of my possible schedule:**\n\n1st Fall – \n\n* First Year Sem.\n* Mathematics of Business BUS 120\n* College Writing ENG 161\n* Intro to Business BUS 140\n\n2nd Spring –\n\n* Document Processing I OFT 110\n* Word for Windows OFT 190\n* Excel for Windows CPT 195\n* Powerpoint CPT 185\n* Social Media WEB 188\n\nSummer Semester\n\n* Microcomputer Concepts CPT 150\n* Interpersonal Communication SPC 156\n* Social Science Elective (Probably gonna take Early Western Civilization)\n\n2nd Fall –\n\n* Access for Windows CPT 196\n* Office Technologies OFT 210\n* Transcription OFT 220\n* Acrobat Essentials WEB 102\n\n2nd Spring –\n\n* Integrated Office CPT 278\n* Proofreading OFT 225\n* Customer Service OFT 235\n* Office Procedures OFT 240\n\nSummer\n\n* Office Management OFT 280\n\nHonestly, had I stayed in college back in 2012, I would’ve ended up with either a degree in History or English. Or creative writing, perhaps. Oh, and a massive amount of back-breaking student debt. I’m glad I’m back in it now, but I still have the same level of uncertainty that I had then. What do you guys think this curriculum could transfer into? I don’t mind having to play some catch-up in terms of taking more courses than I bargained for, should I actually transfer this degree into a bachelors program.", "author": "bkuz00619", "created": 1571112405, "retrieved": 1632848824, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {}}