{"sid": "dnwypy", "link": "/r/collegeadvice/comments/dnwypy/where_should_i_live/", "title:": "Where should I live?", "text": "Senior Highschool year is ending soon (May) and I have already applied to a college. The thing that is bothering me is that I have no idea where should I live. I don't want to live on campus because i'll have to worry about fees being high. I don't want to live with parents because as they are now they are pretty overprotective and if stay here longer i'll have to worry about curfews and paying them rent. I want to live in an apartment but the thing is I don't think I might have enough money or get enough money to live on my own. Is there any advice or ideas on this? I don't want to worry about being homeless or living with my overprotective parents even though when I turn 18 they shouldn't really have custody or control over me.", "author": null, "created": 1572198863, "retrieved": 1632848799, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"f70hq1g": {"link": "/r/collegeadvice/comments/dnwypy/where_should_i_live/f70hq1g/", "text": "I know this sounds obvious but do not rush to find an apartment. I was looking around my college for cheap flats and I ended up getting one studio for three people. \n\nThere are a lot of drawbacks to this, but I literally pay nothing. My dad and I got a lot of money to pay rent for the entire year so we get a good discount. I got two roommates and I charge them a little bit extra to make some profit. Here is the thing, both of them live in two cities that are like 2 hours away. I offered them to stay weekdays and weekends they will leave. And we pay everything 3 ways, which makes food super cheap", "author": "luchoo240", "created": 1573328519, "upvotes": 1}, "f5iccvs": {"link": "/r/collegeadvice/comments/dnwypy/where_should_i_live/f5iccvs/", "text": "Are you going to college (or planning to) in your hometown? Also, are you getting financial support from your parents for school? Since that seems to be your biggest concern (and reasonably so), if they are helping pay for school (and dorms), I would certainly go that route. It's a good way for first-year students to transition from living with their family - you're supported with dining halls, cleaning services, security, etc. - while you figure out how to go to a university. \n\nBut if the cost of college will fall completely (or predominately) on you, consider looking for an apartment (or just a room) to share with other people. Depending on where you are in the country, you can likely find a double or triple room to share in your college town that will make things significantly cheaper than living on campus.", "author": "eleniray", "created": 1572213051, "upvotes": 2}}}