{"sid": "ddrovn", "link": "/r/collegeadvice/comments/ddrovn/debating_on_dropping_a_class_and_getting_a_w_will/", "title:": "Debating on dropping a class and getting a w, will it be worth it?", "text": "Im a first year at a csu and deciding to choose film as my major. I only chose it because my school requires that students choose a major. Im already in my second month and I hate the idea of going into film and i hate working with computers and cameras and editing and all that. Im already failing the class and despise waking up in the morning to to it. If i drop it, ill get a w on my transcript which shows that i dropped the class so far into it. I already chose a new major that makes me happier and i no longer need this film class because obviously im no longer going into it. But i dont know if its the right move yet. Advice anyone? I cant talk to advisors because all they do is beg me to stay in the class and fake motivate me and im gonna have to wait 3-4 weeks to have them tell me this.", "author": "Chubss_247", "created": 1570302309, "retrieved": 1632960969, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"f2upega": {"link": "/r/collegeadvice/comments/ddrovn/debating_on_dropping_a_class_and_getting_a_w_will/f2upega/", "text": "If you don’t think about transferring to a different college then it really doesn’t matter. It’s better than a F", "author": "bich_bich", "created": 1570423598, "upvotes": 1}, "f2ntj0b": {"link": "/r/collegeadvice/comments/ddrovn/debating_on_dropping_a_class_and_getting_a_w_will/f2ntj0b/", "text": "Just so you know- the only people who would be able to tell you dropped a class so far into it would be your schools admission office. No one else would know when you dropped that class- so don't let that worry you. \nIt's always best to withdraw rather than fail.A failing grade will mess up your GPA and in turn can affect your financial aid. Remember that typically there is a last day to withdraw from your course, so check your academic calendar to make sure you don't miss that date. \nIf you have questions about how withdrawing can possibly affect your aid- speak to the financial aid office.", "author": "mayg09", "created": 1570319541, "upvotes": 1}, "f2msrb2": {"link": "/r/collegeadvice/comments/ddrovn/debating_on_dropping_a_class_and_getting_a_w_will/f2msrb2/", "text": "What’s a AW?", "author": "LoveLifedentist", "created": 1570308388, "upvotes": 1}, "f2m722t": {"link": "/r/collegeadvice/comments/ddrovn/debating_on_dropping_a_class_and_getting_a_w_will/f2m722t/", "text": "doing so will also make me a part time student! ill go from 14 credits to 10", "author": "Chubss_247", "created": 1570302518, "upvotes": 1}}}