{
  "sid": "eoey34",
  "link": "/r/collegeadvice/comments/eoey34/transfer_students/",
  "title:": "Transfer students?!?!",
  "text": "So I’m a very indecisive person and just moved from a university in Chicago to New York. And I realized that I made the worst decision ever moving to New York. I preferred my Chicaho life much more. So my question is, is it weird to transfer back into the university I transferred out from? \nI liked that university very much and enjoyed my time there. So would I be able to transfer back to the same uni?\nThanks appreciate the response :)",
  "author": "pinkvirgo11",
  "created": 1578969726,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ff8b7ik": {
      "link": "/r/collegeadvice/comments/eoey34/transfer_students/ff8b7ik/",
      "text": "Coming from someone who is currently transferring from their first college to a new one I honestly say fuck it. Follow your heart. Who cares what people think. At the end of the day you are going to be the person who lives with the decisions you make and the life that you chose to live. If you want to be somewhere else and have the means to do so then do it. We only have these years one and in order to get the maximum yield for them you have to be completely immersed in it in order to have an enjoyable experience. Talking to family is tough and feeling like you are getting them to see that you are transferring for the right reasons can be difficult but I’ve decided to embody a attitude that I am the one living this life and it’s my choice. So I suggest that you do the same. Take some time to think with yourself and if you keep finding yourself coming back to the same idea then it is probably the right one. Follow your heart and gut and you will be okay :) Hope this helped!",
      "author": "throwaway2253647",
      "created": 1579671599,
      "upvotes": 1,
      "replies": {
        "ff8ja93": {
          "link": "/r/collegeadvice/comments/eoey34/transfer_students/ff8ja93/",
          "text": "thanks so much for your reply! I really truly appreciate it 💜",
          "author": "pinkvirgo11",
          "created": 1579681084,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "feccjb7": {
      "link": "/r/collegeadvice/comments/eoey34/transfer_students/feccjb7/",
      "text": "So it depends on your old schools rules. We have 2 years before they deactivate your enrollment. So any student that leaves for any reason can come back without reapplying as long as it’s within that 2 years.",
      "author": "drock13",
      "created": 1578970746,
      "upvotes": 2,
      "replies": {
        "fed74xv": {
          "link": "/r/collegeadvice/comments/eoey34/transfer_students/fed74xv/",
          "text": "Thank you!",
          "author": "pinkvirgo11",
          "created": 1579002041,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634048116
}