{"sid": "fz4s65", "link": "/r/collegeadvice/comments/fz4s65/having_trouble_choosing/", "title:": "Having Trouble Choosing", "text": "Hi ! I've never made a post before, but I really need advice. I'm a high school senior, and I got into some really great schools, although none of my top options (Villanova, Haverford, etc). I want to pursue a future in psychiatry, but I'm having trouble choosing between two schools. I really like West Chester, but I'm fairly sure my parents have already decided for me that I should go to Bucknell. Bucknell is a really great school, and I know that I would get a great education there, but something about it just makes me feel miserable at the thought of going there. Obviously, if I were to go into psychiatry, I would need to get into medical school, and looking at the stats, med school acceptance between West Chester and Bucknell are pretty similar (94% vs. 84%).\n\nI'm just not sure what to choose. My Mom and I had a conversation yesterday where she told me she thought I was selling myself short, and that I was not going to be challenging myself academically if I were to go to West Chester, which is where I'm leaning towards now, although I still haven't made my decision. I just feel like it might not be worth it to go to a school that gives me such an unhappy feeling because of the name. Furthermore, my Mom went to a state school and told me how she got rejected from some medical schools because of where she went. However, her best friend went to Bucknell, and they went to the same medical school.\n\nI am really anxious I'm going to make the wrong choice though. Academics are most important to me when choosing a school, but I just feel like if I choose to go to Bucknell, I would be miserable for four years. I feel like its not the school you go to, but what you do with the degree afterwards. Is this the wrong way to approach this?\n\nThank you!", "author": "lizeileen2002", "created": 1586610140, "retrieved": 1632848316, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"fn372fk": {"link": "/r/collegeadvice/comments/fz4s65/having_trouble_choosing/fn372fk/", "text": "I think you’re on the right track. What you do wirh your degree matters. At the end of the day, college is a you decision. Don’t choose a school solely because you’re parents why you to go there. College should be a experience that you enjoy/learn from \n\nI’m still choosing colleges so pick what you feel is best for you in terms of living (dorms, food, etc.), education (walking distance to class, enjoyment of material learned, etc.), and atmosphere (are you safe, happy, etc.)\n\nHope this helps!", "author": "ItsNai1", "created": 1586614432, "upvotes": 1}}}