{"sid": "adbx4l", "link": "/r/collegeadvice/comments/adbx4l/academic_appeal_help/", "title:": "Academic Appeal Help", "text": "I need help with my academic appeal review, I have all my supporting documents. I just need to make sure it sounds fine, i want them to know I take full responsibility and I really want to learn again. I was having severe asthma and allergies problems throughout my fall semester and my lack of scheduling and dealing with my health problems at an earlier stage caused my GPA drop to the point I'm going to be suspended for a year. I need to see if my appeal letter is good enough to start back net semester.\n  \n\nDear Mr. Morgan,\nI am writing to appeal my academic suspension from Saint Leo University. I was not surprised, but deeply regret my actions that led to this point in my studies. I am aware that my grades have been very low the last two semesters. This is my own fault and I take full responsibility. I'm writing with the hope that you will reinstate me for next semester. Thank you for allowing me the opportunity to explain my circumstances.\n\nTowards the end of September, I begin having trouble with my asthma again, and went to the emergency room for bronchitis. Later in November I begin to realize my asthma still wasn’t going well and I was starting to have allergic reactions quite often. My allergies continued to get worse and worse, some days I missed worked or went home early because of this. I finally went to see an allergist and an allergy test and breathing test and learned that I have severe environmental allergies as well as having worse asthma. I’ve been having been given stronger controller medicine and stronger allergy medication and will be starting my immunotherapy once a week from now on too.\n\n I understand more than ever now that I should have communicated with my professors and counselor my health problems rather than avoid them, I also should have dealt with my health from the beginning when it started to affect my work.  I also should’ve withdrawal from classes, so I could’ve tried again with better circumstances the next semester. In future I plan on communicating with my professors and counselors more, rather than ignoring all my problems. I also will address my health instantly and work on my time management skills. Lastly, I will use available resources that will help me succeeded in my classes such as the online tutoring and ask for help from my professors. I want to get back on track with my education as soon as possible.\n\nEdit: I’m fixing the appeal as suggestions come in", "author": "ihatemytoe", "created": 1546821141, "retrieved": 1632849355, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"edfx7v3": {"link": "/r/collegeadvice/comments/adbx4l/academic_appeal_help/edfx7v3/", "text": "[deleted]", "author": null, "created": 1546830072, "upvotes": 2}, "edfteg4": {"link": "/r/collegeadvice/comments/adbx4l/academic_appeal_help/edfteg4/", "text": "If you have this on google docs, pm me so I can help you with grammar suggestions ", "author": "stranger748", "created": 1546827137, "upvotes": 2}}}