{"sid": "afkpug", "link": "/r/collegeadvice/comments/afkpug/state_school_vs_community_college/", "title:": "State School Vs. Community College", "text": "So with admission deadlines nearing, I am still undecided whether or not to go to community college for 2 years and then transferring to a 4 year. Or go straight to a 4 year. Don’t know if I should apply or not to a 4 year either. Any advice? ", "author": "THE_TRUTHH", "created": 1547396005, "retrieved": 1632849350, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"ef0rgsv": {"link": "/r/collegeadvice/comments/afkpug/state_school_vs_community_college/ef0rgsv/", "text": "Community college!!!! It is more than half of the cost. I took over 60 credits at a community college and I don’t regret it at all. I am still student loan free while my other friends that went to a university have tons of loans. Save yourself some money and go to a community college!", "author": "brookeisgreat", "created": 1548518063, "upvotes": 3}, "ee0uahd": {"link": "/r/collegeadvice/comments/afkpug/state_school_vs_community_college/ee0uahd/", "text": "Community College 100%\n\nThe reason most people going that is because of years and years of attending college. The generals are going to be identical no matter where you take them whether it be Harvard some tiny Community College in the middle of nowhere. That's why their generals.\n\nNot to mention that most people do end up changing their major at some point in the first few years of college. This allows you to spend a lot less money while also trying out different things without the risk of Diwali dating some really hard classes because you decide to change your major.\n\nAlso this isn't universally true but generally community colleges are easier. At least easier in that they won't dump work and reading on you as much. You still have to learn just as much but since a lot of community colleges are full of people who also have jobs and maybe even families they generally don't go in for the weekly papers and weekly assignments and weekly reading quizzes and such.\nIt's not certain but you're less likely to get a lot of the Annoying stuff that doesn't really help you learn\n\nBut seriously now there's just a lot of advantages to not wasting your time spending more money on the exact same level of Education. The only reason to go to a 4-year colleges so that you can Network by living in the dorms. But if you're definitely going to attend college do The Bachelors level at least and there's no point in spending extra money just do your networking as a Junior and senior. That's when most your real connections will come anyways, because you'll be taking more classes with people who are doing your same major at that point.", "author": "Hasemage", "created": 1547433629, "upvotes": 3}, "ee08hno": {"link": "/r/collegeadvice/comments/afkpug/state_school_vs_community_college/ee08hno/", "text": "Im not an expert or anything, but most community colleges are cheaper than universities or 4 years so you would probably save money by doing that.  There are also things like scholarships where it would be cheaper to go to the 4 year rather than transferring from a community college.  I doynt know about all schools but the community college near me has a transfer program where you take all your pre reqs and you get a scholarship from the university if you keep a certain gpa.  I would personally apply to all of them, but try to find out what programs/scholarships you could get before enrolling in classes.", "author": "motoxsk8r", "created": 1547416175, "upvotes": 1}}}