{"sid": "f53ch1", "link": "/r/collegeadvice/comments/f53ch1/transfer_or_gap_year_i_appreciate_any_feedback/", "title:": "Transfer or gap year? I appreciate any feedback :)", "text": "So I am at an emotional crossroads here. I am currently in my 4th semester at a community college and I am deciding whether to transfer upstate to a university directly this fall to pursue my education or to take a gap year before transferring. I changed my major a year in to Geography so I can pursue a nature focused career that will bring me outdoors. I have always felt more at peace outdoors and the reading the descriptions for something like a forester. I have not had a car, and i do not have much opportunity for work and park volunteering because of it. I currently have a part time job but I only work around 20hrs per week, and  70-80% of my monthly income goes to paying my bills. With me moving twice in the past 2 years, switching majors, worrying about school, and now the transfer, it feels like I don't have a lot of time to breathe before another big ball of stress comes along.\n\nHere are the advantages I can see for taking a gap year:\n\n1. Frees up my schedule to work more and save up for a used car\n2. Have time to volunteer at trails, gaining experience\n3. Be able to work on myself mentally and physically. I would like to do some more soul searching, get a therapist, and start a work out plan. I feel like I have not had time between school, work, and me time to commit to something new.\n4. Because of my time at the community college, I will have my Associates Degree to prove my education (not specific to taking the gap year, but I won't be left with \"nothing\")\n5. Be able to take a few more credits at community college, will be cheaper and can lighten the university load\n\nThe disadvantages will be I will miss out on transfer-specific scholarship opportunities, I think my current scholarship will be dropped ($3,000 this year, $5,000 last year), and I risk not going back to school (I do not think it will happen, but I'm being aware of it)", "author": "ImaQuinner", "created": 1581914730, "retrieved": 1632960408, "over_18": false, "upvotes": 4, "upvote_ratio": 0.84, "comments": {"fhwiqw8": {"link": "/r/collegeadvice/comments/f53ch1/transfer_or_gap_year_i_appreciate_any_feedback/fhwiqw8/", "text": "\"AGA research found that 90 percent of students who take a structured gap year return to school within a year, and are more likely to graduate on time and with a higher grade-point average\" - CNBC ([source](https://www.google.com/amp/s/www.cnbc.com/amp/2017/05/19/making-the-most-of-a-gap-year-before-college.html)). \n\nBest advice I ever gotten was that college is not a race. If you think about it, you have been in school for 13+ years of your life. Taking a nice structured gap year is a good idea to give time to relax. The only issue I can think that you nay run into is that if you have student loans, you will have to start making payments 6 months into your gap year. Just be aware of this, set some money aside to pay it or you will be like me and tank your credit!!!", "author": "Unleaver", "created": 1581917096, "upvotes": 3}}}