{
  "sid": "g06ztw",
  "link": "/r/collegeadvice/comments/g06ztw/help_choosing_unc_vs_umd/",
  "title:": "Help Choosing: UNC vs UMD",
  "text": "Hello everyone! I’m a high school senior trying to pick where the hell to go to college. I’ve narrowed it down to UMD (College Park) and UNC (Chapel Hill), so here’s my pro/cons list. Just some background on me -- I applied to both of these schools as a bio major, but I’m probably going to go into social sciences or something related. That being said, it’s most likely that I will have to go to grad school afterwards, so that’s definitely something I’m keeping in mind. Both of these are already good academic programs, so I didn’t really mention that. Also, really weird but music is a big hobby of mine, so if that has any bearing on these two colleges, please lmk! \n\nUMD \n\n\\+: \n\n* Close to home (I tend to get stressed easily, so it would be a nice safety net to have family close by) \n* Around 12k cheaper \n* Got into the honors program! \n* A lot of friends also attending/more familiar territory \n\n\\-: \n\n* More difficult to switch out of majors (Biology there is a Limited Enrollment Major, and so is Psych, the other option I would be interested in. I’m not really sure how difficult switching in/out of these would be, but I’m assuming more difficult) \n* Feel more restricted (\\^\\^)\n* Don’t like the campus that much \n* A little less prestigious, which means less opportunities and alumni network for grad school \n\nUNC\n\n\\+: \n\n* More prestigious = more opportunities and better alumni network \n* More flexibility (especially as everyone comes in undecided, so it’s less pressure) \n* LOVED the campus and the environment \n* New experiences and independence \n\n\\-: \n\n\\- didn’t get into the honors program, so I don’t know how much that would hurt me \n\n\\- more expensive by 12k \n\n\\- unfamiliar territory\n\n\\- further away, so I can’t visit family or be helped by them as much \n\nThank you so much! And if any of you actually attend either one of these colleges it would be super helpful, but obviously any advice is great and very very much appreciated!!",
  "author": "MayaL3712",
  "created": 1586733295,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "fn8s94m": {
      "link": "/r/collegeadvice/comments/g06ztw/help_choosing_unc_vs_umd/fn8s94m/",
      "text": "If you are pretty sure about grad school, I’d definitely choose UMD. That way you can save some money for grad school, and if you end up at a more prestigious grad school it won’t really matter if your undergrad is slightly less prestigious.",
      "author": "lb2233",
      "created": 1586748923,
      "upvotes": 1,
      "replies": {}
    },
    "fn84kwl": {
      "link": "/r/collegeadvice/comments/g06ztw/help_choosing_unc_vs_umd/fn84kwl/",
      "text": "I’m a high school senior but I’d personally take UNC.",
      "author": "mikenike21",
      "created": 1586733770,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634057860
}