{
  "sid": "dnh7t5",
  "link": "/r/collegeadvice/comments/dnh7t5/financial_aid_screwed_me_over/",
  "title:": "Financial Aid Screwed me Over",
  "text": "I am a third year college student. I WAS trying to double degree in Music Performance and Biology. I’m in a very expensive private college, but due to my music scholarship, it has been really easy to pay. Due to wanting to double degree, I needed to stay a 5th year to finish up the degrees. Around the end of my freshman year, or beginning of my sophomore year, I went to the financial office to talk about my fifth year and how my scholarships will hold up. They told me that all I’d need to do is fill out a form and turn it in to get it accepted. They told me that these forms have a 95% chance of being accepted (they would only deny if you failed a lot of classes and that’s why you needed to stay a 5th year). I went out of the office with the idea that I’ll be staying a 5th year and it would be covered with my scholarship. My advisors helped me build a plan to spread all the classes in those five years evenly. Everything seemed fine.\nFast forward to now, we are about to sign up for spring semester when the associate dean of music wanted to meet with me about my 5th year. In the meeting I got some really bad news. Apparently for the past year or so, I had the wrong information about my scholarship. There is no form to sign, nothing of that sort. I have to meet with the Dean of Music about my 5th year and only he can agree to give me that scholarship. Apparently that is a very slim chance to happen. As well as, apparently a lot of the federal aid I’ve been getting will completely stop my 5th year too. Everything opposite the financial aid office told me a year ago. It seems the best option to do is to choose one degree and finish in 4 years. That degree will be for my career, so I’m choosing biology. For the past two years, I’ve been focusing more on music since it is more rigorous, and because of this, I haven’t started doing internships or research for my bio degree. That was suppose to be for my second half of my 3rd year, my 4th year, and my 5th year. Now I only have one year and a half left to do everything I wanted to do in three years. \nI’m not sure what is the best course of action and what to do next.\nI want to go to grad school for my science degree and I know I need research experience and internships.\nSince I no longer have that one year, should I take a gap year to build up my resume or should I go straight to grad school? \nIs there a way where I can try to financially build up to stay that 5th year?\n\nI want to become a genetic researcher as my career. I am planning on getting my phD. \nI’m at a loss now, I’m not sure what to do. Is there any advice anyone can give me?",
  "author": "Snowfur451",
  "created": 1572112150,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {},
  "updated": 1634057858
}