{"sid": "fssf3q", "link": "/r/collegeadvice/comments/fssf3q/help_needed_nyu_vs_cmu/", "title:": "HELP NEEDED! NYU vs CMU", "text": "Okay, this is a serious question that has been the cause of a lot of contention at home. \n\nI got accepted to both Carnegie Mellon (Dietrich College to study Ethics, History, and Public Policy) and NYU (Stern, in the Business and Political Economy Program). Currently, my family is going back and forth on which I should attend (I lean one way, my dad leans another). Both of these are phenomenal schools, and I’m extremely blessed to be able to say that the price of the schools doesn’t impact my decision (though they’re similar in price). \n\nThere are tons of factors to consider, and I eventually see myself going to law school way down the road (I want to eventually go into corporate law/M&amp;A). If you were me, which school would you go to? Please answer in detail with reasoning, as I need unbiased eyes on this. \n\nQuick edit: I live in southern CT, just a train ride from the city. Also, the BPE program at NYU is a very small exclusive program with ~100 kids a year. \n\nThank you!\n\nMaddie", "author": "maddgraf", "created": 1585714433, "retrieved": 1632848321, "over_18": false, "upvotes": 4, "upvote_ratio": 1.0, "comments": {"fnebps7": {"link": "/r/collegeadvice/comments/fssf3q/help_needed_nyu_vs_cmu/fnebps7/", "text": "personally, if you’re looking for a college with a campus feel and a typical college experience I’d say CMU. BPE at stern has a bunch of study abroad and NYU itself is an open campus. I know that CMU Dietrich is becoming a real front runner in the social sciences. Considering you want to maybe go law in the future, the major at CMU seems like a better path. Stern is very business oriented and might not be as helpful.", "author": "nikmik311", "created": 1586886512, "upvotes": 1}, "fm51x9j": {"link": "/r/collegeadvice/comments/fssf3q/help_needed_nyu_vs_cmu/fm51x9j/", "text": "NYU Stern is the best for finance and investment banking and is one of the top feeder schools for many Wall Street investment banks.", "author": "Yeeet410", "created": 1585764818, "upvotes": 2}, "fm3m446": {"link": "/r/collegeadvice/comments/fssf3q/help_needed_nyu_vs_cmu/fm3m446/", "text": "ur kidding me.. i’m in the same boat.... either cmu for econ at dietrich or econ at stern or economic consulting at kelley...", "author": "adopi35", "created": 1585728451, "upvotes": 2}, "fm390dc": {"link": "/r/collegeadvice/comments/fssf3q/help_needed_nyu_vs_cmu/fm390dc/", "text": "I can't say I know either school well, but whatever you choose think about things like location (which is closer to home?), weather (both pen and ny have cold weather but as stupid as it sounds, if you hate the cold that's going to impact how you feel too), student population (do you want to go to a school with 25,000+ students or 10,000 because smaller classrooms can mean more personalized education and depending on how you learn that might be better or worse). \n\nThese are just a few things to consider that might seem stupid, but in my college experience they made a big difference. I never thought I would be the type to miss home yet I did, I hate the cold so I got lucky I picked a school in Texas with nice hot a weather, and I need one-on-ones with professors all the time, so being in a smaller school helped me a lot. You might different, you might want to go as far away from home as you can and have an excuse to not go home for spring break. You might want to be in a classroom of 100 people to avoid making eye contact with your professor. In any case, you want to enjoy college so do what makes you happy.", "author": "kobs99", "created": 1585716104, "upvotes": 3}}}