{
  "sid": "bzvsqq",
  "link": "/r/collegeadvice/comments/bzvsqq/incoming_freshman_dos_and_donts/",
  "title:": "Incoming Freshman Do’s and Dont’s",
  "text": "Hey there, glad you stopped by! As an incoming freshman into college, I'm sure that I, as well as many of my other fellow classmates,  are probably either really nervous or really excited to start a new chapter in our lives. What advice do you have for those that are about to be entering campus soon this coming August? Drop your advice, tips, comments, etc below!\n\nHere are a few suggestions:\n\n-Housing\n\n-Curriculum\n\n-Atmosphere\n\n-Opportunities\n\n-What to pack/ bring\n\n-Clubs on campus\n\n-Any fun stories you wanna share?",
  "author": "TheKevin027",
  "created": 1560368945,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "erwg12k": {
      "link": "/r/collegeadvice/comments/bzvsqq/incoming_freshman_dos_and_donts/erwg12k/",
      "text": "Get shower shoes if you are living in a dorm with a communal shower. If you have roommates, even if you know them already, have a discussion at the beginning of the year about expectations and boundaries, like having guests over, how late the lights should be on, keeping the room (somewhat) clean, etc. Also, you don't have to be best friends with your roommate(s). \n\nDefinitely schedule time to join clubs or do things that you want to do outside of classes. This is necessary for maintaining your mental health and keeping your motivation up.\n\nLook into getting a microwave and/or minifridge if your dorm allows it, and keep snacks in your room.",
      "author": "writingoreos",
      "created": 1561342522,
      "upvotes": 2,
      "replies": {}
    },
    "eqz76aj": {
      "link": "/r/collegeadvice/comments/bzvsqq/incoming_freshman_dos_and_donts/eqz76aj/",
      "text": "Don't pick a major too quickly if you're unsure. So many people change their mind and that's okay. \n\nDon't take loans if you don't absolutely need them.\n\nDon't be afraid to make friends and ask people to study with you or start a group snapchat to discuss homework!\n\nDefinitely scope out professors before picking classes. The right professor can be the difference between a pass and a fail.",
      "author": "Delilah-is-done",
      "created": 1560395011,
      "upvotes": 2,
      "replies": {}
    },
    "eqxobl1": {
      "link": "/r/collegeadvice/comments/bzvsqq/incoming_freshman_dos_and_donts/eqxobl1/",
      "text": "I have this checklist that helped me throughout college.\nWhen leaving your room always take:\n- A charger and power bank if you have one\n- Some Money\n- A snack\n- Water\n- Pen & Paper\n- Wet wipes or tissues\n\nBest advice is enjoy campus life go to events join clubs start your own clubs that's where you'll meet the most ppl.\n\nWatch what you eat; most ppl gain weight during their first year of college.\n\nStudy and be aware that once midterm week starts in never stops suddenly you have a shitload of projects papers and exam so procrastinate wisely.\n\nTry at some to join a professor in their research it's more work but it's the best thing you could do.\n\nA C in one class is fine don't be too hard on yourself just not in all. \n\nIt's easier to maintain a high GPA than to raise one (the higher the number of overall credits you have the harder it is to increase your GPA)\n\nGood luucckk",
      "author": "EggYolk26",
      "created": 1560371946,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634059164
}