{"sid": "9pskqa", "link": "/r/collegeadvice/comments/9pskqa/not_happy_with_my_major/", "title:": "Not happy with my major.", "text": "I recently just transferred schools going into my sophomore year. Unfortunately only 12 out of 30 of my credits transferred with me, causing me to be a freshman again. I major in business administration. Since starting my new school I haven’t been loving my major. I honestly dread thinking about and have been wanting to change it since the first week of class. I’m stuck because I want to change it but I really don’t know what to and I don’t want to deal with extra credit hours. Any advice ? ", "author": "poppinshawty-", "created": 1540025317, "retrieved": 1632961609, "over_18": false, "upvotes": 1, "upvote_ratio": 0.99, "comments": {"e847r2v": {"link": "/r/collegeadvice/comments/9pskqa/not_happy_with_my_major/e847r2v/", "text": "First thing: Why did you pick business administration in the first place? \n\nDid you think it would interest you? If so, then I wouldn't be so quick to give up on it. Majors change a lot after the first year. You're going to get into the meat of the subject soon.\n\nOr did it mildly interest you and you were pressured into making a decision? If you were pressured then forget about that last option. You're definitely on the right path to think about changing.\n\n&#x200B;\n\nThis is probably going to be unpopular but for people close to me, it seemed like a big help:\n\nDon't switch majors if you're not confident which direction you want to go. That will just create more problems for yourself in the future. (If you have student loans, it can cause some serious pain. Pay as you go if you're uncertain.)\n\nIf you know you don't want to be in business administration and you still don't know what you want to major in then take a break. \n\nGet an entry level job where you get to work with people that might have the job you want in the future. \n\nFor example: if you \\*think\\* you want to be a nurse then try being a CNA. This isn't the same thing but get a job around nurses and watch what they do. This will save you from 4 years of misery just to get a job you end up hating.\n\nIf the job actually looks like something you enjoy then you can pursue it in college.\n\n**The advantage of this: you're making money (or paying off loans) instead of building a huge debt. And you'll actually see what the people in your potential career field are doing.** \n\n&#x200B;\n\nIn a perfect world, the classic: high school to college to career model is ideal\n\nWe're humans though. Not everyone knows exactly what they want to do. Don't feel bad about that. Get excited that you're going to have the opportunity to experience way more than the average student.\n\n&#x200B;\n\nMaybe... MAYBE... the straight through college without a break thing will let you retire a few years earlier but seriously... you're risking hating the next 30+ years of your career. It's better to get started a little bit late than to dread your own future. (If you're lucky, you might find a career that makes you dread retirement.)\n\nI hope there is something in here that helps. :)", "author": "kayhearts", "created": 1540040675, "upvotes": 1}}}