{"sid": "dr9t9t", "link": "/r/collegeadvice/comments/dr9t9t/graduated_recently_and_feeling_a_little_lost_need/", "title:": "Graduated recently and feeling a little lost, need advice", "text": " \n\nApologies if this is a little long winded, \n\nI graduated college with a degree in Environmental science recently and have come into a bit of a roadblock. I should preface this by saying that when I first started college I was, as some might say, going through it. I was dealing with an undiagnosed and poorly dealt with mental condition, I was wholly oblivious as to what studying meant or how to do it and I didn't adapt to college life as gracefully as I would have liked.\n\nSo, needless to say, I didn't do well in my first year and, while I did better my second year, I still wasn’t where I wanted to be. It wasn't until my 3rd and 4th year that I really hit my stride and, while I never failed a class, I was put into a worse position due to the fact that my college has a policy wherein a student is allowed to use a repeat fail up to 3 times and replace a failed grade with whatever you get when you retake the class. I was deeply frustrated by this since my worst grades were 3 Ds, meaning I couldn’t capitalize on that. \n\nIn my last two years I did really well and got really good grades in higher classes than those I had struggled with years prior, which brings me to where I’m concerned. In spite of doing better, I graduated with a 2.85 (too little too late, I suppose.) My goal has always been to work outdoors with wildlife, the forest or the ocean. It's a broad net of a goal, but sadly it seems that hasn’t made it much easier. Having been exposed to the job market for a few months, I’ve found that careers like forestry, conservation ecology, marine biology and others that align with what I’d truly like to do largely require higher degrees and now I’m petrified that my 18-19 year old self may have wasted my opportunity. I’ve lost more sleep than I care to admit over this issue.\n\nIf you’ve read through all this and thought to yourself “Well, tbh you’re dumb for not dealing with your bs sooner and wasting your oppertunity” then let me just tell you, I agree 100%. But self loathing aside, what I wanted to ask is what exactly are my options in this situation? I’ve been working since I graduated and am able to retake a few classes but, since I graduated, my gpa won’t change. Is it even worth it then? And if so, how can I achieve getting into a grad school, if thats whats needed? Are there other routes I'm not considering?", "author": "RiscuitBuscuit", "created": 1572828668, "retrieved": 1632961168, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"f7d9gne": {"link": "/r/collegeadvice/comments/dr9t9t/graduated_recently_and_feeling_a_little_lost_need/f7d9gne/", "text": "I was thinking about  Marine biology but I have no idea what the typical marine biologist does on a day to day basis. Plus if you need a PHD to get into the field is it really worth it?", "author": "suavepapi69", "created": 1573611003, "upvotes": 1}, "f6h88ra": {"link": "/r/collegeadvice/comments/dr9t9t/graduated_recently_and_feeling_a_little_lost_need/f6h88ra/", "text": "Take this with a grain of salt; I’m only a freshman. I’m majoring in fisheries bio, so similar stuff, and from what I’ve heard so far, this kinda work really relies much more on experience than pure scholarly work. So, since your grades aren’t the best, focus on getting more experience to help make up for it. If I were you I’d apply to a bunch of internships and do volunteer work, whatever you can do. We had the director of Denver Parks and Wildlife(or some similar position) come and speak recently, he said he graduated with a 2.0 gpa so you have hope for sure.", "author": "stefanfolk", "created": 1572839386, "upvotes": 1}}}