{"sid": "eojnll", "link": "/r/collegeadvice/comments/eojnll/new_york_university_of_business_tech/", "title:": "New York University of Business & Tech?", "text": "hey guys, so i'm thinking about going to grad school.\n\nwhile an MBA isn't strongly related to my new career interest (the legal cannabis industry), i feel like the diploma will help me as i attempt my transition from an entry-level position into higher positions.\n\nwhat do you guys know about New York University of Business & Technology (NYUBT)? right now it lacks accreditation, but they claim they're \"seeking accreditation\" in 2020. the big draw: it's 99% free and totally online. you just pay $900 in \"exam fees\", and in 8 months your MBA is in the bag.\n\nnow, i'm not claiming this place is anything near Ivy League or prestigious. clearly not. but i've been trying to find info and coming up short.\n\ni mean, it IS an MBA...kind of...and it's virtually free. my wife earns close to a 6-figure income, so $900 is pretty inconsequential.\n\nlet's be clear: i'm doing this to pump up my resume somewhat. i have no delusions about working for Google or Amazon. in fact, i'll probably end up working for a smaller cannabis company, likely just at the local level--maybe as a store manager, or as a marketing manager or editor eventually (i have 8 years of good digital marketing and corporate writing experience). \n\ntbh, that's pretty much all i want. have not too stressful of a job in an industry i like and believe in, enjoy the warm weather, surf a lot and lie on the beach and smoke bud in my off time, get naked with my wife, travel on vacation. these are my life goals.\n\nhow many low-level employers (not anywhere near Fortune 500) know what New York University of Business & Tech is, or will research it deeply? it sounds legit, and as long as i can show my diploma and transcripts, i should be good, right? i'm not competing for COO positions at Apple   >.>   and if they get their accreditation, so much the better for me.\n\nis it maybe a better idea to shell out the $6k or so for some cheapo place like Georgia Southwestern University or Texas A&M-Kingsville? cheap, and not impressive...but a \"real\" university nonetheless?\n\nif NYUBT ends up going outta business in 2 years for fraud or something, i'm gonna be up a creek...and i'd have to go earn another MBA from another university, as i could no longer list NYUBT on my resume (no way of proving my education, because there'd be no way of getting transcripts).\n\ni'd really love to save that $6k if possible, though.\n\ni'd really appreciate your guys' views on this before i make any decisions, and if you have any other suggestions for low-cost, low-rent MBA programs, i'd love to hear about 'em  =)\n\nthanks a lot  =)", "author": "puffaluppagus", "created": 1578998428, "retrieved": 1632848378, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"ff7hbpt": {"link": "/r/collegeadvice/comments/eojnll/new_york_university_of_business_tech/ff7hbpt/", "text": "How did you get into the cannabis industry?", "author": "suavepapi69", "created": 1579649553, "upvotes": 1}}}