{"sid": "fztx28", "link": "/r/collegeadvice/comments/fztx28/umich_vs_ut_austin_vs_notre_dame/", "title:": "Umich vs UT Austin vs Notre Dame", "text": "Hello! I was recently admitted to Umich, ND, and UT. Unfortunately, I was waiting to visit the schools to make a more informed decision, but due to covid I wasn't able to. So I've spent the last few weeks researching but have been struggling to narrow it down at all. I applied business at all 3 and was admitted to Ross, Mendoza, and McCombs. \n\n&#x200B;\n\nI want a very challenging academic and intellectual experience, but I also want the classic \"college experience\" — I love parties, I love football, I love hanging out with friends. My goal coming out of college is to go into investment banking or consulting. I have a few pros/cons of each school that I'll list below. If there's any advice you have, it'll be so greatly appreciated. Thanks so much! Btw, finances aren't a very large concern for my family, but still worth noting. \n\n&#x200B;\n\nUT PROS: In-state (substantially cheaper—approx 22k/year), top 5 business school (US News), warm weather, cool party scene, cool city, friends going there, somewhat close to home but far enough, good sports, got half off tuition (taken into account in net price above).\n\nUT CONS: nothing \"new\" (don't want highschool pt 2), the overall school is not as prestigious, not as heavily recruited for banking, not in Business honors so I'm concerned that honors kids will get all the good recruiting first. \n\n&#x200B;\n\nUMICH PROS: Really cool college town, very good brand name/prestige, very well recruited by banks in NYC/Chicago, top 3 business school (US News), overall superior academically to UT, cool party scene, good sports, a lot of room for growth and experiences. \n\nUMICH CONS: very brutal weather, maybe too unfamiliar, very expensive (approx 68k/year total), out of state. \n\n&#x200B;\n\nND PROS: Tight-knit community, awesome academics, facilitates a friendly culture, no pressure to join greek life, pretty well recruited by banks in NYC/Chicago, good sports culture, private so more resources I assume, strongest overall name brand/prestige.\n\nND CONS: south bend sucks, bad weather, have to live in dorms for 3 years (could be a good thing down the road), quiet party scene, a little too \"structured,\" not ranked in the top 10 business schools (US News). \n\n&#x200B;\n\nMost of this is out of pure speculation, so I may come off as really ignorant of some awesome opportunities at each school. I'm super grateful to have the ability to choose between three awesome schools, but I want to do my due diligence to make the right decision. Thanks again! \n\n[View Poll](https://www.reddit.com/poll/fztx28)", "author": "Dr24206", "created": 1586684649, "retrieved": 1632961084, "over_18": false, "upvotes": 1, "upvote_ratio": 0.67, "comments": {"fn6t9xi": {"link": "/r/collegeadvice/comments/fztx28/umich_vs_ut_austin_vs_notre_dame/fn6t9xi/", "text": "The price point makes UT Austin the best choice here.", "author": "ScholarGrade", "created": 1586706908, "upvotes": 1}, "fn67y8b": {"link": "/r/collegeadvice/comments/fztx28/umich_vs_ut_austin_vs_notre_dame/fn67y8b/", "text": "In terms of prestige UT and UMich are almost neck and neck...but I don’t think anyone should ever spend 70k a year on education unless they’re very very wealthy.", "author": null, "created": 1586690947, "upvotes": 1}, "fn652hf": {"link": "/r/collegeadvice/comments/fztx28/umich_vs_ut_austin_vs_notre_dame/fn652hf/", "text": "UT Austin (and I say this as a Michigan grad). McCombs is ace and given the price difference, it's the most logical choice. Austin is such a vibrant city and the overall culture at UT is in line with what you seem to be seeking from your college experience.\n\nHowever, if finances have minimal bearing on your decision I'd def pick Ross. It will open some doors for you in certain prestige driven fields (IB, Consulting) across locations that the other two may not - Ross is more of a national (as opposed to a regional) target.  \nOf course, Umich is also the quintessential college experience in terms of being in a top-notch college town, having an indefatigable school spirit due to the strength of its sports, a great party scene and academic prowess across the board in all disciplines making for a work-hard, play-hard culture.\n\nTL;DR - best logical choice accounting for finances - go with UT Austin  \n\\- best choice based on career outcomes and fit - go with Umich Ross", "author": "vs3001", "created": 1586687733, "upvotes": 3}}}