{"sid": "cyzs7g", "link": "/r/collegeadvice/comments/cyzs7g/last_year_of_uni_no_motivation/", "title:": "Last year of Uni, no motivation", "text": "Hello!!\n\nI \\[22F\\] am (finally) in my last year of my undergrad at my local university and it's been pretty good up until recently. When I graduated high school I was super stoked to be going to University and I thought it was going to be a life changing experience and it was ... but for the worse. I met some really nice girls but we never really became anything more than really friendly acquaintances. I met my best friend in high school and we both go to the same university but different schedules, majors, and lifestyles means we rarely see each other. University went from a glimmer of hope and excitement to a very dark and lonely place. I'm not saying it's *all* been bad, there have been some genuinely great experiences but they are few and far between.\n\nI finished off last semester on a strong high note, I did great in my classes and was offered a second scholarship. I decided I wanted to work this summer but after dozens of applications and a couple of interviews, I still had no job four weeks into my summer vacation, so I decided to do DoorDash. Honestly, I really liked it up until the last couple weeks (glitches, difficult orders, etc.) I would work in chunks of time when possible but was always done by 5 p.m. and went home whenever I had extra time between orders. The semester stared August 21st (Sept 1 today) and I had been dreading it and had terrible anxiety for about two weeks before classes started. This semester I am taking two online (five classes total) classes, neither of which I am particularly interested in (they're basically the same thing but different departments - Education Leadership and \\[business\\] Management) and I'm required to take the latter and chose the former because it is a mini semester class. My management class is a pain in the rear and she, the professor, wants like a million and two things done in one week before starting it all over again. My other three classes are more manageable but I have a hard time focusing and paying attention. I have little desire to get up and go to class and even less desire to sit down and get to work on assignment, and NO desire to read the dang textbooks. I try stay encouraged and motivated by reminding myself that I only have two semesters left and if I continue to work hard and get good grades, it'll pay off in the end (I have to keep up my grades/gpa if I want to keep a *very* generous scholarship). I'm honestly so done and tired of feeling like a misfit, I'm also tired of reading stupid textbooks and spending all my time doing schoolwork. I just want to stay home with my dog and cat all day.\n\ntl;dr Last year in University and I have little motivation for school. I need to keep grades up to keep scholarship ( awarded an a semester basis) but no/little motivation to go to class/do classwork.\n\nHow do I stay motivated this year? What kept you going in college? Tips, tricks, suggestion?\n\n:)", "author": "MiserableStudy", "created": 1567483341, "retrieved": 1632848862, "over_18": false, "upvotes": 5, "upvote_ratio": 1.0, "comments": {"eyvtpi4": {"link": "/r/collegeadvice/comments/cyzs7g/last_year_of_uni_no_motivation/eyvtpi4/", "text": "I definitely hear you on lacking motivation for college. Heck, I’ve only jusy finished my first year and I’m already feeling it.\n\nI personally love looking forward to something—I love envisioning the future that I would like for myself for motivation in the present. I find that doing this really helps me stick it out longer. As always, YMMV.\n\nI also read that you’ve experienced some anxiety in regards to your classes? Or, at least the thought of them. I’m so sorry to hear that... I can only imagine what you’ve went through (or are still experiencing). It may not be much help, but I hope everything gets better for you.", "author": "52-hertzwhalien", "created": 1567511352, "upvotes": 3}}}