{"sid": "fgkung", "link": "/r/collegeadvice/comments/fgkung/are_student_loans_worth_it/", "title:": "Are student loans worth it?", "text": "Hey! I’m not sure if this is the right place to post this, but I figured I’d give it a shot. I (F20) am about to graduate from undergrad, and with the help of an amazing family and several scholarships, I have managed to finish in 3 years, debt free. I’m studying to be a Speech-Language Pathologist(SLP), and in order to work/be certified, it is necessary that I attend graduate school. I applied to several schools, and I got into my school of choice (University of Pittsburgh), which has a high ranking SLP program, and has more medical based classes (which is the setting I prefer), rather than school based classes. I also got into the grad program at my undergraduate university, which is a small liberal arts school less that 30 minutes from my home. This school has a good program too, but it has a much lower ranking, and is much more school based. The catch is, my undergraduate university offered me a $4,500 graduate assistantship (total tuition is $8,500 per academic year), and Pitt ( $32,000 per academic year) has so far not offered any money. I want to leave my hometown and go to a high ranking university that has classes I’m interested in, but would I be absolutely stupid to go into debt to do so?", "author": "studentindistressSLP", "created": 1583873531, "retrieved": 1632960122, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"fk6hjvn": {"link": "/r/collegeadvice/comments/fgkung/are_student_loans_worth_it/fk6hjvn/", "text": "That’s too expensive imo, don’t do it", "author": "SutherlandPhys", "created": 1583902360, "upvotes": 1}, "fk5yur7": {"link": "/r/collegeadvice/comments/fgkung/are_student_loans_worth_it/fk5yur7/", "text": "I’d say go cheaper option, but also I don’t know a lot about your field. In the end do what’s best, but I’m pretty stingy with money and HATE having any debts (even debts to friends annoy the hell outta me let alone this sands of dollars)", "author": "acidicship", "created": 1583890430, "upvotes": 1}}}