{"sid": "dsc74k", "link": "/r/collegeadvice/comments/dsc74k/confused_college_senior_help/", "title:": "Confused college senior, help!", "text": "\nI have a question or more like I want some advice from people that may have been in this situation or someone going through the same thing. I’m currently a senior in college, basically heading into my last semester. But a few days ago I finally came to the realization that I don’t really enjoy or like a lot of things about my major. To be fair, I’d been feeling like this for about a year now but it was too late to start something new and I don’t even know what it is I’d change to. Because of this I’ve adapted an “i don’t care” attitude towards my major and I don’t put as much effort into my classes, projects or anything related to it. My problem is so many people have found their passions and know exactly what they want to do with their lives and I feel like I don’t feel that strongly about anything. There are other subjects and majors I’ve liked but I’ve never felt the urge to pursue them any further either.  It’s just i don’t hate them but i don’t love them either. And now I feel like a disappointment because my parents have sacrificed everything in order for me to go to college so how am I supposed to tell them that I don’t want to use that anymore? Also, how will I know if I find something that I love so much that I want to wake up for the rest of my life and do that one thing? I’m honestly just so confused and I feel like I’m wasting my life and destroying it all at the same time. I’d appreciate any advice anyone can give.", "author": "boosclues-", "created": 1573020561, "retrieved": 1632960952, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"f6pq1wc": {"link": "/r/collegeadvice/comments/dsc74k/confused_college_senior_help/f6pq1wc/", "text": "[deleted]", "author": null, "created": 1573061814, "upvotes": 1}}}