{"sid": "fqs38o", "link": "/r/collegeadvice/comments/fqs38o/college_decision_advice/", "title:": "College decision advice!", "text": "I recently got admitted into plenty of great schools for engineering. However, I narrowed my list to two universities, the **University of Michigan** and **Columbia University**.\n\nWhat I like about Michigan is that it is has an excellent engineering program (better ranked than Columbia), great school spirit, and overall seems much more fun.\n\nOn the other hand, Columbia has a stronger \"wow\" factor than U of Michigan and it is  located in NYC, which I've always dreamed to live in. The core also interests me a bit.\n\nWhat I'm thinking is choosing Michigan to have a funner undergraduate experience, and then maybe consider applying to Columbia for graduate school. I really don't want to miss out on the experience these two schools will give me so I think this way I will experience the best of both. I am still undecided though.\n\nAny recommendations?\n\n[View Poll](https://www.reddit.com/poll/fqs38o)", "author": "Antique_Candle", "created": 1585428062, "retrieved": 1632848323, "over_18": false, "upvotes": 6, "upvote_ratio": 0.81, "comments": {"flsx4t8": {"link": "/r/collegeadvice/comments/fqs38o/college_decision_advice/flsx4t8/", "text": "Hi! I go to Umich and while I am not in the engineering program I have taken lots of stem classes and one of the drawbacks of michigan’s program is that it has become so highly ranked because it is extremely competitive and challenging. Some students thrive in the environment, however a big complaint is that engineering in the real world is typically a team effort, and some of the actual skills needed are lost in Michigan’s program. It is definitely a great school, but possibly something to consider. Best of luck!", "author": "olivia696942069", "created": 1585453074, "upvotes": 3}, "flrw4hm": {"link": "/r/collegeadvice/comments/fqs38o/college_decision_advice/flrw4hm/", "text": "How is your financial situation? Also keep in mind that ranking doesn’t mean much when it’s already in the top 20s and such. Columbia is located near a lot of really good companies too since it’s in NYC. I strongly recommend Columbia.", "author": "WpandaReddit", "created": 1585429108, "upvotes": 7}}}