{"sid": "azouuf", "link": "/r/collegeadvice/comments/azouuf/should_i_transfer_to_a_different_college_closer/", "title:": "Should I transfer to a different college closer to home?", "text": "**TLDR: I go to a commuter school far from home and I feel lonely. Should I give up the good program I'm in to go back home for school?**\n\n(Emphasis on *Commuter* and *Far From Home*. Also, sorry for the wall of text.)\n\nI am a Freshman in an accelerated Pharmacy Program on the East Coast. I've been wrestling with this idea for a lot of time recently and would like some advice for what I should do.\n\nFor starters, I am originally from California. Most of my extended family lives around the same area as me, so I tend to associate the two. When I was applying for colleges, I felt that I wanted something beyond California. I didn't want to feel like I never tried to explore beyond my home. Also, I considered my talents and influences, and figured that I wanted to become a Pharmacist.\n\nSo, once the acceptances and rejections came in, I decided that I would go to this university in New York with an accelerated Pharmacy program. Not only did it provide a direct path to a career, but it was also a big change from my normal settings. Further, I received more scholarships for that school than any others I applied to, making it essentially the same price I would pay to attend a UC. So, with a set career, big change that I wanted, and (relatively) a lot of money, what more could I ask for?\n\nWell, now that I am in my second semester as a Freshman, as well as the power of hindsight, I recognize some of the issues with my situation.\n\n**For one, the school I go to is a commuter school.** I failed to take this into account when I applied, but now I realize the issues this causes. Namely, it is much more difficult to create a social circle. I don't think that it's because it's a commuter school, but because it is a **commuter school in another state. Beyond school hours, campus is practically dead**, with little to no events besides the introductory freshman events and the like. It feels like everyone who goes here went to the same high schools or were even in the same friend groups before they went to college, and trying to join in on these groups feels awkward at best, and downright rude at worst. Further, any sense of party atmosphere is dominated by the frats which, frankly, I'm not into. There is the sense of exclusivity where you need to know the right people to go to these events. **Also, because of the commuter environment, a lot of people who do live on campus tend to go home on the weekends, increasing the lonely atmosphere that campus has.**\n\nI tried to remedy this by joining clubs, but I failed to get to know anyone beyond other freshmen who joined the club at the same time. I've made a couple of friends along the way, mostly through virtue of being in the same program or club, but nothing feels substantially close for me.\n\n**But, most of all, I feel homesick.** I love New York and being able to explore it on a vastly superior public transportation system is a nice bonus. But, the more I try to explore, the more alone I feel. It feels awkward trying to get to explore a place with someone who has lived there their whole life and is not even particularly close to you. I start to think more about home and all the friends and family I left to \"Do my own thing.\"\n\n**From here, I feel that I have two choices:**\n\n1. **Stick it out and hope the situation gets better**\n2. **Transfer out to another college**\n\n**I have reason to believe in Option 1 because it is the same thing that happened to me in High School.** I didn't truly have a reliable friend group until late into my Junior Year. I still talk with them and make the effort to hang out whenever I come back home. But, I still remember the first two and a half years of loneliness and fake-feeling friendships I had to deal with until I made it to that point. **Also, who's to say it'll work out like that again?**\n\n**Option 2 is a much riskier path, but the rewards I might reap are also much higher.** If I do transfer out, I feel that my best option might be one of the UCs. From what I observed during my college visits, the UCs tended to have more active campuses overall. Further, with a greater number of people coming from within the state, I have much more in common with the other students.\n\nThe greatest loss out of this option is transferring out of the accelerated Pharmacy Program. One of the benefits of being within the program is that I do not have to take the PCAT. If I were to transfer out, I would first have to apply to another major, graduate, and then take the PCAT and apply into another Pharmacy School. All this taking \\~8 years, whereas the current program is 6.\n\nAnother option is to attend UoP in Stockton, which also has multiple Pre-Pharmacy Programs. However, I am unsure of the exact details of how my credits would transfer (UoP has 2+3, 3+3, and 4+3 programs, whereas my current college is 0-6) or if I would even be allowed to apply to those programs. Further, UoP is also quite expensive, and I chose not to attend as I originally felt that I did not receive enough scholarships to justify attendance.\n\nPerhaps I could do a little of both - stick it out for my sophomore year and, if it still doesn't work out, transfer.\n\n**However, I can't help but hear this nagging notion that I'm simply conflating California and Comfort.** As a transfer, I feel that I would have just as hard a time with creating my social circle as I do now, simply because most friendships would have already been established. I feel this sense of awkwardness would be even greater if I tried to apply as a Junior for the same reasons. Further, perhaps it is not the environment I am in that is making it difficult, but my own shyness and personality.", "author": "ComradeSeaman", "created": 1552277891, "retrieved": 1632961553, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {}}