{"sid": "bg3426", "link": "/r/collegeadvice/comments/bg3426/should_i_transfer/", "title:": "Should I transfer?", "text": "Hello, \nI currently attend school at University of Iowa. I’m an accounting major with a pre-law track. And this is the situation: \n\nSENIOR YEAR HIGH SCHOOL: \nI was applying to schools, I didn’t score as high as I wanted because I didn’t put in the effort which I 100% regret. I know I could’ve scored higher. Anyways, I was originally a biomedical engineering major and I applied to multiple well known schools thinking I would get in no problem. My dream school Madison deferred/rejected me, my back up schools Purdue and Illinois rejected me. During the acceptance/rejection period, I was contemplating switching my major, and I did. To accounting and law, which is completely different and the schools above, I could have had a better chance of getting in. I was stressing. So I picked University of Iowa. It was a good business school and my brother loved it. However, the last time I was here was my freshman year of high school. But I picked it anyways. But I feel like I picked it for the wrong reasons, I thought i was going to be the party girl who drinks and has the typical college experience (which I didn’t do in high school). During the summer, before going to Iowa, I started second guessing my choice. \n\nFlash forward to my first semester:\nI was scared but excited at the same time for move in. I had my roommate lined up and we had been planning our room for months. A cute boy from my home Town was taking an interest in me and I was making friends and coming out of my shell..... but shit hit the fan. My roommate was turning into an alcoholic and I was always there to hold her back and to deal with her when she was on the edge of drunk and danger. She also started to bring her “different” energy into the dorm room making it some what uncomfortable for me and me dreading going back to my own room. I ended up moving out and she her mental health got incredibly worse. That’s point 1. Point 2: I moved out and moved across campus to a single, the girls on my floor were all older and never talked to me. My friends from the other dorm started to not talk to me as much and gravitated towards my old roommate. So I was really lacking in the social department and I stayed in most nights. \nPoint 3: the “party” girl I thought I was going to be (like my bro) turns out wasn’t something I wanted anymore. Going out and having fun every once in a while was appealing to me but not every day of every weekend and getting wasted and not remembering what I did the next day. \nPoint 4: I told my parents I wanted to transfer and my mom was understanding but my dad wasn’t. He was really upset I picked Iowa because he thought I could better and I think he knows me better than I think and that he knew Iowa wasn’t for me. So when I told him I wanted to transfer he said I should’ve listened to him and I had to finish the year out despite how much I hated it. He said if I really wanted to transfer I would have to wait a whole year and put effort into it. So that’s what I did \nDisclaimer: I was never really home sick, I never hated to go home to my parents and stay there I just wanted to be somewhere else. \n\nSecond semester: I got a boyfriend who was/is amazing and kept me at Iowa. My 2 friends from my old dorm started to reach out to me more. My grades started to go up and I did amazing on my 1st semester finals. I started to workout and fell in love with lifting and I made friends because of it. After winter break I was pretty excited to go back.... I joined a sorority which I think fit into. I signed a lease for an apartment and it’s looking up. However I still think about the next 3 years and I think to myself how I can’t wait to get it over with. If you don’t go to bars/parties and don’t have a car theres not much to do besides hang with friends, and again the friends I have now, are really nice but they all go out. Which I don’t mind but I still finding myself not wanting to go out as much. I still look at peoples pictures of them at college and see them having a lot of fun and wish I had that. I still wonder what it would have been like if I listened to my dad and reapplied to Wisconsin for business, or looked in the south. Or even followed through with my decision to switch schools. \n\nNow: second semester coming to a close, and the year is pretty much done. \nI keep telling myself it will be better next year when I have my own apartment with my friends. But I’m still kinda dreading it. I know I probably shouldn’t have signed the lease but I was trying so hard to make an effort and to join things like my sorority. Looking back I know I had to come to Iowa to realize what I wanted and who I really wanted to be. But I still feel so much of a disconnect and I never tell people to come look at Iowa. I tell people to look at Marquette or Madison. I keep telling myself it’s only 4 years it will go by fast and it’ll be over. And that’s what I told myself about high school and I regret it so much. \n\nSo my question is, given how good second semester was and my feelings, should I be feeling this way if I truly love Iowa? Should I transfer? I need opinions not the “do what your heart desires”, please and thank you", "author": "dgambino27", "created": 1555945331, "retrieved": 1632848978, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {}}