{"sid": "aj8a2w", "link": "/r/collegeadvice/comments/aj8a2w/do_i_need_a_lot_of_knowledge_about_computer/", "title:": "Do I need a lot of knowledge about computer science to pursue a degree in it?", "text": "I barely just started getting into coding. Reason being is that my mom thought I would like it (I’m autistic and enjoy hands on things *and* patterns/sequences) and I actually really do like it, at least what I have learned so far. I went to college for a year and dropped out due to depression and not being able to choose a major. My mom thinks it’s a good idea for me to pursue a degree in computer science so that I can have some sort of coding job after graduation, which I don’t disagree with. The only thing is that I barely have any knowledge on the subject. I know some basic html and a tiny bit of css. I learned it all through udemy and skillsuccess. My question is, will this hurt me once I start school? What I mean is, do I need to know more in order to start, or will I learn everything I need to know once I begin classes? I start a fully online program through SNHU in March.", "author": "MO-life-MO-problems", "created": 1548300905, "retrieved": 1632849342, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"eeuhx3h": {"link": "/r/collegeadvice/comments/aj8a2w/do_i_need_a_lot_of_knowledge_about_computer/eeuhx3h/", "text": "Of course not. People go to college to learn. Talk to your professors if you have any doubts. They will be happy to give you advice or recommend additional resources. ", "author": "ElevenMeow", "created": 1548341864, "upvotes": 2}, "eetnlsl": {"link": "/r/collegeadvice/comments/aj8a2w/do_i_need_a_lot_of_knowledge_about_computer/eetnlsl/", "text": "I haven't personally taken any programming classes, but my friends that are going for CS at OU say the classes start out REALLY easy and basic.  I cant say for sure if the SNHU will be the same, but I hope it helps nonetheless.", "author": "motoxsk8r", "created": 1548306193, "upvotes": 2}}}