{
  "sid": "9zqxzd",
  "link": "/r/collegeadvice/comments/9zqxzd/take_classes_for_a_minor_or_take_classes_for/",
  "title:": "Take classes for a minor, or take classes for skills?",
  "text": "Do you think it would be more appealing to grad schools and/or employers to take courses to learn computer science skills, or to take courses to get a math minor?\n\n&#x200B;\n\nA little background: I am a chemistry student with a business minor looking to go to grad school for materials science or engineering. I have room for some classes in my remaining semesters and was thinking of getting another minor in math (I would need differential equations, statistics, and linear algebra) for the engineering route. However, I was told that in order to do science, I should learn the basics of both statistics and computer science. If I took comp sci courses, I won't be able to get  the title of a math minor, but to be honest a basic stats course and some basic comp sci courses is more appealing than diff EQ and linear algebra, and because I think computer science would be extremely cool. I also imagine basic computer science courses are a little easier than 300 level math courses, but I'm not positive of that.",
  "author": "rex_tee",
  "created": 1542999291,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "eacpxss": {
      "link": "/r/collegeadvice/comments/9zqxzd/take_classes_for_a_minor_or_take_classes_for/eacpxss/",
      "text": "I always feel like you should learn what you want to do first, then pad the resume second. In close priority. If you know your going to use those computer skills, then take the classes! But if you just wana learn to learn then do it in your free time, and pad that resume. In the end though, especially in college, it a good chance to do what you want to do. Being that you want to take those com sci classes, you should take them! If anything, and you find you didnt like it as much as you thought you did, atleast you learned something worth knowing.",
      "author": "TotallynotaPS4Alt",
      "created": 1543056185,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634058382
}