{"sid": "flpabd", "link": "/r/collegeadvice/comments/flpabd/should_i_invest_in_a_phd_in_psychology/", "title:": "should i invest in a PhD in psychology?", "text": "Hello! My dream job is a criminal psychologist. Lots of personal experience and time has led me to this career so it really would mean the world to me. The thing is, if I go for a PhD- that’s a lot of money! I’m upper middle class, so I have a huge advantage- but i can’t live on this “daddy’s money” concept forever. Basically i’m stuck at what i should aim for. Money is the top priority but I surely don’t wanna hate what I do if I can avoid that. I get A’s and B’s and consider myself to have a strong work ethic- but is it worth the risk of massive debt? I can’t decide..", "author": "sunnyjeffries", "created": 1584681130, "retrieved": 1632848326, "over_18": false, "upvotes": 7, "upvote_ratio": 1.0, "comments": {"fl2r15g": {"link": "/r/collegeadvice/comments/flpabd/should_i_invest_in_a_phd_in_psychology/fl2r15g/", "text": "My uncle was a criminal psychologist (I think that was his title, a common part of his job was determining if convicts are fine to be released)(he's retired now) from my encounters with him he said he got his masters and then was asked to go back to school (I believe more than once). I believe none of his schooling was paid for, which includes the time he was working and attending school. I think he got a reduced college rate, because he is handicapped so if you have to pay off the college debt a PhD may be a bit much at the start (they may ask you to go back to school a few years after starting work anyway so spacing it may make it easier financially on you; however going back to school has its drawbacks too).", "author": "IICrimson_DaggerII", "created": 1584757725, "upvotes": 1}, "fl22t4c": {"link": "/r/collegeadvice/comments/flpabd/should_i_invest_in_a_phd_in_psychology/fl22t4c/", "text": "Im gonna suggest no if you don’t have any or a good amount for financial aid. Everyone says that it really sucks to have to pay off debt. Some of my friends went to at least work for a while so that they can pursue a PHD without debt or little debt", "author": "WpandaReddit", "created": 1584741666, "upvotes": 1}}}