{
  "sid": "ejaazc",
  "link": "/r/collegeadvice/comments/ejaazc/so_i_really_messed_up/",
  "title:": "So I really messed up",
  "text": "So I basically flunked out. I put what I had into my first semester. It may sound unbelievable but I actually put effort into my classes. I was majoring in Chem and at the moment I have a gpa of .71. I really messed up. I have a meeting with my advisor tomorrow. I want to change my major to Psy but I really don’t see the point. My scholarship renews at the end of the academic year and I have to have at least a 2.5 cumulative to keep it and even if I make a 4.0 this semester it won’t be good enough. I’m stuck at a wall. Help?",
  "author": "MeaganGlasgow",
  "created": 1578026294,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "fcxd1ep": {
      "link": "/r/collegeadvice/comments/ejaazc/so_i_really_messed_up/fcxd1ep/",
      "text": "It's awesome that you put effort into your classes, but i feel for you even thought it's not getting you the results you want. If i might suggest, look up Ali Abdaal on YouTube. He has quite a good track record of videos on studying methods, how to put in more effort, and generally helpful study videos. But yeah, you need to find some method that makes the effort you put into the work effective. There is a ton of information regarding that, and the best advice i can give is go wild with it, and see what works for you :).  \n\nIf you don't mind my asking, what do you think is the holding you against the wall as you put it. What is it that you are struggling with that keeps you from progressing, is it the study methods, that i suggested to improve, or something else :)?",
      "author": "LifeyLemon",
      "created": 1578059624,
      "upvotes": 1,
      "replies": {}
    },
    "fcwpp33": {
      "link": "/r/collegeadvice/comments/ejaazc/so_i_really_messed_up/fcwpp33/",
      "text": "Try to make a 4.0 this semester. That’s your best bet.",
      "author": "bloomingg--",
      "created": 1578032841,
      "upvotes": 2,
      "replies": {}
    }
  },
  "updated": 1634057833
}