{"sid": "dp9tp7", "link": "/r/collegeadvice/comments/dp9tp7/i_think_ive_royally_screwed_my_grades_for_the/", "title:": "I think I've royally screwed my grades for the semester, and I need some advice.", "text": "So some context, I'm 19. I'm a freshman at FGCU in South Florida, and this is my first semester. I didn't have the best study habits in high school, and I haven't made the best choices so far this semester either. I'm a horrible procrastinator. So, I currently am attending school on the Bright Futures scholarship, which covers my tuition, but I still pay for housing and food. If I lose this scholarship, I may have to drop out because there's no way my parents and I could afford it without taking out an ass load of loans. I'm currently taking Intro to Literature, Intro to Statistics, Intro to Film, and Enviromental Science. Not a super heavy load, it's 12 credits. Yet somehow I've managed to put myself in a very bad situation. I'll admit that I have problems, I have pretty bad social anxiety, I'm bad at time management, and overall haven't had the best judgement in terms of my actions. Right now, I have a 66.6% in Env. Science, a 64.8% in Lit, a 65% in Statistics, and my Film teacher doesn't really post grades, but I think I have a somewhat decent grade for that class. I'm willing to do whatever I can to salvage this situation, because I can absolutely not lose this scholarship. I need a 3.0 GPA to renew my scholarship at the end of the semester. Please, any advice I'll take. I'm kinda freaking out and I can't think straight on my own.", "author": "jwaller232", "created": 1572456552, "retrieved": 1632848791, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"f62or24": {"link": "/r/collegeadvice/comments/dp9tp7/i_think_ive_royally_screwed_my_grades_for_the/f62or24/", "text": "Pm your stats problems op I shall explain the concepts mainly because I am a SI or Tutor for stats I am aware of how bad teachers are at explain because they literally over explain everything when all you need is the formula and translating it", "author": null, "created": 1572664089, "upvotes": 1}, "f5y2e4i": {"link": "/r/collegeadvice/comments/dp9tp7/i_think_ive_royally_screwed_my_grades_for_the/f5y2e4i/", "text": "These are a few study tips I’ve found useful (when I could focus) and I think they help you best in the long run;\n\nWhen you’re reading a textbook, read a paragraph, close the book, and think about what it is you have just read. Ask questions about it, try to answer them, explore the idea in your head. When you’re stuck open the book again, read and keep going like this. This helps develop understanding, with less reliance on memory. Remember, if you find something difficult, then you’re learning it, so don’t panic if it feels tough.\n\nAnother thing is spacial retention; try and review something ONLY right when you’re about to forget it. Do this again and again, increasing the time you give yourself to forget it. This puts it into your long term memory. The best way to review something is by doing practice problems. Working through the problem rather than just reading something over and over is a better way of learning.\n\nDo past papers, flashcards work too, test yourself. These are better ways to study. Hope it helps, and if it’s  difficult, then it’s working.", "author": "highschoolshthead", "created": 1572549813, "upvotes": 2}, "f5u548o": {"link": "/r/collegeadvice/comments/dp9tp7/i_think_ive_royally_screwed_my_grades_for_the/f5u548o/", "text": "There is still time to bring your grades up. Review your notes daily and record the lectures, this helped me get myself together. I record lecture and relisten to it while going along with my notes/slides if your professor posts them. Start giving it your all now and it’ll be worth it. Even if you bring them up to C’s. Most colleges allow a probation semester(at least mine does) where if you drop below a 3.0 you have another semester to bring it back up. Good luck and keep your head up!", "author": "Pimpsonian", "created": 1572468600, "upvotes": 1}}}