{"sid": "f5jjb4", "link": "/r/collegeadvice/comments/f5jjb4/20m_and_recovering_from_prk_laser_eye_surgery/", "title:": "20M and Recovering from PRK Laser Eye Surgery", "text": "So I got laser eye surgery in the middle of spring semester, and I’m beginning to think it may have been a terrible mistake as far as my academics. \nPRK is an alternative to Lasik for people with thin corneas, where they dissolve the cornea with a solution and then perform the laser surgery, allowing a new cornea to grow in the old one’s place. Before getting the surgery, I had been told by my doctor that the recovery period from PRK is about 5 days. It’s not. The actual recovery takes 2 weeks to a full month before vision is functionally restored. \nI had planned to do PRK and recover over the long weekend, heading back to classes on Tuesday. However, I can hardly see text on my phone, and I’m definitely not ready to be driving yet. I didn’t make plans to be out of commission academically for up to a month, and I’m not sure what I can do to help the situation.", "author": "924ths", "created": 1581989053, "retrieved": 1632848334, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"fi097ht": {"link": "/r/collegeadvice/comments/f5jjb4/20m_and_recovering_from_prk_laser_eye_surgery/fi097ht/", "text": "Talk to your professors, show them documentation and see if they will work with you. If not look for an exception to enrollment policy if its bad enough to considering withdrawing for the semester. Some school allow this for medical reasons, not sure if it would apply for an elective procedure though.", "author": "drock13", "created": 1582030781, "upvotes": 1}, "fhzjpzs": {"link": "/r/collegeadvice/comments/f5jjb4/20m_and_recovering_from_prk_laser_eye_surgery/fhzjpzs/", "text": "#Tell your professors what’s going on and I’m sure they can cut you some slack as far as assignments and exams and such.", "author": "stefanfolk", "created": 1582001429, "upvotes": 2}}}