{"sid": "e179id", "link": "/r/collegeadvice/comments/e179id/ive_been_having_an_onoff_identity_crisis_since/", "title:": "I've been having an on/off identity(?) crisis since the start of my freshman year", "text": "Kinda long, tldr at the bottom. Sorry if the formatting is off. \n\n\nHi all, so I am a current freshman who is ending the fall semester here in a few weeks. I started out as a Design major and applied to the art and design school here, which is a pretty big deal with alumni and others who have come out of the school. We have great facilities, good opportunities, and I thought that Visual Communication Design was perfect for me as a major. However, after literally my first week of college, I wanted to switch my major to Video Production at another school on campus. I had thought about taking the media route ever since I had my orientation, but after that first week 2 out of my 6 just hit the final nail on the coffin and I made the decision then and there. However, I was told that I wasn't able to switch schools without complications, missing already had class time, not getting a full classes refund (which was, in my opinion, kinda BS). \n\n\nSo, I've been sticking it out in art school while I patiently wait for the end of the semester when I get to start to dip my feet into the field I know is for me. \n\n\nHowever, I'm currently fighting myself on if my current university is even the right one for me. \n\n\nMy dad recently suggested that another university, one where a LOT of my graduating class currently attends, would be a better fit for me because of the field I want to switch to (mainly broadcasting or media/telecomm I guess) because when him and I went on our visit there, it was very impressive and visiting there was actually the turning point in my decision to switch to studying something in communication instead of music ed. Everything was great, with their own radio shows, technology, and it was all funded by a donation from a famous media personality donated to their telecomm program and it is very renowned with nice facilities. I've looked at their programs that I'm interested in, but am still trying to weigh my pros and cons. \n\n\nNow, as I'm sitting on my futon in my apartment, I'm so confused with myself or what I wanna do with the rest of my life. I wanna do what I want, but also earn money, yet also be happy, and everything feels very overwhelming and as if I am being indecisive even more than I usually am. \n\n\nSince I started college, it was a hard transition for me, like it is for a lot of other people. I've also been feeling like I don't fit in anywhere (besides my friend groups) or that I can't find/haven't found my niche yet. In high school, I was one of the top band kids. I did everything music-related and was involved for almost 8 years and everyone knew as the band kid. It was my entire world and my whole life revolved around the activities I was in. But since graduating, my soul is lost and i just feel overwhelmed and like I'm doubting everything I do. \n\n\nThe university I have looked at has a lot of people I knew in highschool and part of me is hesitant to even inquire about the majors there. I don't want to see anyone from my high school, and one of my teachers even gave us the piece of advice of, \"Don't attend a college with people you graduated with.\" Imo, I took that to heart, and now I might be regretting it. \n\n\nI just feel like my head is swirling with pros and cons and what ifs and I feel like I'm having a never ending identity crisis, or at least some sort of crisis. Is there anyone who feels like this or has felt like this? Of so what did you do to get through this? \n\n\n\n\nTL;DR - I'm having an identity crisis about what I wanna do for the rest of my life, wanna switch schools but other school has people I graduated with, don't wanna see them + current school is located in a place of more opportunities. What do I do to help myself without making any bad decisions?", "author": "designedmess", "created": 1574639914, "retrieved": 1632848754, "over_18": false, "upvotes": 1, "upvote_ratio": 1.0, "comments": {"f9i5kic": {"link": "/r/collegeadvice/comments/e179id/ive_been_having_an_onoff_identity_crisis_since/f9i5kic/", "text": "Wow I have been having a lot of the same feelings you are! I'm a freshman in college and just finishing the first semester. It's been the toughest transition of my life and I question my goals and identity almost on the daily. I know this seems dramatic but when you are trying to figure out who you are and what you even want to major in these thoughts come to mind. I have switched my major twice already, looked at other universities, and now I'm considering taking time off to think about what I really want to do. I don't want to continue paying for college if I'm not even happy here and don't know what I'm majoring in. I decided I want to go volunteer abroad for a couple months and hopefully \"find myself\" or at least gain a new perspective that will help me make my career decision. Sorry that doesn't give any advice but at least you know someone else is feeling the same way.", "author": "Emoexistentialist24", "created": 1575328802, "upvotes": 1}}}