{"sid": "fbe7ir", "link": "/r/collegeadvice/comments/fbe7ir/sad_to_leave_my_family/", "title:": "Sad to leave my family", "text": "Hello!! \n\nI am a high school senior who is struggling to pick what college I want to go to (Shocker I know). I recently heard back from my last college and learned that I have been accepted to the University of Florida. I also applied and was accepted into Clemson University and the University of Arizona. I am currently debating between Florida and Arizona. \n\nI was born in Tampa, Florida and lived there until 2011, when my family moved to Arizona. I have been living in Scottsdale ever since. Also, I have 4 sets of grandparents and some family friends who all live in Florida, so they would be my major support set if I chose to attend UF. \n\nI have always been very strong-willed and independent when it comes to my family and relying on them. Prior to my senior year, I always said that I wanted to go to Florida for college, and I would know where I was going as soon as I found out if I got accepted or not. \n\nHowever, now I am not so sure on my mindset. I am struggling to decide whether I should stick with my original instincts and go to Florida to become even more independent and throw myself into situations that are outside of my comfort zone, or if I should go to Arizona and be close to my family. \n\nI have tried to make a pro and con list, but I honestly value the same things in both colleges. They are both good schools and have great engineering programs. I can do activities like rush or join club lacrosse at either school. The only factor I can’t decide on is the distance from my family.\n\nMy sister is a freshman at the University of Arizona. My mom has made the point to me that although I will come back a few times for holidays if I’m at Florida, I won’t come back as regularly as I would if I was at Arizona. My sister is only two hours away, so she often comes down for weekends. I wouldn’t have that luxury. \n\nI also am afraid of missing out on memories and family time. As I’ve gotten older I’ve gotten a closer with my family (we’ve always been close but now just closer), and I’ve started to appreciate my family and the time I spend with them more. I know that if I go to Florida I will be missing out on time spent with them, especially time where my sister is back home, and I am still in Florida.\n\nIf anyone has any advice on what I should do or what they did when in my situation, it would be greatly appreciated! \n\nThank you!!!", "author": "lpenoyer", "created": 1582990803, "retrieved": 1632960346, "over_18": false, "upvotes": 6, "upvote_ratio": 1.0, "comments": {"fj4ljc5": {"link": "/r/collegeadvice/comments/fbe7ir/sad_to_leave_my_family/fj4ljc5/", "text": "I'd say go to Arizona because from what I see, they both have equal advantages and you still get independence plus you get to be with your fam whenever you want, when you're homesick, its just 2 hours away. You get the best of both worlds at Arizona.", "author": "impulsexer002", "created": 1583011076, "upvotes": 1}}}