{"sid": "c5pj7z", "link": "/r/collegeadvice/comments/c5pj7z/what_class_to_pick_dilemma_for_senior_year_high/", "title:": "What class to pick dilemma for senior year high school", "text": "Current junior moving on to senior year. Planning on majoring in biology and my current schedule next year includes honors physics and regular calculus. I am able to take honors calc but doing so would make it impossible for me to be in choir due to scheduling conflicts. Choir is also regarded as a honors class which is one of the few extra curriculars I have been a part of since my freshman year and have a position in. Currently my parents want me to take honors calc and drop choir because they think it would look a lot better to colleges that I picked honors calc. I really enjoy choir and my friends in there but what should I do. Would this really be helpful in getting into college?\n\nEdit: thanks for the advice everyone! I was able to convince my parents to let me keep choir :)", "author": "roxas4988", "created": 1561554045, "retrieved": 1632960996, "over_18": false, "upvotes": 2, "upvote_ratio": 1.0, "comments": {"euestet": {"link": "/r/collegeadvice/comments/c5pj7z/what_class_to_pick_dilemma_for_senior_year_high/euestet/", "text": "Hey there! I had a similar situation and lemme tell you something- calculus is VERY HARD no matter what level you take it at. Schools will look at your choice to take calc in general as a great undertaking. \nAnd just remember- good grades get you considered, but extracurriculars get you accepted. Keep choir, keep making music!", "author": "sweetteasnake", "created": 1563752960, "upvotes": 1}, "et72s3r": {"link": "/r/collegeadvice/comments/c5pj7z/what_class_to_pick_dilemma_for_senior_year_high/et72s3r/", "text": "I think you should stick with choir, it's good to have a mix/balance of classes, especially if you have been in it since freshman yr. If you plan to major in biology, calc is not really as necessary as it could be, so regular calc is probably not going to hurt your chances of getting into colleges in any way.", "author": "SushiAA", "created": 1562523553, "upvotes": 1}, "es3iopw": {"link": "/r/collegeadvice/comments/c5pj7z/what_class_to_pick_dilemma_for_senior_year_high/es3iopw/", "text": "Believe it or not, colleges look at more than if you took the hardest classes your school offers. They look at a combination of how well you did in the difficulty of classes you had, and they want to see that you have an overall good GPA. You should look at the averages for the schools you’re applying to and see if you’re on track. \n\nColleges will also like that you’re a more well-rounded person, taking choir and doing other things that you enjoy. Diversify yourself and do what you enjoy because you won’t always have the opportunity to sing in a choir!", "author": null, "created": 1561563447, "upvotes": 1}}}