{"sid": "bi34k8", "link": "/r/collegeadvice/comments/bi34k8/i_recently_dropped_out_of_highschool_and_got_my/", "title:": "I recently dropped out of highschool and got my GED. I don’t know what to do next.", "text": "I recently got my GED and now I have no clue what to do with my life. I have always wanted to go into the medical field but I honestly don’t know if I’m smart enough. Any advice helps. Thank you!", "author": "corydbbs", "created": 1556396244, "retrieved": 1632848975, "over_18": false, "upvotes": 3, "upvote_ratio": 1.0, "comments": {"emjaky7": {"link": "/r/collegeadvice/comments/bi34k8/i_recently_dropped_out_of_highschool_and_got_my/emjaky7/", "text": "I would start by thinking about what type of job you would want to have in the medical field, and what level you would eventually want to achieve. Would you want to become a doctor? Or a nurse? Years of education for each would differ, as well as costs. I would recommend starting by researching careers online to get a better idea of your options. Check out the Bureau of Labor Statistics ([bls.gov](https://bls.gov)) and search some jobs, and do a basic google search too. Ask yourself what kind of life you would like to have too - what you would want in terms of free time, time to spend with family, what type of work you would want to be doing, etc. Good luck!", "author": "writingoreos", "created": 1557024006, "upvotes": 1}, "elzhyr7": {"link": "/r/collegeadvice/comments/bi34k8/i_recently_dropped_out_of_highschool_and_got_my/elzhyr7/", "text": "Check out local community colleges near you. They get a bad rap, but as long as they are accredited they’re honestly a great starting point. Open admissions, low cost, and transferable credits. Today is actually my 1 year anniversary of graduating with my bachelors and I started out at my local community college. I work in higher ed now, and I would not consider myself the sharpest tool in the shed. College isn’t a measure of intelligence- it’s a measure of hard work. Finding the niche you fit in and thriving in your classes/line of work  is totally possible.", "author": "alifabulousi", "created": 1556464149, "upvotes": 1}}}