{
  "sid": "i7ht3r",
  "link": "/r/Emory/comments/i7ht3r/do_you_guys_think_my_schedule_is_manageable/",
  "title:": "Do you guys think my schedule is manageable?",
  "text": "I'm pre-health and wasn't sure on whether or not I should have doubled up on sciences (bio and chem), so I decided to take some GERs instead. I have Reyes for bio, Scott for sociology, Nasrini for psych, Bell for fsem, and Cole for bio lab. Does this seem too easy/hard? My schedule looks like this:\n\n&#x200B;\n\nhttps://preview.redd.it/3x8z99sju9g51.png?width=965&format=png&auto=webp&s=8e311e6d2193039b3673c27dfc01164f9d8b1a31\n\nNote: I wanna switch to Roode for bio and I want to get Yancy for philosophy.",
  "author": "janitorialkeys",
  "created": 1597107301,
  "updated": 1634099234,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "g122n1l": {
      "link": "/r/Emory/comments/i7ht3r/do_you_guys_think_my_schedule_is_manageable/g122n1l/",
      "text": "I've taken all of these classes except the seminar, and while I've had different professors, no this is not too difficult of a schedule - it looks very appropriate for taking care of pre-health requirements early on if that's the one thing you know you want to do while also exploring a wide range of subjects (rather than just sciences like doubling up bio and chem). Sociology and psyc 110 won't have any overlap in material if you were worried about that - psyc 110 is a lot more neuroscience-focused. Both are great classes. I dont know what the philosophy seminar is but I've only heard/experienced good things from the philosophy department, and freshman seminars don't tend to be too difficult. One thing to note there is if you switch into a different \"section\" of PHIL 190 with a different professor, it will be an entirely different course - make sure you don't end up in a seminar you're less interested in by doing that. I did have De Roode for BIOL 141 - I would recommend him as well, he's a very nice and knowledgeable man. You should do well with this schedule (and hopefully enjoy it). Best of luck with the semester!",
      "author": "ruhdolph",
      "created": 1597109666,
      "upvotes": 7,
      "replies": {
        "g129ggp": {
          "link": "/r/Emory/comments/i7ht3r/do_you_guys_think_my_schedule_is_manageable/g129ggp/",
          "text": "Cool, thank you! This makes me feel a lot more confident in my schedule :)",
          "author": "janitorialkeys",
          "created": 1597113516,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  }
}