{
  "sid": "mmrz9s",
  "link": "/r/Emory/comments/mmrz9s/chem_203_professor/",
  "title:": "Chem 203 Professor",
  "text": "I'm in-between either Heemstra or  Weinschenk . I'm a chem major and really enjoy it, but I also don't want to die. I've heard you learn more from  Weinschenk but that the course load is a lot. Any reviews on them/how are their teaching methods?",
  "author": "Automatic-Star1997",
  "created": 1617889098,
  "updated": 1634098579,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "gttdsai": {
      "link": "/r/Emory/comments/mmrz9s/chem_203_professor/gttdsai/",
      "text": "Is there any reason Soria is out of the running? As a chem major who will take electives, he and Weinschenk are your best options in terms of added value and preparation for any biochem/chem bio electives or further ochem electives(and they are just lots of fun and AMAZING mentors that you get to take again in upper divisions.  Heemstra doesn't teach any upper divisions afaik), and honestly the level of in person instruction by any of these people is much higher and trust me you'll want the best possible foundation for when all the upper divisions migrate back to in person.  \n\nWhat else are you taking that concerns you about Weinschenk at least (BTW, the main difference with him and Soria is not only the higher level learning, but additional support/comraderie generated by the classes and the fact that their class sessions are more interactive even in an online environment.  They'll learn all names and call on students or let them volunteer answers and guide a discussion versus just sit or stand and talk the whole time/use powerpoint slides. It is a far richer experience that way and probably why, even if they taught in less depth, students would still learn more. I hear Heemstra is a very solid lecturer but Soria and Weinschenk are Emory classics and definitely are more unique to an Emory experience. I doubt you'd encounter sophomore chem profs like them at many other high caliber schools even)?  Maybe the instructors for the other courses are actually not so bad for these other classes(I don't know your other major/track though. Could be something wild like QTM) and you can manage.  BTW, Weinschenk's tests during Covid are FAR less intensive than normal. Maybe he'll adjust them back because people will be back on campus and have all the necessary social and learning infrastructure that comes with it but if it is even in between normal and Covid, it is totally doable.",
      "author": "oldeaglenewute2022",
      "created": 1617893299,
      "upvotes": 2,
      "replies": {
        "gty70gu": {
          "link": "/r/Emory/comments/mmrz9s/chem_203_professor/gty70gu/",
          "text": "Have you seen the Soria is my shepherd review on RMP?",
          "author": "iapetus3141",
          "created": 1617987312,
          "upvotes": 1,
          "replies": {
            "gty8na4": {
              "link": "/r/Emory/comments/mmrz9s/chem_203_professor/gty8na4/",
              "text": "I just saw that! Thanks! Needed that laugh but he deserves it. Definitely an underappreciated instructor who inspired a lot of the pedagogical changes you see amongst the best profs in gchem for example. Plus he's had quite the track record setting up people for major scholarships (like Goldwater) and grant based fellowships like NSF. He's an amazing teacher and mentor even if he can be a tough cookie if you piss him off/have a bad attitude about learning in his classes.",
              "author": "oldeaglenewute2022",
              "created": 1617988015,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gtte8b5": {
      "link": "/r/Emory/comments/mmrz9s/chem_203_professor/gtte8b5/",
      "text": "I had Heemstra for 203/204 and thought he was a great prof! I can't comment on Weinschenk, but I thought Heemstra's class was really informative and enagaing. The class was definitely difficult, but if you kept up with the material, it wasn't too overwhelming. If you have specific questions feel free to PM me.",
      "author": "Vengeful_Armadillo",
      "created": 1617893497,
      "upvotes": 2,
      "replies": {}
    },
    "gttq8vr": {
      "link": "/r/Emory/comments/mmrz9s/chem_203_professor/gttq8vr/",
      "text": "I am a chem major as well, and had Weinschenk for 203 and again now for 204. He is a fantastic lecturer and person, but his class is definitely challenging. I’ll take any course he teaches at this point LOL. PM me for more details!",
      "author": "j11234567890",
      "created": 1617898663,
      "upvotes": 1,
      "replies": {}
    }
  }
}