{
  "sid": "o2800w",
  "link": "/r/Emory/comments/o2800w/conservative_professors/",
  "title:": "Conservative professors",
  "text": "Let me just preface this by saying I don't really mind who is teaching and I most likely am not putting this the right way but I have a genuine question. I have taken many courses taught by liberal teachers/profs who pushed their political leanings on the class. I am sure that this may be the case sometimes at every top uni but I would like to get a variety and take some classes with conservative professors lol. As an incoming student, hoping to expand my knowledge at uni and be more open-minded, I'm just wondering if you know of any and maybe you could pm me their names and what course they teach and how you enjoyed it. Thanks!",
  "author": "dewberryfairy",
  "created": 1623964315,
  "updated": 1634097954,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.7,
  "comments": {
    "h256cfj": {
      "link": "/r/Emory/comments/o2800w/conservative_professors/h256cfj/",
      "text": "Most professors, especially if politics aren't relevant to their subject and they lean right, hold their views close to the chest. As a cohort professor at Emory and peer institutions are very progressive. But their are outliers. For example, Keith Berland in the physics dep is thought to be moderate - lean right, but obviously it wouldn't come out in his teaching. Frank Lechner teaches a class on the sociology of conservatism and leans right himself.\n\nThat said, campaign contributions are public information that anyone can dig into on the FEC's website... If someone gave to the purdue campaign, trump campaign, RNC, Winred, etc you can surmise they're pretty passionate conservatives. A quick search there showed me Guy M. Benian (Laney), Roy Sutliff (Medicine), John Petros (Medicine), Roy Sutliff (Medicine), Gerald Rodts (Medicine), Stephen Stuk (Goizueta) and Greg Waymire (Goizueta) are also on the right. Also, a nice reflection of the stats that show PhD are more associated than professional degrees with progressive views.",
      "author": "FlowersBloomUntil",
      "created": 1623968302,
      "upvotes": 24,
      "replies": {}
    },
    "h24zsy4": {
      "link": "/r/Emory/comments/o2800w/conservative_professors/h24zsy4/",
      "text": "Most profs at Emory do a good job at keeping their political tastes outside of their work (as good professors should). I haven’t found openly liberal nor conservative profs, they sort of just give you the info and let you come to the conclusion. But I have a relatively small sample size",
      "author": "SupahWalrus",
      "created": 1623965212,
      "upvotes": 11,
      "replies": {
        "h25gbpu": {
          "link": "/r/Emory/comments/o2800w/conservative_professors/h25gbpu/",
          "text": "There absolutely are openly liberal professors",
          "author": "iapetus3141",
          "created": 1623973380,
          "upvotes": 9,
          "replies": {
            "h25ibck": {
              "link": "/r/Emory/comments/o2800w/conservative_professors/h25ibck/",
              "text": "Yeah I figure there were. At least for the classes I’ve been, politics were either avoided or given through multiple lenses",
              "author": "SupahWalrus",
              "created": 1623974438,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h250siu": {
          "link": "/r/Emory/comments/o2800w/conservative_professors/h250siu/",
          "text": "thanks for your reply. thats good to hear!",
          "author": "dewberryfairy",
          "created": 1623965667,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h25u3hz": {
      "link": "/r/Emory/comments/o2800w/conservative_professors/h25u3hz/",
      "text": "Dr. Lechner in the sociology dept is conservative, but I (a leftist sociology major) took his course this past fall and really enjoyed it, as did other left-leaning friends of mine. He is teaching a freshman seminar on the sociology of conservatism which is usually a popular course. Sounds like something you might be interested in",
      "author": "aripickles",
      "created": 1623980777,
      "upvotes": 7,
      "replies": {}
    },
    "h25q4vc": {
      "link": "/r/Emory/comments/o2800w/conservative_professors/h25q4vc/",
      "text": "The best lecturers I've had at Emory are always the ones who teach without bias and make it very hard for me to tell what their position on the subject is.\n\nDr. Dan Reiter of the PolSci department is a great example.",
      "author": "Dr_Yankee",
      "created": 1623978645,
      "upvotes": 5,
      "replies": {}
    },
    "h25efla": {
      "link": "/r/Emory/comments/o2800w/conservative_professors/h25efla/",
      "text": "I don't know about Emory, but from my experience as an incoming international freshman, every single professor who taught me (in multiple states, with different demographics and different backgrounds) has mentioned Republicans in a bad way, portraying liberalism as the truest ideology a student should conceive (remember that those professors' main audience are international, so this probably isn't the case for a mainly American audience). With the exception being a professor who was openly conservative, he took his part in shoving politics up our throats too though lol. \n\nI genuinely hope that this will not be the case at Emory, but I'm doubtful. This of course is solely my experience. While it only represents mine, it seems a bid odd that all of my previous instructors/professors have done the same thing in explicitly and/or indirectly favoring one side over the other.",
      "author": "Utter-Confusion",
      "created": 1623972389,
      "upvotes": 3,
      "replies": {}
    }
  }
}