{
  "sid": "mmshnm",
  "link": "/r/Emory/comments/mmshnm/whats_mock_trial_at_emory_like/",
  "title:": "What's mock trial at Emory like?",
  "text": "I'm an incoming freshman who plans to go down the pre-law track and is considering mock trial. I also did mock trial in hs. What is mock trial at Emory like?",
  "author": "TTMoon55",
  "created": 1617890610,
  "updated": 1634098577,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "gu4hh3k": {
      "link": "/r/Emory/comments/mmshnm/whats_mock_trial_at_emory_like/gu4hh3k/",
      "text": "I’m on the executive board of the team so I just want to say that it’s fantastic! The best decision I ever made was trying out. We’re a very successful team—actually sending two teams to Nationals next weekend.",
      "author": "sdelace",
      "created": 1618121882,
      "upvotes": 3,
      "replies": {
        "gu4ia64": {
          "link": "/r/Emory/comments/mmshnm/whats_mock_trial_at_emory_like/gu4ia64/",
          "text": "Thanks for the response, and wow, that's amazing! I heard only a few schools got to do that this year. I'm also wondering what the time commitment is like? And, how do tryouts work? Like who decides what team you are placed on?",
          "author": "TTMoon55",
          "created": 1618122584,
          "upvotes": 1,
          "replies": {
            "gu873hp": {
              "link": "/r/Emory/comments/mmshnm/whats_mock_trial_at_emory_like/gu873hp/",
              "text": "The whole Executive Board watches tryouts at the beginning of the fall semester—anyone is welcome to come try out the first round, then we invite specific people back for a second round of callbacks. \n\nThe team competes in a fall invitational season and a spring competitive season. In the fall, we have three teams which aren’t stacked into A B and C teams—they’re just based on availability for tournament dates. In the spring, the Executive Board makes stacking decisions based on member performance/roles needed on each team, etc....We don’t have a coach. \n\nAs for the time commitment, I won’t lie it’s a lot...fall season starts out with practice usually 2x per week but it ramps up quite a bit as the year progresses. However, I will say that it doesn’t feel like work to me—I love every minute of being on this team, and we’re one of the most successful organizations at Emory (#10 in the country). \n\nHope that answers your questions! :)",
              "author": "sdelace",
              "created": 1618207356,
              "upvotes": 3,
              "replies": {
                "gu9z676": {
                  "link": "/r/Emory/comments/mmshnm/whats_mock_trial_at_emory_like/gu9z676/",
                  "text": "Thank you! That was super helpful!! :)",
                  "author": "TTMoon55",
                  "created": 1618248790,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}