{
  "sid": "j4kpgp",
  "link": "/r/Emory/comments/j4kpgp/moving_to_atlanta_from_california_advice/",
  "title:": "MOVING TO ATLANTA FROM CALIFORNIA [ADVICE]",
  "text": "Hi,\n\nI started my masters program at Emory this year but I have been completely online due to COVID. I am working remotely/saving money living at home in Los Angeles but I found an apartment I like for 800 per month . We have gotten the month of November free due to a leasing special.\n\nGiven the circumstances, we will only be taking two classes in person. Also, I will be working at the CDC in October, and that is expected to be in person during the spring semester (coming into the office once or twice a week).\n\nI am super conflicted on if paying rent at the moment is worth it? I don't want to miss a semester of opportunities because my program is only one year (ends in the summer). Also, I'm receiving little to no financial help from my parents. Everything will be covered by me/scholarships. I have saved \\~20k and I have money in the stock market/Roth IRA. Additionally, picking up and moving seems like it'll be difficult to do at the moment given my intense class schedule.\n\nMy plan B is to move the first week of December when classes are over but I'd loose this apartment opportunity with a solid roommate.\n\nWhat would you do? Any advice would be greatly appreciated.\n\nThank you!",
  "author": "nicolejohnson2468",
  "created": 1601751735,
  "updated": 1634099024,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "g7jvhl8": {
      "link": "/r/Emory/comments/j4kpgp/moving_to_atlanta_from_california_advice/g7jvhl8/",
      "text": "What area are you looking at moving to?  Im from Atlanta but live in LA and I can describe what a common LA neighborhood would be.  $800 a month might be in a less desirable area",
      "author": "itscochino",
      "created": 1601756729,
      "upvotes": 6,
      "replies": {}
    },
    "g7lfya2": {
      "link": "/r/Emory/comments/j4kpgp/moving_to_atlanta_from_california_advice/g7lfya2/",
      "text": "It you’re working at the cdc you will need to be in Atlanta. 800 is pretty cheap.",
      "author": "afwaller",
      "created": 1601776001,
      "upvotes": 4,
      "replies": {}
    },
    "g7lueu3": {
      "link": "/r/Emory/comments/j4kpgp/moving_to_atlanta_from_california_advice/g7lueu3/",
      "text": "I live directly across from the CDC and my rent is $1800. There are units in the complex from $1200 tho if you get a studio.",
      "author": null,
      "created": 1601780847,
      "upvotes": 5,
      "replies": {}
    },
    "g8800la": {
      "link": "/r/Emory/comments/j4kpgp/moving_to_atlanta_from_california_advice/g8800la/",
      "text": "Since you'll be attending Emory and working at the CDC, you can consider some alternatives that are about a 10-15 min drive from the CDC/Emory area. I work as an RN at Emory and one of my friends has an apartment in Brookhaven, paying about \\~1300 for a one bedroom apartment. The area is pretty good and safe from what I've seen. You mentioned an 800 dollar place for your current place, but what is the area like? Do some digging into whether the area has a high crime rate or how things are as far as safety. My friend's apartment is literally a 10 minute drive or less (night shift) and the place is nice and spacious, technically brand new. Plus, Brookhaven is near other things like Lenox Mall. Definitely considering looking around!\n\nHowever, if you are content with the 800 dollar apartment, you can ride it out for a while and wait til you see your first few checks at the CDC. Then you can decide later on if you'd like to move into a new apartment or not. The CDC should be paying good money though, lol. Congrats to you and all the best with your future studies and endeavors!",
      "author": "renznoi5",
      "created": 1602255607,
      "upvotes": 1,
      "replies": {}
    }
  }
}