{
  "sid": "nuku8z",
  "link": "/r/Emory/comments/nuku8z/nbb_elective_suggestions/",
  "title:": "NBB Elective Suggestions?",
  "text": "I'm currently looking at NBB electives being offered and was wondering if any of you guys had a really enjoyable/useful one that you would recommend taking, whether it was because of the professor or content, etc. Honestly it all interests me so I just wanted to ask around and hear about personal experiences. I want to go to dental school if that makes any difference. Thanks!!\n\nHere's the page I'm browsing through: [https://nbb.emory.edu/academics/current-course-offerings.html](https://nbb.emory.edu/academics/current-course-offerings.html)\n\nEDIT: Thanks to everyone for their suggestions!! I will keep an eye out and hope to get some of these classes... crossing my fingers",
  "author": "GreenKareBear8",
  "created": 1623093297,
  "updated": 1634097985,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h0yagky": {
      "link": "/r/Emory/comments/nuku8z/nbb_elective_suggestions/h0yagky/",
      "text": "ANT 307 was a good one, talked a lot about human evolution. Since you want to go into dentristry, knowing how the human jaw evolved from early *Homo* might be helpful.\n\nIf you're a badass you can take ANT 450W (Evolution of Childhood) but you need permission from Dr. Konner to do so.\n\nANT 334 (Evolutionary Medicine) next semester, keep an eye out for that. They canceled it for fall.\n\nANT 210 (Human Biology) should be pretty easy, too. I realize I only talked about anthro courses but that's because I have taken many and these suggestions count for NBB electives.",
      "author": "MyKali",
      "created": 1623098065,
      "upvotes": 4,
      "replies": {}
    },
    "h0y0zn7": {
      "link": "/r/Emory/comments/nuku8z/nbb_elective_suggestions/h0y0zn7/",
      "text": "The ethics courses are pretty good if you can get in.  Also the neuropharmacology and placebo course is known to be really cool.  Professor selection is your friend. Roesch and Frenzel tend to offer solid electives. Also see if Drugs and Behavior (I took that one) offered by the psych dept comes back. That has historically been a hit (but I think Darryl retired so be careful about new profs). Also keep in mind they sometimes offer new electives and that the bulk of them are offered in spring (for example Frenzel and Roesch 'sometimes' offer glial biology and neurochemistry respectively and they are supposedly well run.  I think you have lots of good options.",
      "author": "oldeaglenewute2022",
      "created": 1623094053,
      "upvotes": 5,
      "replies": {}
    },
    "h0y0hiy": {
      "link": "/r/Emory/comments/nuku8z/nbb_elective_suggestions/h0y0hiy/",
      "text": "NBB 280 is cool! I’d suggest taking it now if you don’t have a schedule timing issue with nbb 302 like me lol",
      "author": null,
      "created": 1623093842,
      "upvotes": 2,
      "replies": {}
    },
    "h0y1qag": {
      "link": "/r/Emory/comments/nuku8z/nbb_elective_suggestions/h0y1qag/",
      "text": "Look for nbb 299 next semester! Bit of an easier class, but has you engaging a ton with research opportunities and cool experiences on campus :)",
      "author": "FrozenYogurtWizard",
      "created": 1623094370,
      "upvotes": 2,
      "replies": {}
    }
  }
}