{
  "sid": "qptwhq",
  "link": "/r/Emory/comments/qptwhq/international_student_applying_to_emory/",
  "title:": "International student applying to Emory",
  "text": "Hello everyone im an international student and hoping some of you could answer my questions\n\n1. Is class rank very important in the admissions process?\n\n2. All of my SAT tests were cancelled due to Covid so im applying without one, has anyone been accepted with the same situation?\n\n3. How is the current state of emory (is it face to face classes? or online? Etc.)\n\n4. How is the international community there?\n\nThanks in advance!",
  "author": "Lonely_Role_4317",
  "created": 1636425776,
  "updated": 1636656431,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hjwcsvg": {
      "link": "/r/Emory/comments/qptwhq/international_student_applying_to_emory/hjwcsvg/",
      "text": "1. Not really\n2. Everyone got messed up. Its fine as along as your other stuff is good enough. The whole batch this year was accepted as test optional.\n3. We are mostly in person. Only very few classes are online. Just masks are required in classes otherwise life is pretty much normal here at Emory. We are having regular events and everything that was pre covid just with a mask on and not eating/drinking in door.\n4. International community is remarkable. I myself am an international student. It is very very easy to find your people and as you might know Emory is known for its diversity. I have met people from all parts of the world. Emory also has a pre-orientation known as the international students welcome which is 2-3 days before actual orientation and you meet all sorts of people over there its alot of fun so dont worry about any sort of culture shock etc.",
      "author": "Icy-Farmer-4424",
      "created": 1636432360,
      "upvotes": 2,
      "replies": {
        "hjws5fl": {
          "link": "/r/Emory/comments/qptwhq/international_student_applying_to_emory/hjws5fl/",
          "text": "Thanks for the reassurance, Emory sounds great! I also have a GPA of 3.88 my junior year but my school dosen’t offer any advanced/AP classes so i’m not so sure how thats going to affect my chances.",
          "author": "Lonely_Role_4317",
          "created": 1636442125,
          "upvotes": 1,
          "replies": {
            "hjxh0ql": {
              "link": "/r/Emory/comments/qptwhq/international_student_applying_to_emory/hjxh0ql/",
              "text": "If you have substantial ECs that should round you up as a great applicant and admission officers understand the AP scenario is different in different countries so just do your best and leave the rest on them. Good luck :)",
              "author": "Icy-Farmer-4424",
              "created": 1636462003,
              "upvotes": 1,
              "replies": {
                "hjxkt08": {
                  "link": "/r/Emory/comments/qptwhq/international_student_applying_to_emory/hjxkt08/",
                  "text": "Thanks so much! Appreciate the help!",
                  "author": "Lonely_Role_4317",
                  "created": 1636464117,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}