{
  "sid": "nr2i4h",
  "link": "/r/Emory/comments/nr2i4h/physics_for_chemistry/",
  "title:": "Physics for chemistry",
  "text": "Is calculus-based physics(phys 151) necessary for chem major or is algebra-based physics(phys 141) just fine?\n\nEDIT: Not just for the requirement. Will I have difficulty understanding concepts in upper-level chemistry courses without taking calc-based physics?\n\n&#x200B;",
  "author": "mousemouse329",
  "created": 1622686488,
  "updated": 1634098018,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h0e44hw": {
      "link": "/r/Emory/comments/nr2i4h/physics_for_chemistry/h0e44hw/",
      "text": "If you can do calc-based, it's probably better. I did algebra based 10 years ago. Went to grad school for chemistry, and the calculus practice would have helped.",
      "author": "LtGayBoobMan",
      "created": 1622686970,
      "upvotes": 5,
      "replies": {}
    },
    "h0f80g3": {
      "link": "/r/Emory/comments/nr2i4h/physics_for_chemistry/h0f80g3/",
      "text": "I feel people should take calc.based, it may help a tiny bit for 205 as well as any of the pchems(quantum chem, quantum mechanics, machine learning, experimental pchem, or biophysical.  It is one thing to be familiar with calculus and another to apply it. Practice applying it early I guess) that you should probably take if you get a BS or might consider grad. School(even if for like biochemistry or a in a life sciences cluster of a chemistry program it'll help because most programs have a pretty intense biophysical chem course as a requirement). For some reason Emory is one of the only schools in its tier to not have its STEM (and maybe THE only in terms of chem) majors require calc. based physics which is odd since they all require at least calc. 1 and 2.  Calc. based will help you learn to use calc. In context before you have to in a chem. Class at least. If you are only considering med. School and might only take the bio and ochem focused electives, then maybe you can just do physics 14x.",
      "author": "oldeaglenewute2022",
      "created": 1622715533,
      "upvotes": 3,
      "replies": {}
    },
    "h0e428e": {
      "link": "/r/Emory/comments/nr2i4h/physics_for_chemistry/h0e428e/",
      "text": "phys 141 fulfills the requirement",
      "author": "Kondoli",
      "created": 1622686940,
      "upvotes": 2,
      "replies": {}
    },
    "h0e45fc": {
      "link": "/r/Emory/comments/nr2i4h/physics_for_chemistry/h0e45fc/",
      "text": "http://catalog.college.emory.edu/department-program/concentration.php?YToyOntzOjI6ImlkIjtzOjM6IjU4MSI7czo0OiJ0eXBlIjtzOjU6Ik1ham9yIjt9",
      "author": "Dr_Yankee",
      "created": 1622686983,
      "upvotes": 2,
      "replies": {}
    }
  }
}