{
  "sid": "qdau8a",
  "link": "/r/Emory/comments/qdau8a/career_related_opportunities_at_emory/",
  "title:": "CAREER RELATED OPPORTUNITIES AT EMORY",
  "text": "I'm planning to apply for ed at emory. Can you guys tell me about internship, research, paid or non paid co-ops or any opportunities related to career at emory? Like is it pretty available? How is the career opportunities there?",
  "author": "ricewithdew",
  "created": 1634883819,
  "updated": 1635185275,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhplz8d": {
      "link": "/r/Emory/comments/qdau8a/career_related_opportunities_at_emory/hhplz8d/",
      "text": "Can’t really comment on that unless you provide info on major/ career aspirations. But Emory will not hold you back from any kinds of opportunities and has a special office for academic and research scholarships if you reach out and get onto their listserv.",
      "author": "The_Turing_Machine",
      "created": 1634965618,
      "upvotes": 1,
      "replies": {
        "hhpq8ns": {
          "link": "/r/Emory/comments/qdau8a/career_related_opportunities_at_emory/hhpq8ns/",
          "text": "for a cs major aspiring to be a data analyst. so into cs and business",
          "author": "ricewithdew",
          "created": 1634968848,
          "upvotes": 1,
          "replies": {
            "hhsbqug": {
              "link": "/r/Emory/comments/qdau8a/career_related_opportunities_at_emory/hhsbqug/",
              "text": "CS major is overkill for data analyst. QTM + ISOM would be enough for that. Unless you want to have more programming skills and eventually pivot into DS or SWE, then you should do CS",
              "author": "Worldlover67",
              "created": 1635024813,
              "upvotes": 1,
              "replies": {
                "hhzhlqt": {
                  "link": "/r/Emory/comments/qdau8a/career_related_opportunities_at_emory/hhzhlqt/",
                  "text": "How are internship opportunities at Emory for a data analyst?",
                  "author": "ricewithdew",
                  "created": 1635170068,
                  "upvotes": 1,
                  "replies": {
                    "hhzi6j2": {
                      "link": "/r/Emory/comments/qdau8a/career_related_opportunities_at_emory/hhzi6j2/",
                      "text": "I wish people would stop asking questions like this \"how is emory for \\_\\_\\_ internships?\".\n\nThe opportunities are as good as you apply yourself. People get internships at all sorts of companies over the summer. There are plenty of companies in Atlanta as well that hire for interns during the school year. Emory is considered a target school for many companies, but the name won't get you anything if you don't do the work to prepare and apply.\n\nIf you look on LinkedIn, you can even see where current students and alumni are.",
                      "author": "Worldlover67",
                      "created": 1635170339,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}