{
  "sid": "qqwsa8",
  "link": "/r/Emory/comments/qqwsa8/does_fin_201_count_towards_anything_but_a_bba_ger/",
  "title:": "Does FIN 201 count towards anything but a BBA GER?",
  "text": "I originally intended on pursuing pre-BBA and took FIN 201 - Business Economics to knock out the Macro/Micro requirement. However, I'd like to study QSS instead now.\n\nWhat can I do with the FIN 201 course I took? It's not listed under any of the GER sections or in any QSS major concentration. I'm thinking of taking Econ 101 - Micro which would go towards a History Culture Society GER and be easy given the knowledge I learned from FIN 201, which was basically Micro.",
  "author": "Chengz1",
  "created": 1636557802,
  "updated": 1637411715,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hk4usol": {
      "link": "/r/Emory/comments/qqwsa8/does_fin_201_count_towards_anything_but_a_bba_ger/hk4usol/",
      "text": "What QSS concentration/disciplinary track are you doing? QSS comes with a concentration and most are social sciences and humanities so it would make no sense to back track and waste time with something like econ 101 (UNLESS it is an econ concentration) when courses within your concentration will likely fulfill the same GER:\nhttp://quantitative.emory.edu/undergraduate/majors-minors/index.html\n\nThe answer to the fin. 201 thing is probably a no unless you are doing QTM/BBA",
      "author": "oldeaglenewute2022",
      "created": 1636587191,
      "upvotes": 1,
      "replies": {
        "hk9mpn2": {
          "link": "/r/Emory/comments/qqwsa8/does_fin_201_count_towards_anything_but_a_bba_ger/hk9mpn2/",
          "text": "I'm considering the Informatics concentration. Since I'm double majoring with compsci, for informatics the only classes I need to take to fulfill the major are a bunch of QTM classes. Taking econ 101 would go towards my History, Society, Culture GERs, and given that I took fin 201, econ 101 should be a breeze. That's my logic.",
          "author": "Chengz1",
          "created": 1636674336,
          "upvotes": 1,
          "replies": {
            "hk9n82a": {
              "link": "/r/Emory/comments/qqwsa8/does_fin_201_count_towards_anything_but_a_bba_ger/hk9n82a/",
              "text": "Get a real Emory education outside of STEM and go find more interesting courses to take.  There are plenty of  non-stringent grading courses elsewhere that don't involve you taking redundant stuff like econ. 101.  Hell, it may make far more sense to take my suggested route because you will still need CWRs and you can more easily double dip with HSC/CWR outside of econ (where getting access to most of them in econ may require 101, 112, 212).  It is unlikely that CS will offer courses that will satisfy CWR and they darned sure won't cover an HSC.",
              "author": "oldeaglenewute2022",
              "created": 1636674670,
              "upvotes": 1,
              "replies": {}
            },
            "hkpz574": {
              "link": "/r/Emory/comments/qqwsa8/does_fin_201_count_towards_anything_but_a_bba_ger/hkpz574/",
              "text": "If you ask the DUS of the QTM and CS department you’ll know that you actually can’t do a double major between the informatics track and CompSci. If you are interested in doing a double major you will have to do it in a non-cs track.",
              "author": "theladnamedbedi",
              "created": 1636985658,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk55i8e": {
      "link": "/r/Emory/comments/qqwsa8/does_fin_201_count_towards_anything_but_a_bba_ger/hk55i8e/",
      "text": "Nope",
      "author": "cactuscat123",
      "created": 1636591945,
      "upvotes": 1,
      "replies": {}
    }
  }
}