{
  "sid": "i2hp4v",
  "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/",
  "title:": "Freshman scheduling",
  "text": "Sorry Ik this topic has been reposted so many times but I was wondering if anyone could offer some insight. I’m a QSS NBB major on a premed track. Here’s what my schedule looks like rn:\n\nBio 141 \n\nBioL 141\n\nChem 150\n\nChemL 150\n\nQTM 110\n\nQTM 150\n\nFSEM\n\nPACE\n\nHLTH\n\nWould you guys recommend I use AP Bio credit to skip the lecture because this schedule is kinda rough with 19 credits? Any advice would be great!",
  "author": "KFBball",
  "created": 1596395324,
  "updated": 1634099283,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "g04ss5c": {
      "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g04ss5c/",
      "text": "If you did well in AP Bio (i.e. actually understood what was going on and actually remember the big picture, not just crammed for the AP and forgot it) then I would absolutely say use your AP credit to get out of that lecture. I’m a bio major/premed track, and used my credit to get out of 141 lecture. I had no issues in the lab or 142 lecture next semester. I saw what was being done in 141 lecture and it frankly seemed like it would’ve been a waste of my time. I’m glad I skipped it.\n\nAlso, I may be wrong, but aren’t freshmen capped at 17 credits this semester? If that’s the case you’d kinda have to use the bio credit to be under the limit.",
      "author": "j11234567890",
      "created": 1596396133,
      "upvotes": 8,
      "replies": {
        "g08ucks": {
          "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g08ucks/",
          "text": "Thanks for the feedback! I probably will end up using my bio AP credits.",
          "author": "KFBball",
          "created": 1596482137,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g064x3m": {
      "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g064x3m/",
      "text": "From what I'm hearing, there's a 17 credit limit for freshmen.",
      "author": "iapetus3141",
      "created": 1596423182,
      "upvotes": 4,
      "replies": {
        "g067iaq": {
          "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g067iaq/",
          "text": "there’s a 17 credit limit technically but we can submit a form if we want to take more and ask for an exception so it’s not like completely set in stone",
          "author": "swimmer2626",
          "created": 1596424822,
          "upvotes": 3,
          "replies": {
            "g069mme": {
              "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g069mme/",
              "text": "Ah, I saw the updated guidelines. I would advise very strongly against taking 19 credits, especially if you're taking Bio + Chem in the same semester.",
              "author": "iapetus3141",
              "created": 1596426214,
              "upvotes": 2,
              "replies": {
                "g08uh1j": {
                  "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g08uh1j/",
                  "text": "Yea I thought I heard something about that but I couldn’t find a source. I’m probably not going to go above 17 credits this semester.",
                  "author": "KFBball",
                  "created": 1596482186,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g050dak": {
      "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g050dak/",
      "text": "Ah nice, a brave pre-med (if pre-med works and you do well, you'll be very marketable to some really strong med. research schools/programs, maybe even including things like Harvard HST) or even if you leave pre-med, you'd get access to some cool grad programs or job/fellowship opps. I will say that this schedule is kind of rigorous (not a bad thing but beware), and I would follow the advice of the other poster and gone ahead and AP out of bio 141 lecture.\n\nJust wait and take someone good for biol 142 because from what I've seen and heard, QTM 110 is apparently NOT that easy to most people, and I think it is a course with more challenging than average exams (low raw average scores, generous curve so probably not unreasonably tough to get a solid final grade but takes some seriousness for sure) and p-sets as it more so emphasizes research study design and analysis than pure mathematically focused inference so calls on lots of critical thinking about somewhat realistic scenarios (it is a \"thinking heavy\" heavy course versus a plug and chug heavy traditional stats course like the catch all QTM 100 course non-majors take) and you don't need to couple it with something like bio 141 lecture which will ultimately become more like distracting busywork for those with AP credit. And of course chem 150 is designed to encourage and require continuous engagement with material , so even though it isn't the hardest class on the planet, it'll keep you busy if you wanna do well.\n\n&#x200B;\n\n\\*BTW, it helps to put instructors by your courses because even if the content of a multi-section course is identical across sections, the syllabus (assignments and weighting of each component), types/styles of test items can be very different across instructors",
      "author": "oldeaglenewute2022",
      "created": 1596400005,
      "upvotes": 2,
      "replies": {
        "g08uwpl": {
          "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g08uwpl/",
          "text": "That was a lot of helpful info that I’ll be sure to take into consideration when finalizing everything! Also are there any professors you’d recommend for the courses I plan on taking?",
          "author": "KFBball",
          "created": 1596482358,
          "upvotes": 1,
          "replies": {
            "g090klu": {
              "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g090klu/",
              "text": "Same as other posts: De Roode (Nam 2nd choice) for bio, McGill (Brathwaite/Kindt 2nd choice, possibly Hines 2/3rd choice).\n\n&#x200B;\n\nFor QTM 110, the Montagnes person seems to have the most experience and the level of reviews (mixed but leaning positive) you'd expect from a tough intro. course from a decent/solid but not amazing instructor with a \"non-traditional\" audience (Not many schools have droves of typically math averse social sciences students pursuing a quantitatively intensive stats/methods major)\n\nOn interpreting ratings: note that QSS is going to be predominantly social science oriented folks so I think their thresholds for tolerating tough exams may be lower than STEM focused folks and this can often reflect in ratings.  Tests in standard social science classes tend to be very \"straight-forward\" as teachers often save the challenge to do more analytical thinking for short/medium writing assignments and research papers. This is essentially the opposite of intro/intermediate STEM (which is what the core QTM classes are) classes which are generally test heavy with tests often calling for higher level thinking. Means you have to take RMP with a grain of salt and conside who the raters may be and what they may expect vs. their other experiences.  Bio/life science course ratings tend to have lots of expectation bias as well. Many students expect only memorization/general understanding to be enough to do well in bio classes (because it was throughout k-12 and for some evaluating less memorization oriented intermediate NBB and bio classes, they may have also taken a biol 141/142 instructor that demanded less critical thinking on average vs. other sections), so instructors who demand more analytical or critical thinking are more prone to being viewed negatively/rated harshly.",
              "author": "oldeaglenewute2022",
              "created": 1596484598,
              "upvotes": 1,
              "replies": {
                "g0dnhtx": {
                  "link": "/r/Emory/comments/i2hp4v/freshman_scheduling/g0dnhtx/",
                  "text": "Thanks for the suggestions. I’ll definitely keep them in mind when I’m selecting my courses!",
                  "author": "KFBball",
                  "created": 1596576935,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}