{
  "sid": "nmn1xr",
  "link": "/r/Emory/comments/nmn1xr/private_scholarships/",
  "title:": "Private Scholarships",
  "text": "I’m an incoming freshman and have already received my financial aid package. If I get an outside scholarship, will my financial aid be simply decreased by that amount? Or do they stack?\nAlso, if they stack, will that be the case for all 4 years?",
  "author": "Narrow_Ad9862",
  "created": 1622166607,
  "updated": 1634098045,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "gzpumtq": {
      "link": "/r/Emory/comments/nmn1xr/private_scholarships/gzpumtq/",
      "text": "I didn't have a private scholarship, but during my freshman year, one of my federal grants increased by ONE dollar and Emory went back and decreased their aid by a dollar. I thought it was wild. Only happened once, though. Another time I got a surprise grant and my aid didn't change. I'd still take the outside scholarship.",
      "author": "kissingfish",
      "created": 1622172396,
      "upvotes": 9,
      "replies": {}
    },
    "gzrb1m1": {
      "link": "/r/Emory/comments/nmn1xr/private_scholarships/gzrb1m1/",
      "text": "In my experience, merit based outside scholarships stack. Be aware that if you get scholarships in excess of the cost of tuition (aka that you use to cover room/board etc) that is considered taxable income. Scholarships generally do have to be used on \"qualifying educational expenses\" so you can't keep scholarships far above the cost of attendance - that'd be fraud.",
      "author": "FlowersBloomUntil",
      "created": 1622209597,
      "upvotes": 2,
      "replies": {}
    },
    "gzrti78": {
      "link": "/r/Emory/comments/nmn1xr/private_scholarships/gzrti78/",
      "text": "i think it depends, personally they docked my fin aid by that amount but i think i wouldve started getting money back (a refund) at that point",
      "author": "y9d8tsdt",
      "created": 1622217717,
      "upvotes": 1,
      "replies": {}
    }
  }
}