{
  "sid": "mkninq",
  "link": "/r/Emory/comments/mkninq/cs_at_emory/",
  "title:": "CS at Emory",
  "text": "Hi guys. I was recently admitted to Emory and I'm planning on studying computer science. It's currently my top option because I was waitlisted from a different school that has a really great CS program. I have always planned on studying computer science, but I know Emory isn't really a CS school. I don't know what my experience will be like if I decide to attend in the fall. Any similar experiences or anecdotes would be much appreciated.",
  "author": "Left-Penalty-2533",
  "created": 1617637055,
  "updated": 1634098609,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.95,
  "comments": {
    "gth75ww": {
      "link": "/r/Emory/comments/mkninq/cs_at_emory/gth75ww/",
      "text": "I graduated in 2018 so things may have changed since I left, but the CS department was growing rapidly in my time, and while they were hiring department staff as well things hadn't quite caught up yet (although that may or may not be the case currently), as such classes tended to be large and getting a spot in a class wasn't a given.\n\nThat said the quality of the coursework and selection of electives was decent (and I imagine better now than it was in my time) and everyone I knew in the program had a job by the time they graduated.",
      "author": "TheThobes",
      "created": 1617645129,
      "upvotes": 8,
      "replies": {
        "gti1oeu": {
          "link": "/r/Emory/comments/mkninq/cs_at_emory/gti1oeu/",
          "text": "What types of firms recruit for CS at Emory if you don’t mind sharing. Also do people get FAANG jobs?",
          "author": "Dazzling-Tax-3591",
          "created": 1617659178,
          "upvotes": 2,
          "replies": {
            "gti3ctk": {
              "link": "/r/Emory/comments/mkninq/cs_at_emory/gti3ctk/",
              "text": "Locally you get companies like Home Depot, NCR, and SunTrust.\n\nAs far as Silicon Valley companies, Google and Palantir came and did recruiting most years from what I remember, and at least in the time I was there we sent quite a few people to Palantir. We also had a few people go to Microsoft, Facebook, and Amazon as well if I recall correctly.",
              "author": "TheThobes",
              "created": 1617659993,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gti37wo": {
          "link": "/r/Emory/comments/mkninq/cs_at_emory/gti37wo/",
          "text": "thanks so much for the response! what is the culture like among students who study cs. are there many or do they make up a small percentage of the population at emory?",
          "author": "Left-Penalty-2533",
          "created": 1617659927,
          "upvotes": 2,
          "replies": {
            "gti4ci0": {
              "link": "/r/Emory/comments/mkninq/cs_at_emory/gti4ci0/",
              "text": "Definitely smaller than the pre meds and the B school people, but it was sizable and growing by the year when I was there. I really liked my cohort of CS majors, at least in my time it still felt small enough that you knew a good chunk of the people you started with (although I took cs 171z which was the AP computer science follow up course for freshman studying CS, which had a really small class size and I stayed with those people through my 3.5 years so my experience might not translate 100%) as you moved through the degree.\n\nBut overall I think the department had a good culture, at least among the students. I felt like there was a good amount of camaraderie, most of the TA's are fellow undergraduates and the shared computer lab (should you choose to work there) lends itself to a collaborative and social environment.\n\nAt least that was my general experience. If I could go back and do it again I don't think I would do anything particularly differently. But people who graduated more recently or are in school now would have a more accurate picture, particularly in light of what covid has done for things.",
              "author": "TheThobes",
              "created": 1617660479,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}