{
  "sid": "qhdwe4",
  "link": "/r/Emory/comments/qhdwe4/emory_mn_to_msn_2022/",
  "title:": "EMORY MN TO MSN 2022",
  "text": "Hey everyone! I recently applied for the early decision II deadline to be part of the MN to MSN Summer 2022 program. Decisions come out Friday and I’m super nervous. Did anyone else apply? If there are current students in the program can they comment on their experience? Thanks in advance 😊☺️",
  "author": "science-thingz",
  "created": 1635391726,
  "updated": 1637411357,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hicbiey": {
      "link": "/r/Emory/comments/qhdwe4/emory_mn_to_msn_2022/hicbiey/",
      "text": "The MN is the one for those with degrees already, right? Did the traditional BSN at Emory and since MN is prelicensure it shouldn't be that much different. My instruction was really good and clinical placements around Atlanta are amazing. Support during the program was lacking here and there but nothing dealbreaking. However, the program was really expensive. There are much cheaper ways to get your RN like going to a public school. Same RN at the end of the day.\n\nI would caution you before you do any MSN programs without experience. RN to NP programs means you will be practicing independently without enough education and training to take care of patients alone. BSN to DNPs are even worse. Online programs are too abundant and they barely earn the doctorate.\n\nThere's enough misinformation going on saying that NPs are just as good as physicians and I see NPs posting on social media asking for help diagnosing a patient. I would never send my grandma to see an NP before an actual physician lays eyes on her. Just my two cents.",
      "author": "counthrowintel",
      "created": 1635394625,
      "upvotes": 3,
      "replies": {}
    },
    "hikbgl9": {
      "link": "/r/Emory/comments/qhdwe4/emory_mn_to_msn_2022/hikbgl9/",
      "text": "I applied! and just got it!!",
      "author": "Necessary_Buyer_3335",
      "created": 1635542044,
      "upvotes": 1,
      "replies": {}
    },
    "hk5hyg3": {
      "link": "/r/Emory/comments/qhdwe4/emory_mn_to_msn_2022/hk5hyg3/",
      "text": "Currently in my first semester of the MN, not +MSN, but I'd be happy to chat if ya have questions, pm me. Good luck!",
      "author": "izcota28",
      "created": 1636597500,
      "upvotes": 1,
      "replies": {}
    }
  }
}