{
  "sid": "mrgzsp",
  "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/",
  "title:": "Emory vs UGA",
  "text": "Hi, looking for advice on college pick. I am left with UGA and Emory with full tuition after several rejections and few waitlists. I got UGA honors and some other merit scholarship. I am planning to pursue pre-med, however wanted to see how that goes and transfer to a different major. I didn't get any financial aid or merit scholarship from Emory. Have a hard time deciding. I would appreciate any input on this.",
  "author": "princegoldee",
  "created": 1618500342,
  "updated": 1634098535,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.73,
  "comments": {
    "gumd45j": {
      "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gumd45j/",
      "text": "This reads as salty, because the part about rejections and waitlists didn't have to be said.  You must not feel good about Emory, and financially it makes no sense.  Go to UGA.  It actually has pretty strong STEM curricula, especially for the pre-health crowd (if you can get access to some of the undergraduate pharmacy courses there, do it!).  I think Emory has better support services and smaller, more \"interesting\", gateway STEM courses but it isn't worth paying full tuition vs. paying virtually nothing at UGA.  Go work hard, have fun, and apply to medical school.  If you don't like UGA, maybe apply to the schools that waitlisted or denied you that you actually like IF they have a reasonable transfer in rate.",
      "author": "oldeaglenewute2022",
      "created": 1618504217,
      "upvotes": 32,
      "replies": {
        "gunluwd": {
          "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gunluwd/",
          "text": "Thanks much for this valuable insight and advice.",
          "author": "princegoldee",
          "created": 1618523750,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gumk7ve": {
      "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gumk7ve/",
      "text": "Yeah people who went to Emory only because it was the highest ranked school they could get in were noticeably bitter for 4 years. No school pride, never wore Emory t-shirts, etc. Best advice is to go to a school you want to be at. Otherwise, pick the most suitable public university so you won't be paying a fortune for something you don't want.",
      "author": "crusheratl",
      "created": 1618507284,
      "upvotes": 11,
      "replies": {
        "gunkrkk": {
          "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gunkrkk/",
          "text": "sure, thanks a lot for taking time and guidance!",
          "author": "princegoldee",
          "created": 1618523239,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gum7cob": {
      "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gum7cob/",
      "text": "If you feel as though you're \"left\" with Emory than the school isn't for you and you should go elsewhere.",
      "author": "91210toATL",
      "created": 1618501720,
      "upvotes": 27,
      "replies": {}
    },
    "gumkrh9": {
      "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gumkrh9/",
      "text": "For what it's worth, pre-med is not a major, but rather a set curriculum that prepares you for entry to medical school. Your major is a separate decision/set of courses from your pre-med courses (obviously with some overlap if you decide to do a hard science major). \n\nAs for UGA vs Emory, they are very different schools, but you can be academically rigorous at both, and I've had plenty of friends make it to med school from both. In your shoes, unless money is no object or you have a very strong preference, I would strongly consider going to the school that will cost less. If you make it to med school, that will already cost plenty, and you don't want to have to juggle both sets of loans if you can avoid it.",
      "author": "piercedj316",
      "created": 1618507518,
      "upvotes": 8,
      "replies": {
        "gunlayl": {
          "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gunlayl/",
          "text": "Thanks a lot for your valuable advice. This insight helps me to get clear on the path.",
          "author": "princegoldee",
          "created": 1618523489,
          "upvotes": 2,
          "replies": {
            "gunoe0n": {
              "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gunoe0n/",
              "text": "No problem, good luck! Not an easy decision, but you've got two great schools to choose from!",
              "author": "piercedj316",
              "created": 1618524956,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "guo2xvu": {
      "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/guo2xvu/",
      "text": "I went to the school that offered me a full ride, and it was the best decision ever.  Freed up the funds for an Ivy grad school.",
      "author": "Free-Nail-1682",
      "created": 1618532351,
      "upvotes": 3,
      "replies": {}
    },
    "gume1h9": {
      "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gume1h9/",
      "text": "Agree with other comments. We don’t want people who feel “left” with Emory coming to our school cuz we don’t want ur toxic vibe. U don’t want Emory and the Emory community doesn’t want you so Go to UGA.",
      "author": "ELON_MUSK_69420_",
      "created": 1618504619,
      "upvotes": 15,
      "replies": {
        "gunlsk0": {
          "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gunlsk0/",
          "text": "sorry, doesn't mean to under-value the options I got. It just felt like a tough decision to make between the 2.",
          "author": "princegoldee",
          "created": 1618523720,
          "upvotes": 3,
          "replies": {}
        },
        "gumiypq": {
          "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gumiypq/",
          "text": "well obviously emory wants him if they accepted him 😬",
          "author": "CartoonistExotic9148",
          "created": 1618506741,
          "upvotes": 2,
          "replies": {
            "gumts4j": {
              "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gumts4j/",
              "text": "Emory is not its admissions office. The admissions office is merely the doorway through which you enter the community. The Emory community itself is entirely different and it's what actually matters.",
              "author": "katsteve",
              "created": 1618511429,
              "upvotes": 8,
              "replies": {}
            },
            "gumvar2": {
              "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gumvar2/",
              "text": "I was talking about the community",
              "author": "ELON_MUSK_69420_",
              "created": 1618512099,
              "upvotes": 5,
              "replies": {
                "gumycg4": {
                  "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gumycg4/",
                  "text": "I think y'all may be saying the same thing lol.",
                  "author": "oldeaglenewute2022",
                  "created": 1618513447,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gumzv1a": {
      "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gumzv1a/",
      "text": "What a bunch of pretentious fuckers in this thread.",
      "author": "Fenc58531",
      "created": 1618514120,
      "upvotes": 5,
      "replies": {
        "gunlkja": {
          "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gunlkja/",
          "text": "Sorry, doesn't mean to under value my options. I was at a cross roads due to heavy tuition fees.",
          "author": "princegoldee",
          "created": 1618523614,
          "upvotes": 3,
          "replies": {
            "gunlpva": {
              "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/gunlpva/",
              "text": "I was talking about the people commenting in this thread. Gl OP on wherever you go.",
              "author": "Fenc58531",
              "created": 1618523684,
              "upvotes": 3,
              "replies": {
                "guo3og0": {
                  "link": "/r/Emory/comments/mrgzsp/emory_vs_uga/guo3og0/",
                  "text": "Where were we pretentious? You sure you got the right word (now that is me being pretentious or an a-hole)? The OP seemed stuck up about their choices and most of us are telling them to follow the money which is at UGA.  Pretentious people would tell them to suck it up and go to Emory based on some total non-sense (like \"prestige\" and fictitious rankings that should not matter to a pre-med or STEM pre-grad for that matter) and I know some \"elite\" school subreddits where that stuff happens a LOT and I won't say names. Don't bring whatever you got goin' on here saying stuff that doesn't make sense.",
                  "author": "oldeaglenewute2022",
                  "created": 1618532735,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}