{
  "sid": "rflwa2",
  "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/",
  "title:": "As a low-income international student I am thinking of applying RD to Emory, should I?",
  "text": "Hi, Hope everyone's well.\n\nI don't mean this question in a chance me sort of way, but just wanted to know if you have ever seen an international student getting need-based financial aid at Emory (context: my estimated Family Contribution is 15K USD/year)?\n\nIf the ans to the previous question was yes, could you please confirm if at least a few get it each year or a few get it once every 2-3 years? \n\nNote: Wasn't able to apply for merit scholarships due to some issues.",
  "author": "doptimisticidealist",
  "created": 1639418687,
  "updated": 1639876093,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hoffv98": {
      "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/hoffv98/",
      "text": "According to Emory, “Emory’s admission process is “need-aware” for international students. This means that when reviewing applications, we must consider whether students who are not US citizens or permanent residents have requested financial aid and/or review their ability to pay for an Emory education.\n\nAs a result, there are limited funds to assist international students on the basis of need. Apply for financial aid only if you have no other resources to fund your education.”\n\nhttps://apply.emory.edu/financial-aid/international.html\n\nI haven’t come across an international student getting need based aid, but then again I don’t really ask others about that. Most international students I see seem to be pretty well-off based on their fashion and how often they buy food/go out. It doesn’t mean you don’t have a chance though. But based on what I pasted from Emory’s website they do take into consideration if you need aid which will affect your chances of getting in.",
      "author": "ilikehoodies209",
      "created": 1639430412,
      "upvotes": 5,
      "replies": {
        "hoh5ey0": {
          "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/hoh5ey0/",
          "text": "Right, I do understand that Emory is need-aware and that it is going to be competitive.\n\nThe only thing I want to understand if it's possible for Emory to give a scholarship of this value to an international student.\nFor instance, I found out a school, Skidmore, even though, need-aware for international students only gives out limited (40K/year max) financial aid to non-UWC international students.",
          "author": "doptimisticidealist",
          "created": 1639458699,
          "upvotes": 1,
          "replies": {
            "hoh6zsh": {
              "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/hoh6zsh/",
              "text": "I’m not too sure then. I assume that it is possible, but might be unlikely.",
              "author": "ilikehoodies209",
              "created": 1639459623,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hohy13n": {
      "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/hohy13n/",
      "text": "No. Even though they say they are need-aware, they don’t give any sort of need-based aid to international students. Your best chance is getting a partial or full-ride scholarship through the Emory Scholars Program, and they don’t select you if you apply ED1 or ED2. If you haven’t applied for the Scholars Program, unfortunately you won’t get all the aid you need. Trust me, I speak from my own experience.",
      "author": "pagliaccibrus",
      "created": 1639480125,
      "upvotes": 2,
      "replies": {
        "hoi93hp": {
          "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/hoi93hp/",
          "text": "Thank you so much for this brutal honesty!\n\nDefinitely what I needed to confirm. I'm gonna save myself some time by not applying to Emory altogether.",
          "author": "doptimisticidealist",
          "created": 1639487357,
          "upvotes": 1,
          "replies": {}
        },
        "hoi95u2": {
          "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/hoi95u2/",
          "text": "But could you please clarify what you mean by speaking from your own experience? Did you apply for aid as an international as well?",
          "author": "doptimisticidealist",
          "created": 1639487392,
          "upvotes": 1,
          "replies": {
            "hovgt8k": {
              "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/hovgt8k/",
              "text": "I applied as an international student and got scholarships through the Scholars Program, but it still couldn’t pay the difference between the tuition minus the scholarships. I asked for a little bit more money (need-based) and they said they couldn’t give me anything because I wasn’t a domestic student. I was very disappointed.",
              "author": "pagliaccibrus",
              "created": 1639713477,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoohw93": {
      "link": "/r/Emory/comments/rflwa2/as_a_lowincome_international_student_i_am/hoohw93/",
      "text": "Emory may ask you to submit a bank statement showing you can pay for the first year before accepting you.\n\nI have seen a few international students get the Woodruff Scholarship, but that is all I am aware of.",
      "author": "gertmacklinfbi",
      "created": 1639595428,
      "upvotes": 1,
      "replies": {}
    }
  }
}