{
  "sid": "im7kyt",
  "link": "/r/Emory/comments/im7kyt/those_of_you_who_come_in_pre_med_and_then_drop/",
  "title:": "Those of you who come in pre med and then drop, what major/field do you go into?",
  "text": "Im interested in seeing if everyone just switches to business because that is the other thing that Emory is known for, or they go more into biology research/stay in something still science related?\n\nOnce you drop pre med, do you still feel like Emory is the right school for you or do you think the limited number of majors kind of limits your future if you decide you want to pursue something else?",
  "author": "Coconut-Bean",
  "created": 1599186455,
  "updated": 1634099195,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.82,
  "comments": {
    "g3xzayi": {
      "link": "/r/Emory/comments/im7kyt/those_of_you_who_come_in_pre_med_and_then_drop/g3xzayi/",
      "text": "Look. I can't really relate because I was never pre-med (I'm pursuing a STEM PhD) but I will say that you should do what you want within reason.\n\nI will say that people who switch from pre-med to something like business may have justifiably been looking for a clear and paved path to eventual financial security and that is what GBS is.  People coming from one super structured and clear cut path naturally veer towards another depending on their motivations in the first place. Quality of other non-preprof. programs probably doesn't come to mind.  There are plenty of super strong majors with supportive faculty and great co-curric. and prof. development infrastructure outside of pre-professional pathways. The fact is, with other pathways outside of prof. school and maybe certain consulting or IB positions? finding success however you define it takes way more deliberateness on your part to fully immerse yourself in whatever discipline/department, make faculty connections, try internships/research, or whatever vs. just taking whatever med. schools want/need or the b-school requires and securing strong grades and a fairly specific list of expected ECs and whatnot.\n\n  You have to figure out your own goals or career interests and tailor your experience towards those without the help of broad offices like PHA and GBS's focused career center.  There is more randomness and you'll probably need to interact with the general career center (and maybe alumni networks) if going outside of research/academia if you end up majoring in something with less career development and co-curric. opps. If you are in a well-funded dept with strong infrastructure, carving a path shouldn't be hard at all, but again, you will have to be a LOT more strategic beyond just grades (like figuring out what specific courses and experiential may prepare you for certain grad. programs, fellowships, or job oppurtunities in a field as.  It isn't like:\"Just do as we say and you should get in somewhere). \n\n If this is indeed you that is concerned I imagine you feel a bit lost because it may be hard to let go of the pre-carved academic path that is pre-med and all the advising infrastructure behind it, but it should also be liberating if you think of some.things you are interested in outside of medicine (could even be other aspects of healthcare. I have seen students go into healthcare administration after dropping pre-med WITHOUT a BBA, or MBA and do very well).  There are many things you could do.  If looking for another(non-GBS) \"safe\", but challenging path that would like.be high yield in terms of start pay, a QTM major or minor could position you well for many things if you play your cards right.  But even outside of \"safe\" paths, you can make stuff work well(has nothing to do with Emory or whatever school you are so much as how good you are at immersing yourself in what you like and making neccessary connections with faculty and professionals. Emory doesn't make that hard. You just won't have PHA or whatever guiding your way anymore). Just start thinking up a plan and think about how you will build and market a skillset vs. prepare for and manufacture paper based academic perfection for med. schools. It will be a very different and scary ballgame that you'll need to adjust to. But that's life! And definitely don't try to follow the path of anyone who posts an answer. You need to figure out what works for you!",
      "author": "oldeaglenewute2022",
      "created": 1599189945,
      "upvotes": 6,
      "replies": {
        "g3y0b9y": {
          "link": "/r/Emory/comments/im7kyt/those_of_you_who_come_in_pre_med_and_then_drop/g3y0b9y/",
          "text": "Haha thanks for such a detailed response! Don't worry I am currently pursuing a major I am very interested in and have a decently strong career direction in mind which is not pre med. I mainly posed this question to see if the combination of individuals who come in pre med into Emory coupled with the relatively lack of variety in terms of subjects one can pursue cause people to feel lost after they drop pre med. I was interested to see if they kind of drop pre med because they find another passion within the college itself or they tend to just gravitating to business as they see that the school doesn't offer them with much else. I think you make a good point about people liking structure though",
          "author": "Coconut-Bean",
          "created": 1599190560,
          "upvotes": 3,
          "replies": {
            "g3y0prj": {
              "link": "/r/Emory/comments/im7kyt/those_of_you_who_come_in_pre_med_and_then_drop/g3y0prj/",
              "text": "The thing is, I think there are a LOT of areas to pursue afterwards.  People at Emory just like safe high yield paths versus CREATING a high yield path.  I think there is a lack of imagination and much lesser so limitations on Emory's behalf (though lack of engineering is one).  A serious student can make almost any major work for them (and you aren't even wed to those disciplines with ECs, research, and experiential learning).  People don't wanna go through the hassle of figuring something else out when they can have it figured out for them and I think someone with a \"pre-med\" mindset may be more risk averse and predisposed to that sort of decision making and as expensive as Emory is I get it but still...\n\nAnd tbh, based on the data. Pre-med at Emory is hardly safe.   I'm basically preparing you to see people who claim they \"felt\" limited when they may not have been I do think ECAS needs much stronger career steering though and I think they know it. It seems like a lot of Emory students don't even know what is out there and what it takes to access other areas. We do kind of cluster and limit our options and the course and major offerings and their quality for the most part are similar enough to comparable schools that this clustering can't be explained beyond students being highly risk averse and maybe being unaware of many things.  \n\nLike Emory Career Services revamp appears to still be in its infancy and that doesn't help those who stray off of pre-prof. tracks. I won't lie. Like when I was there, there wasn't even a STEM person in Career Services. Apparently they just got one like a couple of years ago.  That means that Emory had no formal career advising for those not going to grad. school but wanted STEM or STEM adjacent work until a couple of years ago!",
              "author": "oldeaglenewute2022",
              "created": 1599190814,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3zm0qe": {
      "link": "/r/Emory/comments/im7kyt/those_of_you_who_come_in_pre_med_and_then_drop/g3zm0qe/",
      "text": "not a premed but a lot of human health majors seem to be ex-premeds (and there's a lot of current premeds too, I'd say there's more premeds than actual pre-public health)",
      "author": null,
      "created": 1599229992,
      "upvotes": 3,
      "replies": {}
    },
    "g3ycjif": {
      "link": "/r/Emory/comments/im7kyt/those_of_you_who_come_in_pre_med_and_then_drop/g3ycjif/",
      "text": "I know a few people who've dropped premed for Comp Sci",
      "author": "incognitoshadow",
      "created": 1599199236,
      "upvotes": 3,
      "replies": {}
    }
  }
}