{
  "sid": "o72ozj",
  "link": "/r/Emory/comments/o72ozj/parking_for_mph_student/",
  "title:": "Parking for MPH student",
  "text": "Hi all, \nI tried signing up for parking at the Michael st but only star one was available a few days ago. I emailed the parking services and just got a response back that parking is all taken for Michael st. I’m not really sure what to do and would appreciate any suggestions. I already put myself on the waiting list for Michael St but my partner and I live about 2 blocks south of Piedmont and there’s not really any other convenient way of getting to and from school. This will be my first semester as an MPH student (accelerated to one year) and im concerned if I don’t have a decently easy way to get to school that’ll just add unnecessary stress. \n\nAnyone have any suggestions? Does anyone have any knowledge of how the waiting list works? Thanks all!",
  "author": "suckmypuss123",
  "created": 1624547003,
  "updated": 1634097843,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "h2x2np7": {
      "link": "/r/Emory/comments/o72ozj/parking_for_mph_student/h2x2np7/",
      "text": "Hey, I was an MPH student a few years ago.  Unfortunately, the Micheal street parking deck is one of - if not the - most wanted parking decks. The waitlist is your best bet, but pre-covid at least it was pretty impossible to get as a student if you didn’t sign up on the day it was released. I don’t know if that will change now post-covid. The only thing I can recommend is trying to get a carpool - you sign up for that separately. It also has the bonus of being cheaper! I did a carpool for a year  and I drove a year. Hope that helps, happy to answer any other questions.",
      "author": "canththinkofanything",
      "created": 1624562155,
      "upvotes": 3,
      "replies": {
        "h2x82k1": {
          "link": "/r/Emory/comments/o72ozj/parking_for_mph_student/h2x82k1/",
          "text": "Ahh okay thanks! Where can I find a carpool?",
          "author": "suckmypuss123",
          "created": 1624564605,
          "upvotes": 1,
          "replies": {
            "h2x8lfl": {
              "link": "/r/Emory/comments/o72ozj/parking_for_mph_student/h2x8lfl/",
              "text": "Have you joined the FB group for your MPH cohort yet? People are usually on that and might want to carpool.",
              "author": "canththinkofanything",
              "created": 1624564844,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}