{
  "sid": "h7l71d",
  "link": "/r/Emory/comments/h7l71d/intrigued_student/",
  "title:": "Intrigued Student",
  "text": "Hi! I’m a rising high school senior. I don’t know much about Emory, so I was wondering if I could ask a few questions to see if it would be potential for my college list.\n\nIs there a pre-law track or undergrad law programs? Is Emory great with preparing law-interested students for law school? \n\nHow are the professors? Are there great research opportunities for law/social sciences?\n\nWhat are the dorms like? Are there residential colleges?\n\nHow ethnically diverse is the campus?\n\nWhat are some big campus events? Is Emory great in the social department?\n\nAre there any transportation perks given to students?\n\nHow is the school spirit? What do most students do for fun? Are there some cool clubs?\n\nWhats unique about this college?\n\nHow does Emory help students prepare for post-grad employment?\n\nAre there great study abroad/immersion programs?\n\nThank you in advance. 😊",
  "author": "001smiley",
  "created": 1591970423,
  "updated": 1634099354,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "fulpmjl": {
      "link": "/r/Emory/comments/h7l71d/intrigued_student/fulpmjl/",
      "text": "1. PPL major. Yes, Emory has good law school placement, and the pre law center helps students prepare applications and potential interviews. \n\n2.Top 20 school, and yes research is plentiful \n\n3. Dorms are bracketed by class. So freshman dorms, sophomore dorms etc. Freshman doems are new and very spacious. \n\n4. Very diverse\n\n5. Wonderful Wednesday, flea market every Wednesday. Dooleys week, mostly concerts. Socially Emory depwnda on Atlanta for most students to really enjoy themselves. Frat row is fun but tame at times but Atlanta is great. \n\n6. No, but there are shuttles to certain places. Supermarkets and malls. \n\n7. Most go to Atlanta, go to bars and night clubs, Frat row, drinking, or join social clubs. Not muxh school spirit \n\n8. Its one of the most beautiful campuses in the world, and its a school that focuses on interdisciplinary studies, so students can diversify there curriculum or even make their own major.\n\n9. Theres a career center woth all of the programs and services you would need. \n\n10. Yes, one typically applies second semester of freshman year.",
      "author": "91210toATL",
      "created": 1591973920,
      "upvotes": 6,
      "replies": {
        "fulqx4v": {
          "link": "/r/Emory/comments/h7l71d/intrigued_student/fulqx4v/",
          "text": "Thank you. 👍🏾",
          "author": "001smiley",
          "created": 1591974480,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fulmkmj": {
      "link": "/r/Emory/comments/h7l71d/intrigued_student/fulmkmj/",
      "text": "I'll answer some:\n\n1. No pre-law track.  Pick a major and then apply to law school.  Political Science naturally has some law related classes and you don't really need to major to access them (they may only have a couple or no pre-reqs).  Placement is excellent (though placement is mostly up to you/the student.  People should stop talking about how \"well\" any school \"places\" people into largely numbers driven professional school programs.  You have to get the numbers and the resume to make sure you are competitive.  Most schools provide the oppurtunities so when you ask this question, it really means: \"Do students hit these numbers and do they take advantage of the opps on campus and beyond to develope themselves prior to the application?\" Of course at highly selective schools with bunches of upper middle class and even wealthy students, the answer will generally be \"yes\".  Emory isn't an exception, but does seem to still have an awful lot of pre-laws.  Pre-law is a path becoming less and less popular it seems).  Please see this page: [http://www.career.emory.edu/destination/continuing/law.html](http://www.career.emory.edu/destination/continuing/law.html)\n2. No residential colleges.  No need to obsess over that because: Would you turn down Stanford on the basis of choosing not to go in that direction? (I also think Harvard just has a house system.  Duke has a classical system as well).  Most dorms are above average quality for dorms, but I remember some having more culture/interesting things happen than others and it usually wasn't the nicer/newer ones.\n\n3)Extremely\n\n4) This ties to the school spirit thing.  Emory is a very academically focused school with D-3 sports and falling Greeklife participation so it will NOT have the classical school spirit or a social scene that the movies or media will tell you that all colleges have (this mostly achieved by sports and Greeklife), but many people still manage to be quite sociable and have fun somehow.  You (and Emory) just have to be more creative and outgoing to be sure you take advantage of what social life there is.  Some things that students tend to enjoy, when they happen are Dooley's week.  And of course things happen on campus for students to socialize frequently.  Either way, if you mainly want a party or rah rah atmosphere but with a good reputation, Emory ain't the place.  Emory is a very \"academics first\" school and most people's attitudes towards their academics and social life reflect it.  Although, a pre-law or business person may  end up with more time to socialize, especially in easier semesters than a lot of students at Emory who are hard STEM, pre-med, or in other very hierarchical majors (like QTM).  Of course there are cool clubs and people do what they want for fun.  You are an individual with friend groups and it is college in a major metro area that hosts lots of music concerts and other large events/festivals.  Anyone who wants to do something has plenty to do if they are willing to do it.\n\n5) Emory has its own shuttle system (and I think college student MARTA fare) that can get you to a lot of key centers in the Atlanta area.\n\n7) There are many things likely unique or weird about the school, but I won't bother because I don't think they actually matter (and I don't believe in this question because one may do research and find out what they said just isn't true and I am not like students at some schools who will serve as an uncritical hype man to yield your application especially for something like pre-law.  I don't care)\n\n8). This question is vague IMO, but there is a career center and many departments have their own undergraduate internship and fellowship programs.\n\n9) This is actually quite strong (and I think it even got better as they established some international internship and research oppurtunities):[http://studyabroad.emory.edu/](http://studyabroad.emory.edu/)\n\nTo my surprise, some peers are apparently weaker in this arena.  Emory seems to have an awful lot of academic departments that have their own connections with certain schools and programs abroad and thus host their own study abroad programs.  It seems that some private schools at roughly Emory's caliber have developed this much less and instead use the national pool of programs to send students abroad that way.  This could be because Emory was mainly a regional teaching university (versus a research powerhouse) until like the early-mid 90s so a lot of the individual academic departments had poured an awful lot of resources into undergraduate education and oppurtunities specifically for undergraduates (some departments like chemistry, history, and environmental science even seem to have lots of scholarship and fellowship money to just throw at undergraduates in addition to all the EC and co-curricular opps they offer).\n\n&#x200B;\n\nLastly, I recommend you to consider some majors/academic areas you may be interested in studying because most schools, especially places the caliber of Emory and the super elites like Harvard and them (and the analogous elite LACs) will not have a \"pre-law\" major or \"track\".  The track is doing what you need to do to keep a competitive GPA and get a good LSAT. Go onto departmental websites of interest and see what you can find out.  If you come on reddit or some college advice website first.  Many of us, especially at this tier of school will either overly hype the school up or talk some trash, so do some of your own research and decide if it is worth making further inquiries.  Going on the school and some departmental websites and social media and digging around can give you an awful lot of information about what goes on and what the school values.  And you can even find student publications like student newspapers that reveal the values and ways of thinking students have at each school as well as what is going on that generates buzz (note that no school is perfect and you'll find that students at very top schools like Stanford and Harvard are VICIOUS in terms of how critical they are about things at their schools because they want those places to always live up to the excellence they claim): [https://emorywheel.com/](https://emorywheel.com/)\n\nThe Spoke provides student perspectives of Emory from a more satirical point of view: [http://emoryspoke.org/](http://emoryspoke.org/) so can also give some idea of the culture or what students think about certain things.\n\nAnd if after all this, you still remain interested, go visit the place (if that becomes an available option again).\n\nPlease also look into the non-existent pre-law specific academic \"requirements\" (there are some recommendations about what competencies they want you to develope because it isn't about just \"getting in\".  Believe it or not, some schools, including maybe even some T14s, still rank and grade students, meaning it isn't enough to just \"get there\").  You can use Emory's pre-law advising website that I posted up there to start. And lastly, come to Emory if you want to LEARN.  I don't think it fits people well who may desire more of a \"State school lite\" (I just noticed you mentioned the social thing and then school spirit as two separate questions kind of suggesting that this is maybe something you may want) social experience.  Emory and most top tier privates are not the place for that (even the ones with D-1 sports like Ivies. Most Ivies, which are D-1, are also very \"academics first\"(and I don't mean \"academics first\" in that the students really, really care about grades, because even those at party schools and lite party schools care about that.  I mean, these places have a larger contingency students who are actually eager to do the academic aspect and are willing to take on academic challenge \"just because\". And due to this, they have more students who are willing to have a tamer \"social life\" that may not send them in the direction of being constant partiers or anything like that.  They'll have their group of ECs, co-curriculars and friends but may find alternative avenues to enjoy themselves that may or may not involve academics. Academic challenges are viewed as less of an oppressive chore or obstacle that takes them away from their social life at many of these places.  You have to decide if you want to be at a school with a greater share than normal of students who are like this vs. the \"I really just wanna finish my work, which I hope isn't too challenging, and then go play\") even if they may have a sports rivalry that is played up once a year), but there are a few that are that would also be great for a person to pursue pre-law.\n\nAgain, for pre-law, you just need good resume, good writing and thinking skills, good GPA/LSAT and you should do fine, especially if you come from a decently or highly selective school.  But you can easily do these things anywhere whether it is a full out party school, \"party school lite\", whatever.  As long as you have enough discipline to focus and keep your GPA in the 3.65-3.75 range (It seems some elite Law Schools drop the GPA and sometimes even LSAT score floor a little for students from top tier schools like Emory), and get in or near the middle 50 LSAT range, you should do quite well in Law School admissions (go view the details in the outcomes spreadsheets Emory provides.  Some of those T14s actually did provide info. back to Emory and it looks like some of them are playing favorites with Emory students because if you compare the stats needed to the middle 50, at least one component was a bit lower. Northwestern was quite notable).",
      "author": "oldeaglenewute2022",
      "created": 1591972311,
      "upvotes": 7,
      "replies": {
        "fulr4gi": {
          "link": "/r/Emory/comments/h7l71d/intrigued_student/fulr4gi/",
          "text": "Thank you, this was very thorough. I went to Emory’s virtual info session in May and did some online research; I just wanted to get a student’s perspective. Again thank you for your time. 😊",
          "author": "001smiley",
          "created": 1591974552,
          "upvotes": 1,
          "replies": {
            "fuls1fx": {
              "link": "/r/Emory/comments/h7l71d/intrigued_student/fuls1fx/",
              "text": "Yeah, those are de facto marketing tools (a virtual info. session), but they do depict what is possible if things go well.  Emory has some Youtubers now, so maybe you wanna go find them and see what they discussed or talked about because that is outside of the realm of the admissions office. But either way, you need to decide what you actually want.  You sound like you may prefer a more USC, Vanderbilt, Tulane, Michigan, Dartmouth (maybe Duke...but Duke has become much more academically oriented over time despite keeping the basketball fervor), or University of Miami type of environment (maybe Boston College too, which is a D-3 with football so they have some type of classical school pride apparently but that isn't normal for medium sized D-3s I don't think and many \"colleges\"/LACs outside of the most elite are known for HUGE Greek populations).  I put Emory as more similar to WUSTL and JHU than any other elite tier schools (and I consider all 3 of these as sort of \"Pre-professional UChicago lites\" but maybe with a bit more classical social vibrance)",
              "author": "oldeaglenewute2022",
              "created": 1591974906,
              "upvotes": 1,
              "replies": {
                "fumgps8": {
                  "link": "/r/Emory/comments/h7l71d/intrigued_student/fumgps8/",
                  "text": "Yeah, I plan on applying to some top schools but I’m just trying to add some in state schools in case I don’t get into those. I really appreciate your help though. 👍🏾",
                  "author": "001smiley",
                  "created": 1591985799,
                  "upvotes": 1,
                  "replies": {
                    "fumig7p": {
                      "link": "/r/Emory/comments/h7l71d/intrigued_student/fumig7p/",
                      "text": "I think you should apply to some in and out of state public schools (maybe some honors/scholarship programs) if only due to what u/BenedictCrumpledick mentioned.  If you are gonna be all in on pre-law, you may as well go somewhere where you might not have to obsess over GPA and make decisions based upon it (if you are in somewhere's top 75%, you can probably just do what you want and ride a curve/bank on being one of the best students in the case you run into a challenging course here or there.  I had a good friend back at Emory who transferred from some school in Texas, and thank goodness he wasn't pre-law or anything but he admitted that he could get away with just riding the curve when neccessary whereas at Emory he had to put in quite a bit of effort to do well even in his English major because of the standards being higher, classes smaller, and peers being much stronger).  Just something to think about.  You may also prefer the social environment at state schools.  A high achieving student can often take advantage of state schools to experience low risk academic challenges, movie\"esque\" college social life, and get coronated with resources and faculty support/attention because they do stand out so much.  So it has its advantages.",
                      "author": "oldeaglenewute2022",
                      "created": 1591986669,
                      "upvotes": 0,
                      "replies": {
                        "fumitx6": {
                          "link": "/r/Emory/comments/h7l71d/intrigued_student/fumitx6/",
                          "text": "Well I’m not stuck on a pre-law track. I just want to know if the college I’m applying to does a good job on helping students get into law schools or have some classes that will help me see if I’m really interested in law or classes that will help me when I get to the law school.",
                          "author": "001smiley",
                          "created": 1591986863,
                          "upvotes": 1,
                          "replies": {
                            "fumk4lf": {
                              "link": "/r/Emory/comments/h7l71d/intrigued_student/fumk4lf/",
                              "text": "Definitely look for schools with constitutional law and supreme court courses taught by polsci depts (Emory definitely has this) but often you'll find that learning history of certain topics via special topics courses in history or philosophy really help so.if schools make their course atlases public, just go to those depts for fall 2020 and spring 2020 and see what they have (if fortunate, there may be a full description or even course syllabus).   You should also look for oppurtunities for undergrads. to work directly with things happening at some Law School or centers associated with it.\n\n\nAgain, I think a lot of places have stuff like that so be on the look out and check out the different political science dept websites (they often have these programs because of the amount of law school applicants they produce).\n\n\nGood luck with your search! You'll find you have many great options.",
                              "author": "oldeaglenewute2022",
                              "created": 1591987510,
                              "upvotes": 1,
                              "replies": {
                                "fummgzw": {
                                  "link": "/r/Emory/comments/h7l71d/intrigued_student/fummgzw/",
                                  "text": "Thanks ☺️",
                                  "author": "001smiley",
                                  "created": 1591988676,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fulsxpt": {
      "link": "/r/Emory/comments/h7l71d/intrigued_student/fulsxpt/",
      "text": "I can’t really comment on the school since I am just enrolling this fall, but if your intentions are to go to law school, take this advice- choose an easy major that will enable you to get the highest GPA possible. Law school admissions are strongly numbers driven. Your LSAT score alone will account for about 40% of your application strength, your GPA alone will be about 30%, and everything else will compromise the last 30%.\n\nYou can retake the LSAT several times a year, but you only have one shot to get a high GPA. So choose an easy major that interests you, get a high GPA, study for the LSAT starting around the end your sophomore year. \n\nIf you have any more law school admissions related questions, I highly recommending subbing to r/lawschooladmissions.",
      "author": null,
      "created": 1591975289,
      "upvotes": 2,
      "replies": {
        "fumgtl2": {
          "link": "/r/Emory/comments/h7l71d/intrigued_student/fumgtl2/",
          "text": "Thank you so much! ☺️",
          "author": "001smiley",
          "created": 1591985852,
          "upvotes": 1,
          "replies": {}
        },
        "fulv04l": {
          "link": "/r/Emory/comments/h7l71d/intrigued_student/fulv04l/",
          "text": "The law school GPAs have fallen a bit so students have more wiggle room than you think. I wouldn't advise an easy major just to get a high GPA.  If they end up in an easy major because they like the content, that is okay. But they need to learn to write well and think critically before Law school and their LSAT and even more tedious majors like pols or history give lots of high grades if you just do solid work.\n\n Again, it looks like, based on the placement data, Emory students need to be competitive but not perfect to get into T14s. It is/was quite numbers driven though. But the numbers don't have to be as high as people think, especially coming from Emory or other lower grading than average elites. Let them do whatever they want.  As long as THEY enjoy and can thus do well in the major it'll be fine. There is also some evidence that they consider majors. I know I have seen STEM majors get into law school (even decent and top tiers) with lower than middle 50(sometimes significantly lower) GPAs so law schools are aware of grading difficulty and how it varies by major (it isn't like med. school where even STEM majors are expected to be 3.65-3.7+.  Law school GPAs are often kind of high simply because most apply coming from majors that grade easier, so it makes sense. The volume of Law School applicants has declines so much that they are still kind of superficial but can at least consider the academic pathway of the student.  The thing about a middle 50 is that the exact stats of the bottom and top quartile are not visible so don't matter as much once they've filled 50% of the cohort with stats they desire. Many LS middle 50 LSATs are populated heavily by a very narrow range of scores because they just want a certain median).\n\n The trends at Emory suggests that admitted students with lower than middle 50 GPAs often have middle 50 or higher LSATs so the LSAT, provided your GPA isn't complete garbage (I'll say below 3.5 or 3.4 depending on major) can compensate for that.  Some of these T14s were taking Emory several students in the low 3.6s and high 3.5s and it appeared it was because of the LSATs.",
          "author": "oldeaglenewute2022",
          "created": 1591976172,
          "upvotes": 0,
          "replies": {
            "fulwcd0": {
              "link": "/r/Emory/comments/h7l71d/intrigued_student/fulwcd0/",
              "text": "Everything you said is true but my point still stands. The reality of law school is that it is extremely expensive, even more so at a private university like Emory (try $60,000/year just in tuition). \n\nThe ideal scenario for applying anywhere is being above the 75th percentile for both GPA and LSAT. At Emory, these students often get 75%+ scholarships so it significantly eases the financial burden. Once you fall below the 75th percentile for either of these data points, your scholarship potential drops. Once you fall below the 50th percentile, it drops even further. If OP isn’t uncomfortable getting intimate with Sallie Mae, sure he could go into a STEM field. But again, that is not going to benefit him in the long run because 1) his GPA will more than likely be much lower than if he took a liberal arts major and 2) Your major doesn’t matter for Law School UNLESS you want to go into IP/Patent law, in which case you would need a STEM degree. \n\nr/lawschooladmissions is filled to the brim with neurotic gunners getting 99.5 percentile LSAT scores and getting into Harvard, Yale, and Stanford and the general consensus on that sub is that, for law school, your major doesn’t matter and you’re best off getting the highest GPA possible.",
              "author": null,
              "created": 1591976727,
              "upvotes": 1,
              "replies": {
                "fulyd9r": {
                  "link": "/r/Emory/comments/h7l71d/intrigued_student/fulyd9r/",
                  "text": "Yes these are indeed people who pursued IP...but I say just let them work for whatever GPA.  They don't have to contrive it or have it easily handed to them (and probably won't.  If the ease of the pathway needs to matter so much, I advise them just get into Yale or Harvard for undergrad because they have an awful lot or grade inflation in humanities and social sciences divisions vs. even a place like Emory.  Obviously that is highly unlikely and hard as hell so what I would do is recommend what I do for pre-healths. Unless you really want the challenging academic experience, go to a much less selective public or private where you'll do well in any division you try/entertain vs. most students.  I just don't see the obsession over elite undergrad. schools for these risky tracks if you want to avoid the most fruitful aspects of what they claim to offer. Go pay less to do \"basic\" and well somewhere else). Also, SM is considered a part of the liberal arts but I get what you are saying.  I don't know if scholarship potential is very high at places like HYPS (you can't barely even get into YS being paper perfect).\n\n In addition...I hate to say this, but I think a lot of people taking these offers to these private law schools have the money to afford them.  When I see some schools filling the cohorts of sub T14 or certain T14 schools with an awful lot of people, it tells me \"they just needed to get in and money wasn't an issue\" because if it was, they would turn it down because their stats don't suggest that they were scholarship tier.  I do agree with you if it is (And I think for Emory, there are more students like that than at other elites)..but for many, it clearly isn't.  They just need to get in.  In addition, it is possible that they can match the 75% of somewhere outside of the T14 and get a scholarship there and it would be relatively low risk to attend (they could be at like a top 30-40 that works).  \n\nBut I don't get the point of pursuing this track anymore if its job placement is precarious and you have to limit what you wanna pursue as an undergraduate AND mainly only shoot for a certain tier of law school to increase your chances of gaining entry to somewhere that lands a lucrative enough job.  But either way, I was merely talking about gaining entry and placing it in context of the standard Emory student.  The majority may not need scholarships for anywhere and can take some liberties  in choosing an academic track because they just need to be competitive.  You'd be shocked at how many people don't have to take out loans.   Boy how law school/law has kind of fallen....what a mess!",
                  "author": "oldeaglenewute2022",
                  "created": 1591977556,
                  "upvotes": 1,
                  "replies": {
                    "fum0v2c": {
                      "link": "/r/Emory/comments/h7l71d/intrigued_student/fum0v2c/",
                      "text": "I completely agree with you on the fact that private institutions do have their fairly large share of people who don’t need loans. My personal experience is different because my family has never been rich but I get what you’re saying. \n\nAt the end of the day, it is down to the individual to determine what is best for them. Not doing research before making such a large life choice is definitely a great way to shoot oneself in the foot. If OP wants to pursue STEM more power to him, but the risks definitely need to be considered. If it turns out law is truly on the decline, that’s something my peers and I will have to deal with in time.",
                      "author": null,
                      "created": 1591978733,
                      "upvotes": 1,
                      "replies": {
                        "fum5rtm": {
                          "link": "/r/Emory/comments/h7l71d/intrigued_student/fum5rtm/",
                          "text": "The only thing I could tell ANYONE, is to not over-rate these \"elite\" privates.  I've honestly gotten into advocating that high achievers apply more broadly to undergraduate institutions because they may get a scholarship or place into a great OOS honors program (and there are plenty) which run courses in a way that is less competitive than say an Emory or some high caliber private school, many of which run their survey courses like a scaled down version of state schools but just with much more well-prepared and competitive students and harder grading TAs/faculty that indeed expect more out of what is supposedly a well prepped student body.  \n\nIf one goes to an elite school for certain tracks, they should only go with an open mind even if considering a pre-law or pre-med, and this is ESPECIALLY if you might have to pay or qualify for a scholarship at the professional school.  If you have to run around and reduce risk and miss out on rigorous academic opps at the elite private, I say, even if you get a full Emory Advantage grant like I did, it isn't worth it.  Anyone deadset on these paths and who will not plan to consider anything outside of them should go to a whole school that is just easier for them to do well at.  I loved my time at Emory, but I can't say I'd recommend it to people who have to be more fearful and risk averse in terms of the academics.  Emory is a place that rewards students who are willing to immerse themselves in academics more than anything else, so much that it does not offer GPA based Latin honors.  You have to do an honors thesis to slap on that accolade and the thresholds for doing those in most depts are only like 3.5, so it isn't a place that goes overboard to reward superficial/highly manufactured numbers based achievements.  It wants folks to try to challenge themselves and hopefully dig deeply into an area.  That can become very hard if you have to mainly focus on protecting your GPA.  \n\nI also find that, at Emory, a lot of the \"easier\" instructors and whatnot are also mediocre or flat out bad instructors that don't care as much about student development or working with undergrads and unlike other places, it can be very noticeable.  I find that easier instructors elsewhere are more likely to be uniformly celebrated because they at least pretended to care about students so students can trick themselves into believing: \"Oh, they are just really kind and care about students, so that is why they make it so simple\"....at Emory, it is often clear \"I made this super easy to keep y'all away from me\", so the best way to benefit from Emory is more of a balancing act.   You need rec. letters (and mentoring, who wants to come to a place like Emory and not make any real connections with faculty?) from professors and the professors that write the best rec. letters/care the most about students or who are most likely to advise or help you through an honors thesis/any type of personal project more academic in nature are typically those with higher intellectual demands/standards or workloads (and this includes within social sciences and humanities divisions).  \n\nYou'd definitely want to take at least some of these instructors, but like with any major or academic pathway, you just do it in the context of a schedule where you can do well in most of your courses including that one.  It doesn't have to be \"easy\" perse, it just needs to be manageable to put out good enough quality work to do well in all of them.  I'm just very against trying to make it a cakewalk necessarily because someone needs to get into \"X\" after graduation.  Do cakewalks at a cheaper school that wasn't meant to challenge or push high achievers in the first place.  Often these places have lots of great advising and career development resources and tons of other oppurtunities as well so students can have the cake and eat it too.  Take all the resources and never feel academically uncomfortable...it is a win win.\n\nAnd again, I am not just talking about STEM as rigorous grading at Emory (it is at most places to be honest).  Things like political science and history can actually be quite intense if done right, but especially political science because even the undergraduate offerings and requirements focus more upon research and methods than pols. at most other schools and gets students to do research papers that uses those methods beyond the designated methods course (it also requires QTM 100 which many students find surprisingly intense).  I think this is a good thing because it teaches students how to actually function like practitioners and think critically in those fields vs. just \"learning some stuff and passing time before job or law school\", but I also think many of those courses end up grading lower than many anticipate for a social sciences division (most anticipate the easiest As in intro, only to come out with a B).  And regardless of the division, Emory's grade inflation is not as big as some Ivies and Ivy Plus schools that have it in both STEM and non-STEM subjects. \n\nI am willing to admit that the highest tiered Ivies probably deserve extra grade inflation in STEM because often their courses are a bit less standard and more difficult than lower tier elites, but I do not think this is really the case for humanities and social sciences.  Clearly a group of schools including Emory, JHU, Cornell, Vanderbilt, and Penn are holding on to some more \"old school\" norms of grading outside of STEM so you have to be careful of what you define as an \"easy\" major at a place like Emory.  There are many departments that would be characterized this way elsewhere but are just very different at Emory (psychology is a notorious case.  We may be the only or one of the only schools in a country that has a 2-part intro. psychology sequence with one being a glorified neuroscience course and the other being a slightly more interesting version of AP psyche.  Needless to say, many are taken aback by the former).  And again, I say just honestly view it more as: \"I want a pathway that has the right types of challenges, but isn't unreasonable\".  When you say \"easy\", that suggests that you mainly just need to ensure that most classes have a low workload, don't make you think much, and pretty much hand out A's for effort vs. quality of work.  This is surprisingly hard to come by and more departments that are actually like that are beginning to make students pay on the \"back end\" by instituting capstone courses (or in the case of history, colloquia) and requirements that hold students accountable for most of the stuff they were supposed to learn throughout the major and often these courses have a solidly high workload and require a challenging research project of some sort and don't just hand out high grades for the sake of not bothering the students.  Emory is a weird place in many respects compared to many of its closely ranked peers, so you have to keep a lot of different things in mind before choosing majors, courses, or anything (and you definitely have to go in knowing that basically the only numbers based award Emory tends to give is Dean's List.  Don't expect a \"Summa Cum Laude\" designation because you got a 4.0. \n WUSTL is like this too...schools may as well be siblings) even as a person that probably has to be more numbers focused.",
                          "author": "oldeaglenewute2022",
                          "created": 1591980679,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}