{
  "sid": "nfic80",
  "link": "/r/Emory/comments/nfic80/study_areas_for_unenrolled_students/",
  "title:": "Study areas for unenrolled students",
  "text": "Hi everyone! \n\nAre there any areas to study on campus (and with parking) for people who aren’t currently enrolled students? I’ve been struggling to find a library to study at in Atlanta amidst COVID closing most local libraries and coffee shops! Any information would be greatly appreciated! \n\nThanks!",
  "author": "ssharif",
  "created": 1621362773,
  "updated": 1634098084,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "gyls5cn": {
      "link": "/r/Emory/comments/nfic80/study_areas_for_unenrolled_students/gyls5cn/",
      "text": "Emory is not allowing unaffiliated visitors at this time for the same reasons other libraries aren't- https://www.emory.edu/forward/resources/policies-guidelines-protocols/visitor-policy/index.html",
      "author": "aileecat",
      "created": 1621365143,
      "upvotes": 6,
      "replies": {}
    },
    "gyn7k9w": {
      "link": "/r/Emory/comments/nfic80/study_areas_for_unenrolled_students/gyn7k9w/",
      "text": "chocolate café near emory allows you to sit inside but they close pretty early, and also golden drops cafe",
      "author": "EveningExit",
      "created": 1621388551,
      "upvotes": 1,
      "replies": {}
    },
    "gypsexa": {
      "link": "/r/Emory/comments/nfic80/study_areas_for_unenrolled_students/gypsexa/",
      "text": "Seconding chocolate cafe! I went there to study a lot this past year (after they opened the dine-in room) and it’s a very cozy environment. Usually there’s only 3-5 people in there nowadays, most people still get to go. Plus their coffee and food options are the bomb 🤑🤑\n\nDecatur square has restaurants & cafes with patios open. B-side breakfast/coffee place has a patio open, unsure about interior. Dancing Goats Cafe also has a nice back patio, the one near Ponce has a SUPER nice screen-in patio with cushy seating if you’re willing to drive that far. And the Starbucks on N Decatur RD also has a nice patio open.\n\nAlso I think the Panera near campus does dine-in now...?",
      "author": "beachkati",
      "created": 1621442838,
      "upvotes": 1,
      "replies": {}
    },
    "gyy42ax": {
      "link": "/r/Emory/comments/nfic80/study_areas_for_unenrolled_students/gyy42ax/",
      "text": "I wouldn't waste your time on the libraries, it has been hard enough for current Emory students to get into them for longer than 3 hour regulated appointments. Most coffee shops on campus like Kaldis are shut down for in person dining/studying. Golden drops off campus is good and has great coffee and food!!!!",
      "author": "Darwins_Finches1",
      "created": 1621607588,
      "upvotes": 1,
      "replies": {}
    }
  }
}