{
  "sid": "jgq56q",
  "link": "/r/Emory/comments/jgq56q/bio_142_this_spring/",
  "title:": "Bio 142 this Spring",
  "text": "I had Dr. de Roode this semester and his classes are really what got me through a tough semester. He won't be teaching 142 so I thought I'll take Dr. Cole but Dr. Cole's class is in person and I'm going to be off campus. I'm left with Dr. Reyes, Dr. Abreu, and Dr. Campbell. I don't know anything about these professors, so who should I go for? I'm honestly considering not taking 142 at all and maybe taking it next spring when Dr. Cole or Dr. de Roode are teaching because I know how important this class is for MCAT and med school.",
  "author": "blueravenclaw29",
  "created": 1603469585,
  "updated": 1634099276,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "g9sb9j4": {
      "link": "/r/Emory/comments/jgq56q/bio_142_this_spring/g9sb9j4/",
      "text": "I don’t know enough about these professors but you probably should not wait a year for the second part of an intro bio class that builds upon some parts of the first semester. Check ratemyprofessors and try attending their sessions during add/drop/swap next semester and find one that works for you.",
      "author": "meekp832",
      "created": 1603479438,
      "upvotes": 6,
      "replies": {}
    },
    "g9splyf": {
      "link": "/r/Emory/comments/jgq56q/bio_142_this_spring/g9splyf/",
      "text": "Adding to the don’t take it later boat, but also I had Dr. Abreu for 141 a few years ago and he was pretty chill.",
      "author": "kissingfish",
      "created": 1603486181,
      "upvotes": 5,
      "replies": {}
    },
    "g9sh4no": {
      "link": "/r/Emory/comments/jgq56q/bio_142_this_spring/g9sh4no/",
      "text": "Eh.....the quality and rigor of bio (outside of maybe Cole, De Roode, and Spell) has deteriorated so much that I think you should really not be betting on 142 to help you that much. You should prepare to take a few more research/analytically focused NBB, bio, or chem upper division courses/instructors. Maybe ask about Reyes? We know that Campbell and Abreu are no higher than mediocre even in a normal semester. It is possible that Reyes is the same. I usually don't encourage hedging bets on the unknown but these instructors will likely return next year. \n\n If I had to guess, choose Reyes or Abreu if only because they'll at least use the case studies and active learning activities which could be useful(at times) in building \"some\" critical thinking whereas Campbell doesn't really believe in that and will run perhaps an even lazier course than Abreu.  But get this over with and maybe try to take Spell (genetics), Eisen (epigenetics) Antia(anything, but ideally immunology), Gerardo(evolution or her new lab), Civatello, Morran(new lab or evol) or Beck (new lab, ecology, or bio 240 if he ever teaches it) for an intermediate or upper division bio next year (really anything with a lit. discussion section will help you).  These will help you far more than 142. You should also quality control with chemistry (I would say Weinschenk or Soria only in the fall). There are many opps to develop your analytical and critical thinking abilities in things that will be on the MCAT.  The emphasis on experimentation in bio 142 overall(as in just by design of the curriculum and content in it) has gone down enough for no professor to have a huge premium put on them. More about the style than the content. You can learn signaling, genetics, and mol bio stuff in so many courses!",
      "author": "oldeaglenewute2022",
      "created": 1603482405,
      "upvotes": 2,
      "replies": {}
    },
    "g9stej3": {
      "link": "/r/Emory/comments/jgq56q/bio_142_this_spring/g9stej3/",
      "text": "It really saddens me Dr. De Roode isn't teaching 142 this Spring, I heard many good things about him",
      "author": "Dr_Yankee",
      "created": 1603487620,
      "upvotes": 2,
      "replies": {
        "g9t6zs4": {
          "link": "/r/Emory/comments/jgq56q/bio_142_this_spring/g9t6zs4/",
          "text": "Oh man, his class is legitimately the best part of an otherwise pretty shitty semester! I’m heartbroken!",
          "author": "blueravenclaw29",
          "created": 1603492518,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}