{
  "sid": "oyw22g",
  "link": "/r/Emory/comments/oyw22g/freshmen_classes_enrollment_questions/",
  "title:": "Freshmen Classes Enrollment Questions",
  "text": "Hello everyone!\n\nI had a few questions about class enrollment on August 9th for freshmen.\n\n1.\tDo we sign up for the classes that we put in our cart via OPUS? Is there like an exact method someone can detail?\n2.\tWhat are the enrollment appointments? Is that where we sign up for classes or is it through OPUS?\n3.\tThis is more of a personal question, but does my schedule look okay for a PPL (Philosophy, Politics, Law) Major on the pre-law track? \n4.\tIs Film 101 a popular class that many people want to take? Do the spots fill up fast?\n\nClasses: https://imgur.com/a/joKhjSo\nClass Names: https://imgur.com/a/NJNjmMV",
  "author": "ConformChild",
  "created": 1628211304,
  "updated": 1634097391,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h7wmwan": {
      "link": "/r/Emory/comments/oyw22g/freshmen_classes_enrollment_questions/h7wmwan/",
      "text": "Thursday looks pretty packed. Might be better to drop PE or take HLTH/ECS on Friday. Also, not entirely sure about this since I’ve never taken PE so don’t know how they’re like but might not be the best idea to go straight to another class after having taken a PE class.\n\nOther ppl would also probably tell you to take a seminar in a subject that’s new and outside of something you’re really interested in. Personally think it’s fine to take something in whatever though. \n\nThere should be a guide somewhere on how the sing-up process works. Don’t remember if it was online or in my email. Pretty much though an enroll button will appear in your shopping cart once registration opens. You reload 1-3 seconds before it starts, then it’ll show up. Click the boxes of the classes you want and press enroll. You’re done. You should also know how swapping works too in case you can’t get a class.",
      "author": "LostWindSpirit",
      "created": 1628231195,
      "upvotes": 5,
      "replies": {
        "h7y5wsa": {
          "link": "/r/Emory/comments/oyw22g/freshmen_classes_enrollment_questions/h7y5wsa/",
          "text": "How does swapping work?",
          "author": "evantap",
          "created": 1628265552,
          "upvotes": 1,
          "replies": {}
        },
        "h7y7mlp": {
          "link": "/r/Emory/comments/oyw22g/freshmen_classes_enrollment_questions/h7y7mlp/",
          "text": "Swapping is only available during the add-drop swap period which is after August 9th right",
          "author": "evantap",
          "created": 1628266276,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h7vqnqt": {
      "link": "/r/Emory/comments/oyw22g/freshmen_classes_enrollment_questions/h7vqnqt/",
      "text": "For number 3: Phil 110 is definitely a good class to start off with but I will warn you that it is very different from most other philosophy classes and some people just get logic or they don’t. If you don’t that’s ok but just make sure to go to office hours to get it down. Ppl is a pretty small major so you can take it easy your freshman year on the major courses, I didn’t start taking Phil classes until my second semester.",
      "author": "Squami11",
      "created": 1628212812,
      "upvotes": 3,
      "replies": {}
    },
    "h7yfne4": {
      "link": "/r/Emory/comments/oyw22g/freshmen_classes_enrollment_questions/h7yfne4/",
      "text": "https://it.emory.edu/opus/how_to.html\n\nif you go to this link and scroll down to the course enrollment section theres a bunch of pdfs that show you exactly what it looks like. i can also explain it tho: when enrollment begins at 12am, on your shopping cart page next to the buttons that say verify and stuff there'll be a new button that says enroll. you can checkmark all the classes you want to enroll in at once and click enroll and it'll do everything at once.",
      "author": "y9d8tsdt",
      "created": 1628269641,
      "upvotes": 2,
      "replies": {
        "h7yg75g": {
          "link": "/r/Emory/comments/oyw22g/freshmen_classes_enrollment_questions/h7yg75g/",
          "text": "oh and in regards to your sched: thurs is way too packed. 4 classes in a row is gonna be way too hectic and you need time for lunch too, so i would either take out a class or move one to friday. also for your other questions, yes film 101 is a very very popular class and it fills within seconds - also PE classes fill pretty fast and there arent many but a lot of people don't take it freshman yr",
          "author": "y9d8tsdt",
          "created": 1628269875,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}