{
  "sid": "q7mcj4",
  "link": "/r/Emory/comments/q7mcj4/is_there_a_shuttle_route_that_goes_to_a_marta/",
  "title:": "Is there a shuttle route that goes to a MARTA train station?",
  "text": "If so, which route and which station does it go to?",
  "author": "undertheheyoh",
  "created": 1634164373,
  "updated": 1634600269,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjl8gy": {
      "link": "/r/Emory/comments/q7mcj4/is_there_a_shuttle_route_that_goes_to_a_marta/hgjl8gy/",
      "text": "CCTMA goes to Decatur station.  Georgia Tech will stop at midtown station if you ask in advance though often the GT shuttle driver solicits for that stop in advance if you are lucky. If a S. Dekalb shuttle still exists then it also goes by Decatur Station (though I think you have to pull the stop signal for it).",
      "author": "oldeaglenewute2022",
      "created": 1634165767,
      "upvotes": 3,
      "replies": {
        "hgogtam": {
          "link": "/r/Emory/comments/q7mcj4/is_there_a_shuttle_route_that_goes_to_a_marta/hgogtam/",
          "text": "It looks like South DeKalb doesn't stop near the Decatur station.",
          "author": "iapetus3141",
          "created": 1634258344,
          "upvotes": 1,
          "replies": {
            "hgoloy9": {
              "link": "/r/Emory/comments/q7mcj4/is_there_a_shuttle_route_that_goes_to_a_marta/hgoloy9/",
              "text": "That's a damned shame\n Oh well, CCTMA (or 36) is it!",
              "author": "oldeaglenewute2022",
              "created": 1634260582,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgjvv5j": {
      "link": "/r/Emory/comments/q7mcj4/is_there_a_shuttle_route_that_goes_to_a_marta/hgjvv5j/",
      "text": "There are MARTA bus stops right by Woodruff Circle and you can take the bus (if there's a 6 bus going, you won't have to transfer buses, but you can just see what's coming on Google Maps, even though the buses aren't always prompt) to Lindbergh station",
      "author": "TomorrowMayRain065",
      "created": 1634170767,
      "upvotes": 3,
      "replies": {}
    },
    "hgk49m4": {
      "link": "/r/Emory/comments/q7mcj4/is_there_a_shuttle_route_that_goes_to_a_marta/hgk49m4/",
      "text": "Emory/cliff shuttles:\nCctma is Decatur station, others mentioned south dekalb… that route is going the same general route as cctma and I think cctma is more frequent (at least it used to be). These routes are commuter based so I’m not positive about late hours or weekend service. Check the cliff website\n\nMarta: check their website, but as someone mentioned a route goes to Lindbergh station\nRoute 6(I think it’s 6 don’t quote me) goes to Edgewood/candler park and it’s supposedly one of the most reliable routes in metro atlanta. \n\nPersonally, even tho Marta has gotten better in recent years, I would take cliff> Marta especially if I needed to be somewhere quickly and on time. \n\nAlso, be aware that all of these routes would suck during rush hour: cctma (because of Clairmont/n Decatur intersection, Marta 6 and other routes (because of briarcliff road)",
      "author": "Cuandoseescondeelsol",
      "created": 1634174770,
      "upvotes": 3,
      "replies": {
        "hgkjxn4": {
          "link": "/r/Emory/comments/q7mcj4/is_there_a_shuttle_route_that_goes_to_a_marta/hgkjxn4/",
          "text": "36 is their friend if they wanna get to the financial districts fast and they can just go kind of right outside of the Emory marble gate thing (near Glynn memorial) to catch that.  Route doesn't have the most awful (sometimes the highlands area can get rough though) traffic and is somewhat similar to Georgia Tech's (except it doesn't go through Clifton).  Goes to midtown station as its in town destination and Decatur station as its \"suburban\" destination.  The first is a direct shot to midtown (and you can take Gold or Red to the Buckhead area and others to downtown from that station) and the other gets you downtown pretty quickly via rail.\n\nI'm one of its biggest fans and  I rarely saw Emory students try it mainly because so many of us were sold on the 6 (I remember hearing about the damned 6 way too much when I moved in back in pre-historic times) which to me is a very round-a-bout way to get to \"fun\". Even in the suburban context, I think 36 now has the edge because that area near Church Street and Scott/Lawrenceville Highway has been well developed with the Walmart (not its biggest fan but if I'm being cheap...hey) and all the other other restaurants and shops (and I think a Whole foods or Sprouts over there.  To me this beats Briarcliff's closed down wholefoods and the associated shops in the area.  Also along Church-street the Indian market and restaurant area begins! Freaking love that area as a suburban area close to Emory) up there and of course it passes the Clairmont intersection with the Publix.",
          "author": "oldeaglenewute2022",
          "created": 1634182580,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}