{
  "sid": "ml402b",
  "link": "/r/Emory/comments/ml402b/best_oxford_professors/",
  "title:": "Best Oxford professors?",
  "text": "I know I’ve asked a shit-ton of questions recently, but I just want to be prepared lol. I’m a Biology major on the pre-med track; who are the best professors? Who are the “easier” ones? Who should I avoid taking classes from?",
  "author": "renaissancera",
  "created": 1617685138,
  "updated": 1634098603,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "gtjh6rc": {
      "link": "/r/Emory/comments/ml402b/best_oxford_professors/gtjh6rc/",
      "text": "Before anyone answers, let me make it clear that the easier professors are usually not \"the best\" for you if you are pre-med (I'm assuming you get that but I want to be sure).  The pre-med core courses need to have high quality and the \"right\" type of rigor to help you later on. I will PM you what some MCAT passages in the STEM sections supposedly look like (as in practice passages from AAMC), and it is clear that prepping for it won't be pleasant if you took crappy STEM courses in areas like chem and bio simply because they were reportedly easier.  Luckily Oxford has a solid amount of standardization though (vs. main) based on what I've heard and seen in syllabi.  You should at least aim to take medium rigor(in terms of how they assess as the raw graded workload will probably be similar across professors but some will write assessments, high stakes and lower stakes, that build MCAT/scientific thinking skills better) professors who are good at teaching the material (or at least good at motivating students to learn it beyond memorization and algorithmic learning. Learning to apply at high levels and recognize concepts in the context of real research should be your goal. Learning and retaining content/details will not suffice).\n\nTake the best taught /most intellectually rigorous pre-med core courses your schedule/background can handle (take balanced schedules when you choose those types of teachers so you can put your best effort in and learn as much as possible, but don't outright dodge all of them out of fear.  You don't have to be perfect, especially early in your undergrad career).  Basically allow Emory/Ox give you the advantage it is supposed to give over much less competitive/selective schools (there isn't much of a prestige bump at elite UG programs for med. school dmissions beyond the home med. school anyway.  You either take advantage of the opps and higher level of learning offered and do solidly in those or you don't. And doing so usually results in an MCAT advantage where a bigger range of GPAs have high MCAT scores than at schools that mostly offer less rigor/the right kind of rigor so typically med. schools end up taking a larger range of GPAs from elite schools)\n\nThere is room to develop yourself and have a nice increasing GPA trend and end with a strong GPA before applying) and then maybe pivot outside of that group to pad your STEM GPA if needed.  Like take elective biology courses that are straight-forward, grade easier or have more intuitive content. An example I LOVE highlighting is evolutionary biology on main.  Course emphasizes the type of thinking the MCAT demands (lots of experimental design and graph/data interpretation oriented problem sets and exam items and weekly primary scientific literature reading) but has super intuitive concepts so moving from simply memorizing and having a basic understanding of those basic concepts to interpreting them in context of real research studies isn't too hard and most people get strong grades in it.  It's definitely one of the lowest risk upper division/intermediate bio courses that builds MCAT skills.",
      "author": "oldeaglenewute2022",
      "created": 1617687874,
      "upvotes": 7,
      "replies": {
        "gtkuxfe": {
          "link": "/r/Emory/comments/ml402b/best_oxford_professors/gtkuxfe/",
          "text": "Thank you so much!",
          "author": "renaissancera",
          "created": 1617722871,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}