{
  "sid": "pspv06",
  "link": "/r/Emory/comments/pspv06/any_film_students_here/",
  "title:": "Any film students here?",
  "text": "I just submitted my ED application to Emory and I’m obviously really hoping to get in. I am very passionate about filmmaking and while I know Emory isn’t exactly known for its film program, I love everything else about it so it’s my first choice of schools. \n\nIf there are any film students on here who can comment some general advice/ thoughts on Emory’s film program please do so, and hopefully I’ll see u on campus next year!",
  "author": "Scoop500",
  "created": 1632251977,
  "updated": 1634096872,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "he5d3vp": {
      "link": "/r/Emory/comments/pspv06/any_film_students_here/he5d3vp/",
      "text": "Hi! I’m a film and media studies major here at Emory. If you have any specific questions feel free to ask! \n\nI can’t think of anything that sticks out off the top of my head, but I guess the most important thing is to build relationships with your fellow students and your professors. You have to be very proactive about seeking out opportunities in the film program because that’s the only way you’re going to get anywhere. There’s some really cool opportunities for film majors but they usually aren’t presented to you upfront, instead you’ve got to build relationships w your profs and they’ll start approaching you about opportunities. Also, there’s an Emory filmmakers facebook page which (if you end up getting accepted to Emory) you absolutely NEED to join. They post a bunch of internship and job opportunities in there and that’s actually how I got my current job as a creative consultant in the MediaLab (I teach students how to use Adobe Premiere Pro).",
      "author": "katnissjul",
      "created": 1632522871,
      "upvotes": 3,
      "replies": {
        "hemkzqe": {
          "link": "/r/Emory/comments/pspv06/any_film_students_here/hemkzqe/",
          "text": "What are the classes like as a film and media studies major? What’s the level of difficulty and workload? Is it easy to keep a high gpa?",
          "author": "Jamie_Diamond_Hands",
          "created": 1632854347,
          "upvotes": 1,
          "replies": {
            "hew8o8o": {
              "link": "/r/Emory/comments/pspv06/any_film_students_here/hew8o8o/",
              "text": "There are production and film studies classes. It can be difficult to get into the classes you want at the Atlanta campus, but at Oxford it is not as hard to get into the film classes. Oxford has less film classes (I only was able to take screenwriting, introduction to digital video, and screenwriting at Oxford), but it is easier to get into the ones you want. So Oxford film kids and Atlanta campus film kids pretty much are equal in terms of how many film classes they’ve taken by their junior year. \n\nI love my film classes, and I have never had a bad professor. I think the film department is one of those rare cases where there isn’t really a single bad professor in the department. The classes are so interesting, compelling and never boring. I would recommend taking Film 101, 102 and 107 before your junior year because they are prerequisites for a lot of other film classes. However, once again they can be hard to get into. \n\nYou can either choose to focus in production classes or theory/film studies  classes. There is also the option to get a BBA in film management if you’re interested in becoming a producer or focusing on the film side of things. There’s also the option to concentrate in documentary (which I am doing). \n\nThe workload isn’t too bad, there can just be a lot of reading and essays. I’d assume the workload is probably pretty moderate in comparison to other majors, maybe a tiny bit more work if anything. It’s not always the best idea to take more than 2 production classes in a semester because those classes end up taking up a LOT of your time and if you want to do well you have to put a lot of time and effort into your projects. Generally, the film classes aren’t difficult, but they can be a lot of work. If you are able to put in the amount of work that the professor expects of you in the class, you will do well. With that in mind, it’s not too difficult to keep up a high GPA, you just have to do the work. \n\nThe most important thing is trying to get close to your professors and other film students. Find out who the other film majors are and offer to meet them for lunch or something. Build relationships with them because that is how you find people to work on projects with. The professors, especially in production classes,  in this department are very engaging and are almost always looking at ways they can help students with outside projects. They’re a great resource if you’re just making a film and you want their input and their assistance. Reach out to them, go to their office hours, etc. The more you know them, the more that they’re going to contact you for awesome opportunities. \n\nI would strongly recommend doing a directed research project during your freshman or sophomore year. You would complete a research paper or a production project under the guidance of a specific professor. I completed a research paper under the film professor at Oxford, and because I collaborated with him and got to know him better, he recommended my name to the department chair at the Atlanta campus who reached out to me about completing another directed project that I am actually getting compensated for. Building relationships w your professors is so important. A lot of them have industry connections and they will get contacted about opportunities that they’ll share with their students. Build connections with them so they’ll reach out to you about internships and projects. \n\nI think the most important thing about being a film major is that you have to be very proactive. Being passive and just waiting for opportunities to come to you simply does not work. Apply for contests you hear about, submit work for competitions, apply for internships, etc. Getting a film major is essentially useless if you don’t make connections because you could literally learn everything online. Film school is essential for networking; that’s what makes the degree worth its money.",
              "author": "katnissjul",
              "created": 1633034576,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}