{
  "sid": "p0iq9n",
  "link": "/r/Emory/comments/p0iq9n/do_i_need_to_officially_transfer_my_credits_for/",
  "title:": "Do I Need to Officially Transfer my credits for Pre BBA to get \"Credit\"",
  "text": "I have a question regarding the AP credits I should transfer over. I heard that pre-BBA students don’t need to officially select to transfer the AP statistics credit for credit in ISOM 350, the AP statistics credit only needs to be posted on the transcript, is this true and is it true for all BBA pre-req classes?\n\nWhat does it mean for an AP class to be posted on my transcript, does it mean that the class only needs to be on the transcript or does it mean that it has to be on the transcript and it needs to have the credits transferred?\n\nI ask this since I have AP credit for AP ENG Language, AP Calculus BC, AP Macro econ, AP Micro econ, AP Statistics, AP Physics, and AP Computer Sci but Emory only allows me to transfer 12 credits. Do I need to officially transfer the credits for pre-BBA class reqs because on the pre-BBA website it says that as long as the classes were posted on the transcript then it does not need to be repeated? Does this mean that I can just officially transfer all the credits that fulfill general education requirements like my AP ENG, AP PHSYICS, and AP COMPUTER SCIENCE credits in opus while also getting “credit” for the required pre bba courses?\n\nI think the reason AP Statistics does not need to be transferred over as credit for pre-BBA students is because it does not have a course equivalent at Emory College, but all the other pre-BBA requisite courses still need to be transferred over in OPUS right? So I should be transferring AP Lang, AP Calc, AP Macro and Micro Econ for the most efficient fulfillment of pre BBA requisite course credits right?",
  "author": "evantap",
  "created": 1628443171,
  "updated": 1634097367,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h8726kc": {
      "link": "/r/Emory/comments/p0iq9n/do_i_need_to_officially_transfer_my_credits_for/h8726kc/",
      "text": "I think Calc BC counts as 6 credit, not 3. I’d do Calc, english, and one of micro or macro ( doesn’t matter). You are correct about stats, and somebody correct me if I’m wrong, but OP wouldn’t have to take macro econ either.",
      "author": "sunconurelover",
      "created": 1628447176,
      "upvotes": 1,
      "replies": {}
    }
  }
}