{
  "sid": "mxxjue",
  "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/",
  "title:": "[Help] International Studies/[insert region] Studies majors, how was your experience?",
  "text": "International relations and politics have always been my main interests. But, I'm afraid that Emory is not whatsoever known for this major (and couldn't find enough reviews of Emory's program). \n\nI'm still leaning greatly toward Emory, though not sure whether it's suitable for my interests. So, how was your experience? \n\np.s. if that helps, I'm an international student.",
  "author": "Utter-Confusion",
  "created": 1619313174,
  "updated": 1634098200,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "gvrup7m": {
      "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/gvrup7m/",
      "text": "I don't know much about the program but niche ranks it 28, and the two people that I know that did it did well. One is an aide at the white house, the other worked for the Office of International affairs before going to law school.",
      "author": "91210toATL",
      "created": 1619314753,
      "upvotes": 3,
      "replies": {
        "gvs5tlv": {
          "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/gvs5tlv/",
          "text": "Interesting and very informative. Thank you! It seems like there is no international studies majors here lol",
          "author": "Utter-Confusion",
          "created": 1619321234,
          "upvotes": 3,
          "replies": {
            "gvs9sa2": {
              "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/gvs9sa2/",
              "text": "Actually there seem to be quite a few surprisingly. I was actually talking to a friend about the surprising number of international studies majors I see in the class of 2025 page. Also I think Emory has generally very strong politics programs because of its connection to Jimmy Carter and whatnot",
              "author": "Dazzling-Tax-3591",
              "created": 1619323626,
              "upvotes": 6,
              "replies": {
                "gvsciyx": {
                  "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/gvsciyx/",
                  "text": "well that helps. Thank you so much! btw, where exactly is the class ‘25 page? Or do you mean the one on Instagram?",
                  "author": "Utter-Confusion",
                  "created": 1619325356,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gvv2bab": {
              "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/gvv2bab/",
              "text": "I'm an international studies major lol. I felt the same way, but poli sci program is pretty big at emory, so you're likely to find a lot. I would say, it probably helps that you're a son of a diplomat. that's a nice CV to have. maybe you can ask him about what i ttakes to get that sort of position.",
              "author": "emoxfordjj1",
              "created": 1619387108,
              "upvotes": 3,
              "replies": {
                "gvyzafr": {
                  "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/gvyzafr/",
                  "text": "Thank you for the reply! In what ways is the program big? An elaboration would be much appreciated.",
                  "author": "Utter-Confusion",
                  "created": 1619468575,
                  "upvotes": 1,
                  "replies": {
                    "gw6p2m8": {
                      "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/gw6p2m8/",
                      "text": "I meant big in terms of a lot of people participate in the poli sci program (major minors). there are so many faculty advisors as well that can assist you, and poli sci department often hold events where successful people tell you what you can do with the major. The one problem I have is that the website for major requirements seems outdated,  and when you have your advising meeting about classes you need to take, it actually sounds kind of confusing because some classes may not always be considered \"fulfilling the major\" requirements in the future when you graduate. It's helpful to use the degree tracker on OPUS.",
                      "author": "emoxfordjj1",
                      "created": 1619625713,
                      "upvotes": 2,
                      "replies": {
                        "gw8fhoe": {
                          "link": "/r/Emory/comments/mxxjue/help_international_studiesinsert_region_studies/gw8fhoe/",
                          "text": "Thank you!",
                          "author": "Utter-Confusion",
                          "created": 1619652648,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}