{
  "sid": "r99akw",
  "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/",
  "title:": "Thinking about BBA+QSS Double Major",
  "text": "Straight up is the track doable, and how hard?",
  "author": "ShinobiBrandon",
  "created": 1638684919,
  "updated": 1639518385,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hnc1dj1": {
      "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnc1dj1/",
      "text": "Not a qss double major but I’m a bba and biology double major. Def not easy, not the most fun. But qss should be better since it’s a program that exists within GBS. You’ll be taking about 1 or 2 more classes than the usual student basically. The track is doable I know people who have done it.",
      "author": "Korean_Yezus420",
      "created": 1638719339,
      "upvotes": 7,
      "replies": {
        "hncbug8": {
          "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hncbug8/",
          "text": "i’m graduating early from oxford so i’m taking more credits a term, so would i still need to take 1-2 more classes when i get to atl.",
          "author": "ShinobiBrandon",
          "created": 1638723730,
          "upvotes": 3,
          "replies": {
            "hncc0q4": {
              "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hncc0q4/",
              "text": "Not sure on the logistics of it all but you can ask your bba advisor or reach out to Anna gibbons, she knows all of her stuff and can plan out all your classes for the rest of your time at Emory in a simple 10 minute meet with her over zoom.",
              "author": "Korean_Yezus420",
              "created": 1638723802,
              "upvotes": 2,
              "replies": {
                "hncv9lt": {
                  "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hncv9lt/",
                  "text": "ok thanks man",
                  "author": "ShinobiBrandon",
                  "created": 1638731118,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hnrf80z": {
          "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnrf80z/",
          "text": "Bba and bio double major!??! How is that going?",
          "author": "ilikehoodies209",
          "created": 1638994702,
          "upvotes": 1,
          "replies": {
            "hnrfd9a": {
              "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnrfd9a/",
              "text": "Not fun :’) bahahah it’s pretty terrible ngl doable but hard to care abt my bio classes cuz I don’t rly care abt it anymore.",
              "author": "Korean_Yezus420",
              "created": 1638994758,
              "upvotes": 2,
              "replies": {
                "hnrfkam": {
                  "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnrfkam/",
                  "text": "But what made you do it in the first place? I’m asking bc I was thinking about it too but it just seems like there’s too many credits. I assume you’re doing a bio ba?",
                  "author": "ilikehoodies209",
                  "created": 1638994832,
                  "upvotes": 1,
                  "replies": {
                    "hnrg0zv": {
                      "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnrg0zv/",
                      "text": "I was premed until this year which is my senior year, and decided I didn’t wanna be a doctor anymore cuz I was in it for all the wrong reasons. So I added bba and have to go for another year. Instead you should consider the bba and health innovation track. You can def do it in 4 years I just switched career tracks late.",
                      "author": "Korean_Yezus420",
                      "created": 1638995008,
                      "upvotes": 2,
                      "replies": {
                        "hnrgryt": {
                          "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnrgryt/",
                          "text": "Lol you read my mind, I’m also contemplating switching out of premed to do business and health innovation but I keep changing my mind back and forth. Sometimes I would feel the urge to just get through all the prereqs and do med to the best of my ability, but I’m bad at chem and being split is really taking role on my academics, mainly bc I’m constantly worrying about two different fields at the same time so studying for classes like accounting really takes away from dedicating more time to chem. Idk, I’m really lost. What “wrong reasons” were you having and what made business seem attractive enough to add another year? Sorry if this is a lot of questions",
                          "author": "ilikehoodies209",
                          "created": 1638995296,
                          "upvotes": 3,
                          "replies": {
                            "hnrhhqc": {
                              "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnrhhqc/",
                              "text": "I just wanted money but then realized there’s a shit ton of things in this world that can make money besides the traditional doctor or lawyer stuff. Another thing is, luckily my parents are well off enough to pay for my undergrad tuition, but won’t support my med school tuition and stuff like that, so I’d be in debt and all that extra years of schooling and stuff seem awful. It’s also just what your passionate about ya feel? I was so tunneled on being a doctor I never realized I had interests in business and stuff. You just rly gotta ask yourself if it’s worth it for you.",
                              "author": "Korean_Yezus420",
                              "created": 1638995568,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "hnri3e9": {
                          "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnri3e9/",
                          "text": "Do you think you would regret not going through with med? Like were you every passionate about science or thought you would really enjoy working in healthcare? Or was it really just for money? Money is a large part to how I think too but I’m also worried if my personality can take on the b school and the business field in general. What area depth are u doing in b school?",
                          "author": "ilikehoodies209",
                          "created": 1638995794,
                          "upvotes": 1,
                          "replies": {
                            "hnriffh": {
                              "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnriffh/",
                              "text": "Brother I am one of like the most introverted people out there and if I can do it, so can you. I managed to get an internship while working on being extroverted and meeting new people. I mean maybe I’ll regret it? Who knows, but I’ll always know that I could have been a doctor and I know that I could do it I just choose not to. I’m going into healthcare consulting so I’ll still be in the healthcare industry and possibly working in ERs and stuff so I found a nice balance between the two fields.",
                              "author": "Korean_Yezus420",
                              "created": 1638995919,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnfg1t0": {
      "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/hnfg1t0/",
      "text": "Begging Spring 2022, there’s gonna be a new econ + cs joint major. Highly recommend!",
      "author": "pagliaccibrus",
      "created": 1638770753,
      "upvotes": 2,
      "replies": {}
    },
    "ho7c9dj": {
      "link": "/r/Emory/comments/r99akw/thinking_about_bbaqss_double_major/ho7c9dj/",
      "text": "I'm bba psyc and an Ox continuee but doubling takes planning especially for QSS bc its one of the heaviest loads in ecas qss in general can be tough for ox continuees bc the limited number of qss courses at ox but you should talk to Anna Gibbons, BBA admission director and the BBA office to plan out all the required courses",
      "author": "cactuscat123",
      "created": 1639279682,
      "upvotes": 1,
      "replies": {}
    }
  }
}