{
  "sid": "l9qicd",
  "link": "/r/Emory/comments/l9qicd/im_in_a_bit_of_a_pinchtaking_too_many_hard_cs/",
  "title:": "I'm in a bit of a pinch(Taking too many hard CS courses at once)",
  "text": "Edit: For context, I'm a Junior on his fourth year in college. I lost a few credits during my transfer from NYU to here, so I'm graduating a semester late(in December 2021).\n\nDue to a scheduling error for the last few semesters, I haven't been able to take many of the CS courses required for my major. I find myself needing 7 CS courses before I graduate, all of them above 300 level. I am currently enrolled in 5 CS courses, and I already know this semester is going to be hell and possibly destroy my GPA.\n\nThis is my schedule right now:\n\nCS 326- Analysis of Algorithms\n\nCS 325- AI\n\nCS 329- Computational Linguistics(I'm thinking of dropping either this or AI, I've heard both are incredibly difficult).\n\nCS 350-Systems Programming\n\nCS 377- Database Systems\n\nHere are the options I've thought up:\n\n1. I can enroll in just 3 courses this semester, with all of them being CS. The theory behind this action is that I would lighten my load with the lowest number of credits I've ever taken. The problems with this: I would still need to take four CS courses next semester and I would still be charged at the full tuition rate despite only having 9-10 credit hours(from my understanding).\n2. I can enroll in 2 CS courses this semester and nothing else, allowing me to underload and be charged less money(but at a higher rate). If I go this route, I would unfortunately graduate in 3 semesters instead of two(I really don't want to do this since I'm already graduating a semester late due to lost credit hours during a transfer from NYU, but if that is what I have to do to preserve my GPA, I will do it).\n3. I can enroll in a full course load with three CS courses this semester+humanities and four next semester, hoping the humanities pad out my GPA. This would honestly kill me, but I think I would rather take 3 CS courses + a humanity than just 3 CS courses.\n\n&#x200B;\n\nThis seems like a sticky situation and it's not ideal in any way, but I still want to make the best of it. What would you do if you were in my shoes?",
  "author": "hakimbomadadda",
  "created": 1612140201,
  "updated": 1637410586,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "gllnoyy": {
      "link": "/r/Emory/comments/l9qicd/im_in_a_bit_of_a_pinchtaking_too_many_hard_cs/gllnoyy/",
      "text": "Talk to your advisor",
      "author": "iapetus3141",
      "created": 1612189704,
      "upvotes": 3,
      "replies": {}
    },
    "gljq2c9": {
      "link": "/r/Emory/comments/l9qicd/im_in_a_bit_of_a_pinchtaking_too_many_hard_cs/gljq2c9/",
      "text": "I would go for option 3. I’m a freshman taking 2 CS courses, 1 math course, and 2 humanities courses. Though the classes aren’t as hard (all 200-level) it’s a lot to deal with, so I get it. If you can’t handle taking 3 comp sci classes this semester, then you should definitely do summer courses or an additional semester instead of taking 4 CS classes next semester. Best of luck.",
      "author": "sthedragon",
      "created": 1612144058,
      "upvotes": 2,
      "replies": {}
    },
    "hl6ld88": {
      "link": "/r/Emory/comments/l9qicd/im_in_a_bit_of_a_pinchtaking_too_many_hard_cs/hl6ld88/",
      "text": "Wanted to follow up and ask what you ended up taking and how it went for you because I'm in a similar position right now!",
      "author": "dkknight137",
      "created": 1637276578,
      "upvotes": 1,
      "replies": {}
    }
  }
}