{
  "sid": "nd9m6s",
  "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/",
  "title:": "Transferring to Emory",
  "text": "I am an incoming freshman who was accepted into Emory’s class of ‘25. Emory has been my dream school for a while, but for financial reasons, I committed to another school. I am already having problems with the other school in terms of my housing and program placement that keeps being changed because of mix-ups on their end, and realized that I made a mistake not committing to Emory. I called the office of admissions, explained my predicament, and asked if it would be too late to submit my enrollment deposit, and they told me that there was no room for me this fall, so I have decided to go to the school that I committed to for a year and try to transfer to Emory for my sophomore year. My two questions are (1) How hard is it to transfer into Emory? and (2) Will my application be disadvantaged because I declined my offer this year?",
  "author": "juliaemmy",
  "created": 1621116112,
  "updated": 1639875423,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "gy9fekd": {
      "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gy9fekd/",
      "text": "Be careful with people saying it is \"easy\" because they were imperfect in high school and then got in as a transfer (I'm just sayin').  They had and you will have a COLLEGE record before applying to transfer.  Almost 80%(see page 13:https://provost.emory.edu/planning-administration/_includes/documents/sections/institutional-data/Emory-Common-Data-Set-2019-2020.pdf) of people who also had a COLLEGE record applying were denied transfer admission and I am willing to bet most of that 80% weren't just weak academically.  So while it is a high transfer admit rate for a top tier private, it isn't a cake-walk for most.  Clearly you need a good COLLEGE record.  Even many freshmen admits were imperfect (though excellent generally) in HS yet only 10-20% get in (luckily you were among them).  \n\nEither way, do not have lofty expectations. If you do not perform decently well at their college, you will be seriously disadvantaged.  Also please do not pass judgement on wherever you committed before you even get there.  Try to enjoy it and do the best you can.  Going in with \"I'mma just transfer\" mindset before even having a chance to work out what you need to is a sour note to start on that can affect performance if you aren't careful.",
      "author": "oldeaglenewute2022",
      "created": 1621117084,
      "upvotes": 10,
      "replies": {
        "gy9hkc7": {
          "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gy9hkc7/",
          "text": "I initially didn’t have any intentions of transferring after committing to the college that I am going to, but I have just been having so many problems with them recently that it is hard to be excited about going. I was initially offered entrance into their honors college, but because they were over-enrolled by 700 students they later told me that I would be given spring admission into the program that I wanted within the honors college. They didn’t tell me this until after I submitted my enrollment deposit, and they also messed up my housing and are saying that it can’t be fixed even though they admitted it was their mistake. I have tried to be positive about the situation, but it just feels like they promised me all these things to get me to commit and now they are going back on those promises. I understand that going into my first year there with a negative attitude will not be good for me, academically or socially, which is why I tried to go back to Emory, but was (expectedly) told that it was too late. At this point I have no choice but to make the best of it for at least a year, but Emory has always been my dream school and I feel stupid for passing up the opportunity. Who knows if I will feel the same after a year, but in the meantime I will still be preparing to transfer. Thank you for your advice!",
          "author": "juliaemmy",
          "created": 1621118243,
          "upvotes": 5,
          "replies": {
            "gy9j9oj": {
              "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gy9j9oj/",
              "text": "I guess I'm saying that many incoming Emory students are about to experience their share of transition problems as well and you have the summer and early part of when you actually get there to resolve it so you'll need to keep an open mind all while being annoyed and frustrated.  The transition and administrative stuff can be a nightmare in many places.\n\nAlso with regards to an honors college. Make it your goal to get the honors COURSES using AP/IB and placement exams if needed. Don't sit around obsessing over the amenities or housing that they often use to segregate honors from others (maybe your school has this). Be a go getter on this front and you may enjoy the academics more and be able impress Emory or wherever if you do decide to transfer.",
              "author": "oldeaglenewute2022",
              "created": 1621119157,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gy9jezm": {
          "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gy9jezm/",
          "text": "Ya this year the acceptance rate for freshmen was like 12%. I have a hard time seeing how this school can be easy to get in as a transfer. It might be easier but definitely not easy",
          "author": "Dazzling-Tax-3591",
          "created": 1621119237,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gy9e78b": {
      "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gy9e78b/",
      "text": "It’s very easy to transfer to emory. I failed 2 classes in high school and was still able to get accepted after my freshman year at GSU. That being said, transfers are ineligible for merit based aid, only need based. So I ended up not going to emory in the end. If you got money then you shouldn’t worry about transferring at all.",
      "author": "gsuboiboi",
      "created": 1621116431,
      "upvotes": 1,
      "replies": {
        "gy9g3os": {
          "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gy9g3os/",
          "text": "Yeah the whole reason that I didn’t commit in the first place was because I would end up having to take out loans, and my parents would be in debt because of me so the no merit aid is definitely something to consider. Tysm!!!",
          "author": "juliaemmy",
          "created": 1621117460,
          "upvotes": 3,
          "replies": {
            "gyhu7os": {
              "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gyhu7os/",
              "text": "Just know that if you decide to transfer to Emory, do not have any high expectations for financial aid. Transfer student do not get merit aid and married student will not qualify for most institutional aid. You will have to depend on pell grant, georgia Gteg (ga resident), hope/zell (ga resident), seog grant, $6000 Emory grant (max for married student), and federal student loans. \n\nTuition alone is $40k a year after all grants for me xD. Ouch. Need to cough up $20k a semester. Do not have a baby or get married during your undergrad years at Emory T_T. \n\nDepending on the aid you get, it might not be financially sound to transfer.",
              "author": "Fragrant-Whole4480",
              "created": 1621287261,
              "upvotes": 1,
              "replies": {
                "gylcinx": {
                  "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gylcinx/",
                  "text": "The Emory grant is definitely not $6000 max, even for transfer students. As a transfer student I had my entire tuition covered by Emory's University grant combined with Hope (not even Zell).",
                  "author": "beachkati",
                  "created": 1621358835,
                  "upvotes": 1,
                  "replies": {
                    "gyldt8z": {
                      "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gyldt8z/",
                      "text": "Wait what!? Are you a dependant or independent student? I was told for married student or with children, the max is only $6000. I cannot even submit an appeal due being married. My financial aid advisor even spoke to the higher up and still couldn't help me. I resign to fate that I would probably not attend because I can't afford/justify getting more loans - 80k for 2 years unless a miracle happens with my 100+ scholarship applications.",
                      "author": "Fragrant-Whole4480",
                      "created": 1621359356,
                      "upvotes": 1,
                      "replies": {
                        "gyprf7f": {
                          "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gyprf7f/",
                          "text": "Oh I see, I think I misunderstood your comment. I’m definitely marked as an independent now and receiving the same amount so I assume I was at the time of transfer? Honestly unsure.  But I’m not married so I’m assuming that’s the difference. It still strikes me as weird that they’d cap the amount for married students.",
                          "author": "beachkati",
                          "created": 1621442423,
                          "upvotes": 1,
                          "replies": {
                            "gyq6qh0": {
                              "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gyq6qh0/",
                              "text": "I'm just baffled that independent (maybe it's a policy for married/and or with child students idk honestly) cannot even submit appeals.",
                              "author": "Fragrant-Whole4480",
                              "created": 1621448775,
                              "upvotes": 1,
                              "replies": {
                                "gytx6pj": {
                                  "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gytx6pj/",
                                  "text": "Yeah that’s so beyond bizarre, I’m sorry that happened to you!! I’ll send good vibes that one of your scholarship applications pulls through",
                                  "author": "beachkati",
                                  "created": 1621523468,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hog4kbg": {
          "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/hog4kbg/",
          "text": "did you have perfect grades in gsu? i’m a freshman there right now, and i’m ending this semester with all high A’s except for one class (sadly it might be a high B). i’m just concerned that that one class will stop me from getting accepted.",
          "author": "wastohundo",
          "created": 1639441320,
          "upvotes": 1,
          "replies": {
            "hog7c33": {
              "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/hog7c33/",
              "text": "Yes. I did when i applied for transfer.that being said I know a few people who did have a couple of B’s and still got it. And those people decided to actually go. So it’s definitely possible.",
              "author": "gsuboiboi",
              "created": 1639442646,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gylc687": {
      "link": "/r/Emory/comments/nd9m6s/transferring_to_emory/gylc687/",
      "text": "I believe that the transfer acceptance rate hovered around 18% for this year's incoming class, and I expect that to drop in the year you'll be applying. Those are (relatively) pretty good odds if you made it in as a freshman admit. My first advice would be to try to enjoy the school you're going to. Don't think about transfer applications until the Spring semester starts (they won't be open before then anyways). But prepare what you would need to transfer anyways, it's the same sort of thing that would serve you well staying at that school.\n\nForm a strong connection with at least 1, preferably 2 professors. Maybe a club advisor/mentor, too, if possible. You'll need strong letters of recommendation in a short time knowing these people. Get excellent grades. Be very involved on campus -- community service, interest clubs, executive committees, etc. Maybe get a part-time job or internship over the summer, iirc you can stick those on the common app. Try to learn a new hard skill that you can put on your application or list in what you did for a club. If you can win awards, that's great too.\n\nIf you do all of that successfully then you'll be as prepared as possible to transfer IF, when Spring semester hits, you still want to. If not then those activities will boost your resume and future internship/career efforts anyways, so it won't have been a waste of time.\n\nDefinitely don't screw yourself out of having fun or making friends on your first campus because you're so focused on transferring.",
      "author": "beachkati",
      "created": 1621358695,
      "upvotes": 1,
      "replies": {}
    }
  }
}