{
  "sid": "nnjpxj",
  "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/",
  "title:": "Screwed Up First Year GPA",
  "text": "Hi, I screwed up my first year at Emory. I got a D+ and a W on my transcript, and my GPA is below 3. I am worried about my grade because I was planning to apply to Goizueta school, but now I worry about getting declined. In addition, I am wondering if I shall transfer to other colleges. After all, the tuition at Emory is quite expensive. If I do not perform well at Emory, there is no reason to pay that much money for going to college. In the end, I just feel like I screw up my entire college life and I would like to hear any advice from you guys, just in general, about grades, application to Goizueta school, and what I should do in my second year.\n\nEdit: I just want to say thank you to all of you. Now I think I clear my mind and I will just move on and do better in my second year at Emory.",
  "author": "Store8421",
  "created": 1622280263,
  "updated": 1634098040,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "gzv4ic3": {
      "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzv4ic3/",
      "text": "Have you considered why your GPA may have been lower than you’d like? Recognizing why it was low will be the first step to self-improvement. You’ll need to do this regardless of whether you stay at Emory or transfer",
      "author": "premeddie19",
      "created": 1622290375,
      "upvotes": 14,
      "replies": {
        "gzv6ac9": {
          "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzv6ac9/",
          "text": "You are right, recognizing why is the first step. I think that I did not put as much effort into my online classes as into my in-person classes, and so I screwed up my online classes.",
          "author": "Store8421",
          "created": 1622291690,
          "upvotes": 5,
          "replies": {
            "gzv8fsm": {
              "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzv8fsm/",
              "text": "And most of your classes are in person next year right? As in you CAN return to campus? If so, that'll solve a lot of problems.  Many students don't start off with a great GPA and really turn it around (I actually sort of mentored a student who made a D in a first year STEM course and pretty much killed it sophomore year such that they have like a 3.6 or higher now).   Also, based on this, please realize that the b-school is NOT rigid and is looking for reasons to admit you:http://college.emory.edu/orientation/documents/2021/Track%20Advising%202021%20-%20BBA.pdf\n\nThey say the following in here:  \n\"We value resilience in the face of\nadversity. This means taking on full course\nloads and working through unexpected\nchallenges that may arise.\"\n\nSo this suggests to me that they will look for an upward trend and you should be able to do well based upon what you said.\n\nIn addition, are there any other academic pathways that you could possibly be interested in that you could turn into something lucrative?  Would you be trying to transfer to some place with a business school that is pretty much your standard default type of business track or are you open to other ideas?  If the latter, you could try to stay at Emory and develop some more in that area regardless of what happens with the business schools.  \n\nMy understanding is that not all business programs are particularly lucrative/safe options for high pay (they don't have the network, career center, and rigor of highly ranked business schools/those associated with well-regarded universities), so I am unsure that would be the best idea.  It would make more sense to seriously consider transferring if your other interests are not offered at Emory (think engineering, journalism, etc), or if Emory is really breaking your family's bank and you envision yourself in a \"risky\" major where you don't have much ideas of what people can do with it career wise (and even there, Emory appears to be getting good at helping students figure that out, especially if it is in the humanities and social sciences).",
              "author": "oldeaglenewute2022",
              "created": 1622293182,
              "upvotes": 3,
              "replies": {
                "gzvb7o1": {
                  "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzvb7o1/",
                  "text": "I really appreciate your response. Next year my classes are basically all in person, so I guess I would perform better in that case. You are right, finding another interest would be a good idea. I will see if I could find any other academic paths that I am interested in. After reading your response and the link, I think I shall stay at Emory, and put more effort into every class sophomore year and see how things turn out. Again, really appreciate your response, you give me a lot of hope.",
                  "author": "Store8421",
                  "created": 1622295010,
                  "upvotes": 3,
                  "replies": {
                    "gzvbubq": {
                      "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzvbubq/",
                      "text": "You're welcome.  Yeah, maybe consider sophomore year an oppurtunity to seriously explore.  I imagine even more so than normal with the online courses and Covid, people were just trying to \"make it through\" freshman year and the academic part felt less like exploration and more like monotonous chores.  Perhaps use the GER requirements you have left to choose some well-regarded courses or professors that have nothing to do with business to at least get you excited about learning again. And no doubt the added social context of the experience will help you as well.",
                      "author": "oldeaglenewute2022",
                      "created": 1622295404,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gzvnsto": {
      "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzvnsto/",
      "text": "Have you considered whether you are in the right major?  It’s so easy to follow the default path and fall into a sunk cost fallacy, have issues with family pressure or any number of other things, but sometimes the best thing to do is to change to something you are both skilled at and enjoy.",
      "author": "Timtam32",
      "created": 1622302162,
      "upvotes": 5,
      "replies": {
        "gzvqjt8": {
          "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzvqjt8/",
          "text": "Yeah, I will think about it to see if I really like what I am doing.",
          "author": "Store8421",
          "created": 1622303577,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gzw2qsu": {
      "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzw2qsu/",
      "text": "I wouldn’t recommend the transfer option. Transfers are based on your college grades. If you have below a 3 you won’t be able to transfer to any decently good business programs let alone an Emory Goizueta level program which is one of the best and most prestigious in the country. Business major heavily depends on your college brand so that wouldn’t be a great idea. Also you could major in Econ along with taking a few CS classes or do something like Econ+QSS+ B-school classes in Finance or something. You’re recruiting opportunities will be as good especially if you leverage the Emory network well. An Econ+ Math/CS/QSS will be amazing. Now this is the worst case scenario I told you. You’re chances at the B-school aren’t dead. Emory b-school admissions are among the most generous when compared to similar colleges that admit people into the B-school after 2 years. For example UVA, UNC, Berkeley all are way stricter for the B-school admissions after second year. Emory is fairly easy. As long as you do well from now on, you’re chances at the B-school remain solid.",
      "author": "Dazzling-Tax-3591",
      "created": 1622309820,
      "upvotes": 3,
      "replies": {}
    },
    "gzwusci": {
      "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzwusci/",
      "text": "Currently have a 3.0 Gpa. Had a W from first year biology. Made a D+ in first year chem. Got a C in bio 2. Made a C the second time I took chem. I recently re took bio and chem 1 online at another school. Finished orgo 1 and 2, and micro with decent grades. I will be going to pharmacy school in 2022. Grades are not everything. Two of my friends have 4.0s. Got denied from every medical school they applied to. Another had a 3.5 and got in three places. We both worked outside of the classroom doing lab work. They worked as a CNA, I worked as an EMT and pharmacy technician. Grades aren’t everything, but you do need to show an upward trend in the future. Your future isn’t ruined. Just don’t keep making below a C into senior year. Don’t worry you got this",
      "author": "elektoro",
      "created": 1622324022,
      "upvotes": 3,
      "replies": {}
    },
    "gzvfxha": {
      "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzvfxha/",
      "text": "The B school takes like 80% of applicants so I wouldn’t worry too too much. Was the D+ in a b-school prerequisite? (Or a prerequisite for a prerequisite, like Math 110?) If so, I’d talk to your advisor about retaking it, and make sure you do some reflection about what went wrong the first time so that you can approach it with better study skills next time. If it wasn’t, I think you’ll be fine as long as you can show an upward trend. But please try to take advantage of resources like the writing center or epass tutoring if you still find you’re struggling, and do it earlier rather than later!! They’re there to help and there’s no shame in needing help.",
      "author": "velmah",
      "created": 1622297841,
      "upvotes": 1,
      "replies": {
        "gzvi2vc": {
          "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzvi2vc/",
          "text": "The D+ is in a core course of the BBA+QSS major, so I am not quite sure how it might affect me, but I will either retake it or try to go to other academic pathways offered if I get in the B school. Yeah, in this fall I shall try to get help from those resources. Thank you for your response!",
          "author": "Store8421",
          "created": 1622299056,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gzvytdz": {
      "link": "/r/Emory/comments/nnjpxj/screwed_up_first_year_gpa/gzvytdz/",
      "text": ".",
      "author": "Internal_Glass4794",
      "created": 1622307813,
      "upvotes": -2,
      "replies": {}
    }
  }
}