{
  "sid": "p4m3vm",
  "link": "/r/Emory/comments/p4m3vm/best_time_to_take_hal_or_language_requirements/",
  "title:": "Best time to take HAL or Language Requirements",
  "text": "I'm an incoming sophomore and still need to complete the HAL/language requirements. When do most people completed this requirement? I have Japanese 101 in my schedule but it's the online version, which isn't very appealing to me. Would it be ok to take Japanese 101 and 102 as a junior? I'm also concerned about taking it my junior year because I am pre-med and plan on taking the MCAT junior spring so if the two intro classes for Japanese are difficult I definitely wouldn't want to take it my junior year. Furthermore, I would be learning a new language on top of classes like Physics 151 & 152 (calc based physics), NBB 301 (neurobio), and Bio 336 (Human phys). Any advice would be welcome. Btw I have no background in Japanese but I am Korean which have slight overlaps in the languages.",
  "author": "ryuelbk",
  "created": 1628998283,
  "updated": 1634097163,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "h8zqqki": {
      "link": "/r/Emory/comments/p4m3vm/best_time_to_take_hal_or_language_requirements/h8zqqki/",
      "text": "Is there not a reason you can do that as a senior with a senioritis type of course load? Secondly, how are you spreading out all those STEMs? Because if they are all split across both semesters there may be no problem. For example, you don't have to take 151, 336, and 301 at the same time.  You can split 336 (probably gonna be not the best either semester) and 301 (spring 301 is better than most fall 301 instructors. The style is better prep for 401 for sure) and that should lighten those semesters.",
      "author": "oldeaglenewute2022",
      "created": 1628999636,
      "upvotes": 2,
      "replies": {
        "h8zr9pz": {
          "link": "/r/Emory/comments/p4m3vm/best_time_to_take_hal_or_language_requirements/h8zr9pz/",
          "text": "I meant that those classes would be taken Fall of Junior and for Spring of Junior I would take Physics 152, some kind of NBB elective, and Bio 301. I could definitely switch the NBB elective and NBB 301 by your recommendation though. Sorry for the confusion!",
          "author": "ryuelbk",
          "created": 1628999946,
          "upvotes": 2,
          "replies": {
            "h8zrkb4": {
              "link": "/r/Emory/comments/p4m3vm/best_time_to_take_hal_or_language_requirements/h8zrkb4/",
              "text": "What and who are you taking for chem this year?  And are you taking any other challenging STEM or non-STEMs? Like maybe you can fit bio 301 or 336 in this year.  Either way, unless you wanna do extra Japanese classes, you can leave it for senior year. No one cares and you don't have to follow a crowd. \n\n  I'm just trying to figure out why you are in this bind.  I think you have more options than you think that won't leave you overwhelmed. Are you QTM and dealing with those on top of chem 203/204 this year?",
              "author": "oldeaglenewute2022",
              "created": 1629000119,
              "upvotes": 2,
              "replies": {
                "h8zszv6": {
                  "link": "/r/Emory/comments/p4m3vm/best_time_to_take_hal_or_language_requirements/h8zszv6/",
                  "text": "I'm in Weinschenk's chem 203 and I also plan on taking NBB 201 (5th on waitlist) this fall. I have two scenarios for classes depending on whether or not I take Japanese this year.\n\nScenario 1: I take Japanese and my schedule will look like chem 203, NBB 201, JPN 101, and psych 110 in the fall and chem 204, NBB 302, Bio 142L (transfer student who hasn't taken bio 2 lab yet), qtm 100\\*, and Japanese 102 in the spring\n\nScenario 2: I don't take Japanese and I will take chem 203, NBB 201, psych 110, and qtm 100 in the fall and chem 204, NBB 302, Bio 142L, and 2 random gen eds\n\n\\*I need to take qtm 100 sometime this year in order to declare the NBB major \n\nOne thing to note is that there is a possibility that I will land myself in an in-person Japanese 101 section but it's not guaranteed.\n\nHow common is it to take language requirements as a senior?",
                  "author": "ryuelbk",
                  "created": 1629000981,
                  "upvotes": 2,
                  "replies": {
                    "h8zuh72": {
                      "link": "/r/Emory/comments/p4m3vm/best_time_to_take_hal_or_language_requirements/h8zuh72/",
                      "text": "I don't know but I remember quite a few seniors in my French class that I took as a junior. Unless you need the language on your transcript before applying to something that requires it, I wouldn't factor that in.\n\nI see...yeah being a transfer chem or NBB major makes things painful.  I think your schedule is what it is so maybe just get Japanese over with this year.  What I will say is to maybe consider working in cell bio(you can work this in as an alternative NBB elective) or maybe even Vega's microbio course next year as opposed to just having bio 336 and 301. Admittedly if you choose spring 301, it may compensate but I always recommend students take one bio (NBB or otherwise) course that requires somewhat frequent reading of primary literature before taking the MCAT. And this is especially the case if you aren't in a research lab and reading them frequently.  \n\nIt just preps well for the passage associated questions (and reading and interpreting the passages themselves because most are derived and adapted from real scientific articles and learning to read figures and relate it back to whatever knowledge from the passage and your studying).  Things like 301 and 336 are so content heavy and have mostly low level assessments that don't expose you to the type of skills and level of thinking you need for the MCAT. They may help with discreets (non-passage associated items) but most questions are passage based I'm pretty sure.  You could honestly self-study the phys. Material but the exposure no doubt helps some.",
                      "author": "oldeaglenewute2022",
                      "created": 1629001889,
                      "upvotes": 1,
                      "replies": {
                        "h8zxd4q": {
                          "link": "/r/Emory/comments/p4m3vm/best_time_to_take_hal_or_language_requirements/h8zxd4q/",
                          "text": "I actually have an extensive background in reading primary literature since I went to a STEM high school that made us read primary literature since freshman year. I also have been in two research labs that required tons of primary literature reading. Do you still recommend taking a class like cell biology? I will also be working in a research lab this fall.",
                          "author": "ryuelbk",
                          "created": 1629003717,
                          "upvotes": 1,
                          "replies": {
                            "h8zz7vd": {
                              "link": "/r/Emory/comments/p4m3vm/best_time_to_take_hal_or_language_requirements/h8zz7vd/",
                              "text": "Absolutely! The more practice the better (like getting it at the collegiate level is just very different because the papers can be more advanced and specialized and you should hopefully be a more sophisticated thinker that can do more than memorize the findings or have a basic understanding) and it's not just the literature reading, it's that the tests are written differently and tend to have more problem solving/MCAT like items (not so common in biology courses) because they emphasized reading literature AND it's in an area pretty emphasized on the MCAT.  Getting experience with the literature in a range of areas and assessments that hold you accountable for problem solving and experimental thinking skills they are meant to build would be helpful. Also, if you went to a STEM HS, I bet you may have already had a phys. class and Emory's 336 is nothing special, trust me (maybe if Jaegar offers it again. He has the little medically focused case studies).\n\n Restart building or fine tune the skills you started developing in HS. It'll really help you vs. Just content focused life sciences courses.  Weinschenk's chem. Courses will cover you on the chem front in terms of getting more experience with derivative/high level problems, but there are many options in bio (and NBB I think) too which is important given how much of the MCAT is bio focused. \n\n Even if you did certain things in HS, you can become rusty and you may have been doing it with less maturity and foundational knowledge (and not in the context of a discussion section with other high achieving peers and an instructor who is an expert). It makes no sense to memorize your way through college life sciences and let that HS prep go to waste when it could be further developed and then translated to a good MCAT prep period and hopefully a very strong score.",
                              "author": "oldeaglenewute2022",
                              "created": 1629004943,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}