{
  "sid": "r7q3io",
  "link": "/r/Emory/comments/r7q3io/travelling_around_campus/",
  "title:": "Travelling around campus",
  "text": "Hii as a prospective student of early decision I was wondering how most people travel around campus \n\nIs it via shuttle, skateboard, walking etc?",
  "author": "Educational_Yak_3159",
  "created": 1638504711,
  "updated": 1639518390,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hn12557": {
      "link": "/r/Emory/comments/r7q3io/travelling_around_campus/hn12557/",
      "text": "Mostly walking. Pretty much all classes are very easily walkable. There's a shuttle between main campus and clairmont campus that people use, but that won't be super relevant to you until you potentially live there as an upperclassman, there are no academic buildings on clairmont. Some people bring bikes, but you don't need one. Skateboards are the same way, but the hills can make it dangerous if you don't know what you're doing",
      "author": "katsteve",
      "created": 1638505889,
      "upvotes": 15,
      "replies": {
        "hn12dd4": {
          "link": "/r/Emory/comments/r7q3io/travelling_around_campus/hn12dd4/",
          "text": "Thx",
          "author": "Educational_Yak_3159",
          "created": 1638506003,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hn1905u": {
      "link": "/r/Emory/comments/r7q3io/travelling_around_campus/hn1905u/",
      "text": "Essentially all pairs of buildings are within a 15 minute walk of each other, and the weather is generally pretty good, so most people walk around campus",
      "author": "j11234567890",
      "created": 1638509638,
      "upvotes": 8,
      "replies": {}
    },
    "hn1hrhc": {
      "link": "/r/Emory/comments/r7q3io/travelling_around_campus/hn1hrhc/",
      "text": "people always say walking and yeah mostly it is but if you hate walking like me or ur a slow walker or ur lazy or u have any other circumstances theres shuttles that circle around main campus every 10 min or so and usually i will take that instead of taking the 8-10min walk to class (which really only saves me a few min but at least i didnt have to walk). if you miss the shuttle there will usually be another one 10 mins but it can be longer in the evening. conclusion: you can most definitely walk everywhere and its honestly faster half the time to walk since the shuttle stops are only around the perimeters-ish of main campus but if you need it its there and usable",
      "author": "y9d8tsdt",
      "created": 1638515343,
      "upvotes": 6,
      "replies": {
        "hn1ihv5": {
          "link": "/r/Emory/comments/r7q3io/travelling_around_campus/hn1ihv5/",
          "text": "Okey thx",
          "author": "Educational_Yak_3159",
          "created": 1638515892,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hn2i5xg": {
      "link": "/r/Emory/comments/r7q3io/travelling_around_campus/hn2i5xg/",
      "text": "If you don’t want to walk, scootering around is viable. But I think campus banned the lyft /uber ones, so you need your own; and keep in mind those are hard to bring inside. You could use a foldable non electric razor scooter. Skateboards are a bad idea mainly because the ground is highly uneven, especially with the cobblestone, roads are hilly, and walkways are generally crowded on central places like Cox Bridge. You could bike, but same issue as above.",
      "author": "Worldlover67",
      "created": 1638541150,
      "upvotes": 5,
      "replies": {
        "hn335qs": {
          "link": "/r/Emory/comments/r7q3io/travelling_around_campus/hn335qs/",
          "text": "Yup I visited few weeks ago it’s p much a hill , ig walking seems the easiest thx anyways",
          "author": "Educational_Yak_3159",
          "created": 1638549931,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}