{
  "sid": "knzwxx",
  "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/",
  "title:": "I'm feeling really anxious about going to Oxford...",
  "text": "Hi! I'm a high school senior who was accepted into Oxford College in ED 1. I originally applied to both the Atlanta and Oxford campuses, but the Atlanta campus didn't accept me. I'm nervous about spending the next 2 years in Covington (I generally prefer urban settings), and I've been hearing some pretty negative things about the campus. I know some people have said that the food isn't particularly good, there was a mold problem in the dorms, the counseling department isn't helpful, etc. Some people have also told me that I didn't get into the main campus because I wasn't smart enough or because I didn't work hard enough, and I'd be lying if I said that hasn't been taking a toll on my emotional health. \n\nBut I've also heard that the small campus and class sizes foster strong interpersonal relationships and that the professors care more for their students, so I feel really conflicted about my acceptance. Some days it seems like I've been given a prison sentence and some days I genuinely can't wait to go to college.\n\nMaybe I'm being stupid for being nervous, but I would really appreciate it if anyone here could talk a bit about their experience at Oxford. I'm so grateful to have been accepted into Emory at all, but I'd love to hear a first-person account of the campus! Is the food truly not that good? Are the professors more engaging with the students? Do students at the main campus look down on Oxford students? Please let me know! Anything is helpful. :)",
  "author": "dented_thermos",
  "created": 1609455188,
  "updated": 1634098973,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.89,
  "comments": {
    "ghns8g3": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghns8g3/",
      "text": "oxford grad here! first off, what you've been told about smarter kids getting into main is complete bullshit. i also was only accepted into oxford and when my parents contacted the admissions office about why i hadn't gotten into main (im an emory legacy so they were curious lol) and they were told that it was because they needed to fill in oxford's class and they usually take more into oxford from early decisions who apply both to campuses. granted, i also wrote in one of my supplementals that i really value small, tight-knit communities, so that likely also had a big factor. \n\nbut i totally agree with what another commenter said, just ignore and ditch whoever told you that.  ive heard there is a subtle bias against oxford kids, but it's not that main kids are mean to oxford kids or anything like that. from my experience, main kids really dont care lol. it's just sometimes atlanta clubs are wary to accept oxford grads in because they didnt spend the past two years at main. it kinda sucks but thats really the worst of it, which isnt that bad at all imo.\n\ni truly loved my experience at oxford and i miss it so much. i'm currently a junior and ive been taking this year at home so i cant compare to main, but i wouldnt trade my years at oxford for literally anything. i met some fantastic people who i consider lifelong friends and i loved the campus. it's gorgeous and super easy to get around. and i didnt find the food that bad at all! everyone likes to joke about it but it's good more often than it's bad. small details: cool salad bar, awesome sandwich bar, we get free coke freestyle machines, and the soft serve SMACKS. better than the soft serve at main imo.\n\nit is a bit isolated though, but that's something i personally enjoy. however if you want to get out and about, the shuttle system is pretty great and shuttles to and from main run every day. we also have some walmart/target/etc shuttles if you ever need to get groceries, go watch a movie, or grab some freddies. so there's more than enough to do outside of campus during the week, and there are loads of weekend shuttles to main for lengthier trips. weekend shuttles go until late hours of the night if you're interested in greek life.\n\nin terms of academics and extracurriculars, i had opportunities at oxford that would have been either much more difficult to obtain or literally impossible at main. for instance i was co-president of my club my sophomore year and got some great leadership skills. i'm also working closely with another oxford grad and oxford professor on research and we're on track to getting published, an opportunity i only had because of my oxford friends who helped me out and our tight-knit classes. i also got pretty close with the two professors of my major and i adored their classes. class discussions are easy and actually fun because our classes typically range from 15-25 students (and never more than 25).\n\nanyways, sorry for this wall of text! i miss oxford a lot and im so excited for you. if you have any questions at all, feel free to send me a pm or chat! i'd be stoked to chat :)\n\nedit: oh, and for living accomodations!! IF YOU WANT GOOD HOUSING when you fill out your sheet for preferred housing DONT put same gender buildings!! that'll for sure land you in jrc which is the mold building lol. if you put any other option it's kind of a coin toss (although putting any gender roommate will land you in 2nd floor elizer which is pretty nice) but that one for sure will land you in jrc. but jrc has it perks! i lived there freshmen year and it has the best location and hugeee sinks (murdy elizer and fleming have small ones so if you have a lot of toiletries it kinda sucks). every dorm building had its positives and i honestly enjoyed my time at jrc. and i never had any experience with mold! it is kinda unfair how much nicer the fleming bathrooms are tho lmao",
      "author": "sunflower_sunshine",
      "created": 1609462417,
      "upvotes": 13,
      "replies": {
        "ghq7g89": {
          "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghq7g89/",
          "text": "Thank you so much for replying! Reading this honestly made me feel a lot better. I had no idea that there were multiple shuttle systems running to and from Oxford! When I checked out the campus in person, I was a bit worried because it seemed like there weren't many stores to go to in case I needed to grab new notebooks or something. It sounds like the leadership opportunities are really cool too. This is honestly the first time I've been this excited for college in a while. Also, thank you for the housing tip! I really appreciate it! I'm also looking forward to the soft serve!",
          "author": "dented_thermos",
          "created": 1609518354,
          "upvotes": 3,
          "replies": {
            "ghwvr0l": {
              "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghwvr0l/",
              "text": "im so happy i could relieve a bit of your worries!! funny enough the store in the new student center is actually bigger than what it used to be, so the walmart shuttles (they run on tu/thur/sat iirc) were a lifesaver to say the least lol. again im so stoked for you and so glad to hear you are too! and fingers crossed you get fleming housing :'))",
              "author": "sunflower_sunshine",
              "created": 1609656859,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ghnicaq": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnicaq/",
      "text": "I'll let others handle the rest but what idiots do you have around you telling you stupid stuff like:\"You didn't work hard enough to get into the Atlanta campus\" when they are basically statistically identical in terms of achievement metrics.?You need new friends orrrrr....is this actually something you are telling yourself because YOU feel bad about not getting into ECAS?  If the latter is true (because the first seems unlikely unless those people are really dim), you have to work on that and realize how much luck (vs. merely merit) goes into selective college admissions.  A huge chunk of the denied applicants certainly \"deserved\" and were qualified for admissions.  \n\nWhat likely happened is that adcoms need to fill Oxford's class so in early rounds choose several who are a much stronger fit for it than ECAS.  Stop telling yourself these myths of \"I didn't work hard enough\" or \"am not smart enough\" and definitely avoid and ignore any peers who tell you stupid stuff like that.  And please note that ECAS has similar quality of life problems as Ox but is just bigger.   Instead of worrying about food and mold and stuff and imperfections like that (which might not even affect you-usually when you talk a problem with a dorm that specific, it is only like one dorm or an abberation, and you'd be surprised how common certain issues are college campuses), you may wanna look forward to the friends you'll make, the things you'll get to do, and the stuff you wanna learn because, and how you want to develop intellectually (and you need tp stop doubting yourself.  I am worried about anyone who says they aren't smart enough or didn't work hard enough and then got into a school with a 1450-1500 SAT average and 3.75+ average GPA for matriculates. Gain confidence now! Or else you will not receive the challenges ahead well and Emory selected you for at least one of its campuses because you seemed like you were ready) and socially during the 2(and then 4) years at Emory.\n\n Those should be why you wanted to be part of any highly selective college and university (Most of these schools are generally known for rigorous academics, great faculty, smaller classes, lots of oppurtunities, strong alumni networks, and bright students that do interesting things on and beyond campus, NOT perfect/near perfect amenities and food. I mean Duke had frosh dorms with no air conditioning and is in freaking NC.) If you just wanted great food and perfect amenities, plenty of far less selective schools do that way better.  I also suspect that Ox AND ECAS are generally above average for their amenities and food. The bar is low, especially among privates.  It actually seems like you have general college jitters\n\n\nEither way, be well and be grateful!  Don't let perfection and your quest to look for relatively inconsequential imperfections your enemy that distracts you from a blessing.  The only reason you should be worried is if you definitely didn't want a small school or you don't wanna be academically challenged and just wanted nice amenities and stuff.",
      "author": "oldeaglenewute2022",
      "created": 1609456686,
      "upvotes": 13,
      "replies": {
        "ghnofgd": {
          "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnofgd/",
          "text": "Thank you for responding! I'm really sorry if I came across as someone who only cares about the amenities--that wasn't my intent! I genuinely wanted a rigorous academic experience when I began applying to college. It's just that my rejection from the main campus really got me down, and all the talk about the mold and food made it worse. I don't go to a very prestigious high school or anything, but some of my peers are very competitive and can be kind of nasty. I was scared of telling them about my rejection and acceptance, and when I did, I took their responses and criticisms hard. But I'm still grateful I got accepted into Oxford. I've wanted to go to Emory for years, and I'm finally getting my chance.",
          "author": "dented_thermos",
          "created": 1609460218,
          "upvotes": 4,
          "replies": {
            "ghnuabb": {
              "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnuabb/",
              "text": "Your peers are just nasty and have no reason to be (especially if they don't go to an ultra competitive or good HS) and you shouldn't be nasty to yourself either.  Also, keep in mind that these selective privates and publics minus say the UCs have an awfully upper middle class and wealthy student body so most are gonna complain about things like food and amenities. It seems the places that get the least complaints (talking places like VU, WUSTL, Brandeis) have UNUSUALLY wealthy students (as in more 1%ers than other elites) that they are trying to please.\n\n  For anyone who went to public school, most of these colleges (but especially either Emory campus which has an unusual amount of new and renovated buildings) will be much better.  I think many complainers come from like private HSs or eat lots of 4-5 star meals and whatnot and anticipate that in college perhaps because of what they are used to and what they are paying.  Basically these schools are nice, but they aren't Hogwartz or something in terms of living conditions which is the imagery many going to these selectives want to conjure up.  Time for you to cheer up and think about how you'll remain excellent in college while having a good time as well.",
              "author": "oldeaglenewute2022",
              "created": 1609463635,
              "upvotes": 6,
              "replies": {
                "ghpxncd": {
                  "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghpxncd/",
                  "text": "Tbh Hogwarts infrastructure looks much worse than Emory's. Who wants to live in a 1000 year old castle that has deathtraps and insufficient illumination?",
                  "author": "iapetus3141",
                  "created": 1609513957,
                  "upvotes": 1,
                  "replies": {
                    "ghq2lud": {
                      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghq2lud/",
                      "text": "I was actually gonna tack that on at the end lol.  I think I was mainly referring to food and all that stuff, but weird enough, people want their schools to look like it but modern on the inside.   A lot of folks don't like Emory's post-modern architecture that much.  They want it to look and feel old AF but have perfect food, gyms, etc.  People have wild imaginations but I can understand where they come from. US college is expensive and there has been a very consumer oriented model of education for a while",
                      "author": "oldeaglenewute2022",
                      "created": 1609516339,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ghnngdz": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnngdz/",
      "text": "I'd be happy to discuss with you more about Oxford in a direct message, but in short, I believe that people's  experiences at Oxford are heavily dependent on personality, what they want out of college, and other individual factors. I truly loved my time at Oxford but also really enjoyed Atlanta before COVID for different reasons. \n\nIt's completely okay and normal to be nervous about college! As far as what I think about Oxford, I'd say there are lots of people who create strong friendships and it is easier to get to know your professors. While there has been bickering, joking, and debate about Oxford vs Emory on student social media pages, I've never actually experienced actual malicious Oxford-shaming in person, but I’m sure everyone has their own opinions and experiences on this.",
      "author": "dtdaisies",
      "created": 1609459645,
      "upvotes": 4,
      "replies": {
        "ghnrhsr": {
          "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnrhsr/",
          "text": "Thank you for replying! I'm really relieved that you said you haven't experienced any shaming for going to Oxford. I'm looking forward to the more personal nature of the school, but I guess I'm still just jittery about being rejected and some of the complaints that people have. But I think it's great that you loved being at Oxford! I hope I enjoy my time there as much as you did!",
          "author": "dented_thermos",
          "created": 1609461982,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghnwiit": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnwiit/",
      "text": "I graduated from Oxford almost 20 years ago (omg) and I really enjoyed my experience. I had great leadership opportunities (I was a PAL and did Leadership Oxford). I also helped start a new club sport on the Atlanta campus while I was at Oxford. \nHaving a car was a big perk. \n\nI think 2 years is just enough time at Oxford. I was ready to move on by the end of my sophomore year. I’m glad I was able to experience both campuses.",
      "author": "JKB8282",
      "created": 1609464962,
      "upvotes": 5,
      "replies": {
        "ghq8ibx": {
          "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghq8ibx/",
          "text": "I never had a leadership position in high school, so the opportunities at Oxford sound really good! Thank you for telling me about some of them! I hope I have as good of an experience as you did.",
          "author": "dented_thermos",
          "created": 1609518788,
          "upvotes": 2,
          "replies": {
            "ghr5bda": {
              "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghr5bda/",
              "text": "I really hope you enjoy your experience!",
              "author": "JKB8282",
              "created": 1609531137,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ghnwvlz": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnwvlz/",
      "text": "[deleted]",
      "author": null,
      "created": 1609465184,
      "upvotes": 2,
      "replies": {
        "giiiows": {
          "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/giiiows/",
          "text": "Bread and butter is a great close coffee shop, and waflle house is in walking distance if you're hammered and in good shape. But agreed I wish there had been more too.",
          "author": "inigo-mont0ya",
          "created": 1610084912,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghny74t": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghny74t/",
      "text": "Ok so I'm an Oxford freshman rn and what I will say is ppl here are literally so friendly. Haven't dormed yet cus of Miss Rona so I can't speak on that but I was so nervous about classes and thought I'd be so dumb compared to kids here and at Atlanta campus due to my lower than typical stats. Have taken multiple classes at both and realized everyone isn't freaky geniuses (which I knew but still subconsciously was worried about cus imposter syndrome) and that we all basically struggle the same. Everyone is willing to help each other out in classes. You're not any dumber than main campus kids. The classes I took on main campus we did a bunch of group work in and I wasn't falling behind on anything, even contributing a greater percentage than my groupmates to assignments. I'd explain stuff one of them didn't understand right away and they'd explain anything I didn't. Everyone helps each other out at Oxford and at Atlanta campus, no one I've met so far is out here trying to make others feel inferior. The bigger Atlanta class size is nice when you need to blend in but the small class size at Oxford is very nice cus you get to know people and your ideas are more easily heard when you want to contribute in classes or ask questions.",
      "author": "Artist552001",
      "created": 1609465997,
      "upvotes": 2,
      "replies": {
        "ghq9qed": {
          "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghq9qed/",
          "text": "Thank you for replying! It's really nice to know that everyone there is friendly. I'm super awkward when trying to make friends, so the collaborative environment definitely a plus! I've also found it hard to contribute to class discussions because I'm shy, but it sounds like it's really easy to do at Oxford!",
          "author": "dented_thermos",
          "created": 1609519338,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gjj55oe": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/gjj55oe/",
      "text": "Oxford has given me some of the best friends in my life!! Everyone is really nice and I’ve had the BEST mentors and even got to do research as a 2nd year! It can be lonely at first when you are adjusting, but honestly being a little isolated helps with focusing on school work. You are 100% just as smart as anyone on the Atlanta campus and I’ve found my Atlanta classes quite a bit easier than my Oxford ones (especially STEM). I think food is pretty much the same, I’ve heard that Atlanta kids who visit Oxford say the food at Oxford is better, but I’ve heard the opposite, too. Professors are amazing and are at Oxford to build relationships with students, not because they are getting paid for research and are required to teach. Once your in Atlanta, no one really cares that you went to Oxford, they’re probably more interested in what your experience was like. If anything, I joke with my atlanta friends about this made-up rivalry bc it’s ridiculous. Don’t count Oxford out, yet! Lmk if you have any other questions :) and welcome!!",
      "author": "sjwandpremed",
      "created": 1610848869,
      "upvotes": 2,
      "replies": {}
    },
    "ghyu1wd": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghyu1wd/",
      "text": "Lots of Oxford students will be in the same boat as you (applied both, but only got in to Oxford). Most students end up really liking Oxford but if you don't vibe with it, you can finish your requirements in 3 semesters and transfer to main by spring of your sophmore year. \n\nOverall, Oxford professor do seem more engaging/invested in undergrad student success than main campus. Students at main campus will not care that you went to Oxford. Main drawbacks are that you may get lost on Main campus as a junior and that you'll be mistaken for a freshman by some of your peer (since they won't know you yet). NBD\n\n(Note: I went to Main campus, not oxford)",
      "author": "FlowersBloomUntil",
      "created": 1609692234,
      "upvotes": 2,
      "replies": {
        "gi0ksu3": {
          "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/gi0ksu3/",
          "text": "Thank you for replying! It's really reassuring to know that the only thing I have to worry about once I get on the main campus is being mistaken for a freshman haha. But I'm really looking forward to meeting my professors in the fall now!",
          "author": "dented_thermos",
          "created": 1609720950,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghoi3fb": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghoi3fb/",
      "text": "I was that kid who asked about food at Oxford...from the comments it looked like food wasn’t that bad? And I rarely hear about schools with great food anyways",
      "author": "yoojimin",
      "created": 1609480105,
      "upvotes": 1,
      "replies": {}
    },
    "ghnh4pf": {
      "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnh4pf/",
      "text": "Why did you ED to Oxford if you knew you'd feel this way?",
      "author": "physicsninja420",
      "created": 1609455966,
      "upvotes": 1,
      "replies": {
        "ghnpjeb": {
          "link": "/r/Emory/comments/knzwxx/im_feeling_really_anxious_about_going_to_oxford/ghnpjeb/",
          "text": "I've wanted to go to Emory since I was in elementary school, but specifically the main campus. When I got to high school, my parents suggested that I should apply to both Atlanta and Oxford because I'm a bit introverted. I visited Oxford once, and I thought it seemed like a close-knit, quaint kind of school. I also went to Emory's admissions presentations, and they said Oxford was just like Emory, but much smaller and therefore more personal. I didn't want to make a decision that would get me into something I wasn't equipped for, so I applied to both campuses.",
          "author": "dented_thermos",
          "created": 1609460855,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}