{
  "sid": "p8a9ir",
  "link": "/r/Emory/comments/p8a9ir/chat_with_fellow_emory_students_on_the_emory/",
  "title:": "Chat with fellow Emory students on the Emory Discord: Dooley's Tavern",
  "text": "Hi everyone, it's the Dooley's Guards again. As the start of the fall semester is approaching, we're happy to see you all on campus and wish you luck on your studies! Since our [first post](https://www.reddit.com/r/Emory/comments/oqxsts/looking_for_a_place_to_chat_with_other_emory/), we have recently decided to slowly open the server up to non-Emory students, starting with our Georgia Tech friends! Non-Emory students have their own school-specific role and do not have access to Emory-specific channels (e.g. academics, housing). For now, you'll be able to find them in the main chat so don't be afraid to strike up a conversation.\n\n# What is Dooley's Tavern?\n\nDooley's Tavern is a student-managed Discord server created last year for Emory students to hang out and chat with each other. Feel free to talk with over 1500+ members about a wide array of topics ranging from academics, housing, campus activities, gaming, memes, and more. We aim to create a fun and welcoming community so don't be shy! We, the Dooley's Guards, are responsible for managing, moderating, and organizing events in the server. \n\n# How do I get in?\n\nHere's the link: [Dooley's Tavern Invite Link](https://discord.gg/C9RXgdg2BC)\n\n*In order to prevent spam, after joining the server, you'll get an automated message to fill out a verification form. After submitting the form, verification will take at most 48 hours (we have to manually verify each person so please be patient). For Emory students, once verified, you will then be able to access all channels. For non-Emory students, you'll be assigned your school-specific role and will have access to only certain channels.*\n\nIf you have any problems, questions, or suggestions, leave a comment, and we'll try to help : )",
  "author": "Dooleys-Tavern",
  "created": 1629481789,
  "updated": 1634096984,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.67,
  "comments": {
    "h9qndag": {
      "link": "/r/Emory/comments/p8a9ir/chat_with_fellow_emory_students_on_the_emory/h9qndag/",
      "text": "coooool :)",
      "author": "o_Sleepy_o",
      "created": 1629510882,
      "upvotes": 1,
      "replies": {}
    }
  }
}