{
  "sid": "n7et0q",
  "link": "/r/Emory/comments/n7et0q/ap_credit_question/",
  "title:": "AP Credit Question",
  "text": "I know that there's a limit of 12 hours from AP credits, but I was wondering if additional AP scores would allow me to skip more geneds and just not get hours from them. 12 hours is only a third of what I could get at other schools.\n\nI also know that testing out is also an option, but I'm not confident about my skills in some subjects and even less confident that I'll be able to handle a more difficult class right off the bat.\n\nThanks!",
  "author": "Chengz1",
  "created": 1620439411,
  "updated": 1634098136,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "gxchxw0": {
      "link": "/r/Emory/comments/n7et0q/ap_credit_question/gxchxw0/",
      "text": "Not quite. To my knowledge, the only gen eds you can really skip are math, science, and language with most major AP exams and 12 credits is usually more than enough. I always recommend taking more AP exams because the departments youre majoring in are likely very lenient. For me, chem and QSS were willing to take additional AP credit without offering the hours so that I could skip those early requirements and advance to harder classes. For example, i skipped classes like micro and calc 2 with AP credits without getting formal \"hours\" for them. It's a little technical because you can't really skip gen eds, instead it would be other core classes, but i hope that answers your question. Honestly, maximizing utility from your AP credits is a game in and of itself. For that, the best advice i can give is to use your AP credits towards intro science classes and your freshman writing requirement because imo those classes kinda suck and basically cover AP content again.",
      "author": "Axonic11",
      "created": 1620441035,
      "upvotes": 6,
      "replies": {}
    },
    "gxci6f0": {
      "link": "/r/Emory/comments/n7et0q/ap_credit_question/gxci6f0/",
      "text": "So I think the other commenter is right where even though it won’t give you more credit hours, they can still count as prereqs for classes.",
      "author": "Squami11",
      "created": 1620441169,
      "upvotes": 3,
      "replies": {}
    },
    "gxcjm02": {
      "link": "/r/Emory/comments/n7et0q/ap_credit_question/gxcjm02/",
      "text": "1) No you must actually get credit in a gen. ed for it to count.  You can use left over APs to accelerate.\n\n2) Look Emory admitted you and you got credit for those courses. The least you can do is try the next level up and then go down if you feel uncomfortable. I worry that you (and many other freshmen) believe that their first course in an area has to feel like a breeze/have mostly material they already know to gain confidence when you should evaluate it based upon whether  \"relearning\" it will actually help in later courses by teaching you in a different way or with significantly different content from HS.\n\n In the humanities and social sciences there is little congruence between an intro course and another intro in the sequence or even an intermediate special topics course and often the number of the course in these divisions does not correlate with rigor or expectations of content knowledge(for example, history 285s are usually survey/intro level special topics).  AP psych gives 111 credit, and most students who major in it should just use AP because it and 110 are NOT related and 111 will not serve as some wonderful foundation for upper divisions.\n\nEmory has all types of weird stuff going on in STEM: Like anyone who has AP bio credit should probably skip biol 141 lecture (hell most could immediately take 240) 142 does not use much 141 as a foundation and reviews the parts of 141 that are.  They should instead take 250 and 264 later on to get a stronger cell biology and genetics foundation because 141/2 ain't gonna do much for people w/AP credit but bore them if they take a bad professor. Physics 141 and 142 are pretty much two different topics.  Chem 150 and 202 have little overlap and in fact 202 may technically overlap more with an AP curriculum in many areas. And generally besides those who had IB, most people will be on a level playing field in 202. It appears that standard 202 also reviews the necessary 150 topics in slick ways (like via an LA or in class worksheet)\n\n Students w/chem credit should at least entertain 202-Z if only because Soria will teach it and because it will review the concepts at the end of 150 that AP curricula don't cover (202-Z is basically fully organic and retaking \"gen. chem\" instead of it will not give you a refresher that serves as an advantage for the intensity that is the standard 203 course at Emory, but it may artificially inflate your confidence I suppose. Even at schools with more traditional gen. chem sequences, minus work ethic building, something most with AP credit in the area have, data often shows little advantage to taking gen. chem before standard ochem sequences).  \n\nIn STEM, the main concern should be choosing an math(calc) course to start with but there is a real placement exam for that now I believe and if you take it honestly, I bet it'll place you properly.  But again, when it comes to STEM (and even languages), just try the next level up for a week and see how the professor is and where you stand/if you think you'll like the material (and not just if it feels super easy for you), and try to make an informed decision that way.  Believe it or not you can still make a good grade even if the material feels challenging and you struggle with it at times.  You should be able to build even more confidence if you trust yourself and do solidly in a course with newer material or a different approach to a topic.",
      "author": "oldeaglenewute2022",
      "created": 1620441985,
      "upvotes": 2,
      "replies": {
        "gxcnqv9": {
          "link": "/r/Emory/comments/n7et0q/ap_credit_question/gxcnqv9/",
          "text": "Ha thanks for the encouraging words, tbh I underestimate myself sometimes. I did excel at both calc and chem, but I took those courses 1-2 years ago. I'll likely still follow your advice and entertain some of the higher level courses though.\n\nI also just realized that the Science, Nature, Technology gened field includes courses in Computer Science and Economics, which would pertain more to my intended major of CS.",
          "author": "Chengz1",
          "created": 1620444440,
          "upvotes": 1,
          "replies": {
            "gxcove5": {
              "link": "/r/Emory/comments/n7et0q/ap_credit_question/gxcove5/",
              "text": "Doesn't matter. Try something new.  They can all give you good thinking and logic skills (especially something like organic chemistry which is radically different from general chemistry/AP chemistry which is largely plug and chug oriented learning vs. conceptual).   When I took frosh ochem with Soria back in the dino ages it had a track record of producing excellent, well trained students in a large variety of STEM and other disciplines. It wasn't a majority chem majors or pre-meds. \n\nIt had significant numbers of math and physics, and even some social science majors(as in people who were that from the get go, not dropped out pre-meds), business majors, etc.  It was just something that really taught people to problem solve and study effectively and it had a great intellectual community(and friends) that stayed in tact beyond that year. Quite unique learning environment for a foundation level STEM course at a research U. Very collaborative, has Socratic Method, good p-sets, between year sporting competitions for bonus points. A good time for such an intense subject.\n\n  I'll admit that the 1st semester I certainly wasn't the best but having friends and colleagues of that calibre really pushed me to improve the next semester and over time at Emory.  It and math 275/6 if it comes back are Emory's frosh STEM honors courses and I'd say the chem Z sequence is the most accessible to a broader group of people as learning ochem as a person with aptitude in or exposure to chemistry is far easier for most than shifting to learning proof based abstract math from knowing sort of plug and chug calculus.\n\n  If you are CS, then going a little more advanced in any STEM course is relatively low risk.  Just take whatever intellectual benefits and high calibre friends you can.  When you aren't some hardcore pre-health, you can exercise more freedom when it comes to course selection and get more out of Emory without constantly freaking out about 0.05 of a GPA point.",
              "author": "oldeaglenewute2022",
              "created": 1620445142,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}