{
  "sid": "juctm5",
  "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/",
  "title:": "Am I the only one struggling in BIOL141 w/ De Roode?",
  "text": "I feel like everyone is breezing through the class, but I'm struggling  with the amount of work being given right now. I just failed exam 2 and was wondering how other people did. This is supposed to be my major and I've never struggled this much before :/. I also have a B in the class and was hoping to keep a good GPA for med school/internships/etc.",
  "author": "janitorialkeys",
  "created": 1605401130,
  "updated": 1634098797,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.93,
  "comments": {
    "gcbdnyd": {
      "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcbdnyd/",
      "text": "Are you a freshman? If so, all I can encourage you to do is keep your head up and note that general biology is NOT that reflective of intermediate and upper division biology courses (which hopefully you will be taking in person).  Also, this Covid time is not reflecting normal courses and times so you should be more graceful to yourself.  Also, please avoid thinking too much about your GPA right now.  Just do the best you can to keep a mix of As and Bs.  A B is an okay performance. I am sure you can probably do better, but you will have many more semesters and courses contributing to your GPA and a single B (or even a few over your career but definitely not one from freshman year) will not take you out of med. school and internship territory (don't buy all the insane hype and fearmongering about how you need to be perfect 100% of the time to access Med. school and the key ECs that make you competitive for them.  That stuff is really bad for many students and functions as an unnecessary deterrent. Just work to improve and be more consistent over time. The upward trend is really valued).\n\nKeep in mind that if you come from an elite university as you do, typically about a 3.5-3.6 and 90th percentile score on the MCAT keeps you competitive for many medical schools (though of course higher is better and will qualify you for more competitive med. schools, but a U.S. med school is a U.S. med. school and will provide good training. You don't have to go to an \"elite\" medical school).  And internships can be relatively lax as long as you keep a decent GPA. Consider the fact that you are allowed to do an honors thesis with just a 3.5 overall in your major.\n\nFor now, just try to learn and do the best you can.  Even a B in De Roode may pay off for future MCAT prep and preparation for more useful upper divisions in the major (I hear De Roode tries to integrate more critical thinking on his assignments and tests than average so that is really an advantage for the MCAT and many higher up biology courses that will be more research focused.  It is okay if you struggle with some of this now.  The whole idea is to push yourself to eventually develop these competencies in the area over time. And again, if you are a freshman, you have plenty of time).  You will be okay!  Just get a plan together for next semester when taking 142. Note that it is possible you may enjoy 142 better (I did) as 141 becomes quite memorization oriented and content heavy starting at like the 2nd exam.  142 just seemed to be more logic and problem based and also flowed and built up better if my memory serves me correctly.  If you are both overwhelmed by the amount of content and work, 142 may at least be better content wise (like you don't need to know tons of specific details about say....cellular respiration and associated pathways).\n\n&#x200B;\n\n\\*I would also note that you should not compare yourself to others (bio isn't even curved, and I don't think chem 150/202 are either).  Because Emory lacks honors courses for most of these intro. STEMs, you get an awful lot of people with AP/IB credit \"repeating\" these courses.  Many already have ridiculous amounts of exposure to the material and merely just have to keep up with the workload.  Even among those with AP/IB, mileage may vary depending on what school/HS teacher you had (there are many HS teachers who kind of just coach to the AP exam for example and their own exams and assignments are very simple and laid back until it is AP exam review/prep time. That can be very different from a college course).",
      "author": "oldeaglenewute2022",
      "created": 1605403086,
      "upvotes": 16,
      "replies": {
        "gcg727u": {
          "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcg727u/",
          "text": "Thank you so much :) this made me feel a lot better. Also, yes -- I am a freshman. I really hope I do better in the next few biology courses I take !!",
          "author": "janitorialkeys",
          "created": 1605490305,
          "upvotes": 1,
          "replies": {
            "gcg7nx6": {
              "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcg7nx6/",
              "text": "yeah maybe you can take a mixture of easier and harder \"useful\" classes to build confidence.  Like Biol 241(evolutionary bio) is definitely considered a course with more intuitive content, but has the discussion section and emphasis on context/data analysis useful for the MCAT.  You should be able to score well and develop those competencies better than in gen. bio.  And then there are many upper divisions with no exams or diminished exam weighting where you'll still learn a lot in case you have exam anxiety.",
              "author": "oldeaglenewute2022",
              "created": 1605490619,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gcgcr0j": {
          "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcgcr0j/",
          "text": "Thank you for your reply! I’m very unhappy about my score, so after reading this, I feel a lot better. If bio’s not curved does that mean we follow the normal percentage-grade system? 93+ is an A, 90-92 is an A-, and so on?",
          "author": "blueravenclaw29",
          "created": 1605493238,
          "upvotes": 1,
          "replies": {
            "gcgeliz": {
              "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcgeliz/",
              "text": "Yeah that'll probably be it.  Generally don't expect curves in core STEM courses except in cases where the average grade for ALL of the components (as in when tests, HW, etc are accounted for) is a bit below 80 which is a B- on a normal scale.  Some instructors design their courses to be this challenging from the get go so will not even publish grade ranges on their syllabus because they plan to adjust final grades such that the ending course GPA is between 2.7-3.0. Others may automatically provide adjusted ranges with lower cutoffs in the B and C range in anticipation of that (I think Soria and Heemstra do this for chem 203).  Some may put the standard scale but then scale or adjust individual exams.  But if you are in a course where all/most assignments are 80+, use the scale you said even if ranges are not in the syllabus.",
              "author": "oldeaglenewute2022",
              "created": 1605494186,
              "upvotes": 1,
              "replies": {
                "gcgezk5": {
                  "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcgezk5/",
                  "text": "Thank you so much!",
                  "author": "blueravenclaw29",
                  "created": 1605494388,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gcdw0rt": {
      "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcdw0rt/",
      "text": "You’re not alone. I genuinely feel that his lectures are confusing.",
      "author": "yliu217",
      "created": 1605444784,
      "upvotes": 3,
      "replies": {
        "gcf4vqn": {
          "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcf4vqn/",
          "text": "And his quizzes have been hard af recently",
          "author": "BTDBunch",
          "created": 1605470680,
          "upvotes": 4,
          "replies": {
            "gcg74r3": {
              "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcg74r3/",
              "text": "Agreed.",
              "author": "janitorialkeys",
              "created": 1605490341,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gcf4luj": {
      "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcf4luj/",
      "text": "The best part about de Roodes class is that the midterms are way harder than other classes. My suite mate didn’t even study more than an hour all together and got a 97 on his midterm and a 102 on the first one. While everyone in de Roodes current class is getting hard tests. This second mid term I don’t know anyone who did well on it. He gets a bunch of his questions from case studies we do in class and quizzes, but there are a portion of questions that were not even in a learning objectives for both midterms.",
      "author": "BTDBunch",
      "created": 1605470542,
      "upvotes": 2,
      "replies": {
        "gcflfp3": {
          "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcflfp3/",
          "text": "I guess under normal circumstances it sucks, but minus pre-med bandwagon courses like 336 (physiology- I actually don't particularly recommend this class). and biochem (and maybe developmental), most upper division biology courses are more like De Roode's class based on your description.  Since I have been there, there seems to have been a huge expansion of courses that are research oriented as well as many professors who have retooled courses that weren't originally so (like they were just memorization and regurgitation oriented).\n\nEven when I was there and there was a bigger mixture of classes and they were transitioning towards a bigger research/active learning focus, you would be in the more research oriented courses, and even in easier ones like evolutionary biology, you could see a clear difference between those who took more intensive intro. bio sections and those who took \"lesser\" sections where they were sort of thrown softballs and only required to know the material at sort of a surface level.   It'll pay off, trust me.  In addition, aren't they de-weighting exams vs. \"normal\" years such that mediocre exam performance doesn't take away the possibility of an A-/A.  This year seems to be a good year to try the instructors with better training with lower risk to the GPA than in a normal year.  This is definitely a \"thank De Roode(and Cole if you can take her for 142) later\" situation if you plan to take upper division bios or NBB courses.\n\n\\*Those questions not directly in the learning objectives sounds sort of what a lot of upper division bios do and what chem does in standard years.  They'll put somewhat \"derivative\" items that have to do with the learning objectives but are asking you to sort to sort of use what you know to think about a new or more complex scenario.  For example, upper divisions that use give test items on discussion section papers may ask you about undiscussed aspects of a figure (or sometimes even about an undiscussed figure or technique) you actually did go over just to see if students can think.  I can't be sure that is what De Roode did, but it sounds familiar and isn't that uncommon in Emory STEM courses, especially with what are known to be stronger instructors.",
          "author": "oldeaglenewute2022",
          "created": 1605479053,
          "upvotes": 2,
          "replies": {}
        },
        "gcg7dvt": {
          "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcg7dvt/",
          "text": "I think there were a few people that did well on it and only people (like me) that did poorly are on it are more vocal. The exam was wayyy harder than expected, though.",
          "author": "janitorialkeys",
          "created": 1605490475,
          "upvotes": 1,
          "replies": {
            "gcggabx": {
              "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcggabx/",
              "text": "I have to ask.  What was the expectation? Are you comparing it to a practice exam and thought it was harder or did you think the content was simple enough but he asked harder questions about it that you didn't anticipate OR did you expect it to be more like the first exam.  The expectations game matters.  And if it is the latter, you'll find a pattern at Emory.  In many STEM courses,  teachers will throw a softball for the first exam (like often it'll be AP review or, in the case of some upper divisions, review from a pre-req) and then start getting quite serious in future exams. Never let an E1 fool you!  And in normal years, assume they are targeting a B- or B average in large STEM courses.  So if things start off with \"high\" means, expect at least 1-2 tougher exams (for test based classes, they can dip into low 80s, high 70s.  For classes with grades distributed accross a bunch of stuff, maybe low-mid 70s for the harder exams.  The first exam will often be the buffer).",
              "author": "oldeaglenewute2022",
              "created": 1605495074,
              "upvotes": 1,
              "replies": {
                "gcggzth": {
                  "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcggzth/",
                  "text": "It was not similar to the practice exam at all. I did pretty well on the practice, but the actual exam had questions much more specific to the first 1-6 weeks of the class than expected. The practice exam for the first midterm was quite similar, so I expected the same for this one. I didn't expect it to be tricky, but I guess I should have prepped myself.",
                  "author": "janitorialkeys",
                  "created": 1605495455,
                  "upvotes": 1,
                  "replies": {
                    "gcghhql": {
                      "link": "/r/Emory/comments/juctm5/am_i_the_only_one_struggling_in_biol141_w_de_roode/gcghhql/",
                      "text": "Yeah, expect many bio classes with a cumulative final to do that because they want to constantly hold you accountable for earlier material so you can avoid cramming as much for the final.  Some will do it by asking specific detailed oriented questions from a past module and some will use more multi-concept problems where knowing older material helps.",
                      "author": "oldeaglenewute2022",
                      "created": 1605495717,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}