{
  "sid": "qjtirb",
  "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/",
  "title:": "Off Campus Housing Search Advice",
  "text": "Just general advice for moving off campus next year. When should I get started with the process and when should I have a place confirmed? Good places that arent too expensive, places to avoid, advice with the actual process of looking at places, etc.\n\n I've heard people say living on campus is cheaper and people who say living off campus is cheaper, and I really want to live off campus, but I'd rather it not be more expensive.\n\nAny advice would be appreciated!!",
  "author": "Jellydonut4u",
  "created": 1635698968,
  "updated": 1636195676,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hisj5tv": {
      "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/hisj5tv/",
      "text": "Think Emory Point is similar in price, but avoid the leasing building which is any room that starts with a 3, so like 3XXX. I live there and its a little more expensive than on-campus but definitely not worth the money you are paying. It is a lot better in any other building though.",
      "author": "Korean_Yezus420",
      "created": 1635704687,
      "upvotes": 2,
      "replies": {
        "hja4ao8": {
          "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/hja4ao8/",
          "text": "I was actually thinking of getting an apartment there. Was there any specific reason to avoid the leasing building?",
          "author": "iwilleatmyneighbors",
          "created": 1636033392,
          "upvotes": 2,
          "replies": {
            "hja5cjx": {
              "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/hja5cjx/",
              "text": "so it's known to have a lot of bug problems. the hallways have lots of bugs everywhere. Its because its an open building. And because it is an open building, during this period of the year, the temperature in your apartment fluctuates a lot. Basically if you don't turn on the heater, you are cold aF when you wake up. Please please please avoid any building thats in the leasing office, you can get much more value from any other building m8.\n\nNOT ONLY THIS, when you turn on the heater, it fucking destroys you. IT BLASTS THE MOST DRY AIR EVER. Had ot get a humidifier to not kill my throat\n\nNOT",
              "author": "Korean_Yezus420",
              "created": 1636033865,
              "upvotes": 2,
              "replies": {
                "hja5ipt": {
                  "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/hja5ipt/",
                  "text": "Thank you so much!! I’ll definitely keep this in mind!",
                  "author": "iwilleatmyneighbors",
                  "created": 1636033940,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hit223z": {
      "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/hit223z/",
      "text": "I can’t tell if living off campus is cheaper or not for me bc i have a 12 month lease for an off campus apt vs living on campus for just the school year. There’s a lot of apartments around Emory, it just depends whether or not you need one close to a shuttle. I’d make a list of options and just look at their floor plans on the website to know the availability of their units. I’d say most ppl start looking anywhere from mid-spring semester to june/july. Most people will have leases that end either the end of the spring semester or the end of july.",
      "author": "EveningExit",
      "created": 1635712549,
      "upvotes": 2,
      "replies": {}
    },
    "hiy0xbw": {
      "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/hiy0xbw/",
      "text": "A lot of it comes down to financial aid. Housing increases cost so you may end up with more aid on the other had aid in most cases does not cover off Camus (aside from last year). If it's a factor i highly recommend reaching out to the office. \n\nEmory hosts a third party site that can allow you to filter through a ton of off campus options. You can filter on price and location and includes properties aside from apartments as well (carriage houses, rooms for rent, etc.). This site can also connect you to roommates.  Offcampushousing.emory.edu\n\nIf you are looking for roommates i see a lot of that on the Emory buy and sell page.\n\nBe careful if you are looking to sublet. Some people may try to sublet under the table which can work out but can be cause for eviction (I've seen this at Emory Point). \n\nFinally, remember to consider additonal costs when considering your budget. Lots of local complexes have added fees in addition to rent/wifi/utilities/etc. Lastly keep in mind that most leases are for an entire year and not just the school year (three months more than Clairmont).",
      "author": "IAmDianasDaughter",
      "created": 1635808378,
      "upvotes": 2,
      "replies": {}
    }
  }
}