{
  "sid": "q7le90",
  "link": "/r/Emory/comments/q7le90/competitiveness_of_the_msba_program/",
  "title:": "Competitiveness of the MSBA Program",
  "text": "Hi all!\n\nI'm a sophomore student who just got into the b school (yay) and is considering the MSBA program. I'm just wondering if anyone knows how competitive it is to get into the MSBA program as a BBA student - should I expect something like the BBA admissions or something like admission into Emory?",
  "author": "chanmaofei",
  "created": 1634161407,
  "updated": 1634600145,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hgjdtht": {
      "link": "/r/Emory/comments/q7le90/competitiveness_of_the_msba_program/hgjdtht/",
      "text": "BBA/MSBA from 2020, from my understanding, most BBAs are basically a shoo-in, as long as you talk to Allison and she knows who you are and what your plans are, and do all the requirements. I’ve only known 1 BBA person to get straight up rejected. Idk if the competitiveness has gone up due to the popularity of the program, but I suspect they are more likely to adapt for larger cohorts than reject BBAs cuz money. So you should be fine.",
      "author": "Worldlover67",
      "created": 1634162428,
      "upvotes": 1,
      "replies": {
        "hgjnr6z": {
          "link": "/r/Emory/comments/q7le90/competitiveness_of_the_msba_program/hgjnr6z/",
          "text": "Ohh that's nice! Thank you :)",
          "author": "chanmaofei",
          "created": 1634166930,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgk0qbp": {
      "link": "/r/Emory/comments/q7le90/competitiveness_of_the_msba_program/hgk0qbp/",
      "text": "idk, my roommate is also considering MSBA. I'd maybe talk to an advisor about it and see if you could talk to someone who is already in the program?",
      "author": "kynurenic",
      "created": 1634173062,
      "upvotes": 2,
      "replies": {}
    },
    "hglw3qx": {
      "link": "/r/Emory/comments/q7le90/competitiveness_of_the_msba_program/hglw3qx/",
      "text": "Why do you feel as though you need it? You could always pair the bba with QTM if you want a more quantitative curriculum.  The avg salary for Emory MSBA is $88,000, that's not much higher than a regular bba. But to answer your question it shouldn't be hard as I knew several non-bba majors in the program, and I assume you would have an advantage being bba.",
      "author": "91210toATL",
      "created": 1634217545,
      "upvotes": 2,
      "replies": {
        "hgmjm5h": {
          "link": "/r/Emory/comments/q7le90/competitiveness_of_the_msba_program/hgmjm5h/",
          "text": "I will say some positions are now being gatekeeped by “MS degree required”, and it may hinder career growth down the line to not have one. So, depends on what kind of jobs they are looking at. I will say, some people in the program do settle for jobs that could also be acheived by BBAs(due to lack of sponsorship for higher paying roles). But the salary you’re pointing out for BBAs might also be skewed due to finance majors; ISOM jobs are typically closer to 70k. That’s still a big gap in overall earnings. \n\nAnecdotally, my salary was close a little above the 88k you cited above, but after one year I got a job with a 40% higher base. I doubt ISOM  BBAs have that kind of trajectory without an MS",
          "author": "Worldlover67",
          "created": 1634227714,
          "upvotes": 1,
          "replies": {}
        },
        "hgn7zsu": {
          "link": "/r/Emory/comments/q7le90/competitiveness_of_the_msba_program/hgn7zsu/",
          "text": "I am currently on the QSS+BBA track but I got convinced at their seminar lol. Basically what Worldlove has said and the fact that I feel like the MSBA classes are more \"applied\" whereas the QTM classes are more \"theoretical\"?  I'm still debating tbh...\n\nAnd thank you for the reply :)",
          "author": "chanmaofei",
          "created": 1634237774,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}