{
  "sid": "qv1khw",
  "link": "/r/Emory/comments/qv1khw/we_need_to_talk_about_how_hypocritical_awareness/",
  "title:": "We Need to Talk About How Hypocritical \"Awareness Organizations\" Are (CONTINUED)",
  "text": "This is a followup to my previous post talking about the struggles of not having representation on \"awareness organizations.\" While I didn't call out a particular organization, I saw a response from Emory AAO. Which, yes, was the organization I had written the post initially about.\n\nThat post was written because it is honestly tough to watch members and board members of mental health (Emory Seats at the Table) and awareness organizations (Autism Awareness Organization) claim to represent me while demeaning and judging me. What am I supposed to do? Out myself and hope they all come running to apologize? Like, oh... your behavior is justified now! Sorry for trashing you!\n\nAfter seeing the responses, some I did not expect, I wanted to reach out to this community and ask for advice. How can you find support here without \"outing\" yourself? How can we make the school take action and make change without stepping forward? The honest answer to those are... we can't. \n\nAfter making that post, I received several DM's asking for me to identify the people I was talking about. \n\n(1) Me saying their names only puts a target on myself. If I say John Doe said something, John Doe might immediately realize it was me who made the post. I'm not risking that.\n\n(2) Performing a man-hunt to find these members changes nothing. We need to educate the community on basic human decency. Don't call people weird or retarded behind their backs. You never know if they, like myself, struggle to deal with a diagnosed disorder.\n\nThis post was definitely a bit longer, and I honestly feel like I've written an article for the wheel. \n\nHow can we fix this issue? Do you deal with this? How can we support each other while remaining comfortable with our anonymity? \n\nOne idea I had was making a private group on Reddit or another platform to keep the members anonymous while allowing them to depend on each other for support, advice, and representation. \n\nShould I get the ball rolling there? Or... is it just too late to try?",
  "author": "Adventurous-You-634",
  "created": 1637044587,
  "updated": 1637182556,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.93,
  "comments": {
    "hkua8eo": {
      "link": "/r/Emory/comments/qv1khw/we_need_to_talk_about_how_hypocritical_awareness/hkua8eo/",
      "text": "There's really a lot of stuff to talk about here but for simplicity, it really doesn't matter unless you make it matter.\n\nFixing an issue always involves two kinds of individuals: one who brings awareness to the issue so others can act, and one who acts on the issue. Both are dealing with the issue in their own way, and neither is more correct than the other.\n\nYour way was to bring awareness to the issue by making this post. You could have also just joined the same organization instead of complaining that they didn't represent you, and make the change from within so that the organization can *actually* represent people like you. Or you could have done both.\n\nEither way, you have done your part. It is not your responsibility to correct every single wrong in the world. There will always be misrepresentation or a lack of representation, in any field, no matter how you spin it. In school, in your chosen career, in your country, you name it.\n\nUnderrepresented in medicine, women in STEM, x disability, etc. At the end of the day, it's what you do with your life for your self-identified category that matters, not how much a preexisting organization claims to represent you. \n\nAnd even then, maybe nothing will come out of it. Or maybe you'll spread more awareness. Or maybe you'll be the role model for others who identify similarly to you. You can't guarantee any of this, you can only do the work of one person.\n\nThe most you can do is do whatever you and others like you think is best together. Be careful not to define yourself so much on what you called a \"diagnosed disorder.\" Remember, an illness is only considered a disease or a disorder because a physician said so (Kleinman). You don't have to swear by this label that medicine made for you, you don't have to fulfill the sick role just because.\n\nThis response probably leans more towards cynicism, but honestly for me it was the best way to move forward in life where representation is such a precarious thing.",
      "author": "Hernalic",
      "created": 1637061479,
      "upvotes": 5,
      "replies": {}
    }
  }
}