{
  "sid": "genvsp",
  "link": "/r/Emory/comments/genvsp/mental_health_resources_on_campus/",
  "title:": "Mental Health Resources on Campus?",
  "text": "I’m an incoming freshman with a history of depression and social anxiety disorder. Both of those things have gotten significantly better, but not to the point where they’re nonexistent. I still do therapy and take medication.\n\nDo you guys know of any on-campus resources that are available to students with mental illnesses, and do any of you recommend that I use them? I’m aware that most mental health services at universities in general in the US *suck*, so it’s probably no different at Emory. But still, even a little help on campus would be nice. \n\nI’m mainly worried about adjusting the first few months since I’ll be away from home. I think everything will get a lot easier after that. I’m definitely going to be looking at therapists/psychiatrists in Atlanta. On a side note, does having something like depression allow you to get a single dorm if you go through DAS?",
  "author": "LostWindSpirit",
  "created": 1588784491,
  "updated": 1634099289,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "fpoyrio": {
      "link": "/r/Emory/comments/genvsp/mental_health_resources_on_campus/fpoyrio/",
      "text": "I’m not too sure about the dorm thing, but I came to Emory knowing that I wanted to get help for depression for the first time. I first went to CAPS, which transferred me over to long term treatment and therapy at Emory’s psychological center. I go to Student Health Services for psychiatry. I hope that helps a little.",
      "author": "organized_plunder",
      "created": 1588792974,
      "upvotes": 3,
      "replies": {
        "fpp4dyb": {
          "link": "/r/Emory/comments/genvsp/mental_health_resources_on_campus/fpp4dyb/",
          "text": "Yeah, that does help! Do you think it’s better to go to a private psychiatrist or go to Emory’s SHS?",
          "author": "LostWindSpirit",
          "created": 1588795761,
          "upvotes": 2,
          "replies": {
            "fppixes": {
              "link": "/r/Emory/comments/genvsp/mental_health_resources_on_campus/fppixes/",
              "text": "It depends what you’re looking for. There are probably lots of psychiatrists nearby because of the hospital, but for me I found it easier just to walk over to student health services. It’s really up to you though! I know student health services can be really slow sometimes though.",
              "author": "organized_plunder",
              "created": 1588803119,
              "upvotes": 2,
              "replies": {
                "fppk7oi": {
                  "link": "/r/Emory/comments/genvsp/mental_health_resources_on_campus/fppk7oi/",
                  "text": "Wdym by it being really slow? Does it take long to schedule appointments or can you not go often?",
                  "author": "LostWindSpirit",
                  "created": 1588803805,
                  "upvotes": 2,
                  "replies": {
                    "fppkjsy": {
                      "link": "/r/Emory/comments/genvsp/mental_health_resources_on_campus/fppkjsy/",
                      "text": "Appointments fill up really quickly, so scheduling the first appointment for me meant I had to wait around a month or so.",
                      "author": "organized_plunder",
                      "created": 1588803985,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fpoi3so": {
      "link": "/r/Emory/comments/genvsp/mental_health_resources_on_campus/fpoi3so/",
      "text": "Hi, I use DAS so I can answer some of your questions\n\n1) DAS will connect you to campus resources, it's best you get registered through DAS as many of the resources you're seeking can be obtained through them.\n\n2) You can request it and you'll be prioritized but there's no guarantee you'll get it.",
      "author": "Dr_Yankee",
      "created": 1588784880,
      "upvotes": 3,
      "replies": {
        "fpoiow6": {
          "link": "/r/Emory/comments/genvsp/mental_health_resources_on_campus/fpoiow6/",
          "text": "Thanks for answering!",
          "author": "LostWindSpirit",
          "created": 1588785157,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}