{
  "sid": "jsyaqr",
  "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/",
  "title:": "EMORY FALL 2020 GRADING POLICY SURVEY",
  "text": "[EMORY FALL 2020 GRADING SURVEY](https://docs.google.com/forms/d/1i3L93K7PO8KZzQswmeogrWo28_O8dxz3builU4o8P-Q/edit)\n\n\nHowdy folks!\nHere is a survey (previously posted as an edit in the petition post) that will serve as a platform for public conversation on this issue. Please feel free to respond to any or all of the questions!  If you are curious for a greater context on this issue, I encourage you to read the description of the survey, as well as the description of the petition.\n\nIn the coming weeks, things hopefully will change however the only way we can get this done is by making the university notice a conversation, so please share this with friends, and professors if you want!\n\nMake a change!",
  "author": "anon_Emory",
  "created": 1605200421,
  "updated": 1634099156,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "gc5n4z0": {
      "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/gc5n4z0/",
      "text": "I talked to my PACE advisor about this. He said S/U is very unlikely to happen because the institution Emory receives accreditation from doesn’t normally allow s/u like it was in the spring but they didn’t have an option so they let it slide. We all knew this semester was gonna be online so they don’t care basically. I’m so upset about this.",
      "author": "blueravenclaw29",
      "created": 1605279417,
      "upvotes": 4,
      "replies": {
        "gc6fq03": {
          "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/gc6fq03/",
          "text": "Does Oxford not get accreditation?",
          "author": null,
          "created": 1605293800,
          "upvotes": 2,
          "replies": {
            "gc6mbkc": {
              "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/gc6mbkc/",
              "text": "No idea",
              "author": "blueravenclaw29",
              "created": 1605297045,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gc6swd0": {
      "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/gc6swd0/",
      "text": "Hi! I'm the President of Oxford SGA who advocated for the S/U policy. I would say that the policy recently implemented at Oxford is not a broad, overarching S/U option like that of Spring 2020. There are many nuances to out policy for Fall 2020. Students may only chose S/U for one class. Classes graded on S/U will only count to total credit hours but not to major, GER, pre-professional, pre-requisite requirements. Students who chose S/U for a class that falls within that category will most likely have to retake it for a grade. S/U at Oxford is an emergency policy for students who are absolutely struggling in one class. It is more restrictive than the longstanding S/U policy in the College of Arts and Sciences. Happy to discuss about it more in detail but I would caution against saying that this is an advantage or special privilege given to Oxford students because that simply isn't true. ECAS has had it for a long time. While the same restrictions for how S/U and credits work apply to ECAS students, ECAS does not have a limit on the number of classes students can take as S/U. Oxford has never had it. All we did was ask for equity. This does not achieve full equity but it does put Oxford on a more level playing field in comparison to the Atlanta campus.\n\nI suggest you look at the context of these policies, as did I when I looked into ECAS policies to advocate for an equitable Oxford S/U, so you can use factual information to support advocacy for broader S/U measures.",
      "author": "cactuscat123",
      "created": 1605300320,
      "upvotes": 3,
      "replies": {
        "gc73s1n": {
          "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/gc73s1n/",
          "text": "Thank you for this comment,\nThere was a message I had been provided that was misleading as for the Oxford Policy changes, and upon further notice here, I can see that the policy is laid out clearly. I am greatly appreciative of this correction, as based on the original message I was sent, it had absolutely seemed that there was an advantage at play. I will be sure to change the description of the survey immediately.\n\nAlthough this is a positive change, I do not know if it is enough on either side, which is disheartening. Firstly, limiting this policy to classes outside of GER, Major Req. / Prereq is essentially only making this policy valid for class options that would be under the realm of what could be considered choice or elective. As plenty of students are conscious and mindful of schedule and schedule planning from an early start, this is not an effective translation of solution to the problems that would be seen by those individuals who are struggling academically within the confines of the GER, and Major Req. /PreReq paths. Given the emphasis on the Liberal Arts requirements of Emory University and Oxford College students, often it is already difficult to choose a class outside of the realm of a GER/Major Req.-Pre-Req. I believe although this change is effective for some, it would especially leave students who are further in a major path/ who are 3rd and 4th years at a disadvantage. At Oxford, given the fact that students are limited to a 1st-2nd Year experience, this most likely isn’t as large of an issue. Consider that many 3rd and 4th years are limited in schedule to classes that are of major requirements, and are also feeling the potentiating effects of a compressed semester, a pandemic, a new system of learning, and dynamic sociopolitical climate. Without the freedom to take a class S/U, (even just one) within the major requirements or GER, students who are deeply invested in their Major (mostly 3rd and 4th years) and restricted to the bounds of such based on limited time/opportunity for class scheduling are left stranded.\n\nAlthough a change has been made, I encourage you to fight for more. The college experience should prioritize mental health, and curiosity and NOT statistics. A common theme of this semester, as found from some of the results of this survey are that decreased mental health is causing decreased academic curiosity, motivation and in turn, performance. \n\nUnder normal circumstances, normal policy should be a model for the future in regard to preparing students, but as we have seen that universally, students and faculty are struggling with the potentiating offers of a compressed semester (sometimes signifying an expected increased rate of learning/teaching), COVID-19, a new system of education (online learning) and an uncertain political climate, greater change is necessary. Especially for low income students, international students, and students who are far along the path in their educational journey.\n\nThank you for you kind notice, and hopefully this can open a dialogue.",
          "author": "anon_Emory",
          "created": 1605305867,
          "upvotes": 2,
          "replies": {
            "gc7ys4k": {
              "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/gc7ys4k/",
              "text": "Yes! I totally agree with you and am still pushing. It's hard at Oxford bc most students are taking GER courses. This S/U acts like a soft withdrawal that doesn't penalize students w/o a \"W\" in practice. Not enough but def better than what we had before which was nothing. From what I've observed the University is dead set against changing the grading policy bc most other universities aren't. The reason they keep giving me in Board of Trustees and University Senate meeting is that they \"want students to be competitive\" for jobs, grad school, etc. ://",
              "author": "cactuscat123",
              "created": 1605324202,
              "upvotes": 2,
              "replies": {
                "gccjp3x": {
                  "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/gccjp3x/",
                  "text": "I have been provided with the same reason. This is a harmful and dangerous logic to use as an institution. Firstly, students will not be competitive in the professional/graduate scope if their academic performance decreases significantly as a result of the very abnormal circumstances we all face. So already, this is a suspiciously indirect and hollow response to give a very reasoned approach. This leads to the conclusion the administrative reasoning is truly external to a consideration of the lived-student experience, and actually for public standard and accreditation. In fact, there are also studies that also conclude such. I will link two very helpful resources to check out on this issue. Essentially, the issue now becomes of holding namesake in the public eye. To me, this is a gross embodiment of the dangers of institutional disconnect from the  very human body it is contingent on. An aspect to this that is seemingly crucial to the forming of policy is one of administrative ignoring of the public health/mental health of the student body. In short, there is an intentional attempt to disconnect the lived experience of a human being, and the educational experience of a student, for if you can reify an individual/body to something inherently derivative of humanity (IE the University primarily considering us functions of them, rather than as people), you can easily circumnavigate many dense humanitarian issues, in a crafty and tricky way. This is seemingly what happened at Oxford by releasing a change that is more functional as a conceptual assuage to our problems than an actual effective and reasoned solution. I am frightened and hurt by the implications of the institutional response to this movement, locally and nationally. These resources I think are extremely valuable, because they very effectively bring up these issues, and deconstruct administrative arguments that surround them. There is a reason many schools have already made the change(like William and Mary); because they have made the conclusion that student health and honest engagement in learning without the pressures of a strict grading system is more important than \"looking good\" in the higher education realm. I have a hard time finding this situation to be anything but a massive impersonal rouse. The problem here and now, is that public health is at play, and in some way the lack of policy change is adding to the massive pile of health/mental health issues we face, or at least amplifying the ones we already experience.\n\nhttps://www.learningoutcomesassessment.org/wp-content/uploads/2020/08/2020-COVID-Survey.pdf\n\nhttps://www.insidehighered.com/digital-learning/article/2020/08/12/many-colleges-will-return-normal-grading-fall-will-semester-be",
                  "author": "anon_Emory",
                  "created": 1605419409,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gc5jxqq": {
      "link": "/r/Emory/comments/jsyaqr/emory_fall_2020_grading_policy_survey/gc5jxqq/",
      "text": "[deleted]",
      "author": null,
      "created": 1605277306,
      "upvotes": 2,
      "replies": {}
    }
  }
}