{
  "sid": "n51ju8",
  "link": "/r/Emory/comments/n51ju8/phys141142_premed_question/",
  "title:": "PHYS141/142 pre-med question",
  "text": "Hey, I'm a rising sophomore currently planning on taking phys 141/142 this summer. Wondering if anyone can offer any thoughts on the general difficulty of these classes at Emory (planning on taking Dr. Bing). Would it be worth taking instead at a state college? Have also heard summer classes are much harder because of their faster pace, would it be more advisable to take a class like physics in a fall/spring semester instead?\n\nThanks in advance!",
  "author": "jdawg1440",
  "created": 1620171084,
  "updated": 1634098150,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "gwyu9en": {
      "link": "/r/Emory/comments/n51ju8/phys141142_premed_question/gwyu9en/",
      "text": "How do you define \"hard\"?  With the exception of physics (and maybe some calc. instructors), most Emory STEM summer courses are simpler (definitely the case for chemistry and biology. Most are stripped down vs. semester versions) in terms of the content covered and the level of the exams vs. a full semester (instructors can't give exams outside of the classroom time and have less access to student support infrastructure like Learning Assistants), but do move faster.  The main downfall may be the pace where you could be learning simpler material than a semester or even taking objectively easier exams (think less challenging problem types) but still do the same or worse than if you took it during the year AND you may retain less material if you aren't going to take another course that builds on that foundation.  Could be bad if you want to retain some of it for MCAT prep, but maybe less bad if you're fine just reteaching yourself physics during the prep phase.\n\nAlso, there are many \"state schools\" where physics may end up being harder than Emory's version because many take entry physics courses (whether it serves pre-healths or engineers) much more seriously.  What I will say is that Bing is an EXCELLENT teacher and can give challenging exams from time to time (but I think \"challenging\" in the context of physics at Emory usually means near an 80 flat average on exams or mid and high 70s for harder content).\n\n&#x200B;\n\nAlso, fall/spring depends on your goals.  If you are NBB and plan to take NBB 301 anytime soon, maybe summer is the move because you probably don't want to take 301 before physics 142 (others will have an advantage).  Fall/spring in any other major just depends on what the rest of your schedule will look like (like would it stop you from comfortably taking a Weinschenk for ochem or something? Would you have to dial back any bio or other courses you are taking to accommodate physics and/or chem if you are taking the latter?). It looks like you'd get to have Bing in person spread over a semester which is amazing, but they may throw you a really weak professor (who isn't necessarily easy) for 142 (whereas I think the Oxford dude for 142 over summer may be solid.  I don't know.  Find an Oxford person and ask).",
      "author": "oldeaglenewute2022",
      "created": 1620173568,
      "upvotes": 4,
      "replies": {}
    }
  }
}