{
  "sid": "kfdr93",
  "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/",
  "title:": "Is Emory harder to get into ED2?",
  "text": "I just got deferred from WashU ED1 and want to apply to Emory ED2. I have a 4.3 weighted GPA out of 5. I only got to take the ACT once, got a 29, and am not submitting it. I know Emory has a fairy high acceptance rate ED1, but does anyone know what it is ED2? What are my chances? Does ED2 help at all? Thanks!",
  "author": "BidLivid378",
  "created": 1608264485,
  "updated": 1634099191,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "gg7vyqi": {
      "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg7vyqi/",
      "text": "I don’t have official stats to back up what I’m saying (they don’t generally publish ED2 statistics) but hear me out. ED2 has an advantage over RD, but also has a disadvantage compared to ED1. The advantage over RD is that you won’t be rejected due to reasons like yield protection or demonstrated interest. They know you’re committed to go, so if your application is up to par, you’ll be admitted. \n\nThe problem with ED2 compared to ED1 is that when they are looking at ED1 applications, those are the only applications that they see. For ED2, they can now see their entire pool of applicants. So if they see that there is an exceptionally strong RD pool, that may diminish your chances compared to ED1 when the RD pool was still unknown. \n\nBasically, ED2 gives you a better chance than RD, but not quite as much of an edge as ED1. For my admissions year (Class of 2023) the ED1 acceptance rate was around 30%, while RD was around 12%. ED2 was likely between these 2 numbers but closer to RD. For what it’s worth, I was admitted ED2 :)\n\nBest of luck!",
      "author": "j11234567890",
      "created": 1608265420,
      "upvotes": 7,
      "replies": {
        "gg7zhpc": {
          "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg7zhpc/",
          "text": "lol on yield protection.  Boy Emory sucks at that part.  Definitely has to have one of the worst yield formulas out of elite private schools (and clearly still enrolls a tad too many from RD who aren't remotely a fit).  Almost as if they don't they don't care.  I know they have to to some extent, but you think they would have finally found an Emory \"type\" over the years in which it began to increase selectivity again to at least be able to tweak/improve the yield number more in its favor for the rankings like...almost every other elite private and public has.",
          "author": "oldeaglenewute2022",
          "created": 1608267527,
          "upvotes": 6,
          "replies": {
            "gg80l7i": {
              "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg80l7i/",
              "text": "Ok that’s definitely fair on the yield protection part lol…still, there should be some sort of advantage to ED2 vs RD",
              "author": "j11234567890",
              "created": 1608268247,
              "upvotes": 2,
              "replies": {
                "gg814bl": {
                  "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg814bl/",
                  "text": "Yeah, I don't remember where I got the stats showing ED2 and RD were the same rate wise, but as I said, I suspect you are right in terms of credentials.  I think people often, for example, assume that because 2 places have the same SAT score range or admission rates that the 2 places are the same caliber when that is often not true.  Say you compare a stats whoring top 12-25 school to Harvard or MIT.  They can look similar based on metrics provided in the CDS and admissions office webpage, but the latter is more likely to successfully enroll national/international award winners for a particular discipline/area or giant chunks of students already specialized in certain things or to able to pull exhorbitant amounts of students from top boarding schools and magnets in the U.S. vs. being \"paper perfect high achievers\" that are less \"spikey\" (I think that is the term I've seen used for semi and highly specialized applicants) and probably come from a much bigger range of school types and rigor.  \n\n&#x200B;\n\nI feel like that is kind of the difference between ED2 and RD tbh.  RD admitted students will probably be better on average on a lot of things you can't see by just looking at numbers.",
                  "author": "oldeaglenewute2022",
                  "created": 1608268604,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gg8000a": {
          "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg8000a/",
          "text": "Thanks! What were ur stats?",
          "author": "BidLivid378",
          "created": 1608267854,
          "upvotes": 1,
          "replies": {}
        },
        "gg8hhzf": {
          "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg8hhzf/",
          "text": "I suspect we'll get the ED2 stats through the Wheel.",
          "author": "iapetus3141",
          "created": 1608282354,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gg7yhjn": {
      "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg7yhjn/",
      "text": "I don't know about harder stats wise but apparently for the last 5 years or so, the admissions success rate of ED2 was identical to RD.  I am inclined to believe the poster above but with respect to credentials and stats(I guess...) and not overall rate.  They'll probably want students that look much more like the RD crowd AND who are clearly a fit for the U vs. things that indicate that they are just trying to get into Emory as a relatively accessible \"elite\" school to avoid risking their chances at RD for Emory and elsewhere.  In this case, at least Emory and WUSTL are very similar schools in many respects.\n\nedit: Shouldn't have conflated stats with credentials.",
      "author": "oldeaglenewute2022",
      "created": 1608266897,
      "upvotes": 3,
      "replies": {
        "gg8yi1l": {
          "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg8yi1l/",
          "text": "any way to show them that ur genuinely interested? they don’t even consider demonstrated interest😭",
          "author": "rannchel",
          "created": 1608298016,
          "upvotes": 1,
          "replies": {
            "gg99a0x": {
              "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg99a0x/",
              "text": "less about genuine \"interest\" vs. demonstrating a \"fit\".  Essays and whatnot, if done well enough should indicate your academic potential and fit at Emory.  Do the best you can on those.  There will be no magic bullet, but the short answers exist and are crafted a certain way for a reason so definitely be thoughtful, concise, and honest in them.  Notice how they aren't something super generic like:\"Further elaborate about one of your ECs or activities in your resume or personal statement\".",
              "author": "oldeaglenewute2022",
              "created": 1608304375,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gg8ciu6": {
      "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg8ciu6/",
      "text": "Believe ED2 was around like 15% and RD was like 13% - so take it as you will; however, oxford ED and RD is higher around 20 ish for both.",
      "author": "SaintRufus",
      "created": 1608277649,
      "upvotes": 3,
      "replies": {}
    },
    "gg8quse": {
      "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg8quse/",
      "text": "https://emorywheel.com/international-early-decision-applications-decreases-by-3-percent/\n\nED 1 acceptance rate was 33%. ED 2 acceptance rate was 13%. The RD acceptance rate was actually higher. I wouldn’t apply ED 2 unless you’re a recruited athlete tbh or if you’re in love with Emory and want to know a little earlier than usual.\n\nMaybe consider ED 2 to Pomona/NYU/Vandy/Chicago/Tufts if you like any of those schools, but the acceptance rate for ED 2 might be lower for those schools in comparison to their RD acceptance rates too, don’t know.",
      "author": "LostWindSpirit",
      "created": 1608291728,
      "upvotes": 2,
      "replies": {}
    },
    "glxku6u": {
      "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/glxku6u/",
      "text": "Yay!  Son accepted ED2 class of 2025!!!",
      "author": "Cautious-Drink-1352",
      "created": 1612400246,
      "upvotes": 2,
      "replies": {
        "glyeg7i": {
          "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/glyeg7i/",
          "text": "Congratulations!",
          "author": "VTDMAN7",
          "created": 1612415531,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gg83y1e": {
      "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/gg83y1e/",
      "text": "WashU and Emory are very similar with a similar acceptance rate for ED so it won't be easier but it's worth a shot. You should submit your test scores either way.",
      "author": "91210toATL",
      "created": 1608270592,
      "upvotes": 1,
      "replies": {}
    },
    "glxawd3": {
      "link": "/r/Emory/comments/kfdr93/is_emory_harder_to_get_into_ed2/glxawd3/",
      "text": "Did you end up applying to Emory ED2 ?",
      "author": "VTDMAN7",
      "created": 1612395372,
      "upvotes": 1,
      "replies": {}
    }
  }
}