{
  "sid": "mmv61r",
  "link": "/r/Emory/comments/mmv61r/med_school/",
  "title:": "med school",
  "text": "What are some common med schools that premed students are accepted to from Emory?",
  "author": "Due_Ad_7169",
  "created": 1617898293,
  "updated": 1634098582,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "gttqh82": {
      "link": "/r/Emory/comments/mmv61r/med_school/gttqh82/",
      "text": "This was 4 years ago but I'm sure it's still relevant. \nhttp://www.career.emory.edu/_includes/documents/outcomes2017.png\n\nUNC is a big destination as well.",
      "author": "91210toATL",
      "created": 1617898760,
      "upvotes": 2,
      "replies": {
        "gttrg64": {
          "link": "/r/Emory/comments/mmv61r/med_school/gttrg64/",
          "text": "this is very helpful, thank you!",
          "author": "Due_Ad_7169",
          "created": 1617899165,
          "upvotes": 1,
          "replies": {
            "gtty1c5": {
              "link": "/r/Emory/comments/mmv61r/med_school/gtty1c5/",
              "text": "You may be better off asking how much money those folks had (because many with less of it will turn down those schools for solid in-state options even if admitted) and what they did to get in.  Trust me, it was a lot more than playing the numbers game and it reflects on them more so than Emory where the PHA will steer you towards looking like a more \"average\" student even if you want a shot at some of those places if you aren't careful (luckily a couple of those med. schools are the purest of stats whores, but most aren't and get loads of applications from peer institutions of Emory. You need to have the profile of those people to have the best shot at interviews, and with regards to coursework, the PHA isn't advising the same as some of Emory's peers, especially the highest ranked among the top 10 crowd and those places have way more success).\n\n\\*Basically worry about what you'll do to look like applicants that get interviewed and then admitted to those places and not whether Emory \"feeds\" perse.",
              "author": "oldeaglenewute2022",
              "created": 1617901917,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}