{
  "sid": "np5s04",
  "link": "/r/Emory/comments/np5s04/overwhelmed_by_summer_classes/",
  "title:": "Overwhelmed by summer classes",
  "text": "Does anyone else feel like summer classes have taken an excessive mental and emotional toll on them? Even though I’m only taking 6 credits, I just feel so burdened and stressed out. I feel depressed and overwhelmed by my workload. I really don’t know how I’m going to get by. In a usual semester I can take up to 16-18 credits and I’ll still have time to go out and do other things. But I can’t do anything rn and I have to cancel plans just because I don’t want to risk falling behind. I know that it was my choice to take summer classes, and I just have to deal with it... but it just sucks",
  "author": "ihateusomuchemory",
  "created": 1622474301,
  "updated": 1634098030,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "h03fa8f": {
      "link": "/r/Emory/comments/np5s04/overwhelmed_by_summer_classes/h03fa8f/",
      "text": "Summer classes is 13 weeks of work crammed down into 6 weeks, 3 credits of Summer courses is probably comparable to 7-8 credits worth of classes during Fall/Spring",
      "author": "Dr_Yankee",
      "created": 1622477673,
      "upvotes": 9,
      "replies": {}
    },
    "h03f5yd": {
      "link": "/r/Emory/comments/np5s04/overwhelmed_by_summer_classes/h03f5yd/",
      "text": "Are these(or at least one of them) courses that you would have expected to be challenging(like in terms of content or workload demands) even during the regular semester or did you anticipate these courses to be on the easier side?",
      "author": "oldeaglenewute2022",
      "created": 1622477613,
      "upvotes": 7,
      "replies": {}
    },
    "h0403th": {
      "link": "/r/Emory/comments/np5s04/overwhelmed_by_summer_classes/h0403th/",
      "text": "I'm also finding summer classes to be taking up way more time that I expected. I'm taking 7 credits myself, and between that and my job (\\~11hrs/week) I have very little free time right now. You're definitely not alone in this. \n\nI'm just pushing through it because I know there's already only a few weeks left, and I'll get some requirements out of the way. I'll definitely be giving myself a break after these 6 weeks are through!",
      "author": "ILookLikeKlayT",
      "created": 1622487867,
      "upvotes": 7,
      "replies": {}
    },
    "h05b3lg": {
      "link": "/r/Emory/comments/np5s04/overwhelmed_by_summer_classes/h05b3lg/",
      "text": "I transferred in to Emory, so to graduate on time, I had to take a full load every summer. One summer, I had to knock out my PE classes in one go. \n\nI took tennis, cardio, and cycling. Each one was like a 3 hour class, back to back, so I was at the gym from like 9am to 5pm every day for 2.5 months, doing strenuous exercise the entire time with very short breaks. \n\nI literally lost like 25 pounds in 3 months, lol. It was extremely stressful and difficult, and I'm sorta sorta surprised the school let me do this. It probably wasn't very healthy.\n\nBut yeah, summer classes are rough. The other summer I took a full load of economics classes, and staying focused that long is very, very difficult, and the pacing is stressful.\n\nIMO it's worth it though, knocking out credits that quickly. It lowers the burden during the regular academic year. And I personally really enjoy how chill the campus is during the summer, when most people are off somewhere else.",
      "author": "LovableContrarian",
      "created": 1622512617,
      "upvotes": 4,
      "replies": {}
    }
  }
}