{
  "sid": "mk5m8x",
  "link": "/r/Emory/comments/mk5m8x/are_there_any_pros_to_spring_start_at_oxford/",
  "title:": "Are there any pros to Spring Start at Oxford?",
  "text": "Wow, this year was kind of a bloodbath for me. I still have a few waitlists to hear back from but Emory is the only one of my tops I got an acceptance from, and it was Oxford for the Spring 2022 semester. I’ve heard people say it’s difficult, but in the end, is it really a decision I’ll regret? I’d love to hear some perspectives.",
  "author": "offpitched",
  "created": 1617572659,
  "updated": 1634098617,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "gtea9cd": {
      "link": "/r/Emory/comments/mk5m8x/are_there_any_pros_to_spring_start_at_oxford/gtea9cd/",
      "text": "It’s hard to say exactly how it’s gonna go, this is the first year they’ve ever done anything like this.\n\nSome friends from high school took offers like this at different schools (Cornell is notorious for doing this) and most seemed to integrate fine. That being said, Oxford is fairly unique among colleges in the fact it’s so small. I know nothing about Oxford so I can’t really speak on it, but it’s definitely a sort of “out of left field” thing for Emory",
      "author": "j11234567890",
      "created": 1617578281,
      "upvotes": 3,
      "replies": {}
    },
    "gte0vp2": {
      "link": "/r/Emory/comments/mk5m8x/are_there_any_pros_to_spring_start_at_oxford/gte0vp2/",
      "text": "bruh, literally first post on the sub rn\n\n[https://www.reddit.com/r/Emory/comments/mjyhtq/why\\_i\\_an\\_oxford\\_graduate\\_dont\\_recommend\\_oxfords/](https://www.reddit.com/r/Emory/comments/mjyhtq/why_i_an_oxford_graduate_dont_recommend_oxfords/)",
      "author": "Dr_Yankee",
      "created": 1617573184,
      "upvotes": 7,
      "replies": {
        "gte18sw": {
          "link": "/r/Emory/comments/mk5m8x/are_there_any_pros_to_spring_start_at_oxford/gte18sw/",
          "text": "That’s what spawned this actually- I was almost dead set on it but I’d like to hear more than one guy’s take lol",
          "author": "offpitched",
          "created": 1617573375,
          "upvotes": 3,
          "replies": {
            "gte2ih1": {
              "link": "/r/Emory/comments/mk5m8x/are_there_any_pros_to_spring_start_at_oxford/gte2ih1/",
              "text": "I feel like no one actually knows much about it which is a problem so we can only speculate. I thought it was a new thing but apparently it isn't. The problem is, I (nor most of us) have seen any of these folks who did it talk about it(maybe that is a good sign). If you wanna do it, do it.  But if you are in a credit intensive major with sequence courses or courses with lots of heirarchy (NBB and QTM for example), you need to map out a plan. For less credit intensive majors with less hierarchy in pre-reqs, you may be just fine and I suspect that it may not be super hard to socially integrated.",
              "author": "oldeaglenewute2022",
              "created": 1617574045,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gthk49z": {
      "link": "/r/Emory/comments/mk5m8x/are_there_any_pros_to_spring_start_at_oxford/gthk49z/",
      "text": "I think the biggest pro is that you save tuition for an entire semester. That’s a lot of money that you could use to take classes in the summer at Emory or a college near your house and use those credits to have a relatively normal course load while at Oxford. Hmu if you wanna talk further about student life, academics, etc. at Oxford.",
      "author": "NoAlibiWhat",
      "created": 1617651063,
      "upvotes": 2,
      "replies": {}
    },
    "gtgyx30": {
      "link": "/r/Emory/comments/mk5m8x/are_there_any_pros_to_spring_start_at_oxford/gtgyx30/",
      "text": "Don't let one post dissuade you entirely if you would like to take that option. If it's between this and not being able to attend Oxford/Emory, and you really want to attend, then choose this. Yes you'll have to load up on credits if you want to graduate in the spring, but it's also ok to graduate in the fall of the following year. Not everyone has the same college timeline. Also, this year with covid there were plenty of Oxford students who didn't come on campus until the Spring, and they were able to make friends. I'm not going to be on campus until my sophmore year as I elected to stay remote both semesters, but I'm not worried as even though it will be harder to make friends, I doubt it will be impossible as everyone I've talked to at Oxford has been really nice. Don't let what I'm saying be the ultimate swayer either! There's also plenty of reasons why you would elect to turn it down. Think it through and do what's right for you.",
      "author": "Artist552001",
      "created": 1617641425,
      "upvotes": 1,
      "replies": {}
    },
    "gu3rrv7": {
      "link": "/r/Emory/comments/mk5m8x/are_there_any_pros_to_spring_start_at_oxford/gu3rrv7/",
      "text": "Same here with lots of waitlists and rejects. Spring admit to Oxford Emory but   I have UCSD biochem as another option. Is it right to put these two options on the same playing field? I saw the recent cons of Spring Admit post and I was wondering if UCSD would be a better option due to those factors.",
      "author": "avodkada",
      "created": 1618104988,
      "upvotes": 1,
      "replies": {}
    }
  }
}