{
  "sid": "oinf4i",
  "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/",
  "title:": "Fall 2021 Schedule for a Freshmen",
  "text": "Hi guys, can you help me look at this schedule? I'm planning to pursue a double major in Business and Psychology.\n\nhttps://preview.redd.it/dhiv4gahyqa71.png?width=1878&format=png&auto=webp&s=82a2613d96529b1728608e3fb7f749476bda4d9f",
  "author": "lifeisntawind",
  "created": 1626079997,
  "updated": 1634097548,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "h4x3g3d": {
      "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4x3g3d/",
      "text": "Speaking from experience, 8:30 in college feels much earlier than 8:30 in highschool, but if you’re an early riser, then more power to you",
      "author": "Pr1scus",
      "created": 1626097212,
      "upvotes": 17,
      "replies": {}
    },
    "h4x7go5": {
      "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4x7go5/",
      "text": "Agree with the 8:30 comment. I know the 8:30 PSYC 110 is with Kazama so that will probably be worth it, but ECS at 8:30 will probably turn into your biggest nuisance of the semester. Other than that, this looks good",
      "author": "j11234567890",
      "created": 1626099213,
      "upvotes": 8,
      "replies": {
        "h51p3vx": {
          "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h51p3vx/",
          "text": "I've heard rumors about Kazama being a great prof. I'm more of a morning person, so I think the first-year classes will be classes that I perform the best in. My only concern was whether this combination of classes will be too intense for first-years.",
          "author": "lifeisntawind",
          "created": 1626190538,
          "upvotes": 1,
          "replies": {
            "h51wir5": {
              "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h51wir5/",
              "text": "Many people coming from HS say \"they are a morning person\", but the definition of \"morning\" often shifts due to the nature and relative lack of structure in college life and how people use (or don't use) the increase in \"free time\".  Like anyone can claim to be a morning person until they choose to socialize, party, or cram(or even study regularly) late into the night/early into the morning (and when a class is boring or seems useless, you may be tempted to blow it off if tired.  And I suspect that ECS 101 has attendance requirements).  As for intensity.  That schedule has some challenge in it but shouldn't be overwhelming if you keep up with anything.  There is nothing mindblowing about financial accounting or DSci. Psych 110 can get a little interesting, but is mainly just content overload at times (My understanding is that Kazama's class is less centered on experiments and how experimental design was used to explain certain concepts and behaviors than Edwards' class so at least you don't have that extra layer of thinking on top of all that you need to sort of brute force memorize).",
              "author": "oldeaglenewute2022",
              "created": 1626193792,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h4xvsdc": {
      "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4xvsdc/",
      "text": "Don’t take a class before 9:30-10 freshman year is the only advice I can give",
      "author": "thisismyaccount2412",
      "created": 1626109932,
      "upvotes": 3,
      "replies": {}
    },
    "h4y2srp": {
      "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4y2srp/",
      "text": "I’m trying to plan out my schedule too but I can’t figure out how to do it. Where did u go to make this chart?",
      "author": "rex_madera",
      "created": 1626113050,
      "upvotes": 1,
      "replies": {
        "h4y3y2p": {
          "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4y3y2p/",
          "text": "This is from Coursicle. A lot of people use it. You can input that you're from Emory and it will connect to the course atlas so you can just search classes and add them to your schedule.\n\nYou can also put the classes you're interested in your cart on course atlas, and there's a little calendar icon which will lay them out on a weekly schedule like this for you.",
          "author": "katsteve",
          "created": 1626113565,
          "upvotes": 3,
          "replies": {
            "h4ydi6h": {
              "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4ydi6h/",
              "text": "Life saver. Thank you so much",
              "author": "rex_madera",
              "created": 1626118086,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "h4xhdt3": {
      "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4xhdt3/",
      "text": "Anything before 9 is hell for most people. You will be staying up late with your new friends.",
      "author": "crusheratl",
      "created": 1626103943,
      "upvotes": 6,
      "replies": {
        "h4xr80w": {
          "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4xr80w/",
          "text": "RIP I’m a loner so I don’t have to worry about 8 am classes",
          "author": "Dazzling-Tax-3591",
          "created": 1626107885,
          "upvotes": 1,
          "replies": {
            "h4y2jrv": {
              "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4y2jrv/",
              "text": "How do you know that already?  College changes a lot of people and they often can find their little niche group of friends.  I know you're just being funny, but don't be negative. You'll be alright.",
              "author": "oldeaglenewute2022",
              "created": 1626112940,
              "upvotes": 6,
              "replies": {
                "h4y4lux": {
                  "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4y4lux/",
                  "text": "It was kind of a joke but also true. I was a loner in middle school and high school. That was despite my high school being like 50 people per grade. I got invited to like 1 grad party. I don’t see why that would change in college tbh.",
                  "author": "Dazzling-Tax-3591",
                  "created": 1626113861,
                  "upvotes": 1,
                  "replies": {
                    "h504hxd": {
                      "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h504hxd/",
                      "text": "It can definitely change! I was diagnosed with social anxiety disorder 4 years ago, and I’ve always really been anxious with people even before that. I was alone a lot, and had few friends, much like you. \n\nI’ve been pushing myself to change throughout recent years, but I really picked it up since coming to Emory. I’ve met a bunch of people and made a lot of great friends. I don’t think I’m perfect—I’m definitely still awkward and cringy at times—but you don’t need to be. There’ll be people who like you even in spite of your flaws. Some won’t, but some will, and those are the only people that matter.\n\nIt’s never too late to change yourself or your life and university is a great place to do that. It’s almost like a soft reset of everything you’ve been through so far. Hope you’ll be able to meet more people if you think that’ll make you happy and if you want a friend or just want to talk about things feel free to dm :)",
                      "author": "LostWindSpirit",
                      "created": 1626150704,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "h4ydaho": {
                      "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4ydaho/",
                      "text": "i’ll be your friend",
                      "author": "pfdgoddog",
                      "created": 1626117979,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "h4y4z2y": {
                      "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4y4z2y/",
                      "text": "Because college is way more than 50 people per cohort and is likely way more diverse in terms of everything than any middle or high school.  Also YOU have the ability to reinvent yourself, join clubs(which have far more variety than k-12), be more outgoing or whatever.  There are a ridiculous amount of formal and informal venues to make friends, associates, whatever.",
                      "author": "oldeaglenewute2022",
                      "created": 1626114025,
                      "upvotes": 6,
                      "replies": {
                        "h4y8t6v": {
                          "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h4y8t6v/",
                          "text": "Plus if you picked the right college for you, then you will find more personalities compatible with yours. Trust us, the dorm is a game changer and your new friends will be keeping you up late.",
                          "author": "crusheratl",
                          "created": 1626115746,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h51oo3q": {
              "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h51oo3q/",
              "text": "Nah don't say that bruh. We're all gonna be those awkward freshmen kids who have no clue what to do or who to talk to. I chose those 8am and 9am classes because I'm more of a morning person, not out of a belief that I will not make any friends. I came from a school where there's less than 100 people in a cohort and only hangs out with a tiny group but I believe that there'll be much more people matching my personality and energy at Emory. We will all find our groups eventually, so no worries and keep your head up!",
              "author": "lifeisntawind",
              "created": 1626190345,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "h51otj5": {
          "link": "/r/Emory/comments/oinf4i/fall_2021_schedule_for_a_freshmen/h51otj5/",
          "text": "I'm more of a morning person, even if I stay up late I'd still rather wake up early and take naps at noon rather than sleep until noon. My only concern was whether this combination of classes is too intense for first-years.",
          "author": "lifeisntawind",
          "created": 1626190413,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}