{
  "sid": "qfwnxg",
  "link": "/r/Emory/comments/qfwnxg/biophysics_at_emory/",
  "title:": "Biophysics at Emory",
  "text": "I've been trying to find some resources and general thoughts on Emory's biophysics program and haven't found much information. As per the major requirements, it seems like mostly a physics programs with some biology attached to it.\n\nWhat's the general perspective on this program at Emory? \n\nCompared to most of the majors (especially NBBS), there doesn't seem to be that much infrastructure for it.",
  "author": "avodkada",
  "created": 1635215685,
  "updated": 1635302912,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hi2i8id": {
      "link": "/r/Emory/comments/qfwnxg/biophysics_at_emory/hi2i8id/",
      "text": "That is just a concentration hosted by physics like it is at most private schools (or most schools generally).  You would likely major in physics (the biophysics concentration), but if you wanted better training, you would also go further in the chem curriculum and go up to biophysical chemistry, structural bio (if ever offered, would likely be by a new faculty member like Katherine Davis), take physical biology which is hosted by physics and biology, and maybe graduate division courses in physics or chemistry, or even courses like cell biology, RNA biotechnology, chemical biology.  And of course, you'd likely join one of the many biophysics oriented labs in either physics, chemistry, the school of medicine, wherever.  The hallmark of biophysics at most schools outside of the super elites (like Princeton and Harvard which have honors courses/pathways for 1st years) with a whole bunch of money is the research oppurtunities.  In no way are ANY of these programs (including at a Harvard) going to be comparable to much larger and more well established undergraduate programs in life sciences or chemistry in terms of course offerings.  You kind of just have to slap some classes together that make sense and you'll need to work closely with advisors and ideally tenure track faculty who do research in those areas to guide you.  If fortunate, a freshman seminar like biomolecular machines will be offered to give you a taste.\n\nBut speaking as a burgeoning structural biologist, \"biophysics\" is kind of vague and is really highly interdisciplinary to the point where most undergrad. programs will just give you a taste.  You want to take the interdisciplinary courses offered as well as develop your math skills (so you'll wanna take a quantum and thermo course in physics.  You may even wanna take up to chem 204 and 205 in chemistry as those teach you some key biochemistry/material science and some sort of baby biophysics applications like FRET and flourescence related applications that would be relevant in your training PLUS all the math recommended by the physics department).\n\n&#x200B;\n\nAnd for your research training and fellowships, you may want to look into this cluster of researchers and whatnot:  [http://livingtheory.emory.edu/](http://livingtheory.emory.edu/)\n\nSome of the fellowship opps are coupled to a curriculum (such as biol 212, nbb 301, physical biol, etc).  Like if you end up leaning more into the biophysics of neurons, the computational neuroscience fellowship may become an option and it has an excellent track record of prepping students for top tier PhD and MDPhD programs.",
      "author": "oldeaglenewute2022",
      "created": 1635216922,
      "upvotes": 6,
      "replies": {}
    },
    "hi2jzbz": {
      "link": "/r/Emory/comments/qfwnxg/biophysics_at_emory/hi2jzbz/",
      "text": "Biophysics is a thing that is not very well advertised, but works quite well behind the curtain, especially if you get involved in research with TMLS professors",
      "author": "iapetus3141",
      "created": 1635217818,
      "upvotes": 3,
      "replies": {}
    }
  }
}