{
  "sid": "hxg5g9",
  "link": "/r/Emory/comments/hxg5g9/to_incoming_biology_and_chemistry_students/",
  "title:": "To incoming biology and chemistry students...",
  "text": "Since a lot of incoming first-years are posting schedules with questions, I thought I’d address this one as it’s own post since it’s come up a lot.\n\nIf you are taking BIOL 141 and/or CHEM 150 Lecture, take the corresponding lab component in the same semester!! There are a few reasons for this\n\n1. These science classes are not offered every semester. 141 and 150 are only offered in the fall, and then BIOL 142 and CHEM 202 only in the spring. So if you don’t take the lab your first semester, you have to wait an ENTIRE YEAR to take it next (or over the summer, but still a while to wait)\n\n2. While the content is not exactly the same between lecture and lab, it’s similar enough that being in the lecture will help you through some of the labs.\n\n3. The labs are pre-requisites to upper level classes just as much as the lectures. \n\n4. Mis-matching lectures and labs just seems messy. Who wants to be taking Chem 203 Lecture with Chem 150 Lab their fall of sophomore year? They don’t go together at all\n\nThe workload in BIOL 141L is very manageable. CHEM 150L requires a little more time and the assignments can be challenging, but going to office hours will help immensely.",
  "author": "j11234567890",
  "created": 1595648760,
  "updated": 1634098667,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.96,
  "comments": {
    "fz6136h": {
      "link": "/r/Emory/comments/hxg5g9/to_incoming_biology_and_chemistry_students/fz6136h/",
      "text": "Can we get this pinned, lol",
      "author": "phraps",
      "created": 1595651401,
      "upvotes": 12,
      "replies": {}
    },
    "fz5y1ma": {
      "link": "/r/Emory/comments/hxg5g9/to_incoming_biology_and_chemistry_students/fz5y1ma/",
      "text": "Thank goodness you did this!  It was coming up an awful lot (I'm guessing students are looking for ways to avoid virtual labs which is understandable I guess, but doing so will cause more harm and inconvenience than good).\n\n&#x200B;\n\nOn another note, since when did chem lab 1 become more rigorous than bio lab? lol. Boy have things changed.  Bio lab used to be a beast (had a phased report, presentations, weekly quizzes.  I thought chem 1/2 lab was known for being laid back and having simple post-lab assignments. Guess the new curric. changed that.  I can imagine some topics/labs being slightly more abstract/require more brain cells than labs affiliated with a standard gchem sequence).",
      "author": "oldeaglenewute2022",
      "created": 1595649288,
      "upvotes": 5,
      "replies": {
        "fz5yq96": {
          "link": "/r/Emory/comments/hxg5g9/to_incoming_biology_and_chemistry_students/fz5yq96/",
          "text": "I agree about the virtual labs. They’re not ideal, but better than the alternative of being behind on labs in my opinion.\n\nBIOL 141L still has weekly quizzes but they are 5 questions and are based off a video Dr Cole has you watch (or common sense). In CHEM 150L, the labs themselves aren’t too challenging but the post-labs that McCormick has designed are so barely related to the labs (they emphasize higher thinking, but on way different topics) that it becomes pretty tough. Especially for a first sem chem course, where some students have no background knowledge.",
          "author": "j11234567890",
          "created": 1595649753,
          "upvotes": 3,
          "replies": {
            "fz5zblo": {
              "link": "/r/Emory/comments/hxg5g9/to_incoming_biology_and_chemistry_students/fz5zblo/",
              "text": "Ahh, yeah sounds like those post-labs force you to do additional research to understand (sounds like how bio-lab used to be).  Get ready for Spartan Molecular Orbital calculations killing your time if you are taking 203 (I don't know what year you are.  You may have already taken it).  A computational aspect to lab assignments can be rough.  I was surprised when I saw they added that.",
              "author": "oldeaglenewute2022",
              "created": 1595650160,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fz64g3n": {
      "link": "/r/Emory/comments/hxg5g9/to_incoming_biology_and_chemistry_students/fz64g3n/",
      "text": "Thank you<3",
      "author": "PpigeonP",
      "created": 1595653878,
      "upvotes": 1,
      "replies": {}
    },
    "g10k4yx": {
      "link": "/r/Emory/comments/hxg5g9/to_incoming_biology_and_chemistry_students/g10k4yx/",
      "text": "lmao well registration just started and if only it was that easy to get into any of those classes. big ups all the people in front of me on the waitlists",
      "author": "jsh_",
      "created": 1597082025,
      "upvotes": 1,
      "replies": {}
    }
  }
}