{
  "sid": "n25jl9",
  "link": "/r/Emory/comments/n25jl9/oxford_housing/",
  "title:": "Oxford Housing",
  "text": "What's up everyone! I'm an incoming Ox freshman trying to figure out housing. Does anyone know roughly how many people live in each dorm at Oxford, ideally including different data for the 4 different halls within JRC? Also, I've heard the differences between the 5 main dorms such as single-gender vs. co-ed, but are there any other notable differences? Thanks!",
  "author": "xaviermg2003",
  "created": 1619823290,
  "updated": 1634098164,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 1.0,
  "comments": {
    "gwi6fy5": {
      "link": "/r/Emory/comments/n25jl9/oxford_housing/gwi6fy5/",
      "text": "hmm, when i was at ox i heard that1/3 of students lived in jrc. i don't have specific numbers, but i can list other notable differences between dorms down below. in order from newest dorms to oldest:\n\n**fleming:** kitchen on third floor; small work-out room on second; nicest/cleanest bathrooms; hardwood floors in dorms; right next to the student parking lot. arguably the best quality of all the dorms. \n\n**elizer** and **murdy** are basically the same in terms of quality/amenities/etc but there are a couple differences. **elizer** has no kitchen, but a microwave on second floor; second floor is all gender inclusive. **murdy** has no water fountain (the only dorm without one) but a kitchen on first floor. the two buildings are right next to each other.\n\n**haygood:** large sink spaces in rooms; most storage space; close to the dining hall but furthest away from the quad; cinderblock walls that can make hanging decorations difficult. (i apologize as i don't know the least about haygood lol)\n\n**jrc:** kitchen on bottom floor; very small workout room on bottom floor; large sink spaces in dorms; textured walls that can make hanging decorations difficult; no elevator. has the best location out of the dorms, but arguably the worst quality of all the dorms. \n\nstone and dowman are single-gender floor, co-ed buildings. dickey is for girls and bonnell is for guys. stone/dickey have 2 floors, dowman/bonnell have 3. each floor has 14 rooms. you could probably work out the numbers per building, but keep in mind that some rooms may be triples (depends on the year).\n\nidk if y'all have selected housing yet, but if not, protip: putting single-gender buildings will 100% land you in jrc, and putting inclusive will 100% land you in 2nd elizer. it's a coin toss for anything else you put, though.\n\nsorry for the wall of text! i just miss my time at oxford, haha. if you want any other specifics, feel free to hit me up with a chat or pm!",
      "author": "sunflower_sunshine",
      "created": 1619839870,
      "upvotes": 13,
      "replies": {}
    },
    "gwhsmkw": {
      "link": "/r/Emory/comments/n25jl9/oxford_housing/gwhsmkw/",
      "text": "Not sure on how many students live in each dorm, but the order of dorm building age (and therefore, in reverse, cleanliness/environment) is as such (oldest to newest): JRC>Haygood>Elizer&Murdy>Flemming",
      "author": "Meeshnoy",
      "created": 1619832057,
      "upvotes": 2,
      "replies": {}
    },
    "gwhzry6": {
      "link": "/r/Emory/comments/n25jl9/oxford_housing/gwhzry6/",
      "text": "Single gender and co ed has no difference other than personal reasons??? and the dorms are double with some triple exceptions. (possibility of singles but not to sure)",
      "author": "WaitAccomplished5974",
      "created": 1619835963,
      "upvotes": 2,
      "replies": {}
    }
  }
}