{
  "sid": "hwtxtw",
  "link": "/r/Emory/comments/hwtxtw/online_vs_oncampus/",
  "title:": "Online vs. On-campus",
  "text": "I know this question has been posed a few times, but I'm still wondering about how many freshmen (especially Oxford freshmen) are heading to campus. Does anyone have an estimate? \n\nAlso if you are going, what convinced you? I'm just unsure, given all the restrictions if it's still worth it.",
  "author": "looktothestars3",
  "created": 1595559506,
  "updated": 1634099284,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "fz2adl6": {
      "link": "/r/Emory/comments/hwtxtw/online_vs_oncampus/fz2adl6/",
      "text": "They said on the webinar that 85% of freshman will be going. I’m assuming it’s mainly international students that won’t be coming.\n\nI’m going because cost isn’t a huge issue to me and after watching the webinar I realized there’ll be *some* opportunities to socialize. They also said they’ll be trying to place people that are in the same residence hall into an in-person freshman seminar, which is nice.\n\nAnd someone correct me if I’m wrong, but I think they said people from Oxford will be going to the Atlanta campus for the fall term?",
      "author": "LostWindSpirit",
      "created": 1595569242,
      "upvotes": 7,
      "replies": {
        "fz2x5ff": {
          "link": "/r/Emory/comments/hwtxtw/online_vs_oncampus/fz2x5ff/",
          "text": "Oxford freshmen are still going to Oxford, not the Atlanta campus.",
          "author": "Electrical_Sort",
          "created": 1595590446,
          "upvotes": 3,
          "replies": {}
        },
        "fz43oft": {
          "link": "/r/Emory/comments/hwtxtw/online_vs_oncampus/fz43oft/",
          "text": "Thanks! I'm not sure how discovery seminars at Oxford will work because I applied to both online and in-person ones. I'd just hate to be stuck in my dorm for all my classes.",
          "author": "looktothestars3",
          "created": 1595613524,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fz2xxjo": {
      "link": "/r/Emory/comments/hwtxtw/online_vs_oncampus/fz2xxjo/",
      "text": "I’m going because I can’t imagine staying home for the next 4 months. I would prefer to sit inside a dorm than to stay here. Oxford still plans to host events and whatnot albeit socially distance so it won’t be too bad. We won’t literally be forced to stay in our dorm rooms 24/7. I would also like to get at least some form of the freshmen college experience even if there are a lot of restrictions. Honestly, if I were a higher risk group or didn’t mind learning from home I would probably stay. It ultimately comes down to what you are comfortable with safety wise.",
      "author": "Electrical_Sort",
      "created": 1595591080,
      "upvotes": 7,
      "replies": {
        "fz43txu": {
          "link": "/r/Emory/comments/hwtxtw/online_vs_oncampus/fz43txu/",
          "text": "Thank you! I'm wondering how spring semester will unfold because I might not mind staying at home for three months but I don't want it the entire year.",
          "author": "looktothestars3",
          "created": 1595613597,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}