{
  "sid": "l2wpty",
  "link": "/r/Emory/comments/l2wpty/thoughts_on_sophomores_taking_400_lvl_courses/",
  "title:": "Thoughts on sophomores taking 400 lvl courses",
  "text": "I got off the waitlist for Bio475 biology of the eye and was just wondering if the workload is going to be really bad.",
  "author": "ProfessionalBit4009",
  "created": 1611348613,
  "updated": 1634099268,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "gk8tptb": {
      "link": "/r/Emory/comments/l2wpty/thoughts_on_sophomores_taking_400_lvl_courses/gk8tptb/",
      "text": "I think that is usually a test based class in non-Covid times(maybe they adjust it for Covid)  Level (200, 300, 400) in bio does not correlate with workload. It mainly just correlates with how specialized the topic is.  The higher \"workload\" classes tend to be those that require an additional discussion section or classes more amenable to problem oriented learning like genetics.  A significant amount of such classes are really in the 2 and 300s.  400s tend to be just special topics and instructors can just run them however they want so it is hard to predict a \"workload\".  \n\nI think bio of the eye is supposed to be very interesting but expect content overload. Just memorize every damned thing. Think med or opt. school lite or like sort of thing. Generally the rule for any class in bio is that the required or recommended pre-reqs are accurate. Most classes can be easily accessible to those fresh out of intro. bio so if it says 142 as pre-req, you shouldn't have too much of a problem with it no matter your year.  There are some professors whose classes select for more motivated students (including those coming from stronger intro teachers) but generally I wouldn't worry unless it recommends more than 142.",
      "author": "oldeaglenewute2022",
      "created": 1611351732,
      "upvotes": 5,
      "replies": {}
    },
    "gk9c8rg": {
      "link": "/r/Emory/comments/l2wpty/thoughts_on_sophomores_taking_400_lvl_courses/gk9c8rg/",
      "text": "I’ve heard biology of the eye is the hardest bio class at Emory. Pretty sure there will be grad students taking it alongside you if you do choose to take it. Professors are really great, but I would think really hard about it if you actually want to take it.",
      "author": "IGoToEmowy",
      "created": 1611358652,
      "upvotes": 3,
      "replies": {
        "gk9en3m": {
          "link": "/r/Emory/comments/l2wpty/thoughts_on_sophomores_taking_400_lvl_courses/gk9en3m/",
          "text": "It really isn't for most I don't think (I think most who have taken a class with Antia, Eisen, Nemenman, and some others would describe those classes as tough in a more distinctive way).  It's kind of for the people who enjoy or at least do better in more memory oriented classes like human physiology, developmental biol, Animal behavior, or Comparative Vertebrate Anatomy before Starnes retired.  Most people find the research oriented/problem solving heavy classes much harder (perhaps because doing stuff like reading a textbook, discussing a primary research article, and maybe even doing problem sets every week is very time intensive. A lot of material to take in plus being demanded to learn how to apply it as well as having to self-teach yourself far more complex presentations and applications of material in the form of research papers can be a lot for some).\n\nAnd the question isn't more so whether graduate students take the course versus whether the course mirrors a grad. class (most Emory students are as good or better at memorization than graduate students who mostly came from less selective schools.  I would even argue that many junior/senior level undergrads at Emory may even be better in more research intensive courses than a first year grad. or med. student).  I would never worry about the rumors of what people claimed is hard/the hardest (or whether grad. students take it.  There are other bios that cross-list with grad. classes. And over in chemistry for example, it is not uncommon for undergrads to significantly out-perform graduate students in full-blown graduate courses, as in those not cross-listed) because you never know what they've taken prior to it (I'm sure some have taken a bunch of \"easier\" bio classes before it, or they could be a person who liked research focused bio classes and are trying a very heavy memory/content firehose elective class for the first time in a long time or the first time period.  Context and prior coursework always matters when receiving anecdotes)\n\n. Just assess if it interests you and fits the type of learning/testing you are already good at or want to become better at. If it fits or meets those goals, take it or at least give it a shot. I would never recommend being influenced by fearmongering among biology majors of all things (and I say this as someone who majored in it...don't trust us for info about \"difficulty\".  The range of pathways through the major is just too wide. Much wider than a NBB, chem major, etc) unless the class is math intensive and you don't have a legit math background.",
          "author": "oldeaglenewute2022",
          "created": 1611359661,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}