{
  "sid": "mn2spo",
  "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/",
  "title:": "I have to decide on a college tomorrow",
  "text": "so i was admitted to my state school and received enough scholarships for a full ride but the thing is my deadline to respond to them is tomorrow and my other top choice is emory. financially they’re pretty similar, but i’ve been wanting to have someone to reach out to that can speak ab their experiences, especially if you’re a first generation or low income student! pm me and i can send you my ig/email/whatever form of communication you prefer. thank you!",
  "author": "greenfluffyturtle",
  "created": 1617919644,
  "updated": 1634098574,
  "over_18": false,
  "upvotes": 14,
  "upvote_ratio": 0.94,
  "comments": {
    "gtvgwiz": {
      "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtvgwiz/",
      "text": "Tbh it’s almost a no-brainer. You’re going into a prestige oriented field where one school is a T20ish college and the other is a T70. Over that Emory has a renowned business school. Emory is much higher in the pecking order and in that field brand matters a lot. Not to mention the price is the same. The prestige, networking, quality of life, and opportunities would be much greater for no extra price. Even you prefer out of state. So I think the decision from a rational standpoint is pretty clear. If you want to work in high finance like banking/consulting then Emory is the move",
      "author": "Dazzling-Tax-3591",
      "created": 1617926660,
      "upvotes": 7,
      "replies": {
        "gtvj9ll": {
          "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtvj9ll/",
          "text": "I think the question is if the person wants to work harder to stand out/be competitive and maybe not have the social life of a stereotypical state school vs. maybe having to work less hard, standing out, and being near home and perhaps able to have a more \"American Pie\" or \"college movie\" experience. I basically agree with you but the allure for the latter is strong now-a-days and I kind of get it (It didn't have allure to me but American media has crafted this imagery around the college experience that neither Emory campus fits but so well).",
          "author": "oldeaglenewute2022",
          "created": 1617927884,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gtv5svm": {
      "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtv5svm/",
      "text": "What are you interested in majoring in?",
      "author": "premeddie19",
      "created": 1617921052,
      "upvotes": 3,
      "replies": {
        "gtvci1a": {
          "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtvci1a/",
          "text": "most likely business at this moment!",
          "author": "greenfluffyturtle",
          "created": 1617924379,
          "upvotes": 2,
          "replies": {
            "gtvfp3e": {
              "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtvfp3e/",
              "text": "Business is a broad field. Is there a specific type of job you want? If you're thinking banking or consulting, you'll have a hard time getting interviews at that state school. I'm sure it's still possible though. The path through Emory would be far more clear. \n\nIf you're planning to do like a f500 rotational program and work your way up the ladder, I'd take the state school",
              "author": "kingloogie79",
              "created": 1617926022,
              "upvotes": 1,
              "replies": {
                "gtvfzb1": {
                  "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtvfzb1/",
                  "text": "i don’t think banking is my vibe. ive been considering consulting but my state school has a bunch of connections as well with fortune 500 companies in their area (minneapolis) and they do recruit from my state school!",
                  "author": "greenfluffyturtle",
                  "created": 1617926173,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gtv6ugk": {
      "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtv6ugk/",
      "text": "What state school? Congrats on getting in!",
      "author": "crusheratl",
      "created": 1617921557,
      "upvotes": 2,
      "replies": {
        "gtvckli": {
          "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtvckli/",
          "text": "thank you! the university of minnesota twin cities :) i like it there but i’ve always wanted to go oos",
          "author": "greenfluffyturtle",
          "created": 1617924415,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gtva7vw": {
      "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtva7vw/",
      "text": "pm me",
      "author": "ELON_MUSK_69420_",
      "created": 1617923228,
      "upvotes": 1,
      "replies": {}
    },
    "gtvpvsj": {
      "link": "/r/Emory/comments/mn2spo/i_have_to_decide_on_a_college_tomorrow/gtvpvsj/",
      "text": "OMG bro I’m from mn and got a full ride to the U. I’m so first gen and low income so it’s been a struggle Bc Emory is so different from UMN. I’ll PM u",
      "author": "Bubbly-Vanilla-6711",
      "created": 1617931306,
      "upvotes": 1,
      "replies": {}
    }
  }
}