{
  "sid": "86v9f4",
  "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/",
  "title:": "Thinking of returning, but not sure about the major I have in mind. Any advice?",
  "text": "I left Emory two years ago, but now I'm thinking of returning.  I remember enjoying my time at Emory but I had some personal issues I needed to deal with.  Anyway now I intend to return to school to major in CS and become a software engineer, but I've heard different things about the CS department at Emory.  What do you guys think?  ",
  "author": null,
  "created": 1521918968,
  "updated": 1634099380,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "dw83p9t": {
      "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dw83p9t/",
      "text": "I think you should finish where you started. Emory CS is decent and places well.",
      "author": "91210toATL",
      "created": 1521920550,
      "upvotes": 5,
      "replies": {}
    },
    "dw99iyn": {
      "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dw99iyn/",
      "text": "Emory CS differentiates itself from other schools by offering a liberal arts education. This may be pretty obvious (as Emory brands itself as a liberal arts school), but the implications aren’t always as obvious. \n\nLet’s compare Emory’s CS program to GT’s. At Emory, you’ll spend less time in CS classes. There are fewer classes in the CS curriculum here. Emory’s CS program also isn’t top-10. That said, you’ll graduate as a much more rounded student. You won’t have the deepest knowledge of CS, but you will have taken many classes outside your major. I’ve, for example, taken a lot of physics and Econ classes that fascinate me. I believe that makes me a more rounded and competitive candidate. \n\nIt’s a big decision you’ll have to make - do you want to be a specialist (go to GT and get a deep CS education) or a more diverse and rounded graduate (Emory and take lots of non-CS classes). \n\n\n\nSource: I’m currently at Emory, will graduate with a BS in comp sci. I’ve got friends in CS at GT",
      "author": "Eat_Dinosaur",
      "created": 1521984205,
      "upvotes": 4,
      "replies": {
        "dwlrp88": {
          "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dwlrp88/",
          "text": "How would employers of engineers view a graduate from, say, USC with a degree in engineering vs a grad from Emory/GT who majored in Math/CS at Emory and engineering at GT? I'm a prospective student looking to study engineering",
          "author": "batteredalmond",
          "created": 1522541984,
          "upvotes": 2,
          "replies": {
            "dwn8679": {
              "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dwn8679/",
              "text": "What kind of engineering position are you thinking about?\n\nI can speak to software engineering – other types I don't know much about.\n\nWithin software engineering, let's look at the big four (Google, Apple, Amazon, Microsoft). They hire from both liberal arts schools and technical schools - you really just need to impress them with your GPA and outside programming projects. Where the liberal arts / technical differences appear, I believe, is further into your career. While I don't have data to support this, I see liberal arts-minded programmers as better leaders. They're better equipped to handle Product Manager positions with their diverse education.\n\nJust my two cents - definitely post on USC and GT subreddits to get their inputs.",
              "author": "Eat_Dinosaur",
              "created": 1522617660,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "dw8s20h": {
      "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dw8s20h/",
      "text": "CS at Tech is much more worth it. Although the stress levels there are through the roof.",
      "author": "Worldlover67",
      "created": 1521949492,
      "upvotes": 3,
      "replies": {
        "dw8u1fh": {
          "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dw8u1fh/",
          "text": "Hypothetically speaking, if transferring to a CS school doesn't work well, are there other majors that place well and that Emory is good for?\n\nI'm ok with the CS department being small as long as I get to design stuff and code for a living.  I don't really need to work at a super prestigious company.  But it seems like people say that Emory is good for most majors overall, except with CS I hear a lot of different things.\n\nIf the truth leans more towards the negative, though, I'm ok with looking for another thing to do.",
          "author": null,
          "created": 1521952237,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "dw966my": {
      "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dw966my/",
      "text": "Well if you aren’t looking to work for google or amazon etc., Emory CS is fine. The creative writing program is really good (but that’s very different from CS). I don’t really know what you interests are. Is there any major you were considering? And honestly, it’s the connections that emory has that is the valuable part",
      "author": "Worldlover67",
      "created": 1521977886,
      "upvotes": 2,
      "replies": {
        "dwa7aq9": {
          "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dwa7aq9/",
          "text": "I initially wanted to double major in classics and English.  I also like film history a lot.  One of the reasons I want to go back (not a main, pivotal reason don't worry) is to regain casual access to the libraries again and read all the great books that my local public libraries just don't have (same goes for local college libraries,).while learning a discipline i can enjoy and make a living at.\n\nI've heard of the creative writing program.   While writing fiction is something I'd like to excel at one day... people have hinted to me that I'm not very good at it so I probably should focus on other things for now heh heh.  But still I'd like to take a shot at it!\n\n\nSo basically, I'm interested in literature and film.  \nI partially want to learn programming so I can design games too, but that's like a side goal.\n",
          "author": null,
          "created": 1522022256,
          "upvotes": 1,
          "replies": {
            "dwaemtc": {
              "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dwaemtc/",
              "text": "There's actually an animation portion of the film major that you might want to consider. You could combine your love of fiction and programming into animation. However, I don't really know how good it is. \n\nHave you considered computer linguistics? Might be something to look into as well.",
              "author": "Worldlover67",
              "created": 1522030602,
              "upvotes": 2,
              "replies": {
                "dwafb4d": {
                  "link": "/r/Emory/comments/86v9f4/thinking_of_returning_but_not_sure_about_the/dwafb4d/",
                  "text": "Definitely will!  Thank you for all your suggestions!",
                  "author": null,
                  "created": 1522031379,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}