{
  "sid": "mgvvka",
  "link": "/r/Emory/comments/mgvvka/polisci_seniors_and_alumni_are_you_where_you_want/",
  "title:": "Polisci seniors and alumni, are you where you want to be in life?",
  "text": "Hi! I’m a member of the class of 2025, and I’m interested in studying political science. I’d love to hear from current seniors and alumni who chose to major in polisci. Seniors, what are your job/grad school prospects? Graduates, have you met your career goals? Do you regret studying polisci at Emory? Thanks :)",
  "author": "screamingviking13",
  "created": 1617156917,
  "updated": 1634098645,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "gsvppil": {
      "link": "/r/Emory/comments/mgvvka/polisci_seniors_and_alumni_are_you_where_you_want/gsvppil/",
      "text": "Class of 2020 polisci grad! No regrets for studying polisci (although I did double major in another department). Covid definitely shook things up but I ended up getting multiple job offers in my desired field (nonprofit/partisan organizing) within a month of graduating. As with any major, getting job experience through internships/part-timejobs/volunteering is probably more important than the specifics of your coursework. I'd recommend emory's polisci department without reservation and there is a strong alumni network!",
      "author": "FlowersBloomUntil",
      "created": 1617163893,
      "upvotes": 7,
      "replies": {
        "gsvs0qc": {
          "link": "/r/Emory/comments/mgvvka/polisci_seniors_and_alumni_are_you_where_you_want/gsvs0qc/",
          "text": "That’s great to hear! Thank you",
          "author": "screamingviking13",
          "created": 1617165492,
          "upvotes": 3,
          "replies": {}
        },
        "gsw6vki": {
          "link": "/r/Emory/comments/mgvvka/polisci_seniors_and_alumni_are_you_where_you_want/gsw6vki/",
          "text": "if you don't mind me asking, how typical was that kind of outcome for polisci grads in your cohort? did a lot of people end up without prospects post-graduation or did most have some kind of work in the field or further studies available to them?",
          "author": "largeplatterofbeef",
          "created": 1617177031,
          "upvotes": 2,
          "replies": {
            "gswyefg": {
              "link": "/r/Emory/comments/mgvvka/polisci_seniors_and_alumni_are_you_where_you_want/gswyefg/",
              "text": "PoliSci is one of emory largest department in terms of how many majors it graduates a year so I definitely didn't know all the folks in my cohort. \n\nMy speculative assessment: I had the sense that there were 2 rough divisions among majors: those who were majoring in PoliSci because they loved the subject or found it best suited to their career path and those who were in this department because they couldn't cut it / found the classes too demanding in Econ or B-School. The folks I knew in the department fell into the first category and took their coursework seriously, gave it their best effort, and earned very good marks. The most common graduation results among those I knew were: beginning law school, beginning a related masters degree, entry-level jobs on capitol hill and campaigns, and entry level corporate jobs.",
              "author": "FlowersBloomUntil",
              "created": 1617199040,
              "upvotes": 5,
              "replies": {
                "gsx0qdj": {
                  "link": "/r/Emory/comments/mgvvka/polisci_seniors_and_alumni_are_you_where_you_want/gsx0qdj/",
                  "text": "This is totally random but do you think QTM is reshaping what those two camps look like or the distribution in each? I know QTM was largely led by members of political science (and lots of the electives reflect it) and I wonder if it is reshaping the cohort to have more people in the 1st category over time.  I just imagine a significant amount of QSS majors are Polsci concentrators and I imagine it'll slowly reshape career outcomes (I am sure a lot of BBA and econ people can't hack any full fledge QSS major like PPA or the concentrations so that flips things on its head).",
                  "author": "oldeaglenewute2022",
                  "created": 1617200222,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}