{
  "sid": "glp6ty",
  "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/",
  "title:": "Emory honor council/accused of cheating",
  "text": "I recently got an email a few days ago that they suspect I was cheating. I was absolutely not cheating and was wondering if anyone had any experience with the honor council and what is expected of me during the honor council meetings.",
  "author": "Crafty-Truck",
  "created": 1589755523,
  "updated": 1634098704,
  "over_18": false,
  "upvotes": 23,
  "upvote_ratio": 0.97,
  "comments": {
    "fqyzge5": {
      "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqyzge5/",
      "text": "If someone cheated off of you then you both get an F.  Happened to a friend of mine.",
      "author": "crusheratl",
      "created": 1589757211,
      "upvotes": 13,
      "replies": {
        "fqyzsq9": {
          "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqyzsq9/",
          "text": "They're saying that I had unusual canvas log activity. Do you/your friend know what the honor council process is like? Do I have a fair ability to argue against them or is it pretty much a kangaroo court?",
          "author": "Crafty-Truck",
          "created": 1589757379,
          "upvotes": 8,
          "replies": {
            "fqz0wxy": {
              "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqz0wxy/",
              "text": "My friend said he didn't have a chance because the professor saw the other student cheat off of him. Stating that he was an innocent victim didn't help. But try and anticipate what they will say and have your explanations ready for their consideration. Argue that there was no bad faith or guilt on your part.",
              "author": "crusheratl",
              "created": 1589757934,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fqz2b52": {
      "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqz2b52/",
      "text": "Hey yes! Ive had experience with this. I am a graduate student please feel free to DM me for info. \n\nBasically, someone leaked exam questions on a forum sent to my entire cohort. None of us \"chose\" to cheat because usually this groupme chat is just for the whole group to keep in touch with one another. I admitted to using the questions to help study. There was a trial and it was a very fair process. They will not convict you of anything if they dont have evidence. I basically told them, hey, there was this leaked question, I made a flashcard to study this question, I acknowledge that this gave me an unfair advantage. They were very understanding and gave us all a warning. Just be honest and nothing bad will happen. Emory is pretty awesome at this please dont worry",
      "author": "alittlelurker",
      "created": 1589758643,
      "upvotes": 7,
      "replies": {
        "fqz36n7": {
          "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqz36n7/",
          "text": "Thanks for your response! I'm sure this will be cleared up but I can't help but feel a little worried. Thanks again!",
          "author": "Crafty-Truck",
          "created": 1589759096,
          "upvotes": 5,
          "replies": {
            "fqztv8k": {
              "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqztv8k/",
              "text": "I absolutely understand. I was so terrified I broke down crying during the trial haha. It's scary. I really admire and respect Emory for upholding the honour code though. It speaks to the integrity of the education. They aren't heartless though. Like someone else said, they are probably flagging a lot of questionable activity RN due to online finals. Just be honest and clear. Don't admit to anything you havent done to expedite the process. Just know youre not alone. Feel free to reach out to myself or an ombuds person too.",
              "author": "alittlelurker",
              "created": 1589775265,
              "upvotes": 3,
              "replies": {}
            },
            "fqzhn5v": {
              "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqzhn5v/",
              "text": "Don’t get worried my guy, get pissed. This is an affront to your character and that won’t stand. Fight for yourself because no one else will.",
              "author": "DBS786",
              "created": 1589767574,
              "upvotes": 2,
              "replies": {
                "fqzkrrx": {
                  "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqzkrrx/",
                  "text": "Absolutely, I will fight tooth and nail during my review",
                  "author": "Crafty-Truck",
                  "created": 1589769463,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fqzili5": {
      "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqzili5/",
      "text": "I was on honor council at emory and would be happy to answer any questions I can, feel free to DM me. I did graduate a little while ago though ( 2012). When I was on HC emory wasn't on canvas, we were on an older program called learnlink and would sometimes use a program called blackboard so I may not be able to help that much.",
      "author": "mromane1",
      "created": 1589768154,
      "upvotes": 7,
      "replies": {
        "fr0ntyv": {
          "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fr0ntyv/",
          "text": "Office365 replaced LearnLink (email and calendar only. Not conferences. Those just died.)\n\nCanvas replaced Blackboard",
          "author": "kabniel",
          "created": 1589801895,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fqzhbw9": {
      "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqzhbw9/",
      "text": "Here’s the thing with Canvas logs. They are able to monitor when you answer questions and how quickly as well, and here’s where they get a lot of people, when you leave the window/change windows. So the information they have is limited. With that in mind you can probably make a good case for your innocence. There’s a shit ton of cases going on rn to the point where they’ve been sending emails saying if you confess they’ll expedite your case which tbh sounds like some Bull Shit so they don’t have to work as hard. If you’re innocent I would run that shit and make them work for it. The honor council and some of these professors are honestly going off for the smallest things. Trust the process a little but trust yourself and your story more. Don’t let them ruin your credibility and your chance at future graduate/professional schools just because they can’t understand that during a time of world wide crisis they should create a system that doesn’t screw over its students but allows them to reach their goals within the bounds of their circumstances. It’s a product of ridiculous privilege at an institution full of ridiculous privilege.\n\nThanks for coming to my ted talk",
      "author": "DBS786",
      "created": 1589767384,
      "upvotes": 6,
      "replies": {
        "fqzl03v": {
          "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqzl03v/",
          "text": "It is completely ridiculous 100%. Some of my friends told me they know a lot of people who got honor council notices, I'm guessing my prof isn't very trusting and is sending us all to the honor council as a spray and pray",
          "author": "Crafty-Truck",
          "created": 1589769593,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fqz2fpz": {
      "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqz2fpz/",
      "text": "Unusual canvas activity is hard to prove. DM me.",
      "author": "91210toATL",
      "created": 1589758707,
      "upvotes": 2,
      "replies": {
        "fqz2ziy": {
          "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqz2ziy/",
          "text": "Hi there! Any advice/knowledge would be greatly appreciated. I definitely used canvas to study... But as far as I can remember (because the test happened so long ago) I definitely didn't cheat or use canvas to help me. I'm not dumb enough to use canvas regardless because I know they track canvas activity.",
          "author": "Crafty-Truck",
          "created": 1589758993,
          "upvotes": 1,
          "replies": {
            "fqz6orf": {
              "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqz6orf/",
              "text": "Isn't Canvas what you use to access your online course content? What's \"unusual Canvas activity anyways then?\"",
              "author": "Dr_Yankee",
              "created": 1589761005,
              "upvotes": 3,
              "replies": {
                "fqzfefu": {
                  "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fqzfefu/",
                  "text": "Yup and congrats on your acceptance! I might've hit backspace or had another tab open and they thought I was cheating. Unusual Canvas activity I'm assuming is they thought that I was clicking around on class materials/PowerPoints while taking the test which would give me an unfair advantage.",
                  "author": "Crafty-Truck",
                  "created": 1589766222,
                  "upvotes": 3,
                  "replies": {}
                },
                "fr1iu44": {
                  "link": "/r/Emory/comments/glp6ty/emory_honor_councilaccused_of_cheating/fr1iu44/",
                  "text": "A lot of exams are done via Canvas. The settings are variable, but Canvas *does* track how long you spend on a question and what other tabs you have open. So if a student spends 30 seconds on a question that most people spend half an hour on, that's a big red flag.",
                  "author": "phraps",
                  "created": 1589820478,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}