{
  "sid": "ehdvnq",
  "link": "/r/Emory/comments/ehdvnq/span_201_or_fren_101/",
  "title:": "SPAN 201 or FREN 101",
  "text": "Hello you beautiful people. \n\nI was wondering whether it would be better to take an introductory course in a language I have never taken before or take SPAN 201 after four years of Spanish in high school. Of course, I took the language placement test for Spanish in order to gain acceptance into SPAN 201. However, I've heard rumors of intermediate Spanish courses at Emory being difficult and thought it would be better to decrease my workload a bit by taking a less demanding introductory language class which I hope would be easier than SPAN 201 despite having no prior knowledge in the language.",
  "author": "Perfectly_Uneven",
  "created": 1577664178,
  "updated": 1634099252,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "fcilf3a": {
      "link": "/r/Emory/comments/ehdvnq/span_201_or_fren_101/fcilf3a/",
      "text": "I just took span 201 this past semester. If you have a solid foundation of spanish (which u probably do after 4 years) then it is not bad at all. Pm if u have specific questions",
      "author": "Pr1scus",
      "created": 1577664530,
      "upvotes": 6,
      "replies": {}
    },
    "fcio88y": {
      "link": "/r/Emory/comments/ehdvnq/span_201_or_fren_101/fcio88y/",
      "text": "I took Spanish throughout high school but decided to take a completely new language at Emory. I loved my new language. It was interesting and not very hard. Granted, I have no idea how much work introductory French is, so you might want to check up on ratemyprofessors.com.\n\nMy friend was in Spanish 201, and it seemed like his class wasn't too hard, but it was more work than mine.",
      "author": "boat-",
      "created": 1577665972,
      "upvotes": 3,
      "replies": {}
    },
    "fciocbi": {
      "link": "/r/Emory/comments/ehdvnq/span_201_or_fren_101/fciocbi/",
      "text": "French people are hotter so the choice is obvious",
      "author": "Skytram_",
      "created": 1577666037,
      "upvotes": -3,
      "replies": {}
    }
  }
}