{
  "sid": "i24n41",
  "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/",
  "title:": "is anyone else maddened by the fact that we are forced to sign a tuition agreement to access our opus accounts?",
  "text": "Is anyone else as fucking livid as I am about how shady the school is being with tuition? I'm in the nursing program and I just can't believe how shitty online instruction has been and how insane it is to be paying 23k/semester for this.",
  "author": "wallebouncer",
  "created": 1596335285,
  "updated": 1634098682,
  "over_18": false,
  "upvotes": 31,
  "upvote_ratio": 0.91,
  "comments": {
    "g01t1gy": {
      "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/g01t1gy/",
      "text": "On July 17, Emory announced that they will be holding tuition to 2019-20 rates for undergrads—a $2130 reduction in tuition. A few days later, the financial aid office sent out an announcement that they will be reassessing financial aid awards. They took my existing package and simply decreased the grant aid by ~$2400; I saved a copy of my old award to compare because I knew they were gonna pull this shit. I was not at all surprised when they made us opt in to the tuition agreement for access to OPUS.\n\nI’m glad I’m going into my final year at Emory.",
      "author": "tjcc99",
      "created": 1596336882,
      "upvotes": 30,
      "replies": {
        "g02kv6i": {
          "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/g02kv6i/",
          "text": "I screenshotted my older tuition, too, so I can compare aid. I also lost around that much. I'm lucky enough that the GI Bill covers one semester for private schools so this was a minor adjustment, but I can imagine how this would affect those who rely solely on this aid.\n\nI'm gonna go off-topic here but this is from someone coming from an online school. I paid $250/unit to attend that school while I was working full-time and I was receiving about the same instruction or even better than Spring 2020. Sure, sure, they were \"unprepared\" and now they are \"prepared.\" But it's gonna be the same thing. You can't prevent people from cheating and the best way to do it is just do open notes. Virtually eliminates honor code violations and you can be more creative with exams while fostering discussions with peers.\n\nZoom is also a horrid platform to teach on. If only Discord was marketed less toward gamers; it has way more features, higher quality video calls, and way less security issues. You make a server per class section and upload files there with as much privacy as you need (alongside Canvas submissions, of course). The hardest part is moderating/verifying who actual students are but with private invitations and strict class/server sizes you can at least nickname students with their real names as a professor. You can't really do that with Zoom as it has the same problem. Oh well. Rant over, sorry.",
          "author": "FearlessMelly",
          "created": 1596357773,
          "upvotes": 7,
          "replies": {}
        },
        "g03xld5": {
          "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/g03xld5/",
          "text": "I still haven’t gotten an email about my new aid package and my OPUS isn’t showing any updates either :(",
          "author": "kissingfish",
          "created": 1596382084,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g047p49": {
      "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/g047p49/",
      "text": "a lot of schools are doing this. covering their bases so they can fuck you over with no repercussions. oh well. i signed the agreement anyway so ig i should just prepare to be fucked.",
      "author": "jsh_",
      "created": 1596386207,
      "upvotes": 4,
      "replies": {}
    },
    "g04s8l0": {
      "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/g04s8l0/",
      "text": "[deleted]",
      "author": null,
      "created": 1596395884,
      "upvotes": 2,
      "replies": {
        "g05fmv2": {
          "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/g05fmv2/",
          "text": "Also a nursing student and I guarantee you this is intentional. We can’t see our final grades without agreeing to this no-refund thing. That’s shady.",
          "author": "Natural_System",
          "created": 1596408174,
          "upvotes": 1,
          "replies": {
            "g05kjmj": {
              "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/g05kjmj/",
              "text": "[deleted]",
              "author": null,
              "created": 1596410984,
              "upvotes": 1,
              "replies": {
                "g07edvl": {
                  "link": "/r/Emory/comments/i24n41/is_anyone_else_maddened_by_the_fact_that_we_are/g07edvl/",
                  "text": "That might be part of it? But really I think it’s to goad students into accepting their terms without argument. \n\nFor us nursing students who are finishing summer semester today, our final grades will be released this upcoming week. But we won’t be able to see them unless we say we’re okay with Emory taking all our money no matter what happens Fall semester. That means they could cancel classes, move in-person classes to online, really - whatever they want - and we can’t complain or get any kind of refund.\n\nSpecifically for nursing students, I worry it means that even if those who are supposed to graduate in December are unable to be placed in clinical and graduate, they’ll still charge full price to attend and then make them extend the program and pay even more later on. \n\nI can’t even get in to pay for Fall semester without first agreeing that Emory gets to keep all the money, even if they end up screwing everyone over. I’m hoping for the best, but doing virtual clinicals for the past two semesters has been... not ideal. They promised in-person clinical but haven’t placed us yet and won’t until a few days before the semester starts. I’ll have to hit Agree on OPUS before then to make my schedule is set to graduate. It’s shady.",
                  "author": "Natural_System",
                  "created": 1596461474,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}