{
  "sid": "nxngb2",
  "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/",
  "title:": "Freshman class schedule advise",
  "text": "Hello everyone!\n\nCould you give me some feedback on this possible schedule for my fall semester as an incoming freshman? I am not sure what I want to major in but I am thinking of either Neuroscience, Economics or Computer Science. However, I would also like to try out other areas (eg. film). I have IB credits for BIOL 141 and ECON 101. I was also thinking of adding another class (CS 170) to my schedule as I already took two introductory CS classes at a summer session at another college for a total of 9 credits. However, I am concerned about the negative reviews of CS 170 with Davide Fossati and that the workload might be too much for my first semester.\n\nThank you!\n\nhttps://preview.redd.it/yfhy70bnoo471.png?width=980&format=png&auto=webp&s=aa421c5b43468f3e02ace6b4dcabfb9350e585ab",
  "author": "SnooFloofs2705",
  "created": 1623437887,
  "updated": 1634097968,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "h1md1ck": {
      "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1md1ck/",
      "text": "Hey I'm also a freshman, how do you create a possible schedule online?",
      "author": "or_am_I_dancer",
      "created": 1623591587,
      "upvotes": 5,
      "replies": {}
    },
    "h1frwzp": {
      "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1frwzp/",
      "text": "As long as you aren't thinking a track like pre-med  or pre-law where you need to over-protect GPA, you could probably easily afford to take an intensive course like either chem 150(or whatever your AP credit allows for that would help progress towards NBB) or CS 170 and still end up with a pretty balanced schedule. I mean a less balanced schedule would be if you had both bio lecture and lab and then wanted to do CS 170 or a chemistry class with its lab and if you are considering NBB or CS you should at least be able to handle that (especially since you have AP credits in key STEM areas), and should definitely be able to handle an additional STEM lecture/lab combo with the current schedule(you supposedly have programming experience from wherever so it may entail an advantage anyway. Class will still be \"busy\" but the psets and quizzes may come easy. Also, I thought Fosatti had solid reviews.  I think the main complaint is that the class is more challenging than people anticipated but that is common with intro. STEMs, especially at selective universities.  You get some with no experience who believe the course should be easier and you get some with and without who thinks its fine if you do the work. Intros have a lot of variance in exposure levels and the best the instructor can do is make it \"fair\" but hard enough to prep majors for what they'll need to deal with in future courses. Having consistently positive reviews is not common unless the teacher is absolutely phenomenal when challenging OR is decent/solid and easy for most students so you have to be careful with RMP).\n\n You're gonna work hard regardless but these combos shouldn't eradicate your social life or make doing well impossible in your first semester. Just go in expecting a challenge in key courses, don't expect it to feel like HS, and have realistic expectations vs. how you are willing to study (or learn to study). If you really wanna play it safe, just throw some econ. Intro in there. But don't conflate \"should not overdo it freshman year to adjust\" with \"1st semester must be super easy to make a 4.0 with\". Most people will disagree with me but I think there is some value in having like a medium rigor schedule(especially if going into STEM or something quantitative like econ) to learn to manage time and build study skills that are useful in later semesters where you may take heavier courseloads with courses that have more complex cognitive demands than intro. \ncourses.\n\n Employers and graduate schools (including the GPA whore professional schools) value the upward trend and while it is helpful to have confidence that you can do well at Emory from a good early performance, it shouldn't be faux confidence built on conditions that won't last and that confidence shouldn't only come if you put up a perfect performance. Some individual courses are designed to make that less likely for everyone anyway.\n\nNote that with your interests, you may also wanna eventually think of ways of combining them (like comp. Neuro research and courses or QSS neuro, QSS econ, or various other things) and how different courses may help you do that.",
      "author": "oldeaglenewute2022",
      "created": 1623439547,
      "upvotes": 3,
      "replies": {}
    },
    "h1gqru9": {
      "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1gqru9/",
      "text": "I agree that adding chem 150 would be doable. \nI found Math 111 personally rigorous even after taking Calculus I in high school. The professor ended up curving grades at the end. \n\nThe final had a C+ average but I still ended up an A. I just wouldn’t underestimate the class if you’re weak at math. Otherwise, you’ll be ok. A lot of students complained throughout the semester about difficulty (but at the same time a lot of people coasted by fine).\n\nJust make sure to review each lecture afterwards and practice because there are quizzes every week.",
      "author": "spencerpw085",
      "created": 1623456986,
      "upvotes": 3,
      "replies": {
        "h1gswer": {
          "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1gswer/",
          "text": "Curious, was a C average unusual before the final.  That just sounds like such a common average(anything between 75 and 80 unless your teacher is a complete joke and isn't trying at all to see whether a decent chunk of students can handle higher level items) for a STEM test, whether it be final or midterm.  Where the midterms lower? Or was there some bi-modal stuff going on where some were coasting and others were struggling and that is how the tests still had relatively high averages or something?",
          "author": "oldeaglenewute2022",
          "created": 1623458178,
          "upvotes": 1,
          "replies": {
            "h1gvuru": {
              "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1gvuru/",
              "text": "the midterms were about the same. i definitely think it was bi-modal based off the people i talked to in the class. the class GroupMe was outraged after every exam because they were “too difficult” but I personally (and my friends) thought they were fine. just made me sweat a little sometimes\n\ni noticed similar behavior in my bio lecture as well. i just think the students that do poorly tend to be more outspoken",
              "author": "spencerpw085",
              "created": 1623459876,
              "upvotes": 1,
              "replies": {
                "h1gwjs0": {
                  "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1gwjs0/",
                  "text": "Was this this past cycle during Covid? I just get the feeling that many people were EXPECTING many STEM exams to be easier than normal which kind of was actually the case in things like chem and bio for the most part.  I also think things like calculus also suffer from the expectations game where people expect straight forward sort of algebra/plug and chug type problems that they were assigned for practice but with different numbers and maybe to be asked some definitions or terminology based stuff and then at Emory(I hear there is standardization now and that grad students or post-docs can't just write joke tests if they are bad teachers. Some actual faculty are pulling strings it seems) they get more applied problems and things that test conceptual/theoretical understanding in a deeper way than expected.  \n\nIt's like when biology tests go beyond requiring recall (whether it be specific facts students learned or specific problem types they were taught to do).  For some reason no one really expects any of this from chemistry or physics exams and people sort of just shrug their shoulders when a test has a 60s-70s average. I have ideas on why but still don't fully understand it. It is weird that students still expect calculus and CS at a selective school known for STEM education to be easy.",
                  "author": "oldeaglenewute2022",
                  "created": 1623460275,
                  "upvotes": 1,
                  "replies": {
                    "h1gx32p": {
                      "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1gx32p/",
                      "text": "i took it this spring semester. the exams often had problems that required more than just basic knowledge of a concept, and i think many students went into the class with the weird expectation that it would be easy since it’s “just” Calc 1.",
                      "author": "spencerpw085",
                      "created": 1623460586,
                      "upvotes": 1,
                      "replies": {
                        "h1gxc8r": {
                          "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1gxc8r/",
                          "text": "Lol that's always funny:\"I'll just assume the rumors about gateway STEM courses being hard at elite universities is untrue and press my luck until I take the 1st test\".  Haha",
                          "author": "oldeaglenewute2022",
                          "created": 1623460733,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h1gonj4": {
      "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1gonj4/",
      "text": "freshman seminars should not be that difficult, as well as film 101. I don't know what ECS 101 is. HLTH is an easy class as well. This leaves Biol and math 111, which should be doable. In my personal experience, as someone who did not take bio and chem at the same time, I would also take chem 150 because you move with all your classmates together throughout the years. In my opinion, you should add another class, but its completely up to you :) I think you would find yourself with a lot of free time if you keep this current schedule as it is.",
      "author": "Korean_Yezus420",
      "created": 1623455814,
      "upvotes": 1,
      "replies": {
        "h1gu79i": {
          "link": "/r/Emory/comments/nxngb2/freshman_class_schedule_advise/h1gu79i/",
          "text": "ECS is pace.",
          "author": "LostWindSpirit",
          "created": 1623458918,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}