{
  "sid": "ntdyl6",
  "link": "/r/Emory/comments/ntdyl6/please_help_advice_needed/",
  "title:": "Please Help - Advice Needed",
  "text": "Hey! I'm a rising sophomore planning for courses for the Fall. I am quite undecided and am confused about what to do with my life (and thus, my college major also). \n\nGoizueta seems sort of appealing. I can see myself do Strategic/Management/Analytical Consulting or Finance or ISOM or something like that. However, the one thing I am worried about is the BS. \n\nWhen I met some of the Goizueta people last year over zoom, it seemed like they were insanely fake try-hards who used the word \"network\" way too many times. I can't stand that sort of BS because it just puts me offa lot, and so, want to ask, is that how all of the BBA/Business culture is, at both Emory and beyond? Is there any way I can not be like that, and still be successful in the business culture at Emory and beyond? \n\nThank you for your help! I hope I don't come off as a snob - everyone's different and I'm just trying to figure out if I'll fit into what I may need to fit into if I go down that route. I appreciate the guidance!",
  "author": "bruhadiucal",
  "created": 1622955375,
  "updated": 1634097997,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.95,
  "comments": {
    "h0szhug": {
      "link": "/r/Emory/comments/ntdyl6/please_help_advice_needed/h0szhug/",
      "text": "I don’t consider networking “BS” but honestly if you hate the idea of it that much, Goizueta is not for you. Networking is 90% of the game until you have a full-time job offer SIGNED, and even then you should keep it up. Once you’re working you won’t have to do it as much but everyone has to do the networking, the LinkedIn stalking, the coffee chats, etc. There’s a lot of genuine alumni and employers who want to help you out, though. It’s only as BS as you make it.\n\nSome of the other students did drive me crazy too but most of them are nice, though pretty competitive.",
      "author": "beachkati",
      "created": 1622994323,
      "upvotes": 6,
      "replies": {
        "h0t21ra": {
          "link": "/r/Emory/comments/ntdyl6/please_help_advice_needed/h0t21ra/",
          "text": "Thanks for replying! I still know very little about what Goizueta entails, admittedly, so I don't want to completely write it off because it seems like there's a lot of different things I could do with a degree from there. But what you say makes sense - networking is essential for landing jobs. I hope it's not as superficial as I assume it is - I hope I'm wrong. Thanks for your advice, though, it helps!",
          "author": "bruhadiucal",
          "created": 1622995590,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  }
}