{
  "sid": "p0o3py",
  "link": "/r/Emory/comments/p0o3py/arabic_or_russian/",
  "title:": "Arabic or Russian?",
  "text": "Just another freshman scrambling the day before registration. I’m considering studying Arabic or Russian at Emory. Can anyone shed some light on the quality of the departments relative to each other? Thanks!",
  "author": "screamingviking13",
  "created": 1628460412,
  "updated": 1634097364,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "h88nlj4": {
      "link": "/r/Emory/comments/p0o3py/arabic_or_russian/h88nlj4/",
      "text": "I'll be taking arabic next year. I've heard it's pretty tedious in its workload. there's homework every day, and it takes a while to do. if you know some arabic prior, it will help. idk about the russian department.",
      "author": "Impossible-Main-4847",
      "created": 1628475183,
      "upvotes": 2,
      "replies": {
        "h88o0tl": {
          "link": "/r/Emory/comments/p0o3py/arabic_or_russian/h88o0tl/",
          "text": "Oof, good to know. Can I ask why you’re taking Arabic if you’ve heard it’s tedious?",
          "author": "screamingviking13",
          "created": 1628475413,
          "upvotes": 1,
          "replies": {
            "h88sg1o": {
              "link": "/r/Emory/comments/p0o3py/arabic_or_russian/h88sg1o/",
              "text": "I kind of wanna know the answer too, but admittedly a lot of people who aren't continuing a language out of k-12 or studying their native language just choose based upon interest (and things like Russian and Arabic do have increased relevance given the current foreign policy interests in the U.S.) and just deal with whatever intensity that comes. And a lot of the intro language courses are tedious because they are trying to be as immersive as possible for a beginner course to leave people with a solid foundation or a little something they can be functional with. \n\n But I think you'll find that a lot of the more rigorous courses in areas you really wanna learn (and you have many languages to choose from) are rigorous in a meaningful way that makes sure you actually retain material or walk away with lasting skills.  I know a lot of HS classes that were rigorous achieved it through assigning a lot of busywork whose purpose (in terms of learning goals) wasn't as clear except maybe coaching for a very specific exam or something.   \n\nOften college style rigor is different and has more meaning so don't let a language class being known for being tedious be a deterrent.  Just be sure you choose a language (or whatever other course) you are willing to do  good bit of ⁵work in it.  It honestly seems like those who continue a language and place at least in the 200s are likely to have a lower work load than those in 100s because they don't have to teach a language from scratch while also adding context where possible. No need for frequent drill like assignments and constant quizzing to check up on people's progress.",
              "author": "oldeaglenewute2022",
              "created": 1628477833,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "h88q507": {
      "link": "/r/Emory/comments/p0o3py/arabic_or_russian/h88q507/",
      "text": "I’ve taken a full year of Russian. The thing people ask about the most is the alphabet, and it’s really not hard once you get the hang of it. The workload is a fair amount, but not by any means overwhelming (a lot of repetition exercises to get the alphabet down, and then worksheets). The language itself can be frustrating to work with, especially as someone who had only taken Romance languages before (you never really appreciate how close those are to English until you take one with almost no similarities) but that I assume would also be an issue with Arabic. My professor was pretty good, so I would say if you’re interested, it’s a difficult but very interesting language to take.\n\nI don’t know anyone who started taking Arabic, so I can’t speak on that at all.\n\nGood luck!",
      "author": "partyandtheappaparty",
      "created": 1628476566,
      "upvotes": 2,
      "replies": {
        "h899xqo": {
          "link": "/r/Emory/comments/p0o3py/arabic_or_russian/h899xqo/",
          "text": "This was helpful, thanks!",
          "author": "screamingviking13",
          "created": 1628489406,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}