{
  "sid": "p5uo2s",
  "link": "/r/Emory/comments/p5uo2s/experience_working_at_the_bookstore/",
  "title:": "Experience working at the bookstore?",
  "text": "I applied to work at the bookstore for FWS and got the position, but I want to hear from former employees before I commit to it. Is there a good work environment? Are the managers nice? Is the work too demanding, especially for the (low) pay? Someone asked last year if this job was good for FWS, but there were no comments. Obviously, I don’t want to work at a toxic job so all info and feedback is welcome!",
  "author": "emorythrowaway3",
  "created": 1629166554,
  "updated": 1634097041,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "h98vphk": {
      "link": "/r/Emory/comments/p5uo2s/experience_working_at_the_bookstore/h98vphk/",
      "text": "100% agree with the other commenter.  The managers are nice, except textbooks lol, and the work is very easy.  75 percent of my job was standing behind the register and folding clothes while waiting for customers.  It's pretty boring but not difficult.  As the other commenter said, you aren't allowed to do homework, so that's something to keep in mind.  One of the perks is that hours are very very flexible--you basically choose when and how much you work.  \n\nYou'll find that most FWS positions, especially the less competitive/specialized ones, pay $9.  I would say that this is a decent, laid back job for the pay.",
      "author": "Silver-Seesaw6375",
      "created": 1629171124,
      "upvotes": 7,
      "replies": {}
    },
    "h98uedm": {
      "link": "/r/Emory/comments/p5uo2s/experience_working_at_the_bookstore/h98uedm/",
      "text": "I wouldn't say it was toxic. All the managers (except textbooks) were fine. It got sooo boring and I started to fall behind with school work (no time to do hw there) that I eventually quit.",
      "author": "Stillallergic",
      "created": 1629170440,
      "upvotes": 4,
      "replies": {}
    }
  }
}