{
  "sid": "of25vb",
  "link": "/r/Emory/comments/of25vb/any_introductory_courses_you_regret_skipping/",
  "title:": "Any introductory courses you regret skipping using AP/IB credits as a pre-med student?",
  "text": "I have several AP and IB credits that I can use to opt out of introductory-level courses, but I'm not sure if it will be a good idea in terms of preparing for med school. For instance, I've heard that many people still take CHEM 150 even if they have AP credit for it, and given that I plan to major in chemistry, I think taking the course will be useful. I was wondering if it was the same case for BIOL 141, MATH 111, and PSYC 111. \n\nDid anyone think any of those courses were very useful and worth taking even if you have credit for them? Specifically pre-med students?",
  "author": "Puzzleheaded-Pear-93",
  "created": 1625599711,
  "updated": 1634097583,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h49xiq2": {
      "link": "/r/Emory/comments/of25vb/any_introductory_courses_you_regret_skipping/h49xiq2/",
      "text": "Yeah no, only do that stuff if you are worried about your background or really want to ease into college.  Taking the z-sequence if you have chem credit usually sets you up for success because it gives a more rigorous foundation (and better study habits) for later courses and you get more research focused experiments in the labs.  It's also just better to start with smaller courses from a professional development point of view because you are more likely to establish a mentorship with †he professor (consider the fact †hat you'll have Soria for lecture and lab. If you work hard, show a desire to learn, and even do decently in his lecture, he will write you an amazing recommendation letter and will be able to comment on your plight in at least 3 courses-1 lecture, and 2 labs). A major should definitely take that (especially with a strong instructor teaching 202-z like Soria) if they have the oppurtunity and the grading distribution targets are more relaxed for 202z-203z versus standard 202/203 (and the in person versions of all of these are usually kind of intense so to take them when targeting more like a B+ average in the z sequence vs. a B- average in standard could be to your advantage. Basically you get rewarded for accelerating via more interesting material and problems in lecture and lab and slightly more lenient grading).\n\nIf you do that, you also get to advance to electives a lot faster. Imagine starting at 150 and †hen having to cram in your upper division and capstone course in 1.5 years when you'll have 203 out of †he way as a freshman and can start †aking organic chem focused eleç†ives (like Weinschenk's advanced organic course or organome†allic which only require 203) or some courses †ha† only require chem 204 (like systems chem) in your sophomore year.  This allows for exploration, and z sequence is rigorous enough to ensure you aren't at a disadvantage.\n\n&#x200B;\n\nAnyone who made a 5 or even a 4 on bio shouldn't bother wi†h 141.  Take 141-L, 142, 142-L and then just †ake cell bio and genetics la†er to enhance skills and problem solving in areas covered by 141/142 on †he MCAT.  Math 111 depends on your background, but stats is useful for pre-med and you need to †ake QTM 100 anyway, AP psyche basically is psych 111 so don't bo†her.  Psych 110 may be very useful along with maybe some social science courses.\n\n&#x200B;\n\n\\*Note on chem 150:  It could be a solid choice if you choose not to do z and to jus† do 202 in the spring because 202 sort of assumes you know how †o unders†and molecules in 3-D (s†ereochem, conformation, r/S configuration- modules towards the end of 150) whereas this stuff is explici†ly covered in 202-z because †hey know AP didn't cover it.  But either way, the advantage of 150 is mainly for non-chem majors because it gets pre-meds out of having to take an extra upper division chem w/lab like chem 205.  But as a chem major, you'll have to take it anyway.  But generally don't take more stuff than you have to as pre-meds. If you \"retake\" stuff, you are piling up additional STEM courses on top of all of the STEMs you need for the chemistry major alone which will result in you having to do extremely careful planning or having to increase your course load in later semesters beyond the average of a standard pre-med when you should be doing your best to maintain an upward trend. If you can use AP credits to avoid the crammed schedules (where pre-med cores would be combined with chem requirements which are often not the easiest). If you do take it for whatever odd reason, Do NOT take it(or 202) with Kindt (aim for McGill or Himes if possible, and maybe McKnelly-anyone who knows organic chemistry and less mathematical chem and can teach concepts).",
      "author": "oldeaglenewute2022",
      "created": 1625602218,
      "upvotes": 3,
      "replies": {}
    },
    "h49tc8y": {
      "link": "/r/Emory/comments/of25vb/any_introductory_courses_you_regret_skipping/h49tc8y/",
      "text": "I'll say CHEM 150 is not that big of a deal to skip, having taken it. The whole Emory curriculum is just unusual in general but you would only have that perspective if you've taken other chemistry courses from different universities. If this is your only exposure, you wouldn't think it's too much of a change. ALEKS is annoying but it forces you to get stuff right and invest time in it.\n\nMy girlfriend has a chemistry degree from a different uni and as I was taking the courses at Emory, overall she said it was just taught differently to encourage broader thinking across general and organic chemistry instead of compartmentalizing the two into separate years. She wrote more scientific papers for labs instead of the post-lab reports that Emory does and we did a lot more interesting experiments but covered the same bases. She did find our alum experiment overstayed its welcome for CHEM 150L, though.\n\nThe other courses you mentioned, nah you're not missing much if at all.",
      "author": "MyKali",
      "created": 1625600403,
      "upvotes": 1,
      "replies": {
        "h49zrcv": {
          "link": "/r/Emory/comments/of25vb/any_introductory_courses_you_regret_skipping/h49zrcv/",
          "text": "Damn! Emory don't make y'all write formal lab reports for foundation classes yet? I don't know how to feel about that one.",
          "author": "oldeaglenewute2022",
          "created": 1625603197,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h4a557d": {
      "link": "/r/Emory/comments/of25vb/any_introductory_courses_you_regret_skipping/h4a557d/",
      "text": "Definitely no need to retake BIOL 141 or MATH 111. As for CHEM 150, that depends on how confident you feel in terms of how well you actually learned the material. CHEM 202 can be tough, but if you actually learned in AP Chem you should be fine. PSYC 111 is a super interesting, easy and fun class, so I always recommend it, but if you don’t have space for it there’s no NEED to take it.",
      "author": "j11234567890",
      "created": 1625605540,
      "upvotes": 1,
      "replies": {}
    }
  }
}