{
  "sid": "rhyuoy",
  "link": "/r/Emory/comments/rhyuoy/oxford_college/",
  "title:": "Oxford College",
  "text": "So ED decisions came out yesterday and I got into Oxford but not the main campus. Im still really excited to go there, but I'm reading through the reddit posts and it seems like everyone hated going to Oxford and that there's a ton of stigma surrounding the school. Should I be worried?",
  "author": "cloow_",
  "created": 1639684953,
  "updated": 1639873715,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.79,
  "comments": {
    "hotnjal": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/hotnjal/",
      "text": "I went to Oxford and absolutely loved it! In fact, all my friends seemed to have a great time there. In my opinion, people don’t like Oxford either because of how small it is (ie no large parties) or how hard the academics are (which honestly they’re not too hard).",
      "author": "ATL_booknerd",
      "created": 1639685461,
      "upvotes": 17,
      "replies": {}
    },
    "hotu47u": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/hotu47u/",
      "text": "The \"stigma\" is pretty outdated and not really true anymore. It used to be considered the backdoor into Emory, but these days academics are just as rigorous if not more so due to having smaller class sizes and more personal attention for professors. \n\nIf you don't mind it not having big parties close by (you can still go to Atlanta on the weekends) and the somewhat insular everyone-knows-everyone culture, it's a great place. I loved my classes, formed close relationships with professors, and had a lot of leadership opportunities early on that I wouldn't have gotten on main.",
      "author": "sflaffer",
      "created": 1639688037,
      "upvotes": 12,
      "replies": {
        "hou6kl7": {
          "link": "/r/Emory/comments/rhyuoy/oxford_college/hou6kl7/",
          "text": "The backdoor thing only had to do with lower stats which is actually typical for even great LACs (and I think Ox especially today mimics the LACs I allude to even if it is 2 year) versus high calibre research U counterparts. The label was unfair and NEVER had to do with academic rigor because that usually does not even change much once schools are at some minimum threshold of selectivity.  \n\nIt was just some weird class war (I mostly only heard like the wealthy, not even upper middle, folks bring up Ox in such a way) and prestige non-sense.  Oxford in large part was always intentionally more intense (especially outside of STEM but in several STEM courses as well) than ECAS which makes sense because it is easier to have rigorous standards/ask students to do more demanding tasks when the classes are smaller because the grading is less of a burden and they are dedicated to teaching and curriculum development unlike a majority of ECAS faculty who have to do high impact research.\n\n\nThe problem with Oxford is that it is still polarizing because it serves as a gateway to Emory for many students who never really wanted an LAC like experience (socially or academically).  These folks are merely tolerating Ox for however long and waiting for the big ATL continuation.  And note nothing is wrong with these folks. They just mirror the majority of students at even highly selective research Us: they want professional development opps and an at least somewhat \"classical\" college social scene that is usually buttressed by proximity to a major urban area,+ but NOT intense classroom academics (especially not in the first 2 years). Fortunately today the share that understand what Oxford is and embrace that aspect has probably increased a bit, but ultimately it is not a standalone LAC so.will always get large shares of students who just wanna get to ATL.  \n\nAnd these people when they run into academic challenges or notice the social scene not being like a bigger college or university, they'll be the loudest folks expressing resentment.  The people who were neutral or enjoyed it are probably like ECAS students who fall into those categories. They don't say much because they are content or even satisfied.",
          "author": "oldeaglenewute2022",
          "created": 1639692962,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "houf0wj": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/houf0wj/",
      "text": "forget the stigma; become sigma",
      "author": "jsh_",
      "created": 1639696529,
      "upvotes": 7,
      "replies": {}
    },
    "hou3bm6": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/hou3bm6/",
      "text": "It’s not the best for mental health if that’s something you struggle with at all IMO. You also see the same people every single day for 2 years. I graduated ‘20 and wish I went to the ATL campus all four years or chose a different school.",
      "author": "buttercupbobas",
      "created": 1639691643,
      "upvotes": 5,
      "replies": {}
    },
    "houa9zq": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/houa9zq/",
      "text": "[http://emoryspoke.org/oxford-college-really-was-students-first-choice-okay/](http://emoryspoke.org/oxford-college-really-was-students-first-choice-okay/)\n\n[http://emoryspoke.org/oxford-continuees-named-honorary-freshman-at-emory-university/](http://emoryspoke.org/oxford-continuees-named-honorary-freshman-at-emory-university/)",
      "author": "Dr_Yankee",
      "created": 1639694504,
      "upvotes": 4,
      "replies": {}
    },
    "hou7rzy": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/hou7rzy/",
      "text": "I wouldn't worry about how others think (ECAS has silly people who non-stop complain or openly advertise chips on their shoulders too..and all the while most students are making a great time out of it) because Ox is polarizing.  You need to consider whether YOU wanted an LAC like experience (intense, smaller classroom academics, dialed down/quirkier social life, usually remote from large city centers) vs attending as a gateway to ECAS or GBS (I would hope ED1 candidates don't do this but many may have just viewed themselves as a borderline applicant to research Us they liked and viewed their odds at an Oxford as better). A lot of students think they can at least tolerate this type of environment for 2 years but it doesn't go particularly well so you need to be honest about where you are in your academic and personal development journey and whether you think Ox fits that vision.",
      "author": "oldeaglenewute2022",
      "created": 1639693457,
      "upvotes": 3,
      "replies": {}
    },
    "houdk7j": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/houdk7j/",
      "text": "Eh, maybe not my favorite with the shitty food and middle of nowhere, but definitely doesn’t hate it. Met some of the best ppl here.",
      "author": "paruruuuuu",
      "created": 1639695896,
      "upvotes": 3,
      "replies": {}
    },
    "houttvk": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/houttvk/",
      "text": "I go to Oxford. I love it here, but then again, the idea of an LAC was appealing to Me from the getgo. I love the small class sizes (you will know people in your classes and your professors will all know you well) and everything is so close that it forms a very close-knit community. When I walk into the dining hall, no matter what time of day, I usually find someone that I can sit with to eat. There are people who will dislike it, but i guess it just depends on what you are looking for. You can DM me if you have more questions",
      "author": "or_am_I_dancer",
      "created": 1639703185,
      "upvotes": 3,
      "replies": {}
    },
    "hov0oik": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/hov0oik/",
      "text": "I went to Oxford, though it was quite a long time ago. I really enjoyed my experience! I think 2 years is long enough and was ready to move to the main campus but I really did love my time there.",
      "author": "JKB8282",
      "created": 1639706238,
      "upvotes": 3,
      "replies": {}
    },
    "houbxb5": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/houbxb5/",
      "text": "Oxford has worse food and not many places to go around it but other than that I love it here. Easy to make friends, you can get to know people of all majors, leadership opportunities practically fall into your lap, club events are plentiful and advertised to everyone, you can do research (myself and most of my friends are doing research and/or study abroad), teachers actually know your name so they're quick to write recommendation letters, no difference in class difficulty in my experience after taking some atl ones, etc. I'll really miss this place when I graduate next semester. People usually go on social media if they have really strong opinions, like loving or especially hating. Personally, I hear my friends complain at Oxford because complaining is fun (I do so too, as I imagine college students everywhere enjoy doing) and there are some valid reasons to complain (like the food), but are just as quick to say all the things they enjoy like the people, professors, classes, campus vibes, etc and how much they'll miss the place. I'm glad I get the experience of both small campus and big campus :)",
      "author": "Artist552001",
      "created": 1639695196,
      "upvotes": 2,
      "replies": {}
    },
    "hox3l2k": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/hox3l2k/",
      "text": "Should’ve looked into this before u applied chief lol",
      "author": "WalterMohamed",
      "created": 1639750141,
      "upvotes": 1,
      "replies": {}
    },
    "houpojt": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/houpojt/",
      "text": "Yes.",
      "author": "HoangTr16",
      "created": 1639701312,
      "upvotes": -1,
      "replies": {}
    },
    "hp3xm5w": {
      "link": "/r/Emory/comments/rhyuoy/oxford_college/hp3xm5w/",
      "text": "I was in your exact position in 2014. Took the leap of faith and have always been glad I did. Those years are some of my fondest, and I made some lifelong friends at Oxford. Classes were awesome and worldview expanding, people were remarkably varied for how small the student body was, and there really was something for every kind of person too. I studied like hell to get a GPA that was necessary for med school but also did my fair share of partying. People who hated Oxford were rotten when they came in, not because the experience was so bad. To be sure I met plenty of these sad plebs, definitely some nightmare roommate stories. But rest assured the fun is there to be had, just be the kind of person to have it and you are set.",
      "author": "Doctor-F",
      "created": 1639872843,
      "upvotes": 1,
      "replies": {}
    }
  }
}