{
  "sid": "mmi36c",
  "link": "/r/Emory/comments/mmi36c/goizueta_bba/",
  "title:": "Goizueta BBA",
  "text": "I was admitted to the Oxford college and I am interested in studying business. I saw online that the BBA acceptance rate is over 70%. This seems rather odd since it is unusually high. If it does actually have that high of an acceptance rate is the program over inflated with the amount of people it has or is it still really good.",
  "author": "East_Spot311",
  "created": 1617849234,
  "updated": 1634098588,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "gtrki02": {
      "link": "/r/Emory/comments/mmi36c/goizueta_bba/gtrki02/",
      "text": "I want you to think about this carefully (because you seem to have bought into the \"acceptance rate = academic quality for undergrad programs\" BS.  Reality is that student body quality \"may\" correlate better and even then that isn't reliable. Either way, it's okay, a lot of people believe this stuff for some reason. Ask yourself whether you think most elite universities become more rigorous and stronger academically at the undergrad level as they get more applications and a lower acceptance rate or if the acceptance rate is a function of marketing by their admissions and communications departments as well as construction of new dorms and amenities. We just saw large increases in applications to colleges largely because of test optional: Do you think this would influence what academic programs do because the acceptance rate is lower?) and come up with your own answer: Admits to GBS were already admitted to Oxford or Emory College and then did academic work and earned a good GPA at those COLLEGES.\n\n\nNow in addition to thinking about all that, go look at the characteristics of those students and think about whether the faculty should be able to pitch their courses at a good level to ensure students can compete for jobs(or whatever).  Better yet, go look at their job placements and start salaries to see how important the admit rate must be.",
      "author": "oldeaglenewute2022",
      "created": 1617849881,
      "upvotes": 6,
      "replies": {}
    },
    "gtrm10x": {
      "link": "/r/Emory/comments/mmi36c/goizueta_bba/gtrm10x/",
      "text": "The admit rate is over 80% I’m pretty sure. It’s high because everyone was already admitted in to Emory under rigorous standards. The majority of people who don’t get in either have grades who are not great (i.e. failing), or maybe another issue such as academic misconduct.",
      "author": "wut_it_is",
      "created": 1617850702,
      "upvotes": 7,
      "replies": {}
    },
    "gtrwfbn": {
      "link": "/r/Emory/comments/mmi36c/goizueta_bba/gtrwfbn/",
      "text": "Buddy, u really think Emory is like IU Kelley that accepts dumbass football kids? Emory is alr hard to get into in the first place with this year's RD rate of 11%. Emory is just giving their students an opportunity that they earned..",
      "author": "ELON_MUSK_69420_",
      "created": 1617857003,
      "upvotes": 4,
      "replies": {
        "gtth81w": {
          "link": "/r/Emory/comments/mmi36c/goizueta_bba/gtth81w/",
          "text": "This. Unlike larger and less selective universities who have to cull the quality of students within the university, Emory’s small admit clad size and relatively homogeneous quality (although, perhaps, you are an example of an outlier given the stupidity of this question)  allows for a greater acceptance of students into their business school since they are an already talented pool of applicants.",
          "author": "The_Turing_Machine",
          "created": 1617894822,
          "upvotes": 3,
          "replies": {}
        },
        "h5h5ac6": {
          "link": "/r/Emory/comments/mmi36c/goizueta_bba/h5h5ac6/",
          "text": "It's simple... 11% acceptance rate multiplied by 70% is about an 8% acceptance rate into Goizueta.",
          "author": "sopwill333",
          "created": 1626490952,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}