{
  "sid": "l16ces",
  "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/",
  "title:": "How liberal is Emory?",
  "text": "I am a transfer student about to take credits in Emory. I wonder if professors here are open-minded with speech? Is Emory a very liberal college? Sorry if this question has been asked before, been getting a lot of helps and will be thankful for question too.",
  "author": "jackiezhang95",
  "created": 1611137288,
  "updated": 1634099318,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.82,
  "comments": {
    "gjxlwb2": {
      "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjxlwb2/",
      "text": "Emory staff and students tend to lean left, like most places of higher ed. \n\nFrom personal experience, professors are generally very understanding about most things, and as long as your speech isn't harmful to someone or needlessly inflammatory it should be fine.\n\nI doubt anyone would give you a hard time with anything as long as you're not an ass lmao.",
      "author": "FrozenYogurtWizard",
      "created": 1611140339,
      "upvotes": 18,
      "replies": {
        "gjxm9wg": {
          "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjxm9wg/",
          "text": "Lol. I voted for Biden. But I am scared of how divided this country has become and what will happen in the next four years",
          "author": "jackiezhang95",
          "created": 1611140697,
          "upvotes": 5,
          "replies": {
            "gjxmidf": {
              "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjxmidf/",
              "text": "Ah I maybe missinterpreted what you meant then, my bad. Emory is definitely more left than right, and (from my experience) most professors also fit that mold. \n\nI feel you abt the country though, shit has been chaotic.",
              "author": "FrozenYogurtWizard",
              "created": 1611140923,
              "upvotes": 7,
              "replies": {}
            },
            "gjy6d1o": {
              "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjy6d1o/",
              "text": "If you have the opportunity (and are interested in putting a more academic lens on your fears) definitely take an upper-level class with Dr. Abramowitz. \n\nHe is one of the top-level political polarization experts in the country and he is a cool guy.",
              "author": "koukoubaiyalady",
              "created": 1611154481,
              "upvotes": 5,
              "replies": {}
            },
            "gkwtjpq": {
              "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gkwtjpq/",
              "text": "It's gonna be a wild ride, that's for sure. Are you transferring in Fall 2021? I'm going to be a transfer student as well and I don't know what the atmosphere is going to be like. I'm from a deep, deep red state but most college students I would say are pretty well-minded  people.",
              "author": "Ok_Blueberry_1157",
              "created": 1611721205,
              "upvotes": 2,
              "replies": {
                "gkx8cpf": {
                  "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gkx8cpf/",
                  "text": "lol",
                  "author": "jackiezhang95",
                  "created": 1611731214,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gjyamh0": {
      "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjyamh0/",
      "text": "I have not seen much if any diversity of political thought if that is your question",
      "author": null,
      "created": 1611156617,
      "upvotes": 7,
      "replies": {
        "gm3tutu": {
          "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gm3tutu/",
          "text": "From my experience, the guys tend to lean more center/right when not around girls or in public lol",
          "author": "1ceberglettuce13",
          "created": 1612525979,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gjy62te": {
      "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjy62te/",
      "text": "Emory is VERYYYYYYY liberal. I am disappointed by how like minded people are and how closed they are to discussion. Conservatives on campus definitely feel like they need to keep their heads down in order to avoid being ostracized by their liberal peers.",
      "author": "IGoToEmowy",
      "created": 1611154333,
      "upvotes": 12,
      "replies": {
        "gjyu95r": {
          "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjyu95r/",
          "text": "I don't know if \"conservatism\" is the problem.  You can be \"conservative\" without being disrespectful.  Often people who complain about having to keep their \"heads down\" as conservatives want to be able to say and do some really weird and inflammatory stuff.  I honestly think both sides should just shut up a little bit because often college \"liberals\" are closer in leaning to \"conservatives\" than they'd like to think.  It is often all very superficial and not so well informed ideologies being expressed on either side to me.",
          "author": "oldeaglenewute2022",
          "created": 1611165390,
          "upvotes": 15,
          "replies": {
            "gjzbix4": {
              "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjzbix4/",
              "text": "[deleted]",
              "author": null,
              "created": 1611172848,
              "upvotes": 5,
              "replies": {
                "gjznbya": {
                  "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjznbya/",
                  "text": "Why can't you say that you didn't vote(many people find that as understandable this past cycle except maybe TDR resistance libs or crazy \"the election was fraud\" GOP folks)? It is easy to discuss that neither candidate was really viable.  I get that you have some weird students who really believe that voting Biden gives them some moral highground, but it doesn't and I think it is worth explaining any alternative position to them so that they can learn to think in a more nuanced way beyond just using a Trump Derangement syndrome to justify having alternative bad politics.   I don't know, I think people just have to not be scared or easily frustrated by having a political disagreement in the first place.  If the other person is weird and won't hear certain things, find someone who will. \n\n When I went there it was very liberal generally but when you get into the weeds of conversations that are SERIOUS and not just emotionally charged, they end up super interesting and you see how things like upbringing, class status, race/lineage and other things influence someone's ideas. Often they aren't as homogenous as people think but most aren't willing to try to have a conversation (and I think this is really both sides. Either side is prone to starting with something or someone who is a non-starter).  I mean if you know that saying you voted for Trump is a deal breaker, learn how to start with something else that does NOT center ANY political candidate but instead centers a policy agenda or idea.  I think people have to learn how to have these conversations.\n\nAll that stuff you said about \"Nazis\" or w/e is just people dodging.   Ask some of these same people about what policies they support since they are so \"liberal\"(again not leftist).  You'll find it very limited and unserious given all the stuff they talk.  \n\n\n*Also do not conflate liberalism with leftism. I know college campuses make people highly prone to that conflation but they are NOT the same whatsoever (there can be some overlap on social issues I guess).  I don't think a lot of college liberals or conservatives understand what leftism is and what issues are important to leftists.  Often you just see a bunch of superficial takes on identity/representation and whatnot(lifestyle issues, tone of speech) that is characteristic of liberalism. It's just often very bland and not substantive. And I'm not interested in Emory confessions.  Often you'll get weird stuff in social media spaces like that...especially something for something like freaking confessions of all things.   I wouldn't use it as a barometer of ANYTHING. Just have actual conversations (ideally in person eventually) with folks outside of hypersensational contexts like a confessions website/page or even twitter",
                  "author": "oldeaglenewute2022",
                  "created": 1611178041,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gkhk96q": {
          "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gkhk96q/",
          "text": "You are so right!",
          "author": "Smart-Engineer-6408",
          "created": 1611457699,
          "upvotes": 2,
          "replies": {}
        },
        "gjywjz2": {
          "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjywjz2/",
          "text": "I agree, I’ve had many conversations with some close classmates whose positions were altered when we were able to engage in a dialogue. That being said, I would not be able to have those conversations with just anybody. People at Emory tend to immediately shut you down when you come from a view that does not align with their own, and that is unproductive to our growth as individuals.",
          "author": "IGoToEmowy",
          "created": 1611166378,
          "upvotes": 3,
          "replies": {
            "gjz1drw": {
              "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjz1drw/",
              "text": "I don't know if I would feel intimidated or particularly surprised or disappointed by fools who felt \"inspired\" by Obama's problematic book:[https://emorywheel.com/a-promised-land-provides-extensive-breakdown-of-former-president/](https://emorywheel.com/a-promised-land-provides-extensive-breakdown-of-former-president/)\n\n&#x200B;\n\nThese are the types of \"liberals\" Emory tends to have lol.  What a joke?!",
              "author": "oldeaglenewute2022",
              "created": 1611168454,
              "upvotes": 2,
              "replies": {
                "gk0ft45": {
                  "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gk0ft45/",
                  "text": "The Wheel in general is a joke and it only exists so people can have an extracurricular on their applications.",
                  "author": null,
                  "created": 1611192027,
                  "upvotes": 4,
                  "replies": {
                    "gk0geoi": {
                      "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gk0geoi/",
                      "text": "Eh...at least they do some investigative or actual journalism sometimes. Many near peers have student newspapers that are effectively marketing arms of the university or college until the students get real pissed.  The Op-eds can just be weak in the Wheel at times in a way that reveals the priorities of the student body. Hint: They aren't the same as the schools that are the level of elite that places like Emory and near ranked schools aspire to be.  Don't get me wrong, those schools have similar political leanings, but their papers are much more serious about certain things. Beyond some petty lifestyle things, Emory students aren't very good at making serious demands that will better the school outside of say...\"diversity\" initiatives.  The latter is just not enough",
                      "author": "oldeaglenewute2022",
                      "created": 1611192337,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gk0eibs": {
      "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gk0eibs/",
      "text": "Back when campus was still full I heard f*ggot and the n word often and in the health oriented classes I’ve taken nobody cared if you said transvestite or transsexual instead of transgender. There’s a conservative student newspaper now as well. You can say what you want and plenty of people will agree, just don’t be an idiot and try to fight your professor in the middle of class.",
      "author": null,
      "created": 1611191360,
      "upvotes": 2,
      "replies": {}
    },
    "gjy7i2o": {
      "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjy7i2o/",
      "text": "[deleted]",
      "author": null,
      "created": 1611155065,
      "upvotes": 2,
      "replies": {
        "gjzewb7": {
          "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gjzewb7/",
          "text": "jesus what a bunch of pussies to be honest",
          "author": "Takumi_Minamino",
          "created": 1611174329,
          "upvotes": 2,
          "replies": {
            "gk041ed": {
              "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gk041ed/",
              "text": "[deleted]",
              "author": null,
              "created": 1611185981,
              "upvotes": -1,
              "replies": {
                "gk06sdp": {
                  "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gk06sdp/",
                  "text": "😂",
                  "author": "Takumi_Minamino",
                  "created": 1611187389,
                  "upvotes": 3,
                  "replies": {}
                },
                "gk2p6o1": {
                  "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gk2p6o1/",
                  "text": "You have got to be kidding me. The name of a presidential candidate triggers you?? How did you survive his name on the ballot??",
                  "author": "decafoatmilklatte",
                  "created": 1611246506,
                  "upvotes": 2,
                  "replies": {
                    "gk5hcn2": {
                      "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gk5hcn2/",
                      "text": "Who? What did he/she wrote?",
                      "author": "jackiezhang95",
                      "created": 1611297709,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gk2owxr": {
      "link": "/r/Emory/comments/l16ces/how_liberal_is_emory/gk2owxr/",
      "text": "My biggest advice would be to join bridge Emory!! It’s a great club that focuses on being open minded and the people there are really kind and ideologically diverse. We even did an event with Chris evans this year!",
      "author": "decafoatmilklatte",
      "created": 1611246383,
      "upvotes": 0,
      "replies": {}
    }
  }
}