{
  "sid": "jcajv8",
  "link": "/r/Emory/comments/jcajv8/is_offcampus_housing_a_viable_option_for_online/",
  "title:": "Is off-campus housing a viable option for online freshman spring 2021?",
  "text": "Hi. Basically, a group of students and I prefer the online format and would like to rent an apartment on a short term lease for just spring 2021. We still wanted a good social life with college friends, so instead of paying ~15k per person for room and board over a semester, we’d be paying around 8k per person for the Apartment, groceries, and other expenses over a semester. I was just wondering if this would affect financial aid disbursements, if a “commuter status” is possible (maybe not because of COVID tests?) and if we would still be allowed to enter campus?",
  "author": "lul_oop",
  "created": 1602857647,
  "updated": 1634099278,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "g90hxpt": {
      "link": "/r/Emory/comments/jcajv8/is_offcampus_housing_a_viable_option_for_online/g90hxpt/",
      "text": "I don’t think that can happen because freshman living off campus still have to pay for housing",
      "author": "BTDBunch",
      "created": 1602864173,
      "upvotes": 2,
      "replies": {
        "g90ij4z": {
          "link": "/r/Emory/comments/jcajv8/is_offcampus_housing_a_viable_option_for_online/g90ij4z/",
          "text": "I thought this was possible because, due to COVID, we can say that we are taking “online classes only” like some freshman did for first semester. Even if those freshman stayed at home for their first semester, they had to pay for housing?",
          "author": "lul_oop",
          "created": 1602864477,
          "upvotes": 1,
          "replies": {
            "g90p7u3": {
              "link": "/r/Emory/comments/jcajv8/is_offcampus_housing_a_viable_option_for_online/g90p7u3/",
              "text": ">Even if those freshman stayed at home for their first semester, they had to pay for housing?\n\nthat would be pretty wack of emory to charge students $6k (+ meal plan) for something they didnt use. if you weren't on campus for first semester, and don't intend on living on campus for second, i think you're free to do whatever and you can just rent off campus",
              "author": "incognitoshadow",
              "created": 1602867810,
              "upvotes": 3,
              "replies": {
                "g90pdsj": {
                  "link": "/r/Emory/comments/jcajv8/is_offcampus_housing_a_viable_option_for_online/g90pdsj/",
                  "text": "Ah alright that makes sense thanks!",
                  "author": "lul_oop",
                  "created": 1602867895,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g919cyz": {
      "link": "/r/Emory/comments/jcajv8/is_offcampus_housing_a_viable_option_for_online/g919cyz/",
      "text": "I emailed financial aid with this question concerning off-campus housing and was told that our aid is not in at all influenced by where we choose to live",
      "author": "bearswim",
      "created": 1602878059,
      "upvotes": 2,
      "replies": {}
    },
    "g9c2wj8": {
      "link": "/r/Emory/comments/jcajv8/is_offcampus_housing_a_viable_option_for_online/g9c2wj8/",
      "text": "Your aid doesn’t get influenced by living off campus and you obv don’t have to pay for living on campus if you’re not living on campus. If you get aid that covers housing, you’ll just get a massive refund to your bank account (the money that would normally be used for housing) and you’re just responsible for covering your own housing expenses (which in this semester some people may not have any so they get to keep the money).\nThe only exception to paying would be if you’re living on campus rn and want to get out of the housing contract for the next semester, which I have heard could be a massive pain, then they could actually force you to pay for living on campus as they’re basically counting on you already to be there. There are some exceptions to get out though, and I’m not sure if due to covid they have added any newer ones",
      "author": "Environmental_Youth6",
      "created": 1603121934,
      "upvotes": 1,
      "replies": {}
    }
  }
}