{
  "sid": "p8682l",
  "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/",
  "title:": "Is using an iPad with a keyboard and Apple Pencil to take notes (going paperless) a practical option for a freshman at the main campus?",
  "text": "Specifically in\nPrinciples of Microeconomics\nFrench 1\nIntro to Anthropology\nIntro to Computer Science (this requires a laptop which is fine)\nEmory Edge and It’s Your Health",
  "author": "PurpleOperation",
  "created": 1629469386,
  "updated": 1634096982,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "h9nzky9": {
      "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9nzky9/",
      "text": "Honestly it comes down to your work flow. If this is your setup, rock on. I use an android tablet (because it's much cheaper) with OneNote and I love it. \n\nYou should know that some things will be easier (carrying everything) and others will be harder (flipping through notes). So know your limits and consult with your professor about your use of electronics in class if they have a policy about it.",
      "author": "jogoma12",
      "created": 1629469798,
      "upvotes": 8,
      "replies": {
        "ha5ifb5": {
          "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/ha5ifb5/",
          "text": "How easy is it to get all the work into PDF form?",
          "author": "WalterMohamed",
          "created": 1629807392,
          "upvotes": 1,
          "replies": {
            "ha6ardp": {
              "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/ha6ardp/",
              "text": "From OneNote? Kind of difficult to be completely honest with you. \n\nFrom your professors? Quite easy. Most will post things on Canvas in PDF form. If they post in another format, you can print to PDF. If they use handouts, you can scan them at some of the printers around campus.",
              "author": "jogoma12",
              "created": 1629820434,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h9o7hwq": {
      "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9o7hwq/",
      "text": "Yes, lots of people do this. However, you just want to double check whether your professor wants you to take notes on actual paper.",
      "author": "iapetus3141",
      "created": 1629473035,
      "upvotes": 5,
      "replies": {
        "h9p9ibw": {
          "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9p9ibw/",
          "text": "Usually the argument is \"the act of writing helps you remember better\". With an iPad and Apple Pencil, you're doing the motion of writing, so it amounts to the same thing. Any reasonable professor would agree. Of course, there are some unreasonable professors so your mileage will vary.",
          "author": "phraps",
          "created": 1629488347,
          "upvotes": 3,
          "replies": {
            "h9pgy8i": {
              "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9pgy8i/",
              "text": "Hmmm I wonder if it's that much better given all the info. We have on the lack of efficacy of most passive lecture style environments. In many classes where the lecturer mainly just talks, people are being passive and frantically copying whether they write or type.  It may be that the yield in terms of any level of learning is so low that \"writing\" looks good in comparison even if it still sucks. I understand some stances professors take when it comes to how they run their courses but I never got this technology tyrant thing (except maybe in very large tiered auditoriums.  Other people's laptops, if not being used the course content I suppose can distract those who can see it). Let students grow up and figure out for themselves.",
              "author": "oldeaglenewute2022",
              "created": 1629491471,
              "upvotes": 2,
              "replies": {
                "h9phfhe": {
                  "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9phfhe/",
                  "text": "I prefer to hand-write notes because I can draw diagrams and stuff on paper. Can't really do that on a laptop unless it's touchscreen or you have a drawing tablet.\n\nThis is anecdotal, but because writing is slower than typing, I find that I'm much more conscious of what I'm writing down and trying to find better, concise ways to jot down notes. I think that helps me remember content better since I'm internalizing the material as it comes in. If I'm typing, I often find myself simply transcribing what the lecturer is saying, which is easy to autopilot.",
                  "author": "phraps",
                  "created": 1629491673,
                  "upvotes": 1,
                  "replies": {
                    "h9pmcsy": {
                      "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9pmcsy/",
                      "text": "Yeah phraps, but you're a good student/scholar lol. You probably didn't believe that the purpose of lectures was to sort of sit there to just copy everything verbatim and hopefully absorb it like a sponge(either during or after the session) as if the explicit lecture content is the totality of what you should know how to do vs. An appetizer before all the stuff that needs to happen outside of class.  You're actually thinking and trying to make meaning of stuff during the session and it makes everyone else look bad! Lol\n\nOn the serious side, I.agree for many STEM courses especially. At least for the better ones that require using more than one part of your brain.",
                      "author": "oldeaglenewute2022",
                      "created": 1629493745,
                      "upvotes": 2,
                      "replies": {
                        "h9pmv02": {
                          "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9pmv02/",
                          "text": "I know you're joking, and I don't mean to toot my own horn, but it's a good point to make to all the freshmen reading through the thread - please don't try to memorize your way through class! You have to actively think and fully understand the material you're learning. College was, at least for me, a completely different beast from high school. Not just in terms of rigor, but in terms of *how* I studied. And good notetaking skills can do a lot of heavy lifting in that regard.\n\nEDIT: \"good student\" lol. I had good habits that worked in undergrad but those habits evaporated during quarantine, as evidenced by the fact that I'm on reddit and playing chess at my desk instead of focusing on my work",
                          "author": "phraps",
                          "created": 1629493959,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h9pn792": {
      "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9pn792/",
      "text": "To actually answer OP's question, 99% of classes will be just fine with a tablet/stylus system. Plus you can ask around to find out if specific professors have a gripe against technology (I can tell you that Campbell in biology is very pro pen+paper) and know ahead of time when you register for classes. I believe for the classes you're taking, your iPad will be just fine. Do whatever works for you!",
      "author": "phraps",
      "created": 1629494104,
      "upvotes": 3,
      "replies": {}
    },
    "h9og6h9": {
      "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/h9og6h9/",
      "text": "def practical for intro to anthro. when i took it i just wrote on the powerpoint slides.. for health you can prob just take notes in the book they require you to get or use the ipad. i haven’t taken the others to give advice on",
      "author": "EveningExit",
      "created": 1629476514,
      "upvotes": 1,
      "replies": {}
    },
    "ha6410c": {
      "link": "/r/Emory/comments/p8682l/is_using_an_ipad_with_a_keyboard_and_apple_pencil/ha6410c/",
      "text": "I personally use an iPad with a keyboard and Apple Pencil as that was my workflow all throughout high school as well. I tend to use my computer for more heavy lifting software and more stuff in the lab. An iPad is definitely enough for lectures and you can do anything on an iPad but you gotta go with the workflow that is more comfortable for you.",
      "author": "IntroductionWeird278",
      "created": 1629817624,
      "upvotes": 1,
      "replies": {}
    }
  }
}