{
  "sid": "odcc4b",
  "link": "/r/Emory/comments/odcc4b/which_credits_should_i_waive_as_an_incoming/",
  "title:": "Which credits should I waive as an incoming freshmen?",
  "text": "As the title suggests, I am wondering which credits should I waive as an incoming freshmen (international student), since I have more than 12 credits that can be transferred. I studied A-Levels at high school.\n\n&#x200B;\n\n1. I am thinking about transferring 3 credits for math 111, 3 for chem 150 with lab, 3 for econ 101 and 3 for fwrt (if they don't put me in the class for non-native speakers; other probs 3 credits for econ 112 or bio 140, no lab). \n\nIn this case, my other not transferred credits would be bio 141 without lab, maths 112z, econ 112 and 3 possible elective credits towards ENG.\n\nDoes this transfer combo sound like a good idea? Will I run into problems if I am considering bio/bme and econ/bba as double major?\n\n&#x200B;\n\n2. I am also wondering, with the credits that I cannot waive, will I be able to skip a few freshmen classes using these? If so, will I face a lot of difficulties if I run straight into 200-courses? \n\n&#x200B;\n\nMany thanks in advance for your advice!",
  "author": "mazzy121",
  "created": 1625369262,
  "updated": 1634097591,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h3zl9b0": {
      "link": "/r/Emory/comments/odcc4b/which_credits_should_i_waive_as_an_incoming/h3zl9b0/",
      "text": "I think you have to call them about credit for a lab, my friend had to do that otherwise he would’ve only gotten credit for the lecture course but would’ve still needed to take the lab.\n\nAbsolutely use 3 credits for the first year writing requirement, the other courses depend tbh. In the psych major they allow you to use AP credit for one intro course BUT you have to take another elective, and in the BS you can use another AP credit for our extra science/math courses BUT you have to take another 300 above course. Look on the bio and Econ major requirements how AP affects your pathing.\n\nLastly, I think you can change your AP credits until you reach 60 credits, or something like that. I changed my credits 3 different times throughout my first two years while figuring out what degree to pursue and how they fit into the degree. So you still have time.",
      "author": "No-Puedo-Hacerlo",
      "created": 1625369827,
      "upvotes": 7,
      "replies": {}
    },
    "h40vape": {
      "link": "/r/Emory/comments/odcc4b/which_credits_should_i_waive_as_an_incoming/h40vape/",
      "text": "I would think twice about this bio/BME or even the econ/bba thing. And these two are very different so try exploring as much as possible your first and 2nd year to figure out which you wanna do ASAP if that is the direction you go in.  My criticisms of either is that the latter combo is comprised of two paths that are too similar/redundant in some ways and IF you are doing a double major (unnecessary), you may want to pick up a different set of skills not emphasized in the other.  Like maybe a BBA (or econ) with CS or a QSS concentration instead to amp up math and computational learning.  With bio/BME, think twice about that dual degree.  I 'think' it is doable, but so few go through with it.  Maybe if you want more quantitative training in biology, but want to keep the dual degree option open, you just use your chem AP credit and take chem 202z/203z this upcoming freshman year (get this out of the way and do NOT just sit chem 150 out and take chem 202 in the spring as it may throw you off course and make it such that you are taking chem 203 with a heavy courseload (sophomore 203 sticks to a pretty as a sophomore either due to QTM OR prepping for BME.  GT BME requires upwards to the ochem 2 equivalent, and you can take that course either fall or spring sophomore year and have it done before Tech) but go more towards a QTM bio concentration which automatically encompasses some GT BME pre-reqs like calc. based physics, linear algebra, etc (ask QTM if they can make an exception and allow you to take math 211 instead of math 210 if you consider this route).\n\n&#x200B;\n\nAnd yes, if you are comfortable with your preparation, you can waive other freshman classes and place upwards if you demonstrate that you did score high on the analogous A-level/AP/IB, whatever.",
      "author": "oldeaglenewute2022",
      "created": 1625407382,
      "upvotes": 2,
      "replies": {}
    },
    "h413iq1": {
      "link": "/r/Emory/comments/odcc4b/which_credits_should_i_waive_as_an_incoming/h413iq1/",
      "text": "I would ask the econ department if you should do this but I would recommend using bio 141 instead of econ 101. Econ is pretty generous about how they waive credits and they did for me so I was able to move along regardless. Otherwise you have the right idea. If you come from a strong bio background, you will find Emory's intro bio classes to be the most boring things imaginable.",
      "author": "Axonic11",
      "created": 1625411645,
      "upvotes": 1,
      "replies": {}
    }
  }
}