{
  "sid": "m5cnie",
  "link": "/r/Emory/comments/m5cnie/feeling_down_and_have_nowhere_to_vent_so_im/",
  "title:": "feeling down and have nowhere to vent so I'm writing this here.",
  "text": "What cumulative gpa did you had when you got accepted to business school? \n\nFor context, I'm a freshman and my cumulative gpa is 3.3 (rounded up) atm.\n\nTbh online classes (and a huge time difference), test anxiety, and having no friends really make me want to drop out. I got a C- in one of the business school pre-reqs bc I was so burnt out. I know it sounds like an excuse, but it was a tough fall semester (I'm trying to improve though). I feel like that C- in a pre-req will get me rejected and having to spend more money and time to take a different route.",
  "author": "Jazzlike_Confidence1",
  "created": 1615782348,
  "updated": 1634098743,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 1.0,
  "comments": {
    "gr3iopa": {
      "link": "/r/Emory/comments/m5cnie/feeling_down_and_have_nowhere_to_vent_so_im/gr3iopa/",
      "text": "i dont know anything about the business school but i wanted to say that you arent alone w the struggling. def been feeling like dropping out lately, too. online classes suck. pm me if you'd like! I'm also a freshman",
      "author": "janitorialkeys",
      "created": 1615876200,
      "upvotes": 3,
      "replies": {}
    },
    "gr1as5a": {
      "link": "/r/Emory/comments/m5cnie/feeling_down_and_have_nowhere_to_vent_so_im/gr1as5a/",
      "text": "Hi !! I think you should still apply. My first semester freshman GPA was not good, and I still got in. They value an upward trend and any story you have behind why your GPA is low (I was originally premed and these classes lowered my GPA bc I did not do well in them). You should def meet with the pre bba advisor and explain your situation. They are soooo nice and made me feel so much better. As for the prereq, I think it is ok as long as you do well in the other ones. If you are that concerned about your GPA, maybe apply regular so you have time to raise it (this is what I did)",
      "author": "highlowletgo",
      "created": 1615830499,
      "upvotes": 2,
      "replies": {}
    },
    "gqzkd7o": {
      "link": "/r/Emory/comments/m5cnie/feeling_down_and_have_nowhere_to_vent_so_im/gqzkd7o/",
      "text": "I agree with the person below, but what's up with the money and time thing?  A) Do you actually think you'll like business, and B) Are you only putting your eggs in that basket so have a relatively light courseload and aren't really exploring.   You are just a freshman so should honestly have PLENTY of time to a) start performing better to qualify for the b-school, b) start exploring other courses and majors to pivot towards in case you don't actually like business or worse (and unlikely) don't get admitted.  Having to abandon the b-school option for either reason shouldn't leave you out in the cold unless you are really kind of taking the bare minimum needed to gain admission to the b-school.\n\nI get that if you are doing that as a freshman because the adjustment (especially during this online/Covid stuff) is hard, but starting next year (if you are currently doing what I am describing) consider opening your mind and and schedule a little and maybe explore something outside of the b-school pre-reqs.  You can maybe even exploit the GER system to explore (for example, if you did QTM, pols, history, whatever, those should have several courses and paths that make progress on key GERs so you can sort use the GERs to explore in a focused manner).\n\n&#x200B;\n\n\\*Also, if you AREN'T doing what I'm describing and actually attempted challenging courseloads, the b-school admissions folks are known to take that into account when evaluating students.  They are not looking for reasons to deny people and actually want to encourage some academic challenge and resilience because the per semester course load in the b-school is higher than what a lot of people took in ECAS to keep a high GPA for admission (so you see transition effects).  Either way, I get the Emory ethos and what people say, but you do NOT have to be wed to some pre-professional track.  Your life and odds of success will not just be obliterated if you stray off of what is a perceived as a \"safe\" track.  There are so many paths to tap into and the College seems to be trying to build infrastructure around things like social sciences and humanities to ensure that students know how to access the broad array (of often surprisingly lucrative options).\n\nAlso, do you think your courses are going better this semester?  If so, celebrate that and finish strong this semester!",
      "author": "oldeaglenewute2022",
      "created": 1615789353,
      "upvotes": 4,
      "replies": {}
    }
  }
}