{
  "sid": "p0285g",
  "link": "/r/Emory/comments/p0285g/what_makes_emory_unique/",
  "title:": "what makes emory unique?",
  "text": " what makes emory `unique`?\n\nfrom my very limited research, it just seems like a good medium-sized, liberal arts+research college, similar to many others\n\nbut i cant rly tell what differentiates it from another good college (besides the oxford/emory situation and being in atlanta) \n\nplease dont hate on me for not doing my research i just want to know what u guys will say off the top of your head--i enjoy hearing others' opinions. thank you so much.\n\n&#x200B;\n\nfor context, im a rising HS senior (asian female) from socal, interested in the NBB major and potentially prehealth (ik emory's premed advising is p good?)",
  "author": "Mountain-Chicken345",
  "created": 1628373230,
  "updated": 1634097373,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "h83s7gt": {
      "link": "/r/Emory/comments/p0285g/what_makes_emory_unique/h83s7gt/",
      "text": "I mean this is a fair question, because many top tiers naturally share characteristics, but there are many differences that won't be obvious even if you do superficial research.  And since these schools are sort of bubbles, students who attend them may not even understand what is and isn't special about their own school.  They make assumptions about what other schools have or don't instead (and at an Emory, which is sort of an underdog, the assumption will usually be that whatever similar school has something Emory doesn't, negative assumptions)\n\nMost of Emory's peers do not really market themselves as \"liberal arts research colleges\" (they'll specifically market their college of arts and sciences as such, but most peers have way more undergraduate units than Emory, and most have an admissions system that directly admits into those units.  Notice how Emory doesn't have that, and EVERYONE must basically pass through ECAS and do some liberal arts and gen. ed focused education before even going to the business school or nursing school.  Furthermore, the share of people in ECAS versus other units is much higher than the CAS unit vs. other units at near peers) and are just straight up research universities at this point and it shows up in STEM which is what you're pursuing. Emory is literally trying to hold on to aspects of its regional teaching university past even in UG STEM education where its courses are generally a bit smaller per section and use much more active/non-lecture based learning in addition to a lot of curricular experimentation you won't see at most of its closer ranked peers (of course the most elite of them, the aspirational peers can afford to do it, but Emory is doing it with much less money than that tier of elite which suggests that it really wants to do it).\n\nSo even though Emory has lots of pre-professionals (who BTW, mostly major in disciplines considered the liberal arts), it's structuring kind of makes it live up to the \"liberal arts university\" (and usually its curricular innovations and stuff mirror how an LAC might do education) marketing more so than most other places who may want to market themselves that way.\n\nYou'll find that this makes pursuing STEM at Emory, if done right (versus just trying to skate/get throught it unscathed), a much warmer and more interesting experience than it is at most peers (if you're looking into Emory, I would say definitely also consider WashU) which generates perhaps an at least slightly (maybe even significantly) better intellectual atmosphere than you might get at other pre-med/pre-prof. heavy schools because you'll have a solid contingent of students who actually LIKE what they are studying and will embrace the more challenging instruction by some professors enthusiastically or go towards challenging pathways in high numbers (like I'm confident that majors like QTM would not be as big as they are at Emory at other places.  You just aren't going to see social sciences and humanities majors flock to add a concentration that is math and computational heavy in the numbers seen just like 5ish years after its founding).\n\nAlso, there is much more of a culture of mentoring from STEM faculty and this may be because Emory a) heavily uses lecture track (faculty exclusively focused on educating undergraduates) faculty in STEM vs. other places and b) Also is now focusing on orienting junior tenure research track faculty in a similar way.  The smaller section sizes also help with mentoring.  If you don't crowd like 200 people in an auditorium but instead split it 100 a piece per instructor, they are simply more likely to know you/your face, etc. Like you probably won't hear of as many profs of large lecture courses elsewhere learning all or most names or using Socratic Method and/or cold calling vs just powerpoint and clickers\n\nAlso, another thing I noticed just by going to departmental websites (and NBB is definitely guilty of this) at Emory vs. some of its \"near peers\" is that it tends to have more robust EC and co-curricular oppurtunities.  This goes beyond research (where it and its peers are excellent) but into options like Study Abroad (like you aren't gonna find many places where the chemistry dept has an inhouse study abroad program or a place with a neuro program so established that it has multiple options and a fellowship for post-grads abroad).  Most schools would send their students via a 3rd party to access such an oppurtunity but the life sciences departments at Emory (bio, chem, and NBB) have established relationships with other universities (especially those known for good UG experiences) which means that Emory has a lot more \"in house\" study abroad oppurtunities.\n\n&#x200B;\n\nEmory is certainly an interesting/weird place vs. some others but it isn't for everybody.  Don't bother applying if you think you really want D-1 sports and a \"rah rah\" sort of school spirit and social scene.  You can have fun there, but it is much more of a \"work harder, play hard sometimes\" school for most (especially those in STEM) and has a much more tame party scene.  And its traditions tend to be quirky/nerdy, or whatever.  Emory's social scene and traditions simply will not look like the college brochures for big state schools and the privates that want to mimic them in many ways and nor will it look like most movies which center a college party scene.  If you don't want to be more dedicated to academics, service, clubs, and personal projects, Emory may not be your type of place.",
      "author": "oldeaglenewute2022",
      "created": 1628375058,
      "upvotes": 24,
      "replies": {
        "h8761ky": {
          "link": "/r/Emory/comments/p0285g/what_makes_emory_unique/h8761ky/",
          "text": "thanks so much!! \n\ncould you point out some specific things unique to emory (besides the study abroad things)? so far im getting pretty general unique things to emory (mentoring, the liberal arts aspects..just tryna see what i can add to my supplementary essays that i wouldnt be able to find elsewhere on the website. thanks!)",
          "author": "Mountain-Chicken345",
          "created": 1628448984,
          "upvotes": 2,
          "replies": {
            "h876n5p": {
              "link": "/r/Emory/comments/p0285g/what_makes_emory_unique/h876n5p/",
              "text": "I don't know if this strategy will help because those supplementals are pretty pointy and often look for you to tell a coherent story vs. Flatter the institution.  What you may wanna do is start reading the wheel, hitting departmental websites (the undergrad part and maybe the research part), figuring out some educational and socialization values and seeing how they align with Emory's offerings (or whatever you were gonna say or do with the supplemental) vs looking for a laundry list of \"unique\" things at Emory. Rethink your strategy on this one.",
              "author": "oldeaglenewute2022",
              "created": 1628449262,
              "upvotes": 1,
              "replies": {
                "h87kls1": {
                  "link": "/r/Emory/comments/p0285g/what_makes_emory_unique/h87kls1/",
                  "text": "thats true. i think more importantly is when my parents ask me why i want to apply to emory, all i can think of is that it's in a city and has a major i like..  \notherwise, it seems similar to other unis my parents know of.",
                  "author": "Mountain-Chicken345",
                  "created": 1628455756,
                  "upvotes": 1,
                  "replies": {
                    "h87lq52": {
                      "link": "/r/Emory/comments/p0285g/what_makes_emory_unique/h87lq52/",
                      "text": "Well you need to learn how to do the detailed research to distinguish between similar schools. Indeed most prospective students don't and instead \"fall in love\" based on superficial stuff but if you comb around on Emory's website and things like Emory Magazine, Emory wheel, etc, you can get an idea of its emphases, values, and some things going on at the institution and the direction it may be taking.  You just have to do the work. Asking us is a start, but as I said, we probably won't know all the answers because many alum (like myself) and current student reddit contributers may still be unaware of some of Emory's resources or what it is up to.  \n\nAnd that is natural as most aren't involved in student gov, or things that keep them in the loop and they damned sure aren't doing research/being nosey the way I often do.  In addition, most people will just experience Emory differently because of how customizable a college experience is or even how easy it is to get into a routine and then siloed off from other opps that may exist.  But now as a prospective student, you have an opp to do this research before applying or committing to any school",
                      "author": "oldeaglenewute2022",
                      "created": 1628456275,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h85dew3": {
      "link": "/r/Emory/comments/p0285g/what_makes_emory_unique/h85dew3/",
      "text": "COCA-COLA",
      "author": "FrozenYogurtWizard",
      "created": 1628410445,
      "upvotes": 6,
      "replies": {}
    },
    "h87thz9": {
      "link": "/r/Emory/comments/p0285g/what_makes_emory_unique/h87thz9/",
      "text": "Everyone here I've met so far is always willing to help each other out. I've explained concepts to fellow students they didn't get the first time, fellow students have explained to me stuff I didn't get the first time (I'm an Oxford student and have taken classes at both campuses, the trend applies at each in my experience). Imo a lot of colleges have similar features so if you're looking for a laundry list of things Emory does that no one else does, you'll be hard pressed to find it (though the same applies for pretty much every college at this level, to me there's always other colleges doing similar stuff). The important thing is whether Emory has the major you want, whether Emory would potentially give you enough aid, and whether you think you can find a place with people you can enjoy your time here with. So far I've found the students are great. The group chats are funny, they answer questions about profs and classes, there's always texts whenever free food is available somewhere on campus, talks of late night adventures, etc.",
      "author": "Artist552001",
      "created": 1628459904,
      "upvotes": 2,
      "replies": {}
    }
  }
}