{
  "sid": "mnnu5n",
  "link": "/r/Emory/comments/mnnu5n/math_oxford/",
  "title:": "Math Oxford",
  "text": "Hi guys, this is my first Reddit post. I was recently admittedly to Oxford. I have 2 questions relating to the mathematics major: is it any good there?\n2- while browsing the mathematics catalog at Oxford, I didn’t find advanced classes and the courses seem to be numbered (there are not many) and low level, my question is can I take classes at the Emory campus like advanced calculus honors classes? if so are the shuttles free?\nThank you",
  "author": "Miserable-Ease-49",
  "created": 1617993885,
  "updated": 1634098569,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "gtypsze": {
      "link": "/r/Emory/comments/mnnu5n/math_oxford/gtypsze/",
      "text": "You can when you transfer over junior year. You can also take some during the summer.",
      "author": "91210toATL",
      "created": 1617995649,
      "upvotes": 2,
      "replies": {
        "gtyw75n": {
          "link": "/r/Emory/comments/mnnu5n/math_oxford/gtyw75n/",
          "text": "quick question? Are all of the classes low level like mathematics or are there courses on the oxford campus that are advanced?",
          "author": "Miserable-Ease-49",
          "created": 1617998595,
          "upvotes": 2,
          "replies": {
            "gtzn06c": {
              "link": "/r/Emory/comments/mnnu5n/math_oxford/gtzn06c/",
              "text": "250 and 315 are offered but they’re taught by Rodgers so I’d dissuade that.\n\nEdit: Discrete math and numerical analysis of you’re wondering.",
              "author": "Fenc58531",
              "created": 1618012080,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gtyq1yo": {
      "link": "/r/Emory/comments/mnnu5n/math_oxford/gtyq1yo/",
      "text": "Shuttles are free but it's hard to take classes at the atlanta campus while at oxford. That like a 3 hr shuttle commute round trip and the shuttles don't run that often. Plus you can only take one class in ATL/semester and you have to get the deans of both oxford and emory to sign off. \n\nOxford Math is not as advanced as Atlanta campuses (obviously) and starts at lower levels than Atlanta's (which begins at calc 1). Have you already taken 2 out of 3 for multivariable, difeq, and linear algebra? If so, Oxford math offerings are not a good option for you. If you've taken maybe 1 of those 3, I'd take the other two at oxford and focus on your gen-ed req to move to main campus after 3 semesters",
      "author": "FlowersBloomUntil",
      "created": 1617995762,
      "upvotes": 1,
      "replies": {
        "gtyv7uz": {
          "link": "/r/Emory/comments/mnnu5n/math_oxford/gtyv7uz/",
          "text": "Sadly, I have taken all three plus geometry with complex numbers. So, what do you recommend I do? How can I transfer in three semesters? As a student are they all low level?",
          "author": "Miserable-Ease-49",
          "created": 1617998138,
          "upvotes": 1,
          "replies": {
            "gtyx0wn": {
              "link": "/r/Emory/comments/mnnu5n/math_oxford/gtyx0wn/",
              "text": "Oof are you committed to Oxford? If so, you can try to arrange your schedule (after your first semester) so that you have M/W or T/Th free from Oxford campus classes so you can commute to main for math. To transfer in 3 semester, you need to complete the AA degree requirements. Basically, focus on credit hours + knocking out gen ed req. You could consider transient study your 1st summer to get some extra credits (at a cheaper cost than emory summer classes). Good luck",
              "author": "FlowersBloomUntil",
              "created": 1617998981,
              "upvotes": 2,
              "replies": {
                "gtyyk91": {
                  "link": "/r/Emory/comments/mnnu5n/math_oxford/gtyyk91/",
                  "text": "Thank you for your help. Just to be clear I can only take one course on the atlanta campus upon approval of both deans. One more question (sry if i am bothering you)  are all courses introductory or lower level specifically physics chemistry bio. Do you think if i want to major in math, is it worth going there? Do an emory admits ( atlanta campus) have an advantage in this regard? thank u so much.",
                  "author": "Miserable-Ease-49",
                  "created": 1617999699,
                  "upvotes": 2,
                  "replies": {
                    "gtz02v7": {
                      "link": "/r/Emory/comments/mnnu5n/math_oxford/gtz02v7/",
                      "text": "[Here](https://oxford.emory.edu/catalog/academics/academic-program.html#:~:text=Emory%20College%20Courses,Emory%20Colleges%2C%20or%20their%20designees) is info about take emory class while an oxford student.\n\nPoke around the course atlas with your campus set to Oxford to see the course offering in past semesters. You'll see that you're basically just going to find 100 and 200 level courses since that's what most 1st years and 2nds years are qualified to take. \n\nYes, emory admits who are know what they want to major in and are similarly advanced in the field (like you) are at an advantage because they can jump into 300 + 400 level classes and then be prepared to undertake advanced research earlier in their college career. If you're goal is a career in math / phd in math / ect, unfortunately I do think you'd be better off elsewhere. Math curriculum is pretty standardized and the degree-awarding institutions prestige matters much less than what topics you master / research you do during your Bachelors",
                      "author": "FlowersBloomUntil",
                      "created": 1618000413,
                      "upvotes": 2,
                      "replies": {
                        "gtz1wiw": {
                          "link": "/r/Emory/comments/mnnu5n/math_oxford/gtz1wiw/",
                          "text": "Well thank you very much for your help. You basically answered all my questions with specific details, so I appreciate it.",
                          "author": "Miserable-Ease-49",
                          "created": 1618001278,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gtz5uv8": {
              "link": "/r/Emory/comments/mnnu5n/math_oxford/gtz5uv8/",
              "text": "But where did you take them:  Was it at a particularly selective school and did you find it challenging or was it sort of taught very basically (like I described for versions of those at ECAS).  It may not be harmful trying at least one of them as a \"Q\" version and seeing what you can do in it. It may be VERY different how you learned it before or more enriching.  People who take chemistry at certain places before Emory find Emory's very different (likely because it is) for example.",
              "author": "oldeaglenewute2022",
              "created": 1618003195,
              "upvotes": 1,
              "replies": {
                "gtz6vd9": {
                  "link": "/r/Emory/comments/mnnu5n/math_oxford/gtz6vd9/",
                  "text": "I took part of them in high school ( lebanese and french baccalaureate; they are strong in terms of covering advanced mathematical topics) and the other part is from the top college in Lebanon (AUB- It's selective). I am going try what you said (take the Q version), and I just took a look at the syllabus, they are alright. \n\nPS: I am not trying to be a snob, I just got panicky because it\"s my future for god's sake. Anyway, thank you.",
                  "author": "Miserable-Ease-49",
                  "created": 1618003693,
                  "upvotes": 1,
                  "replies": {
                    "gtz8cmt": {
                      "link": "/r/Emory/comments/mnnu5n/math_oxford/gtz8cmt/",
                      "text": "No, I didn't think so (I strongly encourage people to accelerate if they need to so would never call anyone stuck up for that. Just not acceleration for the sake of acceleration.  You have to do quality control as well. Like if your options provide lackluster teaching and training, you may want to go slower if it means you get high quality instruction).  I'm just noting how some students can approach TEACHERS and you should know who or what types of students I am talking about.   For example, you wouldn't want to show off and do all that wild stuff that some students who may have above average preparation might do.  Teachers pick up on that, and you have to be careful how to approach them to get their blessings for rec. letters and other opps.  Also, for your future, accelerating is a great idea, but becoming independent in learning is FAR more important than being obedient/just checking off the courses if you wanna go to grad. school/use math for whatever, so do ask to be steered towards different projects or oppurtunities that allow YOU to explore and learn on your own.  You can do things like Putnam competition, take whatever is necessary on main, and then perhaps try for the Budapest semesters program (one math Goldwater did it:https://news.emory.edu/stories/2016/09/er_goldwater_scholars_alwaise_kantor/campus.html).  Basically, Emory WILL help you get lots of advanced courses on your transcript, but they won't necessarily be well run.  You'll wanna get into math research, directed reading, and other opps as soon as you can.  The courses probably won't cut it in your development (if this was a place where there was more project based learning in intermediate and upper division maths, then we'd be having a different conversation about how to go about choosing such courses) so don't overly obsess over advancing through the curriculum very quickly.  Quality over quantity in choosing courses.",
                      "author": "oldeaglenewute2022",
                      "created": 1618004420,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}