{
  "sid": "mmu3gy",
  "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/",
  "title:": "emory or berkeley premed",
  "text": "Hii i am recently accepted to both schools. i have talked to the students from both schools. i def love the berkeley students much more, they are so interesting and helpful, but has also learned the grade deflation. I feel in emory college i would have a very clear career path with hardwork and advising; in berkeley, i can see myself feel lost in pre-med and finally drop. also, my ex boyfriend is in emory so i do not really want to go \\[we are both accepted to emory college\\] i am super confused rn. both are excellent schools, but may you let me know where i should go?",
  "author": "Agreeable-Drawer3922",
  "created": 1617895242,
  "updated": 1634098575,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.65,
  "comments": {
    "gtttp30": {
      "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gtttp30/",
      "text": "I must admit I don't get the \"I like the berkeley students much more\" comment unless it is related to that boyfriend comment.  They both have way too many students to judge as a high schooler.  There is no way to tell without a significant multi-day visit or something.  But it is sounding like you lean towards UCB for personal reasons and if that makes you happy, that is what you should do.  Both of these can easily work for pre-med and you WILL sweat academically at either if you want them to pay off.  Only difference is that reaching out and getting mentoring from UCB profs may be a bit harder or more competitive in earlier years (I don't think lecture track faculty is as big there for example).",
      "author": "oldeaglenewute2022",
      "created": 1617900099,
      "upvotes": 14,
      "replies": {}
    },
    "gttkguj": {
      "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttkguj/",
      "text": "Seems like you'd rather go to Berkeley. It's a great school and with hard work you could succeed in premed at either option",
      "author": "FlowersBloomUntil",
      "created": 1617896210,
      "upvotes": 6,
      "replies": {}
    },
    "gttqzha": {
      "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttqzha/",
      "text": "Smaller class sizes at Emory which will make it easier to build relationships with family for letters of recs\n\nIt’s also not bad to “drop” pre med per say. people’s interests change as they get exposed to different things in college",
      "author": "premeddie19",
      "created": 1617898970,
      "upvotes": 3,
      "replies": {}
    },
    "gttqwo7": {
      "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttqwo7/",
      "text": "Emory is better but that doesn't matter if you won't enjoy your experience here.",
      "author": "91210toATL",
      "created": 1617898938,
      "upvotes": 2,
      "replies": {
        "gttsytm": {
          "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttsytm/",
          "text": "How is Emory \"better\"?  What is wrong with you?  These are very different schools with strengths in UG natural sciences. They should choose based on whether they want big or smallm sports or nah, and stuff like that in this instance.  They'll get high quality at both and get into a med. school or several if they do the damned work.",
          "author": "oldeaglenewute2022",
          "created": 1617899795,
          "upvotes": 3,
          "replies": {
            "gttv27n": {
              "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttv27n/",
              "text": "What's wrong with you not comprehending what an opinion is? And also OP is speaking on Pre-med which Emory is much better for by most people's standards.",
              "author": "91210toATL",
              "created": 1617900668,
              "upvotes": 2,
              "replies": {
                "gttwfqq": {
                  "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttwfqq/",
                  "text": "I understand and it's a bad opinion. And often \"most people\"(whoever they are) are clueless and will cite misinformation like \"grade deflation\" at one vs. the other.",
                  "author": "oldeaglenewute2022",
                  "created": 1617901244,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gttlpwd": {
      "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttlpwd/",
      "text": "I definitely think Emory has a great pre-med program. I know so many Emory students that have ended up at great medical schools. Being a smaller school, it’s really easy to navigate all the resources, and there are lots of opportunities to make yourself a strong candidate to apply to medical school. Really cool volunteer experiences, health related exposure, and global/public health opportunities. \n\nAlso the people at Emory are totally awesome. Professors are awesome and want to know people on a more personal basis (makes for good rec letters someday). There are some really interesting classes. Also there are a bunch of cool students with cool ideas and it’s fun to work together to make those ideas a reality.",
      "author": "IGoToEmowy",
      "created": 1617896738,
      "upvotes": 2,
      "replies": {}
    },
    "gttpsxa": {
      "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttpsxa/",
      "text": "You would have a clear path with advising and hard work in both schools. I’ve heard Berkeley has some grade deflation and can be a bit impersonal. However it’s a great school and is very prestigious. Both Emory and Berkeley are. I would assume Emory would give you an edge in opportunities but I’m not sure. Go with your heart",
      "author": "VTDMAN7",
      "created": 1617898477,
      "upvotes": 1,
      "replies": {
        "gttt28b": {
          "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gttt28b/",
          "text": "Grading is roughly the same.  It's a little lower than Emory in some social sciences, but most of the lower than average grading is in courses that serve engineers it seems (they have data on their course GPAs and pre-med courses clearly target similar distributions to those at Emory. Both are on the low side for elite privates/publics now-a-days).",
          "author": "oldeaglenewute2022",
          "created": 1617899835,
          "upvotes": 2,
          "replies": {
            "gtu0yhv": {
              "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gtu0yhv/",
              "text": "As someone with a lot of friends at Berkeley and goes on BerkeleyTime a lot, it's only really the pre-med classes that have shit distributions, and even then stuff like Chem 1A, Chem 3A, 3B, etc. really averages out to around a B if you count their lab sections (which are worth 2 units and average A- grades). Almost everything else looks very reasonable, with B+ averages in many Engineering courses.\n\nAlso, at Berkeley there's entire repositories of back-tests available to people for the common STEM classes like Gen Chem, OChem, Physics (both the algebra-based and the calculus-based sequences), CS 61A, CS 61C, etc. for you to practice with, and if you grind those out it's definitely doable to get great grades. My friends say the grade deflation is definitely overblown; it's definitely more adherent to \"you get out what you put in\".\n\nIf OP is out of state for both then I agree Emory is probably the better bet as you'd be paying too much tuition to have to deal with the vices of a cash-strapped public school.\n\nIf OP is a California resident, however, I see no reason for them to drop $75k/year on Emory if they're paying full price when they can pay less than half for UC Berkeley and get a comparable level of education. Berkeley also has surprisingly good track records with getting their students into medical schools, I wouldn't discount them whatsoever.",
              "author": "MundyyyT",
              "created": 1617903156,
              "upvotes": 3,
              "replies": {
                "gtu3w6o": {
                  "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gtu3w6o/",
                  "text": "Yeah that pretty much sounds like Emory. They'll target like a B- for the lecture component and maybe something higher for lab (most natural science labs aren't integrated anymore at Emory) and when they were integrated they targeted a B- for the whole course.  I suppose it is only harsh vs. other privates but is fairly typical STEM grading tbh. The 2.7-2.9 target for foundation courses is stereotypical.",
                  "author": "oldeaglenewute2022",
                  "created": 1617904387,
                  "upvotes": 2,
                  "replies": {}
                },
                "gtu3zjc": {
                  "link": "/r/Emory/comments/mmu3gy/emory_or_berkeley_premed/gtu3zjc/",
                  "text": "Yeah that pretty much sounds like Emory. They'll target like a B- for the lecture component and maybe something higher for lab (most natural science labs aren't integrated anymore at Emory) and when they were integrated they targeted a B- for the whole course.  I suppose it is only harsh vs. other privates(depending on how similar or different the curriculum is) but is fairly typical STEM grading tbh. The 2.7-2.9 target for foundation courses is stereotypical. Generally the level of the natural sciences courses at UCB seem to be among the better 2nd tier elite privates in those areas",
                  "author": "oldeaglenewute2022",
                  "created": 1617904427,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}