{
  "sid": "qtkrb5",
  "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/",
  "title:": "We Need To Talk About How Hypocritical “Awareness Organizations” Are",
  "text": "This will be a short rant in response to several posts that I’ve seen on several members of the Emory community’s social media platforms.\n\nI have been diagnosed with a social disorder and Emory has a club for awareness towards that social disorder.\n\nHOWEVER, many members on the board are people who should not have their spots and I found out had been trashing me behind my back for my “behavior” - mind that they don’t know about my disorder because I’m not public with it:\n\nIt disgusts me to see these accounts post their mental health and awareness days when the same people running the events are creating the problem.\n\nAnd stepping out publicly to call them out will only hurt me.\n\nYes, take care of your mental health. But it pains me to not find support in this community… support I so desperately wish for.\n\nHow do you all feel? Is it hard to watch people on social media claim to be an ally when they really aren’t?",
  "author": "Adventurous-You-634",
  "created": 1636875295,
  "updated": 1637182568,
  "over_18": false,
  "upvotes": 31,
  "upvote_ratio": 0.97,
  "comments": {
    "hkkdt0q": {
      "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/hkkdt0q/",
      "text": "The people running those orgs want to pad their resumes. Very few of them deserve to be taken seriously.",
      "author": "Gungnir111",
      "created": 1636878841,
      "upvotes": 25,
      "replies": {
        "hkkeb4t": {
          "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/hkkeb4t/",
          "text": "Honestly really sad though. We need people to actually bring awareness and make us comfortable with our identities… not the current situation",
          "author": "Adventurous-You-634",
          "created": 1636879221,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hkmwpnt": {
      "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/hkmwpnt/",
      "text": "Yup. I tried so hard not to laugh when the “Autism Awareness Club” (or maybe it was research, I can’t remember) said there probably weren’t any autistics in our class… to the faces of three autistic people, including myself. What a ridiculous, ignorant assumption. Also, not a single member was autistic themselves. Where’s the representation? What the fuck?",
      "author": "kaput__",
      "created": 1636923770,
      "upvotes": 15,
      "replies": {
        "hkmzt8q": {
          "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/hkmzt8q/",
          "text": "Exactly! The whole reason there’s no representation is because people who are actually autistic are too scared to step forward because of people like them",
          "author": "Adventurous-You-634",
          "created": 1636924992,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hklx4qn": {
      "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/hklx4qn/",
      "text": "I just deleted social media. Im off of everything, really helped with my mental space. These people don't deserve the time or day in my life.",
      "author": "Korean_Yezus420",
      "created": 1636910244,
      "upvotes": 2,
      "replies": {}
    },
    "hkraupn": {
      "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/hkraupn/",
      "text": "[removed]",
      "author": null,
      "created": 1637005312,
      "upvotes": 0,
      "replies": {
        "hkskg2q": {
          "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/hkskg2q/",
          "text": "Hi! Can you clarify what you mean by the term neurodiverse? What conditions constitute neurodiversity in the context you’ve given? Because, to my knowledge, the term neurodiverse refers to both neurotypical and neurodivergent people with different yet natural brain functions, whereas the term neurodivergent more specifically refers to people with brain functions that are considered more extreme, abnormal, and even difficult to have in society, like ASD, ADHD, Dyslexia, and Dyspraxia. \n\nHowever, you don’t use the word neurodivergent at all when describing your exec board, which I find somewhat strange for an organization that supposedly puts much passion and effort into researching autism and educating others about it? There’s a fundamental difference between both terms, so I hope you’re not trying to deviously label some of your neurotypical executive board members as neurodivergent to convince others that your club actually represents the autistic voices of Emory. \n\nI’m also interested in knowing what percentage of your neurodivergent executive board members have ADD or ADHD, if you’re comfortable with sharing that information? That’s fine if not, but I was simply wondering because I have personally been diagnosed with autism. And although I know that both ASD and ADD/ADHD fall under the neurodivergent umbrella, the social implications and overall stigma of having autism are far more severe and damaging. Friends I know with both ASD and ADHD have said that ADHD is hard to have, but it’s more normalized in society. Being open about having autism, on the other hand, isn’t as normalized and causes people to actually infantilize and abuse you, among other traumatic outcomes. \n\nAgain, as someone who is autistic myself, this is why I think having organizations like this one be spearheaded by autistic people in particular is really important. Not having just two or three members be autistic out of an entire executive board devoted to educating others about autism is enough, in my opinion, since 1) Emory definitely has more autistic students in its student body than you probably realize and 2) autistic people have more insight to offer about their condition than those who just observe it. If nearly everyone on the executive board of the AAO has ADD/ADHD or any other neurodivergent condition but not autism…then you guys cannot call yourselves the AAO. Nor can you say that your exec board (and its support of Autism Speaks) reflects the actual beliefs held by autistic people at Emory, to be honest.",
          "author": "emorythrowaway4421",
          "created": 1637024120,
          "upvotes": 7,
          "replies": {
            "hkt7hyz": {
              "link": "/r/Emory/comments/qtkrb5/we_need_to_talk_about_how_hypocritical_awareness/hkt7hyz/",
              "text": "I am not comfortable releasing the names of people who are neurodivergent. However, I can tell you that over 50% of our exec board is neurodivergent, and many people on our exec team have Autism. I was using neurodiverse in terms of actual diagnoses (ie neurodivergent). I was not trying to be devious in any way. I have read that neurodiverse is proper when referring to a group of people who may not all be neurodivergent. Not everyone on our executive board is neurodivergent. Some of us are neurotypical. Some of us are allistic but neurodivergent. However, MOST of us are neurodivergent and many of us are autistic. \n\nI do not know the statistics of who has ADHD vs other conditions on our executive board. I understand that conditions like ADHD and Dyslexia are far less stigmatized than ASD. We take an active role in improving acceptance of ASD on campus. \n\nI do not think I underestimate the number of people with autism on campus. I am very aware of its increasing prevalence in college, and how difficult it can be to notice without someone revealing their diagnosis. For these reasons, we are constantly trying to recruit people to join our organization. The heterogeneity within the spectrum is something that can make stereotyping and stigmatization even more hurtful for some; thus the need to work together on this issue.\n\nI agree that it is important to have this type group spearheaded by individuals who have autism, and we actively strive to do this. \n\nIf you feel inclined, we would love to hear more from or work with you - as someone who has autism. If you would be interested, I could schedule a meeting with you. Alternatively, we could also continue to speak anonymously if you prefer. \n\nHenry",
              "author": "emory2023h",
              "created": 1637034444,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}