{
  "sid": "qhu5di",
  "link": "/r/Emory/comments/qhu5di/need_advice_on_bba_courses/",
  "title:": "Need Advice on BBA Courses",
  "text": "Hi everyone, I would love some advice on which profs to take for BBA courses. I won't bullshit you guys - I want an easy A. From your experience, which professors are known to be the easiest A's for the following courses? I can take these courses Spring 2022 or Fall 2023, depending on your answers for ideal profs and depending on who's teaching when.   \n\n\n\\-ACT 211 - Managerial Accounting  \n\\-FIN 320 - Corporate Finance  \n\\-MKT 340 - Marketing  \n\\-ISOM 351 - Process & Systems Management  \n\\-ACT 410- Legal Environment of Business\n\n&#x200B;\n\nThank you so much, everyone! Insights on any of these will be much appreciated! :)))",
  "author": "bruhadiucal",
  "created": 1635448040,
  "updated": 1636197021,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hif2262": {
      "link": "/r/Emory/comments/qhu5di/need_advice_on_bba_courses/hif2262/",
      "text": "Lmao you only have one choice for BLaw. And you will have to work for that A. But dont worry, Burdette is probably one of the most engaging professors in the bschool, just listen to the podcasts, pay attention, and study.",
      "author": "Worldlover67",
      "created": 1635448387,
      "upvotes": 3,
      "replies": {
        "hinmhrx": {
          "link": "/r/Emory/comments/qhu5di/need_advice_on_bba_courses/hinmhrx/",
          "text": "Makes sense lol, thanks a lot!",
          "author": "bruhadiucal",
          "created": 1635609621,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hif2c14": {
      "link": "/r/Emory/comments/qhu5di/need_advice_on_bba_courses/hif2c14/",
      "text": "Also, just cuz a class or professor is easy doesn’t mean you’ll get an A. You still need to beat the curve. It’s almost ironically harder to get an A in easy classes because everyone’s grades are so high",
      "author": "Worldlover67",
      "created": 1635448497,
      "upvotes": 1,
      "replies": {
        "hif4zex": {
          "link": "/r/Emory/comments/qhu5di/need_advice_on_bba_courses/hif4zex/",
          "text": "Thx for reminding people.  People forget this.  If the faculty of one of those cores gives ultra easy assessments and the grades are extra high, I suspect it is more likely that final grades will not reflect Emory's standard scale and will instead be much more stringent meaning that students might have to be damned near perfect to make that A and it may be less predictable how they'll curve.  A faculty with medium or semi-difficult assessments (exams , projects, whatever) means that grades at their most stringent will be on the standard Emory scale and probably will be adjusted upwards if the target distribution is missed.  Those situations are more predictable IMO.",
          "author": "oldeaglenewute2022",
          "created": 1635449547,
          "upvotes": 1,
          "replies": {
            "hinmkhi": {
              "link": "/r/Emory/comments/qhu5di/need_advice_on_bba_courses/hinmkhi/",
              "text": "Ah, y'all bring up a very good point. This is something I failed to consider. Thanks for bringing it to my attention!",
              "author": "bruhadiucal",
              "created": 1635609653,
              "upvotes": 1,
              "replies": {
                "hio1oc9": {
                  "link": "/r/Emory/comments/qhu5di/need_advice_on_bba_courses/hio1oc9/",
                  "text": "Just take whatever you think will help your career development (as in whatever will prepare you best to successfully compete against other Emory and elite U students in job/internship interviews in whatever space you want to be. You certainly need a decent GPA to get interviews but I doubt you need to look paper perfect academically and you definitely don't want to end up looking like a paper tiger vs. Transcript and resume in interviews because you weren't pushed enough/in meaningful ways in courses, internships, whatever). I suppose definitely don't take the courses with high workloads or tough assessments all at once because you wanna have a life.  But don't really overthink the difficulty consideration either unless maybe you are planning on being on the recruitment trail and straight up won't be able to manage even 1-2 challenging courses.  \n\nLike if you are a sophomore it's a little early for that isn't it?  Unless academics for you right now are a little rougher than anticipated(I hear the shift from online to in person has been rough for many and people have started to burn out even before midterms.  COVID fatigue will do that)?But even to be admitted to the bschool you don't need perfection plus the GPA starts over when you get there so you can still get GPA based distinctions and whatnot based on GBS performance.",
                  "author": "oldeaglenewute2022",
                  "created": 1635615943,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}