{
  "sid": "oeaysh",
  "link": "/r/Emory/comments/oeaysh/instructors_permission_required/",
  "title:": "\"Instructor's permission required\"",
  "text": "I'm looking to enroll in a course about Architecture (ARTHIST 103 with Christina Crawford) during my first semester at Emory, and I noticed the course description says \"Instructor's permission required.\" I'm guessing this means I need to email the professor to ask permission to enroll in the class? In the email, do I need to justify why I want to take the class, or am I just showing interest/building a relationship with the professor before starting?",
  "author": "muffinsaredope",
  "created": 1625502738,
  "updated": 1634097590,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.76,
  "comments": {
    "h457c9v": {
      "link": "/r/Emory/comments/oeaysh/instructors_permission_required/h457c9v/",
      "text": "Is it online or in person? For the onlines it may just be them wanting proof that you can't or won't return to campus.",
      "author": "oldeaglenewute2022",
      "created": 1625503831,
      "upvotes": 3,
      "replies": {
        "h457l8q": {
          "link": "/r/Emory/comments/oeaysh/instructors_permission_required/h457l8q/",
          "text": "I think this one is in-person. That's what the course atlas says.",
          "author": "muffinsaredope",
          "created": 1625503955,
          "upvotes": 1,
          "replies": {
            "h457zma": {
              "link": "/r/Emory/comments/oeaysh/instructors_permission_required/h457zma/",
              "text": "Cool. Yeah just express a general interest and ask if you can receive help on enrolling in the course. Go to the departmental website to ensure they don't already have a process laid out for some courses that require permission (for example, Creative Writing Workshops require some application). May be possible that they want you to contact someone else other than the instructor (such as an undergraduate coordinator for the dept or something).",
              "author": "oldeaglenewute2022",
              "created": 1625504154,
              "upvotes": 5,
              "replies": {
                "h45bxc1": {
                  "link": "/r/Emory/comments/oeaysh/instructors_permission_required/h45bxc1/",
                  "text": "Thanks for your help! Just sent out an email.",
                  "author": "muffinsaredope",
                  "created": 1625506150,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}