{
  "sid": "ogrdsy",
  "link": "/r/Emory/comments/ogrdsy/trouble_w_research/",
  "title:": "Trouble w/ research",
  "text": "I've been emailing a bunch of different PI's for undergrad research, but I haven't been at all successful so far. I was wondering if anyone had any tips / could share how many PI's they had to email before they found research?\n\nI've just had 10 no's so far, so it feels like I'm doing something wrong. I've gone through the bio and chem research info material, but I'm still not hearing back",
  "author": "Interiordesign678",
  "created": 1625819773,
  "updated": 1634097562,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "h4l8x2s": {
      "link": "/r/Emory/comments/ogrdsy/trouble_w_research/h4l8x2s/",
      "text": "Have they been replying that their lab is just full? Maybe the email your sending out is too generic or doesn’t show enough interest?",
      "author": "MysteriousAd4424",
      "created": 1625838000,
      "upvotes": 2,
      "replies": {
        "h4lh238": {
          "link": "/r/Emory/comments/ogrdsy/trouble_w_research/h4lh238/",
          "text": "I think 3 professors responded saying their labs were full, but around 7 others just haven't replied. I don't think the email is too generic because I mention research articles, but is there something else I should be doing?",
          "author": "Interiordesign678",
          "created": 1625841965,
          "upvotes": 1,
          "replies": {
            "h4lidqu": {
              "link": "/r/Emory/comments/ogrdsy/trouble_w_research/h4lidqu/",
              "text": "I emailed around 5 with 3 no replies, one saying to check back in the spring, and 1 reply after a month saying yes! All it takes is one. Im interested in a specific research topic and it was very important to me that i was passionate and interested in the research so i didn’t reach out to many. To the PI i was successful with, i mentioned not only why i wad interested in their research but how i came to be interested. I also mentioned i was looking for a long term position without mentioning pay or anything. I discussed my prior research experience i did in high school as well and what skills i had to offer. At the end of the email, i said i would love to send them my resume and set up a meeting if they were interested in working with me. You can also attach your resume to the first email you send them. I have an upperclassman friend who said their pi only was interested in taking him after looking at his resume. Not because he had prior research experience or amazing extracurriculars but how he worded his activity descriptions. Also mentioning beforehand what kind of time commitment you can make (hours a week, how many semesters) is also good.",
              "author": "MysteriousAd4424",
              "created": 1625842576,
              "upvotes": 3,
              "replies": {
                "h4linxk": {
                  "link": "/r/Emory/comments/ogrdsy/trouble_w_research/h4linxk/",
                  "text": "Super helpful - thank you!!",
                  "author": "Interiordesign678",
                  "created": 1625842705,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h4lh97w": {
      "link": "/r/Emory/comments/ogrdsy/trouble_w_research/h4lh97w/",
      "text": "You've only emailed like 10 professors that's literally nothing LMFAO. I had emailed like 40.",
      "author": "Dr_Yankee",
      "created": 1625842057,
      "upvotes": 1,
      "replies": {
        "h4lhme6": {
          "link": "/r/Emory/comments/ogrdsy/trouble_w_research/h4lhme6/",
          "text": "Ah okay that's reassuring to hear - thanks!",
          "author": "Interiordesign678",
          "created": 1625842224,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}