{
  "sid": "nteuf6",
  "link": "/r/Emory/comments/nteuf6/can_anyone_tell_me_more_about_the_econhuman/",
  "title:": "Can anyone tell me more about the Econ-human health joint degree?",
  "text": "Personally I haven’t heard much people talk about this major. It seems like an interesting option considering that it could be a backup if med school doesn’t work out. Only problem is that I spend my first two years at Oxford, which to no surprise, does not have any classes that are pre reqs to the Econ-human health degree. I looked on the website and there are 16 courses that I have to take for the major. However I’m not sure if taking all 16 courses over the next 2 years is feasible considering that I have not yet finished my pre-med reqs(I plan to complete them my junior year). Has anyone had the same experience as me? Is it worth it to pursue this major? Thoughts? Comments?",
  "author": "williambeaner",
  "created": 1622958680,
  "updated": 1634097999,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "h0rpa5x": {
      "link": "/r/Emory/comments/nteuf6/can_anyone_tell_me_more_about_the_econhuman/h0rpa5x/",
      "text": "So I can’t help much in regards to the lack of classes at ox but I would not recommend the major unless you are really interested in Econ. The major focuses on the economics of health as a whole. While it could definitely be great with being a pre med (and they made it only a 45 credit hour major so premeds can do it) you should only do it if you really like and are interested in Econ. With that said, I am really enjoying it so far, each class I have taken for the major has been great and the professors are really smart and good at teaching. If you have any other questions tho lmk!",
      "author": "Squami11",
      "created": 1622960461,
      "upvotes": 2,
      "replies": {
        "h0t6ke5": {
          "link": "/r/Emory/comments/nteuf6/can_anyone_tell_me_more_about_the_econhuman/h0t6ke5/",
          "text": "I hope this question isn’t too personal but what do you plan to do with your major after you graduate?",
          "author": "williambeaner",
          "created": 1622997730,
          "upvotes": 1,
          "replies": {
            "h0t7nf8": {
              "link": "/r/Emory/comments/nteuf6/can_anyone_tell_me_more_about_the_econhuman/h0t7nf8/",
              "text": "I want to go into public health/healthcare law. Most of healthcare law is about the compliance based around how hospitals have to spend money. This way I am able to use the public health knowledge in addition to the Econ side of things. This I know is a pretty specific career path, but I do think the major could be viable for someone who wants to be a doctor who wants to run their own practice. This way they would have a better understanding of the healthcare system and insurance.",
              "author": "Squami11",
              "created": 1622998245,
              "upvotes": 2,
              "replies": {
                "h0tvy30": {
                  "link": "/r/Emory/comments/nteuf6/can_anyone_tell_me_more_about_the_econhuman/h0tvy30/",
                  "text": "Wow good luck to you in your future! I’m probably not going to pursue the Econ-human health major bc like you said, it is pretty econ heavy which I’m not particularly fond of.",
                  "author": "williambeaner",
                  "created": 1623009652,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h0sw2gf": {
      "link": "/r/Emory/comments/nteuf6/can_anyone_tell_me_more_about_the_econhuman/h0sw2gf/",
      "text": "The major is pretty new so keep that in mind in terms of \"hearing\" about it, however, I have seen many pre-meds who were STEM majors suddenly add a whole standard economics major later in their career, especially if they at least took intro. economics. Have you at least taken those and do you have another major that you are pursuing alongside it in the case that you decide that cramming all the requirements isn't worthwhile (maybe you can leverage whatever you did on a resume IF you get any internship or experiential learning opps in the area.  I doubt that simply completing and doing well in classes in the joint degree will activate it a \"back up\" for pre-med so make sure you have time to significantly immerse yourself in that area beyond course work)?",
      "author": "oldeaglenewute2022",
      "created": 1622992587,
      "upvotes": 0,
      "replies": {}
    }
  }
}