{
  "sid": "kddw82",
  "link": "/r/Emory/comments/kddw82/emory_alum_ama/",
  "title:": "Emory Alum AMA",
  "text": "I graduated from Emory in summer 2020. AMA",
  "author": null,
  "created": 1608003404,
  "updated": 1634099152,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.83,
  "comments": {
    "gfw07vo": {
      "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfw07vo/",
      "text": "What’s something you wish you knew about Emory as a freshman?",
      "author": "blueravenclaw29",
      "created": 1608005475,
      "upvotes": 8,
      "replies": {
        "gfw0jrh": {
          "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfw0jrh/",
          "text": "Good question, it would have been good to explore a wider variety of career options. I didn’t know people can make millions working as a quant in a hedge fund. As a closet premed, I would have also been involved in research much sooner or just majored in economics and complete a career change post-bacc. Lastly, Emory has a car share service.",
          "author": null,
          "created": 1608005655,
          "upvotes": 7,
          "replies": {
            "gfw3975": {
              "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfw3975/",
              "text": "> Lastly, Emory has a car share service.\n\nA what now?",
              "author": "phraps",
              "created": 1608007162,
              "upvotes": 2,
              "replies": {
                "gfw54jc": {
                  "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfw54jc/",
                  "text": "Yes, it’s not operated by Emory. But if you go to Claimont campus, there’s a rental car that students can reserve and pay by the hour. My gf used it to visit friends an hour away. If I remember correctly, students fill out a small form, get approval, and unlock the car door via smart phone. Really cool imo",
                  "author": null,
                  "created": 1608008253,
                  "upvotes": 4,
                  "replies": {
                    "gfwasnd": {
                      "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfwasnd/",
                      "text": "by enterprise right?",
                      "author": "incognitoshadow",
                      "created": 1608012235,
                      "upvotes": 2,
                      "replies": {
                        "gfxdt32": {
                          "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfxdt32/",
                          "text": "Zip car",
                          "author": null,
                          "created": 1608045115,
                          "upvotes": 2,
                          "replies": {
                            "gfy1oy8": {
                              "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfy1oy8/",
                              "text": "oh didn't know they had a tieup with emory too. I know enterprise gives a student discount for a similar carshare service, cus I've used a friend's account to rent a car once",
                              "author": "incognitoshadow",
                              "created": 1608056648,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gg056mt": {
                      "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg056mt/",
                      "text": "Do you know if they discontinued this? I just looked on zipcar’s university website and it looks like Emory doesn’t have this",
                      "author": "mintylemonwade",
                      "created": 1608096249,
                      "upvotes": 1,
                      "replies": {
                        "gg8sy5f": {
                          "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg8sy5f/",
                          "text": "Probably a pandemic thing. They had it last semester",
                          "author": "iapetus3141",
                          "created": 1608293699,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "ggs6wul": {
              "link": "/r/Emory/comments/kddw82/emory_alum_ama/ggs6wul/",
              "text": "What do you mean by major in econ then complete a career change post-bacc?",
              "author": "whorepliesthis",
              "created": 1608714581,
              "upvotes": 1,
              "replies": {
                "gh2o2k5": {
                  "link": "/r/Emory/comments/kddw82/emory_alum_ama/gh2o2k5/",
                  "text": "Sorry for the late reply. To answer your question: basically if you major in something besides STEM, have taken less than two medical school prequisite classes, and have a high GPA, then you are eligible for career change programs. There are dozens across the country, but Columbia and Goucher are easily the best imo.",
                  "author": null,
                  "created": 1608993486,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gfxzeoo": {
      "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfxzeoo/",
      "text": "Any advice for people graduating next year looking for jobs?",
      "author": "Money_Data",
      "created": 1608055585,
      "upvotes": 2,
      "replies": {
        "gfy6w77": {
          "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfy6w77/",
          "text": "My answer depends on what field you're seeking. I majored in biology and had offers for masters programs at Cambridge and Yonsei. Both were too expensive even after scholarship. Now I'm looking for medical assistant jobs that pay less than lifeguard jobs during high school. I would recommend internships, asking professors for recommendations, and applying broadly. Something is better than nothing. More coursework in hard subjects such as computer science, maths, stats, and finance also helps. I hope that helps.",
          "author": null,
          "created": 1608058966,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gg0fim6": {
      "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg0fim6/",
      "text": "What’s your absolute favorite thing about Emory? And any advice for pre meds specifically? Thanks!",
      "author": "yoojimin",
      "created": 1608104656,
      "upvotes": 2,
      "replies": {
        "gg1utqf": {
          "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg1utqf/",
          "text": "Absolute favorite thing— I don’t know if there’s a favorite aspect per se, but there is a collection of positives. Anil, my pre-med advisor, a few professors, and some fellow students were great people. Simultaneously, there are some terrible people at Emory as well. The international student body is an excellent opportunity to learn about other cultures and explore new cuisines. \n\nHeaps of advice for pre-med students. GPA and MCAT are king and queen. Research is vitally important for top tier med schools since they always want more research output. Studying for the MCAT is like building a sand castle right along the shore line. The tides represent time decay, study hard and quickly for max results. \n\nFeel free to DM with any questions, sometimes the advisors aren’t quite accurate with their advice.",
          "author": null,
          "created": 1608140873,
          "upvotes": 3,
          "replies": {
            "gg22ll4": {
              "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg22ll4/",
              "text": "I don't know if this is true but my experience with tutoring pre-meds when I was there was that PHA people were nice but many would kind of just give advice to the lowest common denominator vs. seriously taking the time to consider the specific situation of some students.  I had many that would claim they were misadvised or told to do weird things like change their major or take classes in a dept they weren't interested in to boost their GPA (and of course it would fail).  \n\nDo you think there is any truth to this from your experience (eventually I just started telling people to trust them in everything but course selection advice)? I just notice that the entrance success rates haven't changed that dramatically since their establishment or the start of the committee letters.  The best I can do is recommend good professors and study/thinking strategies. I never knew what to do when PHA gives students advice that is not aligned with advice given at peer schools with higher success rates and it is hard to convince students that a supposed authority figure may be wrong. They really wanna believe in the PHA when its efficacy seems limited so far.",
              "author": "oldeaglenewute2022",
              "created": 1608144505,
              "upvotes": 1,
              "replies": {
                "gg23j14": {
                  "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg23j14/",
                  "text": "I don’t know about other students experiences since I was a closet pre-med, asked very specific questions, and never asked others about what they’re doing. \n\nCourse selection matters a lot in my opinion because bad professors add stress and lead to lower marks. And, in the long run, the difference adds up. That’s why I asked my girlfriend who was a year ahead in the bio major. Be skeptical, but sometimes you don’t have a choice which means some brown nosing is required.\n\nI disagreed with my advisor about MCAT timelines. It’s always better to go hard for 8-10 weeks for forty hours a week according to Hopkins University data.",
                  "author": null,
                  "created": 1608144925,
                  "upvotes": 1,
                  "replies": {
                    "gg241yw": {
                      "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg241yw/",
                      "text": "Well that is good know. BTW, I think you were smart for being a closet pre-med because often there are problematic cultural things attached to it as well as course selection bandwagons that seem to lead people astray in terms of both grades and MCAT.  I think some people take terrible but supposedly \"easy\" professors and then underperform what they would have gotten with a better, more caring prof that may have technically been more difficult. I talk about it on here but it looks like Emory has like a two tier system of those who take good profs and those who don't and it affects GPA and MCAT.",
                      "author": "oldeaglenewute2022",
                      "created": 1608145167,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gg23rn8": {
                  "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg23rn8/",
                  "text": "GPA padding is important at times, but the BCPM courses at Emory are all hard anyway. Major in what you want, but biology is without a doubt the most similar to the first year of med, dental, and vet schools",
                  "author": null,
                  "created": 1608145035,
                  "upvotes": 1,
                  "replies": {
                    "gg26lof": {
                      "link": "/r/Emory/comments/kddw82/emory_alum_ama/gg26lof/",
                      "text": "Biol is great IF the student takes it seriously.  Too many don't and kind of just take those memory based courses(like biol 14x may be the most critical and analytical thinking they have done for a biol class and depending on who they took, it may not be much) which in a way reflect med. school but aren't as great for MCAT prep.  I feel like a mix of those and research focused courses with journal article reading is ideal priming for the MCAT studying (like it helps to be used to reading journal articles and authentic figures in STEM vs. seeing passages that use them for the first time when you start studying.  Learning to adapt to that and then also reviewing content has to be a lot I imagine) and med. school especially in case a student never joins a research team.  After all, most Emory students already are excellent at textbook learning and regurgitating and displaying basic understanding of content from K-12.  All they gotta do is step it up some.  \n\nAs for padding, students should know that there are good classes that emphasize certain skills but are also  easy to get good grades in and are sometimes in a STEM dept.  Evolutionary biology is one of them IMO (because the content is kind of intuitive).  It usually doesn't emphasize \"medically related\" material but analyzing figures, data, and experimental design is something good to pick up and often they do a good job selecting cases that are ultimately tied back to molecular bio and other bio disciplines that pre-meds I think would find useful.  Sometimes it is about finding the right padders with the right teachers I think.",
                      "author": "oldeaglenewute2022",
                      "created": 1608146361,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gfwgl5o": {
      "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfwgl5o/",
      "text": "If there’s a club you’d recommend someone join, according to your experience, what would it be?",
      "author": "blueravenclaw29",
      "created": 1608017110,
      "upvotes": 1,
      "replies": {
        "gfxdjra": {
          "link": "/r/Emory/comments/kddw82/emory_alum_ama/gfxdjra/",
          "text": "I worked a lot during undergrad, but club golf seems pretty chill. A lot of girls seem to like the dance teams eg. Mulan. The band/orchestra has auditions, and most people pass. There are so many options. Just try one that interests you.",
          "author": null,
          "created": 1608044978,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}