{
  "sid": "fpo1q7",
  "link": "/r/Emory/comments/fpo1q7/how_are_the_language_programs_at_emory_spanish/",
  "title:": "How are the language programs at Emory (Spanish specificially)?",
  "text": "Hello! I was just accepted to both Emory College and Oxford at Emory, and I'm super excited! I'm really interested in languages, and I plan on majoring in Spanish. Can anyone who is currently taking Spanish or any other language at Emory tell me how the classes are? Also, how are the placement tests? Thanks in advance!",
  "author": null,
  "created": 1585272509,
  "updated": 1634099115,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "flmnr7z": {
      "link": "/r/Emory/comments/fpo1q7/how_are_the_language_programs_at_emory_spanish/flmnr7z/",
      "text": "Don't worry about the Spanish Placement tests at Emory they're easy. Overall the Spanish program at Emory has been pretty great, as the professors have been mostly amazing. Don't take Span 300 your first semester though, take 212 as Elva is a great teacher and it'll still count as an elective for the major. Also, DON'T take the freshmen seminar for Spanish, it sucks.",
      "author": "icebeatsfire",
      "created": 1585289571,
      "upvotes": 5,
      "replies": {
        "flmpbdc": {
          "link": "/r/Emory/comments/fpo1q7/how_are_the_language_programs_at_emory_spanish/flmpbdc/",
          "text": "Thank you so much for the response! What makes the freshmen seminar so bad though?",
          "author": null,
          "created": 1585291203,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "flmuq6m": {
      "link": "/r/Emory/comments/fpo1q7/how_are_the_language_programs_at_emory_spanish/flmuq6m/",
      "text": "Overall the program is incredible. Most of the teachers are very capable, supportive, and engaging. Ngl it’s a lot of hw cuz the class uses this reverse class room online program that is very structured, but it ultimately helps keep the class as a good pace and teaches a lot. I highly recommend Feldman. But you can use rate my professor to see which ones have good reviews. The language placement test has some problems with  accuracy for where you actually should be. If you took any spanish in HS it’s very unlikely that you’ll be placed in 101, even if that is truly where you level is. However, if you get placed into a higher level than you’re comfortable with, the professor will be happy to work with you and help you succeed and catch up in the class.",
      "author": "ingloriousbatturd",
      "created": 1585297464,
      "upvotes": 5,
      "replies": {}
    },
    "flmq8z2": {
      "link": "/r/Emory/comments/fpo1q7/how_are_the_language_programs_at_emory_spanish/flmq8z2/",
      "text": "Love the Spanish professors. Robyn is THE BEST",
      "author": "donginator",
      "created": 1585292217,
      "upvotes": 3,
      "replies": {}
    }
  }
}