{
  "sid": "o9tv8r",
  "link": "/r/Emory/comments/o9tv8r/vaccination_form/",
  "title:": "Vaccination form",
  "text": "I see a form that I have to have my health care provider sign. What if I don’t have a health care provider though?",
  "author": "sweetpeaches99",
  "created": 1624915697,
  "updated": 1634097671,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "h3ddaxz": {
      "link": "/r/Emory/comments/o9tv8r/vaccination_form/h3ddaxz/",
      "text": "The fact that you were given a vaccine and it was legally recorded means a healthcare provider gave you one (or ordered someone to give you one) and signed it somewhere legally. All vaccine providers, public or private, are required by the National Vaccine Childhood Injury Act to give the appropriate Vaccine Information Statement (VIS) to the patient (or parent or legal representative) prior to every dose of specific vaccines.\n\nYou can check your medical records (ask your parents how to if you don't know and you're under their insurance) and the print-offs for your immunizations should have the info of who administered them, when, and where. Mine were all over the place so I just went to my current healthcare provider, asked them to verify my medical/immunizations records in one form for Emory, and had them sign it.\n\nUnless you don't have insurance, in which case you would have to find one. Emory requires you to get insurance so I'm sure this won't be an issue. Bottom line, you should probably ask your parents or your insurance, not strangers on Reddit.",
      "author": "MyKali",
      "created": 1624917436,
      "upvotes": 8,
      "replies": {
        "h3ddlho": {
          "link": "/r/Emory/comments/o9tv8r/vaccination_form/h3ddlho/",
          "text": "So can I just provide my current doctor with all the vaccination record I have and ask her to validate it?",
          "author": "sweetpeaches99",
          "created": 1624917569,
          "upvotes": 2,
          "replies": {
            "h3de4me": {
              "link": "/r/Emory/comments/o9tv8r/vaccination_form/h3de4me/",
              "text": "That's what I did for mine, if you're talking about the Emory Immunization Form for Student Health Services. Hope this helps!",
              "author": "MyKali",
              "created": 1624917812,
              "upvotes": 1,
              "replies": {
                "h3dg18k": {
                  "link": "/r/Emory/comments/o9tv8r/vaccination_form/h3dg18k/",
                  "text": "Also, is it much of a problem if I turn the form in later than its due date (which is in 3 days)? I heard that they would put a hold on my registration but we don’t register till august 9. My question is, would I still be in trouble when it comes to registration if I turn it in late although registration doesn’t happen for a month?",
                  "author": "sweetpeaches99",
                  "created": 1624918702,
                  "upvotes": 1,
                  "replies": {
                    "h3dgch3": {
                      "link": "/r/Emory/comments/o9tv8r/vaccination_form/h3dgch3/",
                      "text": "I don't think it would be a problem since your registration is so far away. I know I definitely felt rushed to get mine especially given all the other things you need to get ready. I would send an email letting them know after you submit yours to lower the risk of your hold being overlooked, and a follow-up email if you don't hear back.\n\nHowever, I don't work at their office so this is all speculation. It's just good practice to communicate your situation since we can't all meet our due dates every time.",
                      "author": "MyKali",
                      "created": 1624918849,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}