{
  "sid": "i6vijp",
  "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/",
  "title:": "What are some courses a freshman can take you’re super glad you took or were very interesting/inspiring/high quality?",
  "text": "I’ve got some free credits I can throw at interesting classes beyond the basic intro classes I need to do for my major.",
  "author": "colepsmithh",
  "created": 1597022877,
  "updated": 1634099200,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "g0ycwp3": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0ycwp3/",
      "text": "Not a freshman on my first year, I was a transfer. So I hope it's okay sharing what I thought were cool.\n\nI took CS 170 and I learned a lot. It might be too rough as a \"free credit\" class and it is truly a big chunk of your time with timesink assignments and quizzes every Friday that you *have* to keep up with. At the end of it, you'll have a thorough introduction to Java and you'll have some exposure to the computer science world. I ended up taking CS 171 and CS 224 right after before deciding CS wasn't worth mixing in with premed at the moment (maybe after).\n\nQTM 150 was on a similar vein, except way easier. You learn how to program in R and it's a 1-credit course. It's a two-course sequence with QTM 151 following it but I only took QTM 150. It'll only count for a QSS major but if you have space for one credit to specifically learn R then you might as well. If you need QTM 100 for your major, don't bother since you'll learn a bit of R there (not as focused, though).\n\nI also recommend ANT 101 since anthropology itself is very holistic and interdisciplinary. You might find something in that huge field that might interest you. Archaeology, linguistics, biology, and culture. Those are the four fields under the umbrella of anthropology, with hints of religion, sexuality, and psychology. On top of that, it's just a pretty chill course in general and fulfills the HSC requirement.",
      "author": "FearlessMelly",
      "created": 1597025786,
      "upvotes": 17,
      "replies": {
        "g0yftmn": {
          "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0yftmn/",
          "text": "Damn yo, you're definitely a fearless transfer. Do I even wanna know who and what else you took and plan to take at Emory? Legacy Emory students could learn from you lol",
          "author": "oldeaglenewute2022",
          "created": 1597027527,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g0ydz0d": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0ydz0d/",
      "text": "I would highly recommend classes in the Institute of Liberal Arts and the Interdisciplinary Studies program. I took a class in my Spring semester called IDS 220RW - ORDER Seminar. It stands for On Recent Development of Emory Researchers and the topic last year was what it means to be human. It’s taught by like 5 graduate instructors in different disciplines.",
      "author": "jackschnei",
      "created": 1597026433,
      "upvotes": 7,
      "replies": {
        "g0yfpic": {
          "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0yfpic/",
          "text": "sweet! So they still offer that!",
          "author": "oldeaglenewute2022",
          "created": 1597027458,
          "upvotes": 3,
          "replies": {}
        },
        "g0yxp2h": {
          "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0yxp2h/",
          "text": "The ILA rocks!",
          "author": "iapetus3141",
          "created": 1597040666,
          "upvotes": 3,
          "replies": {}
        },
        "g0zrnzc": {
          "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0zrnzc/",
          "text": "Do the topics change year by year like the 385 courses?",
          "author": "Dr_Yankee",
          "created": 1597067548,
          "upvotes": 2,
          "replies": {
            "g0zuc3l": {
              "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0zuc3l/",
              "text": "Yeah I’m pretty sure they do. I know the ORDER seminar is only taught in the Spring but the IDS department teaches really interesting courses in the Fall as well.",
              "author": "jackschnei",
              "created": 1597069068,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g0yk50p": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0yk50p/",
      "text": "Phil 111, a class that really made me think. It’s intro to existentialism, really enjoyed it.",
      "author": "SupahWalrus",
      "created": 1597030309,
      "upvotes": 7,
      "replies": {}
    },
    "g0ynvjh": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0ynvjh/",
      "text": "Take Sociology 101 with Tracy Scott. It’s a provocative class that will probably get you to consider the world in a different light. Also, it’s not super difficult. Professor Scott just gets it.",
      "author": "fnsus96",
      "created": 1597032858,
      "upvotes": 6,
      "replies": {
        "g0zstdj": {
          "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0zstdj/",
          "text": "Sonal Nalkur is also an excellent option as a sociology 101 professor. Knows her stuff, has a very interesting background, and is demanding in the right way while also being incredibly responsive to students and circumstances as a whole.",
          "author": "ruhdolph",
          "created": 1597068216,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g0yi83d": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0yi83d/",
      "text": "Something my sophomore advisors told me that I did: look at courses labeled 385. These are often changing topics and can be really interesting. What I did was look for classes 385 in subjects that were interesting to me but not needed for my major! And even though they are labeled 385, they often don't have pre-requisites nor are \\*too\\* challenging, but look at the syllabus before a/d/s ends to ensure you can handle the course load. I have also seen some labeled 285 as well that follow the same standards.",
      "author": "wut_it_is",
      "created": 1597029051,
      "upvotes": 6,
      "replies": {}
    },
    "g0ztmq8": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0ztmq8/",
      "text": "A couple people have recommended philosophy courses, and I'd also recommend introduction to ethics (PHIL 115). It's a tour of sorts through philosophers from Ancient Greece to modern day and their theories on what it means to live well or to have lived a good life. I had Professor Stuhr and would recommend him, but it was definitely intense - we had a 300 word paper due each class on the reading assignment that I really struggled with initially, but I feel has made me a much better reader and helped me focus my writing more. Overall a very interesting class that I personally benefitted from a lot - from what I've heard, other professors are less demanding.\n\nIntro to logic (PHIL 110) is also a valuable course that I just finished this summer - formal logic wasnt entirely my jam, but it was still pretty interesting stuff, and evaluating arguments and learning fallacies as part of being able to construct a better argument is definitely a valuable skill.",
      "author": "ruhdolph",
      "created": 1597068680,
      "upvotes": 5,
      "replies": {}
    },
    "g0zoh8s": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0zoh8s/",
      "text": "It has been almost 20 years since I was a freshman, but I would recommend an intro psychology class to anyone. It illuminated so many things, not just about how other people think, but about how I think. It changed my critical thinking ability immensely by teaching me about some of my implicit biases and the inherent flaws in how memory works.",
      "author": "s00words",
      "created": 1597065583,
      "upvotes": 5,
      "replies": {
        "g0zt1ao": {
          "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0zt1ao/",
          "text": "Yes, I echo this - I highly recommend either intro psych class (110 or 111). Personally 111 was my favorite class I took as a freshman.",
          "author": "ruhdolph",
          "created": 1597068342,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g0zsgw5": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0zsgw5/",
      "text": "Basic Problems in Philosophy was one of my all time favorite classes.\n\nAlso iirc Dr. Gough is teaching a 100 level religion course this fall. She was one of my favorite profs when I was in college.",
      "author": "TheThobes",
      "created": 1597068015,
      "upvotes": 3,
      "replies": {}
    },
    "g0zp9sd": {
      "link": "/r/Emory/comments/i6vijp/what_are_some_courses_a_freshman_can_take_youre/g0zp9sd/",
      "text": "I'd suggest taking some IDS classes or something in Comparative Literature. They have an interesting variety of oddly specific classes and I've really enjoyed every Comp Lit 389/389W class I've taken.",
      "author": "MintyLotus",
      "created": 1597066093,
      "upvotes": 2,
      "replies": {}
    }
  }
}