{
  "sid": "l9hqof",
  "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/",
  "title:": "Are social groups at Emory cliquey/segregated?",
  "text": "In terms of social groups, do you see certain cliques found on campus (ex. Asians hanging only with Asians, athletes with athletes, etc)? Are friend groups welcoming and diverse?",
  "author": "Internal_Glass4794",
  "created": 1612115954,
  "updated": 1634099144,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "gli341k": {
      "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/gli341k/",
      "text": "I feel like those mainly develop by year and interests(academic and other) if outside of Greeklife.  There is naturally some self-segregation.  Emory isn't a place with people that have transcended humanity, just a place with smart humans.  With that said, it makes sense that a significant portion of the self-segregation you may see is among international students which tend to come from concentrated clusters of cities and schools so may know each other already.  You'll see more diverse friend groups among \"domestics\".  \n\nAnd do not conflate more diverse friend groups with \"I will always see the diverse friend group sitting together at lunch or dinner\"(I know that when students visit schools they tend to make wild judgements about the makeup of friend groups based on what they see in a dining venue on that ONE specific day when there are so many factors determining who showed up at those tables that day) as there are, like I said before, affinity groups and orgs and of course culture of those groups may often be expressed through the food itself or the conversations had while eating. So no, Emory is not some perfectly harmonious multi-cultural mosaic but I suspect it is much better than a lot of similar schools when it comes to cross racial/demographic interactions and friendships. Hopefully others can volunteer an answer. They may agree or disagree.",
      "author": "oldeaglenewute2022",
      "created": 1612116467,
      "upvotes": 16,
      "replies": {
        "gli43qq": {
          "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/gli43qq/",
          "text": "I meant this question mainly in a racial/ethnic sense, as I went to a high school pretty segregated racially. I'm trying to expand my friend circle in college to meet people from different backgrounds, so I was just wondering if racially diverse friend groups exist even in historically monocultural environments like Greek life. Glad to hear that in your experience its better than other schools. Thanks so much for the response.",
          "author": "Internal_Glass4794",
          "created": 1612116906,
          "upvotes": 5,
          "replies": {
            "gli4o9w": {
              "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/gli4o9w/",
              "text": "I know what you meant and it is pretty easy at Emory to do that especially outside of Greeklife. I'm just saying don't expect perfection and don't form any judgements about how easy or hard it is based upon what you may see at dining venues if you ever get to visit or on your first few days there. It may not be representative.",
              "author": "oldeaglenewute2022",
              "created": 1612117160,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gli2mz6": {
      "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/gli2mz6/",
      "text": "To some extent yes. That being said, most friend groups are very diverse",
      "author": "iapetus3141",
      "created": 1612116251,
      "upvotes": 4,
      "replies": {
        "gli2zjk": {
          "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/gli2zjk/",
          "text": "What about diversity in Greek life?",
          "author": "Internal_Glass4794",
          "created": 1612116411,
          "upvotes": 2,
          "replies": {
            "gli4e3l": {
              "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/gli4e3l/",
              "text": "Greeklife is Greeklife...Emory isn't but so special there.  Let us keep it real. Even if it is \"diverse\" racially more so than other schools it is probably a sort of monoculture.  If you want more diversity and a Greek like org, then you may wanna keep an open mind and consider the mulicultural social orgs. (some which use Greek letters). You should keep in mind that National chapters often have a role in shaping the culture of particular Greek orgs. The actual school's vibe can only influence that space but so much.",
              "author": "oldeaglenewute2022",
              "created": 1612117033,
              "upvotes": 7,
              "replies": {
                "glp6987": {
                  "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/glp6987/",
                  "text": "Wait i want to clarify all the MGCs have greek letters. We are considered social frats and sororities, no less than EPC and IFC.",
                  "author": "Worldlover67",
                  "created": 1612244005,
                  "upvotes": 1,
                  "replies": {
                    "glp8qvy": {
                      "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/glp8qvy/",
                      "text": "What are Nambika(sp?) and them considered?  I am including them which is why I didn't say multicultural greek orgs. I only said multicultural orgs because some of the others give off a Greek like feel or even seem to have a relationship with MGCs that cater to the same affinity group.  There are multiple venues to participate in those types of social scenes or more tightnight social circles if you want more authentically diverse groups.is my point I guess. Doesn't have to be(or attempt to mimic too closely) any type of \"Greek\" necessarily.\n\nSome may also want to consider themed housing that may cater to certain demographic groups (like BSA when offered and a couple of others I forget)",
                      "author": "oldeaglenewute2022",
                      "created": 1612245695,
                      "upvotes": 1,
                      "replies": {
                        "glr6cyg": {
                          "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/glr6cyg/",
                          "text": "Ahhh i see, you are using social in the broad sense. I was interpreting \"social\" as the fraternal and sorority sense, especially because a lot of EPC and IFC people don't consider MGC 'real' frats and sororities for some reason, which is why I wanted to clarify that MGC is Greek.\n\nI would just consider those cultural orgs. That is true, some do give off a greek life feel, but so do many clubs that are not cultural based (like frisbee).",
                          "author": "Worldlover67",
                          "created": 1612286362,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gliawye": {
              "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/gliawye/",
              "text": "IFC and EPC are pretty standard, kind of what you'd expect. Emory does have NPHC and MGC (Multicultural Greek Council), and within MGC the orgs are more diverse and have specific interest groups (I am in an MGC organization).",
              "author": "incognitoshadow",
              "created": 1612119992,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "glm411n": {
      "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/glm411n/",
      "text": "normally yes they are kind of cliquish. that being said, COVID has changed everything. most of the old friend groups in my class (2023) barely talk to one another anymore because soon we will have spent more time at home online than in normal college. when we get back in the fall (knock on wood) things will be radically different on that front i feel.",
      "author": "jackschnei",
      "created": 1612195839,
      "upvotes": 2,
      "replies": {}
    },
    "gljty8p": {
      "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/gljty8p/",
      "text": "I've seen friend groups with only asian students walking around or eating together - massive groups too, I'm sure they're perfectly nice people but they're intimidating as hell. Jewish kids that go to jewish events tend to stick together as well.",
      "author": "decafoatmilklatte",
      "created": 1612145954,
      "upvotes": 2,
      "replies": {
        "glk30to": {
          "link": "/r/Emory/comments/l9hqof/are_social_groups_at_emory_cliqueysegregated/glk30to/",
          "text": "intimidating? I guess we should be intimidated when we see a bunch of white folks together too. Given the recent events, as normal as that is in the U.S., that would make more sense but okay about Asians and Jewish (which are mostly white) people I guess...weird.",
          "author": "oldeaglenewute2022",
          "created": 1612150334,
          "upvotes": 12,
          "replies": {}
        }
      }
    }
  }
}