{
  "sid": "qctqd0",
  "link": "/r/Emory/comments/qctqd0/multivariable_calculus_or_linear_algebra_next/",
  "title:": "Multivariable calculus or linear algebra next semester",
  "text": "I plan on taking both at my time at Emory. However, I do not know which to take first (is linear algebra helpful for multivariable calculus?). I also want to take PHYS 151 next year in the fall. Is multivariable calculus helpful for that class? Further to that, the rate my professor for the multivariable calculus professor next semester is a little scary. Is the class really that bad? Or is it just something I have to take with a grain of salt?",
  "author": "Extension_Radish_714",
  "created": 1634828402,
  "updated": 1634849739,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhi7932": {
      "link": "/r/Emory/comments/qctqd0/multivariable_calculus_or_linear_algebra_next/hhi7932/",
      "text": "Multi variable calculus is very vector based. Linear is helpful, but by no means necessary. Honestly, multi gives you a good basis for understanding how to go through math classes. \n\nPhys 151 requires no multivariable calculus apparent from maybe 1 or two partial derivatives (very simple ones). Multi is not required for any physics classes until 220.",
      "author": "Interesting_Fold_485",
      "created": 1634832470,
      "upvotes": 2,
      "replies": {
        "hhi83ai": {
          "link": "/r/Emory/comments/qctqd0/multivariable_calculus_or_linear_algebra_next/hhi83ai/",
          "text": "Thanks! So I should be fine with whichever I take then? The multivariable timings work a  better than the linear algebra timings, which is why I wasn't sure which I should pick.",
          "author": "Extension_Radish_714",
          "created": 1634832811,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhicutd": {
      "link": "/r/Emory/comments/qctqd0/multivariable_calculus_or_linear_algebra_next/hhicutd/",
      "text": "As the other person said, multi is helpful but not needed for 151, and you won't use linear at all. However, the linear algebra formalism is very important in learning multivariate calculus. So, I would recommend that you take linear, and then multi, and make your choice of when to take 151 independently",
      "author": "iapetus3141",
      "created": 1634834685,
      "upvotes": 2,
      "replies": {
        "hhis56f": {
          "link": "/r/Emory/comments/qctqd0/multivariable_calculus_or_linear_algebra_next/hhis56f/",
          "text": "Thanks for the insight!",
          "author": "Extension_Radish_714",
          "created": 1634840810,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhin8fs": {
      "link": "/r/Emory/comments/qctqd0/multivariable_calculus_or_linear_algebra_next/hhin8fs/",
      "text": "Taking multi rn and took linear before at a different college. There is overlap, but not very much so there’s a very small negligible benefit to taking it in sequence. Also, taking the class with yelton right now. He’s a very nice man, just don’t think he’s cut out to be a professor, nor do I think that’s what he ultimately wants to do. He just teaches so incredibly slowly and is a dry lecturer. Content for multi is fine.",
      "author": "hollistheokay",
      "created": 1634838812,
      "upvotes": 2,
      "replies": {
        "hhis6zn": {
          "link": "/r/Emory/comments/qctqd0/multivariable_calculus_or_linear_algebra_next/hhis6zn/",
          "text": "I see... thanks so much! This was really helpful!",
          "author": "Extension_Radish_714",
          "created": 1634840830,
          "upvotes": 1,
          "replies": {}
        },
        "hhivxy5": {
          "link": "/r/Emory/comments/qctqd0/multivariable_calculus_or_linear_algebra_next/hhivxy5/",
          "text": "I had another question. If the professor is as you describe him to be, do you think I will feel the effects of not having taken linear algebra before? Did he assume everyone already knew the overlapping parts, or did he do a good job at explaining them for people who had not taken linear algebra?",
          "author": "Extension_Radish_714",
          "created": 1634842339,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}