{
  "sid": "iwnd8b",
  "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/",
  "title:": "Foreign Language Requirement?",
  "text": "If I took a foreign language in HS but want to kind of “re-start” it at a beginner level is that acceptable?  \n\nOr do I have to pick a new language?",
  "author": "WiseOwl2020",
  "created": 1600639589,
  "updated": 1634099227,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 0.92,
  "comments": {
    "g61n6y1": {
      "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g61n6y1/",
      "text": "If you want to start a new language, that’s enouraged! But as the above commenter said, if you intentionally fail the placement test and the professor suspects that to be the case, it is an honor code violation. Punishments for honor code violations are steep, with the mildest standard punishment being an F in the course.",
      "author": "j11234567890",
      "created": 1600644605,
      "upvotes": 14,
      "replies": {
        "g61qdv7": {
          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g61qdv7/",
          "text": "I think the mildest sanction I've seen is a 0 on an assignment.",
          "author": "iapetus3141",
          "created": 1600646498,
          "upvotes": 4,
          "replies": {}
        },
        "g62xutt": {
          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g62xutt/",
          "text": "wait I took the language placement test and was assigned in chn102, can I retake it before semester 2 starts and (if I do better) get placed in another class and start from there?",
          "author": "Jazzlike_Confidence1",
          "created": 1600678318,
          "upvotes": 3,
          "replies": {}
        },
        "g63u2n8": {
          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g63u2n8/",
          "text": "How would they even prove that someone failed it on purpose? I know a lot of people who passed AP Spanish but definitely don't speak Spanish as well as they should",
          "author": null,
          "created": 1600698883,
          "upvotes": 1,
          "replies": {
            "g644w2h": {
              "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g644w2h/",
              "text": "They wouldn’t do it based off the classes you’ve taken. If you walk into SPAN 101 and start speaking like you’ve taken 7 years of spanish before, they’ll be suspicious lol. Just do your best with the placement test and you’ll be fine.",
              "author": "j11234567890",
              "created": 1600703535,
              "upvotes": 3,
              "replies": {
                "g645zj8": {
                  "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g645zj8/",
                  "text": "Some departments don't even care tbh I took heritage Chinese (CHN103 I think?) and the class was a mix of people who spoke zero Mandarin, people who could read but not speak, people who can speak but not read, international students looking for an easy A, and random Americans who tested into CHN 201 (or whateve the sophomore year class is numbered as) but didn't get off the waitlist.",
                  "author": null,
                  "created": 1600703992,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g61fcc6": {
      "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g61fcc6/",
      "text": "Took Spanish for three years in high school. First-year at Emory taking Japanese 101. It's completely acceptable to switch languages.",
      "author": "OliGotham",
      "created": 1600641078,
      "upvotes": 6,
      "replies": {
        "g61gy1c": {
          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g61gy1c/",
          "text": "I may have read your question wrong...  \nMost languages require placement tests. Specifically performing worse on them than your current skill level is a violation of the honor code.",
          "author": "OliGotham",
          "created": 1600641682,
          "upvotes": 6,
          "replies": {
            "g6335dk": {
              "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g6335dk/",
              "text": "Thanks! I am pretty sure I would honestly place in 2nd semester.  I know the basics, but I’m just not naturally good at languages and want more practice.",
              "author": "WiseOwl2020",
              "created": 1600683972,
              "upvotes": 2,
              "replies": {
                "g63xb9m": {
                  "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g63xb9m/",
                  "text": "You do realize that you can be not \"naturally good\" at anything and that you can still develop well in it by doing practice from the course at the level you actually place as long as it isn't way too high/over your head.  The tests are meant to be pretty good at matching students to the level they'll learn the best and get the most out of.  I'm sure even at Emory, new languages do not come \"naturally\" to most or many people. Most language instructors are quite fair and run classes at an accessible pace and caliber that matches your experience/ability.  \n\nAgain, just take the placement test and see what happens. You are allowed to go and get a taste for the class you place into and then decide whether or not to negotiate down. I doubt there is a need to just avoid the correct level altogether based on some perceived natural or lack of natural ability. I really wouldn't fear this requirement and your placement this much.  It will be okay if you feel out where you actually place and figure things out from there.",
                  "author": "oldeaglenewute2022",
                  "created": 1600700330,
                  "upvotes": 1,
                  "replies": {
                    "g6411vg": {
                      "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g6411vg/",
                      "text": "Thank you!",
                      "author": "WiseOwl2020",
                      "created": 1600701933,
                      "upvotes": 1,
                      "replies": {
                        "g642spt": {
                          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g642spt/",
                          "text": "Yeah I just have to say that because I don't know if you are a freshman or not, but it seems like too many freshmen are holding on to this \"natural ability\" stuff (saw it in the qtm 150/drop the class thread where they were clearly freaking out because material wasn't coming the easiest after only 3 weeks in when they actually had no experience with the topics) where they have to have the course feel so easy/not demanding that they convince themselves they have \"natural ability\" or whatever. I'm not denying that it exists for some things but I wouldn't let a lack of it stop you from trying things outside of your comfort zone, accelerating if you are experienced at something, or taking something you know might challenge you every now and again. Everything isn't supposed to feel easy or natural. If it does at a place like Emory you may not be learning as much as you are supposed to or at rye right level.",
                          "author": "oldeaglenewute2022",
                          "created": 1600702664,
                          "upvotes": 2,
                          "replies": {
                            "g70btqt": {
                              "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g70btqt/",
                              "text": "Thank you!",
                              "author": "WiseOwl2020",
                              "created": 1601337357,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g61p9i9": {
      "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g61p9i9/",
      "text": "Hmm I wanna know this too...took 3 years of Korean and absolutely didn’t learn a thing despite decent grades. Would that be suspicious if I fail the placement test?",
      "author": null,
      "created": 1600645832,
      "upvotes": 6,
      "replies": {
        "g61wgf3": {
          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g61wgf3/",
          "text": "If you dont know, you dont know. Who cares if its suspicious or not. They cant really prove anything. If you genuinely belong in and get placed in a level 1 course, youre okay!",
          "author": "luckyluckyduck",
          "created": 1600650012,
          "upvotes": 5,
          "replies": {}
        },
        "g61wk16": {
          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g61wk16/",
          "text": "Man...just do the best you can on it and you could probably start at at least 200 level and do fine. Even if you \"fail\"(please don't do it on purpose. Take it sincerely, get your placement, go to the class you placed into and feel out if you are comfortable.  If not, discuss options with the instructor) they may place you there. You likely did learn at least something and if you truly didn't over a 3 year period you need to consider if you even like it enough to continue with that language.  The freedom of college to explore is your friend!\n\nYou may wanna consider starting with a new one you think is worth learning one instead of starting over with one where you made good grades, but supposedly didn't learn much. The whole purpose of the requirement is to learn something. I'm not sure if restarting Korean at Emory will facilitate learning something that you supposedly got nothing out of over a 3 year period in a single year.",
          "author": "oldeaglenewute2022",
          "created": 1600650070,
          "upvotes": 5,
          "replies": {
            "g61wktd": {
              "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g61wktd/",
              "text": "Hi not sure if restarting Korean at Emory will facilitate learning something that you supposedly got nothing out of over a 3 year period in a single year, I'm Dad👨",
              "author": "dadbot_2",
              "created": 1600650083,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "g623n0l": {
      "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g623n0l/",
      "text": "All you have to do is email them when u get the email talking about where they placed u and asked to be moved down, multiple ppl I know did that cus they weren't confident enough to go into the higher level right off the bat.",
      "author": "Artist552001",
      "created": 1600654171,
      "upvotes": 6,
      "replies": {
        "g6338jw": {
          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g6338jw/",
          "text": "Thanks!",
          "author": "WiseOwl2020",
          "created": 1600684033,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g64cawf": {
      "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g64cawf/",
      "text": "Lmao fail the test, no one will know. The Chinese kids at school take into level Mandarin and breeze-by. Don't be a fool.",
      "author": "momo1534",
      "created": 1600706696,
      "upvotes": 2,
      "replies": {}
    },
    "g63jwai": {
      "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g63jwai/",
      "text": "Maybe there is a review you could do before you take the class?",
      "author": "Free-Nail-1682",
      "created": 1600694021,
      "upvotes": 1,
      "replies": {
        "g63mh90": {
          "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g63mh90/",
          "text": "Why bother asking? lol To me it seems as if there are reasons they'd rather just place in the 100 level and start over with the same language and it isn't because they've literally forgot everything.",
          "author": "oldeaglenewute2022",
          "created": 1600695350,
          "upvotes": 1,
          "replies": {
            "g63mlhu": {
              "link": "/r/Emory/comments/iwnd8b/foreign_language_requirement/g63mlhu/",
              "text": "good point",
              "author": "Free-Nail-1682",
              "created": 1600695412,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}