{
  "sid": "axffc2",
  "link": "/r/Emory/comments/axffc2/grad_student_housing/",
  "title:": "Grad Student Housing",
  "text": "Hey, y'all!\n\nI just got into Emory for law school, and I'm really considering it! Unfortunately, I've never been to Atlanta, so I have no experience with the city. I'll be visiting the city and school in the coming weeks, but I wanted to get an idea as to which neighborhoods Emory grad students typically stay at.\n\nLemme know if any neighborhoods or apartment complexes fit the bill, so I can visit them when I come into town. Also, if you have any recs as far restaurants, bars, nightlife, etc. to check out while in town, please let me know!\n\nThanks, in advance!",
  "author": null,
  "created": 1551750370,
  "updated": 1634098784,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.94,
  "comments": {
    "ehtcod0": {
      "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtcod0/",
      "text": "I think Highland Lakes is pretty convenient! There is also places near Emory Point as well. Also on Briarcliff Rd, theres many houses and apartments that I heard people check out. If you will have a car, it’s definitely worth checking out! For food/restaurants, there are plenty of brunch places in ATL along with great coffeeshops! Good food in midtown, Buford Highway, and buckhead areas! ",
      "author": "eat-my-dust-",
      "created": 1551754379,
      "upvotes": 4,
      "replies": {
        "ehtkmhq": {
          "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtkmhq/",
          "text": "[deleted]",
          "author": null,
          "created": 1551762126,
          "upvotes": 1,
          "replies": {
            "ehtovq3": {
              "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtovq3/",
              "text": "To be honest, I’m not too sure but I don’t think so. On campus housing gets really packed from undergraduate students. ",
              "author": "eat-my-dust-",
              "created": 1551766826,
              "upvotes": 3,
              "replies": {
                "ehtp4t6": {
                  "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtp4t6/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1551767138,
                  "upvotes": 1,
                  "replies": {
                    "ehtpm51": {
                      "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtpm51/",
                      "text": "I would still maybe email Emory Housing and ask. If not, you can probably find some AirBnb stuff nearby! ",
                      "author": "eat-my-dust-",
                      "created": 1551767760,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ek8cmv2": {
              "link": "/r/Emory/comments/axffc2/grad_student_housing/ek8cmv2/",
              "text": "The school has temporary housing in the dorms that they use for visiting scholars or people who need short term housing. I THINK you might have to stay for a full month. Also, your department would have to \"sponsor\" you. Overall, not a practical solution and not likely to happen\n\nMost of the department administrators have lists of apartment buildings that will let you know average cost and if they have a direct bus to Emory.  You could ask around for an updated list.",
              "author": "mysticember1079",
              "created": 1554529078,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ehtlec4": {
          "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtlec4/",
          "text": "Would you say a car is necessary or not? Thanks for the information, by the way! ",
          "author": null,
          "created": 1551762942,
          "upvotes": 1,
          "replies": {
            "ehtqcp8": {
              "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtqcp8/",
              "text": "Car is necessary to have a decent quality of life, not much is in walking distant. You can get away with public transit, but its awful. I recommend looking for an apartment Harwood, parking is usually included, and it is also within walking distance of campus. Also a lot less undergrads live there, its mostly grad students and professionals, so you could actually get a good night sleep instead of having loud ass neighbors.",
              "author": "EmoryThrowaway6969",
              "created": 1551768753,
              "upvotes": 7,
              "replies": {
                "ehu36f9": {
                  "link": "/r/Emory/comments/axffc2/grad_student_housing/ehu36f9/",
                  "text": "Harwood is a good suggestion. \n\nTransit isn’t awful everywhere in Atlanta. If you live along the #6 bus line, you’re good to go. It’s one of the best buses in town. Also, the 36 and 316 lines come through Emory—they both take you to the places you’d most want to go in town. \n\nFor everything else, there’s Uber. Cheap as hell most of the time. \n\nLastly, keep in mind the Emory shuttles. They may open up other possibilities for living. http://transportation.emory.edu/shuttles/\n\n\nAnyway, I think especially if you live near Clifton, a car is really not a necessity. \n\n",
                  "author": "IKilledLauraPalmer",
                  "created": 1551788921,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "ehtoxzu": {
              "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtoxzu/",
              "text": "I don’t think its necessary but I do think it’s convenient in ATL. The public transportation isn’t that good and many places are spread out. But you can definitely Uber, or Lime/Bird from places . ",
              "author": "eat-my-dust-",
              "created": 1551766904,
              "upvotes": 2,
              "replies": {
                "ehtqgmz": {
                  "link": "/r/Emory/comments/axffc2/grad_student_housing/ehtqgmz/",
                  "text": "Does anyone over the age of 22 actually use those scooters?  I saw I guy on one those get hit by a car in downtown decatur, yeah I'm not riding one of those death traps.",
                  "author": "EmoryThrowaway6969",
                  "created": 1551768908,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ehueugo": {
      "link": "/r/Emory/comments/axffc2/grad_student_housing/ehueugo/",
      "text": "Dont do Highland Lake. So many maintenance and front office problems. Overpriced for what you get.\n\nEmory Point is also a bit overpriced but it's good if you don't have a car and are willing to spend a bit more. \n\nGables Rocksprings I highly recommend. Very very affordable (as low as $1200/month for a two bedroom), 1.5 miles from the law school which is only a 30 minute walk. Also close to the briarcliff campus where a shuttle picks up and drops off.\n\nHighland Square isn't too bad and about the same distance as Rock Springs. More expensive though.\n\nCampus Crossings Briarcliffe is good if you don't have a car since it's right next to a Kroger and has a shuttle stop right outside.",
      "author": "EfficientJellyfish",
      "created": 1551799345,
      "upvotes": 3,
      "replies": {
        "ehvwtcq": {
          "link": "/r/Emory/comments/axffc2/grad_student_housing/ehvwtcq/",
          "text": "Is that $1200 a month per unit, or per bedroom?",
          "author": "phraps",
          "created": 1551836605,
          "upvotes": 1,
          "replies": {
            "ehvx4b2": {
              "link": "/r/Emory/comments/axffc2/grad_student_housing/ehvx4b2/",
              "text": "per unit. That's on the low end but even the more expensive ones are only going to be between 600 and like 850 per bedroom",
              "author": "EfficientJellyfish",
              "created": 1551836836,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ehvqqmi": {
      "link": "/r/Emory/comments/axffc2/grad_student_housing/ehvqqmi/",
      "text": "I lived in Highland Lake and fully agree that it’s not worth the price to live there. Management was awful. People seemed to be happier with Gables, etc. Most anywhere you’ll need a car or you’ll feel rather inconvenienced waiting for the bus system. \n\nMy favorite restaurants are Taqueria del Sol in Decatur and Mary Macs Tea Room. Ponce City Market is a great place to hang out and walk the Beltline Trail! ",
      "author": "tumblrmustbedown",
      "created": 1551831843,
      "upvotes": 1,
      "replies": {}
    }
  }
}