{
  "sid": "mqfr98",
  "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/",
  "title:": "WAITLIST ADVICE! pls help",
  "text": "Hello! I have been waitlisted at a few schools, and I really really really want to get off the waitlist into Emory University. I was also waitlisted at Duke, Georgetown, and Dartmouth (three terrific schools but I wanna go to Emory ya feel me?). I have been grinding to maximize my chances to get into Emory, and I know that my stats, extracurriculars, etc. are good enough for the school. Here is what I've done so far:\n\n1. Wrote a banger LOCI\n2. Reached out to the top economics professor and was able to meet and talk with him (i wrote about this in the LOCI)\n3. Going to submit another teacher rec (not sure if this'll really help so let me know if this is a good idea)\n\nI've gone quite above and beyond, but I would just like to ask if anyone has any other ideas that I could maybe consider to help my chances. But if you guys think this is already enough (which my friends have said), just let me know haha!\n\nThank you!",
  "author": "insanepotato3",
  "created": 1618361741,
  "updated": 1634098545,
  "over_18": false,
  "upvotes": 18,
  "upvote_ratio": 0.95,
  "comments": {
    "gug0jc3": {
      "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/gug0jc3/",
      "text": "Ur a mile ahead everyone if you literally contacted a prof. Ur set man. Just wait for that thicc email",
      "author": "ELON_MUSK_69420_",
      "created": 1618367437,
      "upvotes": 21,
      "replies": {}
    },
    "gugfewn": {
      "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/gugfewn/",
      "text": "You’re chillin welcome to Emory",
      "author": "PsychologicalGlass1",
      "created": 1618376754,
      "upvotes": 4,
      "replies": {
        "guhbxu6": {
          "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/guhbxu6/",
          "text": "Haha I wish!",
          "author": "insanepotato3",
          "created": 1618404161,
          "upvotes": 2,
          "replies": {
            "guirmq1": {
              "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/guirmq1/",
              "text": "It’s no guarantee ig but if your grades and scores and stuff are good and they have to pull from the waitlist I don’t see how they don’t pick you",
              "author": "PsychologicalGlass1",
              "created": 1618427637,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gug4t1s": {
      "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/gug4t1s/",
      "text": "i think maybe speak to your counselor beforehand but i’ve heard of calling the admin office about where you are more or less on the waitlist. maybe give that a try? \n\ndon’t take my word as fact tho, just something i’ve heard.",
      "author": "k1tty_",
      "created": 1618369835,
      "upvotes": 3,
      "replies": {
        "guhc1rd": {
          "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/guhc1rd/",
          "text": "The professor I contacted actually is going to reach out to admissions and scope out my chances. Should be a very good sign to the AO if a professor asks about a student right?",
          "author": "insanepotato3",
          "created": 1618404224,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "guhqdt6": {
      "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/guhqdt6/",
      "text": "Perhaps you already did this in your \"banger LOCI\" but it often helps if your LOCI includes some indication that you understand that most finaid will have already been distributed and that this will not preclude your attendance should you be admitted. Obviously if you'd need substantial aid to attend, don't lie.",
      "author": "FlowersBloomUntil",
      "created": 1618411370,
      "upvotes": 2,
      "replies": {
        "gui1qcb": {
          "link": "/r/Emory/comments/mqfr98/waitlist_advice_pls_help/gui1qcb/",
          "text": "I wish I could say that, but I definitely can't pay 70k to go to Emory.",
          "author": "insanepotato3",
          "created": 1618416330,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}