{
  "sid": "phyn2h",
  "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/",
  "title:": "Chances of Admissions (stressed out)",
  "text": "Reddit, I hated to do this because it sets myself up to the hands of people’s opinions, but I’m literally losing sleep by not knowing. So thanks for reading this to help me out.\n\n—\nI’m a senior in a pretty competitive highschool, Emory knows my school well because of its rigor.\nI have a cumulative 3.37GPA, because my 9th grade GPA was 2.7. I took a few honors and 3 APs including this year - aiming for a 4.0 on my last year. I worked on my academics after facing a momentous lifechanging situation after 9th grade. At 9th grade, I created an online biz and made 38k in revenue, 4k in profit\n\nI have served in various nonprofits, performed in school musical, play on varsity team, yet never really got a leadership position. In short, I tried everything and got involved, yet not super involved because I am realizing I have some problems trusting people my age. (It’s hard for me to make friends, and it bothered me a lot before, but I learned how to love myself as who I am now) \nWhy do I still get involved? I get involved because I love learning, and I truly want to make the world spin faster as one of my mentor puts it.\n\nFor my test scores, it’s sitting at a 1250-1300.\nI am aiming for a 1500 SAT, next one in October.\n\nHow does this sound to you? Do you know anyone who was in the same situation in Highschool too?\n\nThanks and much love 🙏",
  "author": "vincentloveschu",
  "created": 1630786007,
  "updated": 1634096920,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.32,
  "comments": {
    "hbm0v43": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbm0v43/",
      "text": "You need to go for a walk or something and realize that no one here can answer your questions with any certainty because we aren’t the admissions officers who will review your application. Please, calm down.",
      "author": "PubliusSiliusLinus",
      "created": 1630788779,
      "upvotes": 26,
      "replies": {}
    },
    "hbm3wy4": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbm3wy4/",
      "text": "Doesn't matter how it sounds to us.  We're not adcoms and you need not look to us for empty validation or invalidation to calm your nerves. Do what the other commenter said and then do the best you can with the stats, tell a good story and show solid thinking in your personal statement and supplements and submit the damned application and see what happens.   There is no reason to panic.  Do the best you can. You'll get into some places and not into others and then you'll enroll somewhere and turn out well I'm betting.\n\nHell assuming that most students at these types of schools are somewhat humble and have a head not in the clouds, admits might not even fully understand why they were admitted over others who looked similar or better on paper or on actual substance and if their head isn't full of air, they should get that a lot of luck and things completely out of their control is involved. There is hardly certainty in this process even for candidates with the highest stats and there is nothing anyone can do about this stuff but get the best app they can in when the application volume is so high.",
      "author": "oldeaglenewute2022",
      "created": 1630790183,
      "upvotes": 18,
      "replies": {}
    },
    "hbmnehz": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbmnehz/",
      "text": "Just apply bruh and don’t worry about it. Control what you can and let go of what you can’t.",
      "author": "Hammerbro_64",
      "created": 1630799771,
      "upvotes": 5,
      "replies": {}
    },
    "hbmg4pw": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbmg4pw/",
      "text": "Be sure to write about your biz and life to set your application apart. Make sure you state what skills you bring, and why you want Emory. \n\nAre you wanting a business degree? \n\nLike others are saying, you will get in somewhere and have a great life so don't worry!",
      "author": "crusheratl",
      "created": 1630796035,
      "upvotes": 4,
      "replies": {}
    },
    "hbm7doc": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbm7doc/",
      "text": "I’m ngl to you. Just based on pure admit stats and anecdotal evidence of people I’ve talked to, your stats are unfortunately on the lower end by quite a bit. However there are some people who I’ve met who definitely were fairly different from the average and activities they did helped them get in. If you’re at one of those Ivy feeder schools you might have a chance but 3.37 is definitely pretty low especially without a high test score. What could work in your favor is your turnaround but even with that you have managed but even with that you’ve probably managed like a 3.7. It’s definitely not bad but even that is barely like the 25th  percentile. I can’t say what your chances are but just what I know. Honestly a 1500 won’t really make you stand out at all. In fact I believe for the class of 2025 the average SAT was above 1500 something like 1510-1520 is the average admit. I’ve met way too many people with 1550+. So if you really want to stand out you’ll probably need like 1570-1580 tbh if you’re using your SAT to cover your GPA",
      "author": "Puzzleheaded-Ad8631",
      "created": 1630791807,
      "upvotes": 7,
      "replies": {}
    },
    "hbmmp78": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbmmp78/",
      "text": "Hi,\nJust an FYI, Emory does not consider your freshman year GPA! Not sure how much that changes your outlook, but I had a somewhat similar situation, where my GPA grew sharply over my four years in high school. I wish you the best of luck, though, and congrats on the online business!\n\nJust curious, what kind of online business were you running? 34k in costs seems kinda rough.",
      "author": "valiantseal",
      "created": 1630799406,
      "upvotes": 4,
      "replies": {
        "hbnwj9d": {
          "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbnwj9d/",
          "text": "I had no idea they didn’t consider your freshman year gpa, does it say that on the website or somewhere. Not that I don’t believe you I’m just curious.",
          "author": "Squami11",
          "created": 1630827495,
          "upvotes": 3,
          "replies": {
            "hbnz481": {
              "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbnz481/",
              "text": "You can do your own research but here are the first two results from Google:\n\nhttps://talk.collegeconfidential.com/t/how-to-calculate-gpa-for-emory/1767522\n\nhttps://nypost.com/2020/09/12/colleges-reveal-the-secret-formula-for-deciding-who-gets-in/\n\nI remembered it from the info session because I thought it what kind of whacky lol",
              "author": "valiantseal",
              "created": 1630829707,
              "upvotes": 3,
              "replies": {
                "hbpks12": {
                  "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbpks12/",
                  "text": "so if my freshman year gpa is not considered, does that mean when they re calculate my gpa, it will boost up? i mean, they are taking off a whole freshman year gpa....",
                  "author": "Straight_Trust6877",
                  "created": 1630863647,
                  "upvotes": 1,
                  "replies": {
                    "hbpkufm": {
                      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbpkufm/",
                      "text": "Exactly.",
                      "author": "valiantseal",
                      "created": 1630863678,
                      "upvotes": 2,
                      "replies": {
                        "hbpl251": {
                          "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbpl251/",
                          "text": "damn thats great!!!",
                          "author": "Straight_Trust6877",
                          "created": 1630863772,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hbon3vp": {
          "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbon3vp/",
          "text": "It was dropshipping, it was rough, ain’t the best model :)",
          "author": "vincentloveschu",
          "created": 1630848315,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hbnfjzr": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbnfjzr/",
      "text": "Literally chill dude. This whole process is meaningless and no one in the real world cares where you got your degree from outside caring somewhat for employment purposes. \n\nYou’ll be fine. You sound like a driven kid. Apply to places now but don’t think your life is over if this doesn’t go well. Do well in college, consider transferring if you want to (freshman year college grades matter more in transferring but also do well on the SAT) or just do really well where you go. The experiences you become involved with in uni matter more than where you go. Like I said before, this period of your life really doesn’t a ton even though it might be hard for you to see it that way now.",
      "author": "LostWindSpirit",
      "created": 1630814931,
      "upvotes": 2,
      "replies": {}
    },
    "hbonc12": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbonc12/",
      "text": "Thank you all for the comments, you don’t know how much this helped ❤️ Will definitely take each word to my heart and just give it all",
      "author": "vincentloveschu",
      "created": 1630848436,
      "upvotes": 2,
      "replies": {}
    },
    "hbp3uzg": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbp3uzg/",
      "text": "Like some of the comments here, if I were you, I’d calm down. Like I don’t mean this in a bad way, but all of us don’t know how we got in. And honestly, you really shouldn’t worry, because if Emory is your dream school just remember that transferring is always an option :)",
      "author": "FinnanuTt9820",
      "created": 1630856183,
      "upvotes": 2,
      "replies": {}
    },
    "hd1t3wa": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hd1t3wa/",
      "text": "emory grad here (2020)! I got in over a lot of people at my high school who had higher grades and test scores than me. I felt like emory actually looked at who I was as a person before admitting me. \n\nand if you don't get in ... I was rejected from my ED school and was devastated. turns out it was the best thing that ever happened to me. you'll end up where you're meant to be.",
      "author": "Ill-Musician9878",
      "created": 1631773870,
      "upvotes": 1,
      "replies": {}
    },
    "hbphfut": {
      "link": "/r/Emory/comments/phyn2h/chances_of_admissions_stressed_out/hbphfut/",
      "text": "The fact that your stressed means you know your chances, apply to safeties that you like and relax. It will work out in the end.",
      "author": "91210toATL",
      "created": 1630862177,
      "upvotes": 0,
      "replies": {}
    }
  }
}