{
  "sid": "nr4vkm",
  "link": "/r/Emory/comments/nr4vkm/math_requirements_for_bio_major/",
  "title:": "Math requirements for bio major",
  "text": "Can any bio majors here let me know if they took math 111 or math 116 for their major requirements ? The website says that we can take 7 classes from other science and math departments. I’m probably just going to fulfill that requirement with physics 142 and chem 204 anyways since I’m pre med. but are the math credits (like calc) still required for bio major??",
  "author": "ihateusomuchemory",
  "created": 1622694677,
  "updated": 1634098016,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "h0f7hlv": {
      "link": "/r/Emory/comments/nr4vkm/math_requirements_for_bio_major/h0f7hlv/",
      "text": "The document I put in this thread has all this info: https://www.reddit.com/r/Emory/comments/npyddc/interested_in_bio_major_but_confused_about/?utm_medium=android_app&utm_source=share\n\nWere you unable to open it or is something weird going on here?",
      "author": "oldeaglenewute2022",
      "created": 1622715091,
      "upvotes": 3,
      "replies": {
        "h0i7pq5": {
          "link": "/r/Emory/comments/nr4vkm/math_requirements_for_bio_major/h0i7pq5/",
          "text": "I'm not OP but I've been looking through this sub a ton and you've been extremely helpful with all of your contributions, so thanks a lot! Some of this stuff can be super confusing but you're always able to make it very clear.",
          "author": "valiantseal",
          "created": 1622765341,
          "upvotes": 1,
          "replies": {
            "h0i8dvl": {
              "link": "/r/Emory/comments/nr4vkm/math_requirements_for_bio_major/h0i8dvl/",
              "text": "Sure thing..but I imagine the bio doc. Is more confusing for you as an applied math person because the math requirement is geared towards standard bio majors/pre-med types(which I am guessing OP is. The doc. Should be pretty clear for them but I don't know maybe they are also QTM?). With applied math they have to build in exceptions. Be sure to work closely with an advisor when you get to Emory, especially major advisors. And maybe consider the bio QTM track or taking some of the more computational bio focused courses when they are available (like definitely take Berman's class and computational modelling) especially if you are considering paths outside of medical school (even then it could be beneficial in unforeseen ways)",
              "author": "oldeaglenewute2022",
              "created": 1622765678,
              "upvotes": 2,
              "replies": {
                "h0i8np9": {
                  "link": "/r/Emory/comments/nr4vkm/math_requirements_for_bio_major/h0i8np9/",
                  "text": "thanks for the advice, I’ll definitely check the bio qtm track out. for now I don’t really know what to do—I just put bio/math as my flair since I think I want to major in bio and minor in app math but I’m gonna do some shadowing freshman year to try and figure out if I want to do prehealth—so it’s gonna be a bit of an experience",
                  "author": "valiantseal",
                  "created": 1622765814,
                  "upvotes": 1,
                  "replies": {
                    "h0i91nv": {
                      "link": "/r/Emory/comments/nr4vkm/math_requirements_for_bio_major/h0i91nv/",
                      "text": "Maybe shadow but keep an open mind even if you think you'll like it. When people cling to that pre-health label too much, they tend to become super risk averse in terms of course selection and if you become that way early, you may miss out on things or professors that may have signaled that another direction is for you. But good luck though. Emory is becoming much more friendly to your type ( those who are interested in both life sciences and math).",
                      "author": "oldeaglenewute2022",
                      "created": 1622766011,
                      "upvotes": 1,
                      "replies": {
                        "h0i96fw": {
                          "link": "/r/Emory/comments/nr4vkm/math_requirements_for_bio_major/h0i96fw/",
                          "text": "that’s good to know and good to hear, thanks again for your help!",
                          "author": "valiantseal",
                          "created": 1622766077,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}