{
  "sid": "gcibuk",
  "link": "/r/Emory/comments/gcibuk/double_majoring/",
  "title:": "Double majoring",
  "text": "Hey everyone! I got admitted into emory in january, and was wondering what the work load was like for students who double major. I'm thinking of doing poly sci/International studies or poly sci/econ. Any advice?",
  "author": "jross6666",
  "created": 1588470386,
  "updated": 1634099357,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "fpbm97b": {
      "link": "/r/Emory/comments/gcibuk/double_majoring/fpbm97b/",
      "text": "It really depends on how much the courses overlap. Anthropology/Human Biology joint major overlaps fairly well with Neuroscience and Behavioral Biology (I might attempt this) because the latter takes certain anthropology electives and lots of classes are cross-listed. Even the foundational science courses are similar.\n\nA middle ground of this scenario would be something like Biology and Chemistry where *some* but not an overwhelming amount of courses complement each other in some manner.\n\nOn the extreme end, something like BBA and CS isn't typically pursued but it can be done although planning has to start by freshman year or the courses will catch up to you. These courses have *nothing* to do with each other and some courses in the B-school that have to do with computing are designated and taught differently so they won't count as electives for CS.\n\nNow for your question, Political Science and International Studies double major is a no-go because it's not allowed. Says so right in the department's website. The two majors are simply too similar and require the same core courses.\n\nPolitical Science and Economics seems like an extreme end as from the surface level none of the [ECON courses](http://economics.emory.edu/home/documents/checklist---economics-major-test.pdf) seem to overlap with POLS courses. You'll probably be stacking them up with 17+ credits each semester if you plan on doing both. It certainly can be done but you need a good 4-year plan if you don't want to fall behind by senior year.\n\nOn a side note, QSS is unique in that it allows double majoring with the same disciplinary track (e.g. majoring in QSS+Biology and Biology).",
      "author": "FearlessMelly",
      "created": 1588473289,
      "upvotes": 3,
      "replies": {
        "fpbmfsf": {
          "link": "/r/Emory/comments/gcibuk/double_majoring/fpbmfsf/",
          "text": "Thank you!!",
          "author": "jross6666",
          "created": 1588473410,
          "upvotes": 1,
          "replies": {
            "fpbntil": {
              "link": "/r/Emory/comments/gcibuk/double_majoring/fpbntil/",
              "text": "This isn’t really true. I am a polisci/econ double major and it’s really quite a common combination. It all depends on what you want to do with your degrees, because while the intro classes don’t overlap, you can certainly pick overlapping electives.",
              "author": "jackschnei",
              "created": 1588474339,
              "upvotes": 3,
              "replies": {
                "fpboyez": {
                  "link": "/r/Emory/comments/gcibuk/double_majoring/fpboyez/",
                  "text": "Mind if I DM you to talk a but more ab it?",
                  "author": "jross6666",
                  "created": 1588475117,
                  "upvotes": 1,
                  "replies": {}
                },
                "fpbppr5": {
                  "link": "/r/Emory/comments/gcibuk/double_majoring/fpbppr5/",
                  "text": "Thanks for chiming in as an actual double major. I'm not into either of these fields so I added the disclaimer that my observation was from the surface level.\n\nBut I'm curious to know what electives can cross-over between the two so I can keep it in mind for anybody interested. From the outsider's perspective it says the electives need to carry a POLS/ECON designation and I haven't seen any that are cross-listed as either.",
                  "author": "FearlessMelly",
                  "created": 1588475644,
                  "upvotes": 0,
                  "replies": {
                    "fpbqfyv": {
                      "link": "/r/Emory/comments/gcibuk/double_majoring/fpbqfyv/",
                      "text": "What I would say is that econ and math AP credits can be easily exploited to accelerate through econ.  Like you can get Math 111, and perhaps both intro. econs out of the way through AP credit (and can just immediately start with intermediate econs), and I think pols may accept some credit (to go towards credit hours).  That alone could help.  Also, gotta keep it real, I am not sure many (especially non-pre-law and non-pre-med types) worry too much about any workload or amount of overlap between two majors.  Though I am sure everyone loves having a high GPA, people considering many different career pathways outside of those two don't have to always feel over-protective of it because most like non-finance careers place competencies and experience over showing off the most shiny GPA possible (they, unlike medical and law schools are not incentivized to cherrypick those who can be used to help their rank or are most likely to pass professional standardized tests and whatnot). Doing two non-overlapping majors probably honestly isn't that hard.  Taking courses in both that make optimize the chance that you get the best training and experience that each dept can offer is a different story.\n\nAnyone doing that would perhaps at least want to choose a priority major they would feel good enough about to aspire to doing an honors thesis in or something and dive into that (and maybe find a research topic that allows them to combine knowledge gained from engaging from both disciplines.  With Pols and econ, that wouldn't be too difficult).\n\nWhat OP could consider is the QSS Public Policy Analysis major and maybe just take additional econ. and pols courses for enrichment if they are worried about incurring too high a workload (not to say that QTM majors aren't pretty high just based upon the core course requirements).",
                      "author": "oldeaglenewute2022",
                      "created": 1588476159,
                      "upvotes": 3,
                      "replies": {
                        "fpbtlhv": {
                          "link": "/r/Emory/comments/gcibuk/double_majoring/fpbtlhv/",
                          "text": "This is all very true. At first I was deadset into having a backup major in case medical school doesn't work out but my heart just wasn't into it. I switched to anthro/HB and I'm loving the interdisciplinary aspects of it. So I was doing a major that had nothing to do with medicine and am actually finishing up a bunch of requirements for it (old major) before I decided to switch majors.\n\nPerhaps a lot of new college students think that double majoring increases their chances of being employed because their profile has nothing else going on. It may do that, but other things like internships and research can do so as well and not all of them can be quantified as simply as taking X amount of credits. So what you say about having a priority major and pursuing internships/research/honors in that major makes sense.",
                          "author": "FearlessMelly",
                          "created": 1588478390,
                          "upvotes": 1,
                          "replies": {
                            "fpbx7nk": {
                              "link": "/r/Emory/comments/gcibuk/double_majoring/fpbx7nk/",
                              "text": "I don't think double majoring helps that much because of the latter part you cited and the fact that they read the transcript, resume, and cover letter and just look for some key things in the initial screens for many jobs.  So one can often say on a resume or coverletter about how they have lots of exposure or experience in another discipline and the transcript and resume will corroborate it.  in addition, Emory's degrees prioritize and show the primary major.  The concept of double majoring for a competitive edge is kind of problematic.  \n\nAgain, students need to seek the BEST training related to whatever areas they could envision themselves employed in. And if they plan a MS or PhD in an area, they should do a deep dive into at least one of the majors that readies them for doing work in those fields as a scholar/practitioner. Showing the programs \"look I majored in two things\" ain't gone cut it because they value competencies and depth that would be gained through internships or research projects (for which weak ass coursework will not really prep you for).  I usually wouldn't advise a double major if a student thinks they'll have to sort of half-ass or take a checkbox approach to both.  The thing you considered with NBB and anthro/HB.eh.  Keep in mind that you'd have those 4 core courses (2 of which build upon the knowledge of gchem, gphysics, and gbio, 301, and 401). \n\n And quite frankly, I think biology and NBB itself host the best electives, and it sounds like you don't have much time to do much more than use the anthro courses that count towards NBB so you'd miss out. Admittedly, I think you can take most of the cores (maybe everything but 401) without being a major and depending on who you take, 301 (maybe find time to take with Frenzle before your MCAT. It is active learning/flippes but she gives cool activities and assignments that build those MCAT like skills while teaching the standard 301 content knowledge. The fall version is just sort of bland and may as well be a glorified applied physics 2/E&M plug and chug course but with neurons and neuronal membranes as the model/stand in for circuits) and 302 are quite interesting.",
                              "author": "oldeaglenewute2022",
                              "created": 1588481106,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fpdecby": {
                      "link": "/r/Emory/comments/gcibuk/double_majoring/fpdecby/",
                      "text": "I will say that I am a first year who has just declared these two majors so take my advice with a bit of a grain of salt. However, during my meetings with my two Undergrad Coordinators they assured me that this is a common and very manageable path. My Econ coordinator specifically told me that it’s a relatively short major in terms of number of courses. \n\nAs for electives, I would suggest looking for courses in either department that could apply to both and pitch it to the other department as an elective. This goes for any double-major. It’s sometimes really hard to coordinate a cross-listed class, so don’t be afraid to ask for credit even if it’s not technically in the department.",
                      "author": "jackschnei",
                      "created": 1588525323,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fryduu1": {
      "link": "/r/Emory/comments/gcibuk/double_majoring/fryduu1/",
      "text": "you cannot double major in poly sci/ int studies. Both are in the Poli Sci department and they have too much overlap. However, double majoring with Poli sci and something else is common and easy, as long as you are not pre-med.",
      "author": "FlowersBloomUntil",
      "created": 1590561699,
      "upvotes": 1,
      "replies": {}
    }
  }
}