{
  "sid": "n1437z",
  "link": "/r/Emory/comments/n1437z/emory_freshman_dorm_advice/",
  "title:": "Emory Freshman Dorm Advice",
  "text": "Hi, I got accepted to Emory and I'm in the process of filling out Housing Applications. I have a few questions about what my options are like. One of my options is Mixed Gender floors vs same-gender floors. Is there a difference in the atmosphere or experience or is it generally the same? Additionally, I have the option for a single room or double room. Would I get a roommate if I chose a single room? If not, is that something I should consider? \n\nI know this is mostly a preference thing, but I definitely want advice from someone who's been through this process.",
  "author": "Left-Penalty-2533",
  "created": 1619702089,
  "updated": 1634098172,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 1.0,
  "comments": {
    "gwaugge": {
      "link": "/r/Emory/comments/n1437z/emory_freshman_dorm_advice/gwaugge/",
      "text": "A single room is one person, so you wouldn't have a roommate (the room is smaller, and there's only one bed/desk/etc).  A double is 2 people in a room, it's bigger, and there's twice the amount of furniture.\n\nI lived on a same-gender floor, but I imagine the experience is really similar either way.  I'm a girl, but there were guys hanging around pretty often.  If you feel more comfortable around people of your gender, then same-gender might be the way to go, since you'll be around those people & (probably) have floor meetings with them pretty often.",
      "author": "Silver-Seesaw6375",
      "created": 1619707221,
      "upvotes": 5,
      "replies": {}
    },
    "gwb2lyo": {
      "link": "/r/Emory/comments/n1437z/emory_freshman_dorm_advice/gwb2lyo/",
      "text": "The other commenter was correct. I live on a mixed gender floor, it's still split in half with girls on the left of the elevator and boys in the right. It really doesn't make much difference to me. I will say that I tend to make friends with girls more easily, so I might have benefitted from a same-gender floor as it would have given me more potential friend options. \n\nSingle vs double is a tough choice. I had a single my freshman year (because covid) and it was really nice to not have a roommate. The single rooms are plenty of space for one person. However, it is hard to get single rooms as freshman, and even harder as sophomores. I am going to have a roommate as a sophomore and it's gonna be a hard adjustment. I've had my own room my whole life, so perhaps I would have been better off having a freshman roommate yo help me get used to it.",
      "author": "katsteve",
      "created": 1619710660,
      "upvotes": 5,
      "replies": {}
    },
    "gwb6r5k": {
      "link": "/r/Emory/comments/n1437z/emory_freshman_dorm_advice/gwb6r5k/",
      "text": "I picked mixed gender floors and ended up in lsm, which is one of the nicest dorms on campus. I think there’s a strategy to what you pick",
      "author": "decafoatmilklatte",
      "created": 1619712375,
      "upvotes": 3,
      "replies": {
        "gwcri3l": {
          "link": "/r/Emory/comments/n1437z/emory_freshman_dorm_advice/gwcri3l/",
          "text": "what year were you in when you got placed in that dorm?",
          "author": "Left-Penalty-2533",
          "created": 1619735080,
          "upvotes": 1,
          "replies": {
            "gwd6baq": {
              "link": "/r/Emory/comments/n1437z/emory_freshman_dorm_advice/gwd6baq/",
              "text": "Freshman! It’s a freshman dorm. Now I’m on res life staff for lsm too.",
              "author": "decafoatmilklatte",
              "created": 1619742183,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}