{
  "sid": "g86l4u",
  "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/",
  "title:": "Deciding between schools, please help!",
  "text": "Hi!\nI’ve been accepted to Oxford College and I was really excited and almost committed on the same day. I stopped myself to weigh out the options that I currently have. I want to go pre-med which is obviously a daunting task even more so with a major in chem instead of biochem or bio. Unfortunately the med school acceptance process seems to be a little bit... weird? It seems to me that a high GPA (and MCAT), regardless of school will get you into a med school. I have a few safety schools that I was accepted to as well and I know I can easily get better grades at those schools. My question is really, and I figure this question is asked a lot, is there grade deflation at Emory/Oxford and should I reconsider schools if my goal is med school after undergrad? I totally love the campus and the atmosphere and after talking to people that go to Emory now it sounds like a great school but hearing some students input would be really helpful before I commit to a school in just under a week. Thanks!",
  "author": "hevkev",
  "created": 1587868792,
  "updated": 1634099292,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "folsa5l": {
      "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/folsa5l/",
      "text": "Hey, I’m a polisci major at Oxford, so I can’t exactly help you out on the Med school part. What I can vouch for is the experience.\n\nThe people at Emory are phenomenal. It really feels like a family. I didn’t realize how much I hated my life until I got to Emory, when my eyes opened up to a whole new world of color. The people are great, the teachers are great, and the facilities are great.\n\nAs for the grading, what I can say is that each teacher grades differently. Some teachers grade a bit harsher than others, but more than anything, they grade fairly. I’ve never once gotten a grade I haven’t deserved. \n\nI hope you take your time thinking about college, but not TOO much time. I don’t recommend stressing about it, as you can always just transfer. A lot of people think they’re shackled to one college once they get accepted and make their choice, but that’s obviously wrong lol.\n\nBest",
      "author": "Walrusxyz",
      "created": 1587869286,
      "upvotes": 9,
      "replies": {
        "folwn1c": {
          "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/folwn1c/",
          "text": "Thank you for this! It’s really nice to hear that the environment is supportive and amazing. I’m really leaning towards going to Emory!",
          "author": "hevkev",
          "created": 1587872260,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "folu1di": {
      "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/folu1di/",
      "text": "Premed on main campus, never went to oxford so I can’t help there :(\n\nEmory doesn’t exactly deflate grades, and most professors here only curve up, never down - but they definitely make you work for your A. Especially in the core science classes, which seem to be graded a lot easier at less competitive schools (going off of the experience of other friends who’ve never attended Emory). This means your GPA at Emory may end up being lower than it could have been at another school, but there’s a reason Emory is considered a brilliant school for premeds- the core science classes here are built to help you succeed on the MCAT. If you do well in the core science classes, you’re pretty much guaranteed to do well on the MCAT. \n\nI’m sorry I don’t know much about how this works for Oxford students, but I know that Emory’s main campus has some great options for clinical work and a large number of choices for research, which are also important to have on your medical app. I had a friend commute from oxford twice a week specifically for research, but she had a car and I’m not sure how accessible that is with the shuttle. If no one from oxford comments here, I really recommend checking in with an advisor, or upperclassmen on the accepted student fb page to see if they can help",
      "author": "housegoat73",
      "created": 1587870468,
      "upvotes": 7,
      "replies": {
        "folz8bm": {
          "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/folz8bm/",
          "text": "Ox science is super rigorous but I think it’s in a good way. You will work for an A but it’s not impossible, and classes are tiny so you can get a lot of individual attention. It sometimes feels like half of Ox is premed, so you definitely will have company. There’s not *as much* in the way of research, but you can find it if you talk to profs second yearish. If you know for sure you want to take an independent research course in bio, make sure you take the intro bio sequence first year. Most people, even those who do research, don’t do that though, in my experience.",
          "author": "velmah",
          "created": 1587874088,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "folug5g": {
      "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/folug5g/",
      "text": "Hardly no school has \"grade deflation\"  and data supports this. The people at various elite/very selective schools who claim it exists at their school usually don't know that data or what \"grade deflation\" (decreasing grades over time or curving down.  Extremely rare) is.  They just say anything because they find their courses more challenging than expected (they are used to often getting A's easily in HS after all. Not every student at an elite comes from a particularly rigorous public or private HS), and I'm sure many will find Emory and Oxford to be that way.  Generally STEM courses, especially introductory courses have lower grade distributions (because the grades disproportionately come from high stakes exams and quizzes that typically have more MCQs and prompts that allow for more objective grading than non-STEM courses), than analogous surveys in other departments and there is no exception at a very selective school.  My guess is that Emory and Oxford will give you a significant MCAT advantage, but to get it, you will probably have to work harder than elsewhere and that is totally fine if you actually enjoy learning and want to learn at a higher level than you may have in HS.\n\nIf you view that as a risk, then maybe whatever public or less selective school is also viable, but I recommend the honors courses at those schools.  And generally understand that, depending on what other options you have, things such as the biology and chemistry courses (very important on the MCAT) may not be the same quality and be more research/concept driven like courses at Emory, which isn't particularly good for the MCAT (MCAT has some stand-alone questions that may be more doable if you just remember the content, but most of the sections are passage based and will require lots of analytical and experimental thinking which is often less present in the curricula of many other schools until you hit courses later in your career perhaps after you've taken the MCAT).  In this case, if you know you might be experiencing a weaker curriculum, but feel it is too easy/you are merely memorizing your way through and don't engage much applied problem solving, case studies, primary lit., etc in your freshman and sophomore level STEM courses, then you should gone ahead and get your MCAT materials and books very early on so that you can compensate for that.  You don't wanna end up with a high GPA/lowMCAT mismatch from anywhere (and you don't wanna bomb your first MCAT) as it will make them question the rigor of your courses/academic pathway.\n\nAnd the main reason Emory's rates are \"weird\" is because Emory reports ALL the data and let's/encourages ALL people who desire to apply (there is no protectionism over the rate so PHA doesn't try hard to steer less competitive applicants to apply later or consider other careers or pathways in healthcare when I honestly think that perhaps they should) whether they have a competitive application or not, and Emory has an unusually high volume of applicants applying to med. school because students seem to go forward even if they aren't very competitive (basically the \"weeding\" process is failing at Emory and seems not to deter many).\n\nI leave it to you to figure out if you value/can rise to the challenge of learning more complex stuff or learning the traditional pre-med core material but being demanded to do so with higher cognitive complexity (See Bloom's taxonomy:[https://en.wikipedia.org/wiki/Bloom%27s\\_taxonomy](https://en.wikipedia.org/wiki/Bloom%27s_taxonomy)) application/conceptual thinking vs. regurgitation in the natural science courses, or pure plug and chug in the case of things like physics and chemistry).  Only you can determine if that is something you value vs. a guarantee to have a more perfect GPA (perhaps at the expense of an MCAT score).  With that said, at Emory, you will likely remain competitive for more medical schools while merely having a competitive (vs. like near perfect) GPA and decent MCAT vs. if you have the latter at less competitive schools.  You mainly just need to avoid becoming \"not competitive\" and that will involve working hard in courses that are taught with solid rigor  (as in, do not just choose all of the easiest instructor options for the pre-health core) for the sake of the MCAT, and scheduling/spacing out classes well enough to optimize your chances at a strong performance GPA wise. And please do major in something you enjoy (if you like non-STEM subjects, do that and take the pre-med core and supplemental STEM courses on the side to learn relevant MCAT and med. school content/scientific skills).\n\n\\*To understand STEM grading in college (including Emory/probably Oxford): Usually intro. STEMs and pre-med heavy STEM courses have target GPAs that are pretty comparable across schools, and different ways of achieving it:  Like a course aiming for a B-/B average and is highly reliant upon tests may have the instructor make tests that target a 77-83 average which is really not that hard.  Other instructors who want to challenge students with more higher level thinking and problem solving may target their exams between 60-75 (because exams with those demands likely will not have as many 90+ scorers as those that intend for students to display a lower level of skills, so the curve is just an adjustment to account for that and not punish students for at least trying to achieve those demands where they may not have to in another section of the same course) and then final grades will be curved UPWARDS, as mentioned above, so that the distribution is raised to achieve the professor's target median/average. In rare cases, instructors may just scale individual exam scores as needed to raise it to those targets.  But if the students beat the target, they typically assign grades vs. the regular 93=A scale as they are instead of increasing the cut-offs to lower the level of As and Bs.\n\nSo, when students feel challenged or \"deflated\", it is usually because they find the course tedious or cognitively challenging.  Instructors are usually not out to create the appearance of rigor by forcing the grades to fit a lower distribution than what students actually earned according to their raw scores vs. a normal scale.  They simply are trying to challenge students within reason of the abilities and work ethic Emory students are supposed to have along with assessing in ways that match the goals/objective of the course and the two often go hand-in-hand (like a lot more Emory students are gonna be ready for higher ordered thinking and problem solving in STEM than less competitive places, so many professors will emphasize that more than average).",
      "author": "oldeaglenewute2022",
      "created": 1587870746,
      "upvotes": 5,
      "replies": {
        "folwdjr": {
          "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/folwdjr/",
          "text": "Oddly enough, I’ve been at a math and science boarding school that focuses on research and collaboration rather than memorization for the past 3 years. From all this information it sounds, while obviously at a higher level, very similar to my previous experiences and overall seems like I would be comfortable with this learning style already, or at least, I would hope :). I hadn’t even taken the MCAT preparation into consideration and that’s really interesting and it’s really encouraging me to go to emory now lol. To ask a follow up question about grade deflation, would you consider Emory to be significantly more difficult than other colleges like, a state school, for example. From what I understand Emory is not purposefully lowering grades (and I assume most colleges aren’t), but are the average grades lower than what you expected going into college? At my school currently, I’ve excelled in nearly 6 semesters worth of chemistry courses including 2 semesters of organic chemistry. I would also like to ask, if you know, with a med school acceptance rate of 55%, it is actually below the rate of my safeties. Do you think that someone with a background such as mine would fit in academically, would I be able to stay within that 55% of students at a school like Emory or should I choose another that will allow me to go above and beyond for safety purposes. Do you think that because Emory allows everyone to apply to med school, that I should not compare this percentage, or do you think taking this rate into my college decision is beneficial? I apologize for being so nervous about choosing colleges but I would appreciate any additional advice if you have it! Thanks! Let me know if I need to clarify something.",
          "author": "hevkev",
          "created": 1587872075,
          "upvotes": 2,
          "replies": {
            "folyach": {
              "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/folyach/",
              "text": "It depends on the state school (they aren't all created equally.  Kind of like how closely ranked elite privates have different strengths.  I don't like using anecdotes because I'm from GA and UGA and Tech are honestly pretty strong in STEM, with UGA being strong in chemistry and natural sciences and Tech being strong in engineering and physical sciences. Their undergrads get a pretty decently rigorous education in STEM despite their larger size).  There are some state schools like UMD, Michigan, and others (a lot of the big 10 schools actually) that have done STEM curricula overhauls, especially of pre-med and natural sciences courses (Emory has done an awful lot of this too, especially compared to most of the non-top 10 elite privates) that will be OBJECTIVELY (in terms of cognitive complexity) more difficult than some weaker or maybe even mid-tier rigor instructors at Emory/Oxford or perhaps most of the pre-med core instructors at some of Emory's private peers (believe it or not, Emory looks a lot better off than some of these places. I don't like ECAS's new bio curriculum, but even it is a tad better than the more memorization/content overload/regurgitation oriented sequences elsewhere and Oxford's is REALLY good and incorporates a couple of days for reading primary literature, incorporates a decent course-based research element into its bio labs, etc), but less selective state schools typically aren't like that, and will focus those early chem, biol, whatever courses on \"not too good\" type of learning that will certainly be objectively easier for most students, but not as exciting or interesting.\n\nAlso, I CANNOT tell you what to do.  Being in that 55% (which is usually all the 3.5, 91% MCATs.  Also, your \"safeties\", I bet, have a comparatively lower graduation rate or significantly less VOLUME percentage wise versus Emory in terms of the amount of students who apply.  Wanna bet that weeding at those schools is far more effective and that they cull applicants better?  If you can use the courses knock people out of the running for applying or use advising to steer them away from applying, you get a better rate. Period.  I wonder if your safeties have > 20% of a graduating class applying to med. school for the first time.  Seriously, like if ECAS produces like 1500 graduates, and almost 300 applied to med. school the first time, then the weeding failed miserably.  Most schools make it such that maybe only up to 10% of any cohort ends up applying for the first time) should not be very hard tbh especially if you come from a rigorous private or public school as you said you did.  Usually these students do VERY well despite meeting their matches and being challenged in a couple of courses.  Though usually they appreciate that, and it is ultimately why they came.  They wanted to find the course that really made them think or were full of students as good or better than them in an area.\n\nI think a lot of the less competitive students get pushed to apply by parents and whatnot and don't have an open mind.  And honestly you should open your mind and stop thinking about \"safety\".  Constantly worrying about that and being a neurotic pre-med may do you more harm than good even at a less competitive state school.  Often state schools don't care if you mess up (many will curve the mean/median less generous).  Instead of thinking \"being safe for med. school\", you need to go into any school thinking that STEM will be hard and do your best, and that if it feels easy, then you're doing it wrong (making bad course selection, don't have enough strong peers in your class to push you to go beyond riding a curve and collecting an A).\n\nIf you go to the state school, you need to be very self-aware of this stuff and if you feel underwhelmed, do additional things to push yourself academically in or out of the classroom (maybe you can get an early research experience and start building competencies that may help for the MCAT via your experience in lab...and maybe in turn, you can seek out more research based STEM classes that your research experience should ready yourself for).  I've seen that work before, but I've also seen lots of people get over-confident.  They let the easily earned A's go to their head, stayed on an underwhelming academic path at the school, and then find studying for the MCAT extremely challenging because they had never been challenged to think at a particularly high level in the courses they took as a foundation for that exam.\n\nI also advise you to look at Oxford's syllabus database to get an idea of what your STEM courses would/could be like:  Here is biol 142Q for example: [https://app.oxford.emory.edu/WebApps/Directories/EResources/Syllabi/2019-Fall/142%20Syllabus%20F2019%20NJ.pdf](https://app.oxford.emory.edu/WebApps/Directories/EResources/Syllabi/2019-Fall/142%20Syllabus%20F2019%20NJ.pdf)\n\nIf this sort of thing appeals to you in terms of a learning experience, then you should consider Ox.  They aren't trying to harm you by challenging you.  They just wanna develop you really well (view it as developing your skills for science, medicine, or whatever, and not as an obstacle.  I know it's hard to do, but try to view it that way, from the lens of intellectual and personal development).  And honestly, if things don't go the best in the first year, med. schools love an upward trend/comeback story, and it seems Oxford creates a lot of those cases (because they come really prepared for main campus.  Main campus is known for hard tests in some classes, but it seems Oxford, by virtue of being small, builds a much better work ethic and gets students used to fully immersing themselves in the course material, so adjusting to larger intermediate courses at ECAS with a lower/similar workload to their intros is easy for a solid Oxford student whereas some ECAS students might get frustrated with say..the weekly primary literature discussion sections in like 1/2 of the intermediate biology classes.  ECAS students weren't required to do that as part of the lecture component of 14x, and likely not even that much as a part of lab, but at Ox, there appears to be a good bit of that research based thinking just in their rendition of the course).",
              "author": "oldeaglenewute2022",
              "created": 1587873417,
              "upvotes": 4,
              "replies": {
                "fomd61l": {
                  "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/fomd61l/",
                  "text": "Wow. This has been really helpful and I really appreciate you taking the time to write this for me. In full honesty, I really have a new view on college. I’m very excited to see what kind of challenges there will be and I’m sure it’ll go well in the future. I think you the information you shared really helped me make my decisions and at this point I would love to go to Oxford in the fall!",
                  "author": "hevkev",
                  "created": 1587885795,
                  "upvotes": 2,
                  "replies": {}
                },
                "fomkq7w": {
                  "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/fomkq7w/",
                  "text": "The syllabus is great! Do you know whether there is a similar site for ECAS syllabi?",
                  "author": "iapetus3141",
                  "created": 1587893692,
                  "upvotes": 1,
                  "replies": {
                    "fomkwjg": {
                      "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/fomkwjg/",
                      "text": "No, I think SGA keeps some old ones or something on orgsync or w/e y'all use now-a-days.  Y'all should perhaps lobby to get some type of database going. At one point, when the course atlas platform/interface was transitioning, professors could actually upload syllabi(on the slow interface, before the current one) with the course description.  Beg/ask and maybe students shall receive.",
                      "author": "oldeaglenewute2022",
                      "created": 1587893883,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fopv8y3": {
      "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/fopv8y3/",
      "text": "Hi Hevkev,\n\nI actually teach at Emory and have taught a class at Oxford and have insight into the grading process both at Emory and Oxford. The culture at Emory -- and maybe even more so at Oxford where the faculty know the students in smaller classes -  is very strong that learning is paramount and students who engage with the material and participate in class get recognized with high grades.  For example, when the campus shut down for COVID-19, the very first thing my department chair wrote the faculty was an order to \"treat students with extreme kindness in your grading in recognition of the difficulties of the quarantine.\"  As someone who directly grades students, I can tell you that literally nobody in my department or the administration has ever once second-guessed my grades, commented on how many A's I give, or mentioned any curve or grade target for me to follow.  I'm not in a STEM department, but I can tell you that universally for every professor ever, grades are the least interesting or important part of the teaching process.  Professors live to to research and teach, they always have specific learning objectives for each course, and always specify them on day one of class.  Speaking just for myself, but steeped in the general Oxford and Emory culture, I find that students who show up every class and work hard always manage to earn an A from me.  They work hard in my class, but nobody works hard and gets a B -- because my job is to make sure they've learned what I have to teach.  Students who miss a class or two and turn in all their work, show me that they've learned something, but don't put in a tremendous amount of effort will earn a B.  C grades are rare for me and reserved for students who did most of the work but clearly made little effort.  Emory students generally aren't like that, though -- the culture is to work hard, do all the work on time, learn a lot, and then high grades  just naturally follow.\n\nI will also point out that while I don't teach pre-med or science, the culture of both is  central at Emory and Oxford.  The Oxford science teachers are legendary.  I've been in lab classes multiple times and seen how powerful it is to have a science education this good with small classes and a professor who actually knows your name.  And then when you get to Atlanta, Emory professors all say that the Oxford students come highly-prepared with critical thinking skills.  Emory Clinic is one of the best research medical centers in the country, and is tightly integrated with the campus.  The CDC headquarters are literally on Emory campus and when you eat lunch at a restaurant on Clifton Road, you're often eating side-by-side with world public health experts.  When I was a patient once at Emory, my own doctor had literally briefed President Obama the week before on the Ebola crisis.  And finally, the medical school is placed so centrally on campus that it is hard to be a pre-med undergrad and not engage with medical students if that is the path you're headed on.  I didn't actually personally go to Emory undergrad even though I was accepted, but I would have for sure if my path had been pre-med.  I think you're going to love your Oxford and Emory experience.",
      "author": "silvermanphoto",
      "created": 1587973266,
      "upvotes": 2,
      "replies": {}
    },
    "fom2hm1": {
      "link": "/r/Emory/comments/g86l4u/deciding_between_schools_please_help/fom2hm1/",
      "text": "It depends on your other options.",
      "author": "91210toATL",
      "created": 1587876514,
      "upvotes": 1,
      "replies": {}
    }
  }
}