{
  "sid": "mvpyf0",
  "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/",
  "title:": "Employment opportunities for Applied Math & Statistics Majors",
  "text": "Hi everyone, sorry for the tsunami of 2025 admit posts, but I'm also a recent admit to Emory's class of 2025 and am trying to make a decision on which school to attend. I really like Emory so far, but my only concern is regarding employment and internship prospects for the Applied Math & Statistics major given that the math program isn't the best from what I've read here. \n\nIt'd be great if yall could help, thanks!!",
  "author": "junky_orangutan",
  "created": 1619040620,
  "updated": 1634098281,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "gvdjpb4": {
      "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvdjpb4/",
      "text": "I don't think undergrad math departments have to be \"the best\" to place well at a highly selective university.  In fact most undergrad. math programs just aren't \"the best\".  And it is hardly gauranteed that a place with a high ranked math graduate program (which indicates that it has an excellent academic/research reputation) is also particularly special at the undergraduate level.  When you talk things like math and physical sciences it really is primarily dependent upon what YOU do (and the competencies you choose to develop) because usually the courses aren't special and aren't some magical feeder to jobs though choosing the better professors likely will help you at internships or research, whatever you want to do. That may be the challenging part but it looks like they are relying less on post-docs and visiting faculty which no doubt can drag down the rigor and quality of certain courses.  It looked like pre-Covid, the math department specifically was developing an experiential learning oriented upper division.  Even if you wanna be theoretical, you should look out for opps like that because jobs tend to depend on the ability to apply to relevant situations that people need). Like clearly the graduate strength of the  math department didn't hinder the progress of these ambitious students: [https://news.emory.edu/stories/2016/09/er\\_goldwater\\_scholars\\_alwaise\\_kantor/campus.html](https://news.emory.edu/stories/2016/09/er_goldwater_scholars_alwaise_kantor/campus.html)\n\nYou can do whatever the heck you want:  [https://news.emory.edu/stories/2018/01/er\\_ono\\_swim\\_study/campus.html](https://news.emory.edu/stories/2018/01/er_ono_swim_study/campus.html)\n\nThis dude will also likely be fine:  \n\n[https://news.emory.edu/stories/2021/04/er\\_covid\\_19\\_dashboard\\_liu/campus.html](https://news.emory.edu/stories/2021/04/er_covid_19_dashboard_liu/campus.html)\n\nDo not rely on the prestige (or worry about the lackthereof) of the department to help you in the case of math and stats. Rely on the training that you are more likely to get at an Emory level school (and then try to find uses for what you are learning ASAP and find a project or try to design one yourself). Even the places that have math programs with big reputations for both grad. and undergrad partly have the reputation at the UG level because they attract these math medalists and other students who tend to take a lot of the highest level and most rigorous courses (places like Harvard, Chicago, Princeton, Stanford, MIT, etc are for example known for really high level honors options as entry points for majors as well as having good demand for accelerated and honors options just below the top honors course.  And then such students go on to immediately take upper division or even graduate courses.  So I don't know if it is the reputation of these departments alone so much as how many super ambitious/well-prepped students they graduate.  They aren't full of those just trying to \"get by\".  They have a fairly large contingent that are more like the people above that go above and beyond/have a real interest in it and fully dive in) \n\n\\*In addition, I wanna add that I think that major is primarily housed in QTM which comes with SUPER strong career and professional development infrastructure (definitely more so than most standard math programs.  So you'll be taking the QTM courses and getting access to their resources which ought to make you highly marketable to employers and grad. schools (because the program is inherently intense) without you necessarily being super gung-ho about math to the point where you are those Goldwaters.  This department doesn't have much of a grad. program yet so is ultra undergrad. centric and pours resources and effort into y'all: [http://quantitative.emory.edu/index.html](http://quantitative.emory.edu/index.html)",
      "author": "oldeaglenewute2022",
      "created": 1619042666,
      "upvotes": 3,
      "replies": {
        "gvf0x9q": {
          "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvf0x9q/",
          "text": "Thank you so much, I completely agree with you on your points. It's just that employment is a huge factor in making my decision. I didn't know about the last point, so thanks a lot for that!!",
          "author": "junky_orangutan",
          "created": 1619072771,
          "upvotes": 2,
          "replies": {
            "gvfd7jg": {
              "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvfd7jg/",
              "text": "I'm basically saying that if you are in these areas, you should not view departments as \"placing students\"(even when you see placement numbers, you have no idea of whether students were well connected via parents/family, what courses they took, and what all they did outside of class or via co-curriculars during that degree. You just see a number without a context and then somehow the \"department\" gets credit whether it deserves it or not. You'll be left with the impression that it is some type of prestige magic when the place can be enriched with students who did exactly what they were supposed to do or had connections. And no one wants to believe that these types of differences exist between highly selective schools but they certainly do. For example, the student body at Emory is on average significantly less wealthy than most of its private peers and the career backgrounds of students tend to cluster in certain areas that would not easily connect them to other career paths).  You really have to place yourself(this is mostly what happens at top tier schools) by developing the profile of students that place at whatever jobs.  You can easily do this at Emory but it is totally up to you (career centers and faculty/staff mentors can and should certainly help). And you definitely need to do more than just take the courses.\n\nQTM resources will help you develop the additional skills IF you let it(looks like they have certificates, all types of datathons that Emory hosts as well as others they want their students to participate in.  They also have research fellowship programs for undergrads, so consider that. Again, go as deep as you can).  If you just complete the degree (where you sort of just check courses off because you choose them and the professors flippantly) with solid or even excellent grades, don't expect to be the most marketable candidate.  That hardly ever works from college (again, not even from the strongest UG depts. Many places have grade inflation anyway so aside from the jobs with the highest application volumes, that probably won't be the differentiating factor as long as the GPA is decent) as jobs have very specific descriptions with specific competencies  and skills they screen resumes and interviewees for.\n\nThe best you can do is eventually figure out some areas you want to target, look up these jobs descriptions (or have the career center or some mentors help you figure it out) and tailor some of your courses, internships, ECs, and co-curriculars towards developing them.  Basically don't treat this like HS where you mainly need to look great on paper.  Assume the company will have some way of holding you accountable for what you claim you are able to do before they make a hiring decision. Do as many things as possible that both signal that you actually have a skill and be sure that you retain it after you develop it/gain exposure to it.",
              "author": "oldeaglenewute2022",
              "created": 1619084364,
              "upvotes": 2,
              "replies": {
                "gvfdd07": {
                  "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvfdd07/",
                  "text": "Yup, i completely understand your point. Thanks a lot!!",
                  "author": "junky_orangutan",
                  "created": 1619084512,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gvdm7ku": {
      "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvdm7ku/",
      "text": "I hope this helps. With a math/stats major you can do a lot of things. Data analytics, finance, maybe even IT.\n\n[http://career.emory.edu/\\_includes/documents/Emory%20Employment%20Report%202018-2019.pdf](http://career.emory.edu/_includes/documents/Emory%20Employment%20Report%202018-2019.pdf)",
      "author": "91210toATL",
      "created": 1619043850,
      "upvotes": 3,
      "replies": {
        "gvf0qfp": {
          "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvf0qfp/",
          "text": "Thanks a lot!!",
          "author": "junky_orangutan",
          "created": 1619072607,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gveguc3": {
      "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gveguc3/",
      "text": "What are your alternatives?",
      "author": "Skytram_",
      "created": 1619059268,
      "upvotes": 1,
      "replies": {
        "gvf0u5h": {
          "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvf0u5h/",
          "text": "For context, I'm an international student.\n\nI'm currently choosing between Emory and the University of Washington",
          "author": "junky_orangutan",
          "created": 1619072696,
          "upvotes": 3,
          "replies": {
            "gvf8q4r": {
              "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvf8q4r/",
              "text": "Lol what a coincidence, I just moved to Seattle for work and I'm around UW a lot. They are very different schools. UW's campus feels more like GT to me, and it seems their academic and research focus aligns with that. Emory is a liberal arts, research institution. Both schools are excellent and in the same ballpark for your major. It's more of a matter of what environment you think suits you best.",
              "author": "Skytram_",
              "created": 1619079939,
              "upvotes": 2,
              "replies": {
                "gvf90cr": {
                  "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvf90cr/",
                  "text": "wow lmao. Thanks a lot, this was really helpful. Im leaning a bit more towards emory, so I might go with that. Thanks a lot again!!",
                  "author": "junky_orangutan",
                  "created": 1619080210,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gvstqrj": {
      "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvstqrj/",
      "text": "Hey. AMS major here. Based on my personal experience, Math dept must be the nicest and flexible group at Emory. The professor always care about your academic and even well-being. I got research easily on my first semester of college. So yes like other posts have said, it really depends on how you “milk” the resources here!",
      "author": "gummybearvt",
      "created": 1619340336,
      "upvotes": 1,
      "replies": {
        "gvstvlk": {
          "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvstvlk/",
          "text": "Hi thanks a lot for your reply. Could you please tell me how the internship opportunities are in general for AMS majors at Emory? Thanks a lot!",
          "author": "junky_orangutan",
          "created": 1619340471,
          "upvotes": 1,
          "replies": {
            "gvsu6a6": {
              "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvsu6a6/",
              "text": "I would say solid. I cannot tell much cause I focus more on research but I have applied to several international companies in my country and all got in with the role of Data Scientist or Business Analyst. However I all turned them down for REU!",
              "author": "gummybearvt",
              "created": 1619340763,
              "upvotes": 1,
              "replies": {
                "gvsuao4": {
                  "link": "/r/Emory/comments/mvpyf0/employment_opportunities_for_applied_math/gvsuao4/",
                  "text": "Oh, thanks a lot!",
                  "author": "junky_orangutan",
                  "created": 1619340881,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}