{
  "sid": "kbjkmg",
  "link": "/r/Emory/comments/kbjkmg/should_i_take_a_class_su/",
  "title:": "should i take a class s/u",
  "text": "lol i just finished my biol 141 final (freshman) and got a score that would put me at a final grade of B/B+. I'm a bio major and planning on going to med school, so do you guys think it would be beneficial at all to just retake the class? it probably sounds stupid being concerned over 1 B early on, i know, but I'm scared that my gpa will end up being too low to get into a good med school by the time i graduate",
  "author": "janitorialkeys",
  "created": 1607751116,
  "updated": 1634099323,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "gfhs3e1": {
      "link": "/r/Emory/comments/kbjkmg/should_i_take_a_class_su/gfhs3e1/",
      "text": "No, dont do it. Take the B. S will look wayy worse.",
      "author": "luckyluckyduck",
      "created": 1607751344,
      "upvotes": 22,
      "replies": {}
    },
    "gfhztmd": {
      "link": "/r/Emory/comments/kbjkmg/should_i_take_a_class_su/gfhztmd/",
      "text": "The logic provided makes no sense. Take the B and perform better in upper division classes that med. schools like to see students with such as genetics, biochem, cell bio, and microbio (and maybe even key special topics courses like immunology or epigenetics).  They value upward trends.  You are young. Instead of agonizing over this one B and projecting it to your final GPA upon application, think about how you will improve study skills to perform well in classes that actually matter and emphasize MCAT relevant skills (the Covid versions of the bio 14x courses probably do this much less while still feeling like a grind due to the conditions. Look forward to more focused/interesting courses that do starting next year which will hopefully also have more optimal conditions for student performance) There is so much time to improve. And honestly, I am sure that post-spring 2019, med. schools expect pre-med requirements graded.  \n\nAgain, do well in other key bio courses, chemistry courses, physics if you can, and try to seek a rec. letter from some of those professors (even if you get a B grade, especially a B+.  Top tier instructors for key courses will actually monitor student development and reward effort and curiousity even if you don't make an A). Either way, plenty of successful pre-meds get a few B/B+s(and maybe even 1-2 worse grades!). It is VERY common especially for first years (it is supposed to be hard.  Don't feel ashamed that you felt challenged, especially given the circumstances. Emory is supposed to be like this and I trust you'll adapt to deal with it, rise to the challenge, and maybe even appreciate/enjoy it over time. Believe in yourself some please!). Most people's grades improve significantly over time.  Think longer term than this one grade and instead of trying to cover up imperfection, keep the grade and work towards an A-/A in 142 which is far more important and relevant to medicine now-a-days.  Med. schools will appreciate the improvement.",
      "author": "oldeaglenewute2022",
      "created": 1607757979,
      "upvotes": 11,
      "replies": {}
    },
    "gfsn990": {
      "link": "/r/Emory/comments/kbjkmg/should_i_take_a_class_su/gfsn990/",
      "text": "Most schools will take a S or pass and just treat it as a C- when calculating your GPA. Bs will still kill your med school chances but they won't kill your \"any other grad school\" chances the way Cs do.",
      "author": null,
      "created": 1607935771,
      "upvotes": 1,
      "replies": {}
    },
    "gfjqcx7": {
      "link": "/r/Emory/comments/kbjkmg/should_i_take_a_class_su/gfjqcx7/",
      "text": "While a S/U doesn’t factor into your GPA, schools will still see it when they look into your courses. They’re going to think that you probably almost failed that class. Unless you’re willing for them to think you almost failed, don’t take S/U",
      "author": "LCC16",
      "created": 1607791235,
      "upvotes": 1,
      "replies": {}
    },
    "gfhunk7": {
      "link": "/r/Emory/comments/kbjkmg/should_i_take_a_class_su/gfhunk7/",
      "text": "Hi! Pre-med junior here! I'm gonna assume that you're not on Oxford's campus since you haven't mentioned anything about it. \n\nTaking an S isn't bad or good - it's kinda like a blank slate. What matters is what you do afterwards. Since you're pre-med, that means that you have to do one year of bio at minimum. So you have plenty of time if that's all your doing - you could take the S, then start over sophomore year (with less friends in the course but that doesn't matter). The issue is when you want to major in something else like NBB or Bio itself or Anthro and Human bio that depends on getting those Bio foundational courses out of the way.\n\nIf you do plan to major in something that requires Bio 141 as a pre-requisite for anything, I would take the B/B+. It really isn't that bad. A lot of my friends have gotten B's (myself included) in bio and come out fine. \n\nThen again, if you do plan to major in something along those lines and you really want to take the S, it's not the end of the world. You can finish up any major in two years (technically) so it should be possible. I would then focus on knocking out as many GER's as possible this coming semester. \n\nHappy to answer any questions either here or in DM's! Also - please reach out to OUE advising or Anil at PHA becuase they will help you through this! They are truly masters of their craft. Hope this helps!",
      "author": "mosinghal",
      "created": 1607753378,
      "upvotes": -4,
      "replies": {
        "gfhxbww": {
          "link": "/r/Emory/comments/kbjkmg/should_i_take_a_class_su/gfhxbww/",
          "text": "I don't think taking a S for a B/B+ is necessary...",
          "author": "Dr_Yankee",
          "created": 1607755664,
          "upvotes": 9,
          "replies": {}
        }
      }
    }
  }
}