{
  "sid": "gw8dex",
  "link": "/r/Emory/comments/gw8dex/how_good_do_you_think_the_cs_department_is_going/",
  "title:": "How good do you think the CS department is going to get?",
  "text": "Hey everyone... I'm an incoming freshman to Emory College. I just have a few concerns about the CS department here (Low key freaking out) I feel as if I haven't done enough research about Emory before accepting my offer (Done so at the deadline day) How do y'all feel about the department? Why doesn't it have any accreditation btw? Is it just bad or what? Please help a brother out...",
  "author": "THELONLEYGAMER21",
  "created": 1591237669,
  "updated": 1634099208,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.85,
  "comments": {
    "fstgye7": {
      "link": "/r/Emory/comments/gw8dex/how_good_do_you_think_the_cs_department_is_going/fstgye7/",
      "text": "CS is not engineering thus there is no need to be abet accredited. CS at Emory is good when compared to all CS programs. It will certainly get you the job you want to have.",
      "author": "91210toATL",
      "created": 1591238160,
      "upvotes": 6,
      "replies": {}
    },
    "fsv1ewe": {
      "link": "/r/Emory/comments/gw8dex/how_good_do_you_think_the_cs_department_is_going/fsv1ewe/",
      "text": "CS alum here: everyone I know in my major had no trouble getting a good job out of college. With regard to coursework and breadth of electives it's only gotten better and I expect it to continue to do so, particularly in the realm of data related subfields.",
      "author": "TheThobes",
      "created": 1591280092,
      "upvotes": 6,
      "replies": {}
    },
    "fstjx90": {
      "link": "/r/Emory/comments/gw8dex/how_good_do_you_think_the_cs_department_is_going/fstjx90/",
      "text": "There are peer schools with CS depts hosted within engineering schools that are still only as good (or maybe even slightly less robust) as Emory's CS dept. Really only a few exceptional CS undergrad. programs exist in terms of research universities and we know who most of those are. It doesn't mean others are bad though.  It just means that they aren't \"special\". Emory's historical strengths include business, life sciences, chemistry, and key social sciences and humanities in terms of undergraduate education so CS of course won't be as well invested in as biology, chem, nbb which have historically had very high demand and have benefitted from targeted curriculum reform and development efforts for a very long time now.\n\n It has recently become more of a priority after separating from math and quickly growing in enrollment and number of majors (enrollment is growing at paces you see elsewhere) and thus they have kind of gone on a hiring spree that may even continue through the recession (they said they were doing hiring freezes EXCEPT for those that contribute to key strategic areas of investment within the university).",
      "author": "oldeaglenewute2022",
      "created": 1591239908,
      "upvotes": 8,
      "replies": {}
    },
    "fsva1js": {
      "link": "/r/Emory/comments/gw8dex/how_good_do_you_think_the_cs_department_is_going/fsva1js/",
      "text": "Our CS department has gotten so much better over the years. There is a very big focus on research and a lot of professors have research labs in many different areas. Get to know the professors and see what field you like. There will be plenty of opportunities to grow and learn even outside of the classroom environment.\n\nThe department is in a really position currently and I think it will only get better.",
      "author": "lll1l1l1llll",
      "created": 1591284375,
      "upvotes": 4,
      "replies": {}
    },
    "fsvmadk": {
      "link": "/r/Emory/comments/gw8dex/how_good_do_you_think_the_cs_department_is_going/fsvmadk/",
      "text": "It's getting better every year.  People complain because it doesn't get as much funding as subjects like Bio or Chem, but it is still a great program.",
      "author": "followthelawson",
      "created": 1591290107,
      "upvotes": 3,
      "replies": {}
    },
    "fsxbyyl": {
      "link": "/r/Emory/comments/gw8dex/how_good_do_you_think_the_cs_department_is_going/fsxbyyl/",
      "text": "I kinda see CS major as similar to business, it’s really about interning, gaining experience outside of academics. There should be many opportunities to intern in Atlanta...as far as competition in the industry I am not sure since our neighbor Georgia tech has a top 3 cs department but I mean those rankings are not all undergrad. This sounds cliche...but it’s really up to you to show how competitive you are in an industry..Luckily I truly believe emory has opportunities you can take advantage of...I mean why else would anyone pay so much to attend this school LOL.",
      "author": "soondooboo7419",
      "created": 1591320494,
      "upvotes": 2,
      "replies": {}
    },
    "fstr3el": {
      "link": "/r/Emory/comments/gw8dex/how_good_do_you_think_the_cs_department_is_going/fstr3el/",
      "text": "Also, totally random, but most CS programs not housed in engineering schools aren't gonna have special accreditation (you do have programs like chemistry programs that can have pathways that receive additional certification, ACS in the case of chemistry).  In addition, the utility of ABET for accreditation of some engineering programs is being questioned: [https://cen.acs.org/articles/95/i48/time-leave-behind-chemical-engineering.html](https://cen.acs.org/articles/95/i48/time-leave-behind-chemical-engineering.html)\n\nMake sure you understand the nuances of stuff like this before you hold such things up as a gold standard (often these certifications and specialized accreditation boards box departments in, putting severe limitations on what schools can do in terms of curriculum development and innovation.  This is especially the case for top tier schools/departments that have student bodies that can handle more rigorous and relevant curricula).  Often they aren't which is why for chemE, Stanford and Caltech were in the process of scrapping ABET.  If admitted to Stanford or Caltech, would you primarily worry yourself about that?  I don't know any employer who would look for these things from well-reputed schools.  Either way, absence of any specialized accreditation (assuming it exists for a department) may not mean anything in terms of the quality or efficacy of the training.",
      "author": "oldeaglenewute2022",
      "created": 1591244377,
      "upvotes": 2,
      "replies": {}
    }
  }
}