{
  "sid": "jqdou3",
  "link": "/r/Emory/comments/jqdou3/shuttle_ramps/",
  "title:": "Shuttle ramps",
  "text": "I’m going to be using a mobility aid and I wanted to know how hard it is to get the ramp down. Is it something I can do myself with the switch by the door? I’m just not looking forward to asking the driver every time and it being a big deal when it shouldn’t be",
  "author": "tryingmybestkindof",
  "created": 1604850039,
  "updated": 1634099331,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "gbn3fh5": {
      "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbn3fh5/",
      "text": "[deleted]",
      "author": null,
      "created": 1604862769,
      "upvotes": 3,
      "replies": {
        "gbnkjxe": {
          "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbnkjxe/",
          "text": "There's someone here who always answers questions about transportation at emory (some reddit account) but I can't remember what it's called",
          "author": "tryingmybestkindof",
          "created": 1604870988,
          "upvotes": 1,
          "replies": {
            "gbqfr74": {
              "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbqfr74/",
              "text": "Hey there!  All of the shuttles are equipped with ramps.  The drivers are trained and expected to deploy ramps for anyone who requests it.  So, please let our driver know.  If the ramp is not working, we need to know!  The bus should not go into the service with a ramp out of order.  And if you (or anyone) is ever scoffed at by someone for requesting the ramp isn't a kind person.  \n\nBy the way, we can pull data on how often the ramps are used.  It's something I (we) use to determine routes with more requests.  Our shuttles represent a small part of Emory's dedication to the entire community.\n\nLastly, if you want to email me directly (paul.reeves@emory.edu), I will make sure you are put in touch with the best person on our team to help with your journeys on campus.",
              "author": "Emory_Park-Shuttles",
              "created": 1604941166,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gbnavfo": {
      "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbnavfo/",
      "text": "Love ur username",
      "author": "yungelonmusk",
      "created": 1604866428,
      "upvotes": 3,
      "replies": {
        "gbnkl0e": {
          "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbnkl0e/",
          "text": "thanks :-)",
          "author": "tryingmybestkindof",
          "created": 1604871003,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gbopmkc": {
      "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbopmkc/",
      "text": "I used to ride the shuttle all the time (working from home now), and they worked 99% of the time, so don’t think this one experience is common. Also, no one riding the shuttle gives it a second thought. A guy in a wheelchair used to ride the shuttle home with me every day. I was happy that we had a bus that he could get back and forth to work in.",
      "author": "reffervescent",
      "created": 1604893454,
      "upvotes": 3,
      "replies": {}
    },
    "gbo1ti9": {
      "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbo1ti9/",
      "text": "You do need to ask the driver, but nobody makes a big deal. Totally fine.",
      "author": "IKilledLauraPalmer",
      "created": 1604879885,
      "upvotes": 2,
      "replies": {
        "gbo8zoh": {
          "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbo8zoh/",
          "text": "I went to the shuttle and the ramp wasn't working, the man had to pry it open himself, because I wasn't giving in - felt bad for him because it looked ridiculously heavy but still",
          "author": "tryingmybestkindof",
          "created": 1604883826,
          "upvotes": 2,
          "replies": {
            "gbqg11g": {
              "link": "/r/Emory/comments/jqdou3/shuttle_ramps/gbqg11g/",
              "text": "I want to know more about this...  if it ever happens, get the bus number and time of day.  We have lots of data points to use in our investigation on these occurrences.  You can email the details of the issue to [commute@emory.edu](mailto:commute@emory.edu) or shoot me an email directly: paul.reeves@emory.edu.",
              "author": "Emory_Park-Shuttles",
              "created": 1604941300,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}