{
  "sid": "co986l",
  "link": "/r/Emory/comments/co986l/complex_hall_smith/",
  "title:": "Complex Hall - Smith",
  "text": "Hi! I am going to be in Complex Hall - Smith(4th floor) this year and I've heard some good but mostly bad things about it... I know that once I start living there I'll get used to it but anyone have any tips or tricks to make living there better/easier? Or if anyone can just tell me anything about it that would be great lol cause there are literally no pictures of the inside of the hall anywhere on the internet..",
  "author": "trippingonskies4",
  "created": 1565387980,
  "updated": 1634099371,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "ewgugyk": {
      "link": "/r/Emory/comments/co986l/complex_hall_smith/ewgugyk/",
      "text": "I lived in it pre-renovation and it was not \"bad\" at all. It was a slightly above average dorm for most schools (Emory level or not).  What people are defining as \"bad\" seems to be:\"Not as new looking and feeling as freshman village dorms near the dining hall\"...I think it is a little unfair or a reach to say it is \"bad\" especially after its renovation.  I view it as \"fine and good enough but not amazing\".  Most college dorms are simply not 'amazing\" You should be fine. The older dorms always used to have a little more personality as well as some standard amenities (like a piano or mini gym-don't know if complex has one anymore but it did back in the dinosaur ages, and none of the new dorms have it) not available in newer dorms.\n\nThe problem is that an LSM, Hamilton, or Raoul sets a rather obscene standard, but when I went there, Complex was like an Emory middle-tier before they knocked down or renovated worse (some literally had mold, asbestos and other issues) dorms. If you are desperate for it to be like 4-5 star hotel with dorm sized rooms, then it won't do that, but it is solid compared to most college dorms. (and I was in Hopkins 3rd...we had a crapton of fun..though it never matched Harris's partying ways back then).",
      "author": "oldeaglenewute2022",
      "created": 1565390643,
      "upvotes": 6,
      "replies": {}
    },
    "ewh9b9y": {
      "link": "/r/Emory/comments/co986l/complex_hall_smith/ewh9b9y/",
      "text": "Yo im in smith hall too, thanks for asking this question lol i was really worried too",
      "author": "LaSheep",
      "created": 1565401426,
      "upvotes": 1,
      "replies": {}
    },
    "ewivfbs": {
      "link": "/r/Emory/comments/co986l/complex_hall_smith/ewivfbs/",
      "text": "Which dorms had asbestos?",
      "author": "crusheratl",
      "created": 1565457379,
      "upvotes": 1,
      "replies": {
        "ewiwifp": {
          "link": "/r/Emory/comments/co986l/complex_hall_smith/ewiwifp/",
          "text": "\"McTrimble\"(Mcteirsp? and Trimble) which was demolished and replaced by Raoul and Hamilton.  I think the old Longstreet and Means may have had serious problems.  They only kept around those dorms in decent condition that could be renovated to be like a lesser version of the new dorms.  I think everything but Raoul was finished before I graduated.  Construction at or near the core of campus was insane during my years. Anyone complaining now has no clue (I think psyche, Bookstore/admissions, phase 1 and 2 of Candler Theology, chemistry and most of the new freshmen dorms went/were going up then, and then there were several renovations including Harris).  Several of them were happening in parallel. It was a mess, but the campus today looks better (albeit way more dense) because of it.",
          "author": "oldeaglenewute2022",
          "created": 1565457843,
          "upvotes": 3,
          "replies": {
            "ewjombc": {
              "link": "/r/Emory/comments/co986l/complex_hall_smith/ewjombc/",
              "text": "McTyeire.",
              "author": "crusheratl",
              "created": 1565469716,
              "upvotes": 2,
              "replies": {}
            },
            "ewjouiy": {
              "link": "/r/Emory/comments/co986l/complex_hall_smith/ewjouiy/",
              "text": "I lived in Trimble and always suspected it had asbestos. It was old and poorly designed, though I loved it.",
              "author": "crusheratl",
              "created": 1565469813,
              "upvotes": 1,
              "replies": {
                "ewjpwqk": {
                  "link": "/r/Emory/comments/co986l/complex_hall_smith/ewjpwqk/",
                  "text": "I had friends in it and it was like the 2nd Dobbs.  They had awesome community spirit.  I think at one point there was a tradition of sitting in chairs right outside of the rooms and generally chilling in the hallways.",
                  "author": "oldeaglenewute2022",
                  "created": 1565470242,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}