{
  "sid": "oa99h2",
  "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/",
  "title:": "Oxford DSC101 Preferences",
  "text": "Hey guys,\n\nI am an incoming freshman to Oxford and trying to rank my DSC preferences. I am really into political science/sociology/econ and thinking about doing the QSS & BBA dual degree program. Could someone help me with the list of courses that I currently have in mind?\n\n1. Discovering the Local Economy by Christopher Blake.\n2. Critics of Society by Deric Shannon.\n3. The way I talk: My own language yesterday today and tomorrow by Daniel Walter. **Since the DSC professor automatically becomes my advisor, and I am not planning to major in any foreign languages, would this be an issue (having a different department prof as advisor)?**\n4. Predicting Randomness in Nature by Alfred Farris. **Same concern as 3), the professor is from the physics department.**\n5. Discovering the Southern Table by Bridgette Gunnels\n\nPlease! Comments, thoughts, concerns? Or any recommendations?\n\nTHANKS!!!! :))",
  "author": "Jeremy_YZ",
  "created": 1624976510,
  "updated": 1634097651,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "h3fzxip": {
      "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h3fzxip/",
      "text": "Are you planning on taking a super heavy course load your first semester?  Why is \"a lot of reading\" bad or worrisome.  Mastering the disciplines you are interested in sort of require that.  If that teacher is known to be good and the readings look interesting, do your best to manage it and I'm sure you'll be okay.  Also, I'm gonna keep it real and say that this reddit seems to have an Atlanta bias and there are plenty of Oxford people, but many may not have gone when this Discovery Seminar became a requirement as it is still in its infancy (they may know about these instructors, but faculty tend to run seminars differently than they may run other courses they teach) and a few may even be new Discovery Seminars\n\nThe point being that enough of those seminars may not have been sampled by contributors on here to help.  You may want to just keep the current arrangement you have and maybe \"tour\" seminars if they don't all fill.  Note I also suspect it doesn't have to do anything with what you want to major in. Choose some stuff you wanna learn about.  Welcome to college! You have space to learn for yourself vs. taking a bunch of stuff towards some major or grand plan.",
      "author": "oldeaglenewute2022",
      "created": 1624977796,
      "upvotes": 3,
      "replies": {
        "h3g1lsc": {
          "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h3g1lsc/",
          "text": "I am thinking about taking 18 credits my first semester and it takes time to adapt to college life so... I am not sure how is the workload going to be like though. THANK YOU for the response!",
          "author": "Jeremy_YZ",
          "created": 1624978559,
          "upvotes": 1,
          "replies": {
            "h3g3471": {
              "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h3g3471/",
              "text": "That could be a bit heavy depending upon what courses and professors are in it.  I am among the few that doesn't subscribe to the belief that simply having many credit hours as a 1st year makes the transition intrinsically tough.  One could fill their schedules with only courses with simple content and low workload and/or professors who don't demand very much and 18 hours may end up being a cake walk.  You can likewise have a beastly 14 hours with several very demanding courses.  \n\nIdeally you balance between a mix of classes that really demand something from you and some with lighter demands though.\n\nAlso, with regards to courses with heavy reading loads in college. It usually isn't whether they assign lots of reading. It is whether or not and how they hold you accountable for it.  Like it is really only when they want discussion contributions from everyone for a large chunk of the grade (which can be finessed. Like if you read a lot or most. Contribute early/when those are discussed) or if there are frequent quizzes on the readings that you probably need to read it all.  You can guage all of that by the syllabus. Otherwise it is just a \"keep up the best you can, go at your own pace, and contribute when willing and prepared\" type of thing.",
              "author": "oldeaglenewute2022",
              "created": 1624979245,
              "upvotes": 3,
              "replies": {
                "h3gmajb": {
                  "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h3gmajb/",
                  "text": "This information really helped!! Huge THANK YOU for the comment and it really eases off my anxiety about college.",
                  "author": "Jeremy_YZ",
                  "created": 1624987484,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h3gvaoy": {
      "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h3gvaoy/",
      "text": "having an advisor in a dif dept isnt a big deal at ox bc honestly your advisor doesnt do that much to help you anyway. in terms of discovery seminars, pick ones that arent STEM heavy unless you really love stem bc they will be markedly harder than the humanities ones (from experience - my frosh roommate was in a math one and was miserable). also, ive found an 18-credit courseload to be manageable so long as im not in any classes with labs, otherwise i’d say it’s too much. hope this helps! :)",
      "author": "inigo-mont0ya",
      "created": 1624991316,
      "upvotes": 2,
      "replies": {}
    },
    "h3ih9yl": {
      "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h3ih9yl/",
      "text": "There may be value in picking a discovery seminar outside of your major just to explore interests or fill different grad requirements. That being said I have found it incredibly value to have an advisor within the department I am interested in majoring in. I’m not really sure why people say it’s not that important because at least in my case I have received a lot of useful advice, resources, etc. I have friends who took really interesting discovery seminars but also ended up with advisors who couldn’t really help them as much. Obviously it’s going to vary from person to person, but if I had one complaint about discovery seminars it would be that choosing one seems to create a contradiction between exploring interests and finding the right advisor. But I guess also a counterpoint is that most people don’t stick with the major they have in mind when picking a seminar and switch around anyways.",
      "author": "Electrical_Sort",
      "created": 1625018443,
      "upvotes": 2,
      "replies": {}
    },
    "h3io9n4": {
      "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h3io9n4/",
      "text": "Advisor doesn't matter bc theyre not that useful. You should just pick whichever you find the most interesting or ones that can help you fill HAP/HAL/SNT gen ed requirements since your bba and qss courses will cover you MQR and HSC (if you're taking econ) requirements. Use your dsc to explore your interests outside of your major or to cover other general ed requirements. \n\nI just graduated from ox this year and I'm going to be a junior in the b school in the fall. Although I'm not doubling in qss, still happy to help out and know people who are doing both. Feel free to pm!",
      "author": "cactuscat123",
      "created": 1625022009,
      "upvotes": 2,
      "replies": {}
    },
    "h3ux03v": {
      "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h3ux03v/",
      "text": "Pick whichever you find the most interesting. I'm in the same department as my advisor, although I wasn't when I chose the course. Which is a factor to consider as major changes are veryyy common. The advisors, at least mine, don't do much. This is your education so you have to make the decisions on your own, its nice to get advice, but for me I sometimes find it bothersome when my advisor scolds me. With that being said Blake is a really good professor, I may be biased since I enjoy economics. But really he explains concepts well, so you'll succeed in his course. I've never heard of the others unfortunately.",
      "author": null,
      "created": 1625264057,
      "upvotes": 2,
      "replies": {}
    },
    "h80uxry": {
      "link": "/r/Emory/comments/oa99h2/oxford_dsc101_preferences/h80uxry/",
      "text": "You should take Critics of Society with Deric Shannon. I had him last semester and it was great. Taking the DSC with him will be really interesting start to the intellectual curiosity at Ox and Emory more broadly. And most of the classes you’ll take at Ox will be your GERs, so it doesn’t matter that your advisor isn’t in your major—mine wasn’t.",
      "author": "calebsand12",
      "created": 1628312648,
      "upvotes": 1,
      "replies": {}
    }
  }
}