{
  "sid": "obonbw",
  "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/",
  "title:": "Tip to transfer to Emory?",
  "text": "Hey everyone!\n\nI am an incoming freshman Economics major at Georgia Tech. Emory University was my first choice, and after the waitlist process, I was not accepted. However, eager to make it to my dream university, I am currently planning on applying to transfer to Emory after a year at Georgia Tech.\n\n1. Have any of you heard of seen any GT students successfully transfer to Emory? \n2. Do I have to write the Common App essay again to transfer? And are the supplemental essays  the same as when you apply in high school?\n3. Can you apply for summer? And anyone know when that deadline would be? (The website only has fall info)\n4. Should I take harder classes? or just take the core classes/major requirements that my advisor recommends\n5. Lastly, any general tips for transferring?\n\nI know it's still really early, but I want to prepare!\n\nThanks everyone!",
  "author": "insanepotato3",
  "created": 1625154659,
  "updated": 1634097598,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "h3pexjt": {
      "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/h3pexjt/",
      "text": "Unless you are looking for a specific research focus or double major with something else that Tech lacks or does poorly (maybe QSS/econ makes sense if coming to Emory from Tech or a double in a humanities or social science), I'd take this plan off the table and maybe revisit if you actually end up disliking Tech.  I know these top tier privates can have a weird allure to them, but a person going to Tech shouldn't already be planning to transfer elsewhere unless that place is ultra strong in your area(s) of interest.   Just do what advisors tell you to do for your major/career track and try to enjoy Tech. Definitely don't go in with this unfounded bias that will likely lead to you looking for everything wrong in your Tech experience simply to justify the transfer to yourself.\n\n*As another poster highlighted, econ. Definitely isn't one of Emory's prized undergraduate programs.  I wouldn't go as far as calling it \"bad\" because it mimics the caliber and quality of many other economics undergrad programs including some \"near peers\" and is improving. But it is nowhere near as strong and robust in terms of course rigor, co-curricular opps (like Study Abroad and fellowships/scholarships/special programming) like other majors that have high enrollment at Emory (think GBS BBA, political science, QTM, NBB, biology, and medium sized majors like chemistry.  Hell even small depts like environmental science are more robust).",
      "author": "oldeaglenewute2022",
      "created": 1625160842,
      "upvotes": 6,
      "replies": {
        "h3pgptp": {
          "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/h3pgptp/",
          "text": "As someone who is majoring in Econ I agree that I don’t think that OP should come here for Econ unless they have a strong passion for a research interest in something like health Econ, which I think is probably the strongest part of Emory’s Econ dept, but then again I’m biased towards that.",
          "author": "Squami11",
          "created": 1625161610,
          "upvotes": 4,
          "replies": {
            "h3phuva": {
              "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/h3phuva/",
              "text": "Isn't that program sort of new? Didn't know it was that developed already.  I'm not surprised though.  Any undergrad program or even concentration remotely related to health at Emory will get resources poured into it over time.  But yeah, Emory's econ UG program is kind of just generic. Could take any school('elite' or not) outside of the very best UG econ. Programs (which tend to have or encourage more quantitative rigor) and exchange it and there would hardly be a change.  And while it looks a lot better than when I attended (low bar), from what I can see, it isn't like the other depts I mention which are trying to mimic or rival very top tier analogous UG programs elsewhere by having a special curriculum or a bunch of special co-curric. programs. Looks like it'll settle for 'generic' at the UG level while it tries to rebuild its research reputation and grad. program.",
              "author": "oldeaglenewute2022",
              "created": 1625162095,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h3pn5pv": {
      "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/h3pn5pv/",
      "text": "So I think I see a weird prestige chase going on here: https://www.reddit.com/r/Vanderbilt/comments/oboqbb/tips_for_transferring/?utm_medium=android_app&utm_source=share\n\nAnd not a search for an academic upgrade because the econ. Programs (at the UG level at least) are almost exactly the same (and I have a good friend who majored in it there and saw some course materials. In some areas, Emory may actually have a little more rigor and in some areas they have it.  The co-curricular programming is also very similar) and I doubt Tech is very different from these two in that department. Other than wanting a smaller environment, I don't see the point of this preliminary itch to transfer. To me VU and GT seem kind of similar in terms of social life potential (both in or near city cities and have a decent D1 sports and Greek contribution to the scene) and one is just bigger and has an emphasis on STEM.\n\n*Not shocking that redditters of one school are borderline encouraging the transfer while one group is being more realistic and honest about what the OP should do (not being committed to this process before even starting Tech). Just sayin...interesting difference in culture (and I suspect responses would be the same from a broader audience beyond reddit from each).",
      "author": "oldeaglenewute2022",
      "created": 1625164384,
      "upvotes": 7,
      "replies": {}
    },
    "h3pa0rw": {
      "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/h3pa0rw/",
      "text": "For what it's worth, Emory's econ department is actually pretty bad, so I'd recommend reconsidering that, unless you want to do like an Econ + BBA double major",
      "author": "The_MartianManhunter",
      "created": 1625158770,
      "upvotes": 6,
      "replies": {}
    },
    "h3pa4jw": {
      "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/h3pa4jw/",
      "text": ">Have any of you heard of seen any GT students successfully transfer to Emory? \n\nTo be honest, no. It's usually the other way around or someone doing the dual degree program (and not really finishing it).\n\n>Do I have to write the Common App essay again to transfer? And are the supplemental essays  the same as when you apply in high school?\n\nThere's a transfer essay which is pretty much the same thing except obviously you need to outline it differently as a transfer.\n\n\n>Can you apply for summer? And anyone know when that deadline would be? (The website only has fall info)\n\nOnly Fall transfers, as far as I know.\n\n>Should I take harder classes? or just take the core classes/major requirements that my advisor recommends\n\nNo, take classes you are interested in and do well in them. Doing well is more important.\n\n>Lastly, any general tips for transferring?\n\nYou need to be able to honestly describe why Georgia Tech is not enough for you. They are both great schools and Emory will have a hard time seeing why Georgia Tech can't give you what you want. Both have Economics so it's not like Emory offers a degree that you can't get at Georgia Tech. \n\nI'm not even sure why Emory is your dream school, you've never attended Emory so you're basing it off of... well, nothing really. Unless you have spent a lot of time in Atlanta and have had strong and consistent ties to Emory, it doesn't deserve to be your dream school. You should give Georgia Tech a chance.\n\nSource: I am a transfer.",
      "author": "MyKali",
      "created": 1625158814,
      "upvotes": 8,
      "replies": {}
    },
    "h3qc1tq": {
      "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/h3qc1tq/",
      "text": "A great GPA and a good explanation for transferring should do it. But yes I knew a 2 GT transfers while at Emory. GT is a good school so not as hard to transfer. Also I agree the econ department at Emory is better than GTs but UGA's department is the best in the state.",
      "author": "91210toATL",
      "created": 1625175184,
      "upvotes": 1,
      "replies": {}
    },
    "h3qfc5a": {
      "link": "/r/Emory/comments/obonbw/tip_to_transfer_to_emory/h3qfc5a/",
      "text": "I mean, like other people mentioned, you need to have good reasons to transfer from Tech. Successful transfer applicants usually transfer from schools that have a weak department in something they’re interested in (like astronomy at Emory) or because they just don’t like the overall environment there. The latter makes sense with tech — maybe someone from there would want to go to a smaller school? Also, idk much about Tech but if there’s an emphasis on STEM then that might be a reason too.\n\nIf you’re generally fine going to a large school and the Econ department is solid it’s not going to be easy to transfer. You could always bs your reasons but I wouldn’t recommend it. I would give tech a chance and see if you like it.",
      "author": "LostWindSpirit",
      "created": 1625176672,
      "upvotes": 1,
      "replies": {}
    }
  }
}