{
  "sid": "pmnau3",
  "link": "/r/Emory/comments/pmnau3/room_vacancy_complex_male_freshman/",
  "title:": "Room Vacancy (Complex), Male Freshman",
  "text": "Hi there! \n\nFor freshmen, I have had an extra space in my room (my roommate is taking a gap year) since the beginning of the semester. \n\nSince Emory sent an email about potentially having a new roommate, I prefer to have a roommate that I already know than getting a random one. \n\nIf you didn’t settle well with your roommate and want to change your room, shoot me a PM introducing yourself and I’ll do the same!",
  "author": "Emory25throwaway",
  "created": 1631426820,
  "updated": 1637411861,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.95,
  "comments": {
    "hkr39od": {
      "link": "/r/Emory/comments/pmnau3/room_vacancy_complex_male_freshman/hkr39od/",
      "text": "Or you could just enjoy the extra space? Same situation happened to me my freshman year in complex, made it super simple to bring my gf over all the time",
      "author": "plainbread11",
      "created": 1637002299,
      "upvotes": 1,
      "replies": {
        "hkxjh2q": {
          "link": "/r/Emory/comments/pmnau3/room_vacancy_complex_male_freshman/hkxjh2q/",
          "text": "This was 65 days ago but thanks for the input nonetheless lol. I’m a bit extra extroverted so not having a roommate honestly sucked so bad, luckily it worked out with a decent guy at the end.",
          "author": "Emory25throwaway",
          "created": 1637112668,
          "upvotes": 1,
          "replies": {
            "hkxjoas": {
              "link": "/r/Emory/comments/pmnau3/room_vacancy_complex_male_freshman/hkxjoas/",
              "text": "Lol I discovered the sub and just decided to comment on the top posts I saw.\n\nYeah that makes sense man. Honestly I sometimes wish it had worked out with my roommate— nothing bad happened, he moved out because he found our room in complex too small— but things happen for a reason! Hopefully you and your roommate continue to work out alright :)",
              "author": "plainbread11",
              "created": 1637112758,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}