{
  "sid": "nmnvx9",
  "link": "/r/Emory/comments/nmnvx9/spring_2022_graduation_advice_long_post/",
  "title:": "Spring 2022 Graduation Advice (Long Post)",
  "text": "Based on current trends, do you think next year’s graduation ceremony will be outside on the quad like in previous years, or similar to this year’s graduation? I’m asking as I graduate in August, but my family’s harking me to go to Spring commencement despite the fact that I will receive my diploma in the mail way before it. I understand why parents and families want to celebrate their children’s achievements through graduation ceremonies, but there are several factors that I’m considering in my decision:\n\nA) I will be the first person in my family to graduate from college. This should be exciting, but my dad is only one semester behind me in graduating (at another school) anyways. \n\n\nB) I paid my way through school through grants and working all year, not my parents. If they had paid for it, I’d probably go, but they didn’t. Also, because my family is low-income, I was often the de facto childcare for my younger siblings and missed out on a lot of experiences and important schoolwork growing up. I was always playing catch-up in school. Honestly, I feel like I succeeded *in spite* of my family, not because of them. \n\n\nC) My mother says it’s my decision, although she would be lying if she said she wasn’t a little disappointed. My father is the more adamant one telling me that I need to go and that I’m going to regret this, and it’s causing some tension between me and him. He's being borderline threatening, saying \"**No, you will go.**\" I have a crappy relationship with him and I don't think he deserves to see me walk regardless, but unfortunately my mom refuses to go without him.\n\n\nD) I'm appreciative of my time and schooling at Emory, but I have no close ties to it. I didn’t make any close friends or have any strong relationships with my professors. There’s no one to reconnect with, I haven’t been on-campus since the pandemic started. It will have been 2 years since I've been on campus, and all I remember of my time on campus was that I liked my classes, but mentally I was at my worst. I feel some anxiety thinking of going back because of how awful those 2.5 years were. With all the time that has passed I can look back on it (somewhat) fondly, but if I go back now I will just see all the places I considered taking my own life :(\n\n\nE) Hot weather makes me queasy. Spring + gown + lots of people = Vomit Central. My high school graduation was also outside and I almost passed out from the heat alone, on top of sitting in a sweaty gown for 3 hours packed in next to 500 other graduates (alphabetically I’m almost last in line). It was a miserable experience and I don’t want to go through that again. \n\n\nF) It'd be a lot of travel for a degree I will already have celebrated receiving in the summer. I would only be going for the ceremony. At the same time, I never got to go to the Georgia Aquarium...if I go to the ceremony then maybe I can finally give it a visit as my own consolation.\n\n\n\nIf ‘22 graduation is more like this year’s ceremony, where people are spread apart and it’s indoors, I might consider going for my mom and my mom only. At least I won't be physically uncomfortable. But if it’s back on the quad packed in like sardines....would it be terrible if I stood my ground and said no? I'd like to celebrate doing something I want to do, like going out to the zoo or an amusement park, something fun that everyone can do! Not just sitting in a ceremony for 3+ hours at a school I almost died at. I wish my parents understood that. What should I do? \n\n\n\nTLDR: I hate hot weather and my dad. I graduate in the summer and I don't want to go to Spring graduation months later, but that makes my mom sad (I like my mom). What should I do?",
  "author": "kissingfish",
  "created": 1622169507,
  "updated": 1634098044,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.79,
  "comments": {
    "gzq7wur": {
      "link": "/r/Emory/comments/nmnvx9/spring_2022_graduation_advice_long_post/gzq7wur/",
      "text": "If I were in your place, personally I wouldn't go. However, our lives are completely different. I am older. I've been to many 'graduations' in life for all kinds of schools, small or big, civilian or military. I noticed that nobody could nearly be as invested in my graduation than I was, so their opinions don't matter to me at all.\n\nSo if going was optional and it would make me proud of my accomplishments, I would go. If not, I wouldn't. That's as simple as it gets for me.\n\nLike you, I am paying for my education by myself. I receive no help from my family. We don't speak so they are never going to be invited to anything I have accomplished. Why do I need to sacrifice my time so others can celebrate my achievements they had no part in? Like I said, different lives (but in some ways, similar).\n\nIt looks like you will be disconnected further by waiting one year to even attend. You won't know if you'll have other things by that time that will keep you from going.\n\nGeorgia Aquarium? That's more worth it. Just book a weekend trip any other time and get the city pass so you can check out Zoo Atlanta, too. Spring time is best for that. That way it's not too hot for you and the animals show up.\n\nEDIT: As far as your mother, if you like her, you should spend some time with her. Just the two of you. Do an informal celebration and show her what you actually earned: maturity and education. Not a 10-second walk across a stage and not a piece of paper. A personal weekend celebrating creates more memories to cherish. Take pictures and videos, so you can see her and hear her voice in the future when you miss her most.",
      "author": "MyKali",
      "created": 1622180567,
      "upvotes": 8,
      "replies": {
        "gzq9j0q": {
          "link": "/r/Emory/comments/nmnvx9/spring_2022_graduation_advice_long_post/gzq9j0q/",
          "text": "Thank you for the advice! I like the matter-o-fact way you think about it :) And I’ll definitely find the chance to visit that aquarium, it looks stunning from the photos I’ve seen.",
          "author": "kissingfish",
          "created": 1622181784,
          "upvotes": 3,
          "replies": {
            "gzqbnyx": {
              "link": "/r/Emory/comments/nmnvx9/spring_2022_graduation_advice_long_post/gzqbnyx/",
              "text": "I wish you the best of luck. It's not easy to put your situation into words for strangers to see, even if you are anonymous. You have some time to think about it, though.\n\nFormal celebrations have their place, but it limits many people in some ways. We should treat every normal day as if it were our last, because it can be. We don't need to wait for Jan 1st to start fresh or quit a vice, nor a birthday to give someone a present or a call, nor an anniversary to spend some well-deserved time with someone special, nor a graduation to celebrate that we accomplished something. We can only live in the present.",
              "author": "MyKali",
              "created": 1622183458,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gzrfiai": {
      "link": "/r/Emory/comments/nmnvx9/spring_2022_graduation_advice_long_post/gzrfiai/",
      "text": "I almost didn't go this year, mainly because I didn't think the travel was worth it for a ceremony that frankly isn't that important to me.\n\nI ended up going because I realized I had one chance to see my friends again and if I didn't go, there are quite a few people I'd probably never see again. So I took it as an opportunity to say goodbye. Worth it.",
      "author": "phraps",
      "created": 1622211626,
      "upvotes": 3,
      "replies": {}
    }
  }
}