{
  "sid": "dxlxzn",
  "link": "/r/Emory/comments/dxlxzn/applying/",
  "title:": "Applying",
  "text": "Hello. I am an senior in an american curriculum international high school, and would really like to go to Emory for college. I am of German and Austrian nationality, but have lived my entire life in the Philippines as a missionary kid. I would like to apply for Emory, but I need scholarships. Can anyone give me some advice as to how scholarships work? Is it possible to receive a full scholarship? I only have 40 people in my high school, so academic advising is not very good...\n\nWhat types of scholarships could I earn?\n\nBy the way I am interested in a psychology and philosophy degree. Is Emory a good school for that?\n\nThank you for your input!",
  "author": "LucGap",
  "created": 1573993462,
  "updated": 1634099365,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "f7tih1q": {
      "link": "/r/Emory/comments/dxlxzn/applying/f7tih1q/",
      "text": "[https://apply.emory.edu/financial-aid/international.html](https://apply.emory.edu/financial-aid/international.html)\n\nThere are three or four choices for you.  1)Simply express interest in being considered for Emory Scholars on the application\n\n2) Apply for need aid as suggested above (but I think we are need-aware for internationals)\n\n3) Both\n\n4) Simply check the Scholars box and then apply and hope for that or the Liberal Arts Scholarship (a partial).\n\n&#x200B;\n\n\\*Problem is, if you wanted to be considered for the Woodruff Scholars program (or its niche based spin-offs like music and debate), you needed to apply by 11/15 and have said \"yes\" to be considered for those signature scholarships: [https://apply.emory.edu/financial-aid/types-of-aid/scholar-program.html](https://apply.emory.edu/financial-aid/types-of-aid/scholar-program.html)\n\nAt this point, need aid and the Liberal Arts Scholarship are your possible outcomes if you haven't applied and said yes for scholarship consideration.\n\nAnd yes, those programs are very good, especially psychology which you should know is more science/biological learning than social psychology learning (unlike many other undergraduate psychology programs).",
      "author": "oldeaglenewute2022",
      "created": 1574004690,
      "upvotes": 6,
      "replies": {
        "f7x2e72": {
          "link": "/r/Emory/comments/dxlxzn/applying/f7x2e72/",
          "text": "All right, thank you for the insight",
          "author": "LucGap",
          "created": 1574044430,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f7t9o6q": {
      "link": "/r/Emory/comments/dxlxzn/applying/f7t9o6q/",
      "text": "What are your stats?",
      "author": "Dr_Yankee",
      "created": 1574002381,
      "upvotes": 1,
      "replies": {
        "f7x2dkg": {
          "link": "/r/Emory/comments/dxlxzn/applying/f7x2dkg/",
          "text": "What do you mean with \"stats\"? I am not familiar with that term.",
          "author": "LucGap",
          "created": 1574044416,
          "upvotes": 1,
          "replies": {
            "f7xc0bh": {
              "link": "/r/Emory/comments/dxlxzn/applying/f7xc0bh/",
              "text": "Your unweighted GPA, your SAT/ACT score, Extracurriculars",
              "author": "Dr_Yankee",
              "created": 1574052181,
              "upvotes": 1,
              "replies": {
                "f7xxs2x": {
                  "link": "/r/Emory/comments/dxlxzn/applying/f7xxs2x/",
                  "text": "oh ok\n\nWell my GPA is around 4.1 (due to AP classes)\n\nmy SAT is 1380, and I am in student council and in the soccer varsity team. I was also in the worship team for three years.",
                  "author": "LucGap",
                  "created": 1574079981,
                  "upvotes": 1,
                  "replies": {
                    "f7y2aks": {
                      "link": "/r/Emory/comments/dxlxzn/applying/f7y2aks/",
                      "text": "That SAT score’s going to hurt you bad. A competitive score for Emory is around 1500",
                      "author": "Dr_Yankee",
                      "created": 1574084366,
                      "upvotes": 2,
                      "replies": {
                        "f80dzfp": {
                          "link": "/r/Emory/comments/dxlxzn/applying/f80dzfp/",
                          "text": "Depends on the major. If you’re pre med for sure it’s definitely a weak point, but for less popular majors for departments they are trying to fill, it’s definitely not that bad (I had a 1460)",
                          "author": "SupahWalrus",
                          "created": 1574126775,
                          "upvotes": 2,
                          "replies": {
                            "f80mh8k": {
                              "link": "/r/Emory/comments/dxlxzn/applying/f80mh8k/",
                              "text": "1460 and 1500 are essentially the same and 1460 is average or near the median for admits.  For things like pre-health or STEM aspirations, if expressed, they may look at specific APs, SAT2s, SAT math.  The overall SAT score doesn't translate that well to success in STEM though certain threshold math scores (a lot of elite schools and Ivies find that 650-700 math is the magic number for general chemistry courses. \n Beyond that, AP scores become differentiators and could arguably compensate in case one is lower) tend to predict chances of doing well in quantitative STEM courses.  Basically, even a person expressing interest in pre-med or STEM would likely get a nuanced reading of their application and academic achievements.  Generally median scores at elite schools are 1450 and higher. Emory is no longer exceptional.  What can be said is that you don't have to have the median to be competitive.  Just avoid the bottom quartile of admits which is where the OP is.",
                              "author": "oldeaglenewute2022",
                              "created": 1574132599,
                              "upvotes": 2,
                              "replies": {
                                "f80pekf": {
                                  "link": "/r/Emory/comments/dxlxzn/applying/f80pekf/",
                                  "text": "I feel like emory does a good job of being holistic in their application review. I whole heartedly believe that my SAT would not have been favorable for me if I was premed but I originally intended mathematics so my scores were favorable. Based on my anecdotal experience, many pre med kids have had higher stats than me and overall better applications than me (subjective of course) but got waitlisted while I was accepted. I truly do think the intended major is a big factor as they do have a need to fill departments",
                                  "author": "SupahWalrus",
                                  "created": 1574134728,
                                  "upvotes": 1,
                                  "replies": {
                                    "f80q6km": {
                                      "link": "/r/Emory/comments/dxlxzn/applying/f80q6km/",
                                      "text": "There is known to be clustering of higher SATs in  STEM courses/majors everywhere, but I don't think that is because Emory intentionally selected it to be that way.  That is hard to do when the score range of admitted students is as narrow as it is at schools like Emory (and of course many other elites are even more score centric) .Beyond a certain point, they know that they  won't see better performance based on SAT/ACT.  So what you observe has merit, but I think it really is self-selection effects.  You could potentially even see it on a per course section basis.  Like take organic chemistry sections. \n\n Those who take Weinschenk (who writes reading intensive tests that have lots of higher ordered problems) may be enriched for those who are generally better at taking tests because you have to be the type not daunted by or confident in your ability to prepare for low average exams that test more than just the content that was explicitly. taught in class.  It takes a special type to prep. for tests that you know may have surprises or ask you to go beyond what you were taught. A lot of STEM courses do that. Sometimes in good faith and sometimes in bad faith. People who are averse to that sort of thing will steer clear and go to disciplines that are less test heavy or tend to have more \"straight-forward\" (read-fact regurgitation/algorithmic learning) tests when they do.",
                                      "author": "oldeaglenewute2022",
                                      "created": 1574135307,
                                      "upvotes": 1,
                                      "replies": {
                                        "f81fgww": {
                                          "link": "/r/Emory/comments/dxlxzn/applying/f81fgww/",
                                          "text": "That makes sense. I guess the SAT is more of a signaling factor than I had thought. I guess to address OP , his SAT score will be a weak spot regardless of his choice of study, but won’t be the reason why he doesn’t get in",
                                          "author": "SupahWalrus",
                                          "created": 1574165466,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}