{
  "sid": "mxbh1n",
  "link": "/r/Emory/comments/mxbh1n/heemstra_vs_weinschenk_vs_soria/",
  "title:": "Heemstra Vs. Weinschenk Vs. Soria",
  "text": "For anyone with experience and/or information, who should I choose for Chem 203?\n\n1) Weinschenk is best known, but I heard that his exams are very difficult even though he curves hard.  \n2) Heemstra teaches just as good as Weinschenk but is easier with a slightly different teaching style.  \n3) Soria is having in-person classes, which can be an advantage.\n\nThanks!",
  "author": "Renn132",
  "created": 1619233754,
  "updated": 1634098200,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "gvneawq": {
      "link": "/r/Emory/comments/mxbh1n/heemstra_vs_weinschenk_vs_soria/gvneawq/",
      "text": "I’m in Weinschenk’s class rn, he told us his classes are actually in-person next semester!! He is a phenomenal professor in absolutely every regard. His class is hard but not unreasonable\n\nThat being said, I don’t think you can really go wrong with any of these 3 instructors…they’re all excellent",
      "author": "j11234567890",
      "created": 1619239345,
      "upvotes": 4,
      "replies": {}
    },
    "gvn7c8u": {
      "link": "/r/Emory/comments/mxbh1n/heemstra_vs_weinschenk_vs_soria/gvn7c8u/",
      "text": "I don't think the 2nd thing is true.  I think Heemstra gets a \"not Weinschenk\" bump.  Soria and Weinschenk are most alike in teaching style and rigor.  What are you looking to get from these courses other than an A?  Do you want/are you willing to learn it at a high level?  Does having challenging exam items scare you? Are you a chemistry major or pre-health that will need to take the MCAT? Do you foresee yourself perhaps seeking a reccommendation letter from or developing a relationship with any of these instructors? Would you be interested in TA oppurtunities if you put up a decent performance? Think beyond just the grade.\n\nIf you actually wanna learn (especially if a chemistry major or a person needing to take an MCAT) at a high level and can tolerate being challenged on exams (it'll numb you to MCAT like biochem and chemical bio passages and pre-expose you to figure and reading intensive Qs) go with Weinschenk or Soria all the way.  The experience is a bit richer and they are more hands on when supporting and developing students (which is quite amazing for Weinschenk considering his section sizes).\n\nIf you are just trying to get past the course and will run off to bio to take bchem or have a heavy courseload, maybe go Heemstra I guess. I hear he is good enough for sure, but I wouldn't put him in tier with Soria and Weinschenk no matter what RMP says.  The latter two are most alike.  Also, apparently Weinschenk WILL be in person.  You should note that regardless of exam difficulty, their course GPAs will likely come out the same which is usually why I air on the side of just sucking it up and learning the more complex material and problems with Soria or Weinschenk. Weinschenk has his curve and Soria bonus points that can be applied to tests.  Heemstra is sort of a wolf in sheeps clothing.  I think he has high\"ish\"(compared to the other two) midterm averages because his problems are simpler, but I think he gives sort of a killer final that deflates the final course grades to where Soria and Weinschenk would be after whatever adjustments.\n\nWeinschenk gives difficult midterms and an \"apology final\" that is usually an oppurtunity to gain ground (because for whatever reason, the average of the final is usually the same as the midterms) as it typically lacks the higher level problem solving section he puts on midterms.  Soria can be tough all the way through but there are random ways of getting bonus points like sporting events in addition to the more academic bp oppurtunities (through group problem sets and in class bonus point questions).",
      "author": "oldeaglenewute2022",
      "created": 1619234801,
      "upvotes": 4,
      "replies": {}
    },
    "gw83u7p": {
      "link": "/r/Emory/comments/mxbh1n/heemstra_vs_weinschenk_vs_soria/gw83u7p/",
      "text": "Soria is the chillest guy ever. Jose can be forgiving in terms of grading (bonus points).\n\nHeemstra is also a very very good option. He's a fantastic teacher so you will be well prepared for exams.\n\nWeinschenk probably the hardest option but still not a bad choice",
      "author": "thisisme4",
      "created": 1619647099,
      "upvotes": 1,
      "replies": {}
    }
  }
}