{
  "sid": "oktme0",
  "link": "/r/Emory/comments/oktme0/thoughts_on_housing/",
  "title:": "Thoughts on Housing?",
  "text": "So I’m an incoming freshman and I just got assigned to Eagle Hall. I haven’t really heard about Eagle Hall, so I was just wondering if anyone had anything they wanted to share about it? Maybe like goods, bads, anything in between?? Anything is appreciated, thanks!",
  "author": "DoctorAc3",
  "created": 1626358210,
  "updated": 1634097531,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "h59zqlx": {
      "link": "/r/Emory/comments/oktme0/thoughts_on_housing/h59zqlx/",
      "text": "I believe that Eagle Hall used to be Longstreet Means (they changed the name since the guy the dorm was named after was racist/did racist things). If you search Longstreet Means on this sub you’ll find more information on how it compares. From what I know, however, you got pretty lucky. This dorm is relatively new and large, and doesn’t have many, if any, problems to be aware of.",
      "author": "mistyholly",
      "created": 1626358418,
      "upvotes": 14,
      "replies": {
        "h59zxi5": {
          "link": "/r/Emory/comments/oktme0/thoughts_on_housing/h59zxi5/",
          "text": "Thanks so much!",
          "author": "DoctorAc3",
          "created": 1626358507,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h5abbnh": {
      "link": "/r/Emory/comments/oktme0/thoughts_on_housing/h5abbnh/",
      "text": "Eagle Hall is re-named LSM. It’s the biggest dorm (which has advantages and disadvantages) but has huge, super nice rooms. There are lots of common spaces and one has a fireplace (which is still cool even though we’re in Atlanta and it doesn’t usually get freezing lol). Located right on the freshman quad",
      "author": "j11234567890",
      "created": 1626363511,
      "upvotes": 7,
      "replies": {}
    },
    "h59zgud": {
      "link": "/r/Emory/comments/oktme0/thoughts_on_housing/h59zgud/",
      "text": "(copied from an old post, written by another user)\n\n“Raoul: The biggest and newest dorm. All the rooms are pretty nice, carpeted floors, high ceilings, sinks in the room, climate controls, ability to loft beds, pretty nice bathrooms, rooms are climate controlled. Lots of study lounges but they tend to fill up so you may have to go hunting for a spot once in a while, but overall pretty nice. It’s in a great location, near the student center, closest too the mailing center and all the other freshman dorms. Downsides is that it’s right by the train tracks and trains do come by pretty often, so if you’re windows are open you’ll definitely hear them.\n\nLSM (now called Eagle): the second biggest and newest dorm. Almost identical to Raoul. Only big difference is that it’s an extra 30s away from the student center lmao. Is an international hall (not to say other halls don’t have international students), but LSM is themed around that. I personally enjoyed it but ymmv. It leads out to an Uber pick up stop, is close to the bus station, closest to woodies ( a late night dining place) and kaldis (a non Emory dining hall, and close to all the research labs. Biggest downside is that it is furthest from most classes except for the bio building which it is the closest too.\n\nHamilton: right next to Raoul, super close to the student center, nice rooms, but the amenities are just slightly inferior to Raoul or LSM. Similar to  LSM in terms of rooms, and a perfectly fine dorm (still leagues over your typical state school dorm) It’s themed around black excellence? I can’t speak much on it. Mid size in terms of number of kids.\n\nTurman: right next to LSM and Hamilton, super close to the student center, nice rooms, but the other amenities are just slightly inferior to Raoul or LSM. Similar to  LSM in terms of rooms, and a perfectly fine dorm (still leagues over your typical state school dorm)\n\nAlabama: It’s closest to the center of campus, 2 mins walk from the student center, super close to all the classes (except bio building) and has the widest rooms. Not necessarily tall but really wide. Amenities are similar to turman, and is close to cox hall (literally connected) which is a dining alternative to student center which doesn’t use swipes (uses Dooley dollars).\n\nDobbs: this dorm is the one you’ve probably seen on tour. It’s the smallest and arguably the worst dorm. Rooms are small and the hall is eh. It does have an nice basement with a pool table, large tv, and ping pong table, and is in the best location on campus. 20 seconds away from the student center, Cox, and closest to all the classes. Kids from dobbs are known to get close with each other since nobody really wants to stay couped up in their rooms, but I haven’t really noticed it. Nobody says “let’s go study in dobbs” but It’s location is unbeatable. Rooms are small, have all the same amenities and had a roach problem (it’s an southern thing, I’ve never seen a roach in my dorm room though).\n\nComplex: definitely the weirdest of the bunch, since it’s composed of three smaller dorms all surrounding a center complex with some cool foliage. It’s cut off from all the other freshman dorms as it’s furthest away from everything. It’s closest to the library, business school, the performing center (for all you band kids), and the music building. It’s close to classes as well, the only real downside is that it’s so damn far from all the other dorms (as in far I mean like a 5 minute walk). The rooms are okay. Definitely on the small side and the sinks are the smallest\n\nOverall, any of these dorms kick your typical state school dorm (all have AC’s, nice bathrooms, amenities, etc.). The biggest thing is location, which won’t matter in the beginning but the two minutes to walk to the dining hall will slowly begin ware on you.\n\nIn terms of dorm life, the first two weeks you’ll really get to know your floor mates. Depending on the dynamic, it’ll either stay that way or completely fall apart. It’s usually the busiest in terms of dorm stuff the first two weeks with songfest and coke toast. Lots of res life stuff going on. Songfest is basically your entire hall doing a song and dance routine to pop songs, great way to bond with your floor since that’s how it’s divided up. Your orientation groups will be mixed (based on the ECS 100 class you join), so you’ll get to meet people from other halls as well. Dorm life kinda tanks from there, and there will be events every once in a while, but once Greek life gets going, res life falls into the background (still plenty of res life stuff to do, just not as popular as it is the first few weeks).”",
      "author": "spencerpw085",
      "created": 1626358291,
      "upvotes": 7,
      "replies": {
        "h59zubi": {
          "link": "/r/Emory/comments/oktme0/thoughts_on_housing/h59zubi/",
          "text": "Thanks so much for the detailed info! I really appreciate it!",
          "author": "DoctorAc3",
          "created": 1626358466,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  }
}