{
  "sid": "m781sh",
  "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/",
  "title:": "I got accepted, but I have a question",
  "text": "So I'm big into languages. It's kind of my main thing. I want to take Mandarin, Japanese, Korean, and Tibetan. Is that possible to do? Is it ill-advised to do? I just would like to know what do you guys think.",
  "author": "ntzkikun",
  "created": 1616008246,
  "updated": 1634098892,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "gr9tjr1": {
      "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gr9tjr1/",
      "text": "I’d just keep in mind that intro courses for foreign languages are notoriously time consuming!",
      "author": "blueravenclaw29",
      "created": 1616010161,
      "upvotes": 14,
      "replies": {}
    },
    "gr9t77u": {
      "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gr9t77u/",
      "text": "Sure. Keep in mind that you still have to complete your general education credits and your major(s)/minor credits. You can use your left over elective credits to take the intro courses for these languages. You could also major/minor in one or two of the languages, too",
      "author": "Bubbly-Vanilla-6711",
      "created": 1616010004,
      "upvotes": 10,
      "replies": {
        "gr9ysah": {
          "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gr9ysah/",
          "text": "Alright. Thank you for your comment.",
          "author": "ntzkikun",
          "created": 1616012511,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gr9v8xv": {
      "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gr9v8xv/",
      "text": "I would keep in mind, based on in person credit hours, Korean is 4, Japanese is 5, and Chinese is 5. You would also be attending most of these classes 5 days a week with 2 vocab quizzes per class, not to mention speaking and writing challenges. I don’t think Tibetan is always offered, but there is SILS to learn languages that are not offered. Also, another thing to keep in mind is if you are already knowledgeable in one of those East Asian languages. Japanese and Chinese is significantly harder for English speakers than Korean. I believe if you want to do majors like Linguistics or CompLit or East Asian Studies, languages are expected as part of your major, if that’s something you are considering.",
      "author": "Worldlover67",
      "created": 1616010919,
      "upvotes": 6,
      "replies": {
        "gr9y6v0": {
          "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gr9y6v0/",
          "text": "I should've mentioned that I intend to major in East Asian Studies. I have intermediate experience in Chinese. I'm interested in them all pretty deeply. I've already started doing basics for Korean, Japanese, and Tibetan, so I have a grasp on their difficulty. Thanks for the information about the credit hours.",
          "author": "ntzkikun",
          "created": 1616012245,
          "upvotes": 3,
          "replies": {
            "gr9yxt9": {
              "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gr9yxt9/",
              "text": "Many of these have placement exams. Just take them honestly and it'll get it somewhat right.  You'll have time to experiment with different levels until you feel comfy if you play your cards righting during the add/drop/swap period",
              "author": "oldeaglenewute2022",
              "created": 1616012581,
              "upvotes": 4,
              "replies": {
                "graeidd": {
                  "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/graeidd/",
                  "text": "I see. Thanks!",
                  "author": "ntzkikun",
                  "created": 1616019874,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "gra072b": {
              "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gra072b/",
              "text": "Gotcha, in that case, I’d really suggest talking to a department advisor about their thoughts on such a workload. Also, if you are a heritage speaker in chinese, 303 and above is massive amounts of reading and writing, which my roommate struggled with, particularly since there were actual native speakers in the class. Other than that. It’s nice to see you at least have the fundamentals down, just keep in mind the classes have tons of busywork because repetition is key to learning languages.",
              "author": "Worldlover67",
              "created": 1616013149,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gra5lni": {
      "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gra5lni/",
      "text": "tl;dr: It's definitely possible, whether it's advisable depends on your goals.\n\nEmory is big into cross disciplinary studies, but they do have a limit on the number of majors/minors you can take (no more than two as far as I know). Despite that, I don't think that would stop you at all from exploring all the languages, you may just not get a degree for all the languages you're interested in.\n\nIn regards to whether that's an advisable thing to do, there's no right answer. It's definitely possible, but whether it's the right thing to do depends on your goals. Career-wise, I'm not familiar enough with either Emory's language dept or the career field to speak on that, so that's on you to figure out or someone else to bring up. Regards to your time at Emory, we have a really diverse student body and you'd have plenty of ability to apply what you learn everyday. I'd suggest you look into the [East Asian Studies Dept at Emory.](http://eastasianstudies.emory.edu/home/index.html) You might find something of interest there.\n\nRegarding classes, Emory has a pretty wide breadth of GERs (General Education Requirements), so you may run into that being an issue since you'll have to take classes outside of your intended field and that may limit how deep you get into each language. Also, the intro level languages are typically quite difficult, I know Japanese and Mandarin are notoriously difficult. So it won't be easy, but if you're really into it, I could see it being really rewarding. If anything, it'd be better that they're difficult rather than a cakewalk.\n\nIn my unqualified opinion, regardless of career and stuff, you'd be stretching yourself thin if you plan on taking each of those languages in depth. I've seen people take multiple languages and get a working proficiency in all of them, but they would have a main language. I remember meeting a girl who dabbled in Spanish, French, and Korean, but was really fluent in Japanese and their focus of study was around that, and where most of their culture learning went towards. So I'd suggest narrowing down to a language or a similar set of languages (e.g. Latin languages), and dabble in whatever you find interesting. Obviously, explore first to determine, but at some point, hone in on one to really juice it.\n\nBut I'm just a cs major, what do I know.",
      "author": "SupahWalrus",
      "created": 1616015608,
      "upvotes": 4,
      "replies": {
        "graefjd": {
          "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/graefjd/",
          "text": "First, thanks for the well-thought-out comment! I'm not sure what my main language would be. Right now it has to be Mandarin Chinese just because I've progressed much farther in comparison to only knowing writing system basics and basic phrases in the others. Based on the East Asian Studies Program website, I would be taking all the language offered by the program. I already spend a lot of my free time studying those languages, so I would actually enjoy the motivation/pressure of classes. BTW for a cs major, you seem to know quite a lot!",
          "author": "ntzkikun",
          "created": 1616019835,
          "upvotes": 3,
          "replies": {
            "grbsz27": {
              "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/grbsz27/",
              "text": "Don't forget the part about careers related to the subject. There are many careers in foreign languages. What do you want to work towards? What languages should you prioritize?",
              "author": "Skytram_",
              "created": 1616049948,
              "upvotes": 1,
              "replies": {}
            },
            "grdq87j": {
              "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/grdq87j/",
              "text": "I too have a itch for learning languages, so I'm a little privy to it. But honestly, Chinese seems like a great choice, but I'd definitely recommend you explore. I'd also consider the cultural aspects since you would be forced to take those type of courses to get a major in any language, so outside of language proficiency, if you're truly interested in all of them linguistically, your historical and cultural tastes may help you narrow down. Just keep an open mind and always weigh your intellectual interests with your career and keep a healthy balance and you'll just fine.",
              "author": "SupahWalrus",
              "created": 1616085841,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gr9uxjn": {
      "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gr9uxjn/",
      "text": "Learn whatever the hell you want and at whatever pace you want! if you wanna explore all of those I recommend trying to place correctly if you have previous experience. That way you can avoid the time consuming intros another poster mentioned. If you have enough experience and enjoy learning languages, no reason not to place on level.",
      "author": "oldeaglenewute2022",
      "created": 1616010781,
      "upvotes": 5,
      "replies": {
        "gr9ynqi": {
          "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gr9ynqi/",
          "text": "Ah, okay. Thank you. Do you have an idea of what an intro course has besides getting familiarized with writing system stuff? I'm not sure if I could completely place (besides Mandarin, which I've been studying in class in high school) based on independent study.",
          "author": "ntzkikun",
          "created": 1616012454,
          "upvotes": 2,
          "replies": {
            "gra0leg": {
              "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gra0leg/",
              "text": "In Korean, it was memorizing the conversation skits in the book, making our own skits, and writing paragraphs. You will cover reading, writing, and speaking all at once. There’s also homework to do per chapter related to grammar and vocab. There were oral midterms as well. Chinese also has a friday peer mentorship that international chinese students volunteer to lead. Not sure about japanese.\n\nKorean was also very fast paced, almost a chapter every week and a half, about 7-8 chapters a semester.",
              "author": "Worldlover67",
              "created": 1616013329,
              "upvotes": 4,
              "replies": {
                "gra5sm2": {
                  "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/gra5sm2/",
                  "text": "Damn these Asian language classes sound super cool (As in a lot of thought goes into how to make even an intro. class relatively immersive), though intense.",
                  "author": "oldeaglenewute2022",
                  "created": 1616015697,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "graomrq": {
      "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/graomrq/",
      "text": "This is super impressive. Welcome to Emory, and don’t lose those passions!!",
      "author": "decafoatmilklatte",
      "created": 1616025078,
      "upvotes": 2,
      "replies": {}
    },
    "griv4u8": {
      "link": "/r/Emory/comments/m781sh/i_got_accepted_but_i_have_a_question/griv4u8/",
      "text": "Alumna into (mostly Asian) languages here. You can do it, but if you are serious, I suggest you space out the intro classes. You do not want to take Introduction to X language simultaneous with taking Introduction to Y language. This is NOT like taking Spanish and French at the same time (which is hard enough).\n\nLook into Critical Language funding for summer and do the summer programs so that you can stagger taking 1st year Korean while taking e.g. 2nd year Chinese and 3rd year Japanese. Tibetan and Japanese have similar grammars which helps. Chinese and Japanese have some overlapping characters (differing pronunciation) so that also helps. Look into the Middlebury summer language intensives (single best language learning experience of my life), University of Wisconsin-Madison summer language institute (a former and brilliant Emory professor teaches there), Harvard Summer (classmate had a pretty solid experience there, but reports were that this was the weakest of the lot--not sure about current situation), and finally, UVA probably has the best 1st year Tibetan summer intensive, though UW Madison is (was?) excellent as well, plus Madison offers all of your proposed languages, so it would be easy to find conversation partners of other languages if you don't find that distracting. I would only keep up conversation in a 2nd or 3rd language if they are well-progressed enough to not start causing confusion. If not, it is often more effective to laser-focus on only one language for specified periods. \n\nAlso consider supplementing with a study abroad program. Emory has several excellent ones (including for Tibetan) and great funding. Additionally, look into CIEE and go for the programs with a language-intensive focus. Not sure about Harvard or UVA, but all of the other programs listed also offer funding.\n\nAfter the summer or abroad study, take the language exam and, for the more intensive programs, you may even be able to skip an entire year. Only do this if you are willing to work extremely hard to \"fill the gaps\" in any information you may have missed in a skipped year (since each program pedagogy differs, there will definitely be holes in your knowledge). If you test out of levels available, use the independent funding Emory offers to continue. Start a club to meet weekly for speaking practice--otherwise these languages are going to start mixing. You've got to find a consistent way to speak them. There should also be opportunities to volunteer that utilize your language skills.\n\nRegarding credits, I must admit I came into Emory with quite a lot of credits and several requirements out of the way, so be sure to run all this by your department head and/or academic advisor to make sure you can still graduate on time. I sometimes took 4 language courses in a semester--this may not be practical if you have too many requirements to fulfill. Also, the summer programs I have listed are all extremely intensive--that will be your entire summer. No internships or taking more than one class. Some of the programs offer free optional add-ons such as Tai Chi, Calligraphy, Poetry, Painting, etc. Other than possibly engaging with those, you will not have time for other things. If you want a more balanced experience, I suggest study abroad. And in the less structured summer programs, I suggest trying to find summer roommates taking the same language--this will offer more speaking practice. The more effort you put in, the more you get out. With a program like Middlebury which requires living with other students also studying your target language, the sky is the limit. You could learn 2 years of a language in 8 weeks starting from scratch. \n\nAh and as a final note, for Tibetan you may need to choose either written or oral. Tibetan is a diglossic language and US Universities tend to divide Tibetan pedagogy into Literary and Modern. It is like taking two separate languages. You're also going to encounter a similar, albeit smaller, disparity if you decide to study Literary Chinese--particularly if you previously studied simplified characters, though having studied Japanese will help here. For Tibetan, there is almost zero overlap with the other languages you are taking. In all honesty, I would recommend starting with Japanese to get a handle on the grammar. Tibetan pedagogy in English is not stellar and if you have the basic grammar structures down from Japanese, it will make things a lot easier on the Tibetan side. I've known people start with Japanese or Chinese alternately--there are pros and cons to both approaches. Korean is in its own category here and arguably the easiest of the lot. \n\nAs a last suggestion, it might be helpful to take Second Language Acquisition in the Linguistics department. I found it useful. Oh, and don't forget to take advantage of Emory's tutoring allotment. When I matriculated, it was limited to 1 hour per subject per day--more than enough for useful possibilities and very helpful for language courses.",
      "author": "notintosocialmedia",
      "created": 1616187796,
      "upvotes": 2,
      "replies": {}
    }
  }
}