{
  "sid": "okztom",
  "link": "/r/Emory/comments/okztom/dobbs_living_experience/",
  "title:": "Dobbs Living Experience?",
  "text": "So I heard that dobbs was universally considered the worst dorm at Emory. Is there anyone here that was living at (or heard anything about) dobbs that can make me a little optimistic about the dorm?",
  "author": "ConformChild",
  "created": 1626376708,
  "updated": 1634097529,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "h5bdg94": {
      "link": "/r/Emory/comments/okztom/dobbs_living_experience/h5bdg94/",
      "text": "Didn’t live in Dobbs my freshmen year but knew some people who did. Yes, the rooms are a bit smaller but dobbs has one of the best communities and everyone gets super close to each other. Though the rooms are not the biggest, they dont really differ much in quality as much as the other dorms. Probably the same as complex and harris. The parlor and courtyard as well as the exterior are beautiful. People love to hang out in the parlor and study. I loved visiting dobbs my first year and people are always surprised because it’s really not as bad as everyone says it is. Dobbs has also been renovated and fixed up so dont worry!! Clean bathrooms as well! Dobbs does not have an elevator so im sorry if you live on the upper floors. Good luck moving in and taking laundry down to the ground floor. But I know you’ll love living there and meet some of your closest friends! The location also probably the best on campus. Right next to the esc and the dining halls and close to classes. The res life are also always close to each other so they really make it enjoyable living there! Your first year is going to be amazing and i know you’ll meeting the best people. Good luck your first year! Don’t be nervous!",
      "author": "MysteriousAd4424",
      "created": 1626379893,
      "upvotes": 10,
      "replies": {
        "h5bo1vj": {
          "link": "/r/Emory/comments/okztom/dobbs_living_experience/h5bo1vj/",
          "text": "A lot of people hate on Dobbs but all the other halls have bad things about them too. Raoul  is very nice I will say though. I have nothing bad to say about Raoul other than the halls do get kinda noisy and you can always hear people in the halls. \n\nI know you'll be living in dobbs but thought this might be helpful for other first years worrying about their halls. \n\nComplex has nice community but rooms are also pretty old with mold in some rooms. The storage units are nice but the sink in the room is small and uncomfortable to use. Far from freshman quad. \n\nLSM (or I guess Eagle Hall now) is considered one of the nicer dorms, but I would say the bathrooms in Raoul, Harris, and Hamilton are much more cleaner. There is a lot more people on your floor so people in Eagle hall have to share the communal bathrooms with a lot more people. The hall is big but also very very gloomy and depressing. My friends who lived here their first year didn't even meet their hall mates and didn't get close to their RA or SA. No community whatsoever. Location is nice though--right on the freshmen quad but the study rooms are worse than Raoul and laundry room is absolutely disgusting. Please please check the smell and mold before putting in your clothes. This was two years ago so hopefully they fixed that, but since there are a lot of using the washers, it is very likely the machines will be gross. \n\nHarris has no community and the res life always gets a bad rep for not being close with each other. Not sure if it's because there are second years also living there but kids are always getting busted for weed. The res life staff give up after a while busting kids because it happens so often. The halls are also depressing and it's kinda like walking through a prison. They do have full length mirrors though in every room which is really nice. But the rooms get no sunlight and overall very depressing. Also pretty far from the other dorms in the freshman quad which is mainly where your friends will hang out if the live in Raoul, Turman, Hamilton, or Eagle hall. \n\nHamilton only has one small study room on each floor which kind of sucks and also a small kitchen. I honestly thought Hamilton had one of the cleanest communal bathrooms though. Great community and always great res life staff.\n\nTurman has light colored furniture compared to the dark wood furniture all the other dorms have which I thought was weird. But if you're not picky, it doesn't matter. I honestly don't have anything bad to say about turman other than I feel like it's very low key and people don't really talk about it. \n\nAlabama, like dobbs, is one of the smaller and older dorms. The worst thing about it is that it's right next to the Cox hall clock tower so you'll have to deal with it ringing every like 15 or 30 mins I can't remember. Very very noisy and definitely will annoy you. Great location and community though. \n\nNote: Rooms in Turman, Hamilton, Raoul, and Eagle hall are identical but with different color carpets. Idk why people hype up Raoul that much because the rooms look the same.\n\nAlso, people find cockroaches in EVERY DORM. Even in Raoul. NOT JUST DOBBS. It's college. You learn to deal with it. Although you might see them in the night outside, it's pretty rare you'll find one in your dorm. None of the dorms are perfect but I can definitely say everyone I knew fell in love with their dorm by the end of the year and they were sad to leave it. Get close to people in your hall. Meet everyone on your floor. Get to know your RA and SA especially if you want to apply to be an SA so you can get a good rec letter from them. (also they might let you off the hook if you're busted for something) Also just in general they are people who WANT to help you and get close to you. Ask them to grab a meal or just talk! They have resources and advice and can get you connected to their friends. \n\nI know I was very nervous to move in my first year because I felt like I had no knowledge about the dorms and didn't know what to expect. So no worries! Hope this is helpful to anyone",
          "author": "MysteriousAd4424",
          "created": 1626384594,
          "upvotes": 9,
          "replies": {
            "h5cunnk": {
              "link": "/r/Emory/comments/okztom/dobbs_living_experience/h5cunnk/",
              "text": "I feel like really roasted the hell out of every freshman dorm but in all honesty, all the dorms at Emory are very very nice compared to other schools. I listed all the negative things of every dorm to make this point: none of the dorms are perfect and Dobbs is not even close to as bad as everyone exaggerates it to be. I know that every freshman reading this reddit post will fall in love with their hall and room by the end of the year and will look back at all the mems they made there. You’ll look back at all the late night study sessions you had in the study rooms with your friends. Movie nights in your room, talks with your roomie, hangouts in the lounges. You’re going to love it :)",
              "author": "MysteriousAd4424",
              "created": 1626406430,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "h5brhex": {
      "link": "/r/Emory/comments/okztom/dobbs_living_experience/h5brhex/",
      "text": "I lived in dobbs freshman year and wouldn’t have it any other way :) I absolutely loved it. Yes the rooms are very small. There’s no way around that. But they’re actually pretty nice (in terms of they don’t seem gross at all). People love to talk about the roaches in Dobbs, but tbh I saw them in all the dorms (it’s Georgia, they live there). The social scene is really, really great. Everyone on my floor got super close and we always had a great time together. The lounges/common rooms are good too, with the one on the main floor (the Parlor) having lots of couches and chairs and whiteboards, while the downstairs TV lounge has couches, a huge TV, and a pool table. The location is amazing too…you’ll be spoiled when you have to walk more than 2 steps to the DCT or Asbury Circle afterwards. \n\nPack light and you’ll have an amazing time :)",
      "author": "j11234567890",
      "created": 1626386182,
      "upvotes": 5,
      "replies": {}
    },
    "h5bjl0j": {
      "link": "/r/Emory/comments/okztom/dobbs_living_experience/h5bjl0j/",
      "text": "It has by far the best vibes",
      "author": "R-Stud",
      "created": 1626382588,
      "upvotes": 3,
      "replies": {}
    },
    "h5czrxz": {
      "link": "/r/Emory/comments/okztom/dobbs_living_experience/h5czrxz/",
      "text": "pros: good vibes, easier to make friends, super close to dct and kinda the central area of campus and closer to classes than raoul/lsm/etc, nice views of campus/sunsets if you get lucky\n\ncons: no elevator so pain in the ass during move in if youre on higher floors, small-ass rooms",
      "author": "y9d8tsdt",
      "created": 1626409474,
      "upvotes": 1,
      "replies": {}
    }
  }
}