{
  "sid": "b8gp56",
  "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/",
  "title:": "Creative Writing at Oxford college",
  "text": "I was recently accepted into oxford college and was wondering what y'all know about the creative writing major there? ",
  "author": "LargeDaddy",
  "created": 1554195580,
  "updated": 1634099374,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "ejy0uiw": {
      "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ejy0uiw/",
      "text": "One of my friends is a sociology/creative writing double major. Another is a international studies/creative writing major. From my observation, the draw of oxford is that you get many opportunities to showcase your work through poetry writing contests, the one act plays, etc. There are also a lot of really cool classes (creative poetry writing, prison memoirs) that allow you to build your skills. Furthermore, a lot of the faculty have more time to read your work and give you feedback. ",
      "author": "blondeoctopus",
      "created": 1554210809,
      "upvotes": 4,
      "replies": {
        "ejy28v9": {
          "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ejy28v9/",
          "text": "Went there, this is correct. \n\nUnless it's changed, you don't have a 'major' there. It's just has a smaller, more focused environment for you to take advantage of. ",
          "author": null,
          "created": 1554212012,
          "upvotes": 4,
          "replies": {
            "ejy6t86": {
              "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ejy6t86/",
              "text": "You do declare your major as a sophomore, by which time you’re halfway done. I would use Oxford as an opportunity to take interesting classes and feel out what you might want to major in. Unless you’re 100% devoted to being a doctor, there’s no reason to start as a freshman with a predetermined course load ",
              "author": null,
              "created": 1554215621,
              "upvotes": 2,
              "replies": {
                "ejyfcxf": {
                  "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ejyfcxf/",
                  "text": "Thank you! Didn't remember that.",
                  "author": null,
                  "created": 1554221725,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ek0c1wr": {
      "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ek0c1wr/",
      "text": "Creative Writing is the best humanities major Emory has to offer, I'm not sure if Oxford has enough course offerings for that major, or if it is taught well. But after the 2 years there Emory's courses are the best you can get. They've hired 2 new professors whom are very renowned in the industry. ",
      "author": "91210toATL",
      "created": 1554277909,
      "upvotes": 1,
      "replies": {}
    },
    "ejyxyij": {
      "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ejyxyij/",
      "text": "[deleted]",
      "author": null,
      "created": 1554233861,
      "upvotes": -3,
      "replies": {
        "ejzff1k": {
          "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ejzff1k/",
          "text": "Wait why? I got accepted and am currently leaning towards Emory so I’d love to know what you think about it. You can pm me if you’d like. Thanks!",
          "author": "izziii00",
          "created": 1554245989,
          "upvotes": 1,
          "replies": {
            "ejzlaq4": {
              "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ejzlaq4/",
              "text": "Yeah, don’t listen to this guy. I also went to Oxford and while I was tired of being 45 minutes from atlanta by the end of two years, I’m very glad I went. As for creative writing, Emory university has the best creative writing program in the country. Oxford is tricky because they only offer two creative writing courses, but the English offerings at Oxford are excellent, and half of the creative writing major (5 of 11 classes) are English courses, with the other 6 being the creative writing courses. I used to be a creative writing major, but I switched to something else so if you have any questions about Oxford or creative writing at Emory you can send them my way",
              "author": null,
              "created": 1554250650,
              "upvotes": 4,
              "replies": {
                "ejzmb17": {
                  "link": "/r/Emory/comments/b8gp56/creative_writing_at_oxford_college/ejzmb17/",
                  "text": "Thank you for this!! I am also planning to do Creative Writing or English like OP so this was really useful. Yeah - I’ve always heard it’s the best in the country so I applied (though I looked up the ranking on Niche earlier today and it was a little lower than I expected). But last night I kind of fell in love with the creative writing department. I watched Jericho Brown’s ted talk and read all his poems and I’d just love to be taught by him. He also just seems like a really nice dude too. Have you had any classes with him? Or does he only teach at Emory? \n\nIn your opinion, what makes Emory’s creative writing program the best in the country? I did get waitlisted at Oxford, so unless I get in off the waitlist, Emory is where I’d go (even though he English at Oxford does sound really amazing).\n\nAlso, just out of curiosity, why did you switch from Creative Writing and English to Physics? That’s a bold move! Also, do you enjoy every day life at Emory? Are you really happy that you’re there? Do you wish you were anywhere else?\n\nThank so much for replying and being so open about your experience! You can pm me if you’d prefer to :)",
                  "author": "izziii00",
                  "created": 1554251458,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}