{
  "sid": "n030s6",
  "link": "/r/Emory/comments/n030s6/new_to_atl/",
  "title:": "New to ATL",
  "text": "So i committed to Emory this year and have never been to ATL.  I was wondering if anyone had any personal favorite spots or things to do as im really curious about the culture and fun things to do in the city.",
  "author": "jayybreezy1",
  "created": 1619570855,
  "updated": 1634098181,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 0.94,
  "comments": {
    "gw4ehzd": {
      "link": "/r/Emory/comments/n030s6/new_to_atl/gw4ehzd/",
      "text": "uhh I'd recommend checking out little five points and ponce city market",
      "author": "janitorialkeys",
      "created": 1619573072,
      "upvotes": 9,
      "replies": {}
    },
    "gw4j1n5": {
      "link": "/r/Emory/comments/n030s6/new_to_atl/gw4j1n5/",
      "text": "So much good food!",
      "author": "decafoatmilklatte",
      "created": 1619575336,
      "upvotes": 6,
      "replies": {}
    },
    "gw4dz2x": {
      "link": "/r/Emory/comments/n030s6/new_to_atl/gw4dz2x/",
      "text": "It depends on what you like to do. Atlanta is massive and diverse and has a lot of all sorts.",
      "author": "RiketyChair",
      "created": 1619572818,
      "upvotes": 5,
      "replies": {}
    },
    "gw4ufyh": {
      "link": "/r/Emory/comments/n030s6/new_to_atl/gw4ufyh/",
      "text": "Maybe not exactly what you were looking for but- My favorite place in Atlanta is the Dekalb Farmer’s Market. Wide range of ingredients alongside produce that’s pretty cheap & often local. The building itself is a massive indoor market with so many choices you’ll easily spend over an hour there.",
      "author": "BigFigW0sp",
      "created": 1619581672,
      "upvotes": 4,
      "replies": {}
    },
    "gw4lkd9": {
      "link": "/r/Emory/comments/n030s6/new_to_atl/gw4lkd9/",
      "text": "Sweet Auburn BBQ is one of my favorite food places. Piedmont Park is a great place to just relax and enjoy a nice day. The comedy clubs seem really fun but I have only seen a couple shows at the Laughing Skull. And if you're willing to make the drive out, there's a bunch of nice hiking places in northern Georgia, personal favorite is Panther Creek Trail which is closed right now but hopefully is open by the fall. Also if Dragoncon is happening this year def worth a go. I think you'll find something you enjoy here soon enough!",
      "author": "SolidFlame13",
      "created": 1619576649,
      "upvotes": 3,
      "replies": {}
    },
    "gw7vv87": {
      "link": "/r/Emory/comments/n030s6/new_to_atl/gw7vv87/",
      "text": "If they start dragon con again, check it out. You don't have to buy anything, I just roamed the streets and hotels to look at people's costumes and robots. Also, six flags over GA is awesome",
      "author": "thisisme4",
      "created": 1619643569,
      "upvotes": 2,
      "replies": {}
    },
    "gx4p3dp": {
      "link": "/r/Emory/comments/n030s6/new_to_atl/gx4p3dp/",
      "text": "I grew up here and all I can say is that Atlanta is a very large, diverse, and spread out city that's hard to summarize. Whatever you're into, you can find here. However, it would really serve you well to have some vehicle because the public transport system is garbage in its coverage and Emory is sort of isolated.",
      "author": "jsh_",
      "created": 1620291546,
      "upvotes": 1,
      "replies": {}
    }
  }
}