{
  "sid": "mzukqe",
  "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/",
  "title:": "Opinions/Experiences with these courses",
  "text": "Hi all! I am a co '25 student and I am applying to this special program next year that considers your freshmen year of college grades and has some required courses I need to take at Emory.\n\nBasically I need to take some courses and maintain above a B average (3.0) in them. Do you think it is reasonable to take: BIOL 141L, BIOL 142, BIOL 142L, ENGCW 270W, and MATH 111: Calculus I, over the course of freshman year and be able to meet these grade requirements?\n\nI know it depends on the professor and obv myself, but any general opinions/experiences/advice would be appreciated.",
  "author": "sirus1317",
  "created": 1619546610,
  "updated": 1634098188,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.94,
  "comments": {
    "gw2v6vz": {
      "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gw2v6vz/",
      "text": "I can only speak to the online versions of the class, and these are just my experiences. \n\nMath 111 isn’t that hard. It’s a lot of assignments and it helps if you’ve taken calc before, but there are a lot of different ways/opportunities to learn the material. \n\nI had a few friends take Bio 141L, and from what I heard it’s very easy (just busywork pretty much). Those same friends are currently taking Bio 142 + the lab, and they don’t have problems with that class either. \n\nI can’t speak to the English class, but the English classes in general don’t seem to be that hard. \n\nShort answer: you’ll be fine as long as you try at least a little bit",
      "author": "sthedragon",
      "created": 1619547666,
      "upvotes": 8,
      "replies": {
        "gw38uno": {
          "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gw38uno/",
          "text": "thanks so much!",
          "author": "sirus1317",
          "created": 1619553394,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gw30cdu": {
      "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gw30cdu/",
      "text": "Tbh it depends on the teacher and your previous experiences. For me, I took calc 111 with no calc experience and I wanted to die. That class alone ruined my mental health and made me hate STEM forever. However, I also know ppl who were fine with calc and had a good grade. I will say that the math teachers aren’t the best here so there’s a lot of self teaching and 5-6 hours of self studying per week",
      "author": "Bubbly-Vanilla-6711",
      "created": 1619549847,
      "upvotes": 8,
      "replies": {
        "gw38sal": {
          "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gw38sal/",
          "text": "oh god. that sucks that you had to deal with that. I've taken calculus in high school so were people who had calc experience usually fine?",
          "author": "sirus1317",
          "created": 1619553367,
          "upvotes": 3,
          "replies": {
            "gw3b0jj": {
              "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gw3b0jj/",
              "text": "I have this feeling that those with AP exposure were most likely to have an easy time.  Others with \"exposure\" (like honors or standard) probably have a bigger range of experiences depending on how tough their HS was.\n\nAlso, be careful with opinions you get.  If they are speaking on behalf of Covid classes, then those are generally NOT at the same level as in person classes.  They may have a similar amount of work (or even more busy work), but things like tests and quizzes in STEM tend not to be exactly at the same level.  This especially goes for something like biology where the little Canvas interface probably puts severe limitations on professors who teach large classes (with the online interface, it is much more difficult to write the same types of exam items they would in person as glitches often occur when they try adding data and other types of figures). Expect courses at normal intensity.  Also, just learn what you can.  If you do that, you'll easily meet your GPA cut off. Even better professors in things like biology are very doable in terms of getting a B or higher. If bio lab ends up in person, expect a good amount of work, even if it isn't that thought provoking. The lab can be a bit \"busy\" for sure.",
              "author": "oldeaglenewute2022",
              "created": 1619554321,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gw4et2c": {
      "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gw4et2c/",
      "text": "I've taken all of these besides ENGCW and I think it's extremely manageable to get above a 3.0 (especially if you took the AP course in HS). Calc 1 is lowkey insufferable, but if you're aiming for a B average you should be fine.",
      "author": "janitorialkeys",
      "created": 1619573225,
      "upvotes": 2,
      "replies": {
        "gw4vga7": {
          "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gw4vga7/",
          "text": "all right, thanks for the insight",
          "author": "sirus1317",
          "created": 1619582283,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gw51si7": {
      "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gw51si7/",
      "text": "It's a reasonable load - speaking as a Biology grad.",
      "author": "deacon91",
      "created": 1619586596,
      "upvotes": 2,
      "replies": {}
    },
    "gwzzek7": {
      "link": "/r/Emory/comments/mzukqe/opinionsexperiences_with_these_courses/gwzzek7/",
      "text": "I took Math 111 in person this semester. It's hard, but if you put in the time to study, go to office hours, and just be genuinely interested in what you're learning, it'll be much easier. Also a warning: there are some semesters in which only grad students are teaching this course. They're not the best, but I was fine with mine. Exams were online while quizzes were in person, but that's probably going to change going forward.\n\nBe careful who you take for BIOL142! I would steer clear of Reyes. The lab isn't hard either, just lots of busy work. Again, I am taking 142 and lab online right now, so it's definitely going to be somewhat different for you.",
      "author": "yowesterburg",
      "created": 1620196917,
      "upvotes": 1,
      "replies": {}
    }
  }
}