{
  "sid": "qofe44",
  "link": "/r/Emory/comments/qofe44/nbb_270_w_wyttenbach/",
  "title:": "NBB 270 w/ Wyttenbach?",
  "text": "I’m not sure if I want to major in NBB and I wanna figure this out asap.  I’ve never taken a NBB class, so this class could help but my credit hours would be more than I want.  Is this class worth it?",
  "author": "jklmnop32123",
  "created": 1636252838,
  "updated": 1636656441,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjmqipw": {
      "link": "/r/Emory/comments/qofe44/nbb_270_w_wyttenbach/hjmqipw/",
      "text": "Isn't that just supposed to familiarize you with different types of neuro and behavioral science research happening at Emory (Wyttenbach may not even be that relevant if much of the class is gonna be guest speakers)?  If so, maybe give it a shot.  The worst that happens is that you see how interdisciplinary the area is and that even if you don't wanna be a major, one of the research labs may be still be a fit.  Also, given how different the NBB cores are (sampling different approaches and perspectives of how neuro and behavioral bio is studied), it may be hard to figure out if you are really interested from early coursework.  Like many who go on to do the less anthropological/psych side of NBB don't like NBB 201, but some reason like NBB 301 which does a somewhat serious treatment of neurophysiology/the biophysics of neuroscience.\n\nLike if you are also entertaining a bio major, maybe you can wait for NBB 301 to make a real decison (you could declare something else and then switch to it or double and drop one) as that will also count as a bio column requirement (B methinks).  And even as a bio major, as long as you took nbb 301/bio 360, you can get access to many of the NBB electives (not just the cross-listed ones).  They aren't as stringent with regards to protecting courses for their majors except maybe 401 which is a the smaller capstone seminar.",
      "author": "oldeaglenewute2022",
      "created": 1636253866,
      "upvotes": 1,
      "replies": {}
    }
  }
}