{
  "sid": "kqwtp4",
  "link": "/r/Emory/comments/kqwtp4/phil_110_intro_to_ethics/",
  "title:": "Phil 110; Intro to Ethics",
  "text": "Update: I meant Phil 115 not 110 in the title. Has anyone taken intro to ethics, and if so how was it? I'm debating taking it this semester but I'm not sure what to expect for it. I'm not a fan of philosophy but I find the subject of ethics very interesting.",
  "author": "Automatic-Star1997",
  "created": 1609846731,
  "updated": 1634099188,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "gi6jw47": {
      "link": "/r/Emory/comments/kqwtp4/phil_110_intro_to_ethics/gi6jw47/",
      "text": "Who's the professor you're hoping to get? I've heard it differs quite a bit based on the professor. I took it with Dr. Stuhr, so I can speak to his class. It was definitely pretty reading intensive, and it was reading a lot of prominent philosophy which is a writing style that took some adjustment to understand. There was a reading assignment for each class plus we had to write a paper (300 words or less) on almost every reading assignment just providing the main point of what we read (2×/week, due M/W by the time class started). These papers comprised the majority of the grade, and there was no final if you chose the papers (you could also choose to take a written final and write almost none of the papers). It was definitely a fairly difficult class but it was also one of the most informative classes I'll ever take and has changed how I think about a lot of things. Let me know if you have any other questions. \n\nBtw unless they changed class codes I think PHIL 110 is intro to logic and PHIL 115 is ethics, just wanna make sure you have that right so you get in the class you want.",
      "author": "ruhdolph",
      "created": 1609856833,
      "upvotes": 4,
      "replies": {
        "gi6k1s6": {
          "link": "/r/Emory/comments/kqwtp4/phil_110_intro_to_ethics/gi6k1s6/",
          "text": "This is in contrast with a friend of mine who had it with a different professor who made the entire course exam based, which apparently lessened the need to complete each reading assignment quite a bit. Still, no matter what it seems like the course is very much centered around reading philosophy.",
          "author": "ruhdolph",
          "created": 1609856919,
          "upvotes": 3,
          "replies": {}
        },
        "gi6o1te": {
          "link": "/r/Emory/comments/kqwtp4/phil_110_intro_to_ethics/gi6o1te/",
          "text": "Yeah, you're correct it is 115. And I was looking at taking it with Quinonez. Would you recommend taking this class with bio and chem? I don't want to stretch myself too thin but I want to finish my humanities requirement and this class looks the most interesting.",
          "author": "Automatic-Star1997",
          "created": 1609859090,
          "upvotes": 3,
          "replies": {
            "gi6pc0j": {
              "link": "/r/Emory/comments/kqwtp4/phil_110_intro_to_ethics/gi6pc0j/",
              "text": "How many credits are you planning to have total? I am pre-med but I havent taken bio and chem together (and I havent taken chem 202 yet) so I cant totally speak to how all of that would be together. I would say it's fairly doable and ethics is definitely different enough that you'll have a decent mix of classes. I cant necessarily say for sure without knowing anything about the professor you mentioned.",
              "author": "ruhdolph",
              "created": 1609859757,
              "upvotes": 2,
              "replies": {}
            },
            "gi700oz": {
              "link": "/r/Emory/comments/kqwtp4/phil_110_intro_to_ethics/gi700oz/",
              "text": "I mean, did you find chem and bio easy enough in the fall or did you sweat a bit?  Or are you taking professors that may make you sweat more than in fall for chem and biol?  Even if so, usually even a more reading intensive humanities is fairly manageable.  If you had AP/IB for something like chem, even better because the first exam is a review.  And in biol, I think the first module is sort of a more in depth review of the genetics concepts covered in 141, so you'd have a grace period to sort of get a \"groove\" in any other classes I guess.  But I think you'd have to gauge it based on fall and your preparation level.  Basically, could you have had a reading intensive course last semester and have been just fine or were you already getting a serious run for the money. If you are okay with a run for the money, do you think you have found any study or time management skills to help with spring?",
              "author": "oldeaglenewute2022",
              "created": 1609864860,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gi9xtvj": {
      "link": "/r/Emory/comments/kqwtp4/phil_110_intro_to_ethics/gi9xtvj/",
      "text": "I took phil 115 last semester. It was a ton of confusing readings, but grading was nice.",
      "author": "yliu217",
      "created": 1609912059,
      "upvotes": 1,
      "replies": {}
    }
  }
}