{
  "sid": "chjdkp",
  "link": "/r/Emory/comments/chjdkp/welcome_emory_freshman/",
  "title:": "Welcome Emory Freshman!",
  "text": "I cannot wait to have you guys here! It will be so hype! If you have any questions or need advice, please feel free to reach out. I’m a rising sophomore about to apply to the B-school, I’m an SA, and I’m involved in Greek life.",
  "author": "ryanl20000",
  "created": 1564031691,
  "updated": 1634098841,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 0.89,
  "comments": {
    "euub5dc": {
      "link": "/r/Emory/comments/chjdkp/welcome_emory_freshman/euub5dc/",
      "text": "Hi! I’m a rising freshman who is on the fence about joining Greek life. What was the rushing process like and would you recommend joining Greek life at Emory?",
      "author": "not-kdtrey5",
      "created": 1564041078,
      "upvotes": 5,
      "replies": {
        "ev7gr0s": {
          "link": "/r/Emory/comments/chjdkp/welcome_emory_freshman/ev7gr0s/",
          "text": "It really depends on what organization you’re joining. For me, it was a way to meet new people on campus who I would’ve never met. It has allowed me to become close with upperclassmen and have them as my mentors to help me through the whole bschool process, getting an internship, resume etc. However, the rush process as a whole was a way for me to become close with my pledge class, with many of us flying across the country to see each other. In terms of actual rushing, for frats, it depends what frat you want to go to. For me, it was making a lot of new friends as well as having the opportunity to party with them",
          "author": "ryanl20000",
          "created": 1564259531,
          "upvotes": 2,
          "replies": {}
        },
        "evg2fi8": {
          "link": "/r/Emory/comments/chjdkp/welcome_emory_freshman/evg2fi8/",
          "text": "Also in Emory Greek life here. u/ryanl20000 summed it up pretty well, but to add my 2 cents Emory has pretty good greek life for a top 20 school (now 21 I guess haha) but it definitely isn't as big as other southern schools like UGA or Alabama, so I'd say the rushing process is more relaxed in that aspect. It also depends on what frat/sorority you want to join as they all have different personalities. If you're interested in going out and partying regularly, I would definitely recommend at least rushing, especially if you're a guy bc frats don't let in non-affiliated guys into their parties very often unless they're rushing, and the party scene here is pretty much dominated by Greek life. If you're more interested in making connections as opposed to going out, I'd check out some of the professional or multicultural fraternities, depending on your interests they could also be a great opportunity. That being said social frats/sororities are a great way to make connections too, so either way I'd recommend rushing and seeing if it'd be a good fit!",
          "author": "ihatedogs69420",
          "created": 1564504812,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ev7eknl": {
      "link": "/r/Emory/comments/chjdkp/welcome_emory_freshman/ev7eknl/",
      "text": "What’s up dirtyjers hahaha",
      "author": "mosinghal",
      "created": 1564258746,
      "upvotes": 1,
      "replies": {
        "ev7g3m5": {
          "link": "/r/Emory/comments/chjdkp/welcome_emory_freshman/ev7g3m5/",
          "text": "What up dog",
          "author": "ryanl20000",
          "created": 1564259288,
          "upvotes": 1,
          "replies": {}
        },
        "ev7g6qu": {
          "link": "/r/Emory/comments/chjdkp/welcome_emory_freshman/ev7g6qu/",
          "text": "Gotta help out the reddit community. You feel me?",
          "author": "ryanl20000",
          "created": 1564259319,
          "upvotes": 1,
          "replies": {
            "ev7nbfo": {
              "link": "/r/Emory/comments/chjdkp/welcome_emory_freshman/ev7nbfo/",
              "text": "Too true. Can’t believe I just found this today",
              "author": "mosinghal",
              "created": 1564261856,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}