{
  "sid": "d5bshr",
  "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/",
  "title:": "What are the best and worst things about Emory?",
  "text": "Hello! \n\nI am a current senior and I am trying to decide where to ED. I love Emory but I am so conflicted and indecisive about EDIng because there is another school I like. Can you guys speak to some amazing things and some not as amazing aspects of Emory? Specifically about campus life, as I know little about it.",
  "author": "trettywap",
  "created": 1568693292,
  "updated": 1634099134,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "f0l0y93": {
      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0l0y93/",
      "text": "[deleted]",
      "author": null,
      "created": 1568694205,
      "upvotes": 19,
      "replies": {
        "f0n6hqt": {
          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0n6hqt/",
          "text": "Dooley: The Dooley thing is deep. They can cute him up and with an outfit and a water gun and a nerdy honor guard,  refer to him as “whimsical,” and even call him “Claire,”  but our school spirit/mascot is Baron Samedi when you break it all the way down. \n\nI don’t give a damn about that stuffed eagle, but I still pour a glass of rum for Dooley from time to time to keep on good terms.",
          "author": "minty_cyborg",
          "created": 1568761828,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "f0lq50x": {
      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0lq50x/",
      "text": "Good: Beautiful campus, great academics, lots of resources\n\nBad: Decent amount of obnoxious/spoiled classmates, cockroaches, gym closes before midnight",
      "author": "djhin2",
      "created": 1568726613,
      "upvotes": 12,
      "replies": {
        "f0lqo4m": {
          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0lqo4m/",
          "text": "COCKROACHES????????",
          "author": "anacrissy",
          "created": 1568727025,
          "upvotes": 6,
          "replies": {
            "f0lsi22": {
              "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0lsi22/",
              "text": "Though I never really saw them indoors when I attended Emory, it is the south and Atlanta has an insane amount of trees/urban forest so you can see many outdoors especially at night (I still remember seeing them along Cox bridge).   I think folks at places like Duke say they have or see them too.  It's also the south and in a heavily wooded area so it makes sense.",
              "author": "oldeaglenewute2022",
              "created": 1568728428,
              "upvotes": 11,
              "replies": {
                "f0nhgr6": {
                  "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0nhgr6/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1568770199,
                  "upvotes": 1,
                  "replies": {
                    "f0nhnc1": {
                      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0nhnc1/",
                      "text": "They probably won't attack you lol.  I would say keep a bottle for indoors because ya never know. Doesn't matter how clean your place is in Atlanta",
                      "author": "oldeaglenewute2022",
                      "created": 1568770341,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f0lsdxn": {
              "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0lsdxn/",
              "text": "Yeah, if you live in Dobbs.",
              "author": "iapetus3141",
              "created": 1568728343,
              "upvotes": 5,
              "replies": {
                "f0miwwq": {
                  "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0miwwq/",
                  "text": "Cockroaches at clairmont too. One waved to me this morning. Named him Lenny.",
                  "author": "AeonJuke",
                  "created": 1568746018,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        },
        "f0nh6yi": {
          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0nh6yi/",
          "text": "My guy said cockroaches. deal breaker",
          "author": "bambli314",
          "created": 1568769995,
          "upvotes": 1,
          "replies": {
            "f0ns7rd": {
              "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0ns7rd/",
              "text": "They aren’t really the same, little nasty cockroaches.  Atlanta native here, they are Palmetto bugs, the cockroach’s bigger, much lazier cousin.  They are all over the south and they mostly live outside but they are attracted to light so they will come inside from time to time.   They aren’t great but you don’t worry about them like you do if you see the small, fast German cockroaches.   You really don’t want either hanging around but you are going to run into the PB in Atlanta.  Just tip your hat and move on.",
              "author": "AWC-OG",
              "created": 1568778991,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "f0l4b8i": {
      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0l4b8i/",
      "text": "Best: academics aren’t a joke or a death sentence, relatively functional buses, lots of extracurriculars\n\nWorst: pre-professional people, Coca Cola up your ass",
      "author": null,
      "created": 1568698017,
      "upvotes": 14,
      "replies": {
        "f0l4d8a": {
          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0l4d8a/",
          "text": "[deleted]",
          "author": null,
          "created": 1568698084,
          "upvotes": 19,
          "replies": {
            "f0l4f4b": {
              "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0l4f4b/",
              "text": "Freshman welcoming ceremony was literally The Coke Toast sponsored by Coca Cola. If I saw that happen in a movie I would laugh at how heavy handed it is and yet here we are",
              "author": null,
              "created": 1568698147,
              "upvotes": 10,
              "replies": {
                "f0l4hac": {
                  "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0l4hac/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1568698219,
                  "upvotes": 9,
                  "replies": {
                    "f0lnuk5": {
                      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0lnuk5/",
                      "text": "I know it happens every year dude",
                      "author": null,
                      "created": 1568724675,
                      "upvotes": 3,
                      "replies": {
                        "f0lxsua": {
                          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0lxsua/",
                          "text": "I just don't think people will join in being offended because it is well branded/liked and basically made Tech and Emory what it is today.  Most people just aren't gonna agree with it.  I personally find the World of Coca Cola actually annoying.\n\n  It isn't really paying homage (like the toast-Emory can't add to its bottom line more than any ad actually done by Coke, plus Emory students are petty and slightly \"disloyal\" lol.  Many will wear the gear of other similar caliber schools they have no affiliation with other than maybe being wait-listed or denied.  I'll take advertising for Coke over advertising for WashU, Dartmouth, JHU, or Chicago, 3/4 which are D3 places that also tend not to have the \"spirit\" folks claim Emory lacks) or giving a history of the product so much as blatantly advertising all the way through.  I remember being really pissed when some friends dragged me there just to go try the fountains.",
                          "author": "oldeaglenewute2022",
                          "created": 1568732118,
                          "upvotes": 1,
                          "replies": {
                            "f0m153y": {
                              "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0m153y/",
                              "text": "I’m not playing twiggered snowfwake right now I just think it’s stupid and it’s embarrassing when I try to tell people what our school traditions are like. Your second paragraph makes no sense whatsoever. Itsnotthatdeep.png lmfao",
                              "author": null,
                              "created": 1568734356,
                              "upvotes": -1,
                              "replies": {
                                "f0m31n7": {
                                  "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0m31n7/",
                                  "text": "I am just saying that folks won't agree that it or the others are embarrassing.  They certainly aren't mainstream, which I think is totally fine.  If you are embarrassed, help invent other non-mainstream traditions you would like.  Don't leave it up to admins and sports (or lack of it) to drive all that.  This was typed on a train.  The 2nd paragraph is me complaining about the stupid Coke museum which is an actual advertisement.  You alluded to the coke toast sort of being that.\n\n I also complain about how Emory students effectively advertise for other schools (I am willing to bet they still do it).  I'd rather a tradition be an advertisement or do something to build affinity towards Coca Cola (something that helped build Emory) than Emory students constantly do things that show affinity towards competitor schools. \n\n I find that more problematic about Emory than any \"embarrassing\" traditions (seriously, I always ask who is responsible for lack of spirit or whatever everytime folks complain about it).  These are basically my ways of complaining, and its current traditions aren't among my complaints.  There probably need to be more or new ones though.  That has to be left up to students' imagination and their ability to implement.",
                                  "author": "oldeaglenewute2022",
                                  "created": 1568735620,
                                  "upvotes": 1,
                                  "replies": {
                                    "f0mzo7b": {
                                      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0mzo7b/",
                                      "text": "It’s almost at every school that kids wear other schools gear, especially big football school. Emory isn’t unique in that. Also, I’ve seen more kids wearing emory gear than not. \n\nNot saying there’s much school pride, but the coke branding isn’t really that obnoxious and most kids fashion choices are pretty standard, it’s not like an array of colleges every where you look that are other than Emory.",
                                      "author": "SupahWalrus",
                                      "created": 1568756853,
                                      "upvotes": 2,
                                      "replies": {
                                        "f0n15sm": {
                                          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0n15sm/",
                                          "text": "It definitely happens but it seems more rampant at Emory versus its peer (not many of who place a huge emphasis on football or sports infused social life/pride even if they are D1) private schools which is the problem.  It isn't competing as much against state schools except those in Georgia (for which it has a financial disadvantage) or some of the OOS elite state flagship publics.  \n\nDon't get me wrong, I understand when like a relative or something attended some of the non-D1 peer schools, but to see many basically never (and you are right, more do than don't, but it should'nt ever be close enough to be worth a thought) wear Emory gear but the gear of other private schools is noticeable to in and outsiders. \n\n I imagine the latter views it as an expression of the lack of spirit/affinity.  No matter the real reason, it leads to that perception and I think many (current) students do have warped views of Emory's position or relative strength versus some same or similar caliber competitor schools (largely because they conflate caliber with admissions/rankings as many were taught to do), so it could indeed be an expression of that.  I think if students knew more they they would be more proud.",
                                          "author": "oldeaglenewute2022",
                                          "created": 1568757879,
                                          "upvotes": 1,
                                          "replies": {
                                            "f0n1c0i": {
                                              "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0n1c0i/",
                                              "text": "I see where you’re coming from. Maybe I haven’t been here long enough, but I see plenty of Emory gear all around me. Sitting in the new dining hall I can see plenty of people wearing emory gear. But it is true our lack of sports don’t warrant much pride, and is something to take into account for",
                                              "author": "SupahWalrus",
                                              "created": 1568758000,
                                              "upvotes": 1,
                                              "replies": {
                                                "f0n243g": {
                                                  "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0n243g/",
                                                  "text": "Well I actually kind of agree with Shiny in that some new traditions and events are needed to highlight Emory's unique culture. Chicago was/is known for tough academics but came up with nerdy/quirky traditions (like their scavenger hunt thing which may actually have them build things) that really resonate with its students and have stood the test of time. My only differing opinion is that students have to be the source and have to be creative because of lack of D-1.  The latter is in no way prohibitive though.  \n\nIt is a combination of fitting traditions and knowledge of what the school has done or even what y'all do at it to enhance its reputation that ultimately builds it.  Folks from some D3 schools like Chicago and JHU may complain (they actually honestly take pride in having academics tough enough to tell stories about much like Georgia Tech) but are very aware of why the places are great/very aware of the overall impact of their institution and that certainly helps.  There are pathways and I honestly think Emory's relative newness to an elite academic status is what is prohibitive.  Having history of it generates more history worth knowing and pride even among undergrads. I always note that Emory is too humble and quite.  It should do a better job of rubbing institutional, faculty, and student achievements in everyone's face.",
                                                  "author": "oldeaglenewute2022",
                                                  "created": 1568758559,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "f0mut4o": {
                                      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0mut4o/",
                                      "text": "Why am I or any other student supposed to be the spokesperson for Emory? I’m not trained in this and even if I was I am not obligated to show loyalty to any school. Loyalty to individual professors and organizations that I’ve personally interacted with, sure, but the school is something too abstract to expect a deep bond with out of everyone.",
                                      "author": null,
                                      "created": 1568753632,
                                      "upvotes": 0,
                                      "replies": {
                                        "f0muwps": {
                                          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0muwps/",
                                          "text": "Simple, traditions are for students (YOU).  Students have way more power than you think.  I am not interested in obligations, but if one complains that something isn't present among STUDENTS (or that a student centered event isn't good enough for them) then students who wanna see a change should probably try to do something or change it.  Stuff doesn't change through magic or complaining on here or in the Wheel, especially student centered traditions. Admins can facilitate and help, but students have to drive some things.\n\n  I've been hearing this spirit and tradition stuff for so long. What are dissatisfied folks doing about it other than expecting spontaneous change? Perhaps the lack of a sense of obligation or one's potential role in \"spirit\" and \"tradition\" among students is and has been the problem.  You can't have good \"spirit\" or any of that stuff without it, some imagination(yes, people need this at a non-D1 place) , and attempts to get buy-in into whatever new events and traditions they may be interested in.",
                                          "author": "oldeaglenewute2022",
                                          "created": 1568753694,
                                          "upvotes": 1,
                                          "replies": {
                                            "f0mvumj": {
                                              "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0mvumj/",
                                              "text": "How do they exist for us? If anything they exist for the general university so they have something to differentiate themselves with and better bring  people into the rhythm of on-campus life. They’re bonding rituals not random shits and giggles events. \n\nHonestly I don’t even care whether or not my school has “spirit” or “community” (I am going to leave this place in a few years anyways and I will probably never see anyone in Atlanta again), it’s just that the question of “what is a college like” in the US treats spirit/tradition as a mandatory part of the answer and I don’t like having a stupid answer to a very common question. That’s it. I’m not so invested in the survival of an institution with a $6 billion endowment that I’m going to do their marketing homework for them.",
                                              "author": null,
                                              "created": 1568754281,
                                              "upvotes": 1,
                                              "replies": {
                                                "f0mw24p": {
                                                  "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0mw24p/",
                                                  "text": "If you feel that way, then you or whoever agrees with you need to advocate to the right people to change or enhance whatever is wrong.  Why can't they be for both the university AND the students? The intent does not have to be bad and ultimately is undergraduate centered.   My very point is that if you don't think it is for YOU, then encourage them to facilitate making more things that resonate with YOU.  Assuming that they are bad faith actors and that students have no obligation/can't have a serious role in enhancing student life and creating traditions certainly can't help.  I am a very cynical person, just not that cynical.",
                                                  "author": "oldeaglenewute2022",
                                                  "created": 1568754415,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "f0mwm6h": {
                                                      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0mwm6h/",
                                                      "text": "Something not being for students doesn’t mean it’s bad for students or even bad in general. And like I said I’m not going to spend a bunch of time and energy on a temporary institution over an issue that is nothing at best and cringy at worst.",
                                                      "author": null,
                                                      "created": 1568754781,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "f0mxc1k": {
                                                          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0mxc1k/",
                                                          "text": "I don't know, if certain things are mentioned as a negative by YOU and you think things in that arena would have been better if they were better, being a part of change and expending that energy to make things better for you and others may be worth it and quite fun.  Also, most don't view the experience as temporary, including the university.  The university prefers to build long term affinity beyond 4 or however many years.  Ability to do that obviously affects the university (or whatever unit you were a part of) fundraising, and overall health.  Ideally, students would rather have memorable traditions and experiences so that they find it worth having long time relationship with it. \n\n I find some aspects of D1 sports and the campus culture it can create cringy but no doubt it and the traditions students created around it is good for most students who like it (a crap ton) and the institution. We'll have to agree to disagree on this one.",
                                                          "author": "oldeaglenewute2022",
                                                          "created": 1568755259,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "f0n7avs": {
                      "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0n7avs/",
                      "text": "It’s hardly mere branding\n\nhttps://en.m.wikipedia.org/wiki/Robert_W._Woodruff\n\nThe Woodruff bequests (aka “The Coca-Cola Money”) transformed Emory starting c 1980\n\nMaybe they should explain that better.",
                      "author": "minty_cyborg",
                      "created": 1568762450,
                      "upvotes": 1,
                      "replies": {
                        "f0pdgzg": {
                          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0pdgzg/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1568832417,
                          "upvotes": 2,
                          "replies": {
                            "f0po0z3": {
                              "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0po0z3/",
                              "text": "Yeah, excellent point. It was sloppy of me to fail to mention Asa Candler and his family!",
                              "author": "minty_cyborg",
                              "created": 1568839320,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "f0n7b8a": {
                          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0n7b8a/",
                          "text": "**Robert W. Woodruff**\n\nRobert Winship Woodruff (December 6, 1889 – March 7, 1985) was the president of The Coca-Cola Company from 1923 until 1954. With a large net worth, he was also a major philanthropist, and many educational and cultural landmarks in the U.S. city of Atlanta, Georgia, bear his name.  Included among these are the Woodruff Arts Center, Woodruff Park, and the Robert W. Woodruff Library.\n\n***\n\n^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/Emory/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]\n^Downvote ^to ^remove ^| ^v0.28",
                          "author": "WikiTextBot",
                          "created": 1568762458,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "f0n8qzo": {
                          "link": "/r/Emory/comments/d5bshr/what_are_the_best_and_worst_things_about_emory/f0n8qzo/",
                          "text": "They know that.  They just don't like the event or think it is underwhelming.  I don't know.  It is kind of my point.  If we complain about traditions that Emory does have or say it is \"embarassing\", then what is to replace it or be added at a D-3 school?  And then when you ask that question to any Emory student they then say \"I am not obligated to help change or enhance it\", but the unproductive complaints about things(that I have yet to see change or enhance) that put them at least at the center are apparently obligatory. \n\n I just find it confusing.  If everyone says \"I expect everyone else or the administrators to be creative and find better means to generate traditions and  school spirit so that I can watch it passively and smile\".  It makes little sense and will never fix the issue because it seems everyone is taking that attitude.  It isn't just them, so I am sorry if I came off combative specifically to them.\n\n But going after that particular event is indeed a little petty given the relationship of Coca Cola to Emory.  Perhaps we should spice it up by inviting all of Georgia Tech's first year class to do it with Emory.  I mean I don't know. I'm just gonna leave it alone now, but this:\"I really want the currently absent spirit but shouldn't have to come up with to conjure it\" thing has always irked me much like my posts on here for lots of people lol",
                          "author": "oldeaglenewute2022",
                          "created": 1568763568,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}