{
  "sid": "qu7346",
  "link": "/r/Emory/comments/qu7346/has_anyone_taken_math210_with_andrew_kobin/",
  "title:": "Has anyone taken MATH210 with Andrew Kobin?",
  "text": "How was the class? I want to gain more insight about it before making a firm decision. Were there lots of group projects and quizzes? Thank you so much in advance! ",
  "author": "jspgr33n",
  "created": 1636947348,
  "updated": 1637182566,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkoi2zw": {
      "link": "/r/Emory/comments/qu7346/has_anyone_taken_math210_with_andrew_kobin/hkoi2zw/",
      "text": "Isn't that person new.  Pretty sure Carr was the only one to run that course in the past, and I suspect it'll be standardized since it is connected to the QTM major.  But either way, no one will be able to tell you how the Kobin person is gonna run it.",
      "author": "oldeaglenewute2022",
      "created": 1636949216,
      "upvotes": 3,
      "replies": {
        "hkoi612": {
          "link": "/r/Emory/comments/qu7346/has_anyone_taken_math210_with_andrew_kobin/hkoi612/",
          "text": "Did he not teach the class this semester?",
          "author": "jinosaurr",
          "created": 1636949260,
          "upvotes": 1,
          "replies": {
            "hkok0of": {
              "link": "/r/Emory/comments/qu7346/has_anyone_taken_math210_with_andrew_kobin/hkok0of/",
              "text": "Carr every single time before spring 2022.  Don't believe it, go check past course atlas years.  All I can say is that at least Carr was a lecturer, while this Kobin person is a post-doc so may be less committed to teaching which could be a problem if the course is indeed standardized (or run by Carr behind the scenes) and is as intense as it was with Carr.",
              "author": "oldeaglenewute2022",
              "created": 1636950238,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hkoq64a": {
      "link": "/r/Emory/comments/qu7346/has_anyone_taken_math210_with_andrew_kobin/hkoq64a/",
      "text": "I’m currently taking MATH221 with him. Hands down one of the best math professors I’ve had. He gives a lot of opportunity for extra credit and after each week, you can fill out a short reflection thing on canvas about what is going great and what is not going great in class. He reads all of them and makes good changes to the class based off of it. The quizzes are straightforward and definitely fair game and you will do well if you show up to lectures and do hw. Hw isn’t graded but it’s good to do because it’s practice for the quiz. His tests are straight forward and he curves the average to around low B/ high C. He’s a nice down to earth guy and will explain things again if you ask him to. I highly recommend.",
      "author": "redfade97",
      "created": 1636953790,
      "upvotes": 3,
      "replies": {}
    }
  }
}