{
  "sid": "qjtirb",
  "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/",
  "title:": "Off Campus Housing Search Advice",
  "text": "Just general advice for moving off campus next year. When should I get started with the process and when should I have a place confirmed? Good places that arent too expensive, places to avoid, advice with the actual process of looking at places, etc.\n\n I've heard people say living on campus is cheaper and people who say living off campus is cheaper, and I really want to live off campus, but I'd rather it not be more expensive.\n\nAny advice would be appreciated!!",
  "author": "Jellydonut4u",
  "created": 1635698968,
  "updated": 1635780374,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hisj5tv": {
      "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/hisj5tv/",
      "text": "Think Emory Point is similar in price, but avoid the leasing building which is any room that starts with a 3, so like 3XXX. I live there and its a little more expensive than on-campus but definitely not worth the money you are paying. It is a lot better in any other building though.",
      "author": "Korean_Yezus420",
      "created": 1635704687,
      "upvotes": 2,
      "replies": {}
    },
    "hit223z": {
      "link": "/r/Emory/comments/qjtirb/off_campus_housing_search_advice/hit223z/",
      "text": "I can’t tell if living off campus is cheaper or not for me bc i have a 12 month lease for an off campus apt vs living on campus for just the school year. There’s a lot of apartments around Emory, it just depends whether or not you need one close to a shuttle. I’d make a list of options and just look at their floor plans on the website to know the availability of their units. I’d say most ppl start looking anywhere from mid-spring semester to june/july. Most people will have leases that end either the end of the spring semester or the end of july.",
      "author": "EveningExit",
      "created": 1635712549,
      "upvotes": 2,
      "replies": {}
    }
  }
}