{
  "sid": "n74eil",
  "link": "/r/Emory/comments/n74eil/kinesiology_major/",
  "title:": "Kinesiology Major?",
  "text": "Hi all, I was looking at Emory's majors and didn't run across a kinesiology or physiology major. I was wondering if anyone has any experience with a major that is closely related to kinesiology or physiology? I was thinking that NBB might, as it prepares students to analyze things on a \"cognitive and physiological level,\" but I'm not sure.",
  "author": "doomy2003",
  "created": 1620409673,
  "updated": 1634098137,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "gxbc6vx": {
      "link": "/r/Emory/comments/n74eil/kinesiology_major/gxbc6vx/",
      "text": "**TL;DR:** There will be none. If you get into Emory, best bet to start working on human-specific courses would be to do Nursing. That's it. My advice? A degree is an investment, make sure you're getting a good ROI if you're gonna spend this much money on it. Even nursing is a stretch (depending on cost) because the RN matters more than where you get the degree. Find a program that gives you the best job security and if you still wanna do kinesiology stuff, learn that in PT/OT grad school.\n\nMore specific hard and social sciences such as NBB, Anthopology/Human Biology, and Human Health also offer some connection with physiology but not the primary focus. Finally, broader/basic sciences such as Biology or Biophysics coupled with minors such as Nutrition Science or Predictive Health offer a complete background in biology but you can focus your electives in some physiology courses.\n\nI only see those majors you mentioned in big universities that can accommodate the \"demand\" per se, and by demand I just mean volume of people, not really genuine interest. Kinesiology or Physiology as a major at the bachelor's level is frankly, useless by themselves in that they have a difficult time landing jobs directly related to their field. Not unlike Athletic Training, you would have a tough time getting a well-paying job that directly applies your degree.\n\nThese programs are best used as stepping stones to graduate programs such as OT, PT, and others such as medical school (they don't care about majors). If you land an actual job that gives patient care experience, you could also do PA school. But you could do that as well with any degree and just completing the prerequisites for these programs, so even that purpose is moot.",
      "author": "MyKali",
      "created": 1620419309,
      "upvotes": 7,
      "replies": {}
    }
  }
}