{
  "sid": "qe2u97",
  "link": "/r/Emory/comments/qe2u97/cs_at_emory_how_good_is_it/",
  "title:": "CS at Emory. How good is it?",
  "text": "Is a CS major at Emory good? How are the classes and internship opportunities? Please help. Thank you so much",
  "author": "ricewithdew",
  "created": 1634987233,
  "updated": 1635185272,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hhqvefl": {
      "link": "/r/Emory/comments/qe2u97/cs_at_emory_how_good_is_it/hhqvefl/",
      "text": "It's been a while since I graduated but no one from my cohort had trouble getting a job out of college as far as I know. Elective choices are more limited relative to a school like GT, but they also have an entire college of computing, and I enjoyed all my electives regardless.\n\nThe faculty tends to be big on AI/NLP/Data Science if that's your thing, and the electives reflect that.\n\nHappy to answer any other questions you might have.",
      "author": "TheThobes",
      "created": 1635000335,
      "upvotes": 5,
      "replies": {
        "hhqyzi3": {
          "link": "/r/Emory/comments/qe2u97/cs_at_emory_how_good_is_it/hhqyzi3/",
          "text": "What about the internship opportunities?? Is co-op available? And research opportunities?",
          "author": "ricewithdew",
          "created": 1635002735,
          "upvotes": 1,
          "replies": {
            "hhr0t69": {
              "link": "/r/Emory/comments/qe2u97/cs_at_emory_how_good_is_it/hhr0t69/",
              "text": "I don't think they struggle with jobs anymore but what I would keep in mind is that there are only a few privates (even among elites) with very strong CS programs.   It is mostly large highly/very selective publics that have ultra strong curricula (like even many T10 privates are trying to keep up with these places and will copy off of them by offering watered down versions of their analogous courses.  And the elective offerings still aren't close) and super robust professional development infrastructure that intentionally funnels students into internships.  At the other schools/privates like Emory and most of its near peers, you're talking very average curricula, rigor somewhat tailored to a more well-prepped crowd (versus rigor definitely meant to make you the most hardcore programmer at a place like Tech, Berkeley, Urbana-Champagne, CMU, Stanford, MIT. I may actually add Rice. Strong HPC related infrastructure and oppurtunities).  I'd say they've gotten better in the curricula part (they just rearranged it) and have a lot more momentum on student empowerment which likely has improved the job search process, but you still always have to be independent and are mainly leveraging your connections to faculty/the calibre of the school overall, willingness to take on personal projects and learn code outside of class that would allow you to pass screening challenges.\n\nHowever if you want to be a data analyst, the QTM department has much stronger professional development (with an intentionality that matters) infrastructure in and out of class to train you for that.  You can do a concentration there and maybe double major in CS (the math pre-reqs overlap a bit) or use the informatics major via QTM and take additional CS classes.   QTM is clearly trying to have professional development infrastructure that more so mirrors the b-school (very robust) than other ECAS departments AND they will be getting continued investment in all of that with this new campaign.  You may want to look into what that department offers and how it operates.\n\nIf you want to become a hardcore programmer, seriously consider a CMU, Stanford/MIT as reaches and many of the CS programs at places like Michigan, Georgia Tech, Berkeley, Urbana-Champagne,  etc (maybe even UCLA which has a ridiculous data science arm for UGs).\n\n&#x200B;\n\nAnd yes research ops are available.   Jinho Choi's research projects have gotten an awful lot of interest lately (at the national level):\n\n[https://www.cs.emory.edu/events/news/#news284](https://www.cs.emory.edu/events/news/#news284)\n\nand they seem to get selected for a high yield competition almost every year (and won 2 years ago! Beating Stanford's team by quite a bit) and he takes undergrads.  Emory and key depts including CS are really leaning into AI related research and the university is investing in it, so that will definitely become a strong area.  Co-ops?  That sounds like that is more common at CS programs hosted within engineering schools at the publics I alluded to.   Don't get obsessed with these top tier privates if you wanna do STEM, especially CS.  At the UG level, most of them excel in life sciences at least (maybe because most are attached to healthcare systems and end up being pre-med factories), and of course many of the super elite schools have very strong math and physics departments, but CS seems under-developed/just trying to keep up at most of them. On the prof. dev side, there are places outside of the highest ranked privates great at it.  Like Northeastern has a really good model that seems to be working.",
              "author": "oldeaglenewute2022",
              "created": 1635003716,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hhqyzww": {
          "link": "/r/Emory/comments/qe2u97/cs_at_emory_how_good_is_it/hhqyzww/",
          "text": "What about the internship opportunities?? Is co-op available? And research opportunities?",
          "author": "ricewithdew",
          "created": 1635002741,
          "upvotes": 0,
          "replies": {
            "hhr1xe8": {
              "link": "/r/Emory/comments/qe2u97/cs_at_emory_how_good_is_it/hhr1xe8/",
              "text": "Admittedly I did most of my internships back in my hometown at a small company and the local university, but the career center is a great resource to get internships, and the guy who oversees math/cs majors is great.\n\nI don't believe mid-semester Co-ops are available in the way that they are at GT but I could be wrong.\n\nResearch is available, both as part of an honors thesis and on a more informal basis, although I never did any research myself. You'd just have to find a professor that has a research area that interests you, discuss it with them, and go from there.",
              "author": "TheThobes",
              "created": 1635004256,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}