{
  "sid": "of184w",
  "link": "/r/Emory/comments/of184w/class_registration_freshman/",
  "title:": "Class Registration Freshman",
  "text": "Hi!\n\nI had a question on what you guys think one should prioritize when registering for class. I saw on the website that we could register for a max of 8 credits on the first day of registration, and then the remainder credits would be the second and third day. Obviously most people will have more than 8 credit hours, so I was wondering what I should prioritize and try to register on the first day. \n\nShould I prioritize my (potential) major classes (since I don't actually have a declared major yet) or should I prioritize the freshman requirements? Should I prioritize by professor? What should I try to get on the first day of registration?\n\nThanks!",
  "author": "k1tty_",
  "created": 1625596952,
  "updated": 1634097582,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "h49txjb": {
      "link": "/r/Emory/comments/of184w/class_registration_freshman/h49txjb/",
      "text": "Prioritize the small, in-demand classes first. A language would be good to try out as early as you can either to just knock it out or find something you're interested in (and potentially major in, which requires some years of study).\n\nPre-med courses can get filled up quickly (not sure what you want to major in) but they also shift a lot during A/D/S. It's not too much of a priority because you will get in, except maybe for selecting a specific time that you want that's popular. You might not get it if you wait too long.\n\nOther than that, consider upper-level courses that have no prereqs as well (usually social science). Don't be intimidated by those because if they have no prereqs, you should be fine.\n\nIf you're pre-BBA, you should definitely get your b-school prerequisites out of the way.",
      "author": "MyKali",
      "created": 1625600663,
      "upvotes": 4,
      "replies": {
        "h49uqhi": {
          "link": "/r/Emory/comments/of184w/class_registration_freshman/h49uqhi/",
          "text": "Thank you so much for your reply! \n\nI’m looking to major in the Psychology and Linguistics combined major! I’ll still leave the major-specific courses for later but I was wondering if I should sign up for PSYC 110 and QTM 100 on the first day lol\n\nLooking to join CHN 103 (the one for heritage speakers) but it’s 5 credits so it would limit the amount of classes I could sign up for on the first day. \n\nAlso looking at MUS 190 for my freshman seminar, it’s a class that I would really love to take but I don’t know how much of a priority I should make it in terms of registration. \n\nI am not planning on anything business but I’m def not opposed to it. Not sure about double major or anything but can non-majors still take classes at the business school?",
          "author": "k1tty_",
          "created": 1625601019,
          "upvotes": 1,
          "replies": {
            "h4abzk3": {
              "link": "/r/Emory/comments/of184w/class_registration_freshman/h4abzk3/",
              "text": "That's an interesting combo. I would go ahead and start putting LING 201 on your schedule, which is 4 credits. A lot of LING courses are locked behind this one. I don't see LING 101 offered yet. Many LING courses also count as ANT courses if you're ever interested in taking classes from their department. I always thought LING was interesting.\n\nCHN 103 will probably not close as early as 101. Heritage courses aren't as in-demand as the intro courses but CHN can be different since there are a lot of international students trying to get in it.\n\nQTM 100 will have open slots but it may not be the professor you want so registering early might not be a bad idea. I put off QTM 100 till my very last year so I'm taking it this fall as well.\n\nAnd you can only take the b-school prereq courses but not actual courses for b-school as an ECAS student. I haven't heard of them letting people in if there are openings but... I'm not an expert.",
              "author": "MyKali",
              "created": 1625608863,
              "upvotes": 2,
              "replies": {
                "h4acv0q": {
                  "link": "/r/Emory/comments/of184w/class_registration_freshman/h4acv0q/",
                  "text": "Does PSYC 110 (3 credits) MUS 190 (3 credits) and then ECS 100 and HLTH 100 (1 credit each) sound good for the first day? I know I wanna go into Psych, not totally sure about the linguistics part so I was planning on putting it off til next semester? Idk lol (also I would be going over the 19 credit cap for freshmen 1st semester if I added LING) \n\nAlso, according to the website I need to take LING 101 as well as LING 201. Is it a bad idea to take 201 before 101?",
                  "author": "k1tty_",
                  "created": 1625609270,
                  "upvotes": 1,
                  "replies": {
                    "h4af6po": {
                      "link": "/r/Emory/comments/of184w/class_registration_freshman/h4af6po/",
                      "text": "I'm not sure about MUS 190's popularity but if you really want to take it, you should. That's really all the reason you should have when picking courses, besides their quality. At least you're not like some of the pre-meds at Emory actively picking the easiest courses just to preserve GPA (you'll meet some of them at PSYC 110).\n\nLING 101 is basically a history course and LING 201 is the foundation course that actually teaches you linguistics. They're standalone courses so it's fine to take 201 first. Don't be dissuaded by the arbitrary course numbers, they only make sense sometimes. I think you'll find out early if you're interested in LING just by checking out 201.\n\nBut yeah since you're sure about psych, take those first and get good times. Then have everything else in your shopping cart ready to go. Don't be afraid to add up to 19 then just drop it down later during A/D/S. And also try to attend some classes even if you're not enrolled to see if they feel right.",
                      "author": "MyKali",
                      "created": 1625610393,
                      "upvotes": 3,
                      "replies": {
                        "h4ahh6x": {
                          "link": "/r/Emory/comments/of184w/class_registration_freshman/h4ahh6x/",
                          "text": "Ok but like you don’t get it you saved my ass holy shit ;-; \n\nI am so very thankful",
                          "author": "k1tty_",
                          "created": 1625611521,
                          "upvotes": 2,
                          "replies": {
                            "h4bfxd1": {
                              "link": "/r/Emory/comments/of184w/class_registration_freshman/h4bfxd1/",
                              "text": "No worries. You're confused, I was too. I don't know what it's like to be a freshman at Emory but I've taken a variety of courses at Emory as a non-trad transfer. I still research a lot of opportunities at Emory (majors, pre-professional stuff, dual degrees, etc.), even those I'm not able to do just in case someone needs info.",
                              "author": "MyKali",
                              "created": 1625629736,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "h6jfc22": {
                  "link": "/r/Emory/comments/of184w/class_registration_freshman/h6jfc22/",
                  "text": "I'm really interested in registering in PSYC 110 and QTM 100 as well, but right now the enrollment status on both classes says closed, and it says there are 0 remaining spots. Are they truly already filled up by upperclassmen already? Or do I still have a chance at getting those classes?",
                  "author": "No-Ear-8494",
                  "created": 1627264207,
                  "upvotes": 1,
                  "replies": {
                    "h6jnnb4": {
                      "link": "/r/Emory/comments/of184w/class_registration_freshman/h6jnnb4/",
                      "text": "Closed, not waitlisted right? Only way would be to watch the slots like a hawk during A/D/S and be the first to secure a lot when someone inevitably drops the one you want. OPUS would be more accurate than Atlas in this case.",
                      "author": "MyKali",
                      "created": 1627268790,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}