{
  "sid": "hthe1c",
  "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/",
  "title:": "How restricted will things be? Is it true that a lot of people will have to stay in their rooms all day?",
  "text": "I’m an incoming freshman, and I’m currently deciding whether or not I want to live on campus.\n\nWill it really be that hard to socialize? Being able to talk/hang out with people is a big reason as to why I’d be going. With classes and clubs going online, and a lot of places such as the cafeteria being restricted, it seems like there’d be a lot less opportunities to do that. And how would that look like anyways? Would I have to do things like go in random dorms or talk to people that are sitting outside to meet new people? I’m shy though so um, don’t know how stuff like that would work out.\n\nI was kind of looking forward to going to the library too (don’t know if students will be able to use that) since it’s hard for me to study at home. If I’m going to stay in my room all day I’d rather do that at my home than in Atlanta though. Saving some money would be nice, but my parents don’t really care.",
  "author": "RedSerendipity",
  "created": 1595082162,
  "updated": 1634098703,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 1.0,
  "comments": {
    "fygyji9": {
      "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fygyji9/",
      "text": "[deleted]",
      "author": null,
      "created": 1595087233,
      "upvotes": 18,
      "replies": {
        "fyh0tg1": {
          "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fyh0tg1/",
          "text": "Thanks for the response! It’s nice to know I’d be able to study there if I decide to go.",
          "author": "RedSerendipity",
          "created": 1595088521,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fyh0orl": {
      "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fyh0orl/",
      "text": "i think it all depends on the type of person you are to be honest. for me, i am a bit shy and reserved so making friends is hard enough without masks and social distancing measures. if you think you’ll be able to make meaningful connections in the fall with these restrictions, by all means go. \nthat being said, you’re an incoming freshman. campus will still be here when we get back and you’ll have plenty of time to take full advantage of it even if you stay home this semester.",
      "author": "jackschnei",
      "created": 1595088447,
      "upvotes": 13,
      "replies": {
        "fyh19if": {
          "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fyh19if/",
          "text": "I mean, I honestly have no idea how my experience will be like and what I’ll be able to do. Might be worth going if I’m not sure.",
          "author": "RedSerendipity",
          "created": 1595088772,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fyh425e": {
      "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fyh425e/",
      "text": "Going to other dorms might not be allowed. I vaguely recall an email saying that people who do not live in a particular dorm will not be allowed in.",
      "author": "iapetus3141",
      "created": 1595090311,
      "upvotes": 10,
      "replies": {
        "fyh7lhs": {
          "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fyh7lhs/",
          "text": "Really? That sucks.",
          "author": "RedSerendipity",
          "created": 1595092271,
          "upvotes": 7,
          "replies": {
            "fyhc4kg": {
              "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fyhc4kg/",
              "text": "It sucks for socializing, but it's the right call. College dorms are literally textbook examples for the effects of small, densely packed areas on disease spread. They already had to reserve an entire dorm for swine flu back in 09, and I imagine they don't want to (and maybe can't now) do that again.\n\nPlease don't actively try to dodge the rules. I know making friends in college and stuff can be hard, but you really don't want Emory blowing up with COVID cases.",
              "author": "1337HxC",
              "created": 1595094748,
              "upvotes": 9,
              "replies": {
                "fyhhaun": {
                  "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fyhhaun/",
                  "text": "Yeah, I agree with you. While it’s unfortunate it’s for the best. I’ll try my best to follow guidelines.",
                  "author": "RedSerendipity",
                  "created": 1595097544,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fyleqst": {
      "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fyleqst/",
      "text": "The library will be open by appointment. Campus life is looking at ways to create safely distanced social activities such as movie nights. They probably will discourage congregations in enclosed spaces",
      "author": "cactuscat123",
      "created": 1595192621,
      "upvotes": 1,
      "replies": {
        "fzlrd1b": {
          "link": "/r/Emory/comments/hthe1c/how_restricted_will_things_be_is_it_true_that_a/fzlrd1b/",
          "text": "oh i love movie nights i really hope they pull through with that",
          "author": "anacrissy",
          "created": 1596013042,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}