{
  "sid": "o4l87w",
  "link": "/r/Emory/comments/o4l87w/what_was_the_ib_score_that_got_you_into_emory/",
  "title:": "What was the IB score that got you into Emory?",
  "text": "What was the IB predicted score that got you into Emory?\n\n(What about SAT and major extracurricular activities?)\n\nI know that the predicted scores are not everything Emory looks at, but I just want to have a little guidance in deciding whether I am likely for this school. I am a US student, and I am trying to apply ED with a current SAT 1510 and IB predicted 40\\~42.\n\nIf you could share your stats that would be very helpful.",
  "author": "gkssksat",
  "created": 1624243419,
  "updated": 1634097946,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "h2i4e5j": {
      "link": "/r/Emory/comments/o4l87w/what_was_the_ib_score_that_got_you_into_emory/h2i4e5j/",
      "text": "I got 39 out of 42, and have a SAT of 1500. I did BIO, MATH AA, ECON for HL, Chinese A, English B, and Chemistry for SL.\n\nI think my extracurricular activities are slightly above average, but nothing extraordinary.\n\nI think you have a quite solid chance if you apply ED",
      "author": "Jiangzemin0817",
      "created": 1624248332,
      "upvotes": 2,
      "replies": {}
    },
    "h2j958n": {
      "link": "/r/Emory/comments/o4l87w/what_was_the_ib_score_that_got_you_into_emory/h2j958n/",
      "text": "I was under the impression that IB predicted scores were kinda irrelevant when applying to US schools. My schools didn’t even tell me my predicted. Although I was class of 2020 so I never took those exams lmao. I was told to just care about getting a diploma and any additional points after that are just an ego boost. I got in with a 1540 SAT and took math history psych and English HL and French and physics SL and got 33 points.",
      "author": "voulusia",
      "created": 1624282171,
      "upvotes": 2,
      "replies": {
        "h2m9agz": {
          "link": "/r/Emory/comments/o4l87w/what_was_the_ib_score_that_got_you_into_emory/h2m9agz/",
          "text": "Really? Hope it's not bc my school only cares abt IB scores ;(",
          "author": "gkssksat",
          "created": 1624336021,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h2iv6jl": {
      "link": "/r/Emory/comments/o4l87w/what_was_the_ib_score_that_got_you_into_emory/h2iv6jl/",
      "text": "I’m an international student and got in together with a friend (both via RD 2025). Both of us had 40/45.\n\nI had HL Bio, Econ, English and SL Chem, Math A&A, German A",
      "author": "Professional210",
      "created": 1624272242,
      "upvotes": 1,
      "replies": {}
    },
    "h2qc35c": {
      "link": "/r/Emory/comments/o4l87w/what_was_the_ib_score_that_got_you_into_emory/h2qc35c/",
      "text": "I applied to Emory for my ED2 had a predicted IB of 39/45 (I took HL Business, Math AI, Physics and SL English, Spanish Ab, Comp Sci) and my ACT was 36. I had some prettty good activities (leading HR department for an organisation that teaches basketball for deaf children, creating a website to help reduce food wastage, to name a few) but I think Emory would care more about your character and what you do outside of school more than your numbers.",
      "author": "lifeisntawind",
      "created": 1624420221,
      "upvotes": 1,
      "replies": {}
    },
    "h3il98s": {
      "link": "/r/Emory/comments/o4l87w/what_was_the_ib_score_that_got_you_into_emory/h3il98s/",
      "text": "I was predicted a 40 with HL Literature, Economics, and Biology, and ended up with a 39. However, I do know someone at Emory who got a 30-ish on the IB so I wouldn't worry too much about scoring super high. My ACT was also a 32 with lots of extracurriculars and average teacher recs, so I would say you're probably fine so long as you have at least one other distinguishing feature.",
      "author": "Stock-Argument-186",
      "created": 1625020455,
      "upvotes": 1,
      "replies": {}
    },
    "h2jiq3a": {
      "link": "/r/Emory/comments/o4l87w/what_was_the_ib_score_that_got_you_into_emory/h2jiq3a/",
      "text": "It might be different for IB, but I took AP classes and I was told AP scores don’t matter very much. \n\nI got in ED1 with a 1440. You’re in great shape as far as your SAT. Emory isn’t as big on test scores as other colleges anyway, so focus on improving other aspects of your application to give you your best chance.",
      "author": "screamingviking13",
      "created": 1624286928,
      "upvotes": 0,
      "replies": {}
    }
  }
}