{
  "sid": "g00ve0",
  "link": "/r/Emory/comments/g00ve0/what_do_freshman_who_want_to_go_into_the_business/",
  "title:": "What do freshman who want to go into the business school do before they enter?",
  "text": "I am an incoming freshman who will hopefully be entering the business school second semester sophomore year. I do not want to double major, but am not sure what kinds of classes I should take (aside from distribution requirements and business school prerequisites) for those first 1 and a half years. I have a max AP credits as well that I plan on using to get out of some of the distribution requirements. I saw the business school does not award minors on your degree, so is it worth it to complete the normal coursework for a minor during this time?",
  "author": "throwaway_097646",
  "created": 1586712467,
  "updated": 1634099293,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "fn7b2wg": {
      "link": "/r/Emory/comments/g00ve0/what_do_freshman_who_want_to_go_into_the_business/fn7b2wg/",
      "text": "If you are interested in the subject I’d say it’s worth it. If you’re coming in with Max AP credits for some of the classes then you’ll have a ton of free time. My roommate is in this same situation for next semester because he has no more classes to take.\n\nWhile you don’t get an official minor, it doesn’t actually matter that much. You can just put “extensive coursework in...” or “unofficial minor in...” and it doesn’t make a huge difference. \n\nMy recommendation is take a course or two in your first semester that aren’t just GERs but are in something you’re interested in. That way by the time you get to first semester sophomore year you’ll be able to take the more advanced courses for that Minor. You can also try to take some business school courses like managerial accounting and ISOM 351 after you’ve completed the other business school requirements.",
      "author": "OrangElm",
      "created": 1586716818,
      "upvotes": 4,
      "replies": {}
    },
    "fn7kki9": {
      "link": "/r/Emory/comments/g00ve0/what_do_freshman_who_want_to_go_into_the_business/fn7kki9/",
      "text": "You are lucky then if you do not want to do another major and have some many credits coming in. You can get all of your GERs out of the way, and maybe intern during the semester!\n\nI think if you are going to do a 'minor', you might as well complete the major. Depending on the major, it may only be 4 classes more. Also, it's not like you didn't do the minor, you can still put it on your resume. No one checks. Also, even if you double major, you don't get the second major on your diploma anyways.",
      "author": "Worldlover67",
      "created": 1586722182,
      "upvotes": 2,
      "replies": {}
    },
    "fp4mq9l": {
      "link": "/r/Emory/comments/g00ve0/what_do_freshman_who_want_to_go_into_the_business/fp4mq9l/",
      "text": "Goizueta professor here (10+ years). The bba program has a lot of very motivated ambitious competitive students which makes recruiting ie job/internship hunting tough/competitive. I strongly suggest you go as hard as you can and follow your b-school passion and load up as much as you can with relevant coursework and clubs. Seek real internships even if unpaid (if you can afford to) over non-major-related summer jobs. Even the times I've taught the core finance course, I've frequently had sophomores in my classes. All prof's I know are willing to waive prerequisites for upper level classes if you're motivated and enthusiastic. The opportunities are there so I encourage you to go for them. Your gbs degree has pretty good street cred esp in Atlanta but you have to distinguish yourself and the students are generally very good.",
      "author": "ebiatda",
      "created": 1588302444,
      "upvotes": 1,
      "replies": {}
    }
  }
}