{
  "sid": "omcjtt",
  "link": "/r/Emory/comments/omcjtt/oxford_question/",
  "title:": "Oxford question",
  "text": "Hi! I am deferring from Oxford Emory for a yr to take a gap yr. I  was rlly hoping to get off the waitlist elsewhere because the other place was my dream skl. I am still excited to go to Ox and grateful for the opportunity but it makes me nervous that it's so far from my home and that people seem to put it down when comparing it to Emory. I'm also still suffering from feeling like a failure for not getting into my dream school because the high skl I went to had a rlly toxic and competitive environment. This sucks because I rlly wanna feel happy to be going to Emory Oxford. I also read a review that said there was bugs in the Oxford food lol. Is there anyone I can chat with that went to Oxford? Thanks so much to anyone willing to offer me some guidance :) I rlly appreciate it :)",
  "author": "Swiss_Sis",
  "created": 1626555246,
  "updated": 1634097515,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.67,
  "comments": {
    "h5k62ng": {
      "link": "/r/Emory/comments/omcjtt/oxford_question/h5k62ng/",
      "text": "Gonna be a sophmore at Oxford now, and though I went remote my first year, I think someone would've said something in the gc if there were bugs in the food lol. Nope, just normal buggy dorms afaik but that's at every school. Also, I haven't experienced any put downs for starting at Oxford as opposed to Atlanta campus, I think that's all in your head. I was worried about that too at first, but then realized it was just a stupid insecurity thing. I've taken classes at both Oxford and Atlanta campus, there's not been a difference to me in how smart students are in class, we're all just struggling together but pushing through it. No one in Atlanta campus classes looked down on me for being an Oxford student, we just vibed and had fun while working on projects and stuff.",
      "author": "Artist552001",
      "created": 1626558573,
      "upvotes": 4,
      "replies": {}
    },
    "h5kk6vr": {
      "link": "/r/Emory/comments/omcjtt/oxford_question/h5kk6vr/",
      "text": "Hey, I just graduated Oxford last semester and I've never found any bugs in our food. I was on campus for most of my first year but online all of my second year. Feel free to PM me if you want to ask any questions or talk more about Oxford!",
      "author": "bunhead42",
      "created": 1626566080,
      "upvotes": 3,
      "replies": {}
    },
    "h7vscgd": {
      "link": "/r/Emory/comments/omcjtt/oxford_question/h7vscgd/",
      "text": "I also took a gap year and then went to Oxford. After taking a year off, coming back to such a small community was a shock. You may feel a bit claustrophobic. \n\nIn my experience, some people hate Ox, some people love it. If you hate it, then just graduate early and try your best to get involved with the Emory Campus.",
      "author": "sopwill333",
      "created": 1628213635,
      "upvotes": 1,
      "replies": {}
    }
  }
}