{
  "sid": "ogjj4b",
  "link": "/r/Emory/comments/ogjj4b/language_classes/",
  "title:": "Language classes",
  "text": "I’m currently equally interested in two languages (Spanish and German). And I was wondering how these classes are at Emory? I mean, does one language have better teachers? (I am just trying to see how students feel about each department to get an insider perspective)\n\nEdit: I’m a beginner at both languages",
  "author": "anonymousmadefor",
  "created": 1625788179,
  "updated": 1634097563,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "h4jkqd2": {
      "link": "/r/Emory/comments/ogjj4b/language_classes/h4jkqd2/",
      "text": "Curious to know your proficiency levels with each of these languages but from the perspective of someone who has taken SPAN201 (and currently taking SPAN202), I would say that the professors are pretty chill overall.\n\nAlthough some might be a bit more uptight than others when it comes to classroom dynamics and structure, I would suggest getting a prof who is 1) preferably Hispanic themselves for more \"inside scoop\" tricks and tips and/or 2) is upbeat and genuinely excited to teach.\n\nThe professors I had were [Prof. Travers](https://www.ratemyprofessors.com/ShowRatings.jsp?tid=2623480) (6/10 for me) and now [Prof. Sierra](https://www.ratemyprofessors.com/ShowRatings.jsp?tid=1202100&showMyProfs=true) (8/10 for me). Although mixed reviews for both profs, hope this helps on the Spanish side!",
      "author": "ExternalConfidence49",
      "created": 1625795056,
      "upvotes": 3,
      "replies": {
        "h7dwaar": {
          "link": "/r/Emory/comments/ogjj4b/language_classes/h7dwaar/",
          "text": "Hopping on here late but how much work is Spanish class with Prof. Travers vs Prof Sierra? I got placed into Spanish 212 but definitely need some review so I’m not feeling the most confident tbh.",
          "author": "throwawaylyla",
          "created": 1627872194,
          "upvotes": 2,
          "replies": {
            "h7h1dc5": {
              "link": "/r/Emory/comments/ogjj4b/language_classes/h7h1dc5/",
              "text": "I think Prof. Sierra will be a bit more chill than Prof. Travers, especially since Sierra's main goal is for everyone to do well in the class while also having fun learning the material.\n\nOverall, IMO Prof. Sierra is the move in congruence with your situation, but if you end up loving Spanish in the end, perhaps a prof with a bit more rigor incorporated in their class would be more beneficial in the future.\n\nExcellent question!",
              "author": "ExternalConfidence49",
              "created": 1627937490,
              "upvotes": 1,
              "replies": {
                "h7h6s2e": {
                  "link": "/r/Emory/comments/ogjj4b/language_classes/h7h6s2e/",
                  "text": "Thanks so much for the tip! I’ll see if I can fit prof sierra’s class in. Have you heard anything about Prof Claveria? (Not sure if Prof Sierra’s class will work w my schedule)",
                  "author": "throwawaylyla",
                  "created": 1627939898,
                  "upvotes": 2,
                  "replies": {
                    "h7ko38h": {
                      "link": "/r/Emory/comments/ogjj4b/language_classes/h7ko38h/",
                      "text": "Np! And I have not, but I think Ratemyprofessor has got some better, more thorough reviews for Claveria👍",
                      "author": "ExternalConfidence49",
                      "created": 1628010863,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h4k0ci0": {
      "link": "/r/Emory/comments/ogjj4b/language_classes/h4k0ci0/",
      "text": "Although I can't comment on Spanish, the German department is great! However, both 101 and 102 have heavy workloads.",
      "author": "iapetus3141",
      "created": 1625803690,
      "upvotes": 1,
      "replies": {
        "h4k571b": {
          "link": "/r/Emory/comments/ogjj4b/language_classes/h4k571b/",
          "text": "What is the workload like? I mean, Flashcards, notes, or…? How does a typical assignment look like and how much time do u usually spend on it?",
          "author": "anonymousmadefor",
          "created": 1625806934,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}