{
  "sid": "npjv9a",
  "link": "/r/Emory/comments/npjv9a/pre_goizeuta_reqs/",
  "title:": "Pre Goizeuta Reqs",
  "text": "Hi guys! I'm an incoming soph transfer to emory who was set on getting into the business school. I was wondering how difficult courses like Macroecon and ISOM are? Would it be worth it to try and take stats or macro over the summer at like a CC? Thanks!",
  "author": "Butt3rChick3n",
  "created": 1622515474,
  "updated": 1634098027,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "h05i6zm": {
      "link": "/r/Emory/comments/npjv9a/pre_goizeuta_reqs/h05i6zm/",
      "text": "My guess would be that most of those classes are not all that difficult to do well in or else you wouldn't get 80%+ of applicants with the mean GPA listed at the bottom of this page (If I had to guess, Calc. 1 and financial accounting may be the \"dent\" in some people's grades). \n Then there may also be an impact from the amount of pre-meds who convert/change to business):https://goizueta.emory.edu/undergraduate-business-degree/admissions \n\nAnd I'd never recommend the risk of taking it at a CC because GBS sometimes seems very stringent on where they take credits from and will ask for a syllabi or some material to assess equivalency.  I've seen some transfers from 4 years that are generally deemed less rigorous or non-equivalent for whatever reason get denied econ. credits.\n\nFurthermore in the transfer section:https://goizueta.emory.edu/undergraduate-business-degree/admissions\n they have this statement that suggests or implies that they may be hostile or unwelcoming of certain outside credits after you've already matriculated:\"GBS prefers students complete the majority of their business coursework here at Emory, so students with a number of business classes from another institution are not good transfer candidates.\"  You'll definitely be much more competitive if you even put up a decent performance in the Emory versions.  Just use gen. eds to balance out your schedule if you are that worried.\n\nEither way, you definitely wouldn't wanna do ISOM.",
      "author": "oldeaglenewute2022",
      "created": 1622516544,
      "upvotes": 3,
      "replies": {}
    },
    "h05plqo": {
      "link": "/r/Emory/comments/npjv9a/pre_goizeuta_reqs/h05plqo/",
      "text": "The difficulty ranges from person to person. Generally, many people find financial accounting more difficult than Isom or bcon. Also, you cannot take any b-school prereqs outside of Goizueta (unless you’re taking mirco/macro in ECAS)",
      "author": "wut_it_is",
      "created": 1622521130,
      "upvotes": 3,
      "replies": {}
    }
  }
}