{
  "sid": "hqs26q",
  "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/",
  "title:": "CHEM 150 professors (who do y’all recommend)",
  "text": "I hope everyone and their family is safe and healthy!! \n\nI want to take CHEM 150 this upcoming semester and below is the list of professors teaching each section!! If you could please leave some insight about which professors are good and how they function (lectures, homework, resources, grading, etc). Thank you so much!! \n\n- Tracy McGill\n- Antonio Brathwaite\n- Richard Himes\n- James Kindt\n- Elaine Liu",
  "author": "belmabitch",
  "created": 1594689358,
  "updated": 1634099286,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "fxzrrz7": {
      "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fxzrrz7/",
      "text": "Chem 150 is pretty standardized in terms of content, how the classes are graded (homework, in class worksheets/problems, and learning assistant mentor sheets are all normalized I am pretty sure, but maybe u/phraps who is apparently a learning assistant can confirm)/taught and the tests are almost standardized as well (I think the MCQs are normalized, and like 1/2-2/3 of the FRQs are normalized.  They can take liberties on 1/2-1/3 of the FRQs and usually most of them just end up choosing the same questions).\n\nMcGill is definitely the most experienced with the curriculum (because she basically designed it, piloted it, and had been basically teaching the same content and style years before the curriculum change).  McGill should probably be your top choice, Brathwaite/Kindt 2nd, Himes 3rd (only because he is new-came from College of Charleston. Seems to have good reviews, but this may be a rough year to transition to a new environment).  The last person is a post-doc or grad. student on a fellowship that hasn't taught the course before.  They may end up fine, but maybe only take if you really want a small section size.  Since the final will definitely be common, just try to get McGill if you can (she may have the biggest hand in proposing and selecting problems for it).  Good luck!\n\nI'll PM you an old McGill and Weaver syllabus so that you have an idea of how the course is designed and graded.  150 is the same across sections.  It seems that you start to see some consequential deviations in chem 202 (like Wuest will have videos, and other types of assignments on top or in lieu of the other assessments- with that said, I still recommend McGill even for 202)",
      "author": "oldeaglenewute2022",
      "created": 1594690950,
      "upvotes": 4,
      "replies": {
        "fy038r0": {
          "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy038r0/",
          "text": "All in-class stuff is standardized and learning assistant material is intended for all sections as well.\n\nAnecdotally, I usually get McGill and Kindt's students in my sections, probably because they have the most students.\n\nEven in 202, the content isn't different, just the assignments. Wuest is really the only odd one out.",
          "author": "phraps",
          "created": 1594697926,
          "upvotes": 2,
          "replies": {
            "fy04ibi": {
              "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy04ibi/",
              "text": "I'm gonna ask this because it may give insight and help people: If you are doing the LA again, do you have any idea/have you heard how the lectures, tests, in class stuff may work this year? Most sections are flipped/hybrid in a normal year, but now they are online.  Will students just get pre-recorded lectures or guidance and be told to work the sheets in their rooms (or wherever- I imagine students could form or be assigned learning teams that could have Zoom sessions to work the in class level problems).  This stuff seems like it causes havoc and almost makes it justifiable to do pure lectures or something.",
              "author": "oldeaglenewute2022",
              "created": 1594698756,
              "upvotes": 1,
              "replies": {
                "fy04rtf": {
                  "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy04rtf/",
                  "text": "The LAs have not been told anything.",
                  "author": "phraps",
                  "created": 1594698932,
                  "upvotes": 2,
                  "replies": {
                    "fy04vpc": {
                      "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy04vpc/",
                      "text": "Damn! Well good luck to all!  You will need it. Though students will need it the most",
                      "author": "oldeaglenewute2022",
                      "created": 1594699005,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "fy07ara": {
                  "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy07ara/",
                  "text": "I emailed Dr. Weinschenk about Chem 203, so that’s the only insight I can give for this semester. One day per week, we have a synchronous Zoom lecture, and then there is additional asynchronous content. This may include videos made by the professors, worksheets, or other videos. Office hours and Learning Assistants would be held over zoom as well. If I were to take a guess, I think they may use the Breakout Rooms fairly extensively during the live zoom lectures to simulate the experience of “working with your table” but that’s just speculation. Again, Chem 150 may have a totally different plan but imo it seems likely 150 and 203 will use similar plans for instruction",
                  "author": "j11234567890",
                  "created": 1594700659,
                  "upvotes": 2,
                  "replies": {
                    "fy07hn0": {
                      "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy07hn0/",
                      "text": "I hope they do takehome tests (I wonder if that is what Soria plans to do): 1) They can have more fun questions and 2) Takes pressure off, and 3)Y'all don't need to kill off the legends lol",
                      "author": "oldeaglenewute2022",
                      "created": 1594700796,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fxzsffe": {
      "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fxzsffe/",
      "text": "Like the above comment says, Chem 150 is pretty standardized. Content emphasized in class, as well as exam structure will be fairly similar throughout all the sections. I took Dr. McGill for 150 and 202 last year and she was fantastic. She’s very experienced with the curriculum, and does a great job with the class. Elaine Liu was our graduate TA. She is a very nice person and is knowledgeable about the subject, but her explanations can be lacking at times due to lack of experience. Brathwaite and Kindt are both good options too, but they just don’t have the extensive familiarity with the curriculum that McGill does (but they are both excellent instructors). \n\nNo matter who you end up with, go to office hours and learning assistants regularly. Chem 150 is a very different type of course from what you’re probably familiar with, in that it is very concept based and you’re expected to synthesize a lot of topics to make some pretty sophisticated arguments and justifications. LAs and Office Hours are very helpful. For the exams, don’t expect to just regurgitate word-for-word what you’ve memorized, you’re going to have to apply and connect what you’ve learned. It can be hard at first, but it honestly gives a very comprehensive and rigorous chemistry education. Good grades are definitely possible with some diligent work",
      "author": "j11234567890",
      "created": 1594691332,
      "upvotes": 2,
      "replies": {
        "fy0cgtl": {
          "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy0cgtl/",
          "text": "Liu is the only professor offering an in-person class so I was planning on taking her CHEM 150 class. What are your thoughts? Do you think I would succeed in her class even though she is not as experienced?",
          "author": "brazilianatemory2024",
          "created": 1594704621,
          "upvotes": 1,
          "replies": {
            "fy216ma": {
              "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy216ma/",
              "text": "Define succeed.   This first 4-5 classes of the chemistry curriculum at Emory are designed so that content and concepts covered in the courses really blend into and build upon one another.  It isn't like gen. chem elsewhere where you can just improve mathematical problem solving between the two semesters without really getting concepts and be good.  And then 203 even with an 'easier' instructor like Heemstra isn't designed purely around just knowing and memorizing reactions so much as explaining various aspects of them which is hard to do if you have a shakey 150 and 202 organic foundation to build upon, or aren't used to being successful in or even asked to explain somewhat complex things in drawings and whatnot. Some 150/202 instructors (no matter the format) are just better at helping you be able to do that because they explain concepts very well and can confidently hold students accountable for that level of thinking knowing many/most will succeed on those problems.\n\nAlso, I think that the graduate teaching fellows do not return for 202, so even if you \"succeed\" in terms of a grade (like maybe she makes her midterm FRQs easier than other sections to cover up struggles in conveying the harder material, and then you kind of scrape by just enough on the common final to come out okay) without having really learned those concepts that well, you then will have to go on to new (with all of them being the more experienced folks) 202 instructors with a weaker foundation (and an inflated grade likely to be lower in 202 no matter who you choose).  I agree with the other poster who basically said that that unless you cannot deal with online versions, you are  probably better off with top tier/experienced instructors who have taught the course multiple times even if online.\n\nThe topics that most students find hardest I imagine are in the later 150 modules with the spatial reasoning, structural reasoning, stereochemistry, and organic chemistry content and you REALLY need that for 202.  You will be held accountable in fairly challenging contexts (you'll be doing reactions on organic molecules as a standard freshman who I am guessing doesn't have AP/IB credit in chem. This is stuff most sophomores and upperclassmen have trouble with in standard ochem classes elsewhere largely because their gen. chem backgrounds didn't give them much to work with. A shakey chem 150 foundation is equivalent to that means you may have well taken a regular gchem course elsewhere that was never designed to prep students to tackle organic chemistry) for it all throughout so take teaching quality and experience over format in this case.  You could worry less about these types of considerations in things like biology where many classes don't really build on each other (or even gen. bio for that matter)",
              "author": "oldeaglenewute2022",
              "created": 1594747830,
              "upvotes": 2,
              "replies": {}
            },
            "fy1p23v": {
              "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy1p23v/",
              "text": "Honestly, unless you are the type of person who simply CANNOT learn online, I would recommend McGill/Kindt/Brathwaite online over Liu’s in-person. When the topics get tougher, her explanations can really falter (she taught 3 of our lectures in 150 and we all left feeling ridiculously confused and McGill had to go back and re-teach them).",
              "author": "j11234567890",
              "created": 1594741990,
              "upvotes": 1,
              "replies": {
                "fyg10sp": {
                  "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fyg10sp/",
                  "text": "Thank you guys for the input!",
                  "author": "brazilianatemory2024",
                  "created": 1595059212,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fy0js4b": {
      "link": "/r/Emory/comments/hqs26q/chem_150_professors_who_do_yall_recommend/fy0js4b/",
      "text": "I had Liu for 202L last semester and I really liked her in person!! She’s very helpful and I felt super comfortable asking her questions def take her :-)",
      "author": "sjwandpremed",
      "created": 1594711117,
      "upvotes": 2,
      "replies": {}
    }
  }
}