{
  "sid": "qalb2v",
  "link": "/r/Emory/comments/qalb2v/the_dl_on_candles/",
  "title:": "the DL on candles",
  "text": "hi all - has anyone burned a candle in their room and not gotten caught? I love candles and they're so cute for fall but i don't want to actually trigger the smoke alarm. How sensitive are the smoke alarms in the newer freshman dorms (raoul/eagle?)",
  "author": "decafoatmilklatte",
  "created": 1634558610,
  "updated": 1634655328,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hh51h5u": {
      "link": "/r/Emory/comments/qalb2v/the_dl_on_candles/hh51h5u/",
      "text": "my freshman year candles didn’t really cause any problems when people used them. just don’t leave them lit when u leave your room obvi",
      "author": "EveningExit",
      "created": 1634582413,
      "upvotes": 3,
      "replies": {}
    },
    "hh6vo2g": {
      "link": "/r/Emory/comments/qalb2v/the_dl_on_candles/hh6vo2g/",
      "text": "Yeah you should be fine. I was in Turman my freshman year and didn’t have any problems. It’s only large things that trigger it— I had a friend who accidentally burned a piece of toast in a microwave oven and his dorm smoke alarm didn’t go off (he did open the window relatively quickly but still they aren’t super sensitive)",
      "author": "The_Turing_Machine",
      "created": 1634613231,
      "upvotes": 2,
      "replies": {}
    },
    "hh7324r": {
      "link": "/r/Emory/comments/qalb2v/the_dl_on_candles/hh7324r/",
      "text": "Get a wax melter. Safer, cheaper in the long run, can have nice designs and aesthetics, just as effective at making a room smell nice, no soot, no throwing out glass cups every time you’re done.",
      "author": "savthrowaway123",
      "created": 1634617439,
      "upvotes": 2,
      "replies": {
        "hh77khe": {
          "link": "/r/Emory/comments/qalb2v/the_dl_on_candles/hh77khe/",
          "text": "I actually have one at home, I’ll ask my parents to bring it for parents weekend! Thx for the suggestion I forgot about those",
          "author": "decafoatmilklatte",
          "created": 1634620512,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}