{
  "sid": "nos1ri",
  "link": "/r/Emory/comments/nos1ri/book_about_atlanta/",
  "title:": "Book about Atlanta?",
  "text": "Hi, I know little about Atlanta (and GA) and it’s important for me to learn the history and culture of a place before I go and especially before I move there! Does anyone have recommendations for books about Atl history? I’d prefer comprehensive nonfiction but anything (even TV/movies) that helps me get to know the city is good. Thx",
  "author": "helmet_crab",
  "created": 1622431633,
  "updated": 1634098035,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "h01qkvq": {
      "link": "/r/Emory/comments/nos1ri/book_about_atlanta/h01qkvq/",
      "text": "This certainly isn't all \"happy history\" but I enjoy learning from the little they've built on this site over the past couple of years or so. Do understand that a lot of Atlanta history is black history(and culture generally) and race relations:https://www.atlantastudies.org/\n\nIt's in a great position for a southern metro/city, but it is still the south and all of its past has influenced what we see in the best and worst of contemporary Atlanta I'd say.",
      "author": "oldeaglenewute2022",
      "created": 1622434031,
      "upvotes": 7,
      "replies": {}
    },
    "h05g0nj": {
      "link": "/r/Emory/comments/nos1ri/book_about_atlanta/h05g0nj/",
      "text": "The quintessential novel about Atlanta culture is A Man in Full by Tom Wolfe. It is written in his \"New Journalism\" style, which combines fiction with non-fictional bits gleaned from personal research. It was pretty controversial when it was released but is helpful in understanding the relationship between Black Atlanta and the old boy Buckhead network, which is the basic coalition that governs the city to this day.",
      "author": "Few-Character-2753",
      "created": 1622515310,
      "upvotes": 2,
      "replies": {
        "h05ghyr": {
          "link": "/r/Emory/comments/nos1ri/book_about_atlanta/h05ghyr/",
          "text": "Also, with respect to non-fiction, Franklin Garrett, who was the city's preeminent and official historian (and was strongly involved with the Atlanta History Center), published Atlanta and its Environs. I have never read it so cannot recommend it from personal experience but I know from my experience with the AHC that it is considered a definitive source of the city's 20th century history",
          "author": "Few-Character-2753",
          "created": 1622515590,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h03jvan": {
      "link": "/r/Emory/comments/nos1ri/book_about_atlanta/h03jvan/",
      "text": "I like the report on the Olympics, but it's a little off-topic",
      "author": "iapetus3141",
      "created": 1622479914,
      "upvotes": 1,
      "replies": {
        "h042ybf": {
          "link": "/r/Emory/comments/nos1ri/book_about_atlanta/h042ybf/",
          "text": "I don't think it would be off topic. That is a big controversial event that is known to have effects on cities. I haven't read it but I imagine it does a good job framing the context in which the Olympics was taking place. Had a profound positive effect for \"some\" and negative for \"others\".  And the implementation of the infrastructure needed to support it was well..not good almost like everywhere else.",
          "author": "oldeaglenewute2022",
          "created": 1622489303,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h056izj": {
      "link": "/r/Emory/comments/nos1ri/book_about_atlanta/h056izj/",
      "text": "The Archive Atlanta podcast is fabulous. Each episode is a 10-20 minute lesson about a historic building or place in Atlanta.  Really enjoyable.",
      "author": "AWC-OG",
      "created": 1622510243,
      "upvotes": 1,
      "replies": {}
    }
  }
}