{
  "sid": "nqy2gr",
  "link": "/r/Emory/comments/nqy2gr/foreign_language/",
  "title:": "foreign language",
  "text": "for those of u that are native/fluent/near-fluent in a language offered at emory, did you guys take the higher level classes in that language or just a new language overall? i'm conflicted since i hear that introductory language classes are time-consuming (naturally) but again i don't know just how rigorous higher level classes will be. for ex i'm practically a native korean speaker but it's definitely not perfect (i grew up here) - i took the placement test fall sem, they placed me in 401? so i was like o_o and decided i might take the 40x class later in sophmore or junior year.... but i'm not sure. there's also the element of like learning a new! language vs taking the easier route i guess... thoughts? also open to language suggestions i guess haha",
  "author": "y9d8tsdt",
  "created": 1622672540,
  "updated": 1634098019,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.81,
  "comments": {
    "h0epyws": {
      "link": "/r/Emory/comments/nqy2gr/foreign_language/h0epyws/",
      "text": "I mean, I took Italian at the 300 level in the fall. It wasn’t difficult at all. Not sure if it’s different for other languages though.",
      "author": "LostWindSpirit",
      "created": 1622699919,
      "upvotes": 2,
      "replies": {}
    },
    "h0dc7za": {
      "link": "/r/Emory/comments/nqy2gr/foreign_language/h0dc7za/",
      "text": "How competitive are seats for the different levels? Maybe you can start at the 4(go to it, get the syllabus, try to guage expectations vs. Your standing) the best you can within that period and then drop down if you need to. Are seats per level so competitive such that you have to get it right the first time or you're stuck?",
      "author": "oldeaglenewute2022",
      "created": 1622673159,
      "upvotes": 1,
      "replies": {
        "h0dctdk": {
          "link": "/r/Emory/comments/nqy2gr/foreign_language/h0dctdk/",
          "text": "that i'm not tooo sure about but it's not a big deal if there aren't seats available this sem, i'm thinking about doing this starting next spring or even next fall. course atlas says there's 16 seats for 401 though? im not sure if thats supposed to be competitive or not",
          "author": "y9d8tsdt",
          "created": 1622673439,
          "upvotes": 1,
          "replies": {
            "h0drgy3": {
              "link": "/r/Emory/comments/nqy2gr/foreign_language/h0drgy3/",
              "text": "Higher level language classes aren’t that competitive tbh; not a lot of people take that high that aren’t native. Also, the higher level ones tend to rely heavily on essay based assignments.",
              "author": "Worldlover67",
              "created": 1622680661,
              "upvotes": 6,
              "replies": {
                "h0dxi3k": {
                  "link": "/r/Emory/comments/nqy2gr/foreign_language/h0dxi3k/",
                  "text": "ah icic tysm!",
                  "author": "y9d8tsdt",
                  "created": 1622683678,
                  "upvotes": 1,
                  "replies": {
                    "h0dxov1": {
                      "link": "/r/Emory/comments/nqy2gr/foreign_language/h0dxov1/",
                      "text": "Oh also just notcied you mentioned taking it in the spring; it probably will not be offered in the spring. Only really popular languages like spanish have the x01 classes offered in fall and spring. There will probably only be 402",
                      "author": "Worldlover67",
                      "created": 1622683774,
                      "upvotes": 2,
                      "replies": {
                        "h0dz0c2": {
                          "link": "/r/Emory/comments/nqy2gr/foreign_language/h0dz0c2/",
                          "text": "ah yeah i am aware of that! tho i'm not entirely sure if it matters which 40x class i take if i do end up taking it as when i took the placement test last sem they placed me in 403 (i went back and looked it up lol), it seems the krn 400 courses are from 401-404 over the course of two years instead of fall 401-spring 402 aNyways my point is, i reckon maaybe i'll be able to take 402 in the spring and 403 next fall w prof permission? or if it doesn't work out just junior year altogether, idrk at this point lol i dont have space this fall tho :(",
                          "author": "y9d8tsdt",
                          "created": 1622684442,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "h0dnwhz": {
              "link": "/r/Emory/comments/nqy2gr/foreign_language/h0dnwhz/",
              "text": "You need to see how many seats are open the day after tomorrow",
              "author": "iapetus3141",
              "created": 1622678900,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}