{
  "sid": "ntrrvu",
  "link": "/r/Emory/comments/ntrrvu/nbb_major_help/",
  "title:": "NBB major help",
  "text": "Hey! I'm a rising sophomore on the premed track and I'm second-guessing myself on whether I want to pursue a NBB major, had a few questions if anyone willing to help.\n\nHow hard/work intensive are NBB classes? Have heard not so good things about the difficulty of classes like NBB 201 and even professors in the department. I know the track may be good to develop good skills for the MCAT, but would it be worth it at the cost of a lower GPA and less time for extracurriculars? \n\nNBB definitely seems the most interesting to me, but also think I'd enjoy a major in something like bio, human health, or psych, and it'd be a plus if these majors are easier GPA/timewise, and more applicable if med school doesn't work out.\n\nThanks!",
  "author": "jdawg1440",
  "created": 1623003088,
  "updated": 1634097992,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "h0tur9q": {
      "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0tur9q/",
      "text": "None of those majors are \"applicable\" UNLESS you do research or experiential oppurtunities. Instead of trying to preliminarily protect your GPA, choose what you are most interested in and try the damned best you can.  If you do that and try to get disciplinary experiential learning opps in the area, you'll be fine whether med. school works out or not.\n\nAlso, as always, this will get me down-voted because no one wants to hear: \"You should value being challenged in meaningful ways every now and then as an undergraduate even if it seems risky\", but you SHOULD especially if you are considering something like freaking medicine which can be very intensive in terms of raw hours AND even critical thinking depending on what specialty you go into.  Also, if you want to get into medical school, you want to take courses that are good for your MCAT prep and hint: Those tend to be those that are more challenging in useful(not just memorization and low level understanding and problem solving) ways and are NOT always the easiest to get the highest grade in.  You will have to fight for your grades sometimes if you are learning at the appropriate level(as in at a level much higher than places much cheaper than Emory in terms of sticker price) to be helpful for that test or your future as a doctor or whatever.\n\nIn addition, NBB seems to be feeding an awful lot of people to very good MD and MDPhD and PhD programs which suggests plenty of people are doing well.  If you truly do like the material, you WILL do well enough (like a couple of B grades in say...NBB cores, shouldn't kill your STEM GPA considering that a significant amount of bio and NBB requirements are also standard pre-med core courses and you should be doing fine in those if you are to be a competitive applicant.  And then you have to 7 electives and can just choose the ones you are interested in).\n\nMy problem with this whole concept of \"Will NBB lower my GPA?\" is that it is already like admitting you will be defeated if challenged and that it is out of your control/you have no agency to do well as if you can't handle \"working\" hard (note that many of the harder classes are not about a lot of \"work\" perse where lots of stuff is graded more so than it is about thinking harder than normal and practicing and studying in ways that allow you to handle problems that are serious about you applying concepts to solve newer situations, design experiments, interpret data from research, etc. Basically things beyond definitions, pathways, and details in the form of a short answer or MCQ. So you have to learn to study and learn much more actively than perhaps required in say..general biology 1 and 2. To some, adapting to these types of demands IS a lot of work, but it is worthwhile and you'll get better at it as you go along and studying for MCAT passages will be much easier and plus these skills are important for future doctors, researchers, professionals in many of the disciplines you mentioned).  Why would you do that to yourself?  You need to believe in yourself and that you'll enjoy that area well enough such that you'll do what is needed to perform solidly (not always perfect necessarily.  Most courses in any life science are not designed for most people to make As and A-s) even when challenged.\n\nI mean, what will happen on the MCAT if you are already taking this defeatist approach?  It is VERY challenging and will mirror the skills needed to succeed in courses like NBB 301 (and 302 to some extent and the reading skills you pick up in 401 and many electives). 201 is actually one of the lighter courses that mirrors a memorization based HS course with high content volume so I don't know who told you to worry about that one.\n\nEither way, I doubt things like biology will be any easier or more applicable to you if you are this concerned about NBB which beyond the 4 cores is very flexible.  Believe it or not, the biology cores are actually migrating to pedagogical formats that have the characteristics that most people consider \"harder\" than standard memory based courses so maybe that is not the one.  Psychology is actually NOT that easy either.  They have plenty of professors and courses that throw daggers at people where they don't expect it.  Maybe only human health or anthropology is your safe haven, but if you do that, you probably need to be taking more challenging professors for your pre-med core courses to ensure you get the added value (I don't see why come to Emory if you don't want the \"bump\" that more challenging course work is supposed to give you.  Prestige doesn't go that far for pre-med and is even somewhat limited and easy to circumvent for grad. school considerations) that helps you on the MCAT because that major is not designed to do that. (and psyche is to a limited extent).  Either you have to believe in yourself like I and Emory believed in you or maybe reconsider something like pre-med.  You can't say: \"I'm really interested in this but I'm scared because IT will damage my GPA\".  That's not how this works.  You'll probably be challenged at times like everyone else, but I suspect you can rise to the challenge and get a lot out of that major like....most of the people who do it (and it may be like the 2nd most well subscribed to STEM major after biology and NBB students seem more successful perhaps BECAUSE the major has a set of core courses and learning goals that everyone must get whereas biology kind of does allow students to dodge the courses best for their development and career goals).\n\nI would put this worry behind you and just take up to NBB 301 and do the best you damned can in both.  If you don't like either (because the two are very different. 201 is anthro based and mostly MCQ tests that are sort of recall based and NBB 301 is the actual physics behind neurophysiology and neuronal signaling's influence on behavior and optics so is very problem solving oriented much like physics 141/142 and chem 150/202. 301 is actually a great interdisciplinary biology course that emphasizes concepts and problems that mirror the interdisciplinary style of bio focused MCAT passages), maybe from there you can decide to pivot to a biology major and find other good classes in biology or take neuroscience focused courses in the biology major without having to take NBB 302 and 401.\n\n\\*I would only have reservations with you pursuing NBB if you really struggled in chem (like if you got below B/B+ in all of them), physics, and biology intro. courses mainly because of the demands of 301 and 401 to some extent really call on foundations from them.",
      "author": "oldeaglenewute2022",
      "created": 1623009091,
      "upvotes": 13,
      "replies": {}
    },
    "h0tosrf": {
      "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0tosrf/",
      "text": "It's Neuroscience, ...did you expect it to be easy? I would say Antho/human bio is the more popular premed major and it's much easier. Also you don't have to major In a science at all if you don't want to. I have friends that took a year to study  for the MCAT, that also an option instead of taking the hardest classes.",
      "author": "91210toATL",
      "created": 1623006334,
      "upvotes": 3,
      "replies": {
        "h0ttrl4": {
          "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0ttrl4/",
          "text": "Really? Almost every freshman I’ve met this year has said they’re majoring in NBB. I’d say about 85-90%. The rest have either been Bio or Chem. Introductions in classes were almost always funny because more than half the people would say they’re majoring in NBB and are premed.",
          "author": "LostWindSpirit",
          "created": 1623008631,
          "upvotes": 5,
          "replies": {
            "h0twlaz": {
              "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0twlaz/",
              "text": "NBB 301 is the \"weedout\" because it is like a bio, physics, and chem class mashed together to model neurophysiology,  and many aren't used to that style of learning in biology especially after taking biol 14x at ECAS and NBB 201. It can be quite the adjustment.  Many also find NBB 401 somewhat challenging because most people aren't used to writing in science.  But the electives are so flexible that I think people \"damaged\" from any of the 4 core courses end up using the more lenient grading electives (and even those that are less \"fluffy\" are more lenient grading for the most part) to help their GPA. NBB is actually not that bad and I'd say the overwhelming majority succeed in pursuing whatever their career goal is because the advising and resources are very supportive and because the courses straight up train well for both grad. school and stuff like the MCAT.",
              "author": "oldeaglenewute2022",
              "created": 1623009953,
              "upvotes": 3,
              "replies": {}
            },
            "h0ulmyq": {
              "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0ulmyq/",
              "text": "Intro classes this year have been ridiculously easy compared to in-person (or at least I’ve heard). Plus, rampant cheating. I think next year will be really interesting to see if the dynamics change— I suspect a number of students will change from premed/ change their major. I do wonder if average scores will go up or down given the format and quality of instruction this year.",
              "author": "The_Turing_Machine",
              "created": 1623022007,
              "upvotes": 2,
              "replies": {
                "h0uos1k": {
                  "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0uos1k/",
                  "text": "I mean, yeah, its definitely going to go down. The average grade in chem 150 was a B+/A- and the average gpa in the fall semester was 3.73. I don’t think that’s going to be the same. Kind of interested too.",
                  "author": "LostWindSpirit",
                  "created": 1623023649,
                  "upvotes": 1,
                  "replies": {
                    "h0up17h": {
                      "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0up17h/",
                      "text": "Oh god it’s usually a B-. Yep, some students are going to have a rude awakening. Wonder how they are going to deal with TAs...",
                      "author": "The_Turing_Machine",
                      "created": 1623023786,
                      "upvotes": 3,
                      "replies": {
                        "h0uqujl": {
                          "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0uqujl/",
                          "text": "Imagine bio, both semesters..",
                          "author": "oldeaglenewute2022",
                          "created": 1623024769,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "h0uv1zv": {
                          "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0uv1zv/",
                          "text": "Wdym by TAs? Why do people usually have to worry about them? Also do you have any tips on how to handle regular bio/chem from your experience?",
                          "author": "LostWindSpirit",
                          "created": 1623027046,
                          "upvotes": 1,
                          "replies": {
                            "h0v37c6": {
                              "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0v37c6/",
                              "text": "Usually TAs have taken the course the previous year (if I remember correctly— I only had to take up to BIOL 142 and CHEM 202). The in-class format and approach to material is going to be radically different from the online format which is going to pose an interesting challenge for TAs who have only taken the online version. In essence, they are going to be helping to teach a harder class to students while only have taken an easier version that does not line up with how the class was being taught. A sort of blind leading the blind situation, especially regarding the extra study sessions they have to run with the worksheets (forget what those are called) which are honestly vitally important for succeeding in the class. Usually the TAs are stellar and understand the perspective of a student trying to learn (professors “see” chemistry in a way the students are trying to understand but have a hard time understanding how students are getting tripped up, at least in my experience) thus providing a liaison between professor and student. \n\nIn terms of studying tips for intro chem and bio I’ll leave that to my peers in their respective departments— I’m a QSS/NBB major who has veered strongly into the QSS side of things in the last few semesters, but I think the mostly important thing, especially for chemistry, is interacting with the concepts and ideas everyday. A good study group also helps (and ofc going to those worksheet sessions). A good schedule when doubling up also helps a ton — I always recommend doing a tues/ thurs or mon/wed afternoon lab for chem and bio if possible because by 6pm you’re going to be exhausted. Energy management is super important because the amount of work you’ll be putting in is not commensurate with the amount of credits they are giving you. It is definitely doable but you need to be smart about how you use your time and on top of everything. It’s better to be part of a study group that doesn’t meet often but gets stuff done (I always recommend setting an agenda for each session, helps keep everyone on track) than a study group that meets everyday but spends the whole time chatting— but that’s just my opinion.",
                              "author": "The_Turing_Machine",
                              "created": 1623031470,
                              "upvotes": 4,
                              "replies": {
                                "h0v4rn4": {
                                  "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0v4rn4/",
                                  "text": "Oh, we don’t call those people TAs now. They’re referred to as LAs (learning assistants). The TAs nowadays in chem/bio are referred to as the grad students who help with grading exams and hold some office hours. And thanks!",
                                  "author": "LostWindSpirit",
                                  "created": 1623032319,
                                  "upvotes": 1,
                                  "replies": {
                                    "h0v95xs": {
                                      "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0v95xs/",
                                      "text": "All that stuff is a TA network (they can name them whatever but it is a network of TA support).  I can't advise anything for bio other than staying on top of stuff but for Weinschenk, you'll need to become adaptable for the calibre of exams he'll write.  For example, if you did well in gen. Chem by sort of just reading, doing suggested book problems, going to LAs and sort of letting them give you the answers, that will only get you between 60-70 on the exams.  You need to be REALLY active and engaged.  He calls on people in class so try to participate in those class sessions when called on. Pre-study for the class if you can so you can follow along and make guesses. \n\n I agree with the agenda thing for study groups. Find an aggressive study group where you can challenge each other and ask meaningful questions. You don't want a group that stays stuck mostly on easier or mid-level concepts and problems. Like work them before a study group session, discuss approaches and the concepts behind them, and then maybe do this before you officially meet with an LA or TA and certainly before the answer key is released (avoid studying from answer keys at all costs. Gives most lots of false security especially since 1/2 of his exams can be kind of unpredictable and deviate heavily from previous years as I will explain)\n\n Weinschenk will have things called \"lecture notes\" which tend to be lower level problems he posts right after class to sort of reinforce that material and then he has OYOs which are for the LA sessions.  Try to immediately do lecture notes when you have time and do as many OYO level problems (these are mimic a mix of medium and higher level exam problems) as you can. Even if he hasn't explicitly taught a concept or reaction needed to do a problem, do not WAIT. Try to derive it from the foundation you do have and make an educated guess. Upwards to half of his exam is sort of derivative (it's usually derived from like a research article or some biologically oriented reaction you weren't taught) so do that to teach yourself to think on your feet and use the fundamentals to figure scary and complex looking \"new\" stuff out. \n\nThis section works much like his lectures where he sort of walks you through the new reaction by hinting you along (he'll try jogging your memory and connecting it to something you did learn in the prompt) up until a point (the hardest questions in the 2nd half can be sort of edgey and usually try to get you to use the stuff you learned in earlier problems to make a model for something more complex than the original case study the section started with).\n\nAnd when you do OYO level problems and old exams, try to really draw connections between seemingly different problem types. Maybe even make connections between problems in 2 different OYOs (say you have 4 before the first test. Take problems from oyo 2 and 4 and label the key concepts they are meant to highlight and see the overlap'). Don't just get the answer to an individual problem and declare victory.  That'll only benefit you in the first half of the exam and maybe a freebie item in the 2nd half (unlike gchem LA sheets and in class sheets, the problems from the OYO are probably not coming exactly as presented in the OYO on W's exams, and if they do, they'll have low weighting. \n\nSee if you can ask yourself \"what if?\" for different reactions and concepts (Can you possibly draw a mechanism in more than one way? If more than one, why is one pathway more plausible ?).  Just be prepared to push your thinking and problem solving skills and make them more flexible to pull ahead of the average.  It'll require a different study strategy and less black and white way of thinking about organic reactivity.  In 203, you'll really have to flesh out many of the nuances they likely hid from you in chem 202 in favor of having you apply hard fast rules and pattern recognition strategies. It'll be a very rewarding challenge but take a good bit of effort for most to adjust to.",
                                      "author": "oldeaglenewute2022",
                                      "created": 1623034676,
                                      "upvotes": 2,
                                      "replies": {
                                        "h0vi5u4": {
                                          "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0vi5u4/",
                                          "text": "Thanks for the advice! Honestly, sounds pretty fun though. I definitely enjoyed non-mathy difficult chem problems and my favorite were mechanisms. Sounds like a lot of the way you study for orgo too is just by doing practice problems, which is a lot easier for me to do for a long time than watching videos/taking notes. I’ll definitely try to study a lot and put most of my focus on that class.",
                                          "author": "LostWindSpirit",
                                          "created": 1623040006,
                                          "upvotes": 1,
                                          "replies": {
                                            "h0wd1gb": {
                                              "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0wd1gb/",
                                              "text": "5Yeah you'll have to practice but will need to build creativity into the practice vs. just repetition because again, unlike 202, you'll have to derive mechanisms you haven't been taught on the test OR he'll use a mechanism you are familiar with to derive a more advanced concept or application than you were not exposed to in class or in practice.  Definitely focus on the \"why\" and \"would this pathway be dominant if I change this?\" elements versus vs. Just sort of stopping at knowing arrows. \n\nAlso understanding molecular orbitals and orbital overlap and symmetry driving reactions is pretty central to 203. You have to be able to use that to explain nuances of reactions as well so it's just another layer to add on. You are right that it'll be fun though! Most of the more solid students find the journey towards being able to solve or put dents in the more authentic problems he gives worthwhile(because what good student/scholar in development wouldn't want to be able to claim that they can think through the same level of problems actual chemists solved?) and helpful for retaining concepts for a long time after the course. \n\nIf he gave only problems that were in the practice for students to sort of recite on an exam, retention would no doubt be lower. Plus a lot of chem majors would be ill-prepared for the types of questions they'll encounter in research or research oriented upper divisions.",
                                              "author": "oldeaglenewute2022",
                                              "created": 1623066269,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "h0ul66n": {
      "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0ul66n/",
      "text": "I’m gonna be blunt: if you don’t think you can “handle” NBB, why do you think you are qualified to become a doctor? Or for that matter, survive medical school? \n\nThe purpose of going to a place like Emory is to challenge yourself and get access to comprehensive courses and professors that are doing incredible (and difficult) things.",
      "author": "The_Turing_Machine",
      "created": 1623021763,
      "upvotes": 3,
      "replies": {}
    },
    "h0ttm6n": {
      "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0ttm6n/",
      "text": "From my understanding a class like NBB is about as hard as a regular intro stem class. I’m assuming that’s why people recommend taking bio/chem freshman year if you plan on majoring in NBB — it’s much easier to focus on a class like NBB 201 if the only other science class you’re taking is chem 203.\n\nI’m a psychology major and by the end of this summer I’ll have taken 4 psych classes. From my understanding, most of the psych classes that don’t involve neuroscience tend to be relatively stress-free. Classes like psych 110, 215, and any psych class cross-listed with NBB/Bio can be pretty difficult, but the majority seem friendly. Also, a professor mentioned the average gpa of a psych major was 3.6 pre-Covid so take from that what you will.\n\nI’d definitely recommend just doing what seems the most interesting to you and what feels right. A class might be very hard but might be worth it if the material is highly engaging.",
      "author": "LostWindSpirit",
      "created": 1623008564,
      "upvotes": 2,
      "replies": {
        "h0txcn1": {
          "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0txcn1/",
          "text": "What I would say about psych majors is that there may be a bigger blend of them.  As in not as many are pre-med or pre-grad (I think there are even many doubling with a humanities or softer social science) as an NBB so perhaps not as many take gateway and intermediate STEM courses that tended to grade harshly before Covid.  So you have a mix of people that just simply have easier schedules and then others who may be pre-med (because pre-grad in things like psych don't seem as common now-a-days) and thus pressure themselves to perform well.  Also, sometimes I don't trust professors when they throw out average GPAs.  Like Wuest over in chem one time did this admitted student event where he claimed that the average chemistry major had a 3.8 which is TOTALLY false.  He had a few abberations in his lab that he likely used to guage it or he flat out lied to squash concerns about pre-meds doing it (and regardless of the relatively harsh grading there, pre-meds still flock there.  Hey, if you like it you like it and will find a way to perform as well as you need to in most cases).  Like, I suspect that even political science is below 3.6",
          "author": "oldeaglenewute2022",
          "created": 1623010301,
          "upvotes": 2,
          "replies": {
            "h0u3sr0": {
              "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0u3sr0/",
              "text": "Yeah, I’ve definitely heard there’s all kinds of people majoring in psych. People majoring in it can want to go into med school, grad school, law school, or even do business. That’s also a reason why I like it tbh — I get to meet all these kinds of diverse people at Emory. It’s kind of boring hanging out with similar groups of people all the time.\n\nAlso, don’t know who’s downvoting you btw. It isn’t me.",
              "author": "LostWindSpirit",
              "created": 1623013308,
              "upvotes": 3,
              "replies": {
                "h0u40m8": {
                  "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0u40m8/",
                  "text": "Haters mean you're winning! Lol. Got downvoted for saying 211 is not a QSS requirement lol",
                  "author": "oldeaglenewute2022",
                  "created": 1623013410,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h0u5br3": {
      "link": "/r/Emory/comments/ntrrvu/nbb_major_help/h0u5br3/",
      "text": "Hey! So I am a rising fourth-year who is majoring in NBB on the premed track. I can definitely understand your concerns regarding classes, professors, advising, etc. I would be happy to discuss my experiences with you if that would be helpful. Feel free to PM me!",
      "author": "Vengeful_Armadillo",
      "created": 1623014045,
      "upvotes": 2,
      "replies": {}
    }
  }
}