{
  "sid": "dvzh1l",
  "link": "/r/Emory/comments/dvzh1l/sterk_resigns/",
  "title:": "Sterk resigns",
  "text": "Anyone have any information about why she quit, other than what was stated in the public announcement?",
  "author": "crusheratl",
  "created": 1573683757,
  "updated": 1634099253,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "f7fp6x6": {
      "link": "/r/Emory/comments/dvzh1l/sterk_resigns/f7fp6x6/",
      "text": "No clue, she seems to have done relatively well.  Maybe that just isn't the leadership role she wanted to continue (she wanted to teach and do research).  If it was something weird, I have doubts she'd bother staying on as teaching faculty.  Also do remember that she was provost prior to assuming the presidency.  She's done a lot (and much of it in both roles seemed to be getting Emory on another track post-Wagner).\n\n  A lot of presidents arguably serve way too long anyway (like Wagner).  I suspect that the public facing portion of a capital campaign may be coming up and those usually take a long time and perhaps she didn't want to commit to that phase.  If this is the case, hopefully they hire someone else internally as any external hire would have lots of learning about Emory to do before spearheading something like that.",
      "author": "oldeaglenewute2022",
      "created": 1573684074,
      "upvotes": 12,
      "replies": {
        "f7gdfx4": {
          "link": "/r/Emory/comments/dvzh1l/sterk_resigns/f7gdfx4/",
          "text": "> I suspect that the public facing portion of a capital campaign may be coming up\n\nI hear rumors of an impending Bio Building renovation...",
          "author": "phraps",
          "created": 1573700853,
          "upvotes": 3,
          "replies": {
            "f7gds7x": {
              "link": "/r/Emory/comments/dvzh1l/sterk_resigns/f7gds7x/",
              "text": "I wonder what that would look like.  Hella disruptive.  Chem at least had its own plot of land/littlearea of campus.  Bio is sort of connected to other stuff by a plaza.  Best of luck to future frosh if that is true. And yes that would need lots of money.",
              "author": "oldeaglenewute2022",
              "created": 1573701102,
              "upvotes": 5,
              "replies": {
                "f7gunan": {
                  "link": "/r/Emory/comments/dvzh1l/sterk_resigns/f7gunan/",
                  "text": "The bio building is awful so although I agree it's very disruptive, it's understandable. Maybe they can do internal upgrades and not knock the whole thing down. However I am very surprised by this she is very well liked.",
                  "author": "91210toATL",
                  "created": 1573718471,
                  "upvotes": 2,
                  "replies": {
                    "f7h1oaz": {
                      "link": "/r/Emory/comments/dvzh1l/sterk_resigns/f7h1oaz/",
                      "text": "It isn't awful.  It is pretty standard.  It just isn't new all over like a lot of other Emory buildings.  You have to remember that it is atypical for private schools (or really any) to have buildings that are essentially all \"new\" even when you talk science buildings.  Emory is very unusual (especially among 'elite' privates) in that respect.  230 could afford refurbishing so that it matches the style of pedagogy that more and more professors want to use but things like 308 are more than fine and the classes on the lab floor have no need to be special, but I suppose they could rearrange them too.\n\n\nI actually think it would be more interesting for them to find some space at the core of campus and build a life sciences building targeted to undergraduates (the College) and then maybe turn old dental over to allied health programs. Right now it is kind of shared and the undergraduate courses end up distal to other STEM buildings",
                      "author": "oldeaglenewute2022",
                      "created": 1573729305,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f7guxfk": {
      "link": "/r/Emory/comments/dvzh1l/sterk_resigns/f7guxfk/",
      "text": "I just don't like this,... someone knew at the start of a capital campaign is a bad look. And personally I don't think anyone currently at Emory is qualified for the job.",
      "author": "91210toATL",
      "created": 1573718886,
      "upvotes": 1,
      "replies": {
        "f7h1iix": {
          "link": "/r/Emory/comments/dvzh1l/sterk_resigns/f7h1iix/",
          "text": "This is awfully dramatic and I emphatically disagree (I can think of two current deans that would likely be very qualified).  Plus that is just a proposal of mines. I don't know if it is true.  I may have read in some document that they were in a private phase of a campaign.",
          "author": "oldeaglenewute2022",
          "created": 1573729073,
          "upvotes": 2,
          "replies": {
            "fb9sexp": {
              "link": "/r/Emory/comments/dvzh1l/sterk_resigns/fb9sexp/",
              "text": "yes the public phase is going to be announced after 2020.",
              "author": "writer30033",
              "created": 1576648140,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}