{
  "sid": "hxs0xx",
  "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/",
  "title:": "Communal bathrooms at Emory",
  "text": "I’m an incoming freshman and I have a few questions about communal bathrooms at Emory. I will be living in Hamilton holmes this year. Well first off: How are the communal bathrooms at Emory? (Specifically the ones in Hamilton)\n\n- Are they relatively clean?\n- Should I change in the shower stall or wear a robe to and from my dorm room and change there? What do people usually do? Do people just wrap a towel around and walk to the bathrooms and their dorms?\n- Hamilton has coed floors so has there been any instances where people have tried to invade other people’s privacy?\n- Tips?\n- Do’s and Dont’s?\n\nAlso to anyone who has lived in Hamilton holmes freshman year...How are the dorms? I know it’s a small building compared to others but how is the social environment there? How are the study lounges?\n\nThank you!!",
  "author": "jif3443",
  "created": 1595703259,
  "updated": 1634098800,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "fz87k8u": {
      "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz87k8u/",
      "text": "Lived in Hamilton my freshman year - the rooms were really big and nice compared to some of the other dorms so I felt very, very lucky! The bathrooms were extremely clean and pretty big too. I visited friends in some of the smaller dorms & lived in a smaller dorm in my sophomore year and trust me when I say this, I really cherished my times at Hamilton! \n\nI would just wear a robe/towel to and from my dorm room and then change in my room. Most people did that, it was never weird or awkward. Bringing clothes and changing in the bathroom was a hassle for me and I didn’t want to get them wet/fling them over the curtains. Also, the year I lived in Hamilton, there were no issues with privacy and never heard of any problems. If it’s a coed floor, the boys will have en suite bathrooms in their rooms and only some girls will have to use the communal bathroom so it keeps the bathroom relatively empty most of the time.\n\nFor tips - always wear bath slippers in the bathroom no matter how clean it looks!! It’s just safer and more hygienic. Carry a nice sturdy caddy with all your stuff and hang it in the shower (I didn’t like my stuff touching the floor).",
      "author": "littlen97",
      "created": 1595706842,
      "upvotes": 20,
      "replies": {
        "fz8b9z8": {
          "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz8b9z8/",
          "text": "Would you say most of your info applies to Turman as well? I've heard Hamilton and Turman are said to be similar in a lot of ways.",
          "author": "katsteve",
          "created": 1595708143,
          "upvotes": 3,
          "replies": {
            "fz8bg5d": {
              "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz8bg5d/",
              "text": "Yep, definitely. Turman is definitely bigger so it probably has bathrooms for both sexes on the same floor but they are separated and definitely very big/spacious & clean.",
              "author": "littlen97",
              "created": 1595708235,
              "upvotes": 7,
              "replies": {
                "fz8c7d8": {
                  "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz8c7d8/",
                  "text": "Thank you for taking the time to answer both of us!",
                  "author": "katsteve",
                  "created": 1595708486,
                  "upvotes": 3,
                  "replies": {
                    "fz8ca6c": {
                      "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz8ca6c/",
                      "text": "Of course!! Freshman year is so exciting. Hope you both have a great, great time and make the most of it. I definitely miss it a lot!",
                      "author": "littlen97",
                      "created": 1595708528,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fz89lem": {
          "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz89lem/",
          "text": "Thank you soo much!! Also when you said that guys will have suite bathrooms on floors that are coed do you mean that only girls can use the communal bathrooms or do you mean that the bathroom is not separated by sex and guys can use them as well but usually only the girls will use them??",
          "author": "jif3443",
          "created": 1595707436,
          "upvotes": 2,
          "replies": {
            "fz89xth": {
              "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz89xth/",
              "text": "So in coed floors (atleast in Hamilton), either all the girls have en-suite or the boys do. On a floor where all the boys have en-suite, there will only be a communal bathroom for the girls. \nAll bathrooms are separated by sex and there is also a single stall bathroom on each floor which is unisex and can be used by anybody.",
              "author": "littlen97",
              "created": 1595707623,
              "upvotes": 7,
              "replies": {
                "fz8ynyr": {
                  "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz8ynyr/",
                  "text": "OP: note that the single stall bathroom also includes a bathtub.",
                  "author": "iapetus3141",
                  "created": 1595718732,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fz91alu": {
      "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz91alu/",
      "text": "Didn’t live in Hamilton freshman year, but most people just walked to the bathroom in a towel and their shower shoes (some form of inexpensive rubber flip flops work well). The bathrooms are kept clean, and are single sex (plus one gender-neutral bathroom per floor). Never heard of issues regarding invasion of privacy.",
      "author": "j11234567890",
      "created": 1595720203,
      "upvotes": 7,
      "replies": {}
    },
    "fz894v8": {
      "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz894v8/",
      "text": "I didn't live in Hammy freshman year, but we all definitely just went to and from our rooms in our towels. It's just easier.",
      "author": "MintyLotus",
      "created": 1595707321,
      "upvotes": 6,
      "replies": {}
    },
    "fz8neu4": {
      "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz8neu4/",
      "text": "Use a robe and don't bring your clothes to the shower. You will otherwise get in people's way. A little bucket is fine though I never used one. I had a little plastic container for my soap. I never recall girls roaming around during the morning when showers were going on.",
      "author": "crusheratl",
      "created": 1595712502,
      "upvotes": 2,
      "replies": {}
    },
    "fz9mpnn": {
      "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz9mpnn/",
      "text": "Are there only communal bathrooms in Hamilton ??? I thought dorms had their own bathroom ???",
      "author": "ellenwrites",
      "created": 1595733388,
      "upvotes": 1,
      "replies": {
        "fz9pajk": {
          "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz9pajk/",
          "text": "All freshman dorms have communal bathrooms on each of the floors. If you were assigned a suite style double you will not use the communal bathrooms because you’ll have a bathroom to share with another person (usually four people share —but this year only two).",
          "author": "jif3443",
          "created": 1595735080,
          "upvotes": 2,
          "replies": {
            "fz9qz68": {
              "link": "/r/Emory/comments/hxs0xx/communal_bathrooms_at_emory/fz9qz68/",
              "text": "Oh yes I think I have that YAY 🥰🥰🥰",
              "author": "ellenwrites",
              "created": 1595736248,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}