{
  "sid": "mh5qge",
  "link": "/r/Emory/comments/mh5qge/how_to_connect_with_other_admitted_or_current/",
  "title:": "How to connect with other admitted or current grad students?",
  "text": "I was admitted to a PhD program from the waitlist after my program’s recruitment weekend. I have 2 weeks to decide if I’m accepting but I’d like to talk to other admits and current students beforehand. Are there any Facebook groups or GroupMe/Slack chats? I’m going to be connected with a current student in my program, but I’d like to hear from others because not all of my questions are specific to my degree. Help?",
  "author": "ballin_bach",
  "created": 1617196076,
  "updated": 1634098643,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "gsx5by5": {
      "link": "/r/Emory/comments/mh5qge/how_to_connect_with_other_admitted_or_current/gsx5by5/",
      "text": "Hey, I’m a current PhD student at emory- I’ve found that most of the FB groups tend to be program and cohort specific and I’m not aware of any GroupMe or slack groups (although I don’t use either of those apps lol so they could def exist). You’re welcome to PM me if you have any questions about emory- I’ve been here 4.5 years now so hopefully I can help if you have general questions!",
      "author": "jjdfb",
      "created": 1617202431,
      "upvotes": 1,
      "replies": {}
    },
    "gsxa1bu": {
      "link": "/r/Emory/comments/mh5qge/how_to_connect_with_other_admitted_or_current/gsxa1bu/",
      "text": "I’m a current PhD student. Feel free to PM with any questions!",
      "author": "cardigans_and_code",
      "created": 1617204610,
      "upvotes": 1,
      "replies": {}
    },
    "gsyfrtw": {
      "link": "/r/Emory/comments/mh5qge/how_to_connect_with_other_admitted_or_current/gsyfrtw/",
      "text": "Yo I'm likely to accept for a phd at Emory.  There should be a discord.  Lemme know if y'all want me to make one.",
      "author": "loomdawg",
      "created": 1617223544,
      "upvotes": 1,
      "replies": {}
    }
  }
}