{
  "sid": "faqu48",
  "link": "/r/Emory/comments/faqu48/my_40ers_question_to_you/",
  "title:": "My 4.0ers, question to you",
  "text": "Ight students who have figured out this academics thing. How should I do this? I have absolutely zero idea on how to study/plan/read/write at the college level. Please help a fellow struggling Eagle here. As you can see from my username, I'm motivated-just don't know how to do it!",
  "author": "themostmotivated",
  "created": 1582873412,
  "updated": 1634098718,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 0.9,
  "comments": {
    "fj0bogf": {
      "link": "/r/Emory/comments/faqu48/my_40ers_question_to_you/fj0bogf/",
      "text": "Study: have you tried the 25/5 minute thing? A lot of people swear by it. Study without distractions for 25 and set a timer so you get a 5 minute break. Do this for as long as you can. Also, I’m personally a big fan of printing my notes when I need to study for exams and going back through them really actively, like circling and rewriting concepts and highlighting with a color coding system. \nAlso, find the kind of places you study well. Stacks? Reading room? Barnes & Noble? Don’t be afraid to use the libraries of other schools too. I like Pitts a lot. \n\nPlan: If you’re not busy enough you might be wasting a lot of time. I just think I’m more motivated when I have more on my plate (not a crazy amount, just enough to keep me pretty busy) so I know I really have to use my free time. \n\nRead: Figure out if you actually need to read what’s assigned for a class. If you do, make sure it’s a paper copy. Read with a pencil or a highlighter in your hand. If you don’t need to do the readings or at least not until the exam, don’t waste your time. \n\nWrite: Go to the writing center or ask a friend who’s a good writer to check it over. \n\nYou can do it! You might not end up with a 4.0 because some classes are just going to be outside of your interest and capacity, but you’re motivated\nand that goes a long way (:",
      "author": "gracefulmacaroni",
      "created": 1582895785,
      "upvotes": 14,
      "replies": {}
    },
    "fj0j2ta": {
      "link": "/r/Emory/comments/faqu48/my_40ers_question_to_you/fj0j2ta/",
      "text": "I agree with the general tips above, but I also feel this depends on the major and types of courses and professors you take.  Like if you tend to take professors who mostly rely on exams/assessments that demand content regurgitation and basic understanding (and grasping/deriving some not so high level applications every now and the), then good notes, time management, and spending a little more time is sufficient.  But if you were in courses or with professors that demand more writing, analytical thinking, or higher level (by this I mean, they may typically ask questions or give problems that require extrapolation vs. just the same stuff they assigned as practice) problem solving, then you may want to incorporate different strategies into that study regiment that enhance your chances of improving/doing well.  \n\nIt would help to know what types of classes/professors you want to improve in/have the most trouble with and why you think you struggle, because I am not gonna pretend every course and every section of the same course is created equal (and thus every 4.0/high GPA has the same level of praiseworthiness.  Hell in fact, if I didn't believe in students getting a real education while at an Emory level school, I would flat out just tell you to not only do the basics described by the other poster, but to avoid rigorous instructors that demand much beyond it.  Avoiding rigor or taking courses with more liberal grading is certainly something intentionally or unintentionally employed by many....)  terms of the demands they place on students.  \n\n If the professor is INTENTIONALLY (as in not leaning into this \"I need to design assignments and assessments that always yield an 80+ average to appease and massage the self-esteem of students\" garbage vs. \"I'll demand they employ higher ordered thinking, give as much practice as possible, and then whatever happens happens, and I'll fix it with scaling if averages are lower than what American students are used to\") trying to challenge students, then an A may not be in the cards for most in the course if there isn't an ultra generous scaling of final grades, but you can still earn a strong grade by employing strategies that enhance the higher level cognition.  Note that there are courses in between the two types I describe where a couple of assignments or test items demanding higher ordered thinking suffice to separate A grades from Bs, so most just end up with a B because they haven't figured out how to study for and approach those items.",
      "author": "oldeaglenewute2022",
      "created": 1582901136,
      "upvotes": 3,
      "replies": {}
    },
    "fj1phyh": {
      "link": "/r/Emory/comments/faqu48/my_40ers_question_to_you/fj1phyh/",
      "text": "I used to study alone in high school. It worked then, but by senior year (and APs), it wasn't cutting it.\n\nI study best in groups, by quizzing other people and being quizzed. I like to bounce thoughts off other people. I believe that you should know the material well enough that you can explain it to someone else.\n\nMy point is that maybe your optimal study method is radically different than what you've been doing. It might be a fundamentally different study system. So be creative and try radically different things. I'm a proponent for group study, but I recognize it doesn't work for everyone. You'll have to hunt around until you identify what works for you.",
      "author": "phraps",
      "created": 1582924942,
      "upvotes": 2,
      "replies": {
        "fj2fiv6": {
          "link": "/r/Emory/comments/faqu48/my_40ers_question_to_you/fj2fiv6/",
          "text": "bingo! And honestly if you take a lot of solid classes (or professors) the strategy you described is highly encouraged because those classes are more about ideas or models to explain stuff.  What better way than to try explaining it to or debating others? It definitely enhances what you can actually do with the foundational knowledge you remember.  And who knows? Maybe you have a teacher who may ask you to say, provide two explanations for an observation, and then eventually explain why one is correct based on some data or evidence they provided. \n\nOr they may even get you to provide an argument for what ultimately proves to be a result that ended up not being true.  You could pull from some of the conversations you had where you or someone else was legitimately challenged on a point.  Again this study strategy stuff is nuanced, but I encourage folks to try what you said if they are in courses more about core concepts, models, ideas, or experimentation.  You have to find ways to test what all you can do with all the things you memorized or re-read beyond just recite it back verbatim.",
          "author": "oldeaglenewute2022",
          "created": 1582942364,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fj0wjuw": {
      "link": "/r/Emory/comments/faqu48/my_40ers_question_to_you/fj0wjuw/",
      "text": "/u/orangelm",
      "author": "boat-",
      "created": 1582908921,
      "upvotes": 1,
      "replies": {}
    }
  }
}