{
  "sid": "pz07fg",
  "link": "/r/Emory/comments/pz07fg/how_to_prepare_for_investment_club_interviews/",
  "title:": "How to prepare for investment club interviews ??",
  "text": "As a freshman who just began learning basic stock valuation during this summer, (and my major is not finance or economics). What do I need to prepare for this type of interview? Do I need to know the ratios (P/E etc)? How about stock pitch, which is something that I have never done before?? I appreciate any suggestions!!!",
  "author": "Jillian_Yanmo",
  "created": 1633061259,
  "updated": 1634096851,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hexzdz8": {
      "link": "/r/Emory/comments/pz07fg/how_to_prepare_for_investment_club_interviews/hexzdz8/",
      "text": "Yeah, I'd try to learn the most basic indicators (P/E, P/S, EPS, EV, Market Cap, EBITDA) and why they're useful. Have 1 stock to talk about. Doesn't need to be a big \"pitch\", just a stock you like and why.\n\nEx: I like Mexican Walmart (WALMEX.MX ticker) because Mexico is a growing nation with favorable demographics. Also worsening US/China relations will result in a large increase of economic activity in Mexico and as a result Mexican people will have more disposable income to spend at Walmart.\n\nEdit: Also have an article from marketwatch or WSJ to talk about",
      "author": "poopielicker",
      "created": 1633066276,
      "upvotes": 6,
      "replies": {
        "hez6bww": {
          "link": "/r/Emory/comments/pz07fg/how_to_prepare_for_investment_club_interviews/hez6bww/",
          "text": "OMG thank you so much!! Are you a business major?? I do not want to stress out during the interview for sure LOL.",
          "author": "Jillian_Yanmo",
          "created": 1633097307,
          "upvotes": 1,
          "replies": {
            "hezmaph": {
              "link": "/r/Emory/comments/pz07fg/how_to_prepare_for_investment_club_interviews/hezmaph/",
              "text": "Yeah I am. Don't worry too much about the interview, people just want to see that you share their passion for investing.",
              "author": "poopielicker",
              "created": 1633104306,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}