{
  "sid": "hz4s8f",
  "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/",
  "title:": "Few Random Questions From An Upcomming Freshman",
  "text": "Kinda random questions\n\n\\- I took a gap year and submitted my AP scores last year, but I am looking at the transfer credit report, and it is blank. I should probably resend, but I'm curious what happened to my scores, lol. Did they just not bother keeping them and throwing them away?\n\n\\- What exactly do you do in Emory College Seminar (FSEM)? I'm guessing you learn about campus culture, history, and opportunities, but I'm curious what the actual workload/tests are like, and why a class like this exists (for fun?). \n\nAlso, What do you do in the interdisciplinary studies seminar (FSEM)? The other seminar courses seem pretty straightforward by their name, but these two not so much. Maybe an explanation on what the work is like/what you learn? \n\n&#x200B;\n\nThank you so much for your time and your help. <3",
  "author": "dkknight137",
  "created": 1595897440,
  "updated": 1634099162,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.92,
  "comments": {
    "fzgvcou": {
      "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fzgvcou/",
      "text": "Hi! Rising junior here. Not really sure what happened to your AP scores but I would recommend reaching out to the Office of Undergraduate Education (OUE) as they’re pretty good (in my experience) with this kinda stuff! \n\nAbout freshman seminars, they’re all really different. Mine was on the history of doctors and was a full history course with papers and discussions. Others had bio or a research based seminar and was more focused on science education or something along those lines. I think that nearly all seminars will consist of a small (<18) number of students and therefore more discussion based. For me, the seminar was my longest class time-wise as we met for two and a half hours once a week. The workload depends on the professors, so you’ll see a lot of people drop their seminar and try to get into an easier one during add/drop/swap week. Most likely you’ll have a couple things to read a week as well as another small assignment and maybe you’ll also be expected to work on your essay that’s due in a while. Not too much but def more than your regular high school class. Again, it really depends on the professor. \n\nThe seminar exists as a way to ensure that all students take a writing/ discussion based course pretty early into your college career. Ideally it might help you choose an area of study that might interest you or help you along the path you’ve already chosen. One piece of advice I’ve heard is to choose a seminar in a field that’s out of your comfort zone just so you can experience other fields/ areas of study. \n\nAs they’re all so different, the interdisciplinary one is hard to describe without having taken it. I haven’t so please take that into account. Most likely, the class will consist again of reading and discussions, but it might be more focused on how the principles and authors relate to different areas of study and how that lets us understand more about the world around you. Very much a liberal studies focus (but there can still me some STEM stuff). \n\nHope this helps!",
      "author": "mosinghal",
      "created": 1595900007,
      "upvotes": 8,
      "replies": {
        "fzh6iq9": {
          "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fzh6iq9/",
          "text": "Wow! Thank you so much for your detailed description!! That actually helped me better understand what seminars are, but I worded my question poorly oops. What I was trying to ask was a particular seminar course literally called Emory College Seminar (ECS 190). That's why I was asking what's in that class. Nonetheless, that actually makes me even more excited for seminars haha. Thank you once again for your super thorough response!",
          "author": "dkknight137",
          "created": 1595906625,
          "upvotes": 3,
          "replies": {
            "fzhelzx": {
              "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fzhelzx/",
              "text": "I looked into that and it appears to be sort of an irrelevant stand-in.  They did have one with Allison Burdett listed(Business law professor) so it makes me speculate that the ECS designated seminar may be specifically for GBS scholars and they wanted to separate its listing from other seminars, but I can't say for sure. Just choose any other department hosted 190.\n\nAlso, at some points, they apparently use that slot for the ORDER seminar (which I took eons ago. It was great thought it had a workload at times) :[http://order.emory.edu/index.html](http://order.emory.edu/index.html)\n\nAnd ORDER is now mostly hosted by the IDS program.",
              "author": "oldeaglenewute2022",
              "created": 1595912061,
              "upvotes": 3,
              "replies": {}
            },
            "fzhc9p1": {
              "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fzhc9p1/",
              "text": "Hahahahaha no worries. Glad I was able to help. I’ve never heard of that specific seminar before and the fact that it’s listed as being taught by a business law professor makes me think that it’s just a placeholder class for later depending on how many students want to do seminars first semester compared to second semester. Honestly no clue though",
              "author": "mosinghal",
              "created": 1595910401,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "fzh2e7p": {
      "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fzh2e7p/",
      "text": "About your AP scores, reach out to them about this. I’m not sure who it is, but there is a contact specifically for AP Exam related questions.\n\nFSEM is actually a content-driven class about various subjects, not about Emory at all! (The Emory-centric course is PACE). Topics vary greatly, and the professors for these classes are experts in the given topic and it’s usually their specific research area. So you’ll actually get to see some pretty cutting edge stuff in the FSEM from your prof and their colleagues. It’s a way to allow students to study something way outside their comfort zone without detracting from their other studies (I’m a bio major and took an FSEM about Children’s Literature in the Jewish Studies department). The workload is usually pretty light in these FSEM classes, with a heavy emphasis in your grade on participation as they are seminar-style.",
      "author": "j11234567890",
      "created": 1595904091,
      "upvotes": 7,
      "replies": {
        "fznkwla": {
          "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fznkwla/",
          "text": "I emailed the office of undergraduate admissions, and they still had my ap scores! They just didn't transfer it to my opus, which they will do. Thanks for the help!",
          "author": "dkknight137",
          "created": 1596052833,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fzhxtlb": {
      "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fzhxtlb/",
      "text": "Hey, I would recommend reaching out to Admissions about your AP scores.\n\nAlthough I can't speak about ECS 190 or IDS 190, FSEMs are generally super interesting and fun. I would recommend that you take an FSEM which is not related to your major. Although most are \"easy\", there are some which have a high workload.",
      "author": "iapetus3141",
      "created": 1595929985,
      "upvotes": 1,
      "replies": {}
    },
    "fzjlhdq": {
      "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fzjlhdq/",
      "text": "Freshman seminars are basically normal classes that are meant to be niche but not super difficult. I've never heard of interdisciplinary studies seminars though",
      "author": null,
      "created": 1595964634,
      "upvotes": 1,
      "replies": {}
    },
    "fzidivj": {
      "link": "/r/Emory/comments/hz4s8f/few_random_questions_from_an_upcomming_freshman/fzidivj/",
      "text": "Pretty sure FSEM was waived this sem?, I’d check to make sure",
      "author": "SupahWalrus",
      "created": 1595942724,
      "upvotes": -2,
      "replies": {}
    }
  }
}