{
  "sid": "qb3koy",
  "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/",
  "title:": "Undergraduate Admission Questions",
  "text": "Which would help my admission chances more, submitting a 1420 SAT or not submitting a score?\n\nDoes Emory consider weighted GPA?\n\nIf feel alright about my extracurriculars and my essays and I have a 3.935 GPA on a 4.0 scale with 13 AP Courses going to be taken, will my below average SAT score for this university hurt / take away from my application if I submit it?\n\nThank you so much in advance.",
  "author": "yjkimm",
  "created": 1634616452,
  "updated": 1636195703,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hh72ent": {
      "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh72ent/",
      "text": "Can you try retaking it? This is a tough one so idk\n\nYour GPA is amazing. I believe Emory considers both unweighted and weighted, so if you can get ur SAT up even to like a 1470, you'd be in a really good place\n\nMy advice is to submit bc it falls within the average range. They may think your score is below the range if you don't submit. Good luck!",
      "author": "TTMoon55",
      "created": 1634617028,
      "upvotes": 3,
      "replies": {
        "hh73csp": {
          "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh73csp/",
          "text": "Thank you so much for your response.\n\nI am planning to ED to Emory so retaking the SAT would only be possible for Regular Decision. I heard that going ED improves your chances of admission, so would it better to stick with ED and submit the score, or go regular decision and retake the SAT?",
          "author": "yjkimm",
          "created": 1634617629,
          "upvotes": 1,
          "replies": {
            "hh74a4x": {
              "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh74a4x/",
              "text": "That's such a rough one...\n\nEmory does have ED 2, whose deadline is January 1st. If that's enough time to retake and Emory is your #1, I recommend doing that! I do think ED has a higher acceptance rate (I believe 20ish% for ED 1 and 2 and like 9% for regular, but don't quote me on that)",
              "author": "TTMoon55",
              "created": 1634618227,
              "upvotes": 0,
              "replies": {
                "hh75e8r": {
                  "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh75e8r/",
                  "text": ":D",
                  "author": "yjkimm",
                  "created": 1634618985,
                  "upvotes": 1,
                  "replies": {
                    "hh7jil2": {
                      "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh7jil2/",
                      "text": "Please don’t do this. The boost for ED1 is much larger than ED2. Applying ED2 will hurt your chances way more than applying ED1 with a relatively low score/no score.",
                      "author": "screamingviking13",
                      "created": 1634630447,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "hh9kjat": {
                  "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh9kjat/",
                  "text": "Actually the ED 2 acceptance rate in 2020 was lower than the RD one. Imo would just be better to apply RD unless you’re a recruited athlete — no huge difference in acceptance rates & it doesn’t make sense to commit to Emory early with that in mind.\n\n> The Emory College overall admissions rate increased this year to 17.5% from last year’s rate of 15.6%, according to Latting. Emory offered admission to 33% of their Early Decision I applicants and 13% of Early Decision II applicants, the Wheel previously reported.\n\nhttps://emorywheel.com/admission-rate-increases-to-17-5/",
                  "author": "LostWindSpirit",
                  "created": 1634669175,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh770vj": {
      "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh770vj/",
      "text": "Emory uses their own system called the Latting Index. It is a scale 1-8 which combines your GPA (unweighted, excludes freshman year) and SAT/ACT. 1420 is a great score. Together with your GPA, you will be fine, especially during the ED round.",
      "author": "RusteX7290",
      "created": 1634620119,
      "upvotes": 1,
      "replies": {}
    },
    "hh8kvpf": {
      "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh8kvpf/",
      "text": "Apply ED if you're set on Emory and apply to both campuses. No one can tell you your admission chances here. Have people gotten in with your stats? Yes definitely. Does that mean you will get in? No, college admissions can seem very random. All I can say is good luck and I hope you end up here.",
      "author": "Artist552001",
      "created": 1634654696,
      "upvotes": 1,
      "replies": {
        "hh91l8f": {
          "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh91l8f/",
          "text": "I was more asking if submitting or not submitting my SAT scores would improve my chances or be beneficial, not asking for a chance me.",
          "author": "yjkimm",
          "created": 1634661657,
          "upvotes": 4,
          "replies": {}
        },
        "hh91rot": {
          "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh91rot/",
          "text": "Thank you for the wishes!",
          "author": "yjkimm",
          "created": 1634661729,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhdhnos": {
      "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hhdhnos/",
      "text": "Your GPA is amazing! I would not worry much if I were you. I got in during ED with quite average GPA and SAT to be honest. If anything, my essays may have helped a bit... Focus more on your written parts, if time allows!",
      "author": "shortllama",
      "created": 1634745099,
      "upvotes": 3,
      "replies": {}
    },
    "hh9mna1": {
      "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh9mna1/",
      "text": "If you think you can get around 1470 or higher I’d probably wait until RD if Emory is your dream school. This is a tough situation but because the bottom 25% cuts off at 1450 it might be slightly better to not submit, although I don’t think it’d really hurt you a ton if you did anyways.\n\nLooking at percentiles and just general guides will probably give you better advice than any of us can. I wasn’t on r/applyingtocollege while the SAT was optional so don’t know what scenarios it’d be good in.\n\nYou could also apply ED to a school you like but isn’t necessarily your dream school where ED helps (like WashU, northwestern, etc.) if you don’t mind not being overly ambitious. That way it won’t sting a ton if you get rejected. I don’t think it’s a bad idea because most people don’t get into their dream schools anyways. I mean, when I was a senior I wanted to go to Hopkins but I ended up being happy here.",
      "author": "LostWindSpirit",
      "created": 1634670012,
      "upvotes": 2,
      "replies": {
        "hh9xlzs": {
          "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh9xlzs/",
          "text": "I’ll definitely consider that option, thank you!",
          "author": "yjkimm",
          "created": 1634674297,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh9z4ca": {
      "link": "/r/Emory/comments/qb3koy/undergraduate_admission_questions/hh9z4ca/",
      "text": "I submitted 1420 and got in, went through the same decision you did.",
      "author": "dannyringel9",
      "created": 1634674893,
      "upvotes": 1,
      "replies": {}
    }
  }
}