{
  "sid": "osgxuy",
  "link": "/r/Emory/comments/osgxuy/early_decision/",
  "title:": "Early Decision?",
  "text": "Hello!\n\nI am senior in high school thinking about going to Emory but idk if i should apply for early action. If I get in, I would love to go, however, I am not sure if I will be financially okay. I read on the Emory website that if you apply for early action, 3 days before you have the make the decision they will give you an estimate of how much you'll be paying (scholarships included too). However, I am confused, what if the price they show me is too high? Is there anyway of backing out of the binding contract? Tysm in advance!",
  "author": "Connect-Awareness363",
  "created": 1627364818,
  "updated": 1634097458,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "h6ufw7e": {
      "link": "/r/Emory/comments/osgxuy/early_decision/h6ufw7e/",
      "text": "It is also important to note the difference between early decision and early action since you used those terms interchangeably. Early decision is a binding agreement that you will attend the college if accepted (but as others have said you have room to negotiate if fin aid isn’t what you need). Early action is not a binding agreement that you will attend the college if accepted. It basically means that since you are applying earlier, you will receive a decision earlier than the usual response date of regular decision.",
      "author": "Outrageous-Tea2855",
      "created": 1627488757,
      "upvotes": 3,
      "replies": {}
    },
    "h6omlnl": {
      "link": "/r/Emory/comments/osgxuy/early_decision/h6omlnl/",
      "text": "i didn't apply ED so i don't have much info on that but what i did do what was super helpful was use the estimated cost of attendance calculator - you can search google for emory's and it gives you what i considered a pretty good idea of how much aid you'll get. i actually received pretty close to what showed on there so it's worth checking out if you're worried",
      "author": "y9d8tsdt",
      "created": 1627372535,
      "upvotes": 2,
      "replies": {}
    },
    "h6okq87": {
      "link": "/r/Emory/comments/osgxuy/early_decision/h6okq87/",
      "text": "The website says that your aid package should be released within two business days of your acceptance. If you get your aid package before acceptance letters come out and it’s not enough, you can change your plan to regular decision. If you don’t receive your aid package until after your acceptance, and you can’t afford to attend based on the aid you’ve received, you can break the agreement (but you can try to negotiate first).",
      "author": "screamingviking13",
      "created": 1627370846,
      "upvotes": 1,
      "replies": {}
    },
    "h6rjsmv": {
      "link": "/r/Emory/comments/osgxuy/early_decision/h6rjsmv/",
      "text": "I did ED. You get your aid offer a day or two after you'd get your acceptance in mid december. Then you have until January 15th to commit or not (the date may change by a day or two depending on when they release the acceptances or not, that was my date).  In between that time if your first aid offer isn't where you need it to be, like mine wasn't, you can appeal and they'll tell you whether your appeal was rejected or approved before January 15th/commitment day. When I appealed, I was successful, they gave me a new improved aid offer on January 10th, so I committed to Emory.",
      "author": "Artist552001",
      "created": 1627427299,
      "upvotes": 1,
      "replies": {}
    }
  }
}