{
  "sid": "qnb4uo",
  "link": "/r/Emory/comments/qnb4uo/please_help/",
  "title:": "Please help",
  "text": "Hi, I need a HAP with Writing. I want a HAPW that needs the least work to get an A. \n\n&#x200B;\n\nWould a few people mind going to  [https://atlas.emory.edu/](https://atlas.emory.edu/), filtering for HAPW, and then sharing their recs? \n\n&#x200B;\n\nThank you!",
  "author": "bruhadiucal",
  "created": 1636118889,
  "updated": 1636138043,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hjewfth": {
      "link": "/r/Emory/comments/qnb4uo/please_help/hjewfth/",
      "text": "Come on....like there are so many of these courses and the goal is to ace the major writing assignment which is something all of them must have.  You phase in the major paper in and have so many times to workshop and revise the thing that usually if you just do all that and incorporate recommendations you make an A grade.  \n\nAlso it is possible that taking a class with a slightly higher workload where there are smaller writing assignments/grades (which can be practice) before the big paper might actually help you as, if you don't like writing or don't have time or whatever, you probably don't want your grade to only rest on that big, highly weighted writing assignment.  You may actually want more like a medium workload course which is what most of these are.  And even then most of these professors only require obedience and a good faith effort to get an A.  What you may want to do is avoid classes that seem to be clearly for majors(think colloquia or courses with a pre-req) in whatever the department a HAPW is hosted as they are likely to hold you to higher standards in your writing.",
      "author": "oldeaglenewute2022",
      "created": 1636119634,
      "upvotes": 3,
      "replies": {}
    },
    "hjewm15": {
      "link": "/r/Emory/comments/qnb4uo/please_help/hjewm15/",
      "text": "Most of the good ones (note: not easy) are on waitlists already, which makes sense. RUSS 360W should be pretty \"easy\" since it's online in the evening. The IDS ones require ENGRD 223 so may not be the choice for you. Can't comment on other HAPW courses.",
      "author": "MyKali",
      "created": 1636119713,
      "upvotes": 1,
      "replies": {}
    },
    "hjfhecf": {
      "link": "/r/Emory/comments/qnb4uo/please_help/hjfhecf/",
      "text": "I would think that you're already too late for the good ones.",
      "author": "Korean_Yezus420",
      "created": 1636128144,
      "upvotes": 1,
      "replies": {}
    }
  }
}