{
  "sid": "jss5rj",
  "link": "/r/Emory/comments/jss5rj/is_psyc_110_or_psyc_111_better_for_mcat/",
  "title:": "Is PSYC 110 or PSYC 111 better for MCAT preparation?",
  "text": "I'm a freshman and I'm considering taking one of these classes during the Spring 2021 semester. Do you guys have a recommendation between the two courses and any professor recommendations? \n\n&#x200B;\n\nI could also end up taking BOTH courses for a total of 19 credits when counting other classes in my schedule. I'm doing pretty well this semester with 17 credits, though that may be because I have Health 100, Pace 101, and a relatively easy freshman seminar. Would you recommend I do this, or is it just an unnecessary addition to my course load?",
  "author": "DelayedAutisticPuppy",
  "created": 1605175569,
  "updated": 1634099275,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "gc1qhyj": {
      "link": "/r/Emory/comments/jss5rj/is_psyc_110_or_psyc_111_better_for_mcat/gc1qhyj/",
      "text": "PSYC 110 is basically biopsych. You’ll get a lot more about neurotransmitters, sensory perception, and other stuff that would probably be more relevenat for MCAT (although I haven’t taken the MCAT so I can’t say for sure). PSYC 111 is easier. It’s more your  social psych and less biologically based. If you take 110, try to take Kazama’s section! He’s the best.",
      "author": "gracefulmacaroni",
      "created": 1605191890,
      "upvotes": 7,
      "replies": {}
    },
    "gc1u016": {
      "link": "/r/Emory/comments/jss5rj/is_psyc_110_or_psyc_111_better_for_mcat/gc1u016/",
      "text": "What else are you taking? Simply saying a credit number isn't that helpful to guage difficulty. Like if you have chem and bio, many find the 2nd sem. more challenging so a 3rd semi-\"serious\" course may stretch you some which is fine, but don't be surprised if you feel challenged if you didn't want to.\n\nAlso note that there is a chance that both psyches are significantly simpler in the Covid format. So that can mean they are great for grades OR perhaps less great if you are trying to seriously learn from them.  I think both are useful but I think 111 is more aligned with MCAT psychology because MCAT psychology was meant to introduce more social science/social psychology to the test. I may send you an old MCAT preview guide later so that you can align/guess the relevance of each course with covered topics for yourself.   Note that you may want to eventually take sociology of health which directly targets MCAT prep for that section (should be an old syllabus on the sociology page you can look at)",
      "author": "oldeaglenewute2022",
      "created": 1605193777,
      "upvotes": 1,
      "replies": {
        "gc2rgqc": {
          "link": "/r/Emory/comments/jss5rj/is_psyc_110_or_psyc_111_better_for_mcat/gc2rgqc/",
          "text": "Chem 202, Chem 202L, Biol 142, Biol 142L, and Biol 240. Please do send the MCAT guide!",
          "author": "DelayedAutisticPuppy",
          "created": 1605209009,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gci4rqt": {
      "link": "/r/Emory/comments/jss5rj/is_psyc_110_or_psyc_111_better_for_mcat/gci4rqt/",
      "text": "I think both are useful but you need more than both to succeed on the psych soc section of the MCAT. I took 111 and ended up studying a lot of new terms related to 111 concepts, and had to learn some basic neuro psych stuff relevant to 110. Point is, neither will teach you all the psych that you need to know. I had a great time with Dr. Kim for 111 though.",
      "author": "premeddie19",
      "created": 1605541172,
      "upvotes": 1,
      "replies": {}
    },
    "gc2rzhq": {
      "link": "/r/Emory/comments/jss5rj/is_psyc_110_or_psyc_111_better_for_mcat/gc2rzhq/",
      "text": "Dude I’d just stick with your current course load and take psych 110 another semester. This seems like a lot for a freshman and realistically you’ll have a couple years for the MCAT but a consistent GPA is more worth it at this point imo, as well as starting to get your foot in the door for ECs and such",
      "author": "goat-nibbler",
      "created": 1605209258,
      "upvotes": 1,
      "replies": {}
    }
  }
}