{
  "sid": "nff7a5",
  "link": "/r/Emory/comments/nff7a5/taking_physics_141_and_142_over_the_summer/",
  "title:": "Taking Physics 141 and 142 over the summer",
  "text": "Any thoughts/advice on taking physics 141 and 142 over the summer? I have to start taking chem in the fall so I'm not sure if I'd want to double up on STEM classes during the school year (also doing the BBA program while getting my prereqs for med school).",
  "author": "yowesterburg",
  "created": 1621355456,
  "updated": 1634098083,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "gylgehi": {
      "link": "/r/Emory/comments/nff7a5/taking_physics_141_and_142_over_the_summer/gylgehi/",
      "text": "You should probably be doubling up in something(med schools expect to see it at some point) eventually in STEM if pre-med (or pre-grad for STEM) but it could be with a biol or something else.  If you are to take a STEM during summer physics is the one though. Just don't do it to simply avoid doubling up in STEM (maybe tripling but not doubling. You are supposed to be able to handle that by sophomore year). If just doing STEM for fun then do whatever.",
      "author": "oldeaglenewute2022",
      "created": 1621360400,
      "upvotes": 1,
      "replies": {
        "gylgqt6": {
          "link": "/r/Emory/comments/nff7a5/taking_physics_141_and_142_over_the_summer/gylgqt6/",
          "text": "Okay, I still have to double up at some point with bio chem and human physiology. Do you think that’s okay? I’m mainly taking physics now so I have more room for business school stuff in the fall",
          "author": "yowesterburg",
          "created": 1621360538,
          "upvotes": 1,
          "replies": {
            "gylgwb5": {
              "link": "/r/Emory/comments/nff7a5/taking_physics_141_and_142_over_the_summer/gylgwb5/",
              "text": "Lab sciences or something more serious than physiology is what I have in mind",
              "author": "oldeaglenewute2022",
              "created": 1621360600,
              "upvotes": 2,
              "replies": {}
            },
            "gylhsph": {
              "link": "/r/Emory/comments/nff7a5/taking_physics_141_and_142_over_the_summer/gylhsph/",
              "text": "Like I'm talking more like a genetics, cell, or immunology type course and then maybe take some more once in the bschool. Just spread it out.  Again if pre-med don't just be flippant with STEM course selection beyond just cores if you have time (show you're serious/ready). Find whatever builds MCAT SKILLS (not just content).  Don't just slap some stuff together.",
              "author": "oldeaglenewute2022",
              "created": 1621360965,
              "upvotes": 2,
              "replies": {
                "gylkuqv": {
                  "link": "/r/Emory/comments/nff7a5/taking_physics_141_and_142_over_the_summer/gylkuqv/",
                  "text": "Will do, thank you! I feel like PHA hasn’t been the most helpful with this type of advice.",
                  "author": "yowesterburg",
                  "created": 1621362207,
                  "upvotes": 1,
                  "replies": {
                    "gylx57k": {
                      "link": "/r/Emory/comments/nff7a5/taking_physics_141_and_142_over_the_summer/gylx57k/",
                      "text": "On course advise Emory's PHA is a bit too simplistic and will give barebones advice that is sort of cookie cutter (and also assumes students don't wanna do much).  Their paths may make you feel more relaxed but they don't necessarily make you more competitive so I tend to base advising off of what more successful PHAs say to do (especially if the school outperforms Emory with a similar number of applicants originating from them). It looks like lots of schools expect MORE from those applying from highly selective undergrads. \n\nThe only reason they take lower GPAs from most of them is because they usually correspond to higher MCATs.  You must of course get that competitive MCAT score and classes like 336 \"may\" be helpful but are insufficient. This is especially the case if you are primarily a BBA student. Unlike bio and NBB majors who have non-MCAT/learning based incentives to eventually take problem solving oriented bio classes (because they fullfill elective and core requirements), and you don't so you may as well use those rare time slots that open up in your schedule to gain exposure to that style of bio which is all over the MCAT (unlike phys) STEM sections.",
                      "author": "oldeaglenewute2022",
                      "created": 1621367185,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}