{
  "sid": "hr5um1",
  "link": "/r/Emory/comments/hr5um1/places_to_study_on_campus/",
  "title:": "Places to study on campus",
  "text": "Where can one find study spots on campus that is preferably in door and have AC? I know buildings are closed to non-essential personnel rn.............",
  "author": "SnooRadishes7008",
  "created": 1594747902,
  "updated": 1634098738,
  "over_18": false,
  "upvotes": 17,
  "upvote_ratio": 0.95,
  "comments": {
    "fy33ur6": {
      "link": "/r/Emory/comments/hr5um1/places_to_study_on_campus/fy33ur6/",
      "text": "I'm not sure if you're looking for buildings as of right now, or if you're a new student who hasn't been on campus, or talking about for next semester and the buildings available due to COVID.\n\nSince I cannot answer for right now, or for next semester, I'll answer generally assuming you're a new student and campus isn't in a pandemic. I'll try to list them out:\n\n***Your Res Hall***: There are plenty of lounges and study rooms to sit in to study on your floor. Pretty quiet and AC'd. Probably the best place to study (if you don't get distracted by friends easily lol)\n\n***Cox Hall*** (I believe will be opened): Nice place to study especially upstairs. \n\n***Woodruff Library*** (Probably open with severe limitations): Arguably best place to study if it's in proper order. I like going to the 7-8th floors and taking a big glass room to myself when I really need to get work done. Usually are open. \n\n***Chandler Library*** (Probably also open with limitations): Never studied in here (got lost in here early fall sem lol). Also a nice quiet place\n\n***Cannon Chapel*** (Probably open): smack dab in the middle of campus. Only far from bio bridge stuff. Not necessarily the best place to study but it's not bad by any means. \n\n***MSC*** (Probably open): Math & Science center is a place I probably wouldn't want to do much studying in, I'd actually (funnily enough) only do math homework or physics hw since its not all that quiet. \n\n***Atwood Chemistry Building*** (Probably open): Amazing spot to study, was newly renovated so it's a great spot to study. Also looks pretty cool. \n\n***White Hall*** (Probably open but probably just for thru traffic): If there are seating still available, it's akin to Cannon Chapel, just louder. \n\n***ESC \\[Emory Student Center\\]*** (Probably open with severe limitations): It's the main student center, kinda made for studying. I'd prefer to study with a group there than solo studying though (just IMO).\n\n***Bio Library*** (???): Literally never been in there, just know that it is a spot that people study at.\n\n***Starbucks, Kaldis, or anywhere at Emory Village***: On campus restaurants / stores you could study at while getting a snack. Never really did it besides on finals week.  \n\n***Woodpec*** (Probably open with sever limitations): If you really wanted to, you could get a study session at the bottom floor of the Gym, I'm not sure why you'd want to, but hey, it's your choice. It does have the best water fountain on campus (dont @ me) and some nice seating. \n\nThese are all the spots I can think of. I can't confirm what'll be open and to what extent. But no one can tbh. All buildings as far as I know are AC'd so don't fret on that front. I'm also probably missing places (since I probably won't study in buildings I've never been in). I'm sure someone will add them. Hope this helped!",
      "author": "SupahWalrus",
      "created": 1594766494,
      "upvotes": 11,
      "replies": {
        "fy34as6": {
          "link": "/r/Emory/comments/hr5um1/places_to_study_on_campus/fy34as6/",
          "text": "Would like to know what water fountain in the woodpec is the best on campus?  I thought all the ones in there are kind of disappointing.  \n\nNow the one on left side, first floor of Dobbs on the other hand...  That one is great!",
          "author": "followthelawson",
          "created": 1594766730,
          "upvotes": 5,
          "replies": {
            "fy3qmur": {
              "link": "/r/Emory/comments/hr5um1/places_to_study_on_campus/fy3qmur/",
              "text": "It’s the lowest floor where the rock wall is. The bathroom to the left when you get off the stairs has a fountain right next to it. It’s super cold and taste great!",
              "author": "SupahWalrus",
              "created": 1594779673,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fy3lih4": {
          "link": "/r/Emory/comments/hr5um1/places_to_study_on_campus/fy3lih4/",
          "text": "thanks!!",
          "author": "anacrissy",
          "created": 1594776630,
          "upvotes": 1,
          "replies": {}
        },
        "fya7cij": {
          "link": "/r/Emory/comments/hr5um1/places_to_study_on_campus/fya7cij/",
          "text": "I am asking about right now, am not a new student, just need to find somewhere else to study other than at my place of residence.",
          "author": "SnooRadishes7008",
          "created": 1594927208,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}