{
  "sid": "lgwac3",
  "link": "/r/Emory/comments/lgwac3/premed_major_help/",
  "title:": "pre-med major help",
  "text": "hi! i was recently accepted to emory (atl campus) on the pre-med track. which major would you suggest for pre-med? - 1. biology or 2. neuroscience and behavioral biology",
  "author": "Due_Ad_7169",
  "created": 1612971652,
  "updated": 1634099266,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.91,
  "comments": {
    "gmtxqx9": {
      "link": "/r/Emory/comments/lgwac3/premed_major_help/gmtxqx9/",
      "text": "Whichever one has the course selection that actually interests you as well as research focused courses/professors that prep you for the MCAT that you are WILLING to take and work/think hard in.  Don't let us/a third party help you choose and tell you some non-sense about what is better for pre-med. You can do well in what you have a genuine enough interest in to work hard for.  You can technically sample both before you declare because pre-reqs and a good amount of electives overlap.  In fact you could theoretically do a bio major and take the neuro focused/NBB electives and courses hosted by bio (and many are the good research focused ones that will help compensate for the skills you hardly learned in biol 14x)\n\n*What I will say is that NBB majors who do well tend to have an MCAT advantage because the NBB major FORCES students to take a core that ensures they are exposed to a more interdisciplinary and research/prpblem solving lens of life sciences/biology whereas you have to more actively seek that out in biology.  With biology it is easier to fall into traps after biol 14x where you take a bunch of weak courses that tend to only focus on content regurgitation skills (that you likely mastered in k-12) which isn't how the MCAT tests bio topics.  The only way to develop beyond the way you likely learned and knew how to test in bio for HS is to take the \"risk\" and try courses that don't teach that way which may cause discomfort initially or gasp!!...result in a non-A every now and then.\n\n And note that bio now has tons of teachers and courses that will get you there but there is a lot of fearmongering among bio pre-meds that ends up steering many strong students towards courses (because bio is way more flexible in terms of course selection beyond 14x) towards sketchy courses that are supposedly \"easy\"(usually memorization oriented) and cover MCAT material but are actually over-rated beyond a GPA padder (human phys comes to mind. Covers body systems which is great I guess but like 1/2 the instructors don't do a problem solving/case based or research oriented focus at any time. And the MCAT apparently presents most physiology questions and passages in the form of a physics or research oriented chemistry and molecular biology).  \n\nThings like cell bio, human genetics, microbio (with the right teacher, probably Vega), biol 240 (W/Beck), evol bio, immunology, epigenetics, and several others end up more helpful whether they explicitly cover MCAT material or not because they get you used to research techniques in bio, reading journal articles, and generally going far beyond textbook and slide based regurgitation tests in bio (some courses may not even have tests).",
      "author": "oldeaglenewute2022",
      "created": 1612974476,
      "upvotes": 9,
      "replies": {
        "gmtzfpp": {
          "link": "/r/Emory/comments/lgwac3/premed_major_help/gmtzfpp/",
          "text": "this is so helpful! thank you so much! when do we finally declare our major?",
          "author": "Due_Ad_7169",
          "created": 1612975194,
          "upvotes": 5,
          "replies": {
            "gmu0qhz": {
              "link": "/r/Emory/comments/lgwac3/premed_major_help/gmu0qhz/",
              "text": "I think the latest is usually sophomore year 2nd semester.  So there are plenty of things to be sampled. Like even as a freshman you can take things like NBB 299 or Biol 200 which are intro to research courses hosted by each to get a better sample. Basically you can choose one of those and a frosh seminar in the other.  Biol 14x whether you like it or not should not be your guide to whether you think you'll like the bio major or if it is good for you. Some fools are gonna be like \"I made an A/A- in easy ass biol 14x so bio must be the major for me!\"(If ECAS was Oxford, then liking biol 14x may be a better barometer because it is much more intensive than ECAS's version) when the courses you should be taking after intro are far different and much more demanding intellectually.  \n\nYou should also keep an open mind. Gchem and ochem with the right profs. at Emory is REALLY good and converts a lot of people away from NBB or bio or inspires a 2nd major (in fact one relatively recent Goldwater Scholar did neuro research all in HS and came with her mind made up for NBB, took McGill and Weinschenk and did chem research for the remainder of her time at Emory.  And she is now at Chicago for MDPhD?:https://news.emory.edu/stories/2017/09/er_chemistry_curriculum/campus.html.  Diaz I think?). The dept has been pulling and producing some great scientists and future doctors lately.  \n\nThe chem major has developed a lot of bio focused electives that could be great for MCAT style thinking (which is really just general scientific thinking and problem solving vs just \"knowing stuff\") and pre-med and since even all the foundation courses are also intentionally more interdisciplinary than most similar caliber schools, they end up helpful whether you end up majoring or not (also note that you get access to most 300 level chem electives by just finishing chem 204. and I strongly reccomend chem biochem over bio biochem. Latter is too stripped down and overlaps way too much with biol 141 and chem 204 to be of much use).\n\nHell you may not even wanna major in a STEM. You never know and you certainly don't have to because pre-med is just a set of requirements",
              "author": "oldeaglenewute2022",
              "created": 1612975742,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "gmvbmp8": {
      "link": "/r/Emory/comments/lgwac3/premed_major_help/gmvbmp8/",
      "text": "The biggest difference considering you’d be taking pre-med required courses anyway is that bio major requires you take more higher-level bio classes (duh) and NBB requires a much broader course load, like psych and anthro. But as the other comments have said, for your freshman year you’ll just be taking intro courses which are pretty much the same for both, so just see what you like.",
      "author": "LCC16",
      "created": 1612995597,
      "upvotes": 5,
      "replies": {
        "gmvohsj": {
          "link": "/r/Emory/comments/lgwac3/premed_major_help/gmvohsj/",
          "text": "The difference to me is that NBB can kind of gaurantee a decent training/learning  just through the core courses because each of those courses is so different and serve a different (and clear) purpose in terms of learning goals (like NBB 301 is very interdisciplinary which makes it an excellent course for pre-meds and it doesn't exactly water down the math, physics, and chemistry in the way another \"med school relevant\" class like most biol 336 sections would to address key topics.  And maybe all but NBB 201 focus on or heavily emphasize experimental neuroscience and biology which is useful) and competencies (including those good for med. school and the MCAT).  And this is the case no matter who you take those courses with (like the difference between one NBB 301, 302, 401 teacher isn't like \"just regurgitate it\" vs. \"lots of problem solving with the same material\" and bio has lots of night and day stuff like that for some classes even upper divisions with varied instructors).\n\nI understand the draw, but there are just some aspects that can be problematic in terms of achieving certain compentencies and whatnot (you could, for example, recently go through a bio major without ever taking a writing focused bio course or completely avoid the upper division courses that have scientific literature reading, especially those which could be med/MCAT relevant. You can't do that in NBB simply because of the 401 requirement and even a huge chunk of the non-NBB hosted electives have that as a focus or at least a significant part of the course.\n\nIf a student is serious, both can and will definitely work (and again, you can easily learn neuroscience and other biologies through both.  Biol hosts lots of NBB electives and neuro cross-lists some of the ones it hosts with bio) but bio offers a lot of escape hatches (like 2/4 of the electives will likely be covered by 336 and 301 for most pre-meds and generally those classes are \"not great\". One can only hope most students take way more than 4, choose the other 2 with thoughtfulness, or do lab research to compensate, but sometimes I wonder).  Both will easily do the job if a student makes good choices, but biology isn't designed with a plan or specific set of goals in mind and I don't see intrinsic value in taking \"more bio\" if they aren't necessarily going to be good.",
          "author": "oldeaglenewute2022",
          "created": 1613001729,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gmtxbxz": {
      "link": "/r/Emory/comments/lgwac3/premed_major_help/gmtxbxz/",
      "text": "Both the NBB and Bio BS majors are good matches for premed and either will position you well for med school (asuming you do well in your courses). No need to decide yet because you don't need to declare major until your 2nd year and the core classes for both majors are the same. Bio 141/2, Chemisty, QTM / Calc. Focus on these core classes + pre-med requirements (like Phys 141/2) in your first year and then choose NBB vs Bio based on whichever genuinely interests you more.",
      "author": "FlowersBloomUntil",
      "created": 1612974297,
      "upvotes": 7,
      "replies": {}
    },
    "gok4k4y": {
      "link": "/r/Emory/comments/lgwac3/premed_major_help/gok4k4y/",
      "text": "Premed really isnt worth it bro. The medical field in 2031 is going to look so much different from today and not necessarily in a better way. If you are looking for money and prestige, you can find that in investing and CS. Tons of free education online for that too. If you are looking for stability, dont. No job is stable forever. If you really just want to be a doc, then do premed",
      "author": "After_Expert1389",
      "created": 1614150132,
      "upvotes": 0,
      "replies": {}
    }
  }
}