{
  "sid": "qrwpfl",
  "link": "/r/college/comments/qrwpfl/can_you_study_in_a_college_abroad_and_work_as_an/",
  "title:": "Can you study in a college abroad and work as an au pair at the same time?",
  "text": "I'm extremely interested in studying abroad and so I thought about working as an au pair . So, is it ok to study in college and have this work? . (also its kind of a type of housing).\n\nAnd thank you so much!",
  "author": "Ortspoon16",
  "created": 1636669546,
  "updated": 1636745758,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk9cu6p": {
      "link": "/r/college/comments/qrwpfl/can_you_study_in_a_college_abroad_and_work_as_an/hk9cu6p/",
      "text": "Are you talking about legally possible, like with visas? Or just time commitment wise?\n\nLegally depends on a lot of factors - the main one being the country. Typically , student visas are limited, but do allow for some work. Of course if the au pair job is being paid under the table, that’s no issue.\n\nIn terms of time commitment, it would depend on the requirements of the au pair job.",
      "author": "IceRose39",
      "created": 1636669864,
      "upvotes": 1,
      "replies": {
        "hk9d31r": {
          "link": "/r/college/comments/qrwpfl/can_you_study_in_a_college_abroad_and_work_as_an/hk9d31r/",
          "text": ">ed, but do allow for some work. Of course if the au pair job is being paid under the ta\n\nits the issue of time. i will be studying computer science, but i already have like 4 or 5 years of experience in programming BUT still worried about the time",
          "author": "Ortspoon16",
          "created": 1636669973,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hk9eijk": {
      "link": "/r/college/comments/qrwpfl/can_you_study_in_a_college_abroad_and_work_as_an/hk9eijk/",
      "text": "Depends where you are from and which country you want to go to. Are you an EU citizen wanting to study and work in an other EU country? Yes, no problem, you don’t even have to do anything. Do you want to be an Au Pair in the US while enrolled full time at a University with a student visa? Not possible.",
      "author": "Dry-Razzmatazz8352",
      "created": 1636670592,
      "upvotes": 1,
      "replies": {}
    }
  }
}