{
  "sid": "r5ikf5",
  "link": "/r/college/comments/r5ikf5/if_you_havent_had_the_college_experience/",
  "title:": "If you haven’t had the “college experience”",
  "text": "Currently in my final year of studies and been reflecting lately and I realised that I never had the ideal “college experience.” I never made any friends my first two years due to what I now realise was low self-esteem. I was excited to go into my third year with classes that interested me along with an internship where I hoped I’d be able to meet more people.. and then BAM.. Covid happened. Classes went online and being remote affected me. I took the time during lockdown to better myself and while I still have my bad days, I  realise now how worthy I am, and am working on improving my self-esteem. Felt emotional today and had a breakdown thinking about my lack of a “college experience.” Sometimes it makes me feel different from others, or like I missed out in some way. But even in my deepest moments of regret, I remind myself that the right people and situations do find you. I’m still doing courses online but plan to continue my studies following graduation next year. I hope that this helps anyone else who may be feeling similarly to realise that they are not alone. Also, would love to hear about people’s experiences (mainly socially) with undergrad vs grad school (:",
  "author": "Sarah09x",
  "created": 1638260363,
  "updated": 1638480496,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hmoa6zj": {
      "link": "/r/college/comments/r5ikf5/if_you_havent_had_the_college_experience/hmoa6zj/",
      "text": "On a note that may make you feel better, or just be more depressing, I haven't really spoken to most of my college friends in months now that we've graduated, even though 4 out of 5 of us ended up in the same state. College gives you a lot of common ground and experience, but once you graduate you might find how different your priorities and interests are when you have time to do more than just study.\n\nHowever, in school, most of my friends were formed from study groups. We became good friends, but in the end proximity and necessity was a little bit the basis of our friendship, so maybe that's why they didn't last. But I do feel like I got to have the college experience with them and after the initial realization, it doesn't bother me that I've moved on to different things.",
      "author": "Thelton26",
      "created": 1638287497,
      "upvotes": 1,
      "replies": {}
    }
  }
}