{
  "sid": "qhrb8b",
  "link": "/r/college/comments/qhrb8b/a_class_from_mitharvardprinceton_is_times_harder/",
  "title:": "A class from MIT/Harvard/Princeton is _ times harder than Community College.",
  "text": "Hey, for those of you who've experienced both, how much harder would a physics 1 class from mit compare to say Santa Monica community college?\n\n5 times? 10 times?\n\nMostly serious answers please.",
  "author": "FaithfulGaurdian",
  "created": 1635439999,
  "updated": 1635456980,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hieiov6": {
      "link": "/r/college/comments/qhrb8b/a_class_from_mitharvardprinceton_is_times_harder/hieiov6/",
      "text": "That's something that's hard to quantify, lol. \n\nMany Ivies and top tier schools (particularly MIT) post their materials online so that you can access them for free. If you really want to know, take the class at CC and \"take them\" using the free online materials provided by MIT ([here's a link](https://ocw.mit.edu/courses/physics/8-01sc-classical-mechanics-fall-2016/)). \n\nAnecdotally, as someone who took physics at CC, it does look harder, but I wouldn't say it's even \"twice\" as hard. I've only ever taken one physics class (physics I) and took it years ago, but could breeze through the MIT problem sets now that I have more of an advanced math education, so it seems to me that just keeping up and pursuing your education to a more advanced level is more important than making sure your Physics I class is as \"hard\" as MIT's.",
      "author": "HumanDrinkingTea",
      "created": 1635440818,
      "upvotes": 2,
      "replies": {}
    },
    "hieksg5": {
      "link": "/r/college/comments/qhrb8b/a_class_from_mitharvardprinceton_is_times_harder/hieksg5/",
      "text": "Community college is literally the smartest move for most people. There should not be a stigma around them. I started at community college and saved so much $$$. Also you get smaller class sizes and instructors who are chill without an ego.",
      "author": "Rabidbeaver26",
      "created": 1635441639,
      "upvotes": 1,
      "replies": {}
    },
    "hiekvg6": {
      "link": "/r/college/comments/qhrb8b/a_class_from_mitharvardprinceton_is_times_harder/hiekvg6/",
      "text": "Comparing my general chemistry course at Dartmouth against my friends at SUNY Buffalo, I found their work much easier. Not only were they not seeming to go as deep, they got to do it in the course of a 16 week semester, as opposed to our 10-weeek term.",
      "author": "biggreen10",
      "created": 1635441671,
      "upvotes": 1,
      "replies": {}
    },
    "hif29bj": {
      "link": "/r/college/comments/qhrb8b/a_class_from_mitharvardprinceton_is_times_harder/hif29bj/",
      "text": "I haven’t taken any classes at an actual community college, but I have taken some at my local non-flagship state school, and it wasn’t that much easier than at my Ivy - it was different though. I took half of my genchem/orgo sequence at Princeton, where there was a slightly longer curriculum and very hard problem sets and exams with only like 10 (multipart) questions each. There was a large curve. At my local state school, the curriculum was a little shorter, and the homework and exams were much longer (30 questions or so), but each question was a little easier. There was almost no curve there.\n\nThe content was mostly the same, and the actual quality of instruction was mostly the same, but the assignments/exams were different (and to me, they were twice as hard at Princeton). I felt I learned the basic chem concepts better from doing 30 medium problems than from struggling through 10 impossible ones, but I think if I were a passionate chem major it would be the other way around.\n\nAnyway, obviously, every college is different, and every person is different, and chem isn’t physics, but hopefully this partially answers your question.",
      "author": "DarthKnah",
      "created": 1635448466,
      "upvotes": 1,
      "replies": {
        "hif3hn5": {
          "link": "/r/college/comments/qhrb8b/a_class_from_mitharvardprinceton_is_times_harder/hif3hn5/",
          "text": "Princeton sounds more like my local non-flagship state school, and your local non-flagship like my CC.\n\nTo some extent, I always chalked it up to cultural differences. Princeton and my local non-flagship have a lot more foreign professors, and I suspect that style of fewer but harder questions plus curve is more of a norm outside of the US and that professors like to stick with the style that they themselves were exposed to. \n\nIn many countries, it's pretty normal for a score of a 70% or so to be equivalent of \"A\" quality work, and the curve only exists to more or less translate this style into something Americans are more familiar with.\n\nThat's all conjecture, though, based on my observations that departments with more foreign professors seem to give harder exams with fewer questions.",
          "author": "HumanDrinkingTea",
          "created": 1635448956,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}