{
  "sid": "qxpoqj",
  "link": "/r/college/comments/qxpoqj/university_rankings/",
  "title:": "University Rankings",
  "text": "How much do University Rankings matter, both nationally and internationally?",
  "author": "hamiltonianpsi",
  "created": 1637356303,
  "updated": 1637689565,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlb6xp5": {
      "link": "/r/college/comments/qxpoqj/university_rankings/hlb6xp5/",
      "text": "Context, please.",
      "author": "cajunsoul",
      "created": 1637358938,
      "upvotes": 1,
      "replies": {
        "hlciuya": {
          "link": "/r/college/comments/qxpoqj/university_rankings/hlciuya/",
          "text": "I have been invited for admission in a couple of universities for engineering. So, me and my parents have been debating which University I should attend. One of them has a National Ranking of 2 whereas the others are quite down below. As well as the University has a good International Ranking and Accreditation as well.\n\nSo my question is that attending a University with high rankings is better or it doesn't make any difference?",
          "author": "hamiltonianpsi",
          "created": 1637380959,
          "upvotes": 2,
          "replies": {
            "hlfck0l": {
              "link": "/r/college/comments/qxpoqj/university_rankings/hlfck0l/",
              "text": "(All of the following is just my opinion, of course). In that case, rankings matter a great deal, at least relatively. For instance, there’s not much difference between two high-ranked national universities, but a great deal of difference between a high-ranked national university and any regional one.\n\nMind you, this won’t necessarily equate to a better education, (as there are fair, good, and amazing professors at community colleges, small universities, and research institutions), but there are advantages for networking and job hunting. \n\nOne other thing: Regardless of reputation, there are only a few schools worth going into debt (for an undergraduate degree).",
              "author": "cajunsoul",
              "created": 1637440172,
              "upvotes": 2,
              "replies": {
                "hlgj5uk": {
                  "link": "/r/college/comments/qxpoqj/university_rankings/hlgj5uk/",
                  "text": "Good points. Will keep that in mind.",
                  "author": "hamiltonianpsi",
                  "created": 1637459931,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}