{
  "sid": "qmqwyn",
  "link": "/r/college/comments/qmqwyn/i_didnt_finish_my_exam_on_time_left_34_long/",
  "title:": "I didn’t finish my exam on time. Left 3-4 long answer questions. Any advice for how to move on?",
  "text": "Quite frankly I feel very degraded. Like I prepared, studied and it was open book but that still wasn’t enough. I don’t get why tests need such a harsh deadline cause all it does is make me more anxious which in turn makes me even slower. \n\nI don’t think I’ll pass quite frankly and I don’t even know what my grade is going into this midterm.  Any suggestions on how to cope?",
  "author": "Jetter_Buggy",
  "created": 1636049896,
  "updated": 1636137372,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hjbaiie": {
      "link": "/r/college/comments/qmqwyn/i_didnt_finish_my_exam_on_time_left_34_long/hjbaiie/",
      "text": "Shit happens. You can’t do anything BUT move on.",
      "author": "BrownRiceBandit",
      "created": 1636050131,
      "upvotes": 3,
      "replies": {}
    },
    "hjbea33": {
      "link": "/r/college/comments/qmqwyn/i_didnt_finish_my_exam_on_time_left_34_long/hjbea33/",
      "text": "Go worry about your other upcoming exams now.",
      "author": "Xen0Coke",
      "created": 1636051608,
      "upvotes": 2,
      "replies": {}
    },
    "hjc2ew1": {
      "link": "/r/college/comments/qmqwyn/i_didnt_finish_my_exam_on_time_left_34_long/hjc2ew1/",
      "text": "One thing that might help is understanding why the exam is like this. Open note exams are usually very tight on time so they can make up for the fact that you have been allowed all of your notes. The point of an exam is to find out how well someone knows the material, so if they gave you hours and hours of time on top of open note, then that's just testing how well you can find the answers from your notes. \n\nIf you prepared and studied, there was little else you could do on that end and you shouldn't feel like you failed. One thing you could do to prepare for these types of exams is to take practice exams within that timeframe and pick up techniques for taking exams faster.\n\nIn terms of your grade, a lot of people often end up doing better than they expected walking out of the exam, or the professor could end up curving the grades. Even if the grade isn't what you want, it's only the midterm and you still have the final and whatever assignments are left to pick it back up. If you're taking too much stress/having anxiety about it, like someone else said you should talk to someone - like you college's counseling center, which is specialised in talking about your specific problem, since it's common for students to have exam anxiety. Hope it goes well for you and good luck with the rest of the semester!",
      "author": "NoDryHands",
      "created": 1636061100,
      "upvotes": 2,
      "replies": {}
    },
    "hjbg7lh": {
      "link": "/r/college/comments/qmqwyn/i_didnt_finish_my_exam_on_time_left_34_long/hjbg7lh/",
      "text": "Go see mental health and explain you're having text anxiety. Ask for an accommodation letter for double test time. Bring it to your office of educational accessibility, they'll file it and inform professor to provide extra time on timed tests and assignments.",
      "author": "SemanticBattle",
      "created": 1636052370,
      "upvotes": 0,
      "replies": {}
    },
    "hjczjt4": {
      "link": "/r/college/comments/qmqwyn/i_didnt_finish_my_exam_on_time_left_34_long/hjczjt4/",
      "text": "Timed exams mean you have to legitimately *know* the material beforehand. There intentionally is not time for you to work out concepts while taking the exam, regardless of whether its open book or not. Honestly, the words 'open book exam' shouldn't comfort you, they should *terrify* you. You are expected to be able to use all of the information available in the book at a moment's notice. They are not easier than closed book exams.",
      "author": "patrdesch",
      "created": 1636075196,
      "upvotes": 1,
      "replies": {}
    },
    "hjdaooy": {
      "link": "/r/college/comments/qmqwyn/i_didnt_finish_my_exam_on_time_left_34_long/hjdaooy/",
      "text": "This happened to me yesterday too :/ I just emailed my teacher and asked if there was anything I can do to boost my grade. For my upcoming tests I will go to office hours. Move on by focusing on other things in your life",
      "author": "dropthemic2003",
      "created": 1636080315,
      "upvotes": 1,
      "replies": {}
    }
  }
}