{
  "sid": "qf9nv6",
  "link": "/r/college/comments/qf9nv6/cheap_online_college_vs_large_state_university/",
  "title:": "Cheap Online College vs Large State University for \"partying and the college experience\"",
  "text": "I've thought of this too. I'm now 29, but graduated at 24 from a commuter college that was super lame and had none of the party campus environment that you see in the movies. It seemed like most of the students just went to class and went back home, and the campus was empty. Plus I was mainly focused on grades etc. Also, it seemed like you would talk to someone max one semester and never see them again. It seems like the big colleges seem more fun, but idk if it's just hype and if it's worth 20-30k more and moving/quitting my job etc?\n\nNow that I'm changing fields to IT, since I couldn't find a job with my first degree of Kinesiology, I'm debating whether to go for cheap at an online school that would only cost around 8000-11000. Or to go back in person to a big public university for 2 years which could be anywhere from 20-40k, plus driving in, parking, more book expenses, and I would have to switch from working full time to part time.\n\nNot much dating in my town so I was thinking of applying to a big uni for more dating opportunities that my first college did not provide. Or would it be better to go with the cheaper and quicker online option, while keeping my full time job and save more money?",
  "author": "ElectricOne55",
  "created": 1635138907,
  "updated": 1636181793,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhybzz0": {
      "link": "/r/college/comments/qf9nv6/cheap_online_college_vs_large_state_university/hhybzz0/",
      "text": "Cheap online degree programs usually are of questionable quality. Partying and such aside, the large state university would be more reputable and probably more worthwhile.",
      "author": "PhDapper",
      "created": 1635139433,
      "upvotes": 2,
      "replies": {}
    },
    "hhzbnb8": {
      "link": "/r/college/comments/qf9nv6/cheap_online_college_vs_large_state_university/hhzbnb8/",
      "text": "Make sure any online options are accredited and non-profit. There are good ones out there but also some notable scams.\n\nYou are old enough that dating in college would be less of an option. You can of course look for dating prospects in the area surrounding the college but not as much on campus.",
      "author": "Katherington",
      "created": 1635167120,
      "upvotes": 1,
      "replies": {}
    },
    "hi26wap": {
      "link": "/r/college/comments/qf9nv6/cheap_online_college_vs_large_state_university/hi26wap/",
      "text": "The large college party hype/scene is a bit overrated. Although parties still happen, people in general are less sociable since covid. Honestly the only college partying is at frats and they’re just house parties with 18 years old. I don’t want you to be disappointed but I think you will be.\n\nAll that aside, you’d have better luck moving to a college near a city - large or not. You’ll make new friends after you adjust and you’ll have your own group to go to bars or throw your own parties which are much more fun. You’ll have a lot of exposure to new things.\n\nUltimately the choice is yours and that’s what makes it so hard. But it sounds like you regret not having a college experience.",
      "author": "milk1tea",
      "created": 1635211530,
      "upvotes": 1,
      "replies": {
        "hi29spr": {
          "link": "/r/college/comments/qf9nv6/cheap_online_college_vs_large_state_university/hi29spr/",
          "text": "I'm confused bro can't tell whether your saying going back is a good or bad idea. I agree that especially since covid people aren't talkative hell it was bad even when I was going to college and that was 2012 to 2016. I think its mainly due to technology, or people being overly focused on their degree and not wanting to make friends or really stuck up peole that want to stay in their own clique. My last college was almost like high school 2.0 though idk if every college is like that.\nI've also had trouble even finding anyone to meet my age after college. Most of the women I've dated have been 35+ just because that's the only age I can find in my area. I did date one that was 24, but I could obviously tell the the immaturity. And when I would throw 90s music or cartoon references: for instance she didn't know who notorious big was or what hey Arnold or all that cartoons were.\n\nI could also picture more people in their early 20s being untalkatice and always on their phones. It was bad in 2014, but I went to college pre tik tok so I can only imagine the hell that brings to relationships.\n\nBut besides that though the problem is where else can I meet people. I can go to work, but you can never get too close to coworkers because their either too focused on work or they'll backstab me for promotions. Most of my neighborhood is full of older boomer retirees. I could go to a club but I feel like it would be weird going by myself and it'd just be hi bye type stuff so idk what to do lol?\n\nI could move like you said but id have to give up my job, take an income hit and go to school for 2.5 years which doesn't seem to make much sense when I can finish an online degree in 6 months without driving to class or moving. What do you think though?",
          "author": "ElectricOne55",
          "created": 1635212846,
          "upvotes": 1,
          "replies": {
            "hi2w9lo": {
              "link": "/r/college/comments/qf9nv6/cheap_online_college_vs_large_state_university/hi2w9lo/",
              "text": "Take the online college and move to a new city after. Save some money because the college experience will be disappointing and the people are immature. You can always go for your masters after you move and you’d definitely meet older people doing their masters.",
              "author": "milk1tea",
              "created": 1635225247,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}