{
  "sid": "qmdpdj",
  "link": "/r/college/comments/qmdpdj/why_do_some_profs_barely_teach_during_lectures/",
  "title:": "Why do some profs barely teach during lectures, then give out really difficult assignments?",
  "text": "My one prof is always the ‘fun teacher’ during lectures. He jokes around and talks about interesting stuff during class which is awesome...\n\nUntil it comes time to do assignments. Now all of a sudden I’m trying to learn all these concepts for the first time from a text. Plus the assignments are quite difficult, and he marks very hard.\n\nWhy would our prof waste our lecture time knowing how much work we have to put into the assignments ?",
  "author": "weeb_d3stroyer",
  "created": 1636003717,
  "updated": 1636137376,
  "over_18": false,
  "upvotes": 18,
  "upvote_ratio": 0.83,
  "comments": {
    "hj9dbbf": {
      "link": "/r/college/comments/qmdpdj/why_do_some_profs_barely_teach_during_lectures/hj9dbbf/",
      "text": "One of my professors is teaching as if someone is forcing them to. During the class, she pauses a lot, reads everything form the PowerPoint, when someone asks something, she opens the page the question was related and reads it aloud, plus, we are taking it online. When she gives us assignments it’s nothing like the class, it is so complicated and difficult. So- I really don’t know what to do. I have to study literally everything to answer a bunch of questions. I guess they are really everywhere.",
      "author": "philosophussapiens",
      "created": 1636015773,
      "upvotes": 9,
      "replies": {}
    },
    "hjb33pt": {
      "link": "/r/college/comments/qmdpdj/why_do_some_profs_barely_teach_during_lectures/hjb33pt/",
      "text": "Well your supposed to read and understand the text BEFORE you go to class regardless. Lecture is supposed to be where you reinforce your understanding and to ask questions. \n\nIt sounds like he’s misusing lecture time, but your also not preparing properly for the assignments",
      "author": "LHRXPONCHITO69",
      "created": 1636047231,
      "upvotes": -3,
      "replies": {
        "hjbrqqh": {
          "link": "/r/college/comments/qmdpdj/why_do_some_profs_barely_teach_during_lectures/hjbrqqh/",
          "text": "Many 'lecturers' are forced to teach in order to get more research hours. They half arse lessons as a result",
          "author": "reenigneerutuf",
          "created": 1636056900,
          "upvotes": 4,
          "replies": {}
        }
      }
    }
  }
}