{
  "sid": "qeyvoe",
  "link": "/r/college/comments/qeyvoe/how_is_this_possible/",
  "title:": "How is this possible?",
  "text": "Im taking 12 credit hours, so just considered full time. I guess most on here take 15 credits and somehow have a full time job. Im not sure how anyone has time to finish every assignment let alone study. Lets take my math class, I usually get assigned 2-3 chapters a week, which take 10 hours to finish per chapter. Thats 20-30 hours a week just learning new information, then I have to study for 10 hours? so thats 30-40 hours a week. English class requires probably 5-10 hours, chemistry takes 5 hours in class then 10 hours study, IT class takes around 16-20 hours of learning but 3-4 hours to complete all of the assignments, so lets see, thats 69-89 hours a week. Possible? Yeah, if you want to take 30 years off of your life. I feel like im just too slow to do this, I know people who have really good grades, party all the time, work full time, and probably spend 10-20 hours if that on work a week. Its like im a \"slow reader\", it feels like when im on page one theyre done with the book. It seems like all you need is a photographic memory, because your \"learning\" never actually gets tested, its only what you remembered, I think the people who do well look at college as an algorithm to plug in equations, once you know the equations yourself, but the people trying to improve their logic, reasoning, and improve as a person came to the wrong place.  I could take less classes sure, but im already coming into college late, and I dont have any income for the years in im college, maybe if I took one class a year and had a full time job but id finish when im 40.",
  "author": "BurntnToasted",
  "created": 1635102684,
  "updated": 1635184186,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hhwh9dz": {
      "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhwh9dz/",
      "text": "In my experience, sometimes \"The more I have to get done, the more I am capable of getting done\" holds true. A lot of people don't realize how much unoccupied time they have until they get so busy that they are forced to be more efficient. Last year I felt like I was struggling to keep up with 14 credits and no extracurriculars. This semester I'm doing far better taking 17 credits as an athlete spending 20 hours a week at practices/the gym, plus a couple of clubs. It's weird but the fact that I don't have much free time has made me so much more efficient at getting my work done.",
      "author": "Jack_Rickle",
      "created": 1635105664,
      "upvotes": 17,
      "replies": {
        "hhwj50p": {
          "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhwj50p/",
          "text": "I can understand how that would work. My mom told me the same thing when she worked full time and went to college. I feel like my schedule is pretty full, but I guess youre right, I dont know what im capable of. Maybe ill sign up for some clubs or something.",
          "author": "BurntnToasted",
          "created": 1635106423,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhx4wis": {
      "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhx4wis/",
      "text": "it gets easier as you “specialize” into your actual degree more tbh. in my first year i had to take calc, physics, english, chemistry, and biology courses each semester and wouldn’t have been able to take more than that. right now i’m taking 21 credits (3 bio classes + 4 history classes), and i find it easier to not have to bounce around to 5 different subjects.\n\nyou also become more efficient at studying as you go, and learning what is actually helping you and what you just feel like you *should* do. in my first year i would not start reviewing for a test until i had rewritten all of my lecture notes so that they were nicer to look at, and if i wrote notes on slides then i would write those just in a notebook as well. that took a lot of time, and as much as i told myself it was helping me learn the info, it would’ve been a lot more beneficial to skip that step and just use my ugly lecture notes for active recall.\n\ntry to plan out your entire week at once with all the studying and homework you’ll need to get done, and look at all the gaps between classes as well as after class/weekends to see where you can fit tasks! if you have something that usually takes you 2 hours, and you have a one hour break between lectures, then start it during that break. once i started doing this, and assigning things to specific days rather than just hoping i get it all done at some point, i found myself with a lot more free time than i ever did last year",
      "author": "hannah_nj",
      "created": 1635115947,
      "upvotes": 6,
      "replies": {}
    },
    "hhwah4v": {
      "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhwah4v/",
      "text": "I think you should ask those people you say have good grades, full time jobs and party all the time.",
      "author": "GoldRequest",
      "created": 1635102929,
      "upvotes": 5,
      "replies": {
        "hhwayzr": {
          "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhwayzr/",
          "text": "That would certaintly be the most logical solution, lol! Im afraid the answer is \"cause im smart, and youre a dumbass, please go work at the local minimum wage job you loser\"",
          "author": "BurntnToasted",
          "created": 1635103129,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhyi5ys": {
      "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhyi5ys/",
      "text": "You need to learn to be more efficient instead of trying to create  time that isn't there. For example, if you are spending 10 hours per math chapter for 2-3 math chapters, and then still need 10 hours to study, you aren't learning the material. Doing the work is learning it while studying is reviewing what you've already learned. It shouldn't take anywhere near 10 hours to review material you already know, so something is getting lost in translation when it comes to working the material and actually learning it. This is where your counseling and/or tutoring departments could prove to be a God's send.",
      "author": "Mammoth-Title-2102",
      "created": 1635144249,
      "upvotes": 5,
      "replies": {}
    },
    "hhwd17g": {
      "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhwd17g/",
      "text": "It's possible if you do online courses. \nAlot of the time it's 3am in the morning.\n\nYou have to be careful about mandatory modules though, where you must come in.",
      "author": "Impressive-Name5129",
      "created": 1635103972,
      "upvotes": 2,
      "replies": {
        "hhwdzhz": {
          "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhwdzhz/",
          "text": "I am doing online courses! The math class is online, and so is the IT class. Nothing is over zoom, its all self led, you teach yourself everything from a book. If you have questions, you have to write them over email. Its so bad. The IT class is so bad I think im just looking up answers to the test. Unfortunately I cant do that for my math class since math is actually useful.",
          "author": "BurntnToasted",
          "created": 1635104351,
          "upvotes": 1,
          "replies": {
            "hhxx56c": {
              "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhxx56c/",
              "text": "I’m taking 18 credits and working full time- the answer for me is to work midnights at a job I can do homework at. I work 10hr shifts 4 shifts a week. That’s 6-8hrs of homework every night plus homework on my nights off. Honestly it’s the only way I could do it.",
              "author": "Slow-Ad1099",
              "created": 1635130229,
              "upvotes": 2,
              "replies": {}
            },
            "hhwessd": {
              "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhwessd/",
              "text": "It also depends on the course as well",
              "author": "Impressive-Name5129",
              "created": 1635104669,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhwtmcq": {
      "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhwtmcq/",
      "text": "I work around 24-34hrs and im in the army reserve. You only need 7 hrs sleep. So if you have 17hrs a day.\n\nMy buddy does his classes while at work cause his job is very slow.\n\nLife sucks, but you find a way to juggle.",
      "author": "guy_with-thumbs",
      "created": 1635110805,
      "upvotes": 2,
      "replies": {}
    },
    "hhxo80n": {
      "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhxo80n/",
      "text": "same! I need to know how they're doing it. I may have to work more hours soon",
      "author": "TragicalKingdom",
      "created": 1635125621,
      "upvotes": 2,
      "replies": {}
    },
    "hhybyyw": {
      "link": "/r/college/comments/qeyvoe/how_is_this_possible/hhybyyw/",
      "text": "Keep in mind that you're in control of your own goals. Those folks that talk down to you aren't worth your time. It's rough now, but it will be worth it when those goals are met and you have that degree. I thought it was crap when I first started college, but if your college offers something along the lines of a \"college success course\" it will help greatly with assisting you in structuring your study habits.",
      "author": "FitManufacturer798",
      "created": 1635139412,
      "upvotes": 1,
      "replies": {}
    }
  }
}