{
  "sid": "qr1st8",
  "link": "/r/college/comments/qr1st8/failing_and_want_to_drop_out_what_do_i_do/",
  "title:": "Failing and want to drop out. What do I do?",
  "text": "This is my 3rd year in college and I was excited to get back after COVID and online school. That excitement wore off and I realized I was just ready to leave my parents' house. I've been online since halfway through freshman year and I hadn't declared a major by then and I didn't feel any strong attachment to the classes I waa taking online. So I'm still \"undecided\" and taking gen eds. I failed all of them last semester, because mentally, things got pretty bad for me. Once I got back on campus, this semester, I started off really well. I was going to class daily (on time), completing all of my assignments, and even had pretty good relationships with my professors. \n\nOne day, I just stopped showing up and it's been about a month and a half since I've been to class. I stopped talking to my professors and even begin lying to my parents saying I was going to class/doing assignments regularly. \n\nI had a visit from the Residence Director, who was checking on me to ensure I was okay. I have anxiety that he's going to come back and something bad will happen or I'll get in trouble for skipping class.\n\nIf I drop out, I'll live with a friend until I can find a job and can afford an apartment. I want to save up for a car and some recording equipment so I can persue music full time. \n\nWhat do I do?",
  "author": "Old_Rub_",
  "created": 1636571667,
  "updated": 1636655151,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hk3sbnn": {
      "link": "/r/college/comments/qr1st8/failing_and_want_to_drop_out_what_do_i_do/hk3sbnn/",
      "text": "I’ve gone through something similar two years in a row. The first year I just withdrew and took a medical leave of absence. That’s what I would recommend doing first. Just a leave of absence. It gives you some time to figure out what you really want to do. It’s easier to come back from a leave of absence than it is from just dropping out.",
      "author": "skeeg153",
      "created": 1636571836,
      "upvotes": 3,
      "replies": {
        "hk3tdfh": {
          "link": "/r/college/comments/qr1st8/failing_and_want_to_drop_out_what_do_i_do/hk3tdfh/",
          "text": "Would any scholarship/funding I haven't already lost still be available when I come back?",
          "author": "Old_Rub_",
          "created": 1636572241,
          "upvotes": 1,
          "replies": {
            "hk3tjym": {
              "link": "/r/college/comments/qr1st8/failing_and_want_to_drop_out_what_do_i_do/hk3tjym/",
              "text": "For me it was especially because it was a medical leave but every institution is different. Contact your financial aid office. They can help.",
              "author": "skeeg153",
              "created": 1636572312,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}