{
  "sid": "rhglu9",
  "link": "/r/college/comments/rhglu9/im_failing_classes_and_i_dont_know_what_to_do/",
  "title:": "i’m failing classes and i don’t know what to do with my life anymore.",
  "text": "i’m a freshman in college and i always excelled in high school. i thought i would at least do decently well in college. i was wrong. my mental health is down the drain and it feels like everything around me is crumbling. i always thought i wanted to be a doctor but then i failed almost all of my classes first semester and i’m considering dropping out but i don’t know what to do. it seems like becoming a doctor is just unrealistic at this point and my brain can’t handle the idea of that. i thought about applying to the school that’s closer to where i’m from but i don’t even know what that would solve. someone please just offer some advice. anything. i’m desperate.",
  "author": "sick-and-twisted1",
  "created": 1639623172,
  "updated": 1639787802,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.9,
  "comments": {
    "hoqepit": {
      "link": "/r/college/comments/rhglu9/im_failing_classes_and_i_dont_know_what_to_do/hoqepit/",
      "text": "My advice: log off Reddit and do something else for a day. Then you can start to make better, non stressed decisions. Plenty of people don’t go on to medical school and have good careers and lives. \n\nTransferring schools, where you’ll basically be starting over, doesn’t seem to make sense. One way to end up with tons of debt is to have lots of major changes, dropped classes and transferring schools",
      "author": "dalej42",
      "created": 1639624184,
      "upvotes": 8,
      "replies": {}
    },
    "hoqf0p8": {
      "link": "/r/college/comments/rhglu9/im_failing_classes_and_i_dont_know_what_to_do/hoqf0p8/",
      "text": "College can be an overwhelming experience.  Take a deep breath and do some reflection on why this semester was such a challenge.  Many people can recover from a bad semester and still fulfil their dreams.  Have you met with a pre-med advisor to consider other medical careers?  Working towards goals in small increments can help make them more manageable.   Could you work towards a LPN or scrub tech degree to get into the medical field and see if it is what you really want?  I'm in PA school right now but it took a lot of hard work and overcoming MANY challenges to get here.  If it's what you really want don't give up and don't be afraid to ask for help!",
      "author": "Inevitable-Amoeba-88",
      "created": 1639624324,
      "upvotes": 3,
      "replies": {}
    },
    "hoqpy1d": {
      "link": "/r/college/comments/rhglu9/im_failing_classes_and_i_dont_know_what_to_do/hoqpy1d/",
      "text": "Hi! I feel the same! Try posting on pre med Reddit when you finally destress. And besides…it’s just your first semester of college. You have plenty of chances to bring your grades back up!",
      "author": "SooshiMoon",
      "created": 1639629604,
      "upvotes": 2,
      "replies": {}
    },
    "hor58t3": {
      "link": "/r/college/comments/rhglu9/im_failing_classes_and_i_dont_know_what_to_do/hor58t3/",
      "text": "hello again and thank you to everyone who responded. i am a bit calmer now lol and i appreciate all that you have said. i also realized that i forgot to mention some important details. one of the main reasons i’m thinking of transferring is because of money. the school i go to is really expensive and my parents are constantly on my ass about loans and money so if i transferred it would be to a cheaper school. as far as my career path goes, i’m still very undecided. i do like medicine, but there are so many other things that i’d like to explore like business or writing. i just don’t know",
      "author": "sick-and-twisted1",
      "created": 1639638948,
      "upvotes": 2,
      "replies": {}
    },
    "horymp7": {
      "link": "/r/college/comments/rhglu9/im_failing_classes_and_i_dont_know_what_to_do/horymp7/",
      "text": "You did well in high school because you’re smart and life was scheduled for you. Unfortunately, you never learned how to manager your obligations nor did you learn how to study.\n\nJust take a breath and know things will be ok. I was exactly where you were 15 years ago (1st semester gpa of 1.2). I’ve got a house, great career, and big salary. \n\nOnly take 12 credits next semester. Make sure you attend every class no matter what. Don’t play video games. Start eating healthy now and develop an exercise routine - running is usually an easy one. \n\nNext semester, pay attention to how you learn best. Do you learn by listening, by rewriting notes, by reading the textbook, or by working through problems? Once you know how you learn best, you can develop how you study best.",
      "author": "peakfreak18",
      "created": 1639660474,
      "upvotes": 2,
      "replies": {}
    }
  }
}