{
  "sid": "r7gqgg",
  "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/",
  "title:": "Do my professors think I'm lying when I say I'm struggling due to mental health?",
  "text": "And a follow up:  Do professors expect me to disclose extremely personal information to them in these situations?  Why aren't official accommodations enough to \"prove\" that I'm telling the truth?\n\nI just looked at the professors sub and seeing them laugh at students using mental health as an \"excuse\" at the end of the semester was worrying for me.  I have accommodations through my university for attendance/deadlines.  This semester, I used them less than I have in the past, and it has only been the last week or so that things have started piling up to an unmanageable point.\n\nI'm a good student and I'm passionate about my major.  I feel guilty every single time I can't get myself to go to class or I can't finish an assignment on time.  When I ask for an extension, I mention that I'm struggling mentally because I'm not sure how else to make sure they know I'm not a lazy kid who doesn't care.  Do they think that I've been making it up the whole time?\n\nProfessors always say \"you need to communicate with us if you want us to help you\" but I don't think I should have to tell a person I barely know \"Hi, my medication isn't working and I can't get an appointment to try to fix it until after finals.  Also I haven't showered in three days and today I barely had the energy to eat so I unfortunately wasn't able to complete my assignment.\"",
  "author": "emomotionsickness2",
  "created": 1638477565,
  "updated": 1639853900,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmz8nue": {
      "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmz8nue/",
      "text": "Lying? No they just think you're incompetent or irresponsible.",
      "author": "noogiey",
      "created": 1638477820,
      "upvotes": 1,
      "replies": {
        "hmz8t8k": {
          "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmz8t8k/",
          "text": "Well yeah, they'd think I was lying because I'm incompetent or irresponsible",
          "author": "emomotionsickness2",
          "created": 1638477878,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmzdofv": {
      "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmzdofv/",
      "text": "> just looked at the professors sub and seeing them laugh at students   \nusing mental health as an \"excuse\" at the end of the semester was   \nworrying for me.  \n\nYou have accommodations - that's entirely different.  No one (save for a couple of posters that I've seen) has any issue with students with officially acknowledged mental health concerns.  What they've been complaining about are the *self-diagnosed* cases of students who've announced that they've got mental health issues without any official documentation, yet they expect full accommodations.  That's not how it works.\n\nYou don't *have* to tell any of your instructors your specific issues.  If you have the official documentation, then the Student Disabilities Office is the only agency that needs to know, and they will inform the professor of what needs to be done (not what is affecting you).  A professor can ask (which is outrageous, tbh), but you're not obligated to divulge, nor should you feel intimidated or pressured to do so.\n\nFor the record, when a student tells me that they've got issues, I take them at their word until they demonstrate that my faith in them is misplaced.  That said, legally, I still cannot alter a class's requirements for a student claiming any sort of health issue without the official documentation from the Student Disabilities Office.",
      "author": "DeskRider",
      "created": 1638479698,
      "upvotes": 1,
      "replies": {
        "hmzzm3h": {
          "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmzzm3h/",
          "text": "Do you guys get annoyed when someone with accommodations uses them a lot?  I was fine most of the semester but in the past few weeks I've had to ask for extensions a few times.  I always get the work in by the agreed upon date, but I can't help feeling worried that the professor thinks I'm taking advantage or that I'm being lazy.",
          "author": "emomotionsickness2",
          "created": 1638488530,
          "upvotes": 2,
          "replies": {
            "hn0a74q": {
              "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn0a74q/",
              "text": "If you've got an accommodation, then you have an accommodation - my feelings on the matter are irrelevant.  But to answer your question, no, it's never bothered me that accommodations are used, whether once or a thousand times.  \n\nIf there's an issue for me, it's the student who waits until three minutes before an exam to declare that they have a test accommodation.  In that case, the student would have to test in a quiet area in another part of the campus, and such a late notice would make it impossible for me to get a test to the site (or for the site to prep for the student).  Usually, the Student Disability Office briefs students so that this is avoided, but it's happened and it makes for a lot more work for everyone (especially the student) involved.\n\nBut again, if you've got an official accommodation, then use it and don't worry about what anyone else might think.",
              "author": "DeskRider",
              "created": 1638493303,
              "upvotes": 7,
              "replies": {
                "hn0agbk": {
                  "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn0agbk/",
                  "text": "Thank you for giving a helpful and kind response, it was nice to get this perspective.",
                  "author": "emomotionsickness2",
                  "created": 1638493419,
                  "upvotes": 1,
                  "replies": {
                    "hn0bu79": {
                      "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn0bu79/",
                      "text": "Good luck, and please - stop worrying!",
                      "author": "DeskRider",
                      "created": 1638494048,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hn04n0w": {
              "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn04n0w/",
              "text": "its annoying if you're requesting them the same day the assignment is due.",
              "author": "wobbletelescope",
              "created": 1638490771,
              "upvotes": 5,
              "replies": {
                "hn05j0w": {
                  "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn05j0w/",
                  "text": "That doesn't really answer my question.  The only requirement of the accommodation is that I email before the time the assignment is due. \n\nI'm not sure why that is so annoying to you.  It's pretty obvious that a student with depression/ADHD/etc may put off an assignment until the last day thinking they'll be able to get it done in time.  And like I mentioned, those conditions or the way we are made to feel for having them might lead us to avoid asking because of guilt or embarrassment.  All I'm thinking about while I'm sending that email is that I messed up again and it isn't a fun feeling.",
                  "author": "emomotionsickness2",
                  "created": 1638491177,
                  "upvotes": 4,
                  "replies": {
                    "hn06jyd": {
                      "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn06jyd/",
                      "text": "you can't possibly expect people to check email 24/7. people check it like maybe 3 times a day, and that's it. if you ask in the middle of the night right before the assignment is due, then you almost surely aren't going to get it because there's just no way the professor is going to stay up until 11:59 PM watching email.",
                      "author": "wobbletelescope",
                      "created": 1638491649,
                      "upvotes": 5,
                      "replies": {
                        "hn07cmg": {
                          "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn07cmg/",
                          "text": "My accommodations that are protected by law are not dependent on how often you check your email.\n\nIf you give us assignments due at 11:59, why shouldn't you be up until that time checking emails?  Same as when professors say they don't check email on weekends but then assign us homework due on weekends.   We have obligations outside of your class just like you have obligations outside of being our professor.  If you think it's unreasonable to expect someone to be up all hours of the night working, why would you continue to give 11:59 deadlines when you know most students are going to submit it close to that time?\n\nAnd one top of that, why do professors always complain about people submitting close to a deadline?  It's literally the time you provided.  If you don't want people to be emailing you in the middle of the night, don't make things due in the middle of the night.  We don't make the syllabus, you do.",
                          "author": "emomotionsickness2",
                          "created": 1638492008,
                          "upvotes": -1,
                          "replies": {
                            "hn0egcv": {
                              "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn0egcv/",
                              "text": "im not a professor, but they provide the due date at 11:59 as a *convenience* for students who may have other obligations during the day such as work-study or other classes. likewise with weekend due dates. because students like to have more time to work on assignments. not everyone is as privileged as you.\n\nand careful with the wording — it's *reasonable* accommodations that are protected by law. not \"whatever i want, whenever I want\" accommodations.",
                              "author": "wobbletelescope",
                              "created": 1638495213,
                              "upvotes": 6,
                              "replies": {
                                "hn0fgjh": {
                                  "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn0fgjh/",
                                  "text": "That doesn’t change anything??? If they set it for our convenience then they know we’ll be working on them.  At the very least they shouldn’t be annoyed about receiving emails late at night when they know we’ll be working late at night. \n\nMy REASONABLE accommodation says I can use it as long as I email before the deadline.  If 11:59 is the deadline, I can email any time before that.",
                                  "author": "emomotionsickness2",
                                  "created": 1638495658,
                                  "upvotes": 4,
                                  "replies": {
                                    "hn0gaf4": {
                                      "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn0gaf4/",
                                      "text": "ok, you have fun with your imaginary super-professor that apparently has no personal life besides answering your 11:58 PM emails before the deadline.",
                                      "author": "wobbletelescope",
                                      "created": 1638496025,
                                      "upvotes": 4,
                                      "replies": {
                                        "hn0gif8": {
                                          "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hn0gif8/",
                                          "text": "Idk how you’re missing the point this badly. \n1. Students have personal lives too\n2. I don’t care if a professor answers me by 11:58.  I care if they complain that I am sending an email before their deadline that they set",
                                          "author": "emomotionsickness2",
                                          "created": 1638496122,
                                          "upvotes": 3,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmzxuj9": {
      "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmzxuj9/",
      "text": "If you have official accommodations through your university’s accessibility office, then your professors legitimately *have* to respect those. That is the whole point of that office: to be a point of contact and “legitimacy” between students with accommodation needs and professors. It can be a big, big deal when professors are aware of these documented needs and choose not to handle them accordingly.",
      "author": "steveasaurous",
      "created": 1638487762,
      "upvotes": 14,
      "replies": {}
    },
    "hmzw48n": {
      "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmzw48n/",
      "text": "I always just say “health issues”, it’s still accurate but it gets taken more seriously. I also feel like people think it’s more acceptable to be vague about health in general than it is to be vague about mental health",
      "author": "when-words-fail",
      "created": 1638487027,
      "upvotes": 6,
      "replies": {}
    },
    "hmzz0qr": {
      "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmzz0qr/",
      "text": "You need accommodations.",
      "author": "GenXtreme1976",
      "created": 1638488271,
      "upvotes": 2,
      "replies": {
        "hmzz9ed": {
          "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmzz9ed/",
          "text": "I have accommodations....and I've received more judgement and questioning from professors since I've gotten them than I did before I had them",
          "author": "emomotionsickness2",
          "created": 1638488375,
          "upvotes": 1,
          "replies": {
            "hmzzc6f": {
              "link": "/r/college/comments/r7gqgg/do_my_professors_think_im_lying_when_i_say_im/hmzzc6f/",
              "text": "Oooooooo, they could get in trouble!!!  Maybe report them to SDS?",
              "author": "GenXtreme1976",
              "created": 1638488409,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}