{
  "sid": "qswzf7",
  "link": "/r/college/comments/qswzf7/im_just_not_cut_out_for_college_i_guess/",
  "title:": "I'm just not cut out for college I guess.",
  "text": "I'm a junior. \n\nI just can't get good grades on assignments or tests. I am studying about 90% of my waking life (excluding survival activities such as eating, cleaning, showering etc.). \n\nI study for 45mins then break for 15. I have my timer judt going round and round all day.\n\nI dream about calculus (that'show much time im studying). My teacher is giving me failing grades on homework over minor notation errors. \nMy most recent assignment I got another failing grade even though I had a tutor who taught Calc for years do it with me. I have no fucking idea what's wrong or what to do.\n\nI'm developing physical stress tics. Im physically shaking when I do my hw at this point intermittently. I'm in loan debt so if I fail this class my life is just fucked. I quit my job to pursue college. \n\nI put everything on the line and I've been giving it everything but it looks like I'm losing. My health is spiraling out of control because I'm stress eating. I fucking am trying my hardest to make a better life for my wife and I. My major is computer science.\n\nI want to put a bullet in my throat and never wake up. But perhaps I'll ask tips? (Yes I go to therapy)",
  "author": "UnstoppableHeart",
  "created": 1636792472,
  "updated": 1637181975,
  "over_18": false,
  "upvotes": 22,
  "upvote_ratio": 1.0,
  "comments": {
    "hkg8s87": {
      "link": "/r/college/comments/qswzf7/im_just_not_cut_out_for_college_i_guess/hkg8s87/",
      "text": "When you are studying are you actually just relying on the quantity of time? My tip is stop making it your goal to study 45 minutes per se. Instead make it a goal to nail the concept you are struggling with. Maybe it will take 20 minutes. One hour who knows. Watch YouTube and do a shit ton of problems. That’s how you assess your knowledge and get comfortable. You study this way and go into every exam expecting an A no less. Don’t cram. You want to be prepared a week before the actual exam at the very least.",
      "author": "kyeelee",
      "created": 1636806910,
      "upvotes": 18,
      "replies": {}
    },
    "hkgfl32": {
      "link": "/r/college/comments/qswzf7/im_just_not_cut_out_for_college_i_guess/hkgfl32/",
      "text": "I've posted this elsewhere but adapting your study habits to fit certain class requirements is especially helpful. Employing the same technique to study for a math course and an anthropology course just won't work, they both require a different set of skills. Give it a try to mix up how you study if there's another way. Flashcards can be helpful for memorization stuff. \n\nYou're going to fail things. It's fine. This isn't a one and done for everybody. I believe that college is more about discipline than intelligence any day. Keep with it. If you fail, adjust accordingly and try again. \n\nHow many credit hours are you taking? If you're taking more than 15, I'd seriously reconsider taking less. Quality of quantity! \n\nThere's some ridiculous power to convincing yourself that there's good coming out of this. It's probably difficult to speak upon the good things about returning to school. There are good things happening even in this moment of shit. Consider writing them down and forcing yourself to acknowledge these accomplishments. It may help shift the way your brain is perceiving things and help you focus and not be in a mental rut. \n\nMaybe pick up an anatomy course because I'm pretty positive a bullet to the throat would be the worst choice possible.",
      "author": "Awkward_Mail_2786",
      "created": 1636811249,
      "upvotes": 5,
      "replies": {}
    },
    "hkgywjm": {
      "link": "/r/college/comments/qswzf7/im_just_not_cut_out_for_college_i_guess/hkgywjm/",
      "text": "I would also like to point out you may have a learning disability or disorder (like ADHD, I'm diagnosed myself and some of that you're saying could be attributed to adhd). If nothing else your mental health is not so great based on what you're posting here. \nCan you access your institutions mental health care?",
      "author": "comfort_fiend",
      "created": 1636820694,
      "upvotes": 4,
      "replies": {}
    },
    "hkhmb1x": {
      "link": "/r/college/comments/qswzf7/im_just_not_cut_out_for_college_i_guess/hkhmb1x/",
      "text": "I have experienced similar things separately. I’m a math major so when I’ve been practicing problem solving for days like this 90% waking hours, I dream about solving them. It’s freaky. I also developed stress tics like eye twitches and hand spasms. I got rid of them by switching from premed to math although around exam weeks they often come back. You are doing everything you can so I want you to look at this and accept that it is beyond your control. Just accept that you have done everything you should have done and whatever happens happens. You will probably make it out, but the stress comes from feeling powerless so you must accept that you have no control over the situation beyond what you are doing.",
      "author": "Parking_Cranberry935",
      "created": 1636830715,
      "upvotes": 4,
      "replies": {}
    },
    "hkh5o26": {
      "link": "/r/college/comments/qswzf7/im_just_not_cut_out_for_college_i_guess/hkh5o26/",
      "text": "I dream about classes sometime too. \n\nI know it’s important that I relax and enjoy something every now and then so I won’t be so stressed when it comes to studying and classes. \n\nGood luck!",
      "author": "PassiveAggres-Thighs",
      "created": 1636823605,
      "upvotes": 3,
      "replies": {}
    },
    "hki8ikb": {
      "link": "/r/college/comments/qswzf7/im_just_not_cut_out_for_college_i_guess/hki8ikb/",
      "text": "I've seen friends turn around GPAs and motivation when they get into a major they enjoy. Might not be your specific issue, but worth considering.",
      "author": "zifmer",
      "created": 1636840218,
      "upvotes": 3,
      "replies": {}
    },
    "hkh4edt": {
      "link": "/r/college/comments/qswzf7/im_just_not_cut_out_for_college_i_guess/hkh4edt/",
      "text": "have you tried changing your study habits??",
      "author": "hopefulhammock0383",
      "created": 1636823070,
      "upvotes": 0,
      "replies": {}
    }
  }
}