{
  "sid": "qv4oe7",
  "link": "/r/college/comments/qv4oe7/picking_schedule_for_spring_should_i_take/",
  "title:": "Picking Schedule for Spring, should I take Macroeconomics MWF (50 minute classes) or one Tuesday class thats 2 hr 45 minutes",
  "text": "As of now econ is up in the air as I might be just taking it over the winter at my local community college instead of my university. However its between the shorter 50 minutes or the once a week long class. Assuming it will be lecture heavy so...",
  "author": "elementize",
  "created": 1637057627,
  "updated": 1637181439,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hku76z6": {
      "link": "/r/college/comments/qv4oe7/picking_schedule_for_spring_should_i_take/hku76z6/",
      "text": "If I were in this predicament, I know I wouldn't want to stop what I'm doing, get ready, and make an effort to be on time for this class three days per week when I can do such for one day per week instead. That's even worse to do three days per week if you're a commuter in a high-traffic area.\n\nProbably the only reason I'd go for the three days per week option over the other is if I had trouble focusing that was so significant to the point my grade in the class would suffer tremendously as a result. I've been in hours-long classes, and I know it can get restless, but there can be a difference between a long class being frustrating versus unconducive to learning.",
      "author": "yourangleoryuordevil",
      "created": 1637059046,
      "upvotes": 2,
      "replies": {}
    },
    "hkulu60": {
      "link": "/r/college/comments/qv4oe7/picking_schedule_for_spring_should_i_take/hkulu60/",
      "text": "It depends on your level of expertise in this macroeconomic subject. If you know you will do fairly well then go for the 3 hour class but if you will struggle a bit then choose the 3 day option. \n\nEven if you just suck at staying awake during boring classes do the 3 day one, I used to fall asleep constantly in my psychology class and I was not the only one 😂😂 but good luck to whatever you do!",
      "author": "NotoriousJez",
      "created": 1637068821,
      "upvotes": 1,
      "replies": {
        "hkwbqaz": {
          "link": "/r/college/comments/qv4oe7/picking_schedule_for_spring_should_i_take/hkwbqaz/",
          "text": "On psychology? Half of the book!&lt;ct",
          "author": "bingus_bingus_bingus",
          "created": 1637094360,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}