{
  "sid": "q2eoee",
  "link": "/r/college/comments/q2eoee/wheres_the_post_about_the_older_student_who/",
  "title:": "Where's the post about the older student who graduated and described ways universities are screwing over students in terms of unrealistic work culture/expectations or something?",
  "text": "An older student [i think a returning veteran?] who graduated + was working posted something along the lines about the how the nonsense students face in school wouldn't fly in the real-world, and that students are being patronized by dumbass policies that seemingly \"prEparE YoU FOr the rEAL worLD\" in ways high school teachers ruled with an iron fist to \"prEPARe you fOR COllegE\".\n\neg [not sure if this was the example but same energy] say, for example, professor is shrugging because you're potentially gonna get screwed over by your classmate who isn't holding their weight in your group project. in the real world, **you have a boss, HR, other sections, etc to complain to and professional channels that you can take to keep each other accountable through receipts.** obviously YMMV but universities build this expectation where everything is absolute. if you don't like your prof's policies (esp if you're pulling your weight), go to the damn chair or something. make noise. learn how to push back now bc people do it all of the time in the real world. \n\nnow that i've graduated + am working outside of academia, i've struggled to take up space because i was so subservient in college. i took my professor's word for gospel. not saying that jobs/industry are readily flexible and not as absolute but my point is you have more power, a voice, and space to take as long as you pursue appropriate channels to negotiate, acknowledge that there's space to take up, or straight up challenge something dumb. my god...people at facebook are literally testifying in congress. \n\ni had an advisor who screwed me over bc he fucked up my pre-requisite sequence for some classes. fortunately i had this exchange in writing so i brought it up to the chair and got it excused, but he was adamant and defensive about his shit advising even though it was clearly wrong. i almost graduated a semester late had i not pushed back. i switched advisors after that, and like the real world, you can switch jobs. you don't have to stay in the same position, and even if you wanted to (bc of benefits, etc), then know that you can/should make good trouble. you have more mobility. \n\nthere are consequences (eg you can get fired) but my point is...if you don't like something, do something about it.",
  "author": "pseudoname123",
  "created": 1633501725,
  "updated": 1634083735,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.63,
  "comments": {}
}