{
  "sid": "hmy8ts",
  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/",
  "title:": "Should I take a COVID gap year?",
  "text": "I'm entering a very small, liberal arts college in the fall. As of right now, my school plans on reopening in early September for in-person classes, with two weeks of online classes after Thanksgiving. Social-distancing will be in effect, which means most social gatherings and clubs (ie. theatre) will not occur. I'm scared that our school is going to go virtual mid-semester, meaning I will be paying for sub-par online classes. I'm equally scared about my social life. I'm usually a pretty reserved person.  I was hoping the social events at college would give me a push into new friendships. My school isn't even giving us roommates. I don't want to be so secluded that my already crappy mental health takes another plunge. That being said, I'm not sure if staying at home will be better or worse. I know all I will do is spend time with my family and work- I've even been offered a position as a supervisor at my job, as long as I'm still at home. My parents think that, since so many people are taking a gap year this year, I will have an advantage in the job market after college. This is probably true, but I also think it would be a bad idea to pay for an education that is not the experience I would otherwise have.\n\n&#x200B;\n\nI'm not sure what to do. There are pros and cons to both sides. Any advice?",
  "author": "Mammoth_Move",
  "created": 1594140702,
  "over_18": false,
  "upvotes": 583,
  "upvote_ratio": 0.97,
  "comments": {
    "fxh6ual": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxh6ual/",
      "text": "I just decided today that I would go to community college my first year due to all the covid stuff. I'm not taking a gap year im just enrolling in community college for my first year. I just don't  think that I'm going to enjoy myself my first year with all thats going on yes college is about work but its also about being social. I just say go the cheaper route (my college only took 10 percent off my fall tuition when we are leaving early)",
      "author": "Wonderful_Ad5829",
      "created": 1594337763,
      "upvotes": 1,
      "replies": {}
    },
    "fxbmv0i": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxbmv0i/",
      "text": "Bucking the trend and going to say no because compared to regular in-person classes the instructors have been lenient as hell. \n\nMy suggestion is to take the minimum number of credits you can take of the required non-degree classes.\n\n&#x200B;\n\nI say minimum number because for a lot of people keeping up with the coursework is actually really difficult when you don't go to the class in person. Also it's really hard to pay attention for more than an hour to online videos and lectures. I did 4 classes last term and had to drop one. It was easy but jesus christ it felt like I did nothing but sit infront of my computer 24/7. \n\n&#x200B;\n\nAnd I say to take your non-degree classes because the quality of these classes (in my experience) has been lower than in-person classes. You simply don't get as much out of them as you do as in-person classes. This is totally fine for the bullshit extra stuff the college makes you take that has nothing to do with your degree. But for degree related classes, you're really going to benefit in your upper division courses if you get everything you can out of your lower division courses.\n\n&#x200B;\n\nMany of the classes has been borderline jokes. For an archaeology class we're suppose to do field work but because of the lockdown we just had to visit a website. For a communications class a classmate told me how instead of a speech they just had to record themselves giving the speech. For an architecture class we're suppose to go on field trips but because of the lockdown we just had to go out and drive by the building. And for the writing courses the instructor says 6 pages but when people turn in 4 they were like \"okay whatever that's fine\"\n\n&#x200B;\n\nThese lockdown terms are almost freebies. \n\n&#x200B;\n\nYour mileage may vary though. Top tier schools might be hardasses about it.",
      "author": "mesoTAgg",
      "created": 1594223176,
      "upvotes": 1,
      "replies": {}
    },
    "fxbmts0": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxbmts0/",
      "text": "Please help Michigan State University to decrease tuition due to online learning!!\n\n[https://www.change.org/msutuitiondecrease](https://www.change.org/msutuitiondecrease)",
      "author": "perezga9",
      "created": 1594223158,
      "upvotes": 0,
      "replies": {}
    },
    "fxany4e": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxany4e/",
      "text": "i decided to not go to my university this year and take community college online. my school is making us have classes 6 days a week into nighttime, we are stuck on the same floor with 10 assigned “friends” (these are the only people i’m allowed to eat with, see, etc), i cant leave campus AT ALL, can’t have visitors, can’t leave my dorm unless it’s for essentials or class, etc. just not worth me paying 10k for. but i didn’t want to take a gap year bc finding motivation would be difficult again.",
      "author": "bandsandstories",
      "created": 1594199129,
      "upvotes": 3,
      "replies": {}
    },
    "fxa4yfs": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxa4yfs/",
      "text": "Here’s some advice that heeded me very well, from a very worldly professor, when I had nearly half of my college done in high school and wanted to take a gap year:\nNo one cares about how young you graduate. As a matter of fact, you might actually struggle, because no one wants to be the first to take a chance on a 19 year old grad. Thus, take advantage of any real opportunity you have TO move forward, but also use your advantage to be more thorough with your education. \n\nI took a year and a half gap period- I moved out, became financially independent, traveled a lot, learned a language, started a nonprofit in my field (that I discovered my love for in my gap year), got experience in other fields, and, at the end of it, was excited to go back to school - because I had an extremely clear vision of what it is I needed to learn, and went back to university with incredible force that had lasted me to my accelerated graduate degree. Now I read books and study my coursework and article citations like mad, so COVID was, as horrible as it is to say, fantastic timing for me to just focus on my studies.\n\nIs it possible for you to do a semester or two and then take a gap year, when there’s more things open?\n\nI’m curious - why are you already thinking about being an asset in the job market? If anything in the world was possible, and success was guaranteed, would this track your looking at be the one you take?\n\nOne thing if you take a gap year; make sure you are the type of person to actually go back. I knew beyond a shadow of a doubt I’d be back, but a lot of people I know say they wouldn’t trust themselves to - even though they are incredibly bright students.",
      "author": "al_the_time",
      "created": 1594182405,
      "upvotes": 1,
      "replies": {}
    },
    "fxa47rv": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxa47rv/",
      "text": "What I’ve read, the answer is no. Gap years are typically meant for travel, service, and/or job experience. Right now, traveling (esp. internationally for Americans) is out of the question. Service, which for the most part also requires traveling, isn’t really happening either. With COVID-19 also taking a toll of the economy, I don’t think many companies are hiring interns or generally high school grads.",
      "author": "friendsworkwaffles02",
      "created": 1594181880,
      "upvotes": 1,
      "replies": {}
    },
    "fxa2t51": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxa2t51/",
      "text": "If I were in your position, I would 100% take a gap year. Your first year experience will be vastly different with Covid, and your first year is supposed to be a great experience. Orientation week, getting to make new friends, going to on-campus events, are all things you’re going to want to experience. It definitely won’t be the same with Covid. I know a year is a long time to wait for college, but if you can do it, I would so you can hopefully have a good first year experience.",
      "author": "cynoshot",
      "created": 1594180902,
      "upvotes": 1,
      "replies": {}
    },
    "fxa1fxm": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxa1fxm/",
      "text": "I'm taking at least a gap semester and hoping that it won't turn into a full year. I'm not risking catching a brand new virus whose permanent health effects are still being discovered just for a degree. I'm still doing a research project for 3 credits though, since I can meet with my advisor online and the in-person research can be done with actual social distancing.\n\nI'm taking the extra time to study outside of classes and focusing on pushing my language skills in Japanese and German from intermediate to advanced, and throwing in a bit of French in the gaps.",
      "author": "StrawberyLavendarTea",
      "created": 1594179992,
      "upvotes": 1,
      "replies": {}
    },
    "fxa1cwz": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxa1cwz/",
      "text": "I'm transferring to university from CC this semester after graduating from there in the spring. It is really, really not ideal, but what are you going to do. I am full time right now, with the understanding that my classes are going to have a hybrid format. I'm sure my first university semester won't be the same as it would have been pre-pandemic, but I am going to try to make the most of it. I for sure thought about taking a gap semester or only taking a few classes if we were all online because I've completed all of my gen-eds already. Online classes just don't work for me and feel kind of arbitrary to me, which sucks, because I give everything I have for my classes. \n\nWe will see what happens I guess.",
      "author": "What-the-heck-Craig",
      "created": 1594179935,
      "upvotes": 1,
      "replies": {}
    },
    "fx9yri6": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9yri6/",
      "text": "If you’re too mentally stress and need time to recalibrate, then absolutely take a gap year, as this would be better than failing and retaking classes. If you are comfortable with your life situation that you can continue to preform well and know exactly what career to pursue then stay in school.\n\nPlease don’t base your decision on socializing.  Online Education could very well become the new norm in this new world.\n\nOne alternative is taking the supervisor position and taking online classes at least part-time?",
      "author": "JonathanL73",
      "created": 1594178268,
      "upvotes": 2,
      "replies": {}
    },
    "fx9ybyu": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9ybyu/",
      "text": "Short answer: if you trust yourself to stay productive, yes",
      "author": "DoNotEatMySoup",
      "created": 1594177996,
      "upvotes": 2,
      "replies": {}
    },
    "fx9wr81": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9wr81/",
      "text": "I think a gap year is fine. I want to take one because I don't feel like paying full price for non of the experience. I don't just mean event.\n\nWe can't network as well with students or teachers.\nTutoring or study groups is either very difficult or impossible.\nSome people don't have internet connect all the time.\nEvents are difficult enough as is. But how are you going to mingle with people when conferences are over, normally you would walk up to them and introduce yourself. Zoom is different and it doesn't have the same impact as talking to people in person.\n\nThe opportunity is there, but it's not the same",
      "author": "lordmoldybutt42",
      "created": 1594177007,
      "upvotes": 2,
      "replies": {}
    },
    "fx9v2dj": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9v2dj/",
      "text": "I was supposed to enroll in my graduate program for Fall 2020 but decided to defer it to Fall 2021. My campus have repeatedly assured me that they will follow strict health protocols but I'm not buying it so yeah. \n\nIn the meantime I'm applying part time jobs because sitting on my ass for nearly a year without income is waste of time.",
      "author": "ayamgorengkriuk",
      "created": 1594175990,
      "upvotes": 1,
      "replies": {}
    },
    "fx9rifr": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9rifr/",
      "text": "You should just not go to the small LAC in the first place imo, I went to one and it was awful, but all the things you highlighted in this post will be even worse. I would recommend at least taking a gap year",
      "author": "the_lord_of_shum",
      "created": 1594173879,
      "upvotes": 0,
      "replies": {}
    },
    "fx9q8qj": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9q8qj/",
      "text": "Honestly make the most of your experience. However we still don’t know what’s going to happen. Maybe defer for a semester instead and see how things go?",
      "author": "mokenz",
      "created": 1594173121,
      "upvotes": 1,
      "replies": {}
    },
    "fx9q78s": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9q78s/",
      "text": "look no doubt it sucks right now but the longer you stay in college or the longer it takes you to graduate the more you pay. \n\nalso, I dont know about you but, if i took a year off i would forget a bunch of shit. learning from scratch aint fun.  suck it up and consider just getting it over with so that by the time this is over youll be way ahead of your peers.",
      "author": "Watevaimlaggin",
      "created": 1594173098,
      "upvotes": 1,
      "replies": {}
    },
    "fx9pz08": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9pz08/",
      "text": "Here are two options I think are the best:\n\n1) Take the gap year, then start college and get the full 4 years starting in fall 2021\n\n2) Go to community college for a year then transfer\n\nPaying all that money for a sub-par online education where you meet nobody and the professors don’t know what they’re doing is a waste of time and money. We live in a weird time since we’re told our whole lives to keep going and keep striving for the best, but now we’re in a spot where it’s ok to stop if you can and most adults don’t know how to respond to that, let alone tell their kids what to do.\n\nI think in your case it’s especially true since you have a job that’ll keep you occupied and paid for now.",
      "author": "Mrflamexd3",
      "created": 1594172961,
      "upvotes": 1,
      "replies": {}
    },
    "fx9pxq8": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9pxq8/",
      "text": "Yes. I wish I had taken a gap year. Take a gap year. This is your sign. Make money, get yourself established as an adult and then decide whether or not you want to go to school later. There is no shame I really fucking wish I didn't go to college right away",
      "author": "marsisnotaplanet",
      "created": 1594172940,
      "upvotes": 2,
      "replies": {}
    },
    "fx9ngv7": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9ngv7/",
      "text": "Take a year off and go to community college. Get your gen-ed courses done, you'll save money and graduate on time. And also there will still be opportunities to meet classmates at a small school regardless of what you choose. \n\nSource: I went to a small liberal arts school",
      "author": "Madbax22",
      "created": 1594171469,
      "upvotes": 3,
      "replies": {}
    },
    "fx9n47c": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9n47c/",
      "text": "Take the gap, the cost isnt worth it to not get the full college experience. The best part of college imo is the social aspect. Work and save up some money. They will still happily take your money next year too.",
      "author": "Eddiofabio",
      "created": 1594171262,
      "upvotes": 2,
      "replies": {}
    },
    "fx9mp9j": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9mp9j/",
      "text": "I’d take a gap year. I just graduated college and if you’re planning of going in for the real deal and full experience then I wouldn’t waste a second of it.",
      "author": "GodMike",
      "created": 1594171015,
      "upvotes": 4,
      "replies": {}
    },
    "fx9mnpm": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9mnpm/",
      "text": "If you want a quality education and don’t mind the price, Drexel is allowing people to apply for a shortened first year that begins in late winter at no disadvantage to the student with the same amount of credits awarded. Something to look into if it interests you.",
      "author": null,
      "created": 1594170990,
      "upvotes": 1,
      "replies": {}
    },
    "fx9lpfx": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9lpfx/",
      "text": "Have a plan before you commit to a gap year.\n\nDecide what your routine is going to be for at least 30 days at a time. Then mix it up. \n\nYou'll need to set goals to stay motivated.\n\nCreate a list of all the things that you would do if you had unlimited amounts of time. Then start doing them.\n\nJoin meetups and make virtual connections. No, they're not the same as in-person relationships but they're a helluva lot safer right now. \n\nLimit how much you plan to work - your hours are yours - they belong to you, not your parents, and you should use them as you see fit.\n\nWhat sparks joy in your life? Set an aspirational goal to learn one new thing every week. Or every month. But make it fun. It has to be FUN. It can't be studying just for the sake of learning. A la Marie Kondo, it MUST. SPARK. JOY.\n\nThis is your time. Apply the rule of 10-10-10. In 10 weeks, 10 months, 10 years, what will the impact of your gap year or semester be? Will the negatives outweigh the positives? Google \"Should I take a gap year\" and find workshops and thinking guides that can help you make the right decision for you.\n\nYou've got this! Your choice is YOUR choice. Tune out the noise and decide what's best for YOU.",
      "author": "STEERus",
      "created": 1594170424,
      "upvotes": 2,
      "replies": {}
    },
    "fx9lcfz": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9lcfz/",
      "text": "I’d really suggest to just take your time. There’s no need to rush into college. Take that supervisor job and make some great money while the world is still on pause. And hell, even take some online classes at your community college. Your wallet will thank you later",
      "author": "mattg3",
      "created": 1594170211,
      "upvotes": 2,
      "replies": {}
    },
    "fx9l1u3": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9l1u3/",
      "text": "In my opinion, going back is going to suck, and it will take a toll on all of our mental health way pass the point we're at now. I feel alone now, but now you want me to feel isolated while surrounded by others? even more torture. do what's best for you. make a pros and cons list, talk to your advisor, and evaluate how it will affect you in the long run. making and saving your money now is a good idea.",
      "author": "toffyleigh",
      "created": 1594170033,
      "upvotes": 2,
      "replies": {}
    },
    "fx9kpy2": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9kpy2/",
      "text": "Hey kids...42 year old adult here. I am a mildly successful graduate of Arizona State University. I own my own business and have a great network of friends and business associates - most of them I can link to college in one way or another. \n\nCollege was a great time. Education is important. Finding your way in life during college is importanter (yes, I did that on purpose). \n\nTake some old man advice. Don’t go back to school until you can be on campus, go to class in person, and meet and greet all the great people that will cross your path. It’s the people and relationships you develop in college that make college what it is. \n\nTake this time to do other stuff. Travel if you can, volunteer, join the peace corps or even the military. \n\nCome back to college later. \n\nGoing to college now and being forced to go online is pointless.",
      "author": "AZDad41",
      "created": 1594169838,
      "upvotes": 8,
      "replies": {
        "fxe2hqv": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxe2hqv/",
          "text": "Thank you for your perspective. A lot of folks in my life who are in a similar age-range have been saying similar things. I guess it’s a sign pointing towards what I should do.",
          "author": "Based_basedonwhat",
          "created": 1594268631,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fx9kgxs": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9kgxs/",
      "text": "One of my friends had to take a gap year for personal reasons (he wasn't in a good place mentally, barely graduated, and his family moved cross country) he said that now he regrets it because all he did was work and stay at home. He didn't have many people who he know because of the cross country move. You just have to make sure that you don't get so caught up with work to the point where you stop thinking about college. you'll meet people in college one way or another, even if most gatherings are cancelled. Just way the pros and the cons of staying home.",
      "author": null,
      "created": 1594169688,
      "upvotes": 1,
      "replies": {}
    },
    "fx9hyp6": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9hyp6/",
      "text": "If you need a break, take it. :)\n\nI failed 2 classes last quarter. 1 the last last quarter. \n\nBut I'ma keep going. :D",
      "author": "NefariousSerendipity",
      "created": 1594168213,
      "upvotes": 2,
      "replies": {}
    },
    "fx9hsta": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9hsta/",
      "text": "Have you ensured that you’re even eligible for a gap year? Many schools have strict gap year policies.",
      "author": "Laurasaur28",
      "created": 1594168117,
      "upvotes": 8,
      "replies": {}
    },
    "fx9a8ge": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9a8ge/",
      "text": "[deleted]",
      "author": null,
      "created": 1594163875,
      "upvotes": 16,
      "replies": {}
    },
    "fx9a5gr": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9a5gr/",
      "text": "I’d take a gap year if I were you. Anybody going to college spends too much money for a shitty transition to online classes mid semester. You’ll miss out on learning things and pay through the roof for it.",
      "author": "annirosec",
      "created": 1594163830,
      "upvotes": 2,
      "replies": {}
    },
    "fx99g8c": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx99g8c/",
      "text": "Mcla gang?",
      "author": "Swaggin_",
      "created": 1594163451,
      "upvotes": 1,
      "replies": {}
    },
    "fx98eds": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx98eds/",
      "text": "I think you could take a pseudo-gap year...maybe knock out a handful of electives online and crush them to start out with a solid GPA. Then, next year when you are back in school you can take a much lighter load and be more focused on the social aspect for at least your first semester.\n\nAnd come visit r/classicaleducation in the meantime!",
      "author": "newguy2884",
      "created": 1594162889,
      "upvotes": 1,
      "replies": {}
    },
    "fx97k65": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx97k65/",
      "text": "I’m coming off of a gap year and would 100% advise against taking one right now. You’d be bored out of ur mind for the better part of a year since having a meaningful/fulfilling experience is next to impossible",
      "author": "iRun-a-lot",
      "created": 1594162441,
      "upvotes": 2,
      "replies": {}
    },
    "fx95cm2": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx95cm2/",
      "text": "Take a gap year. Coming from a rising junior, it is not worth going to school through all of this. And the truth is we might still be in a similar, restricted mode next year as well. If you take the gap year, at least you won’t spend half of your time at college under these restrictions.",
      "author": "TreeOfFinches",
      "created": 1594161250,
      "upvotes": 3,
      "replies": {}
    },
    "fx959j6": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx959j6/",
      "text": "Man, if I didn't have only 2 more semesters left and a drive to get the hell out of school, I would.",
      "author": "Jefferson-not-jackso",
      "created": 1594161204,
      "upvotes": 2,
      "replies": {}
    },
    "fx954aj": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx954aj/",
      "text": "College will always be there. The job offer won't. I'd recommend continuing getting experience with your job and if you do well enough during the year, maybe they will be lenient and let you supervise part time and take a couple of courses next year to start furthering your college career.",
      "author": "BjornReborn",
      "created": 1594161125,
      "upvotes": 0,
      "replies": {}
    },
    "fx94pkt": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx94pkt/",
      "text": "My school is doing the exact same thing in terms of online classes after thanksgiving, and is also a small liberal arts college. That’d be a crazy coincidence if it was the same one!",
      "author": "JambaJuiceJakey",
      "created": 1594160909,
      "upvotes": 2,
      "replies": {}
    },
    "fx94fmv": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx94fmv/",
      "text": "I’m in a similar situation as an incoming freshman at a small, isolated LAC. I decided to take a gap year. \n\nIn my eyes, half of the benefits of college are social. Those social benefits will undoubtably suffer if social distancing and lockdown measures are enforced—and that’s assuming we even stay on campus for both semesters, which is not guaranteed. Remote classes would obviously prohibit most clubs, extracurriculars, sports, etc.\n\nI’m also not on FA and don’t have any scholarship money (although I want to apply to some over the gap year). While my school did lower tuition slightly, the cost is still far too much for what will be an incomplete freshman year. Since I will be taking out some student loans regardless, I’d rather have a complete four-year college experience to show for it. I will also be working over the gap year and that money should more than make up the tuition reduction for the current year.\n\nAll in all, my reasoning points strongly in favor of a gap year for my circumstances. Of course, if you’re on FA or a scholarship, you might have additional circumstances that impact your decision.",
      "author": "stickerforprez",
      "created": 1594160764,
      "upvotes": 5,
      "replies": {}
    },
    "fx942kc": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx942kc/",
      "text": "A recent college graduate here (UT Austin to be exact). I recommend going part-time, online classes, and live at home. \n\n\\- The \"college experience\" is everything (Dorm life, social stuff, clubs, study abroad, recruiting for internships etc.). Obviously with the pandemic, you won't be getting this\n\n\\- Save money, which allows you to spend money for your later college years on opportunities that are expesnive (abroad program, living in a different city in the summer, unpaid internships)\n\n\\- Going part-time allows you to potential still graduate in 4 years, if you take summer courses, have high school credit, CLEP, or community college courses etc\n\n\\- Going part-time allows you to be productive with school, but also have time for other stuff. If you can be productive with that free time (make money, networking, evaluate your goals, personal skills & growth) it will definitely be worth it",
      "author": "goodshotbiga",
      "created": 1594160575,
      "upvotes": 3,
      "replies": {}
    },
    "fx927ce": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx927ce/",
      "text": "definitely take the gap year and maybe try to take some gen-ed courses at your local community college. i’d recommend courses such as english, science, and a social science, depending on what the first year schedule looks like. that way, you can take 12 hours each semester when you decide to go back (if you still want to go to school for 4 years)",
      "author": "justasmalltowngirl90",
      "created": 1594159615,
      "upvotes": 1,
      "replies": {}
    },
    "fx91kqm": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx91kqm/",
      "text": "The social aspect kinda stinks, but I opted not to take a gap year because ultimately I don't want to push back my future plans and entering the workforce another year.",
      "author": "morgan5464",
      "created": 1594159292,
      "upvotes": 6,
      "replies": {}
    },
    "fx91h81": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx91h81/",
      "text": "I only go to community college and I’m going to take a year off. The half baked online courses messed me up. I rather wait for it to go back to normal.",
      "author": "12VoltBattery",
      "created": 1594159241,
      "upvotes": 2,
      "replies": {}
    },
    "fx916gy": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx916gy/",
      "text": "I'm in the same boat. I've been on the fence all summer about whether to return or not. I am leaning towards not going because a couple of my friends got COVID, meaning that just because we're young doesn't make us immune to getting sick. I'm going to miss my friends, parties, clubs, and campus activities but I really think these things are going to be lessened because of social distancing...meaning I won't miss out on very much. Plus, I do believe the quality of education will be sub par do to online classes, restrictions on study-group socialization, library access, etc. It's up to you whether you enjoy online classes and want to get ahead of the game, or if you want to play it safe.",
      "author": "ishperson",
      "created": 1594159089,
      "upvotes": 3,
      "replies": {}
    },
    "fx90yt7": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx90yt7/",
      "text": "Your situation sounds exactly like mine. I’m going to a small liberal arts school and all of the requirements that you have put are identical to mine. Taking a gap year might be worth it. If you can’t learn online material  well, I think you should do it. It sucks that all of this is happening. I’m not sure if schools will return online. Things have been going pretty well in the state where my college is, which gives me hope. Maybe you could look into the amount of cases and whether the cases are increasing or decreasing to help make your decision.",
      "author": "Ilikepizza_228",
      "created": 1594158983,
      "upvotes": 4,
      "replies": {}
    },
    "fx90wi6": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx90wi6/",
      "text": "coming back to school after a year off (and working) will require a lot of discipline. Maybe take year to work and take fewer classes in the evening/weekends?",
      "author": "Timemc2",
      "created": 1594158951,
      "upvotes": 3,
      "replies": {}
    },
    "fx90q11": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx90q11/",
      "text": "I think it kind of depends on what year you are and what your plans for after college are.\n\nIf you're a freshman, I think that a gap year would be a good idea. You kind of have to learn how to be a college student and that's going to be difficult when you have minimal social interaction.\n\nThat being said, maybe taking some online courses at a community college would be a good idea! I would really try and minimize any debt right now if you can... so maybe go like half time and work to pay off your courses as you go (that is, if you can find work)? That's what I have been during through COVID and it's kept my mind busy, and I'm closer to my goal!",
      "author": "FitLotus",
      "created": 1594158861,
      "upvotes": 2,
      "replies": {}
    },
    "fx90ohq": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx90ohq/",
      "text": "I would take it if it's an option. The \"college experience\" was such an important and meaningful thing to me and I would never want to pay to go to college if it was going to just be me sitting in my parents' house taking online classes. Plus you have the opportunity of getting a promotion at your job and saving up money for when you do go.",
      "author": "numberthangold",
      "created": 1594158839,
      "upvotes": 1,
      "replies": {}
    },
    "fx90bp1": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx90bp1/",
      "text": "I would. College is just as much about social growth and meeting people than it is about learning.... with online classes or reduced campus functionality, if you’re able to do so, I would take a gap year.",
      "author": "ergatory",
      "created": 1594158659,
      "upvotes": 4,
      "replies": {}
    },
    "fx909dp": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx909dp/",
      "text": "If I could I absolutely would.",
      "author": "heartandliver",
      "created": 1594158626,
      "upvotes": 1,
      "replies": {}
    },
    "fx8zybe": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8zybe/",
      "text": "I took a gap year between transferring schools and cannot recommend it enough. It gave me the maturity I needed to succeed academically. I'm also considering only taking like 6-8 credits next semester and working full time because I cannot do online courses any longer.",
      "author": null,
      "created": 1594158472,
      "upvotes": 3,
      "replies": {}
    },
    "fx8ynkb": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8ynkb/",
      "text": "Yeah do it. Who said you had to go to “college” right away ?",
      "author": "duc1n",
      "created": 1594157827,
      "upvotes": 2,
      "replies": {}
    },
    "fx8y6wj": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8y6wj/",
      "text": "My opinion is that it depends on your major. If it’s a STEM major I would say go to school. If not I would say take a gap year and work on a ton of relevant things. Try and get a job in that related field for the year.",
      "author": "Tgtt10",
      "created": 1594157603,
      "upvotes": 4,
      "replies": {
        "fx993fo": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx993fo/",
          "text": "Why do you say stem majors should go?",
          "author": "throwaway178943",
          "created": 1594163259,
          "upvotes": 5,
          "replies": {
            "fx9a06z": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9a06z/",
              "text": "My reasoning is most of those career fields REQUIRE degrees. So the quicker you get that degree the quicker you’ll be in the workforce. The other fields (mostly speaking from my experience getting a film/animation degree.) It’s totally possible to get jobs based on skill without a degree. So it’s better to get experience/develop those skills in a gap year rather than online classes",
              "author": "Tgtt10",
              "created": 1594163750,
              "upvotes": 4,
              "replies": {
                "fx9a98t": {
                  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9a98t/",
                  "text": "That’s fair. I’ll add as an engineering major though: if you get the chance to do a CO-OP instead of school, do it. Even without COVID my internship over a semester was incredible. It means that even without my degree I have over a year of full-time engineering experience. I’m going to have my degree soon (and also not taking time off now bc I need it asap) but highly recommend a semester long internship.",
                  "author": "throwaway178943",
                  "created": 1594163888,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fx8xzhb": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8xzhb/",
      "text": "I went to a similar type of school and as a senior who lost the last bit of college to this, take the gap year if you are able. You should be able to have and deserve the full four years of experience (academically and socially) that you were promised by applying/committing and that you’re paying for, which definitely will not be happening this next semester and maybe longer. I wish you luck with your decision!",
      "author": "kkitkat6996",
      "created": 1594157503,
      "upvotes": 2,
      "replies": {}
    },
    "fx8xqcq": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8xqcq/",
      "text": "The gap year sounds like a great call. Maybe if you have a local community college you can knock out some of the annoying GEs.",
      "author": "rosethepug",
      "created": 1594157379,
      "upvotes": 2,
      "replies": {}
    },
    "fx8xnwd": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8xnwd/",
      "text": "If we knew 100% that everything will be back to normal by next year, i would say take a gap year now.\n\nBut we dont know when things will resume 100%. WHO apparently stated this may last for around 5 years. I doubt it as we are seeing vaccines making tremendous progress, but anything can happen. Youll still have time to meet new people and have that college experience if you went to college this year. Or enrolling in a college thats make it clear it will all be online 100% so that you can just stay with your family while taking online classes instead of moving to the campus for a couple weeks before you get isolated inside alone. Do what you feel is best though theres no rush when it comes to college.",
      "author": null,
      "created": 1594157346,
      "upvotes": 12,
      "replies": {}
    },
    "fx8xi4v": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8xi4v/",
      "text": "If you are a freshman go to a community college and transfer the credits in.",
      "author": "tactical_lampost",
      "created": 1594157270,
      "upvotes": 9,
      "replies": {
        "fxa6ij0": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxa6ij0/",
          "text": "I’m considering this as I’m in the exact same position as the OP, but since I’ve already gotten into my college (paid my deposit) and got in with a pretty good scholarship I think I’d have to drop out of it to go to CC then reapply again. I’m just worried I won’t get the same scholarships since I’d be a transfer when reapplying. \n\nDo you know if there’s any way to take a gap year and do those credits during that time? Is that even allowed?",
          "author": "_looktheotherway",
          "created": 1594183543,
          "upvotes": 2,
          "replies": {
            "fxa6tph": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxa6tph/",
              "text": "Id suggest emailing your advisor",
              "author": "tactical_lampost",
              "created": 1594183775,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "fx8x4l0": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8x4l0/",
      "text": "i’m a rising junior and i’m even considering taking a gap year/leave of absence. if you’re a freshman, i would especially recommend doing so. imo you’re better off just putting off going to college and spending some time working/saving money. that way your education won’t be disrupted either.",
      "author": "pastelxbones",
      "created": 1594157084,
      "upvotes": 10,
      "replies": {}
    },
    "fx8wrhp": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8wrhp/",
      "text": "If I was still in college, I would absolutely take a gap year (or semester)\n\nEither that or just take cheaper online classes at a transferable community college to get some of the elective credits out of the way. Maybe work a part time job if you can find one.",
      "author": "spectrem",
      "created": 1594156906,
      "upvotes": 4,
      "replies": {}
    },
    "fx8wm9z": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8wm9z/",
      "text": "If I wasn't on a strict time limit, I would definitely be taking a gap year.",
      "author": "iamfearformylife",
      "created": 1594156835,
      "upvotes": 10,
      "replies": {}
    },
    "fx8wks0": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8wks0/",
      "text": "Forget having an advantage after you graduate - it may it may not be true.\n\nYou’ll figure it out then.  Do what’s best for you now.  \n\nIf it were me, I’d defer.  College isn’t meant to be done online.  Ordering pizza at 1 AM with friends while hanging out was as important to me as anything I did at college.",
      "author": "BeerNap21",
      "created": 1594156814,
      "upvotes": 52,
      "replies": {
        "fx957ol": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx957ol/",
          "text": "Agreed on the advantage in the job market. Yes, the class of 2025 will be bigger than normal, but the post-graduation job market is already incredibly competitive in many fields, and any advantage gained by graduating a year earlier may very well be annulled by the disadvantage of lasting effects from the COVID recession that would be less acute in 2025.\n\nIt’s nearly impossible to predict the future, especially when it comes to the economy. The best decision regarding deferral is the one that is best for you *now,* not the one that makes assumptions about the job market in the future.",
          "author": "stickerforprez",
          "created": 1594161176,
          "upvotes": 14,
          "replies": {}
        },
        "fx9dq9t": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9dq9t/",
          "text": "I don't recommend deferring. \n\nSure ordering pizza at 1 AM is an important part of the college experience, but you have *three more years* with which to do that, plus any time you spend in grad school or living with roommates after college.\n\nDeferring is a huge opportunity cost (you're sacrificing your highest lifetime salary) and I don't think another year of frat parties is worth it.",
          "author": "dobbysreward",
          "created": 1594165798,
          "upvotes": 5,
          "replies": {
            "fx9jbgu": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9jbgu/",
              "text": "I dunno, I’ve been out of college a while now, and I don’t give a shit about my Chem classes anymore, though they were useful at the time and helped me graduate.\n\nI’m still really close with a lot of friends from college, and that’s something that won’t change.  I’d be remiss if I gave that up for a year of salary.  \n\nThere’s more to life than money.",
              "author": "BeerNap21",
              "created": 1594169008,
              "upvotes": 8,
              "replies": {
                "fx9jvij": {
                  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9jvij/",
                  "text": "Would you be less close to them if you had met them a year later? Idk, like you said those meaningful friendships keep going after college. I don't see how 4 years instead of 3 years makes a big enough difference or why an extra year in the dorms is better than getting an apartment together or going on vacation together after college.",
                  "author": "dobbysreward",
                  "created": 1594169338,
                  "upvotes": 4,
                  "replies": {
                    "fx9muar": {
                      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9muar/",
                      "text": "There’s a ton of freedom in college you won’t have as soon as you graduate.\n\nAnd if I say yes to three years, would you argue two years?",
                      "author": "BeerNap21",
                      "created": 1594171100,
                      "upvotes": 2,
                      "replies": {
                        "fx9ndu7": {
                          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9ndu7/",
                          "text": "Interesting, I just graduated and feel like I have more freedom now than in college (no more obligations outside of work). I definitely had more freedom during summer internships than in school. But I just graduated so my perspective could change there.\n\nWe're only talking about one year, if OP had to put off 2 years of their life then I'd say that opportunity cost is way too high to make sense. But I did make some of my best friends during summer internships that only lasted 12 weeks, including a long term SO.",
                          "author": "dobbysreward",
                          "created": 1594171420,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fx8wk6o": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8wk6o/",
      "text": "Yes",
      "author": "milatti",
      "created": 1594156806,
      "upvotes": 2,
      "replies": {}
    },
    "fx8wgzd": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8wgzd/",
      "text": "I'm a professor at a similar-sounding college. TBH despite all the big plans I expect *all* colleges will end up going virtual again if they are allowed to open residence halls and face-to-face classes at all. The US population has totally screwed the COVID response-- with no thanks to the feds --and it's not going to get better in six weeks.\n\nMy eldest is a sophomore at another liberal arts college. At this point we're electing for her to stay home and take classes online. That will reduce costs by about $8K/semester (room and board) if they open the campus; if they do *not* open the campus I anticipate a 15-20% tuition cut as well.  Students should note, however, two things: 1) faculty have been working hard this summer to make online classes better than they were this spring, and 2) teaching online costs *more* than teaching regular classes. Based on my own experience (I'm a department chair and am on the board of trustees of my school) the spring online mess took 2-3x the hours for each class, additional tech, additional support, etc. So if some schools do not cut tuition for online instruction that is why.\n\nIf one of my kids was scheduled to start college this fall I'd 100% tell them not to do it. College will be there in another year. Use the time \"off\" to earn some money and continue to improve yourself-- read, explore possible majors, maybe take a cheap, easily-transferrable online class somewhere. Don't just sit in the basement. But the cost, health risk, and odds of everyone ending up online again really tell me it's not worth starting as a freshman this fall unless you're getting a full ride (including room/board) somewhere. The calculus is different for older students, and especially juniors/seniors who cannot easily transfer in credits at the upper-division.",
      "author": "SnowblindAlbino",
      "created": 1594156762,
      "upvotes": 77,
      "replies": {
        "fx8zzv5": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8zzv5/",
          "text": "Yeah, I've thought about a gap year. But in my state (GA), my tuition is paid for by the Zell Miller scholarship, and I took out subsidized loans from the national government. Even if I wanted to gap year, I can't pay the loans as of now and they'd be charged to me 6 months in. None of my friends are gapping either, and I don't want to spend my final year alone while they're gone.\n\nThe University System of Georgia wants people to come back, so I guess I'm...lucky? I just can't handle home any more. I can't handle up to 1.5 years of isolating at home while the freest years of my life are spent isolating.",
          "author": "JustAGrump1",
          "created": 1594158494,
          "upvotes": 14,
          "replies": {
            "fx9qsql": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9qsql/",
              "text": "Yep-- it's tough if you're already borrowed, because time away starts the repayment clock. That's another reason it makes more sense for incoming first-years than for older students.  But it's also an option for those without loans, which are a significant chunk of students at many schools.",
              "author": "SnowblindAlbino",
              "created": 1594173452,
              "upvotes": 4,
              "replies": {}
            },
            "fx9i2us": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9i2us/",
              "text": "The Georgia schools as of now aren’t requiring masks so I doubt you’ll stay on campus that long honestly",
              "author": "BylvieBalvez",
              "created": 1594168281,
              "upvotes": 0,
              "replies": {
                "fx9lsgh": {
                  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9lsgh/",
                  "text": "They actually are now. They backtracked one that decision because of backlash.",
                  "author": "mylifeisgreyscale",
                  "created": 1594170475,
                  "upvotes": 5,
                  "replies": {}
                },
                "fx9rsrf": {
                  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9rsrf/",
                  "text": "Yeah, a month at most before being sent home back to the shitshow. And after all this time I thought college would be an escape.",
                  "author": "JustAGrump1",
                  "created": 1594174049,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "fx98902": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx98902/",
          "text": "Can you explain how gap years work? Does the people taking gap years have to reapply for the colleges that already accepted them or do they automatically qualify next year? \n\nI'm worried because I'm a rising senior aiming for UC Berkeley and I'm afraid that there will be more freshman applicants for the C/O 2025 which might make it harder to get in.",
          "author": "kyllua16",
          "created": 1594162809,
          "upvotes": 2,
          "replies": {
            "fx9qecz": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9qecz/",
              "text": "> Does the people taking gap years have to reapply for the colleges that already accepted them or do they automatically qualify next year?\n\nPolicies vary by school, so you'll have to ask yours directly. Generally speaking though, *most* schools will allow you to literally defer for one year: that means you accept admission but wait until fall of the following year to enroll. Not all though, and how they handle financial aid can vary dramatically. If you have a spot in a highly selective school (there are <50 such in the entire US with admission rates <15%) that's quite different than someone who is looking to defer from a typical state flagship or a private liberal arts college.",
              "author": "SnowblindAlbino",
              "created": 1594173214,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fx9i7yp": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9i7yp/",
          "text": "I’m not getting a full ride but I am getting a lot of scholarships that make my school affordable and if I deferred I would probably lose over half the money I have right now so I’m just gonna tough it out. I know it’s the school for me so I think it’s worth it, but considering doing the fall at home online because right now they want me to be on campus even though all my classes are going to be online which is ridiculous to me",
          "author": "BylvieBalvez",
          "created": 1594168363,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fx8wen2": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8wen2/",
      "text": "Pros: Online classes are typically easier and professors are easier on you. You’d have wonderful padding for the rest of your college career.\n\nThat’s literally the only pro I know. It’s worth it for some, worth it for me, but it’s completely understandable if you decide to take a gap year.",
      "author": "Blah1618",
      "created": 1594156731,
      "upvotes": 14,
      "replies": {
        "fx900an": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx900an/",
          "text": ">Online classes are typically easier\n\nYeah, that’s ain’t true lmao. If anything, online classes were more work with less payoff since I didn’t retain nearly as much information as I normally would. At least my professors line of thinking is, “oh, the students are home now, they’ll be able to do more homework/projects/whatever”.",
          "author": "Weat-PC",
          "created": 1594158500,
          "upvotes": 26,
          "replies": {
            "fx9ejej": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9ejej/",
              "text": "Imo online classes are way easier if you have decent self-motivation. It can be hard to motivate yourself to be as productive if you're not on-campus, but if you can do it, online classes give you way more time in the day to study. It's also way easier to go to an 8 am class when all you have to do is turn on your laptop in the morning.\n\nNone of my profs changed the syllabus because we went home though. Most were really understanding about the impacts of going online and were willing to reduce the workload or give extensions upon request.",
              "author": "dobbysreward",
              "created": 1594166245,
              "upvotes": 8,
              "replies": {}
            },
            "fy4hnvi": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fy4hnvi/",
              "text": "I said typically, because typically teachers are less hard on you. Sorry about your experience.",
              "author": "Blah1618",
              "created": 1594800149,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "fx90m5w": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx90m5w/",
          "text": "Depends on the professor, some will go a bit easier some not. Math teachers and math classes in general are hell online in particular I've found",
          "author": "night1172",
          "created": 1594158807,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "fx8uj99": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8uj99/",
      "text": "No",
      "author": "papichuloswag",
      "created": 1594155818,
      "upvotes": 0,
      "replies": {}
    },
    "fx8tun9": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8tun9/",
      "text": "I think a gap year (or at least gap semester) is smart. \n\nOdds seem very good that classes will go virtual before the end of the semester. \n\nCoronavirus can still be dangerous for healthy young people and plenty of young people don’t know that they have pre existing conditions that put them more at risk. Colleges are breeding grounds and it’s a big risk to take for a sub par social experience and exceedingly stressed out professors. \n\nIf you take a gap year now you’ll graduate a year later so you’ll be entering the workforce a year later. For many people this will be a good idea. The longer you can wait for the economy to recover the better. Plus, you should be able to save up a lot of money working. \n\nGap semesters/years can be hard and obviously you know your social support system the best. Do you get along well with your parents? Do you have friends you can see at home? Do you like your work? All of these are factors to consider. For me, the answer to all of them is yes so I will be staying home for at least this semester.",
      "author": "lucky21s",
      "created": 1594155485,
      "upvotes": 21,
      "replies": {}
    },
    "fx8rw12": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8rw12/",
      "text": "I'm just going to go part time this fall",
      "author": "officalwolfie",
      "created": 1594154539,
      "upvotes": 22,
      "replies": {
        "fx8z5z2": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8z5z2/",
          "text": "Same. No point in paying for full time if I’m not gonna get the full benefits of the university.",
          "author": "IfOnlyIHadAGoat",
          "created": 1594158081,
          "upvotes": 10,
          "replies": {}
        },
        "fx98f9o": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx98f9o/",
          "text": "Also considering it as I can't defer semester without losing my 6 month grace period",
          "author": "Isacle_",
          "created": 1594162902,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fx8dvk6": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8dvk6/",
      "text": "don't take the gap year.  it's all cons:\n\n\\-it's not going to be any easier to return after a year.  \n\n\\-right now is the least expensive college will be.\n\n\\-yes, online classes suck...but they aren't going away. \n\n\\-yes, you will have some job experience, BUT you'll be entering a job market that just took a hit (and is likely to continue taking hits) late and will have to compete that much more.",
      "author": "keithhannen",
      "created": 1594147850,
      "upvotes": 2,
      "replies": {
        "fx8sdr8": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8sdr8/",
          "text": "-It'll be easier to return if there's a social scene\n\n-College may be cheaper because the experience is worse, how much cheaper depends on the college and how much cheaper it is\n\n-A year + a summer from now I doubt we will still have online classes\n\n-College students graduate every year, you can't enter a job market late unless its an upcoming and hyped up field, even then the hype usually lasts several years.",
          "author": "Katkool",
          "created": 1594154780,
          "upvotes": 8,
          "replies": {
            "fx9d04h": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9d04h/",
              "text": "> College students graduate every year, you can't enter a job market late unless its an upcoming and hyped up field, even then the hype usually lasts several years.\n\nThere's a finite number of entry level jobs and per year and the class of 2025 will probably be a lot bigger than it should be. It stands to reason the competition for everything, from entry level jobs to graduate school seats, is going to be higher than usual.\n\nOnline school is definitely going to be cheaper once you factor in the opportunity cost. You are losing one year of your highest lifetime salary. For most college graudates that's at least as much as a year's worth of college tuition.",
              "author": "dobbysreward",
              "created": 1594165395,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fx92szk": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx92szk/",
          "text": "It will be way easier to return next year. By then it's extremely likely that we will have a vaccine and things will be pretty much back to normal.\n\nAlso, most colleges aren't lowering their tuition at all.",
          "author": "numberthangold",
          "created": 1594159923,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fx86w8p": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx86w8p/",
      "text": "Take the gap year. The supervisor promotion sounds awesome! Give that a solid try for a year... save up money... and reevaluate your school plans next fall.\n\nMissing a year of school isn't going to hurt you a bit. There will always be job opportunities for college grads this year... next year... or whenever.",
      "author": "decimalpointsam",
      "created": 1594144570,
      "upvotes": 4,
      "replies": {}
    },
    "fx82qfp": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx82qfp/",
      "text": "If I could take a gap year, I would, but I’ve already paid for classes and my scholarship depends on me taking classes each semester. I think it’s a better decision in the long run tbh",
      "author": null,
      "created": 1594142638,
      "upvotes": 111,
      "replies": {
        "fx8xh4v": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8xh4v/",
          "text": "oh fuck, you just reminded me that i have a scholarship to consider. i’m considering taking a leave of absence but i’m avoiding asking direct questions about the details to the school. better to keep a poker face with the financial aid office.",
          "author": "pastelxbones",
          "created": 1594157256,
          "upvotes": 45,
          "replies": {
            "fx8zmq5": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8zmq5/",
              "text": "Most schools have a policy listed online regarding financial aid and LOA, like it’s available as long as you don’t take more than two consecutive semesters at a time. \n\nMake sure you’re getting in to take a gap year or LOA (leave of absence) before classes start, or you’ll end up with WITHDRAWN status which negatively affects your course completion schedule which can put you on academic probation as far as financial aid is concerned. \n\nSure, it’s able to be sorted out with your financial aid advisor, but it’s a pain in the ass and you should avoid that situation if possible.",
              "author": "borderaussiecomet",
              "created": 1594158313,
              "upvotes": 15,
              "replies": {
                "fx90gh9": {
                  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx90gh9/",
                  "text": "the issue is it’s hard to tell if taking a loa is a good idea for me before classes start. i have no clue how much of a hellscape campus will be and how much my classes are gonna suck because of the pandemic. and i’m also nervous that they’re gonna do a bait-and-switch and make classes fully online after like a month, which i cannot do because i’m a chem major. i have to double check, but i think i read that if you take a loa before the add/drop period ends u can just drop all ur classes. this whole situation sucks tho.",
                  "author": "pastelxbones",
                  "created": 1594158727,
                  "upvotes": 3,
                  "replies": {
                    "fx9qqib": {
                      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9qqib/",
                      "text": "You're right about one thing, I think that there'll be a series of outbreaks across colleges nationally, then another series of shutdowns, like in March.",
                      "author": "Dathlos",
                      "created": 1594173414,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fx80wt9": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx80wt9/",
      "text": "[deleted]",
      "author": null,
      "created": 1594141775,
      "upvotes": 375,
      "replies": {
        "fx8xsd4": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8xsd4/",
          "text": "Pretty much, yeah. Or sitting at home, being depressed, and learning to cheat. Thinking about taking a gap year also, but I already signed up for classes. I guess I could withdraw, but tiger parents are a thing in my case.",
          "author": "problematicpasnetti",
          "created": 1594157407,
          "upvotes": 115,
          "replies": {
            "fx9gki2": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9gki2/",
              "text": "Imo taking a gap year just to spend one more year socializing is too expensive to make sense. The opportunity cost is at least one year of your highest lifetime salary because every year of work experience builds up.\n\nHowever my perspective might be biased because I went to community college and even if my first year wasn't ideal I don't regret it at all. I wasn't sucked in by distractions as a freshman and made more than enough memories after transferring. The only struggle was breaking into social circles as a transfer which won't be a problem for incoming freshmen.",
              "author": "dobbysreward",
              "created": 1594167398,
              "upvotes": 41,
              "replies": {
                "fx9luye": {
                  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9luye/",
                  "text": "If you don't go to CC, then being on campus presents a lot of possibilities such as clubs and campus resources. These opportunities to make connections is also a huge part of college.",
                  "author": "swellow10101",
                  "created": 1594170516,
                  "upvotes": 21,
                  "replies": {
                    "fx9mfzo": {
                      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9mfzo/",
                      "text": "Agreed, but you're still going to make connections virtually or socially distanced just by going to class and participating in group projects and clubs. At least at my university most of the clubs transitioned online before classes did and all the ones I know of intend to recruit students again this Fall even if they have to do it virtually. \n\nAlso every Gen Z person I know has internet friends they rarely or have never seen in person so it’s not an unprecedented situation, especially when you know you’re going to go to school together for years and will meet up eventually. \n\nYou can also put in the work to network online via Facebook groups, Twitter DMs or Linkedin DMs. At least in my professional circle potential mentors are way more open to coffee chatting this year compared to other years because they have more time on their hands and recognize the struggle.\n\nIt's not a perfect replacement for the full college experience, but I really don't see the marginal value of 4 years of the college experience vs 3 years being worth the opportunity cost of deferring.",
                      "author": "dobbysreward",
                      "created": 1594170860,
                      "upvotes": 8,
                      "replies": {
                        "fx9wbpx": {
                          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9wbpx/",
                          "text": "I think that doing school is the right choice, would just recommend to go back instead of staying off campus. No matter what they officially say, studying from dorms is gonna be much more like being at college than studying from home. Also, as the year goes on, more things will return to normal hopefully. All this tuition and budgets constraints aside.\n\nI think a gap year right now is stupid unless you have an internship, interesting job, or something of real value lined up.",
                          "author": "swellow10101",
                          "created": 1594176743,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    },
                    "fx9vfcl": {
                      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9vfcl/",
                      "text": "I made most of my connections over my junior/senior years as I got further into my major, for what it's worth.",
                      "author": "localhostrulez",
                      "created": 1594176204,
                      "upvotes": 3,
                      "replies": {
                        "fx9wtvf": {
                          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9wtvf/",
                          "text": "I definitely agree that juniors and seniors have more professional opportunities, but freshman and sophomore can get them as well. Not to mention that if you want to move up through leadership positions, you need to start early.\n\nUnless they have something lined up, I feel like people who will defer will regret their decision.",
                          "author": "swellow10101",
                          "created": 1594177054,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fx97rxk": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx97rxk/",
          "text": "Here is my US-specific take on this (apologies if this doesn't apply to you):\n\nNot considering parental pressure, scholarships, admissions, or finances, personally, I would recommend that incoming first-year students take a gap semester or year. What I think the pandemic has revealed to a lot of people is that paying for the on-campus \"college experience\", marketed by most institutions, is really paying for an environment that offers the opportunity for connections. Those connections can be personal, academic, and professional. In an online-only setting, it is much harder for these institutions to provide that same \"space.\" Is it possible for students to still develop relationships in that environment? Absolutely, but it will be much more difficult to start college in a school that is not already adapted to online learning *and* online living.",
          "author": "AlmondLoveWithThis",
          "created": 1594162552,
          "upvotes": 19,
          "replies": {}
        },
        "fx87b2n": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx87b2n/",
          "text": "If you're going back to school to hang out in bars and play drinking games... you're just wasting time and money.",
          "author": "decimalpointsam",
          "created": 1594144762,
          "upvotes": -68,
          "replies": {
            "fx8y6ke": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8y6ke/",
              "text": "I’m wondering if I can maybe change your perspective on this a little bit. I’m currently a senior in college at a very large engineering school in the Midwest. There is a pretty laid back drinking culture here (as opposed to the big party schools in the area), and I think it’s a pretty integral part of the college experience for a number of reasons, that I hope can maybe change your mind or broaden your view a little bit. \n\n\n1. If I’m grinding away at school week in and week out, it’s likely that without social time that I’ll get burnt out and my work won’t be up to par. School is hard and there is little added incentive such as pay raises or other immediate monetary gain from working hard, so taking breaks on the weekends can help with mental health and reinvigorating work ethic. \n\n\n2. In the US, it’s a necessary life skill to know how to drink around others, whether it be colleagues at work or people in your social scene, the freedom of university lets people experience their wild party days without it effecting their jobs. Imagine your co-workers go out after work and you tag along and haven’t ever gone out, end up not knowing your limits, and something bad or embarrassing happens. \n\n\n3. Few to no people are “going JUST to go to bars and play drinking games”, but humans, being social creatures, want fun stuff to do between the monotony of class work and maybe even real jobs on the side. \n\nI hope maybe this changes your worldview a little bit.",
              "author": "VinylBreadPuddin",
              "created": 1594157599,
              "upvotes": 17,
              "replies": {
                "fx921de": {
                  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx921de/",
                  "text": "Honestly the mindset that students should be doing nothing but studying, eating, and sleeping is a viewpoint I don’t understand. When I was leaving for college my freshman year I casually mentioned I was bringing my TV with me while listing things I needed to pack and my dad snapped at me. He couldn’t understand why I would want to bring a TV to college because I should be focusing on my studies. \n\nI had to explain to him that if I didn’t play a video game every once in a while or watch a couple episodes in between hours of studying I would have a mental breakdown and drop out of college because no sane person can go four years with no recreation.",
                  "author": "FlyingRatSauce",
                  "created": 1594159529,
                  "upvotes": 10,
                  "replies": {}
                },
                "fx8z1ob": {
                  "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8z1ob/",
                  "text": "And what if you don't drink? Is that really a bad thing?",
                  "author": "JustAGrump1",
                  "created": 1594158022,
                  "upvotes": 1,
                  "replies": {
                    "fx8z7se": {
                      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8z7se/",
                      "text": "Not at all! I’m friends with a lot of people at school that don’t drink, but they still come out to the bars and hang out. They seem to have a great time, maybe give it a try!",
                      "author": "VinylBreadPuddin",
                      "created": 1594158107,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fxa3tvt": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxa3tvt/",
              "text": "I agree with you. Way too many people are taking scholarship money to fuck around and it pisses me off to no end.",
              "author": "BecuzMDsaid",
              "created": 1594181608,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fx8012a": {
      "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx8012a/",
      "text": "I think that the gap year is a good choice.  I personally think that the \"college experience\" is important and that won't be available this year.  The cost doesn't seem worth it to me for online classes.  Consider taking some CLEP tests if you do the gap year to keep yourself in \"school-mode\" and to get a few credits out of the way.",
      "author": "cereal98",
      "created": 1594141357,
      "upvotes": 217,
      "replies": {
        "fx91h2n": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx91h2n/",
          "text": "The CLEP tests are a good idea, I hadn't heard of them before. And I agree with the \"college experience\" aspect. Half the reason I'm in my particular college is for the social aspect.",
          "author": "ishperson",
          "created": 1594159239,
          "upvotes": 28,
          "replies": {
            "fx97ahj": {
              "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx97ahj/",
              "text": "Eh. College was a means to an end for me. Sure, the social aspect was nice but I’m not going to put my life on hold for a year so I can party my brains out. If anything (as a recent college graduate who spent 8 years in school who lost his last and final semester to COVID) this could help a lot of students get a “leg up” or take classes that they dread because of how much easier and simpler the syllabus’s will be",
              "author": "ItsGettinBreesy",
              "created": 1594162297,
              "upvotes": 23,
              "replies": {}
            }
          }
        },
        "fx94qdj": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx94qdj/",
          "text": "I second the CLEP tests. My school limited us to only being able to CLEP 9 total hours, but that would still get you a decent number of hours for an off-year, and when things do hopefully someday return to normal that saves you the time, money, and effort that those classes would otherwise require. I wouldn't suggest clepping anything super relevant to your major though.\n\nWay back in the day I clepped English Comp 1, 2, and US History. If you were decent at English in high school then those tests are pretty easy credits. US history was tougher, but I hated that class in highschool and still managed to pass with a week or two of off-and-on studying.",
          "author": "LordMudkip",
          "created": 1594160920,
          "upvotes": 8,
          "replies": {}
        },
        "fx9i0q1": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fx9i0q1/",
          "text": "Take the gen ed online classes now, do major classes in campus later. ;)",
          "author": "NefariousSerendipity",
          "created": 1594168247,
          "upvotes": 6,
          "replies": {}
        },
        "fxbeq3x": {
          "link": "/r/college/comments/hmy8ts/should_i_take_a_covid_gap_year/fxbeq3x/",
          "text": "if you want to do CLEP tests, make sure your school accepts them first. Many don't or have restrictions on the number of credits.",
          "author": "falconview",
          "created": 1594219116,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634056718
}