{
  "sid": "rfiis4",
  "link": "/r/college/comments/rfiis4/can_somebody_help_me_with_this_plz/",
  "title:": "Can somebody help me with this plz",
  "text": "So I'm a freshman in college and things  like this is new for me cause I've always get used to be pushed to go studying and my high school it had that system of telling students to go to night prep's so as to study for some few hours in which I was used to that system but when I came to college I didn't see that system and I relaxed for sometime and one day I just snapped and I realized I've never studied since I came to college and it was like 3 weeks since I was in college and it bothers me that I always study time to time at my previous school but now I'm in college I've never studied time to time like my previous school and when it reached  the test for college i struggled cause ive never studied before and I've never written any summary of any my subjects and things were alot for me so is there anything wrong with me or should I do something about\n\n can someone advice me what to do so as to change maybe",
  "author": "blueboy628",
  "created": 1639410114,
  "updated": 1639858571,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hoe2pg5": {
      "link": "/r/college/comments/rfiis4/can_somebody_help_me_with_this_plz/hoe2pg5/",
      "text": "Start studying. r/getstudying would be a great help",
      "author": "GoldRequest",
      "created": 1639410655,
      "upvotes": 3,
      "replies": {
        "honqzq2": {
          "link": "/r/college/comments/rfiis4/can_somebody_help_me_with_this_plz/honqzq2/",
          "text": "Ok thanks for ur help",
          "author": "blueboy628",
          "created": 1639584986,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoee26x": {
      "link": "/r/college/comments/rfiis4/can_somebody_help_me_with_this_plz/hoee26x/",
      "text": "I was in the same dilemma and what worked for me was to not go back to my house(or dorm) because once I got there, there was too much distractions and I became too relaxed. After class I usually go to the library or a quiet place and do some review. Another key thing is that in high school you might be forced to do homework but is college you don’t have to depending on the class. I find myself forcing me to do homework and extra practice because it helps you understand the concepts better. Now I want more homework. LOL!",
      "author": "OddMobile3343",
      "created": 1639415172,
      "upvotes": 1,
      "replies": {}
    }
  }
}