{
  "sid": "qru8uc",
  "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/",
  "title:": "do professors dislike students that turn in assignments with a lot of detail and care, exceeding requirements for the assignment?",
  "text": "ive heard somewhere that professors typically don’t enjoy grading papers that are higher in page number than the requirements and are a bit overly detailed. i genuinely can’t help it, i’m really passionate about these classes im in and i genuinely enjoy the assignments im given.\n\nis it annoying to turn in these kinds of assignments, or do professors appreciate students that put care and thought into them? this is a genuine question, i’m not trying to brag or say i’m better than anyone. i want my professors to like me lol",
  "author": "tacticalcop",
  "created": 1636662566,
  "updated": 1636745652,
  "over_18": false,
  "upvotes": 25,
  "upvote_ratio": 0.88,
  "comments": {
    "hk8y46g": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk8y46g/",
      "text": "Honestly, I usually stop grading when I hit the page limit. So anything that is on the extra pages won't get read which can lead to a worse grade. This is because knowing how to write succinctly is actually more difficult that being overly detailed and because grading papers takes forever so I really don't want to read extra pages.",
      "author": "archaeob",
      "created": 1636663719,
      "upvotes": 73,
      "replies": {
        "hkafteq": {
          "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hkafteq/",
          "text": "I do the same. I teach hundreds and hundreds of students. Even if just 5% of students exceeded my max word count by a substantial margin, it would add several hours to my grading. Multiply that by the several assignments a semester and I'm using way too much personal time doing things that should've been completed during my 9-5. \n\nWord/page counts exist for a reason. \n\nI do take time to make my expectations clear and speak to the students individually that do this kind of thing. I make it clear that I'm impressed, but they need to follow the assignment guidelines.",
          "author": "Sea_Programmer3258",
          "created": 1636688171,
          "upvotes": 7,
          "replies": {}
        },
        "hk90h9k": {
          "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk90h9k/",
          "text": "that is very true, i didn’t think about that! thank you!",
          "author": "tacticalcop",
          "created": 1636664692,
          "upvotes": 4,
          "replies": {}
        },
        "hk9xbb6": {
          "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk9xbb6/",
          "text": "You sound like a terrible teacher, downgrading without finishing the assignment? If a student exceeds a MAXIMUM page count, then I could see justification, but if it's a minimum count then you should find another profession. At the minimum you need to let the students know how you grade, so they have all the information they need to be successful.",
          "author": "OwnUniversity153",
          "created": 1636679535,
          "upvotes": -26,
          "replies": {
            "hk9xhuu": {
              "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk9xhuu/",
              "text": "I never said I wouldn't grade past the minimum, just the maximum. I figured the OP was talking about the maximum count. And its in the assignment that grading stops at the end of the maximum page count.",
              "author": "archaeob",
              "created": 1636679621,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "hk8x731": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk8x731/",
      "text": "Depends on the prof. Many times they put a page count for themselves for grading as it's not fun to grade 10+ pages per student when there is 50+ students in the class. Sometimes a page limit is because you might run into the same limit in research as well as knowing what information is important to keep and what can be omitted. Overall, it depends on the prof. It also depends on what you wrote. Is it accurate, does it pertain to the paper, etc.\n\nedit: Many also just stop once the page limit is hit and just looks for formatting issues. So most likely they aren't reading the whole things anyway.",
      "author": "noelblossom",
      "created": 1636663341,
      "upvotes": 11,
      "replies": {}
    },
    "hk8y55d": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk8y55d/",
      "text": "If you're worried about how professors will feel about you handing in assignments that greatly exceed the page minimum, you could always just ask them what they think. \n\nIn my experience, professors who don't want you to write too much will give a page range that your assignments should be in, and you should try to get in the ballpark of that range. If there's no range and just a minimum or no range or minimum at all, then you're *probably* good but it still might be best to ask.",
      "author": "HumanDrinkingTea",
      "created": 1636663730,
      "upvotes": 5,
      "replies": {}
    },
    "hk8wwbk": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk8wwbk/",
      "text": "It sort of depends on the professor and the class size really. For my writing intensive course I usually did this because I really liked to dig into the content, the professor loved it too as well but the class size was only 20 and he only taught one other class that was even smaller than that so he was able to analyze and give real feedback. If its a course with 100+ people and the professor teaches one or two more then I wouldn't bother. They won't have time to read your paper you put your heart into and one of mine in a class that big even admitted that he mainly skims to check if it follows the structure he wanted, if the citations are correct, and thats it.",
      "author": "Sermos5",
      "created": 1636663217,
      "upvotes": 3,
      "replies": {}
    },
    "hk8zakc": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk8zakc/",
      "text": "i appreciate all the feedback! i’ll try to cut the fat from my paper so that it isn’t past the page limit. thank you for being kind and explaining to me!!",
      "author": "tacticalcop",
      "created": 1636664200,
      "upvotes": 2,
      "replies": {}
    },
    "hk9xd5w": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hk9xd5w/",
      "text": "it is annoying for them AND for you, because now they will just skim over the paper instead of actually reading it and potentially miss important stuff. then they will think you are missing it and dock points.\n\nsame thing happens at work — either they skim and miss details (and then ask you for the details again, wasting everyone's time) or they take excessive time to read the whole thing that could've been shorter.",
      "author": "wobbletelescope",
      "created": 1636679559,
      "upvotes": 2,
      "replies": {}
    },
    "hkc0aej": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hkc0aej/",
      "text": "I make my expectations clear to students. They are allowed a small amount of room in terms of exceeding page limits. If a student has been extra attentive and provided details, I feel delighted. Be sure you know the expectations of the instructor.",
      "author": "Kingarvan",
      "created": 1636725894,
      "upvotes": 2,
      "replies": {}
    },
    "hkaezy2": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hkaezy2/",
      "text": "As a TA who does the grading in a few courses, I don't really care.\n\nThat being said, I still recommend against it. I have noticed that students tend to be prone to getting too big for their britches in their analyses and start saying things that involve more advanced topics we don't cover in the course. I have had a few that got so bad that it looped around and they undermined the basis of their decision for the assignment. \n\nEven though they started out correct, and would have been if they followed instructions, expanding beyond scope made them lose points.\n\nBasically, be aware of what you know, and careful of circular logic.",
      "author": "the_Q_spice",
      "created": 1636687778,
      "upvotes": 1,
      "replies": {
        "hkaf78n": {
          "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hkaf78n/",
          "text": "the assignment is for a developmental psychology class and is titled ‘your life story’ where you apply your own experiences in your personal childhood development to the theories we’ve been taught. the limit is 5-6 pages if i remember right, and im struggling with staying in that range considering the amount of questions being asked",
          "author": "tacticalcop",
          "created": 1636687874,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkad6oo": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hkad6oo/",
      "text": "it really depends. some have hard page limits, which i think is a valid practice to teach succinct writing. usually these are in lower division classes and especially for exam-style essays that test your understanding of class materials, not requiring much independent research. others i've had don't specify a page minimum or maximum and trust you to use your best judgement. these are usually for big research papers in upper level courses with smaller class sizes, which makes sense because you don't want to limit a student if they're willing to put in the work for a seriously good research paper. by senior year a lot of students are probably looking to get writing samples for grad school or trying to get something published. at that point, page limits can take those opportunities away or at least make them harder to achieve.",
      "author": "spankedwalrus",
      "created": 1636686917,
      "upvotes": 1,
      "replies": {}
    },
    "hkd7qdg": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hkd7qdg/",
      "text": "I’ve had profs specifically state that they’re not reading past the limit they set out. One prof, who I actually literally loved, would say “make sure all your good points and arguments are before the word count limit, cus it’s not being read if it’s after”. \nBeing a good writer means also having the ability to write concisely. Your prof should have made their expectations clear, so I would check the syllabus or email them to see what they want. \n\nI’ve had other profs give word count limits and say that they’re fine with giving a 15 percent margin. So for example, if they assigned a 1000 word paper, they’re okay with you writing between 850 to 1150 words. For them, that’s acceptable.  \n\nIt depends on the preference of your profs.",
      "author": "Unknown14428",
      "created": 1636744070,
      "upvotes": 1,
      "replies": {}
    },
    "hkanc47": {
      "link": "/r/college/comments/qru8uc/do_professors_dislike_students_that_turn_in/hkanc47/",
      "text": "High school:\n **word requirement**: 2500\n **draft one**:750 \n\nCollege: \n**word limit**: 750 \n**draft one**: 2500",
      "author": "Agua_Fresca_Cuh",
      "created": 1636691855,
      "upvotes": 0,
      "replies": {}
    }
  }
}