{
  "sid": "qocd8h",
  "link": "/r/college/comments/qocd8h/is_it_okay_to_ask_a_ta_to_be_friends_after_the/",
  "title:": "Is it okay to ask a TA to be friends after the semester?",
  "text": "\\*\\*\\*I AM NOT TALKING ABOUT ASKING THEM OUT\\*\\*\\*\n\nOkay, so, in community college, the lines were a bit more blurred. I have at least five of my old professors in my contacts, we go out to lunch sort of regularly now, and we were exchanging memes even before I actually graduated. Once I was no longer their student (but before I graduated), we were friends on FB and pretty chill overall, and that was totally fine. Here at my four-year university, the rules seem quite a bit different, and so I'd just like to figure out what's okay. \n\nThere's a TA for a class I'm in right now, and they're the same age as me (I'm an older student) and pretty chill. We talk about baseball and music and stuff, and it just seems like we're into similar things. There's a bit of overlap between our research interests, and I'd love to pick their brain about that. I understand that it would probably be inappropriate to ask them to be friends or anything *other* than my TA while the term is still in session; I definitely don't want to create a conflict of interest or step on any toes. But after final grades are in, would it be okay to reach out and ask this person if they would be okay keeping in touch? What's proper etiquette here?",
  "author": "karatecoconut",
  "created": 1636242529,
  "updated": 1636655791,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.95,
  "comments": {
    "hjm36mw": {
      "link": "/r/college/comments/qocd8h/is_it_okay_to_ask_a_ta_to_be_friends_after_the/hjm36mw/",
      "text": "I don’t see anything wrong with that.",
      "author": "dotuanhiep",
      "created": 1636242623,
      "upvotes": 17,
      "replies": {}
    },
    "hjmiema": {
      "link": "/r/college/comments/qocd8h/is_it_okay_to_ask_a_ta_to_be_friends_after_the/hjmiema/",
      "text": "Definitely wait until the semester ends, like you said. Maybe a couple weeks after Finals are entered. Send them a thank-you email and say something along the lines of \"hey, I really enjoyed talking to you and realize we have a lot in common. if you're up for it, I was thinking about getting tickets to a \\_\\_\\_ baseball game\" or something casual.",
      "author": "beepbopboopbop69",
      "created": 1636249836,
      "upvotes": 4,
      "replies": {}
    },
    "hjm5550": {
      "link": "/r/college/comments/qocd8h/is_it_okay_to_ask_a_ta_to_be_friends_after_the/hjm5550/",
      "text": "Is your TA studying at the same university.\n\nYou will probably find that they are just studying at a much higher level than you. Often when you get up to masters degrees and things you are required to teach students.\n\nYou are not allowed to ask her out. As others have said because professionalism, however there's nothing wrong with being friends",
      "author": "Impressive-Name5129",
      "created": 1636243526,
      "upvotes": 4,
      "replies": {}
    },
    "hjpfxht": {
      "link": "/r/college/comments/qocd8h/is_it_okay_to_ask_a_ta_to_be_friends_after_the/hjpfxht/",
      "text": "It should be fine as there is no conflict of interest anymore.\n\nWhy do so many people start sentences with \"ok, so...\"?",
      "author": "iwoodcraft",
      "created": 1636310945,
      "upvotes": 0,
      "replies": {}
    }
  }
}