{
  "sid": "qwcqwb",
  "link": "/r/college/comments/qwcqwb/help/",
  "title:": "Help?",
  "text": "I made a post a week or 2 back about asking out a girl and I decided to do it. I asked her out after class and all she said was that she would text me and lmk, and honestly based on her reaction I had already gotten the idea that she didn’t really want to go and and she never ended up texting me. I didn’t want to be weird and follow up or ask her why she didn’t so I was just planning on acting like nothing happened when I saw her the next time in class. When I saw her she immediately apologized and said that she forgot and that she wanted to reschedule till after finals and she apologized again after class. The logical part of me is just assuming that she made it up and didn’t want to seem rude (which is fine) but at the same time idk. What do you guys think?",
  "author": "matt44160",
  "created": 1637194224,
  "updated": 1637354175,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hl2cufn": {
      "link": "/r/college/comments/qwcqwb/help/hl2cufn/",
      "text": "Fam she hit you with the double apology, see where things go.",
      "author": "mychal200302468",
      "created": 1637199391,
      "upvotes": 6,
      "replies": {
        "hl2ixq4": {
          "link": "/r/college/comments/qwcqwb/help/hl2ixq4/",
          "text": "Her apologizing twice is a good thing? I didn’t really think anything of it",
          "author": "matt44160",
          "created": 1637202132,
          "upvotes": 2,
          "replies": {
            "hl2peee": {
              "link": "/r/college/comments/qwcqwb/help/hl2peee/",
              "text": "I feel like if she wasn’t into you she wouldn’t say anything when you walked into class the next day.",
              "author": "bottleoftrash",
              "created": 1637205098,
              "upvotes": 6,
              "replies": {
                "hl30guk": {
                  "link": "/r/college/comments/qwcqwb/help/hl30guk/",
                  "text": "as a girl, yes, this person is right. I would like major avoid a person if I didn’t want to go out with them after they’d asked me. And anyway, what’s the risk in following up with her? Worst case scenario she says she’s not interested and you’re in the same place you would’ve been if you hadn’t asked her. Best case scenario, she says yes and you have a fun time",
                  "author": "sarachomma",
                  "created": 1637210660,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl3x79r": {
      "link": "/r/college/comments/qwcqwb/help/hl3x79r/",
      "text": "she is keeping her options open.  you are plan b, thats why she pushed you all way after finals. there some other guy and she wants to see how things go there.",
      "author": "ghostmode342",
      "created": 1637234793,
      "upvotes": -1,
      "replies": {
        "hl3zd2n": {
          "link": "/r/college/comments/qwcqwb/help/hl3zd2n/",
          "text": "Or maybe shes concerned with her classes? People have lives that don’t revolve around yours, no need to inject your insecurities onto people online.",
          "author": "Caskinbaskin",
          "created": 1637236326,
          "upvotes": 4,
          "replies": {
            "hl4012k": {
              "link": "/r/college/comments/qwcqwb/help/hl4012k/",
              "text": "good try troll, i reported you",
              "author": "ghostmode342",
              "created": 1637236787,
              "upvotes": -1,
              "replies": {}
            }
          }
        },
        "hl4jc1n": {
          "link": "/r/college/comments/qwcqwb/help/hl4jc1n/",
          "text": "Finals aren’t far away tho. We have thanksgiving break soon and finals are the week we come back from that",
          "author": "matt44160",
          "created": 1637246927,
          "upvotes": 2,
          "replies": {
            "hl4p9cu": {
              "link": "/r/college/comments/qwcqwb/help/hl4p9cu/",
              "text": "it is weak excuse, i wouldnt buy it, just my opinion",
              "author": "ghostmode342",
              "created": 1637249432,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    }
  }
}