{
  "sid": "qln1cp",
  "link": "/r/college/comments/qln1cp/what_can_and_should_i_do_to_start_aiming_for_the/",
  "title:": "What can (and should) I do to start aiming for the best chance of getting into a college of my choice?",
  "text": "I am currently a freshmen in highschool, and I know what you are thinking. \"Don't worry about college until your junior/senior year.\" Currently, I'm not treating college as something of my main concerns, but I prefer to have a head start. I feel like I don't have any outlining characteristics or talents like everyone else has regardless of their grade. People who aren't aiming for at least an 'A' usually are really good at sports and probably won at least one major tournament. However, I just feel like I can do things up to a point, and then stop. \n\nI don't really have anything I'm particularly proud of or good at. The only thing that I have going for me is my grades. I have an older sibling (2 year gap) and I literally looked at class notes and self taught myself with the notes and online resources. My sibling has a passion for writing and focuses on creative writing and literature (two subjects I have no interest in).\n\n I find myself to be a jack of some trades, master of none. I can do most things up to a point, but I feel that I'm going to run out of things to do. I have nothing to showcase purely because it is nearly impossible for me to do anything outside of maybe a minor regionals (and even that would be a miracle) because of how competitive the district as well as schools around the district are. I know that I'm still a good 3.5 years away from finishing high school, but I personally think I should get ahead with the advantage I created with my work. How should I proceed so that I add something of significant importance to help me stand out from others?",
  "author": "WhereAdc",
  "created": 1635914945,
  "updated": 1639849077,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj44jda": {
      "link": "/r/college/comments/qln1cp/what_can_and_should_i_do_to_start_aiming_for_the/hj44jda/",
      "text": "Become rock solid in math up thru calculus and English and kill it on the SAT. Involvement in some kind of club always helps too, especially if you know what you wanna study",
      "author": "harry01772",
      "created": 1635917338,
      "upvotes": 3,
      "replies": {}
    },
    "hjctar0": {
      "link": "/r/college/comments/qln1cp/what_can_and_should_i_do_to_start_aiming_for_the/hjctar0/",
      "text": "I agree with the above comment. Writing is also something to work on. Your writing is good now, so this comment isn’t based on you specifically. However, many college freshman seriously struggle with basic grammar and essay writing, so it’s something keep in mind. \nI would also say that doing an extracurricular has merit even if you don’t think you’ll be the “best” at it. Colleges want to see that you’re well-rounded and have interests outside of school, even if you’re not necessarily competitive. \nI think your approach of thinking about these things but not obsessing is great. You’ll be glad you planned a little when you’re a senior.",
      "author": "idontcareaboutttt",
      "created": 1636072443,
      "upvotes": 1,
      "replies": {}
    },
    "hmqz6ap": {
      "link": "/r/college/comments/qln1cp/what_can_and_should_i_do_to_start_aiming_for_the/hmqz6ap/",
      "text": "You are a good writer, though, so even if it's not your passion that will be a plus on college essays.  You'd be amazed at the unintelligible crap that is the best many of your peers can do.  Meanwhile, you say you are a \"jack of all trades, master of none\", but what interests you? What gets you going?  In a broad sense, do you like reading and writing, or working with your hands?  Are you a creative type or more of a science guy?  Do you like public speaking, or do you keep to the background?  Is there a career field that you think you'd like to pursue?  Do you have a hobby that isn't something you learn in school, like stamp collecting or wine tasting (obvs not that because you're underage, but you get what I mean)?  There are tons of possible majors in college, and answering these questions will guide you to the right school for you.\n\nBut if nothing really sparks your interest over the next three years, your best bet is to read widely, continue to write well, and stay open to opportunities.  I didn't know I wanted to be a public defender until I graduated from college, but reading and writing were skills that got me there.",
      "author": "PierogiEsq",
      "created": 1638327785,
      "upvotes": 1,
      "replies": {}
    }
  }
}