{
  "sid": "qs5d0x",
  "link": "/r/college/comments/qs5d0x/i_dontt_like_what_i_am_studying_in_college_what/",
  "title:": "I dont't like what I am studying in college. What options do I have?",
  "text": "Bit of a background: I am a Second Year CSE Major in one of the best Institutes in India. However, I have lost interest in the course that I am studying and have zero inclination to pursue it further. I am over a thousand kilometres from home, so discussing this with my parents right now is not an option. I don't even know what to do in life. I don't have many close friends here with whom I can discuss this. I request my fellow Redditors to help me.",
  "author": "a388861",
  "created": 1636699104,
  "updated": 1636745400,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hkb7b8r": {
      "link": "/r/college/comments/qs5d0x/i_dontt_like_what_i_am_studying_in_college_what/hkb7b8r/",
      "text": "check with your advisor and possibly professors you are close with to try to find a major similar, but one you like, to not have to retake classes. since you’re only a second year and (assuming) you don’t have a ton of credits, find something you like! it’s okay to take a break from school!",
      "author": "TheMadly1",
      "created": 1636705363,
      "upvotes": 3,
      "replies": {
        "hkbihe1": {
          "link": "/r/college/comments/qs5d0x/i_dontt_like_what_i_am_studying_in_college_what/hkbihe1/",
          "text": "There are not any professors that I am close to. I tried contacting the advisor through multiple channels, but no response. The issue is that the past 1.5 years have been completely online. Even though I am on campus, my lectures are still online and I have not met any of my professors till now. Also, there is not any major that I like that I am eligible to take. In fact, the other majors are much worse.",
          "author": "a388861",
          "created": 1636715106,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}