{
  "sid": "rfpx41",
  "link": "/r/college/comments/rfpx41/is_going_to_a_community_college_a_good_idea/",
  "title:": "Is going to a Community College a good idea ?",
  "text": "From what I hear is going to a community college is a good idea and that after I attend those two years I can easily transfer to a 4 year college, also if I attend a community college I can get it payed for free without having to pay back the loan. But I have the chance to go to a 4 year so I'm not sure what's the best choice.",
  "author": "SeaBathroom6138",
  "created": 1639429076,
  "updated": 1639516120,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hofdxpd": {
      "link": "/r/college/comments/rfpx41/is_going_to_a_community_college_a_good_idea/hofdxpd/",
      "text": "All this information is correct. \n\nIt's very easy to transfer. Just understand and communicate with the University that you will potentially transfer to and make sure what curriculums should you take in the community college to consider you as transfer student.",
      "author": "Comfortable_Grab_279",
      "created": 1639429622,
      "upvotes": 2,
      "replies": {}
    },
    "hofgce1": {
      "link": "/r/college/comments/rfpx41/is_going_to_a_community_college_a_good_idea/hofgce1/",
      "text": "If you know exactly what you want to do and are a top student, you might be able to network and get relevant work experience with a high profile company after your sophomore year at a 4 year, but that's a low percentage of students. If you don't think that's the case, and you don't have a bunch of scholarships, the community college is the much safer way to go.",
      "author": "Thelton26",
      "created": 1639430608,
      "upvotes": 2,
      "replies": {}
    },
    "hoh4u7t": {
      "link": "/r/college/comments/rfpx41/is_going_to_a_community_college_a_good_idea/hoh4u7t/",
      "text": "Yes my advice just meet with a transfer counselor from the school you want to attend and make sure you find the right advisor for your subject.  I once took a psychology stats class my advisor told me transferred only to find out. It wasn’t accepted and had to retake it. Another word of friendly advice  use rate my professor when searching for professors.",
      "author": "ClientLegitimate4582",
      "created": 1639458371,
      "upvotes": 2,
      "replies": {}
    },
    "hoffiih": {
      "link": "/r/college/comments/rfpx41/is_going_to_a_community_college_a_good_idea/hoffiih/",
      "text": "Community College is cheaper. If you have A+, not a huge deal. If you live on campus, eat on campus, and buy your books from the campus, then you will pay more than you would at a community College with A+ still. But, if you have family in the area that will let you stay with them, a way to get free/cheap/make your own food, and find your books online for free, it'll be the same with A+.\n\nMake sure you communicate with the College you're planning on transferring to so the credits will transfer. You don't need your associates degree from the community College to transfer credits, btw. They will transfer with or without it as long as the other school will let them.",
      "author": "tidyshark13574",
      "created": 1639430266,
      "upvotes": 1,
      "replies": {}
    },
    "hogyq8c": {
      "link": "/r/college/comments/rfpx41/is_going_to_a_community_college_a_good_idea/hogyq8c/",
      "text": "\"also if I attend a community college I can get it payed for free without having to pay back the loan\"\n\nHmm... in certain cases maybe. Whoever told you this might have been talking about a specific scenario that would be applicable to you. But generally speaking outside of special exceptions that may exist, you do have to pay for CC and also have to pay back any loans you take out.\n\n\"But I have the chance to go to a 4 year so I'm not sure what's the best choice.\"\n\nIt's somewhat personal. If it's purely about the cost benefit, I typically recommend against doing the first two years there and instead suggest taking summer classes there starting the summer before freshman year. The reason being that spending the first two years at CC can set you back in terms of networking, major courses, self-development, internship opportunities, etc. You have less attachment to campus at a CC, the transfer rate isn't that high, and a lot of students that do transfer to a four year are seniors by the time they get used to it. Life lesson: cheap in the short term doesn't necessarily mean cheap in the long term.\n\nOne reason to attend would be if your high school GPA was very low. Another would be if you were just too immature to go off to a four year, but if that was the case then I don't even think you would be mature enough to know if college is the right option.",
      "author": "darniforgotmypwd",
      "created": 1639455219,
      "upvotes": 1,
      "replies": {
        "hogz4gb": {
          "link": "/r/college/comments/rfpx41/is_going_to_a_community_college_a_good_idea/hogz4gb/",
          "text": "The aid I'm getting is the cal dream act",
          "author": "SeaBathroom6138",
          "created": 1639455409,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}