{
  "sid": "quo5n8",
  "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/",
  "title:": "Any advice on speaking in public?",
  "text": "I have to make a presentation to 80+ people (that is worth 20 points so I have to do it). However I have anxiety so I cannot express myself well in front of crowds. What should I do?",
  "author": "philosophussapiens",
  "created": 1637004156,
  "updated": 1637181437,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.95,
  "comments": {
    "hkrevmr": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkrevmr/",
      "text": "The only person out of those 80 people who matter is your professor who will be the grading. You are not impressing them but the professor. Plus they dont have any reason to be invested in your presentation, they’re just busy fretting over their own presentations or zoning out on their laptops on another tab looking focused. As long as you dont set off any fire alarms, they most likely wont care nor remember. Sorry I couldn’t give much solid advice, I hope the best for you",
      "author": "NoUsernameIdea1",
      "created": 1637006891,
      "upvotes": 16,
      "replies": {
        "hkrwg2e": {
          "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkrwg2e/",
          "text": "Thank you very much. You are right, they won’t be completely listening so that really helped me calm down. Have a good day.",
          "author": "philosophussapiens",
          "created": 1637013775,
          "upvotes": 8,
          "replies": {}
        },
        "hktbp55": {
          "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hktbp55/",
          "text": "This, I tell myself this every single time because when I listen to other people presentation I also don’t pay much attention so there no reason for other people to listen to mine",
          "author": "mai_mai0327",
          "created": 1637036523,
          "upvotes": 3,
          "replies": {}
        },
        "hktvkbr": {
          "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hktvkbr/",
          "text": "For the exact same reason our teacher used to let only one student do a presentation a day.\nIt was awesome cause first we get almost a presentation daily and no one focus on not sucking up their presentation while someone is lecturing.",
          "author": "Alexalenin",
          "created": 1637049307,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkrfj9r": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkrfj9r/",
      "text": "You are putting on a performance--it is performance art. \n\nKnow your material well. Don't put too much text on slide. Don't read slides.",
      "author": "Warm_Strategy_5070",
      "created": 1637007154,
      "upvotes": 6,
      "replies": {
        "hkrwxmc": {
          "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkrwxmc/",
          "text": "Thank you. I was wondering if practicing in front of a mirror could help. I will make sure to practice enough before I do it, because indeed, talking is a form of art. Have a good day.",
          "author": "philosophussapiens",
          "created": 1637013967,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hku5lod": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hku5lod/",
      "text": "I love public speaking, I do stand up and others forms of public entertainment. I tell you this right now I get nervous and want to walk away every time before I step on stage. here are my tips that help me \n1. know the material it boost your confidence not having to read it on the spot or stumble through it.\n2. less words on visual aids they don't know what i am going to say so I cant mess up the words they don'tknow them.\n3. no one wants to see you fail so the crowd is already on your side so you have 80+ hoping you do good.\n4. if its a stage you won't be able to see pass the 3rd row.\n5. that moment is your time. you control the room say nothing its quite say something its and you are the only one talking. you control the time, spacing, and rhythm of the room. \n6. at the end if the day who the fuck are these people? they're nobodies, you family is still your family, friends are the same, dog still going to do the happy dance when you get home. so who cares what they think you lose nothing and can only gain. sorry about the spilling it's 3am and I am falling asleep.",
      "author": "markjackson111",
      "created": 1637057722,
      "upvotes": 3,
      "replies": {
        "hkuhgzq": {
          "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkuhgzq/",
          "text": "Thank you very much. I’ll definitely remember the third one, I am sure that will keep me at ease. All of those are are helpful, though. Have a good day.",
          "author": "philosophussapiens",
          "created": 1637066368,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkrmozv": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkrmozv/",
      "text": "Your school likely has a speaking program, like tutors, whom you could meet with.",
      "author": "wetbogman2",
      "created": 1637009950,
      "upvotes": 2,
      "replies": {
        "hkrxhdb": {
          "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkrxhdb/",
          "text": "Thank you for answering. Yes, they actually do care for students to be ready for any kinds of entrepreneurship after they graduate so, true, I might try to learn advanced techniques from them. Have a good day.",
          "author": "philosophussapiens",
          "created": 1637014192,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hksys63": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hksys63/",
      "text": "Just speak about your topic. simple as that. nobody is gonna really focus on your specific presentation because they are all gonna be too stressed about their own. It gets better but you’ll be fine:)",
      "author": "ricebol18",
      "created": 1637030454,
      "upvotes": 2,
      "replies": {}
    },
    "hktgptp": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hktgptp/",
      "text": "This may not seem relevant but it does help. Bring with you a bottle of water or something and just hold it with you. This way your hands will have something. It makes me feel less awkward.",
      "author": "WalmartDarthVader",
      "created": 1637039271,
      "upvotes": 2,
      "replies": {
        "hkth4sx": {
          "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkth4sx/",
          "text": "Thank you. That is a good idea. I don’t know if it looks awkward but I can try drinking water when I can’t find words or to organize my thoughts.",
          "author": "philosophussapiens",
          "created": 1637039512,
          "upvotes": 2,
          "replies": {
            "hkthqqs": {
              "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkthqqs/",
              "text": "I find it particularly helpful when presenting with other people. When they are talking I don’t know what to do (when I am talking I can at least use my hands to do gestures) so I bring a bottle of water with me.",
              "author": "WalmartDarthVader",
              "created": 1637039868,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hktvcrm": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hktvcrm/",
      "text": "Just get one for your best friends to sit in the center of the crowd and start lecturing him/her and forget about everyone else. \nOr just focus on one of the audiences and start lecturing them like you would do normally of you lecture people a lot (I do) and you are good to go. \nIt's harder than it looks but if it works it works",
      "author": "Alexalenin",
      "created": 1637049145,
      "upvotes": 2,
      "replies": {
        "hktvidg": {
          "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hktvidg/",
          "text": "Thank you very much. That is a great idea.",
          "author": "philosophussapiens",
          "created": 1637049265,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hkutbvx": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hkutbvx/",
      "text": "Pick three people in house left, house center, and house right; better still if one is the grader. Talk directly to them. \n\nCan you talk to three people? Those are your only people in the room. Everyone else doesn't matter.",
      "author": "SamSeebourne",
      "created": 1637072507,
      "upvotes": 2,
      "replies": {}
    },
    "hks5yi4": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hks5yi4/",
      "text": "This is called stage fright. Like... 99% of people suffer from this. \n\nJust do it. You'll be fine. You'll get better at it over time.",
      "author": "Awkward_Mail_2786",
      "created": 1637017706,
      "upvotes": 2,
      "replies": {}
    },
    "hksgszk": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hksgszk/",
      "text": "If you have anxiety problems you could tell your doctor and they'll prescribe you something. Since I got into college my anxiety had spiked. Since I got prescribed some medication it really did help especially at my first job. My job was both makeup artist and scare actor for fright fest that had a lot of communication involved. Also I was the total opposite of an actor with me being an introvert.\n\nSo, if you have more speeches in the future and or having problems with your anxiety you could get medication from your doctor.\n\nYou dont have to just putting a possible option.",
      "author": "Doodle-Biter",
      "created": 1637022459,
      "upvotes": 1,
      "replies": {}
    },
    "hktgih7": {
      "link": "/r/college/comments/quo5n8/any_advice_on_speaking_in_public/hktgih7/",
      "text": "Realize that these people are strangers and their most likely not even paying attention to you they are thinking of some other random thought.\n\nAlso see your future self years later and this speech will have been long over with and the outcome likely wasn't important to the grand scheme of your life",
      "author": "smitty9207",
      "created": 1637039158,
      "upvotes": 1,
      "replies": {}
    }
  }
}