{
  "sid": "rgmbm5",
  "link": "/r/college/comments/rgmbm5/does_anyone_else_dislike_their_college_how_are/",
  "title:": "Does anyone else dislike their college? How are you dealing?",
  "text": "I'm a sophomore at a small liberal arts college in the Midwest. It was my fourth choice. My first choices were Kenyon, Oberlin, and Denison, but none of them gave me enough scholarship money to go. My current school is okay. It's nothing special and I'm jealous every time I think about my bf/friends' colleges that are better than mine. I feel stupid and inadequate going here. My school is in the middle of nowhere, an hour away from home. The food is disgusting and the campus is boring- there is literally nothing to do here. I was extremely upset that I had to go here when I was a senior in hs but now I am just perennially dissatisfied. I can't transfer to my top choices because it's too late and I still wouldn't be able to afford them. Anyone else feeling this?",
  "author": "Breadorange",
  "created": 1639530034,
  "updated": 1639787975,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hol30u8": {
      "link": "/r/college/comments/rgmbm5/does_anyone_else_dislike_their_college_how_are/hol30u8/",
      "text": "Why not just do college online.",
      "author": "Feltycabbage21",
      "created": 1639530246,
      "upvotes": 1,
      "replies": {
        "hol4fdl": {
          "link": "/r/college/comments/rgmbm5/does_anyone_else_dislike_their_college_how_are/hol4fdl/",
          "text": "I don't want to live at home as an adult lol, also my sister lives at home so I don't want to overwhelm my family",
          "author": "Breadorange",
          "created": 1639530889,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "holzq3z": {
      "link": "/r/college/comments/rgmbm5/does_anyone_else_dislike_their_college_how_are/holzq3z/",
      "text": "Just try to make the best of it, maybe try getting a job so you can afford a car?\n\nMaybe try looking into transferring with a scholarship?",
      "author": "hasrocks1",
      "created": 1639546065,
      "upvotes": 1,
      "replies": {}
    }
  }
}