{
  "sid": "r1itt7",
  "link": "/r/college/comments/r1itt7/how_many_extracurriculars_do_i_really_need_to_do/",
  "title:": "How many extracurriculars do I really need to do?",
  "text": "Sophomore here. I go to a small school and do XC/Track (d3, but that still eats up a lot of time), work very part-time but plan on increasing that, and I’m one club that requires minimal time commitment. I am a STEM major. Recently, I’ve been going on LinkedIn and getting super, well, jealous honestly. My GPA is “only” about a 3.4. I’ve found out from LinkedIn that so many of my classmates in my major have really high GPAs and are in a long list of extracurriculars with board positions. I just can’t do that. I get tired easily honestly. Also so many of them have internships lined up. Do I really need to be in a bunch of clubs? I just don’t have the interest. To be clear I’m not talking about eschewing professional societies. But I don’t see myself joining or sustaining participation in Greek life, service clubs, or clubs like film club. \n\nEdit: I was originally planning to graduate in 2023, but I’m not going to now, hence my old flair.",
  "author": "Queasy_Repair251",
  "created": 1637798431,
  "updated": 1638207341,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hlzhcu1": {
      "link": "/r/college/comments/r1itt7/how_many_extracurriculars_do_i_really_need_to_do/hlzhcu1/",
      "text": "In my opinion being a student athlete looks just as good as being a member in a club. Athletics takes up a lot of time (I was a student athlete for just over a year) and combined with classes can be a lot. Also don't stress about a 3.4 GPA thats still really good.",
      "author": "Nosleep_9764",
      "created": 1637807945,
      "upvotes": 1,
      "replies": {}
    },
    "hm19eam": {
      "link": "/r/college/comments/r1itt7/how_many_extracurriculars_do_i_really_need_to_do/hm19eam/",
      "text": "Depends on where you are applying to college.  If Ivy League, you need a shit-ton- and you need to be a leader in multiple.  If just a no-name state school one or two.",
      "author": "GenXtreme1976",
      "created": 1637849018,
      "upvotes": 1,
      "replies": {
        "hm1e6wh": {
          "link": "/r/college/comments/r1itt7/how_many_extracurriculars_do_i_really_need_to_do/hm1e6wh/",
          "text": "I’m already in college. I meant for applying to jobs, internships, and scholarships.",
          "author": "Queasy_Repair251",
          "created": 1637851475,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}