{
  "sid": "qtnmzu",
  "link": "/r/college/comments/qtnmzu/for_those_who_are_studying_abroad_and_have_left/",
  "title:": "For those who are studying abroad and have left family behind, how did you do it? do you regret it?",
  "text": "Was it hard? Can you tell me about it? I am currently a bit conflicted as to whether to do it or not. I've seen and known people who have up and left parents and siblings and never came back, they didn't cut communications, but are still a couple of hours flight away. I just keep thinking, is it possible they might need me one second and I am just not there? Then I think about how I actually didn't have that much of a role before exactly, it's not like I had some sort of specific responsibility before like taking care of someone. Does it even matter if I get permission from my parents? I mean I am certain they would say yes, and have indeed actually done before, but does it even matter? I honestly don't know what to do.",
  "author": "PsychologicalDrawer0",
  "created": 1636888006,
  "updated": 1637181611,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "hkkt3hn": {
      "link": "/r/college/comments/qtnmzu/for_those_who_are_studying_abroad_and_have_left/hkkt3hn/",
      "text": "I moved to Scotland from the Midwest in August, while it was difficult leaving my family behind it was far from impossible, and I don't really regret it. I think you never really sure if you can do it until you actually do. While nothing terrible's happened while I've been gone, my elderly dog has had some health scares, but none of it freaked me out to the point I needed to go home. If I were you I'd go, you'd just regret it otherwise, the world is so much bigger than your campus.",
      "author": "kycantina",
      "created": 1636890308,
      "upvotes": 3,
      "replies": {}
    },
    "hkl7xgr": {
      "link": "/r/college/comments/qtnmzu/for_those_who_are_studying_abroad_and_have_left/hkl7xgr/",
      "text": "i and most of my friends in hs study in a country where our parents don’t live in.\n\nit is difficult in the beginning a lot of our friends are able to j hope on a bus or a 1h flight to see family whereas we can’t. but it gets easier, at some point people do move away from home and it is a lot of fun experiencing a new environment. it’s very easy to stay in touch, i usually message my parents on a gc throughout the day j updating them like sending a photo of my lunch etc. it’s also really easy to call them when ur running errands like laundry or picking up groceries.",
      "author": "trackxdreams",
      "created": 1636899016,
      "upvotes": 2,
      "replies": {}
    },
    "hkmyenu": {
      "link": "/r/college/comments/qtnmzu/for_those_who_are_studying_abroad_and_have_left/hkmyenu/",
      "text": "Best times of my life. Me from SE Europe in the 1980s 1990s in the USA Pennsylvania and NYC.",
      "author": "Toxovolo",
      "created": 1636924453,
      "upvotes": 1,
      "replies": {}
    },
    "hkr4aq3": {
      "link": "/r/college/comments/qtnmzu/for_those_who_are_studying_abroad_and_have_left/hkr4aq3/",
      "text": "I haven't gone abroad for college and I kinda regret it. I wish I had enough knowledge and awareness about scholarships and other things at that time. Also, I don't think my parents have enough resources to help me to go study abroad and I don't want to work in college years. So, yeah, I'm here for now. I'd recommend you to go for it (especially if you're from Asian countries like me) if you have the opportunity. You can't stay with your parents forever, right? You'll have to get a job and your own house and family one day. You can stay connected with your parents online and they know how to take of themselves (they've been taking care of themselves and you for all these years).",
      "author": "TheRisingPhoenix1",
      "created": 1637002708,
      "upvotes": 1,
      "replies": {}
    }
  }
}