{
  "sid": "qefayz",
  "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/",
  "title:": "My Roommate Assaulted Me, What Do I Do?",
  "text": "TW: physical assault, racism, sexism\n\nSo, I recently moved in to a nice dorm as a freshman in college, and I did not know my roommate beforehand. I met him on the roommate portal for the college, and he seemed relatable and nice, so I chose him as my roommate. \n\nHowever, once I moved in, I realized that he was very different than I thought. I could tolerate our polar opposite political views, his carnivore diet, and his annoying tendencies.\n\nHowever, what I could not tolerate were his physical tendencies and insults.\n\nMy roommate constantly insults and belittles others, where he has called women “fatasses” and “big tits,” objectifying them. He has very twisted views about women and minorities, to the point where he has said flat out that he hates all Asian people.\n\nOk, so you might be reading all of this so far and be saying “yeah, he’s a dick, but that’s life.” And this is what I told myself too. Until he was physical with me.\n\nFirst, he fake kidnapped me by texting some of his friends to put a bag over my head while I was walking to the dorm at night. I played along in the moment, but this is a very fucked up thing to do, and the justification I made is that my roommate just loves pranks and this is how he is.\n\nSecond, I got a grade back for an exam I didn’t want to reveal, and he grabbed me and shoved me onto a chair, holding me down until I revealed my grade to him. I don’t really care that I had to give up my grade, but I care A HELL OF A LOT that he grabbed, shoved, and held me down like it is nothing.\n\nThird, my roommate was trying to annoy me by taking over my conversation with someone else by spouting nonsense. I got really frustrated, so I went over to him, tapped his shoulder with a pair of clothes I was holding, and told him to stop. He then proceeded to get up, scream “You’re dead!” at the top of his lungs, and he pinned me against the wall, screaming into my ears questions about my name , my date of birth, and my favorite color. I felt so confused and violated, so I answered his nonsensical questions and he let me go. While he had me pinned to the wall he screamed in my exposed ear, where every time I would turn my head, he would just go back to screaming in the exposed ear.\n\nStill, I played this off for the night because I didn’t want to address it. Finally at a group therapy session, I worked through what had happened and finally understood what he had done to me was assault. I confronted him , and he didn’t seem to care at all and said what he had done to me was “just a joke.” So I left him notes that I wasn’t joking and that I was serious about feeling uncomfortable with his actions. At this point , I drove home, broke down emotionally, called my friends to tell them what had been happening, told my mom what had been happening, and validated the feelings I had held in for so long of feeling taken advantage of and violated.\n\nAs of right now, I plan on confronting him on Sunday night when I get back to my dorm with the RA on call in case he gets violent.\n\nMy parents want my roommate to get kicked out of our room by the school, and I kind of do too, but the college doesn’t seem to take stuff like this very seriously and I feel that I will have to leave before he gets kicked out.\n\nHas anyone dealt with anything similar to this, and, if so, what did you do and do you have any advice? I am kind of at a complete loss emotionally and am very unsure of what will happen next.\n\nThank you all for reading. I hope I can get through this.",
  "author": "TypicalOcelot8777",
  "created": 1635028956,
  "updated": 1635184185,
  "over_18": false,
  "upvotes": 580,
  "upvote_ratio": 0.96,
  "comments": {
    "hhsr299": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhsr299/",
      "text": "wow, just reading this made me really angry and uncomfortable. i’m sorry you had to go through this, it’s most definitely not normal and you’ve done the right thing by planning to confront him with the RA on call. but even then, i think you should tell your RA that you cannot be roommates with him anymore and try to switch roommates or kick him out. this shouldn’t have to go on longer than it already has.",
      "author": "chloeclaypipe",
      "created": 1635031942,
      "upvotes": 165,
      "replies": {
        "hhsso35": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhsso35/",
          "text": "You make a great point about how I should be upfront with the RA that I should not have to live with him after what he has done to me instead of waiting for him to do it again. I do hope that my living situation can change easily, however there aren’t many spots available on campus and they don’t allow freshman off campus, but I will look into availability. Thank you for your reaction to my post and your suggestion",
          "author": "TypicalOcelot8777",
          "created": 1635032705,
          "upvotes": 38,
          "replies": {
            "hhuwzhx": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhuwzhx/",
              "text": "You need to escalate this beyond your RA. This needs a case manager/ombudsman and the attention of your university. They will move you and threaten to expel this violent fool due to the liability. If he threatens or puts one finger on you again you contact campus and local police and file a report. Have your parents get involved, and they should say they've consulted an attorney.",
              "author": "fsuthundergun",
              "created": 1635081615,
              "upvotes": 15,
              "replies": {}
            }
          }
        }
      }
    },
    "hht2lh0": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht2lh0/",
      "text": "Do not confront this person.  Call your RA now; don't wait to go back to school.  Call the campus police if necessary.",
      "author": "taxref",
      "created": 1635037378,
      "upvotes": 893,
      "replies": {
        "hht38ig": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht38ig/",
          "text": "This is what I was gonna say. Confronting a volatile, violent person will not end well, this is something that should go straight to someone in charge...director of housing probably and they'll know how to handle it.",
          "author": "fox-on-rocks",
          "created": 1635037685,
          "upvotes": 254,
          "replies": {
            "hhtx1mo": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtx1mo/",
              "text": "dont call campus police, call the actual police op. campus police is there to protect the school. the actual police would respond to the situation (i hope) and care about you",
              "author": "notabiologist_37",
              "created": 1635054050,
              "upvotes": 81,
              "replies": {}
            }
          }
        },
        "hht3t23": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht3t23/",
          "text": "Agreed. He sounds pretty unstable.",
          "author": "Animasylvania",
          "created": 1635037965,
          "upvotes": 54,
          "replies": {}
        },
        "hhu5l9w": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhu5l9w/",
          "text": "As a former RA; this is what you should do. \n\nIf there has been violent acts and there is a distinct threat of further violence, your RA should get the police involved. The RAs are not going to be of much help in such a situation by themselves (they do not have the training or equipment to deal with something like that, at my university, we were taught basically to call ahead, or get out ASAP and call, but never confront).",
          "author": "the_Q_spice",
          "created": 1635060723,
          "upvotes": 54,
          "replies": {}
        },
        "hht5fxf": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht5fxf/",
          "text": "^ Definitely do this. At this point it sounds like your safety is at risk. Do NOT confront this person.",
          "author": "AhsokaStark",
          "created": 1635038762,
          "upvotes": 48,
          "replies": {}
        },
        "hht7570": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht7570/",
          "text": "I see what you guys are saying about not confronting him, but I feel like I don’t want to escalate things too much. Then again, I probably should, but I just hate confrontation and have come to terms with the fact that I was going to talk to my roommate with the RA. I thank you all on this comment chain for what you have said, and I will mull over contacting the authorities. I do have the email for the director of housing where I live, so I can contact him tomorrow before I go back and see what he has to say.\n\nThank you all",
          "author": "TypicalOcelot8777",
          "created": 1635039586,
          "upvotes": 34,
          "replies": {
            "hhtk9ty": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtk9ty/",
              "text": "Contact another 3rd person first OR at least have a 3rd person to help keep him in check when you do confront him. This behavior is not something I'd want to see repeated when you're alone with him, as it sounds like he has severe issues controlling impulses.",
              "author": "ParkertheLarker",
              "created": 1635046207,
              "upvotes": 55,
              "replies": {}
            },
            "hhto2bh": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhto2bh/",
              "text": "OP I suggest ensuring campus police are real police. On my campus, campus police are the local police just in an office near campus so it wouldn't matter. But check to see what the case is for you. Yes notify your RA too ofc, but if your campus police are not real officers and are just some hired security firm or something, they are not there to help you. They're there to catch people speeding, drinking underage, taking drugs, and help make this some wierd internal university issue and not a criminal one with the real cops.",
              "author": "bubblegumpandabear",
              "created": 1635048277,
              "upvotes": 35,
              "replies": {
                "hhwy5aj": {
                  "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwy5aj/",
                  "text": "Adding to this - my campus didn't have an official police presence. The campus itself had a security department, but the town police provided law enforcement - and their office was a half mile off-campus.",
                  "author": "Comprehensive-Ad3963",
                  "created": 1635112819,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "hhuaixd": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhuaixd/",
              "text": "he already went too far by overreacting and becoming violent. if anything he is the one who escalated this situation, you are doing what you need to protect yourself",
              "author": "cherrybboo",
              "created": 1635064850,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "hht3nlf": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht3nlf/",
      "text": "Report him to both the school and the police. That's NOT okay and he'll just keep doing more if he keeps getting away with it. He sounds dangerous.",
      "author": "Animasylvania",
      "created": 1635037892,
      "upvotes": 104,
      "replies": {
        "hht7dh4": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht7dh4/",
          "text": "I should report him, so I don’t know why I’m holding myself back from doing it. Maybe it’s because everyone is just treating him normally even after seeing what he’s done and I feel like the alien? In any case, you are right, I just have to look into the reporting system and actually do it",
          "author": "TypicalOcelot8777",
          "created": 1635039691,
          "upvotes": 19,
          "replies": {
            "hhtylps": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtylps/",
              "text": "You're probably around other students at your age that don't know how to act around these things that are obviously wrong. Most adults would never do any of those things without understanding there are severe consequences especially in the US with likely more adults being armed than college students",
              "author": "HugeRichard11",
              "created": 1635055207,
              "upvotes": 20,
              "replies": {}
            },
            "hhtshra": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtshra/",
              "text": "I do believe that is for the best. I'm sorry you are dealing with all this!",
              "author": "Animasylvania",
              "created": 1635050951,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hht3tro": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht3tro/",
      "text": "Your roommate literally committed a crime.",
      "author": "GoldRequest",
      "created": 1635037975,
      "upvotes": 83,
      "replies": {
        "hht7sys": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht7sys/",
          "text": "I really haven’t looked at it this way, even though I should. Assault is definitely a crime. For some reason I delegitimized it though kind of like an non consensual slap on the ass is a crime of sexual assault but I’ve seen authorities sweep things like that under the rug and then people move on. Not that they should, it’s just everyone who lives around me is acting like what happened is normal. This is all very uncharted territory for me.",
          "author": "TypicalOcelot8777",
          "created": 1635039893,
          "upvotes": 20,
          "replies": {}
        }
      }
    },
    "hhsqvo7": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhsqvo7/",
      "text": "I have never experienced anything like this but there comes a point where you might even have to call the cops. If he ever touches you again without your permission, you have every right, IMO.",
      "author": "Intelligent-Agent520",
      "created": 1635031855,
      "upvotes": 198,
      "replies": {
        "hhsr378": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhsr378/",
          "text": "That’s a good point. If he escalated further the authorities might be able to help more than my college’s scattered reporting and moving rooms system. Thank you for suggesting this and for validating my POV. I am so grateful",
          "author": "TypicalOcelot8777",
          "created": 1635031953,
          "upvotes": 46,
          "replies": {
            "hhtlqzh": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtlqzh/",
              "text": "Please… just realize that you shouldn’t be experiencing this. Nobody should.",
              "author": "Intelligent-Agent520",
              "created": 1635047004,
              "upvotes": 19,
              "replies": {}
            },
            "hhugze4": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhugze4/",
              "text": "Not just if he escalated. He has already assaulted you my friend don’t wait for it to get worse :(",
              "author": "skinnylegend_pippa",
              "created": 1635070457,
              "upvotes": 8,
              "replies": {}
            },
            "hhuvm08": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhuvm08/",
              "text": "Quick question? Did any if this happen a) recently or b) somewhere with cameras? If so you have a bit of a clock on you.",
              "author": "tajetaje",
              "created": 1635080829,
              "upvotes": 5,
              "replies": {}
            },
            "hhv98n4": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhv98n4/",
              "text": "Any action your school takes will be to protect the school from blowback, not to protect you. Calling the cops is what the school doesn't want you to do because then they lose control. The school can help your situation for sure, but don't feel afraid to call the cops if you think you should.",
              "author": "Waslay",
              "created": 1635087630,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hht6rkq": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht6rkq/",
      "text": "If this is all true then you need to call the police and get a restraining order and not go back there",
      "author": "ilikecacti2",
      "created": 1635039404,
      "upvotes": 33,
      "replies": {
        "hht8p9l": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht8p9l/",
          "text": "I have thought about this, but for some reason I hesitate so much. It’s probably because i don’t have another place to stay right now so I need this to work out for the time being, and I feel like I will burn the bridge to being able to confront my roommate at all if I contact the police and put out a restraining order. Like I said on another comment though, this is all uncharted territory for me, so I’m kind of just wading through the ocean. Thank you for your recommendation and what most of you are saying about contacting the police is a good idea, I just need to get to the point where I feel comfortable doing it",
          "author": "TypicalOcelot8777",
          "created": 1635040322,
          "upvotes": 7,
          "replies": {
            "hht983u": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht983u/",
              "text": "The issue now is that the burden of proof is on you, and since it happened so long ago and idk if you sought medical care or if there were any other witnesses it might be hard.\n\nJust to make it clear for the future, you’re an adult now, and it’s not okay for an adult to just beat up or fight another adult. It’s not like high school where people get in hallway fights and get a slap on the wrist. If another adult ever hits you, call the police then and there and then you will be safe away from that person because they’ll be in jail. \n\nEdit: i can’t write correctly apparently",
              "author": "ilikecacti2",
              "created": 1635040576,
              "upvotes": 10,
              "replies": {
                "hht9wbx": {
                  "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht9wbx/",
                  "text": "Yeah, I just recently became an adult so that’s why this is new to me. Also, for the burden of proof, I have witnesses, but obviously they didn’t step in to help they just watched so I don’t know if they would corroborate my story because they seem so unfazed by it all.",
                  "author": "TypicalOcelot8777",
                  "created": 1635040898,
                  "upvotes": 3,
                  "replies": {
                    "hhtabuy": {
                      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtabuy/",
                      "text": "I wasn’t there so idk. But just because they didn’t step in to help doesn’t necessarily mean they won’t act as a witness for you. They might’ve been scared too. Like they would have to be willing to lie for him.",
                      "author": "ilikecacti2",
                      "created": 1635041106,
                      "upvotes": 6,
                      "replies": {
                        "hhtal6s": {
                          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtal6s/",
                          "text": "This really opens my eyes, that’s true. They could have been scared or misinterpreted the situation. All of the witnesses I consider good people but after what happened I’m questioning if I can trust a lot of people again. If this situation escalates and I need proof then I will ask the witnesses what they saw and how they felt",
                          "author": "TypicalOcelot8777",
                          "created": 1635041231,
                          "upvotes": 2,
                          "replies": {
                            "hhtmd7o": {
                              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtmd7o/",
                              "text": "Look up the story of Kitty Genovesee. It's human nature to not react to crazy things that happen in front of us, when we see someone brazenly attacked in public our brains short circuit. There's the whole fear factor of not wanting to get involved and hurt, plus it quite literally just does not compute. You subsconsciously try not to even acknowledge it because you're not used to it.",
                              "author": "RevolutionaryLeave77",
                              "created": 1635047324,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hhwna5l": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwna5l/",
          "text": "Do you like cacti tho",
          "author": "Lifedeather",
          "created": 1635108128,
          "upvotes": 2,
          "replies": {
            "hhwnd8k": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwnd8k/",
              "text": "It’s actually an inside joke lol\n\nBut yes",
              "author": "ilikecacti2",
              "created": 1635108163,
              "upvotes": 1,
              "replies": {
                "hhwnl9p": {
                  "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwnl9p/",
                  "text": "😳😳😳 Wuts the joke tho",
                  "author": "Lifedeather",
                  "created": 1635108255,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhtedqm": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtedqm/",
      "text": "I was an RA last year and please do not confront this person. He will probably get violent, confronting him won't prove anything because you already know he is willing to attack you. Talk to your RA, even on the weekends at least at my school we always had professional staff on call and this is definitely a professional staff situation. It is very likely they will allow you to switch rooms, even during covid lock down we allowed room changes for situations like this. Seriously, just talk to the staff and don't discuss with your roommate. It seems likely that he will escalate the situation. Be safe!!!",
      "author": "aquamarine_321",
      "created": 1635043129,
      "upvotes": 28,
      "replies": {
        "hhtgth9": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtgth9/",
          "text": "Yea, I need to contact the resident head for my dorm, and I sure hope the big wig residence person works on weekends. I’ve gotten to the point where it seems like I’m not going to discuss it with my roommate in person. Thank you for the well wishes",
          "author": "TypicalOcelot8777",
          "created": 1635044348,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hhtbvvs": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtbvvs/",
      "text": "Your roommate is a violent maniac, what the fuck? Make sure your RA and Building Director know about this, and as much as I hate cops, call the police if he so much as touches you again. I know this is really hard and is gonna require a lot of support from friends and loved ones as you go through it, and I hope you can get all of it that you need and then some, but christ I don't know you and I still don't want one of your roommates assaults to turn into third degree murder.",
      "author": "AtheaOfAltea",
      "created": 1635041878,
      "upvotes": 18,
      "replies": {
        "hhtcfe1": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtcfe1/",
          "text": "Thank you for this passionate comment and recognizing that this process is really hard. I have told the RA what happened and I am going to email the building director tomorrow before I go back. I also have not had good experiences with cops so maybe thats why I’m holding back on that too, but I am going to tell my roommate that if he touches me again, that my first call is to the cops and my second is to the school. I honestly wish they have the power to kick him out, and maybe they do and I just don’t know because I haven’t talked to the building director, but this is just a nightmare. I hope that I get through this and thank you for your suggestions and concern. It’s nice to see so many caring and positive people on a platform like Reddit or just in general, because there is usually always so much hate and bigotry",
          "author": "TypicalOcelot8777",
          "created": 1635042154,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hhte7fe": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhte7fe/",
      "text": "Call the cops rn",
      "author": "69earthling",
      "created": 1635043042,
      "upvotes": 15,
      "replies": {
        "hhthtm5": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhthtm5/",
          "text": "I am holding off on calling the cops right now because I am not confronting him in person anymore, but I probably should report him",
          "author": "TypicalOcelot8777",
          "created": 1635044861,
          "upvotes": 5,
          "replies": {
            "hhti4kq": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhti4kq/",
              "text": "You should do it rn ngl, he is a threat",
              "author": "69earthling",
              "created": 1635045025,
              "upvotes": 16,
              "replies": {
                "hhtiovk": {
                  "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtiovk/",
                  "text": "I get what you are saying and I think I will do it soon. I just don’t feel comfortable talking to the cops right now but thank you for your input. I will probably get them involved just not right now in this very moment",
                  "author": "TypicalOcelot8777",
                  "created": 1635045328,
                  "upvotes": 4,
                  "replies": {
                    "hhwxu0w": {
                      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwxu0w/",
                      "text": "The longer you wait the less likely anything will happen. You're playing yourself at this point.",
                      "author": "girlypotatos",
                      "created": 1635112677,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhtsnbj": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtsnbj/",
      "text": "When he “fake” kidnapped you, he actually kidnapped you. Call and talk to the campus police and tell them everything.",
      "author": "FBI_Open_Up_Now",
      "created": 1635051048,
      "upvotes": 11,
      "replies": {}
    },
    "hht9zml": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht9zml/",
      "text": "If you know who your resident director is, you should talk to them about it. I had to speak with mines last week about my roommate & her friends harassing me. Everything you described sounds like it’s against housing policy & if you report it your roommate can get kicked out of the dorm building and/or kicked out of housing all together (but this is up to the school). The resident directors are over the RA’s.",
      "author": "Standard_Ad_2744",
      "created": 1635040942,
      "upvotes": 8,
      "replies": {
        "hhtasy4": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtasy4/",
          "text": "Yes, I do who my resident director is. Hopefully he works on weekends. I will contact him before I go back to school tomorrow and see what he says about the policies and what happened. I sure as hell hope what he did is against the policy. Thank you for your suggestion and I will follow through",
          "author": "TypicalOcelot8777",
          "created": 1635041337,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhtuw9f": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtuw9f/",
      "text": "I see you've responded to others saying you don't want to \"escalate things\" but i promise you, if you confront him, things are going to escalate much worse. Do not do this. **Contact your college.** The longer you put it off, the more danger you are putting yourself in. He has shown that he is not afraid to physically assault you. He will do it again.",
      "author": "lambfigurine",
      "created": 1635052535,
      "upvotes": 8,
      "replies": {}
    },
    "hhtgg2o": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtgg2o/",
      "text": "I dealt with someone like this in an off campus apartment last year. I think she has undiagnosed borderline personality disorder, which her dad killed himself because of (wrong wording ik but can’t find anything better). I have severe depression and moderate anxiety so I understand the struggle but this was something else. I had to tread VERY carefully with her and not ask her to change anything or she’d blow up and threaten me. This was really hard for me because my personality type is somewhat confrontational but I was terrified she’d hurt me or my dog. I ended up moving home (45 minutes drive from campus) to get away from her this past spring since classes were online. \n\nRoommates can be great but they can also suck ass. I’m so sorry you’re dealing with this. I hope you can get a new roommate— you can get a lot done when you get your parents involved lol so I’m glad you have. Let them help you in this and good luck.",
      "author": "AStruggling8",
      "created": 1635044168,
      "upvotes": 5,
      "replies": {
        "hhth3wf": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhth3wf/",
          "text": "Yes! Thank you so much for talking about your own experiences, it’s nice to know I’m not alone in this. I’m personally very non-confrontational so that is my problem, instead of being very confrontational. My mom currently got a hotel room for me to stay at and I do hope that I can get a new roommate. Thank you for caring",
          "author": "TypicalOcelot8777",
          "created": 1635044492,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhte86k": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhte86k/",
      "text": "This is all so much to deal with on your own. Is there any kind of victim advocacy on your campus or local to you that could help you navigate this? And please, do not confront this person alone. The things you listed shows that he is controlling, hatful, and violent. You are not safe. Please, do not be alone with him for any reason.",
      "author": "Hufflepuff7009",
      "created": 1635043052,
      "upvotes": 3,
      "replies": {
        "hhthq6f": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhthq6f/",
          "text": "I can check into victim advocacy, but from what I know my college is not very good with this stuff. I have decided not to confront him and my mom got a hotel room so I can stay off campus for the time being and hopefully figure this kut",
          "author": "TypicalOcelot8777",
          "created": 1635044812,
          "upvotes": 1,
          "replies": {
            "hhthxk1": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhthxk1/",
              "text": "I’m glad you’re safe. That the most important thing.",
              "author": "Hufflepuff7009",
              "created": 1635044919,
              "upvotes": 3,
              "replies": {
                "hhtikw8": {
                  "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtikw8/",
                  "text": "Thank you, and yes, safety first. I am not going to put myself in a compromising position again if I can help it.",
                  "author": "TypicalOcelot8777",
                  "created": 1635045269,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhtemxx": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtemxx/",
      "text": "omg i’m so sorry that you had to live with his toxic ass. please do not confront him without campus police or just someone with authority in person. if you call your RA and he gets violent after the meeting no one will be able to do anything. if you do confront him and he seems super pissed off maybe stay at a hotel or something for the night. i know it’s expensive but i just want you to be safe after that because this could lead to him becoming more violent. i also hope you get a new roommate and if the school doesn’t do anything start a court case.",
      "author": "crippledbxtch",
      "created": 1635043256,
      "upvotes": 3,
      "replies": {
        "hhtg6qu": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtg6qu/",
          "text": "Thank you for this comment. My mom got a hotel room that she is staying in and for me to stay in too close to the school I’m pretty sure. I also just want a new roommate that isn’t like him, even if he did start being non-violent, which I don’t foresee. I just ended up in a bad living situation because I didn’t put a lot of thought into the roommate process and it came back to bite me more than I ever thought it would. I have met so many amazing, supportive people on campus and I just have to wonder how different my life would be if they were my roommate.",
          "author": "TypicalOcelot8777",
          "created": 1635044038,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhtxhui": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtxhui/",
      "text": "If you are deciding not to call the cops/report is \"for now\" then where are you going to be staying?",
      "author": "Thecrazysharklady",
      "created": 1635054374,
      "upvotes": 3,
      "replies": {}
    },
    "hhu8x6a": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhu8x6a/",
      "text": "Holy shit you sure have ignored A LOT of extreme red flags and let things escalate. I am not blaming you but you needed to report his ass *yesterday*.",
      "author": "runningwithsharpie",
      "created": 1635063528,
      "upvotes": 3,
      "replies": {}
    },
    "hht699d": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht699d/",
      "text": "OP I am asian american female and honestly this current roommate is a danger to you. You need to take steps to get out of this situation and explain to your RA what your roommate is doing. I would also be emailing and CCing the Resident Hall person in charge too. \n6 Asians died last year directly from a guy targeting Asian spas and too many to count were assaulted and attacked on the streets. Whether these attackers have  their own mental issues or whatever their problem is, don't let this manifest any further with this roommate.   request to switch or move rooms..make sure the roommate does not have your location, address and other trackable things.",
      "author": "Fiery_Tigress",
      "created": 1635039162,
      "upvotes": 10,
      "replies": {
        "hht8dit": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht8dit/",
          "text": "Yeah, his physical actions have been very irrational and he could definitely escalate it further. However, I don’t have anywhere to live in the meantime and still go to college, so I feel like in the interim I at least have to confront him (with the RA around of course). If I can’t get through to him, then yes, I will find a place to live for the time being somehow and then move to another place on campus if they have space available. It’s all just about this time of uncertainty and this interim period right now. I know he does not know my address, location, or anything traceable on me as well, so that is good. He doesn’t use social media so he wouldn’t even be able to track me on there.",
          "author": "TypicalOcelot8777",
          "created": 1635040165,
          "upvotes": 3,
          "replies": {
            "hht99r2": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hht99r2/",
              "text": "I once had a seriously bad roommate who was racist and physically was out to harm me. My RA was eventually arrested for selling pit to students but that's not the point. The point was he was not helpful as an RA and didn't take me seriously. I camped out at a good friends dorm and we are still friends til this days. Do you have any friends you could stay with in the same hall until you are able to move?",
              "author": "Fiery_Tigress",
              "created": 1635040599,
              "upvotes": 6,
              "replies": {
                "hhtac2i": {
                  "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtac2i/",
                  "text": "I have friends in dorms across campus that would let me camp out but sadly not on my hall. I haven’t really gotten close with anyone on my hall to the point where I could live there for a bit, except for maybe 1 person but their roommate would not be ok with it. The reason I haven’t gotten close to people on my hall is because I’m never there because I feel uncomfortable. It’s very complicated, but I thank you for all of your input and opening up to me about your similar experience as well. I’m so sorry that happened to you and I’m glad you got past it. In your situation, how did you resolve it while you camped out in your friends dorm? Did you change your room through the school?",
                  "author": "TypicalOcelot8777",
                  "created": 1635041109,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhteprx": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhteprx/",
      "text": "I’m so sorry, OP. You do not deserve any of that and your roommate’s actions are disgusting and inexcusable. I hope you have someone you can talk to about the assault, but please be careful about confronting your roommate. You have no idea how he will react and I think it’s best to make sure you talk to him in public, with the RA and police on standby/nearby. Hope everything goes well ❤️",
      "author": "bamboobrush0",
      "created": 1635043296,
      "upvotes": 4,
      "replies": {
        "hhtfpbp": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtfpbp/",
          "text": "Yeah after everything he’s done he does seem unstable so I will not meet with him alone. I have many, many people in my personal that I have talked about the assault to and all of them have been so supportive, but also everyone on here. Thank you for caring",
          "author": "TypicalOcelot8777",
          "created": 1635043788,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhtkz7r": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtkz7r/",
      "text": "You are an adult, he is an a adult, and this behavior is not acceptable. It's not high school where u can be an edgy jerk and just get detention and a slap on the wrist, dude will at the very least be forced to get a single dorm IF they dont kick him out. This is past the reasonable point of talking it out,  tell the RA and campus authorities aboit everything especially the staged kidnapping. (that's like a situation where the college would look at security footage and consider just calling the cops!) Your roommate can go to college when he's learned to be a functional adult.",
      "author": "RevolutionaryLeave77",
      "created": 1635046589,
      "upvotes": 2,
      "replies": {}
    },
    "hhtl8nw": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtl8nw/",
      "text": "I did not scroll far enough down to see if this has already been suggested, but can you request to change rooms?   Seems like this person is unstable and I'm not sure things are going to get better regardless of how you approach it with him.",
      "author": "amilostnow",
      "created": 1635046728,
      "upvotes": 2,
      "replies": {}
    },
    "hhttpwk": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhttpwk/",
      "text": "My best friend had a crazy roommate at one point who would steal from other random people and sell their stuff, it got to the point where a random man came banging on her door flipping out (he ended up apologizing and we figured things out for him to get his stuff back). The roommate also had a bf in high school that liked to partake in drive by shootings and would hit the roommate while my friend was present. \n\nColleges don’t listen and it’s terrible. But they HATE bad press. Honestly get your parents involved and have them come to your university and demand to directly speak with the Chancellor/director/head of your school. Make a BIG deal about this, file any reports you can, and honestly have your parents threaten the school too to take the situation public if they don’t do anything. \n\nMy friends mom did this after the school kept ignoring the issue and she showed up after being told no one could see her and *magically* was able to see our very “busy” chancellor. The roommate was given new housing in a new dorm within the week. before the new roommates also made a complaint and she was banned from student housing lol \n\nI’m sorry your dorming experience has been awful and scary, it’s something that can really ruin someone’s college experience. I hope everything gets sorted out so you are in a safe environment and things get better from here!",
      "author": "cowboyzep",
      "created": 1635051749,
      "upvotes": 2,
      "replies": {}
    },
    "hhu2uns": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhu2uns/",
      "text": "Just so I can paint a clear picture, you got up, “tapped” him on the shoulder with some clothes (I have no clue what this even means) and told him to stop, then he pinned you against the wall? \n\nI’d suggest you get in the gym, learn a martial art, something, because this will not be the only time in your life you’re in an altercation, and it sounds as if it has left some real damage. He will get what’s coming to him someday when he messes with the wrong person - there is always someone out there better than you.",
      "author": "LeHaitian",
      "created": 1635058472,
      "upvotes": 2,
      "replies": {}
    },
    "hhw54g3": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhw54g3/",
      "text": "Yeah he's crazy.",
      "author": "OddCarry466",
      "created": 1635100777,
      "upvotes": 2,
      "replies": {}
    },
    "hhwmp32": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwmp32/",
      "text": "Call the RA, and the police immediately. Don’t go back as he can pose a threat to you.",
      "author": "Lifedeather",
      "created": 1635107899,
      "upvotes": 2,
      "replies": {}
    },
    "hhwvivs": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwvivs/",
      "text": "I’m an RA. Do not confront him on your own, get your RA involved immediately. We have policies where you can stay in a “safe” room away from roommates like that who are physically and emotionally abusive and put you in situations where you’re in danger.",
      "author": "kojilee",
      "created": 1635111644,
      "upvotes": 2,
      "replies": {}
    },
    "hhwz78w": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwz78w/",
      "text": "Lots of psychological issues with this kid. Call the campus police and the one that deals with dorms and such.\n\nEDIT: Call the police as well. Read the comments. Also, do not confront him at all. Don’t say anything.",
      "author": "beifongkorra",
      "created": 1635113290,
      "upvotes": 2,
      "replies": {}
    },
    "hhuj37q": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhuj37q/",
      "text": "Sounds pretty based",
      "author": "dpetersz",
      "created": 1635072267,
      "upvotes": 3,
      "replies": {}
    },
    "hhucy0v": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhucy0v/",
      "text": "The second he tried to pin me against the wall I would’ve had this kid on the fucking floor lmao what a pussy",
      "author": "Nofapdeity",
      "created": 1635066916,
      "upvotes": 3,
      "replies": {}
    },
    "hhtcl1m": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtcl1m/",
      "text": "Voice record it the school will kick him out",
      "author": "alternativealtacc",
      "created": 1635042235,
      "upvotes": 1,
      "replies": {
        "hhtcpvd": {
          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtcpvd/",
          "text": "Do you mean to voice record when I confront him? If so, that is a good idea, especially if he says some terrible shit and blows up in my face",
          "author": "TypicalOcelot8777",
          "created": 1635042304,
          "upvotes": 1,
          "replies": {
            "hhteblj": {
              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhteblj/",
              "text": "A voice recording will do you no good if you don't make it out of the confrontation. I know it's harsh of me to say but SO many people have told you to not confront him and go straight to the authorities. Please put your safety first. Don't consider yourself to be untouchable because you think you had the bright idea of walking into this with your phone on record. You should do your best to ensure that you don't come face to face with this person while you're alone again. Have an authority figure with you, and do your best to make other living arrangements until this gets sorted out. If I were you, I wouldn't let myself be alone with this guy for a second. Get a restraining order as soon as possible. \n\nIt may seem like I'm overreacting, but I'm genuinely worried about your safety and I sincerely hope everything gets resolved soon. Overreacting and being prepared is better than dismissing it and bring unprepared and paying for it later. I don't want to scare you, I just want to make sure you know how to handle this properly and not make any stupid decisions like confronting an unstable person alone.",
              "author": "NoDryHands",
              "created": 1635043099,
              "upvotes": 7,
              "replies": {
                "hhtffzj": {
                  "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtffzj/",
                  "text": "You make a great point about how overreacting and being prepared is better than being underprepared. I have talked to my parents and they don’t feel comfortable with me confronting him without anyone around either. My mom said she’s getting a hotel room that I can stay in to go to classes and then somehow get the living situation resolved. And yes, I will contact the resident director of my dorm and will most likely contact the authorities. Thank you for your bluntness.",
                  "author": "TypicalOcelot8777",
                  "created": 1635043661,
                  "upvotes": 2,
                  "replies": {
                    "hhthtn1": {
                      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhthtn1/",
                      "text": "Thank you for not taking my words/tone the wrong way. What you're describing right now definitely seems to be the right way forward and I'm glad you have supportive parents to help you out in this situation. I also wanted to suggest taking extra care of yourself and your mental health during and after all of this, since stressful situations like these can have effects that we don't even notice or understand properly. Wishing you all the best with all of this and hope it resolves soon. Keep us updated with another post if you can! :)",
                      "author": "NoDryHands",
                      "created": 1635044862,
                      "upvotes": 3,
                      "replies": {
                        "hhti8pz": {
                          "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhti8pz/",
                          "text": "Great idea about the update post because you all are so supportive and care. I will do that soon whether things get better or worse. And you make a good point that this is a large mental toll. I already am going to therapy for anxiety and depression, so this is just another shitty situation to add in. I have not contemplated suicide but I have felt really down because of what he did to me so I discussed it with some friends from high school and they revealed some heavy stuff to me too. It’s almost like I have an overburdened mind, but I’m somehow still functioning because I don’t feel alone in my problems and having an overburdened mind. Anyway, just know that my mental state is somehow ok right now but I’m not sure once I go back to school so I will try to take care of it as much as possible. The good thing is that I know a lot of loving, caring people on campus where I can go to their dorms and explain what is happening.",
                          "author": "TypicalOcelot8777",
                          "created": 1635045085,
                          "upvotes": 1,
                          "replies": {
                            "hhtivm7": {
                              "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtivm7/",
                              "text": "I'm glad that you seem to realise that you have a good support system around you and that's something you should keep in mind when times get tough in your own head. About your experiences with other people revealing heavy stuff to you - I have been through that and I know exactly how it feels. It's like you have so many of your own problems, but then you come across people you care about going through some truly horrible stuff and it's stresses you out so much. There was one point where no matter what I did I would be thinking about my friend and how she is and if she's okay all day, it really took a toll on me. Just know that whatever you're feeling, it's completely valid and normal. And know that no matter what, one day it will get better and once you push through, you'll look back at this time and see how far you've come and appreciate the strength you had to get yourself through this. You seem like someone who sees the positive side of things and I really admire that in a person, so please keep going like that. Wishing you all the best for the future :D",
                              "author": "NoDryHands",
                              "created": 1635045432,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhtnj4s": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtnj4s/",
      "text": "Speak with the RA and get out of that room asap. He sounds like a psycho",
      "author": "awesomecytoplasm",
      "created": 1635047972,
      "upvotes": 1,
      "replies": {}
    },
    "hhtnl9m": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtnl9m/",
      "text": "FYI…You should start recording these antics and building up your evidence.",
      "author": "tsupaper",
      "created": 1635048006,
      "upvotes": 1,
      "replies": {}
    },
    "hhtvprb": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtvprb/",
      "text": "Call the police",
      "author": "Frozenblade11",
      "created": 1635053107,
      "upvotes": 1,
      "replies": {}
    },
    "hhtxmtr": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtxmtr/",
      "text": "You should really look into filing a police report",
      "author": "im_not_really_batman",
      "created": 1635054476,
      "upvotes": 1,
      "replies": {}
    },
    "hhtyx8z": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtyx8z/",
      "text": "sorry you went through this but if its any help you are being more rational about this than most people would be. hope the situation is resolved soon friend",
      "author": "leosmoke420",
      "created": 1635055443,
      "upvotes": 1,
      "replies": {}
    },
    "hhtzwbo": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhtzwbo/",
      "text": "This goes pretty beyond anything normal especially for college. It would be ideal from your comments to be more proactive in both getting away from this individual and making sure they never come in contact with you again. Through of course contacting your RA and hoping either they handle it or escalate it to someone able them. \n\nAlong with I would write everything out in detail including full names of people, dates, time, locations, etc of all events in some document. Myself I would bring it to the police and ask for their advice, this might be better than expecting them to do anything as that could be escalating as you are concerned instead you are asking for advice moving forward. This also puts them on your side in case anything happens as it has been shown this person is unstable.\n\nI would even say this goes a bit beyond this subreddit and you should consider posting in r/legaladvice to cover all bases",
      "author": "HugeRichard11",
      "created": 1635056181,
      "upvotes": 1,
      "replies": {}
    },
    "hhu4rb1": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhu4rb1/",
      "text": "Call the police ig. This is why I don’t like living wit roommates.",
      "author": "fruityuv",
      "created": 1635060026,
      "upvotes": 1,
      "replies": {}
    },
    "hhucxag": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhucxag/",
      "text": "What the actual shit is this dorm mate on? It just feels like a Kyle meme came to life",
      "author": "KRBTRIP",
      "created": 1635066898,
      "upvotes": 1,
      "replies": {}
    },
    "hhufow7": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhufow7/",
      "text": "Don't do it alone. I hate confrontations and I hold back when I think I'm the one being the weirdo but even I know there are times where you have to suck it up and get help. Tell your RA everything, make sure campus authorities are aware and have them close as back up. Also take a friend with you for support. This has escalated from a situation where you can just walk in and be like \"I do not like what you are doing.\", If he didn't care the first time, believe me when I say he won't care now so confronting him is essentially pointless. Notify all the relevant people of his behavior and let them do the work. If they don't do anything then don't sit back and take it. \n\nPS. You will not be escalating the situation so do not hesitate because you think you are. The situation was escalated the moment the fake kidnapping thing happened. Him and his friends could go to jail for that shit. You could have been hurt. So stay away from him.",
      "author": "Myphosee",
      "created": 1635069307,
      "upvotes": 1,
      "replies": {}
    },
    "hhuwld8": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhuwld8/",
      "text": "Professor here. Please seek help from a full-time professional (not student RA) at your school immediately. This could be the Dean of Students, for example. It is the schools’s responsibility to provide you with a safe living environment. \n\nI would also seriously consider filing a police report.",
      "author": "Act-Math-Prof",
      "created": 1635081393,
      "upvotes": 1,
      "replies": {}
    },
    "hhuwtwl": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhuwtwl/",
      "text": "911, what's your emergency?",
      "author": "TekieTech",
      "created": 1635081525,
      "upvotes": 1,
      "replies": {}
    },
    "hhv34ay": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhv34ay/",
      "text": "File a police report and tell him it was “just a joke” see how much he likes that “prank”",
      "author": "dskcnsnskcnn",
      "created": 1635084779,
      "upvotes": 1,
      "replies": {}
    },
    "hhv40gs": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhv40gs/",
      "text": "[removed]",
      "author": null,
      "created": 1635085212,
      "upvotes": 1,
      "replies": {}
    },
    "hhv4lq1": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhv4lq1/",
      "text": "The way you discribed him makes me shiver\nlike he's a bully from kindergarten until now, still going on... stay clear of him and call the school's dorm monitor in case you need help. temporary find a place to stay until he's out of the dorm.",
      "author": "Adrien0715",
      "created": 1635085499,
      "upvotes": 1,
      "replies": {}
    },
    "hhv5ct9": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhv5ct9/",
      "text": "Honestly a lot of people are telling you to go through the school but the police really should be called. Yes do notify your RA , but also call the police and file a report. If you were anywhere else and someone attacked you like that you'd call the cops. This is no different. He thinks his behavior is ok because he's always gotten away with it and odds are the school would let him get away with it too by just moving him to a new room with new roommates/victims.",
      "author": "Silaquix",
      "created": 1635085862,
      "upvotes": 1,
      "replies": {}
    },
    "hhv7f46": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhv7f46/",
      "text": "These are violent crimes he’s committing wtf. Report him now and do not be alone with him again.",
      "author": "pintossbm123",
      "created": 1635086806,
      "upvotes": 1,
      "replies": {}
    },
    "hhv8p57": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhv8p57/",
      "text": "Please talk to someone in the Res Ed office or at least a resident dean/faculty member. The  RA (usually an upperclassman student) is not the right person and doesn’t have enough experience or authority to fully respond to your situation. The roommate is not safe for anyone and needs counseling. He is a bully and abuser. I am so sorry you are going through this and hope you stay safe. Pls do not be alone with your roommate.",
      "author": "Ok-Boysenberry3703",
      "created": 1635087383,
      "upvotes": 1,
      "replies": {}
    },
    "hhv8wi4": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhv8wi4/",
      "text": "Why the fuck would you confront a violent person? Tell the RA immediately and let them handle it.",
      "author": "all_hail_to_me",
      "created": 1635087476,
      "upvotes": 1,
      "replies": {}
    },
    "hhvdvu2": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhvdvu2/",
      "text": "You should have called the police or the campus police when it happened.  The next best time is right now.",
      "author": "kryppla",
      "created": 1635089744,
      "upvotes": 1,
      "replies": {}
    },
    "hhvztc0": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhvztc0/",
      "text": "Give him hands then kick em out",
      "author": "INTELDracula",
      "created": 1635098691,
      "upvotes": 1,
      "replies": {}
    },
    "hhw0jxw": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhw0jxw/",
      "text": "If he gets physical, call the police. This behavior is criminal. If you need, you can get a restraining order.  There is only so much your RA can do. But, the college will have to honor the protective order.  You do not have to put up with being abused.",
      "author": "peppyunicorn",
      "created": 1635098979,
      "upvotes": 1,
      "replies": {}
    },
    "hhwnsnt": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwnsnt/",
      "text": "Off record, get like 8 of your closest friends, fake kidnap him except it won’t be fake… basically assault him back harder",
      "author": "sAvage_hAm",
      "created": 1635108340,
      "upvotes": 1,
      "replies": {}
    },
    "hhwwwhf": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwwwhf/",
      "text": "You should call the police, but if you’re not quite comfortable taking that step yet, you should contact the RA at the very least. He shouldn’t be allowed to live on campus or even be on campus at all after his behavior, he’s unstable and dangerous to you and other students at the school.",
      "author": "Shrekdonkey24",
      "created": 1635112254,
      "upvotes": 1,
      "replies": {}
    },
    "hhwze1f": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhwze1f/",
      "text": "You sound like a beta male let’s be honest",
      "author": "mountainsgottabeblue",
      "created": 1635113376,
      "upvotes": 1,
      "replies": {}
    },
    "hhx2ksk": {
      "link": "/r/college/comments/qefayz/my_roommate_assaulted_me_what_do_i_do/hhx2ksk/",
      "text": "It sounds like he's got some undiagnosed mental issues emerging. Definitely don't go back. He needs help, and before he gets that help, he's going to be unstable to be around.\n\nTalk to your RA immediately. Don't go back to the room. Sleep outside/with friends until this is figured out.",
      "author": "Positive-Court",
      "created": 1635114853,
      "upvotes": 1,
      "replies": {}
    }
  }
}