{
  "sid": "pvz4cg",
  "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/",
  "title:": "Mental Health Degrading From College Stress",
  "text": "Hi everyone, for some background I'm a 24 year old Air Force Veteran \\[male\\], I used to work as an avionics technician doing electrical work on the aircraft's offensive/targeting/navigation systems, I currently am pursuing computer science, am halfway through my associate's degree, and have a 4.0 GPA at the community college I am at.\n\nTo begin, I am extremely stressed. I literally feel almost like I want to puke from it. I am in this college algebra class that has an emphasis on transitioning to calculus (so not a base level college algebra class) and I feel like this class is gonna be rough and I'll be lucky to get a B, I am currently struggling in it despite putting in a lot of effort. I am so stressed with keeping up my GPA to transfer to a competitive university because I feel like if I don't I'll have a way harder time with job prospects or being competitive for a FAANG company \\[which i'd really like to work for\\]. I am honestly just so depressed and even as I am typing this I feel an onset panic attack coming on. This class has made me feel quite dimwitted and I cannot emphasize enough how much impending doom I feel from all of this.\n\n&#x200B;\n\nDoes anyone have any helpful advice/words? Have you guys been in my position before?",
  "author": "Sunbro888",
  "created": 1632680004,
  "over_18": false,
  "upvotes": 33,
  "upvote_ratio": 0.95,
  "comments": {
    "hee6vd4": {
      "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hee6vd4/",
      "text": "yes college , work , this website , other people just everything. life is one gigantic aids bukkake fest and i want to grab chunks of my hair and pull them out screaming nothing short of primal.",
      "author": "cute_diplomat",
      "created": 1632689944,
      "upvotes": 2,
      "replies": {}
    },
    "hedsu30": {
      "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedsu30/",
      "text": "This may or may not help, but don't worry, since 4.0s get rejected from competitive unis too. What seems like the best strategy would be to build up your computer science resume during your time at community college as well (and feel free to let the gpa drop to 3.8-3.9 at minimal consequence). This way, your outside involvement can help your transfer applications out. And, if you don't end up getting that competitive uni, you'll still have a good resume for you to land \"faang\" tier internships -> faang tier full time.",
      "author": "YingkaiLee",
      "created": 1632684223,
      "upvotes": 2,
      "replies": {
        "hedtih2": {
          "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedtih2/",
          "text": "Any ideas of how I could go about building it up? For reference, I truthfully have no idea how to code. I was planning on taking my programming classes at the very end of my associate's so that information could be fresh in my mind--- seeing as when I start working past my associate's that's when I will be actually using it. And when should I/can I start looking towards internships?",
          "author": "Sunbro888",
          "created": 1632684496,
          "upvotes": 1,
          "replies": {
            "hee8n9d": {
              "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hee8n9d/",
              "text": "start programming start with simple challenges like download a text file of 1000s of sentences then write something that opens the file and parses it for word provided by the user and then returns a count of the word. little things like that. build tic tac toe that was the first thing i ever made and i sat in a motel lobby until i figured out how it could be done. just start programming. and like in the example above you might say how would i do that ? hint google will tell you . say 'how do i open text file in \\[insert programming\\] language it will show you like in python i think it is something like open('directory/filename') then you can create it as variable of data our\\_file = open('directory/filename') then you can write a function that takes our\\_file and begins to parse. start small like learn how to parse each letter or space or word in the document then you can see how to search for a word then you can get he user inputs. its little building blocks break a project down into small pieces, google how to do them small pieces, build the whole. \n\ni am an accounting student who is a novice self taught programmer i want to bring an outlook of programming to public accounting.",
              "author": "cute_diplomat",
              "created": 1632690706,
              "upvotes": 3,
              "replies": {
                "heefklg": {
                  "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/heefklg/",
                  "text": "interesting, I assume you have to buy programs like python to begin, yes?",
                  "author": "Sunbro888",
                  "created": 1632693749,
                  "upvotes": 1,
                  "replies": {
                    "heegg6l": {
                      "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/heegg6l/",
                      "text": "no its a programming language they are free to use. it has excellent documentation , excellent libraries that can help you build anything you want . it is heavily used in FAANG and around the world . \n\nhttps://www.python.org/",
                      "author": "cute_diplomat",
                      "created": 1632694146,
                      "upvotes": 2,
                      "replies": {
                        "heej2kc": {
                          "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/heej2kc/",
                          "text": "omg if i had known programming languages were free to use I would have begun a long time ago. I feel like a twat, lol.",
                          "author": "Sunbro888",
                          "created": 1632695349,
                          "upvotes": 1,
                          "replies": {
                            "heeybwf": {
                              "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/heeybwf/",
                              "text": "Watch Harvard cs50 on edx it is a free class for introductory programming. Very informative and will set you up with basic knowledge of C, python, and SQL.",
                              "author": "madmax543210",
                              "created": 1632702688,
                              "upvotes": 2,
                              "replies": {
                                "hef37zy": {
                                  "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hef37zy/",
                                  "text": "Will do! Any other beginner friendly resources?",
                                  "author": "Sunbro888",
                                  "created": 1632704994,
                                  "upvotes": 1,
                                  "replies": {
                                    "hegfz7h": {
                                      "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hegfz7h/",
                                      "text": "Pretty much any course on edx or udemy. You could also Google search “javascript docs” and read the tutorials on Mozilla.",
                                      "author": "madmax543210",
                                      "created": 1632739213,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hedqga3": {
      "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedqga3/",
      "text": "If you can reach out to a school councillor they may be able to offer you some advice 💙 in the mean time, try to do something nice for yourself! A walk somewhere pretty, take yourself for lunch, even just cook something good or have a nap. You’re doing awesome :) you are completely qualified to be in these classes and you will succeed.",
      "author": "suspiciousdoughnut03",
      "created": 1632683267,
      "upvotes": 3,
      "replies": {
        "hedqn4e": {
          "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedqn4e/",
          "text": "I'll try to wind down some if I can... I just need to get out of my head for a bit and not feel like if I do bad that this will be the end of the world, ya know?",
          "author": "Sunbro888",
          "created": 1632683342,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hedlx30": {
      "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedlx30/",
      "text": "[mathtutor.com](https://mathtutor.com) is very good at teaching algebra",
      "author": "WANTED-DBD-1",
      "created": 1632681415,
      "upvotes": 1,
      "replies": {
        "hedmr2s": {
          "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedmr2s/",
          "text": "Is it a subscription based software?",
          "author": "Sunbro888",
          "created": 1632681756,
          "upvotes": 1,
          "replies": {
            "hedooid": {
              "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedooid/",
              "text": "sorry I sent you a wrong link.\n\n&#x200B;\n\nthis is what I wanted to send:\n\n[https://www.mathtutordvd.com](https://www.mathtutordvd.com)\n\n&#x200B;\n\nJason is a life saver :D",
              "author": "WANTED-DBD-1",
              "created": 1632682552,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hedjz4i": {
      "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedjz4i/",
      "text": "Sweetheart, take a deep breath. I cannot possibly imagine how stressed and scared you are feeling right now. But I will do my best to give you some comfort. \n\nI graduated highschool with a 3.6 gpa, I chose to go into a community college, my GPA is now 3.2. \n\nYou are doing really well. Remarkably well. But at the end of the day, you need to pursue something that you can see yourself waking every morning to do. Make sure you are doing what you want and it will make those classes worth it.\n\n&#x200B;\n\nAnother thing, try your best to NOT take too many courses. if it takes you another 2 years to get your BA or another year for your AS, that's ok. The time passes anyways.\n\n&#x200B;\n\nNow, math is rough. It is absolutely horrible if you are doing it alone and for the first time. My best advice is to use websites like Chegg or Brainly and form a really good study group. I don't care if your anxious ass is scared to talk to your classmates, I want you to say, \"hi there, my name is x, I really need help in this class and was wondering if you would like to make a discord chat for our class. I PROMISE. It helps. It helps so much. Even if people don't share the answers, they share frustrations and you will feel so much less alone.\n\nPlease reach out around you, chances are, there are a dozen kids who wish they could connect and help each other. No one is as confident as they appear. Especially those who are good at math. If you use canvas for your class, you can send an inbox message to everyone in your class with a discord link!",
      "author": "Cup_O_Tea_For_Two",
      "created": 1632680648,
      "upvotes": 10,
      "replies": {
        "hedl41l": {
          "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/hedl41l/",
          "text": "That's the thing like, I am so in my head and anxious. I am putting in a lot of work and I still feel the material is conceptually difficult. When I am in the lectures mostly everyone is quiet in zoom with their mic muted and I feel like they likely aren't as motivated as I am to do what needs to be done to get an A (simply because I am willing to sacrifice a lot for it). That said, it makes me wonder, am I the only one stressed? Am I the only one who just doesn't get the material? Is anyone else feeling the anxiety/doom I feel? \n\nI really like what I am going to school for, I just have to make it through the hellish math classes and manage my anxiety, which is proving to be very difficult :(",
          "author": "Sunbro888",
          "created": 1632681095,
          "upvotes": 3,
          "replies": {
            "heeqr4h": {
              "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/heeqr4h/",
              "text": "Fellow USAF vet here, I definitely get the stress with math in particular. I find it much harder to grasp online. Algebra is hard but you’ve got time to get cracking at it. \n\nWhat I did when I got out of the USAF was go into khan academy and started going through everything starting at like 6th grade math, everything was pretty easy, but it reminded me of a lot of math I had *kind of* forgotten.\n\nCrushing the simple stuff (like early algebra) gave me some confidence and the things I didn’t get were simple and easy to re-learn. As it turns out, re-learning a bunch of middle/high school math was extremely helpful in filling “holes” that had formed in the years I was away from school.\n\nIt really feels nice to just CRUSH some early math, too, because it reminds you of how far you’ve actually come",
              "author": "2ndScud",
              "created": 1632698991,
              "upvotes": 3,
              "replies": {
                "heesxg6": {
                  "link": "/r/college/comments/pvz4cg/mental_health_degrading_from_college_stress/heesxg6/",
                  "text": "What's helping me right now is really doing the most extensive amount of reviewing/practicing. I could totally see how that's helpful though as it all builds upon itself.",
                  "author": "Sunbro888",
                  "created": 1632700057,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634054166
}