{
  "sid": "q1p5x1",
  "link": "/r/college/comments/q1p5x1/did_anyone_drop_out_of_college_here/",
  "title:": "Did anyone drop out of college here?",
  "text": "Probably a dumb place to ask but idk where else. I'm currently at a bleak point in my life, everything is so so messy and I'm directionless. I want to drop out, but of course everybody and their mamas and MY mama is trying to dissuade me. I totally get it, with how the world is structured. But I'm so tired of living a life doing something I don't want to do. I chose this path at 17, it is required for all 16-17 year olds here to pick a career path by the government. I picked something, tried it, hate it. I already feel like I failed, and I feel taking this big leap of faith will make me a bigger failure. I'm just so lost\n\n\nWorst of all, I'm at my final year. But I feel like I can't push on anymore. My school literally denied me from taking a break. I either just let everything fail (idk if I'd get kicked out) or drop out. The course I'm doing isn't even respected by society lol... you guessed it, design. I can sense judgement from others whenever I say it.\n\n\nUgh idk what to do :( I'm interested in languages and tattooing, but haven't been able to get into it since I spend my time in school, all of it. Or having a panic attack because I absolutely hate my life to the core and I have no idea what I'm gonna do at 20.",
  "author": "okbokchoy",
  "created": 1633415937,
  "updated": 1634084137,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfglkiv": {
      "link": "/r/college/comments/q1p5x1/did_anyone_drop_out_of_college_here/hfglkiv/",
      "text": "Don't drop out. You can do this.",
      "author": "lazykazooo",
      "created": 1633426810,
      "upvotes": 1,
      "replies": {
        "hfglt2d": {
          "link": "/r/college/comments/q1p5x1/did_anyone_drop_out_of_college_here/hfglt2d/",
          "text": "I know… but it’s so difficult. Apparently the lecturers talk about me amongst themselves, so it’s awkward and embarrassing too. I might just stop attending class this sem and redo it next time. Idk. I’m just really burnt",
          "author": "okbokchoy",
          "created": 1633427035,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfgxdxs": {
      "link": "/r/college/comments/q1p5x1/did_anyone_drop_out_of_college_here/hfgxdxs/",
      "text": "I did.  And now I’m 34 and had to come back to school like a dog with its tail between its legs.   Just do whatever you can to get it over with.  You won’t regret it.  But there is a very high chance that if you don’t complete it that either a) you’ll have to return later or b) you’ll have to suffer through the financial consequences of not having a degree.",
      "author": "redactedname87",
      "created": 1633435849,
      "upvotes": 1,
      "replies": {}
    }
  }
}