{
  "sid": "rgt39n",
  "link": "/r/college/comments/rgt39n/after_struggling_with_college_for_years_i_just/",
  "title:": "After struggling with college for years, I just finished my first semester with all As!!!",
  "text": "This isn’t my first year of college, but it’s my first semester finished with straight As! I originally went for a Bachelors at another college and it didn’t work out due to maturity, and then started again at community college; and once again dropped out due to substance addiction and depression (probably rooted in me failing the first time). I didn’t quit this time, and now at my third try at college (going for an AA before the bachelor equivalent) I’m doing much better and couldn’t be more proud of myself despite this semester breaking me down multiple times. The classes were probably easy to most, but they were difficult for me. Still, I pushed through, studied and worked hard, and now I feel this sense of pride I haven’t felt in a long while and am excited to get my AA by summer 2022. If this momentum continues, I’d be happy to go for the BFA, but if life takes me down another route, I’ll at least push to finish the AA and finally have something to show for all my effort :))) I regret quitting college before, but now is the time to be proud, as I’m working towards something I love more. Just so happy!! Cheers! :)",
  "author": "SuperSmashSonic",
  "created": 1639551606,
  "updated": 1639787878,
  "over_18": false,
  "upvotes": 27,
  "upvote_ratio": 0.97,
  "comments": {
    "hom8uez": {
      "link": "/r/college/comments/rgt39n/after_struggling_with_college_for_years_i_just/hom8uez/",
      "text": "Yay!! That’s awesome (:",
      "author": "roachincalzone",
      "created": 1639551928,
      "upvotes": 3,
      "replies": {
        "hom917e": {
          "link": "/r/college/comments/rgt39n/after_struggling_with_college_for_years_i_just/hom917e/",
          "text": "Thank u! Very kind of u :)",
          "author": "SuperSmashSonic",
          "created": 1639552063,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hon35lk": {
      "link": "/r/college/comments/rgt39n/after_struggling_with_college_for_years_i_just/hon35lk/",
      "text": "Congratulations, I\\`m really happy for you 🥳",
      "author": "Ruth_Kinloch",
      "created": 1639574495,
      "upvotes": 1,
      "replies": {}
    }
  }
}