{
  "sid": "r7dpbk",
  "link": "/r/college/comments/r7dpbk/anyone_else_feel_super_unacomplished/",
  "title:": "Anyone else feel super unacomplished?",
  "text": "Current senior, and idk... I just feel super unaccomplished, like I've done nothing worthwhile while at school. Just kind of coasting through, not doing anything noteworthy, gonna graduate soon and I feel like my college life flew by me and I missed out on doing something that would've made it worth it. Anyone else feel like this or any advice on how to *not* be a mopey bish about this.",
  "author": "KingMilk55",
  "created": 1638469402,
  "updated": 1638479890,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hmyymfq": {
      "link": "/r/college/comments/r7dpbk/anyone_else_feel_super_unacomplished/hmyymfq/",
      "text": "Same here\n\nThe clubs I have been in seem rather inactive and passive. The outbreak didn't help matters, either.\n\nMost of the time, it felt like I had little to do. Even though I still had assignments (Bachelor's Degree level), most of the time I would just reference a bunch of articles with the right abstracts/findings and write a decent story. That is it, it seems.\n\nSome subjects and topics are redundant repeats which were covered previously. While new topics seem rushed, and I do not remember doing much exercise.\n\n=.=.=.=.=.=.=.=.=.=\n\nFor some tips, hmm, maybe you can consider looking into clubs that interest you in some way? You may also want to try encouraging passive clubs to start some activities. Perhaps also try to look for college events too?",
      "author": "IndigoDialectics",
      "created": 1638473934,
      "upvotes": 1,
      "replies": {}
    },
    "hmyzq68": {
      "link": "/r/college/comments/r7dpbk/anyone_else_feel_super_unacomplished/hmyzq68/",
      "text": "I'm a senior too and I feel this way sometimes.  I try to remind myself that we lived through a pandemic that inhibited our ability to participate in multiple ways.  At least at my university, we were fully online from when COVID hit in the Spring 2020 semester through to the Spring 2021 semester.  All online classes, no in person meetings for activities, no people on campus, etc.  On top of that, many of us were experiencing extreme burnout and other mental health issues.  Before COVID, I had decided to do things after years of building up the courage to, but I wasn't able to do any of them.  After COVID, my mental health was in bad shape and that courage wasn't there anymore.It's easy to compare yourself to others or compare yourself to the expectations you had as a freshman.  Nothing about our college experience has been normal, so it's okay if we didn't do what we thought we would four years ago.",
      "author": "emomotionsickness2",
      "created": 1638474361,
      "upvotes": 1,
      "replies": {}
    }
  }
}