{
  "sid": "r73q1w",
  "link": "/r/college/comments/r73q1w/how_do_you_take_courses_that_you_are_not/",
  "title:": "How do you take courses that you are not interested in",
  "text": "Im in my third year of an engineering degree and there are so many courses that I'm not interested in. I feel like the only course I actually enjoy is thermodynamics. I wish I could somehow only take thermo. How does everyone manage to stay motivated in courses that are not that interesting?",
  "author": "TemperatureWise7792",
  "created": 1638437643,
  "updated": 1638479936,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hmx3nc0": {
      "link": "/r/college/comments/r73q1w/how_do_you_take_courses_that_you_are_not/hmx3nc0/",
      "text": "Knowing you gotta take the course again if you fail is more than enough motivation",
      "author": "Kiwi_1127",
      "created": 1638443678,
      "upvotes": 8,
      "replies": {
        "hmxt9iw": {
          "link": "/r/college/comments/r73q1w/how_do_you_take_courses_that_you_are_not/hmxt9iw/",
          "text": "This is like a slap in the face, feeling like You haven't done enough when it's finally done at the end, wishing You did better for a pain that was gonna end eventually anyway, the teacher making an easy exam paper, everyone going out of there happy except You cuz You refused too suffer, sorry for  the rant but this was heartfelt.",
          "author": "Reem-gazelle-2001",
          "created": 1638457791,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmxvp0e": {
      "link": "/r/college/comments/r73q1w/how_do_you_take_courses_that_you_are_not/hmxvp0e/",
      "text": "I am sorry; I wish I had a better answer. But in my case, I didn't. I just knew I wanted to graduate and took all the crap I had to to make that goal. So perhaps focus on your end goal; it won't motivate you for the class but it may keep you tenacious.",
      "author": "Turbulent-Rip-5370",
      "created": 1638458816,
      "upvotes": 1,
      "replies": {}
    }
  }
}