{
  "sid": "q28k2y",
  "link": "/r/college/comments/q28k2y/should_i_transfer_colleges_a_second_time/",
  "title:": "Should I transfer colleges a second time?",
  "text": "I (19f) am in my freshmen year of college. I graduated school in 2020 and started going to a local community college. Due to the pandemic and having a major depressive episode, I was a horrible student. I dropped out of school after my first semester. I then re-applied to a school that I applied to during high school and got in. Thinking this was my last chance at school, I enrolled in the Fall 2021 semester. I worked my ass off trying to get into this school and did my financial aid and finally got into this school. I did my school's orientation program and I immediately saw red flags. Maybe it's because I am a year older, but they were all immature and rude. But, I just wrote it off as me being judgmental and moved into school. It has been two months since then and I hate it here. I have no friends, like the only people I speak to is my boyfriend, my grandma, my cousin, and my mom. Every time I try to make friends with another girl, they roll their eyes at me or ignore me. I am also a vegetarian and there are little to no options for here, I either eat so unhealthy that my stomach hurts or I eat healthy but so little food. The school's environment wrong for me too. The school has parties, fashion shows, and rappers come there and I am not a party person. I listen to a lot of Taylor Swift, Lorde, and disco, but everyone here listening to rap, and unless it's Drake, I don't know it. I have toyed around with transferring for a second time after the school-year is over. However, I am afraid to do so for two reasons: \n\n1. My job eligibility: I'm a history major and I'm afraid that if I transfer schools to much no one will want to hire me.\n2. My mom: I really feel like I let my mom down when I dropped out, so now that I am in school, and getting As and Bs, I am finally not a fuck up. But I feel like if I tell her that I am miserable here that I will disappoint her. \n\nSo what should I do?",
  "author": "Fashion_History_Buff",
  "created": 1633477380,
  "updated": 1634083747,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hfjk9n1": {
      "link": "/r/college/comments/q28k2y/should_i_transfer_colleges_a_second_time/hfjk9n1/",
      "text": "Most schools with fashion shows and parties also have clubs where you can meet different people based on your interests. You can fill out transfer applications and try to meet people that like the things you do. \n\nIf you are really miserable, get out. If you build a strong academic record at a new school, get some internship experience or work experience, and build a network, I wouldn't think that an employer would care all that much about the double transfer.\n\nAs for your mom, the proof is in the pudding. If you are getting good grades, you'll probably have a lot more credibility when you tell her that the campus culture is not a good match. Tell her you're working hard and doing well but that you think you'll have trouble maintaining it because of the people around you. If she is halfway reasonable, she'll listen.\n\nBe careful with financial aid. Most schools don't give much scholarship/grant aid to transfer students, and you may end up with more loans.",
      "author": "bugzapper09",
      "created": 1633477930,
      "upvotes": 4,
      "replies": {}
    },
    "hfjjhva": {
      "link": "/r/college/comments/q28k2y/should_i_transfer_colleges_a_second_time/hfjjhva/",
      "text": "I'm not sure what transfers have to do with job eligibility? Unless maybe you plan to work in academia and that's different? You don't put all the schools you attended on your resume. You only list the school you graduated from.",
      "author": "SouthernRhubarb",
      "created": 1633477555,
      "upvotes": 3,
      "replies": {
        "hfjjqrd": {
          "link": "/r/college/comments/q28k2y/should_i_transfer_colleges_a_second_time/hfjjqrd/",
          "text": "I didn’t know whether or not it would make it hard to get a job, I thought you had to put every school you went to on your resume.",
          "author": "Fashion_History_Buff",
          "created": 1633477675,
          "upvotes": 1,
          "replies": {
            "hfjk6c6": {
              "link": "/r/college/comments/q28k2y/should_i_transfer_colleges_a_second_time/hfjk6c6/",
              "text": "Nope. Only one one you graduate from.",
              "author": "SouthernRhubarb",
              "created": 1633477885,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hfjq9za": {
      "link": "/r/college/comments/q28k2y/should_i_transfer_colleges_a_second_time/hfjq9za/",
      "text": "You should transfer! There are tons of schools that may be a better fit for you! I think you should tell your mom how you’re feeling - that you don’t really like the school and you are looking at x school instead. A transfer doesn’t mean you’re stopping your education. Especially knowing this early on, you can plan and get accepted so that there will be no gap in your education. \n\nAlso jobs don’t look at where you got your credits from, as long as they are accredited, they just look at where you got your degree from as a whole and your GPA.",
      "author": "shoelaceys7373",
      "created": 1633480809,
      "upvotes": 3,
      "replies": {}
    }
  }
}