{
  "sid": "r5nfam",
  "link": "/r/college/comments/r5nfam/freshman_stressed_about_finals/",
  "title:": "Freshman Stressed about finals",
  "text": "It will sound stupid that I am stressed about finals as the final exams I need to take, I have As. I’m taking a physics 1 and calc 1 final. The physics final is nice because even if I receive a zero, I still manage a C+ in the class. Math I have a midterm and a final still and failing those will drop my grade despite my current A. I’m just super stressed going into it and was wondering what advice that would be nice to know going in, and any other reasons I shouldn’t be as stressed as I am. There is still like 3 weeks until finals but I am freaking out.",
  "author": "NAKorpi",
  "created": 1638279348,
  "updated": 1638480451,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "hmnvyab": {
      "link": "/r/college/comments/r5nfam/freshman_stressed_about_finals/hmnvyab/",
      "text": "As a senior physics major, I am here to say that it does get a little easier. I know that STEM is daunting and you're in the \"weed out\" phase of your academic career. As you get further into what you want to do, the stress level will go down. It seems like you know how to prepare for an exam, so just keep doing practice problems and going to office hours, and you'll be fine. And at the end of the day, it's just a class. People have failed physics I and gone on to great careers. Make sure to take care of yourself, sleep enough, and actually eat. You're asking your brain to do a lot of very hard stuff, and it can't do that if you're running on nothing but coffee and anxiety.",
      "author": "quantum_complexities",
      "created": 1638281168,
      "upvotes": 10,
      "replies": {
        "hmnw806": {
          "link": "/r/college/comments/r5nfam/freshman_stressed_about_finals/hmnw806/",
          "text": "Thank You so much for the encouragement. I don’t think I will fail this semester, I just am really stressed about starting on the correct footing with my GPA. If you don’t mind me asking, how early did you study for finals, and does class work actually become easier and less stressful later in college?",
          "author": "NAKorpi",
          "created": 1638281298,
          "upvotes": 2,
          "replies": {
            "hmo272o": {
              "link": "/r/college/comments/r5nfam/freshman_stressed_about_finals/hmo272o/",
              "text": "I can only speak to physics, but it's a small program. If you make it past the first and second-year classes, professors become more understanding. Aside from department-set exams they have no control over, I've gotten a lot of leeway and support when things happened in my personal life. You are pretty dedicated to physics at that point. By junior year, professors become more friendly and see you more as a future colleague and less like students.\n\nAlso, I will say that physics I/II seems really counterintuitive. It was easier for me to add on to physics knowledge once I had a solid base of freshman mechanics and E&M. The content is still hard, but it's kinda like learning a language. Once you have a base vocab, you can communicate and just grow from there. \n\nStudying for me was more of. an actively doing the practice problems kind of thing. Reading notes doesn't do anything for me, and since doing the exam is just doing problems, I try to recreate exam-like scenarios for myself before actually taking the exam. (There is a reason the PSAT is a thing). \n\nI also really encourage you to work work with fellow students, get together, and study in a group. I know that STEM (esp pre-med and pre-vet) can feel really isolated and competitive, but it's you vs yourself and not you vs other students. Science is something we do together. I know that STEM professors are not always the greatest teachers and they're not always the most approachable people. Other students are going to be your best resource, and you should want to help each other. I will say that I don't know what school you're at, but being friends with grad students was the most useful thing I did.",
              "author": "quantum_complexities",
              "created": 1638284103,
              "upvotes": 2,
              "replies": {
                "hmo2p41": {
                  "link": "/r/college/comments/r5nfam/freshman_stressed_about_finals/hmo2p41/",
                  "text": "Last thing, do you think the fact I have an A going into the final weeks makes it easy to assume I finish the semester strong?",
                  "author": "NAKorpi",
                  "created": 1638284325,
                  "upvotes": 2,
                  "replies": {
                    "hmo4kus": {
                      "link": "/r/college/comments/r5nfam/freshman_stressed_about_finals/hmo4kus/",
                      "text": "I think to a certain extent, past exams are indicative of how you’ll do on future exams. Test taking is kind of a skill, but knowing that you both know the material and know how to take a test means that you clearly have the skills to succeed. Most people don’t go in failing and then get an A on the final. \n\nIn a STEM class that’s not unheard of when you only have 2-3 grades for the whole semester but it is unlikely. I wouldn’t be overly confident that an A going into the final will ensure an A overall.",
                      "author": "quantum_complexities",
                      "created": 1638285151,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmo2ser": {
      "link": "/r/college/comments/r5nfam/freshman_stressed_about_finals/hmo2ser/",
      "text": "How about getting some help from someone that knows the subject and helps you categorize and link all the information together? Once you classify all the info in a proper way, it gets easier to retrieve (your brain) information and connect the dots.",
      "author": "JackC8",
      "created": 1638284366,
      "upvotes": 1,
      "replies": {}
    }
  }
}