{
  "sid": "d14j6d",
  "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/",
  "title:": "Hey, guys, use a railing.",
  "text": "You know that weird dream sensation where you're in and out of sleep, and you feel like you're falling then jerk awake when you land? Well, that happened to me this morning at 5 am, but I wasnt dreaming, and I woke up halfway between the mattress  and when I hit the floor. \n\nFor reference, my bed is lofted more than 6 feet off the ground. I'm honestly lucky to be alive, and only sustaining \"minor\" injuries at that. Somehow I managed to land in one small area between multiple dangerous corners like my fridge and desk, and I didnt land on my head, but on my knees. My left knee took the full force of a 6 foot drop. It was busted open, and I believe I may have minor fractures in both knees. \n\nMoral of the story, please for the love of god use a rail; I know it's rare, so rare that the police officer that arrived at my dorm (after I called the police because I couldnt extend my legs) told me I was the first one he'd seen do this in his 35 years on campus. Be safe, take care of yourself, and please use a rail.",
  "author": null,
  "created": 1567905277,
  "over_18": false,
  "upvotes": 1211,
  "upvote_ratio": 0.99,
  "comments": {
    "ezs86w5": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezs86w5/",
      "text": "Damn, guess im lucky.\n\ni slept in a 6ft high loft bed with no rails for my whole first academic year...\n\nAND im move A LOT in my sleep. Im honestly surprised i never fell off.",
      "author": "ButteryBakedSalmon",
      "created": 1568084615,
      "upvotes": 1,
      "replies": {}
    },
    "ezlbnwa": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezlbnwa/",
      "text": "Why did I get the trending notif for this I’m not even joined in this sub and I’m 13 bro wtf",
      "author": "jaden-has-arrived",
      "created": 1567974671,
      "upvotes": 1,
      "replies": {}
    },
    "ezl8vkt": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezl8vkt/",
      "text": "y’all i rolled off my lofted bed, bashed my shin HARD on my roommate’s bed frame, and hit the ground. use that fuckin rail",
      "author": "Littletapuk",
      "created": 1567973675,
      "upvotes": 1,
      "replies": {}
    },
    "ezkzs6r": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezkzs6r/",
      "text": "read the title and thought you were talking about coke lol",
      "author": "overachiever1516",
      "created": 1567969346,
      "upvotes": 1,
      "replies": {}
    },
    "ezkmjpt": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezkmjpt/",
      "text": "I knew someone from high school that suffered a brain injury this way. Those railings save lives for sure.",
      "author": "a_time_for_change",
      "created": 1567962881,
      "upvotes": 1,
      "replies": {}
    },
    "ezklxo8": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezklxo8/",
      "text": "My friend slipped climbing out of her bed and dislocated her shoulder by hitting her desk. I’m glad you’re okay. \n\nAsk if housing has bedrails you can request.",
      "author": null,
      "created": 1567962571,
      "upvotes": 1,
      "replies": {}
    },
    "ezk5aqn": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezk5aqn/",
      "text": "Sue the college",
      "author": "ireadthatpro",
      "created": 1567955130,
      "upvotes": 1,
      "replies": {}
    },
    "ezk3gu8": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezk3gu8/",
      "text": "I dont use a rail and have never came close to falling",
      "author": "johnnychobani",
      "created": 1567954315,
      "upvotes": 1,
      "replies": {}
    },
    "ezjx3m7": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezjx3m7/",
      "text": "Freshman year my roommate fell off his 6ft lofted bed while hammered, was too embarrassed to get help and stumbled into our dorm hall bleeding and passed out, Someone found him 2 hours later and called EMS apparently he had nearly bled out, but I slept though it so I’m not sure.",
      "author": "OhItsNotJoe",
      "created": 1567951629,
      "upvotes": 3,
      "replies": {}
    },
    "ezjv86k": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezjv86k/",
      "text": "At my school all lofted needs have a rail on them. Needs are lofted through bedloft so I guess it's a policy",
      "author": "Ummmmexcusemewtf",
      "created": 1567950865,
      "upvotes": 1,
      "replies": {}
    },
    "ezjlnrv": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezjlnrv/",
      "text": " I requested one (we have to at my campus) and was told they didn’t have any more. I’m just hoping I don’t fall out and die this semester",
      "author": "realcaptainkirk",
      "created": 1567946544,
      "upvotes": 1,
      "replies": {}
    },
    "ezjhopi": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezjhopi/",
      "text": "I had a very similar thing happen to me my sophomore year. I was sleeping on the top bed with no rail, while my roommates bed was perpendicular to my bed but under me, such that my head was above his bed but my body and legs were above the ground (so it kinda made a giant L shape). I don't remember clearly what happened but I definitely rolled off and fell to the ground, and my hip took most of the damage. But surprisingly it really didn't hurt too much and nothing got broken or anything. In fact I was so tired that the fall barely woke me up, I just stood, up, climbed back to my bed, and passed out again. My real question, the way our beds were set up, was how my head didn't land in my roommate's bed while the rest of my body had nowhere to go but the ground. I don't know if I would have survived that kind of fall.",
      "author": "AznKwokBoi",
      "created": 1567944823,
      "upvotes": 1,
      "replies": {}
    },
    "ezihj02": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezihj02/",
      "text": "Fell out my second week in college too no ideo how, never in my memory fallen out of bed before, somehow wasn't hurt at all despite the 6 fr drop and me waking up while falling, hit my chair on the way down which woke my roommate and friend up who freaked out thinking I must have really hurt myself.  I didn't have a rail but I used a board thing I rigged to be safe.",
      "author": "CheesytheCheesecurd",
      "created": 1567927200,
      "upvotes": 1,
      "replies": {}
    },
    "ezicos3": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezicos3/",
      "text": "Me and my father took a train across the US and I got the top bunk. When I was sleeping, the train was rocking back and forth til I rocked almost off the bunk. I literally woke up right when I was about to fall and caught the edge of the bed to hold myself up. Moral? Use the seat belt they have in the bed for when you sleep.  But I like living on the edge. Literally haha\n\nGlad your okay OP",
      "author": "BirdsArentRealKinda",
      "created": 1567924873,
      "upvotes": 2,
      "replies": {}
    },
    "eziafpz": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/eziafpz/",
      "text": "I broke my collarbone falling off a normally raised bed, you never know",
      "author": "a-sigh-lum",
      "created": 1567923827,
      "upvotes": 4,
      "replies": {}
    },
    "ezi9jym": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezi9jym/",
      "text": "Oh that’s a big fear of mine. I got to my dorm first day and 1) no railing, which is suppose to come standard for all lifts, and 2) it was built wrong, which made it half a foot higher than usual.",
      "author": "Blaze5643915",
      "created": 1567923416,
      "upvotes": 2,
      "replies": {}
    },
    "ezi5d7e": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezi5d7e/",
      "text": "So glad you’re okay OP! I’m German but did a semester in the US and got a single room with a regular non-lofted bed just because even with railings these lofted dorm beds scare me shitless. Why are these still a thing and why haven’t more people died falling off them? They seem so dangerous to me and as far as I know the US is the only country that has these.",
      "author": "riotnotdiet",
      "created": 1567921523,
      "upvotes": 5,
      "replies": {}
    },
    "ezi2shq": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezi2shq/",
      "text": "My freshman year I had a metal railing on my loft. It got kind of bent out because it was metal and a shitty mattress. One day I was laying in it on my back and rolled over and my leg hit it and knocked it off. And I went with it. The sequence of landing:\n 1. Metal railing\n2. My head on the metal railing\n3. The rest of me\nI'm pretty sure I gave myself a concussion, but I still went to work at 6 and left at 1:30.",
      "author": "YoderMcLongDong",
      "created": 1567920373,
      "upvotes": 1,
      "replies": {}
    },
    "ezhz13p": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhz13p/",
      "text": "mines lofted that high too & i had to move my mattress on the floor underneath bc it was terrifying. they don’t put rails on them at my college lol",
      "author": "butternutsquash9",
      "created": 1567918752,
      "upvotes": 4,
      "replies": {}
    },
    "ezhvdf0": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhvdf0/",
      "text": "I was at a military camp at a national guard base. The top bunks were about 7 feet off the ground with no rails. All you hear is a fucking earthquake rattle the whole barracks at 1 in the morning. I was basically asleep when it happened so I didn’t pay much attention. We had watches all night (people who walk around for security in the barracks and make sure people are sleeping). Some kid that’s like 6 2 and weighs 250 pounds fell from his rack. The watch promptly investigated what happened and asked him if he was ok and he responded “yeah” then proceeded to just sleep on the floor for the rest of the night.",
      "author": null,
      "created": 1567917184,
      "upvotes": 83,
      "replies": {
        "ezknguk": {
          "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezknguk/",
          "text": "When I was in basic at great lakes in 2005, the top bunks had rails. Kinda surprised they didn't on a national guard base, but also not surprised that the place to have bunks without rails is a national guard base.",
          "author": "just_an_ordinary_guy",
          "created": 1567963340,
          "upvotes": 12,
          "replies": {
            "ezknwhb": {
              "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezknwhb/",
              "text": "That’s interesting, maybe because the navy was tired of paying disability for the recruits who fall of their racks and injure themselves like OP did",
              "author": null,
              "created": 1567963547,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "ezkzneb": {
          "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezkzneb/",
          "text": "Spend long enough in the military and you can sleep through anything I swear. I slept through bombings pretty regularly.",
          "author": "deadwlkn",
          "created": 1567969281,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ezhu63c": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhu63c/",
      "text": "I sleep dead still so I just sort of never put up my railing. Never came close to falling. My condolences. People always asked me if I was worried that I might fall and I said I wasn’t.",
      "author": "U_Sam",
      "created": 1567916447,
      "upvotes": -2,
      "replies": {}
    },
    "ezhtzhd": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhtzhd/",
      "text": "I fell out of a lofted bed three times while asleep. \n\nThe first time I landed on my face no injuries with the mattress on top. My room mate walked in and woke me up.\n\nSecond time, sleep me got better. I landed on the mattress, woke up, went back to sleep.\n\nThird time I didn’t take the mattress with me when I fell out and so I nearly dislocated my shoulder. I instantly woke up. After that we installed a rail, like OP I highly recommend.",
      "author": "obiwondrs",
      "created": 1567916325,
      "upvotes": 14,
      "replies": {
        "ezjsuew": {
          "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezjsuew/",
          "text": "How did you take the mattress with you?",
          "author": "SammieLily2",
          "created": 1567949835,
          "upvotes": 8,
          "replies": {
            "ezk9sun": {
              "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezk9sun/",
              "text": "I’m really not sure how it happened because I was completely asleep the first two times. \n\nIt was the crappy twin mattresses that are in every dorm. I also tend to roll in my sleep. I’m pretty sure I rolled over violently enough that the mattress flipped with me.",
              "author": "obiwondrs",
              "created": 1567957249,
              "upvotes": 6,
              "replies": {}
            },
            "ezks9pa": {
              "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezks9pa/",
              "text": "probably pushed off the wall with their feet, sliding the mattress as they went",
              "author": "janet_weiss_majors",
              "created": 1567965700,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "ezhspiw": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhspiw/",
      "text": "My bed isn’t lofted (and I don’t live in a dorm) but I do have a high up bed frame and a thick mattress. I somehow managed to roll of the bed one day and get a huge bruise. I don’t even remember doing this but my boyfriend does, and makes fun of me to this day 😂",
      "author": "mackys",
      "created": 1567915595,
      "upvotes": 23,
      "replies": {
        "ezhvtad": {
          "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhvtad/",
          "text": "Lol I have woken up on the floor next to my ( regular height ) bed multiple times and have no recollection of falling out.",
          "author": "unlucky_black_cat13",
          "created": 1567917375,
          "upvotes": 7,
          "replies": {
            "ezk6il8": {
              "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezk6il8/",
              "text": "I actually managed to climb back into bed in my sleep somehow lol",
              "author": "mackys",
              "created": 1567955709,
              "upvotes": 3,
              "replies": {
                "ezmjste": {
                  "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezmjste/",
                  "text": "I may have done this at some point lol. I don't have a roommate or anything (I live with my parents) so this could have easily happened at some point.",
                  "author": "unlucky_black_cat13",
                  "created": 1567993029,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezhs1d6": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhs1d6/",
      "text": "The same thing happened to me last year. Hit my head on the metal trunk I used as a step stool. I was really lucky and only got a minor concussion and sprained my wrist. Use a railing!",
      "author": "mwheelz2022",
      "created": 1567915230,
      "upvotes": 27,
      "replies": {}
    },
    "ezhppqs": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhppqs/",
      "text": "I’ve already lofted my bed with the railing on the wrong side (toward the wall). Oof. At least I’d be down to die",
      "author": "Prit717",
      "created": 1567914074,
      "upvotes": 1,
      "replies": {}
    },
    "ezhnzyx": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhnzyx/",
      "text": "I’ve got one because like hell am I sleeping next to what feels like the edge of a cliff",
      "author": "fireandlifeincarnate",
      "created": 1567913253,
      "upvotes": 52,
      "replies": {}
    },
    "ezhjkgy": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhjkgy/",
      "text": "Couldn’t agree more!! This happened to my brother a few years ago, landed on his head (he was okay thankfully) and immediately requested a rail right after. Sleeping that high with no barrier would give me anxiety tbh. Glad you’re okay!",
      "author": "ifauhlin",
      "created": 1567911270,
      "upvotes": 13,
      "replies": {}
    },
    "ezhbwqr": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhbwqr/",
      "text": "In my state, it's legally required to use a rail if your bed is lofted because people have literally died falling off their beds. Be safe and put a rail!! The college should have bed rails. If there isn't one, put in a maintenance request and have the maintenance person install it since they know how to put it on correctly.",
      "author": "aaalbacore",
      "created": 1567908301,
      "upvotes": 400,
      "replies": {
        "ezho96x": {
          "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezho96x/",
          "text": "If a college doesnt do this even if its legal, there idiots, there is a huge possibility to sue there.",
          "author": "CrazFight",
          "created": 1567913372,
          "upvotes": 112,
          "replies": {
            "ezi6dge": {
              "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezi6dge/",
              "text": "they make us pay $200 for a rail",
              "author": null,
              "created": 1567921983,
              "upvotes": 70,
              "replies": {
                "ezi9m5g": {
                  "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezi9m5g/",
                  "text": "That’s fucked",
                  "author": "dizzledizzle98",
                  "created": 1567923446,
                  "upvotes": 55,
                  "replies": {}
                },
                "ezjrp3e": {
                  "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezjrp3e/",
                  "text": "Sounds like capitalism...\n\nRefuse, and ask for their documentation on buying the bed, and rails. This feels like a scam. Also, reach out to college newspaper and city to generate some peer pressure on it. Safety concerns on campus shouldn't have a price tag.\n\ninterim, use a $2 pool noodle in your mattress sheets.\n\nEdit: Further shopping, found it hard to even buy a bed without a rail, multiple options around $200 for a basic setup and rail. Rails and Guards by themselves are from about $30 to a really nice wooden style for around $150 with light googling.\n\nAlso noticed this article of interest. [11 Alive News: Accident inspires new rules over college bed rails](https://www.11alive.com/article/news/freak-accident-inspires-new-rules-over-college-bed-rails/85-463024437)",
                  "author": "CrimsonWolfSage",
                  "created": 1567949286,
                  "upvotes": 16,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ezh71am": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezh71am/",
      "text": "[deleted]",
      "author": null,
      "created": 1567906420,
      "upvotes": 301,
      "replies": {
        "ezhfjcq": {
          "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhfjcq/",
          "text": "As someone who also has epilepsy, railings are such a great idea. I had to get of my loft bed because it was such a risk, but do whatever you can to keep yourself safe!",
          "author": "GrazingCowss",
          "created": 1567909703,
          "upvotes": 51,
          "replies": {}
        },
        "ezhk1xd": {
          "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezhk1xd/",
          "text": "I cannot agree with this more. My first grand mal was when I was 17 last year and recently had another one a month ago, despite being fine for the last year thinking I wouldn’t have one ever again.",
          "author": "klm4life",
          "created": 1567911486,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "ezh4swe": {
      "link": "/r/college/comments/d14j6d/hey_guys_use_a_railing/ezh4swe/",
      "text": "glad your okay!",
      "author": "CheddarXanax",
      "created": 1567905563,
      "upvotes": 28,
      "replies": {}
    }
  },
  "updated": 1634055457
}