{
  "sid": "rhwyza",
  "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/",
  "title:": "Is it worth the hassle to try to convince my lab professor to round my Bio lab grade to an A-/90?",
  "text": "Alright so my Bio lab grade is an 89.46. It’s close to an 89.5 where the grade gets rounded to a 90. The lab grade is 25% of my final Bio grade and idk my Bio grade from hw, quizzes, & exam but I feel it’s at a solid B rn since I rarely get below an 80 on my quizzes & exams. I would really like a B+ as my final grade so is it worth the trouble to convince my Bio lab professor to round the 89.46 to a 90? It’s only 0.4 points but depending on my Bio grade from exams, it could possibly make a difference but I’m not sure",
  "author": "Dark-Blade",
  "created": 1639679693,
  "updated": 1639787784,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hotck95": {
      "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/hotck95/",
      "text": "In general don't ask for a grade to be rounded. Faculty generally know that students who are close would prefer the higher grade already and you don't gain a whole lot by asking but do risk developing a bad reputation and it may not even make a difference in this case in your overall bio grade (you should calculate what this is .The grade breakdown should be in the syllabus and you should be able to get reasonably close unless you have major/a lot of assignments that haven't been graded yet).\n\nQuite a few classes will curve or have a minor bump for students who are close. Others won't, but asking doesn't usually change it either way.",
      "author": "Melodic_Echidna",
      "created": 1639681152,
      "upvotes": 6,
      "replies": {
        "hotkhrw": {
          "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/hotkhrw/",
          "text": "I checked the syllabus and they said to look to my school website to see how grading is. I already calculated and I could be wrong but my final Bio grade would be a 85.96 so it’s basically an 86 regardless of the 0.4 points lol",
          "author": "Dark-Blade",
          "created": 1639684275,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hotdn45": {
      "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/hotdn45/",
      "text": "So you want them to round it up once so they can round it up a second time?  What about your hw, quizzes, and exam? How many little bumps will you be requesting for those? \n\nLiterally where does it end.  \n\nIn case it’s unclear, no.  You should not do this.",
      "author": "Judythe8",
      "created": 1639681574,
      "upvotes": 4,
      "replies": {
        "hotka02": {
          "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/hotka02/",
          "text": "I’m asking if it’s worth the trouble of asking her to round the 89 to a 90 for lab. The hw, quizzes, and exams are graded as whole numbers by the lecture professor while the lab professor grades mostly everything as a decimal. If the final grade won’t be affected at all with 0.4 points, then I’ll let it be.",
          "author": "Dark-Blade",
          "created": 1639684192,
          "upvotes": -1,
          "replies": {
            "hotxcl1": {
              "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/hotxcl1/",
              "text": "You should let it be anyway, because an 89.46 rounds to an 89, not a 90. \n\nLet’s say, just for kicks, that you successfully wheedle your prof. into the 90, and that this brings your final score in the class to an 89.46.  \n\nWhat happens next? Do you accept the B+ in the class, or do you ask for another round of double rounds? \n\nDo you not get how absurd this is?",
              "author": "Judythe8",
              "created": 1639689294,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "hovnilb": {
      "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/hovnilb/",
      "text": "Don't ask your professor to round your grade.  No one likes a grade grubber.  Also, why should your grade be rounded and none of your classmates?  The rules should apply equally to everyone.",
      "author": "DrPhysicsGirl",
      "created": 1639716716,
      "upvotes": 0,
      "replies": {
        "hoynvxc": {
          "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/hoynvxc/",
          "text": "That’s for the professor to decide. There’s no harm in asking. It shows you care and you’re willing to put yourself out there. It would only be an issue if you don’t take “no” for an answer.",
          "author": "wafflepancake5",
          "created": 1639772315,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "houoful": {
      "link": "/r/college/comments/rhwyza/is_it_worth_the_hassle_to_try_to_convince_my_lab/houoful/",
      "text": "No harm in asking! I got my 88.9 in geology rounded to an A because I asked! Make sure you make it clear that you’re not expecting them to but you’d really appreciate it.",
      "author": "wafflepancake5",
      "created": 1639700740,
      "upvotes": 0,
      "replies": {}
    }
  }
}