{
  "sid": "q22jhf",
  "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/",
  "title:": "Professors, under what circumstances would you allow a student to join ur class 6 weeks into the semester?",
  "text": "I desperately need to add a class rn or I am screwed. I have no other option. I found a class that is still open and they say the professor is really understanding and doesnt give a lot of assignments. If I can promise her I will do everything I can to get caught up as soon as possible do you think she would consider letting me join? I need this so bad",
  "author": "09141983",
  "created": 1633458642,
  "updated": 1634083882,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hfieih8": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfieih8/",
      "text": "I wouldn’t because that’s 6weeks of assignments I’ll have to grade",
      "author": "CozyMiniKitty",
      "created": 1633459363,
      "upvotes": 23,
      "replies": {
        "hfit86g": {
          "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfit86g/",
          "text": "This is actually reasonable compared to the other teacher who just assumes that the student won't be able to catch up.",
          "author": "LarryLongBalls_",
          "created": 1633465579,
          "upvotes": -2,
          "replies": {
            "hfudxun": {
              "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfudxun/",
              "text": "You know, many people who make these kind of decisions are not doing on the basis of assumptions, but experience and data.  Like there have been 0 times when someone adds more than 3 weeks into the semester that they actually can make up the work.",
              "author": "PersephoneIsNotHome",
              "created": 1633693976,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hfivdkj": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfivdkj/",
      "text": "My school requires that I accept students at any time during the semester.   I think it's horrible because you're just taking their money even though you know they'll fail.\n\nI feel like it's a crappy thing to do, and the school is only doing it to get their money.\n\nThat being said, I have had plenty of students join 5 weeks into the semester.\n\nBut throughout my 15 semesters of teaching, I have never had ***one*** of those students pass.  Not even with a D-.  It's just too hard.",
      "author": "emarcomd",
      "created": 1633466490,
      "upvotes": 12,
      "replies": {
        "hfue0t9": {
          "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfue0t9/",
          "text": "Exactly.\n\nEven switching sections of the same class is a nightmare.\n\nAllowing this is so messed up.",
          "author": "PersephoneIsNotHome",
          "created": 1633694030,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfilzy1": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfilzy1/",
      "text": "your best bet would be finding an online class that is student paced.",
      "author": "rynpickles",
      "created": 1633462548,
      "upvotes": 8,
      "replies": {}
    },
    "hfidens": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfidens/",
      "text": "Not trying to be discouraging here, but I have to say that there are no circumstances whatsoever under which I would allow a student to join my class halfway through the term. There is no way they could catch up. I would be inviting them to sabotage themselves if I tried to be accommodating in such a way.",
      "author": "alimck476",
      "created": 1633458878,
      "upvotes": 24,
      "replies": {
        "hfit3wc": {
          "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfit3wc/",
          "text": "You're underestimating a lot of students.",
          "author": "LarryLongBalls_",
          "created": 1633465529,
          "upvotes": -6,
          "replies": {
            "hfiyyf0": {
              "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfiyyf0/",
              "text": "I teach courses with a lot of reading and a lot of writing. I can assure you I'm not.\n\nOP might be lucky and go to an institution where it's not the prof's choice, though, in which case anything could happen.",
              "author": "alimck476",
              "created": 1633468026,
              "upvotes": 3,
              "replies": {
                "hfj3cri": {
                  "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfj3cri/",
                  "text": "Again, you're assuming that a student wouldn't have the capacity to catch up on the heavy course load just because many students have failed at it in the past. So a student whose capacity you don't know anything about is being punished because students in the past didn't succeed.\n\nIt's better if you're honest. If you don't want to correct 6 weeks worth of back log assignments, that's completely understandable. It's not reasonable that you single handedly pass judgement about a students ability to succeed in your class because others have failed in the past. A word of warning to the student should be sufficient (eg. \"the odds are statistically against you and if you fail it will hurt your GPA significantly\") but they should be able to make the choice themselves. Unless of course there is a legitimate reason (such as you not wanting a mountain of back log work).",
                  "author": "LarryLongBalls_",
                  "created": 1633469970,
                  "upvotes": -2,
                  "replies": {
                    "hfj3iyq": {
                      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfj3iyq/",
                      "text": "How many years have you taught? How many students have you taught in those years?\n\nLook, sticking an edit on here because you seem like you're defending OP and I'm not calling them a bad person or a delinquent student. I'm not suggesting punishing a student when I say I wouldn't let them into a course. It's about not giving them enough rope to hang themselves. I'll even concede I've known maybe two students who could have done it - that's two students in twelve years of teaching 300-500 students a year. I'm not willing to let people crash and burn on the off chance that they're the one in a thousand outlier. OP is in a jam, I can tell that, but they need to look for alternatives.\n\nI mean, from my own POV, if I actually went to my chair and said 'Can I let this student in six weeks into term?' he'd probably tell me I was delirious and to go home. It's just too much time. I'd do two weeks, maybe even three if the student was really convincing, but not six.",
                      "author": "alimck476",
                      "created": 1633470046,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                },
                "hfj4v1h": {
                  "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfj4v1h/",
                  "text": "Dude you really are underestimating students. Woah watch out. I had a teacher told me i can not rote learn 4000 chemistry reactions becuase it was impossible.  That mf then watched me top in that exam, and I was able to reicte the reactions backward. I think its your illiteracy that's making you think that way.",
                  "author": "HBOY_22",
                  "created": 1633470643,
                  "upvotes": -4,
                  "replies": {
                    "hfj5qx7": {
                      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfj5qx7/",
                      "text": "Oh, of course. My illiteracy. That would be it, clearly. \n\nJust the gentlest of suggestions, though. If you're going to start calling people illiterate you might want to spellcheck your posts before you hit 'reply'. Just so that the insult has the proper impact.",
                      "author": "alimck476",
                      "created": 1633471042,
                      "upvotes": 1,
                      "replies": {
                        "hfj64ss": {
                          "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfj64ss/",
                          "text": "Dude i typed from my mobile 😂😂. Chill out man.  Nothing much to be spicy about just telling you that you dont know shit about students and some how are in the field of academia",
                          "author": "HBOY_22",
                          "created": 1633471218,
                          "upvotes": -2,
                          "replies": {
                            "hfj6xyb": {
                              "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfj6xyb/",
                              "text": "No, I should be thanking you. The irony was beautifully funny. There was an art to it!",
                              "author": "alimck476",
                              "created": 1633471584,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hfmqnoo": {
              "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfmqnoo/",
              "text": "The latest I have ever allowed a student to join my class is three weeks. This has happened 7 times. Of those 7 students, one passed with a C+.\n\nAdmitting students this late into the semester is settling them up to fail.",
              "author": "TheProfessorsCat",
              "created": 1633543330,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hfiwfo3": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfiwfo3/",
      "text": "See if you school offers 8 week classes the second 8 week classes will be starting up this week and next week so hurry 😉",
      "author": "Rough_Personality188",
      "created": 1633466944,
      "upvotes": 4,
      "replies": {}
    },
    "hfj4027": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfj4027/",
      "text": "Can you take a summer class to catch up?",
      "author": "ilikecacti2",
      "created": 1633470260,
      "upvotes": 1,
      "replies": {}
    },
    "hfjax1j": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfjax1j/",
      "text": "Ask your advisor about short-term classes asap, they should be starting right about now",
      "author": "toofeduptocare",
      "created": 1633473430,
      "upvotes": 1,
      "replies": {}
    },
    "hfkrieb": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfkrieb/",
      "text": "I joined a class around 7 weeks in, but I had already taken another class with her before. Ended up with a B in the course. Just ask, can’t do any harm",
      "author": "Content_Balance3150",
      "created": 1633502474,
      "upvotes": 1,
      "replies": {}
    },
    "hfmq2ty": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfmq2ty/",
      "text": "Zero possibility. 6 weeks late? That is an obscene request. I would honestly think you were joking if you asked.",
      "author": "TheProfessorsCat",
      "created": 1633543075,
      "upvotes": 1,
      "replies": {}
    },
    "hfv6znf": {
      "link": "/r/college/comments/q22jhf/professors_under_what_circumstances_would_you/hfv6znf/",
      "text": "Does your school do a condensed 8 week Fall course?  Mine does and it starts Oct 26.  Look into it!",
      "author": "emarcomd",
      "created": 1633707975,
      "upvotes": 1,
      "replies": {}
    }
  }
}