{
  "sid": "qktj4l",
  "link": "/r/college/comments/qktj4l/i_cannot_study_and_i_dont_know_how_to_get_out_of/",
  "title:": "I cannot study and I don't know how to get out of this cycle",
  "text": "I'm in my third year of college, its not like my issue is study skills or anything like that. I'm fine when its the beginning of the semester and I feel like I have everything under control. But once a deadline starts looming, and I know the work i'm doing will impact my grade, I CANNOT bring myself to study. I was like this all through secondary school too.  I've never been able to fathom how other people work under even the slightest hint of stress. Like I literally cannot wrap my head around how people can just write their essays in advance of the night before the due date. I will procrastinate until kingdom come. Today I handed in my essay twenty minutes late without proofreading it and I have no idea what the consequences will be. I feel like shit.\n\nMy life is just a cycle of self hatred because I hate how lazy I am, and every semester I convince myself things will be different but they aren't. I'm becoming convinced that this is just how I am and I'll never manage to achieve anything because I don't have the self discipline to work on anything stressful. Its not that I don't care about school because I really, really do, and I'm very interested in what I'm studying. I always manage to do the most in the beginning of the semester, I don't skip any lectures and I do extra readings etc., but the work I do do is never reflected in my grades because I completely crumble when it actually counts.\n\nHas anyone else felt this way and been able to overcome it?",
  "author": "AMC0102",
  "created": 1635817808,
  "updated": 1635890644,
  "over_18": false,
  "upvotes": 33,
  "upvote_ratio": 0.95,
  "comments": {
    "hiymowh": {
      "link": "/r/college/comments/qktj4l/i_cannot_study_and_i_dont_know_how_to_get_out_of/hiymowh/",
      "text": "My rule is I finish every assignment a minimum of 24 hours in advance. Also when I have a daunting assignment I just read it. I don’t write a word or a number, just read it cover to cover and come back to it later. Personally I get stressed way more procrastinating than not because I know the longer I don’t do it the worse grade I’ll get.",
      "author": "harry01772",
      "created": 1635818131,
      "upvotes": 15,
      "replies": {
        "hiyne68": {
          "link": "/r/college/comments/qktj4l/i_cannot_study_and_i_dont_know_how_to_get_out_of/hiyne68/",
          "text": "Thanks for that advice",
          "author": "queendabliss",
          "created": 1635818453,
          "upvotes": 3,
          "replies": {}
        },
        "hj1dojb": {
          "link": "/r/college/comments/qktj4l/i_cannot_study_and_i_dont_know_how_to_get_out_of/hj1dojb/",
          "text": "Thanks a lot",
          "author": "Devyashjain",
          "created": 1635875479,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiz80kn": {
      "link": "/r/college/comments/qktj4l/i_cannot_study_and_i_dont_know_how_to_get_out_of/hiz80kn/",
      "text": "I hate studying with a passion. I’ve had better luck this year by planning when I do hw (start it a few days before it’s due, finish as I get closer) and by preparing for lectures. By doing the reading beforehand I can focus on what is actually being said during the lecture instead of being lost. So it’s like I’m counter-lazy — I do things way ahead of time so when things come up, I can just chill. It also helps that most of my hw is staggered naturally but for real. Starting is the biggest hurdle for me but once I start, I take a couple of days to consider what I’m doing so I have time to ask questions. \n\nI take breaks, a lot. I read in spurts. I fall asleep when I read half a chapter. Shit happens. But I take reeeally good notes during class. \n\nI’m not great at reading either (I mean I can read but I hate taking notes from reading. I prefer to annotate online PDFs and skim when I need to) so maybe you’re just psyching yourself out. \n\nLike, what are you doing with your notes? I get overwhelmed when I demand myself to take notes on reading. I can’t. I’ve learned that now. My notes are purely for summarizing and my detailed notes are for class. The same systems don’t work for everyone. When I don’t understand something (very apparent during lecture or when I’m doing homework) I try to find a video on it because sometimes I just need someone else to summarize for me. \n\nI’m like you, though — I go hard until midterms and then my interest just wanes. I start winging quizzes and hope for the best. \n\nI’m kind of rambling but essentially I panic the day of tests so I try to do all of my learning before class and solidify my knowledge with homework and asking the professor during class. \n\nI do work early so when the test rolls around, I’m not scrambling to learn something and then the test is a real reflection of what I’ve actually learned. It’s a pain, and not the best system for getting an A, but it works for me. Hope any of that helped. Hahaha",
      "author": "lizapanda",
      "created": 1635829789,
      "upvotes": 5,
      "replies": {}
    },
    "hizqua2": {
      "link": "/r/college/comments/qktj4l/i_cannot_study_and_i_dont_know_how_to_get_out_of/hizqua2/",
      "text": "You aren't lazy, you are too far in the other direction and you have a stress regulation problem and are using distractions and procrastination to avoid facing it.\n\nTry relaxation techniques and resist infinite procrastination/distractions.\n\nseparate/set places and times for things also helps",
      "author": "redditeater4000",
      "created": 1635846109,
      "upvotes": 5,
      "replies": {}
    },
    "hizbgqf": {
      "link": "/r/college/comments/qktj4l/i_cannot_study_and_i_dont_know_how_to_get_out_of/hizbgqf/",
      "text": "I honestly try to look at studying as not a chore but a time to relax. I throw on headphones with some calming background beats, get a blanket and study away. Really relaxing time for me",
      "author": "Icy-Air-7477",
      "created": 1635832360,
      "upvotes": 3,
      "replies": {}
    },
    "hiyp9z8": {
      "link": "/r/college/comments/qktj4l/i_cannot_study_and_i_dont_know_how_to_get_out_of/hiyp9z8/",
      "text": "Where do you try to study? If you've got access to a library, make a schedule to go there and commit to doing nothing but studying and homework while you're there. Try starting with three 2-hour sessions a week and see where that takes you.",
      "author": "trunkNotNose",
      "created": 1635819335,
      "upvotes": 2,
      "replies": {}
    }
  }
}