{
  "sid": "qvyqv0",
  "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/",
  "title:": "Nothing is more stressful than course registration",
  "text": "You have a set plan - a very good plan that will help you graduate on time. Boom! Every goddamn elective is full or at the same time as a required course that you have to take that semester. Now you are stressed, now you are sad, and now your day has been ruined.\n\nWelcome to my ted talk about why registration is the bane of my existence.",
  "author": "SeeSea8",
  "created": 1637153997,
  "updated": 1637389702,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 1.0,
  "comments": {
    "hkze5wm": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hkze5wm/",
      "text": "I swear registering for courses next semester was the hardest thing I’ve actually done this semester.",
      "author": "ExternalEnder",
      "created": 1637154205,
      "upvotes": 10,
      "replies": {}
    },
    "hkzs3bn": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hkzs3bn/",
      "text": "Registering for classes is so unnecessarily difficult. It’s such a headache.",
      "author": "taa20002",
      "created": 1637161004,
      "upvotes": 9,
      "replies": {}
    },
    "hkzygel": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hkzygel/",
      "text": "They let me register for class early by accident and I got to keep my schedule thank god",
      "author": "joshgarner8787",
      "created": 1637163676,
      "upvotes": 4,
      "replies": {}
    },
    "hkzkyok": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hkzkyok/",
      "text": "Work with your academic advisor. Any half good advisor will be able to work through it with you. If yours can’t, then find a new one",
      "author": "Friendly-Advice888",
      "created": 1637157756,
      "upvotes": 3,
      "replies": {
        "hl1patg": {
          "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl1patg/",
          "text": "I wish I could but there's literally only one advisor for my major. He's great, but in order to reserve a spot, you have to contact the teacher so they can contact the head of the department. It's a whole mess. I emailed one prof, and she straight up just said no lol",
          "author": "SeeSea8",
          "created": 1637188801,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkzpxi2": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hkzpxi2/",
      "text": "i have to register tomorrow, the kids at my school who registered today were all met with errors while trying to register, so i'm real excited :/",
      "author": "jolygoestoschool",
      "created": 1637160065,
      "upvotes": 3,
      "replies": {}
    },
    "hl0f2gg": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl0f2gg/",
      "text": "SAME!!! IT\"S SO STRESSFUL!!! Idk why but I don't like course registration it makes me feel nervous.",
      "author": "hanakoyo",
      "created": 1637170244,
      "upvotes": 2,
      "replies": {}
    },
    "hl0lmxz": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl0lmxz/",
      "text": "Not to mention the website crashes. At my first college, it would always run slow because everybody was on at the same time. It took me an hour just to get one class.",
      "author": "CapriciousSalmon",
      "created": 1637172790,
      "upvotes": 2,
      "replies": {}
    },
    "hl0o0ct": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl0o0ct/",
      "text": "Course registration at my old university was one of the worst processes I ever had to go through. Multiple tabs open at once, copying and pasting course codes and having to figure out which labs and tutorials can fit in as well.\n\nWhat an absolute nightmare that was.",
      "author": "pintossbm123",
      "created": 1637173717,
      "upvotes": 1,
      "replies": {}
    },
    "hl1shjt": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl1shjt/",
      "text": "You didn't put stuff in your cart a week before registration started so all you had to do was hit the confirm button?\n\nMy university lets me do that, as well as do a \"fill cart from plan\" option. Highly recommend.",
      "author": "SamSeebourne",
      "created": 1637190163,
      "upvotes": 2,
      "replies": {
        "hl25det": {
          "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl25det/",
          "text": "That's something new my university input this year, but the problem is that three of the courses I wanted to take were already full (so when I hit the confirm button, and error came up for them). Unfortunately with the system we use, there is no reserving spots even if its in your cart - the only way to do that is to go to the head of the department and the professor and give a valid reason as to why you need a spot reserved",
          "author": "SeeSea8",
          "created": 1637195985,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hl1df26": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl1df26/",
      "text": "Yes! At my school we are required to meet with our advisor at some point in the week before registration in order to remove the hold on our account that prevents us from registering at our given time. I met with my advisor last Monday and my slot was Friday at 11:30 am. If I had been able to register at my given time, I would have been able to get into all 5 of the courses I had pre-selected. But there was a system problem that said the hold hadn't been removed even though I had my meeting, and by the time I was able to register at like 1:30 that afternoon, 4 of my 5 classes had been filled. I am on the waitlist for all of those courses and while it looks like I will definitely be able to get into one of them (the professor is increasing the enrollment limit and I'm in 3rd on the waitlist) the others don't seem likely. So now I need to figure out what I'm going to do to have at least 8 more credits + PE if I want to stay on track for a 4-year graduation plan.",
      "author": "osrpokerchamp",
      "created": 1637183876,
      "upvotes": 1,
      "replies": {}
    },
    "hl1gm8q": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl1gm8q/",
      "text": "I guess I’m lucky because I had no problem registering. All of my required courses were open and at multiple different times throughout the day.",
      "author": "bottleoftrash",
      "created": 1637185175,
      "upvotes": 1,
      "replies": {}
    },
    "hl1mcek": {
      "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl1mcek/",
      "text": "[deleted]",
      "author": null,
      "created": 1637187550,
      "upvotes": 1,
      "replies": {
        "hl1pe67": {
          "link": "/r/college/comments/qvyqv0/nothing_is_more_stressful_than_course_registration/hl1pe67/",
          "text": "Oh damn that's nice. We're assigned registration times. Mine was 7:30 am and that's considered late. If you have a registration time that's 6:00-6:30, you're golden. If you get any time past 7:30 (I once had an 8:30 time), you're absolutely fucked.",
          "author": "SeeSea8",
          "created": 1637188840,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}