{
  "sid": "r7czfu",
  "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/",
  "title:": "Is my professor being unreasonable?",
  "text": "So my professor has a required attendance policy, and if you miss a certain number of classes you fail. For personal reasons I hit that number despite having a 96 in the class. However, one of the absences was recorded for the first session which occurred before I was even enrolled. I emailed my professor’s TA asking to be excused from that since I find it unreasonable to expect me to have attended a class I wasn’t even enrolled in, however the TA responded that it counted as an absence even though I wasn’t enrolled. Because of this I’m going from an A to an F unless I get this resolved. Am I in the wrong here or is there anything I can do?",
  "author": "ObsidianSky01",
  "created": 1638467450,
  "updated": 1639857590,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hmymrx2": {
      "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmymrx2/",
      "text": "It sounds like attendance is important to this professor, which they made clear to you immediately on their syllabus.  I'm not sure what \"a certain number is,\" but it's obviously not just the one you \"missed\" because you weren't enrolled. (Side note, but students often use late enrollment as an excuse to extend their summer break. Unless there was something interfering with your enrolling on time, I disagree that this should be automatically excused; many students hoping to get in my full classes will attend the first several classes before the drop/add deadline just in case).\n\nI don't know what \"personal reasons\" means, either, but you knew that you had already missed one class meeting, you knew the number of classes you could miss without penalty, and you knowingly exceeded it anyway.\n\nSo no, I do not think they are being unreasonable.",
      "author": "Judythe8",
      "created": 1638469377,
      "upvotes": 4,
      "replies": {
        "hmzdy1o": {
          "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzdy1o/",
          "text": "I didn’t enroll late, I enrolled before the deadline, they just had a session before I enrolled. This is the first time I’ve encountered anything like this, and everyone I’ve spoken to agrees, Professors and students. My personal reasons are irrelevant since I’m not arguing the other absences, just this one in particular. I am curious on why you think it’s ok to mark an absence for a class I wasn’t enrolled in, and therefore could not reasonably have been expected to attend.",
          "author": "ObsidianSky01",
          "created": 1638479799,
          "upvotes": 1,
          "replies": {
            "hmzqd05": {
              "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzqd05/",
              "text": "Your personal reasons are absolutely relevant if you are citing them as evidence that you deserve special consideration, which is precisely what you are doing.",
              "author": "Judythe8",
              "created": 1638484616,
              "upvotes": 4,
              "replies": {
                "hmzrud4": {
                  "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzrud4/",
                  "text": "I’m not, I’m bringing up a valid excuse I have for one of my absences. My “personal reasons” are for my other absences which I’m not arguing, and therefore have zero relevance in this discussion. I’m not asking for special consideration, I’m asking to be treated fairly",
                  "author": "ObsidianSky01",
                  "created": 1638485229,
                  "upvotes": -2,
                  "replies": {}
                }
              }
            },
            "hmzryli": {
              "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzryli/",
              "text": "You are only arguing this one because it’s your “Hail Mary” to blame your failure on circumstance and not your own actions.",
              "author": "Judythe8",
              "created": 1638485276,
              "upvotes": 4,
              "replies": {
                "hmzsgup": {
                  "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzsgup/",
                  "text": ">not enrolled\n\n>expected to attend\n\nI didn’t realize this was being counted as an absence until now and had I known I would have talked about this a lot earlier. It’s not a Hail Mary, it’s unfair treatment.",
                  "author": "ObsidianSky01",
                  "created": 1638485485,
                  "upvotes": -1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmyiliu": {
      "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmyiliu/",
      "text": "Many professors do count absences before you were enrolled, since you missed the material or discussion that day. I’d recommend next talk with the professor directly, then if that doesn’t get you anywhere, the department chair or academic Dean (if you’re at a community college, usually the Dean is the professor’s boss, not the department chair). Depending on the personal reasons for the other absences, talking with the Dean of Students could also be useful.",
      "author": "AceyAceyAcey",
      "created": 1638467763,
      "upvotes": 0,
      "replies": {
        "hmze1op": {
          "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmze1op/",
          "text": "Do they? Wierd, this is the first I’m hearing of it. I am thinking of speaking to the Dean if my professor won’t excuse me",
          "author": "ObsidianSky01",
          "created": 1638479838,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmzhejj": {
      "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzhejj/",
      "text": "This sucks and I feel for you but you knew the consequences of not going to class. I understand you didn't go because of personal reasons but if I knew that missing class a certain amount of times would mean risking failing the class, I would do everything possible to make it to class each and everyday. Hopefully you get this resolved but at the same time I don't think your professor is being unreasonable because he made it clear about his attendance policy.",
      "author": "Harajuku_Aj",
      "created": 1638481104,
      "upvotes": 4,
      "replies": {
        "hmzmxl8": {
          "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzmxl8/",
          "text": "I’m not arguing any of my other absences, just the one where I was marked absent despite not being enrolled",
          "author": "ObsidianSky01",
          "created": 1638483246,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hmzw36m": {
      "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzw36m/",
      "text": "At my university, faculty are not required to give make-ups or extensions for things students missed at the beginning of the semester before they enrolled in the course. The class starts on the first day and students who register late are expected to understand that they will be held to the same standards and policies as the students who registered before the beginning of the semester.",
      "author": "Act-Math-Prof",
      "created": 1638487015,
      "upvotes": 2,
      "replies": {}
    },
    "hmzff94": {
      "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzff94/",
      "text": "Yes this is definitely unreasonable, I’ve never once seen a teacher not excuse an absence for that. I’d recommend trying to talk to your teacher, and if that doesn’t work go to the Dean",
      "author": "ShiroYaksha01",
      "created": 1638480358,
      "upvotes": 1,
      "replies": {
        "hmzn6aj": {
          "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzn6aj/",
          "text": "This is what I figured. But the comments on here make it seem like this is common so idk how justified I am in this",
          "author": "ObsidianSky01",
          "created": 1638483339,
          "upvotes": 1,
          "replies": {
            "hmznzv4": {
              "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmznzv4/",
              "text": "You lose nothing in going to the dean about it, if anything it would save your grade. Do it.",
              "author": "No-Understanding4281",
              "created": 1638483662,
              "upvotes": -2,
              "replies": {
                "hmzs3o3": {
                  "link": "/r/college/comments/r7czfu/is_my_professor_being_unreasonable/hmzs3o3/",
                  "text": "Yeah I’ll be doing that if I can’t reach an understanding with my professor",
                  "author": "ObsidianSky01",
                  "created": 1638485334,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}