{
  "sid": "qtcwvi",
  "link": "/r/college/comments/qtcwvi/idk_what_to_do_next_serious/",
  "title:": "IDK What To Do Next (serious)",
  "text": "I'm currently attending a CSU & living on-campus at the dorms (2hrs away from home). College life is great; I hangout with my roommates & friends almost every day. I get to live by myself for once. I'm living the college experience. I'm learning so much about my major, and the insightful perspectives of my friends. I go to parties, although I don't drink or smoke at all. I'm more confident than ever. I'm away from my family (I don't really have a good relationship with them, although I love them. I just need time for myself). BUT I know this university that I'm attending rn is not for me, for sure. That's why I'll be transferring to another CSU. This time about 40 mins away. Most likely, I would have to commute by driving every day. That means I would have to live with my family again, with my mentally abusive dad. I love my mom & brother, but I can't mentally be with my dad anymore, for personal reasons. I've been thinking living on-campus or rent with some people near campus. But that's thousands of $ more. My family & I are low-income. Even with financial aid & scholarships, it's still going to make a dent in our accounts. But I payed my entire semester off for the school I'm attending rn by a summer job I had. \n\nOne thing I guess I can do is try to be recruited for a sport, since this CSU I'm going to attend offers the sport I did back in highschool. I was alright back then, definitely better now. COVID pretty much messed up my plans for schools, which resulted in a zig-zag pattern, rather linear like most people. \n\nIf I don't commute to the new school& live on-campus/near, I'll miss my hometown alot. I love my home town. It's perfect & ideal for me, but I just can't live without my family no more. I drive myself insane. IDK what to do. Any help/advice is much appreciated. \n\nThanks for reading this long post.",
  "author": "vibinggrass",
  "created": 1636846421,
  "updated": 1637181981,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}