{
  "sid": "rim6hh",
  "link": "/r/college/comments/rim6hh/1_point_away/",
  "title:": "1 point away…",
  "text": "Never thought I’d care enough to be this guy, but here I am. I’m 1 single point away from having an A in my class after everything was calculated. I aced all exams, showed up to every class early, got all participation points, etc. The only points that I am missing which prevent me from receiving an A are single points taken off of individual assignments. To be clear— on each assignment (there are 4 total) , I got 19/20, and all positive feedback. Not a single suggestion for improvement. So, this is 4 points that were deducted without reasoning, and I only need 1 for an A grade. At the same time, this teacher is extremely strict and made it very clear that he does not do  grade negotiations. I understand of course because I’d be annoyed if I were a professor having to deal with students begging for points, but this just seems petty on his part. Advice? It’s my first semester of college. Thanks all, and good luck",
  "author": "yeintheground",
  "created": 1639761507,
  "updated": 1639787313,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 0.88,
  "comments": {
    "hoxxlhy": {
      "link": "/r/college/comments/rim6hh/1_point_away/hoxxlhy/",
      "text": "That sucks tbh but your prof made it clear he doesn’t do grade negotiations and you could’ve reached out to him earlier in the semester to discuss your assignment grades and how to improve.",
      "author": "rynpickles",
      "created": 1639762086,
      "upvotes": 9,
      "replies": {
        "hoybdwm": {
          "link": "/r/college/comments/rim6hh/1_point_away/hoybdwm/",
          "text": "Yeah I already had, guess it just is what it is. Thanks for the reply",
          "author": "yeintheground",
          "created": 1639767375,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoxy91l": {
      "link": "/r/college/comments/rim6hh/1_point_away/hoxy91l/",
      "text": "What do you mean by aced your exams? I believe you did well but if your homework average was a 95%+, that's worthy of an A, do your exams must be bringing you down, right? Just trying to follow the numbers.",
      "author": "Thelton26",
      "created": 1639762339,
      "upvotes": 8,
      "replies": {}
    },
    "hoyxd99": {
      "link": "/r/college/comments/rim6hh/1_point_away/hoyxd99/",
      "text": "You really can’t win. If your prof was clear that he wouldn’t round grades, then that’s that. Sorry OP, that sucks. But a B is still pretty good.",
      "author": "JupiterRocket",
      "created": 1639776143,
      "upvotes": 3,
      "replies": {}
    },
    "hoyr4x8": {
      "link": "/r/college/comments/rim6hh/1_point_away/hoyr4x8/",
      "text": "Normally I’d say to ask for extra credit work or for your grade to be rounded, but it sounds like your prof made it pretty clear that he doesn’t do that. Take the L",
      "author": "wafflepancake5",
      "created": 1639773629,
      "upvotes": 2,
      "replies": {}
    },
    "hoyfbdz": {
      "link": "/r/college/comments/rim6hh/1_point_away/hoyfbdz/",
      "text": "Confused about what exactly we could be giving you advice on?",
      "author": "guardiandown1218",
      "created": 1639768903,
      "upvotes": 1,
      "replies": {}
    }
  }
}