{
  "sid": "qt51rr",
  "link": "/r/college/comments/qt51rr/any_nursing_majors_here/",
  "title:": "Any nursing majors here?",
  "text": "First of all: just how bad is stats?\nSecondly: how did you choose which college you go to?",
  "author": "userisidk",
  "created": 1636821999,
  "updated": 1637182002,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkhat7h": {
      "link": "/r/college/comments/qt51rr/any_nursing_majors_here/hkhat7h/",
      "text": "Nursing major here. Stats depends on how your professor is. I was actually entered a program that kinda got you ready for college during the summer. Stats was my best subject and i ended up becoming an unofficial TA for my professor the next year because i was so good at it. But during the semester for my actual stats class we got this miserable old cunt that wanted you to fail at every turn. His tests were impossible an his lectures were a joke. His hand writing was awful so you couldn’t understand and he would do some problems wrong during lecture. I hated the class with a passion. Mind you this was during covid and online but still after that experience i will never take a college level math class ever again after that experience. I still had one of the highest grades but 95% of the class was failing because he was such a shit professor. After taking the class i went to become a stat tutor during my summer so more students feel prepared. So it comes down to the professor to be honest. As for the college i chose, i got lucky and got into the best nursing school in my state and one of the top nursing schools in the country by sheer luck. To choose a nursing school, look at the NCLEX pass rate. That is the final test you will have to take to become an RN. So the higher the pass rate, the more liekly the school will prepare you for your career. BIG DSICLAMER. Please look very carefully at the conditions the schools you look into have. Some if not most nursing schools have very strict condtions like you have to pass a mock NCLEX in order to get your degree. My school has a 2 strike out policy were if you get below a C+ on any nursing or pre requisite course for a nursing course, them you will be kicked out of the university. This gets scary as these classes get more and more challenging as you progress and at any moment you could very well be kicked out of the school, so pick wisely.",
      "author": "Cosmix77",
      "created": 1636825764,
      "upvotes": 1,
      "replies": {}
    }
  }
}