{
  "sid": "r5abnn",
  "link": "/r/college/comments/r5abnn/how_should_i_go_about_getting_internships_wiht_no/",
  "title:": "How should I go about getting internships wiht no prior experience?",
  "text": "&#x200B;\n\nI'm a freshman CS major, this is my first semester but I have had no experience with coding in the past but I really want to get my foot in the door so I can get some experience and maybe a job as soon as I graduate.",
  "author": "Accomplished-Hope793",
  "created": 1638233145,
  "updated": 1638480559,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmlrwpd": {
      "link": "/r/college/comments/r5abnn/how_should_i_go_about_getting_internships_wiht_no/hmlrwpd/",
      "text": "The resume should be mostly projects. You'll need to go to the career center at your university to get the resume reviewed and to do a practice interview.\n\nCreate a LinkedIn with a professional photo and get a formal outfit (at least a button down shirt and tie) if you don't have one.\n\nAttend the university internship and job events. Reach out to local and regional companies. A lot of this will be cold emailing, participating in internship fairs, googling places that do internships around your area, talking with professors and older students (this should give you a good list of places to apply at), etc.\n\nWhen you talk to people, don't come across as trying to apologize for lack of experience or having lower expectations due to that. I absolutely hated people who made half of their conversation about how they had no experience but were a hard worker. They are the worst. Don't be docile. It doesn't add any value to the conversation or make us consider you over other people. Tell me about the projects you *did* do up until this point, what type of work interests you, and where you want to be after you graduate.\n\nBe aware of what the employer's goal is. Some see interns as an investment and will want to eventually convert you to full-time. Usually these places will prefer older students. Then there are places that just need work done and are hiring you solely to do work. They are focused on you being able to get work done in the short term and aren't concerned about converting you to a full-time job or convincing you why the company is so awesome. University sponsored internships are somewhere between these two. You'll want to communicate with each of these categories a bit differently and work on identifying what type of person they want to hire.",
      "author": "darniforgotmypwd",
      "created": 1638234578,
      "upvotes": 5,
      "replies": {
        "hmqaudw": {
          "link": "/r/college/comments/r5abnn/how_should_i_go_about_getting_internships_wiht_no/hmqaudw/",
          "text": "Thank you!",
          "author": "Accomplished-Hope793",
          "created": 1638316866,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmlrvxz": {
      "link": "/r/college/comments/r5abnn/how_should_i_go_about_getting_internships_wiht_no/hmlrvxz/",
      "text": "Go out and apply! Internships don't expect you to have prior professional experience, and those geared towards underclassmen don't expect in depth subject area knowledge usually.",
      "author": "mrbmi513",
      "created": 1638234569,
      "upvotes": 2,
      "replies": {}
    }
  }
}