{
  "sid": "rbfpo0",
  "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/",
  "title:": "Is taking 7 classes a bad idea?",
  "text": "Hi I’m starting college in winter 2022. I recently graduated from another program and realized I wanted to do something else. I got into my illustration program for school, and in the end I want to be a artist for kids books. But I also love literature and do hope to write my own book one day. My program has 6 classes already and I told a extra class on “creative writing” which I know will help me in the future. Is taking 7 classes to much? I only have classes Tuesday- Friday and I work weekends. (I have mondays off)",
  "author": "InformationFront",
  "created": 1638928933,
  "updated": 1639517268,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hno4tnz": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno4tnz/",
      "text": "It depends on you tbh. Some people thrive on high workloads while others do better with less pressure. Know yourself and your circumstances; decide based on that.",
      "author": null,
      "created": 1638930012,
      "upvotes": 7,
      "replies": {}
    },
    "hno55db": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno55db/",
      "text": "It depends on the person. I was able to do this but you might burn yourself out. Just remember to prioritize yourself first.",
      "author": "RobloxianNoob",
      "created": 1638930173,
      "upvotes": 5,
      "replies": {
        "hno7nrv": {
          "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno7nrv/",
          "text": "I will thank you for ur comment",
          "author": "InformationFront",
          "created": 1638931442,
          "upvotes": 1,
          "replies": {
            "hno7tet": {
              "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno7tet/",
              "text": "Yeah if you think you can do it you’ll probably be fine.",
              "author": "RobloxianNoob",
              "created": 1638931524,
              "upvotes": 2,
              "replies": {
                "hno80ax": {
                  "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno80ax/",
                  "text": "I’m honestly trying to push myself and wanting to achieve my goals, but at the same time I’m scared I’m gonna push myself to burn out",
                  "author": "InformationFront",
                  "created": 1638931623,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hno4iku": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno4iku/",
      "text": "I think youll overwork yourself, take like 5 and a few summer classes",
      "author": "dopelord_",
      "created": 1638929856,
      "upvotes": 3,
      "replies": {}
    },
    "hno6u5z": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno6u5z/",
      "text": "It's a bad idea for most people if you're talking 21+ credits. Most people would burn out or drop out. If they are mostly 1 credit classes maybe.",
      "author": "ComplexPurpose7",
      "created": 1638931025,
      "upvotes": 3,
      "replies": {}
    },
    "hno2vqd": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno2vqd/",
      "text": "If you're gonna take 7 classes, don't work because you'll burn out",
      "author": "elkfn2",
      "created": 1638929039,
      "upvotes": 2,
      "replies": {
        "hno32mo": {
          "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno32mo/",
          "text": "I wish I didn’t have to work but I need money somehow :/",
          "author": "InformationFront",
          "created": 1638929135,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hno4r0w": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno4r0w/",
      "text": "That is a lot of classes but they don't seem that hard. Will mostly come down to insane time management. You might not get straight A's but I'm sure you could pass them all.",
      "author": "IamGeorgeNoory",
      "created": 1638929976,
      "upvotes": 2,
      "replies": {}
    },
    "hno7e9j": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno7e9j/",
      "text": "I did 9 this semester! Somehow survived",
      "author": "AutomaticSelf9489",
      "created": 1638931310,
      "upvotes": 2,
      "replies": {
        "hno7kxs": {
          "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno7kxs/",
          "text": "Oh my, I’m glad you made it though!",
          "author": "InformationFront",
          "created": 1638931401,
          "upvotes": 1,
          "replies": {}
        },
        "hnp25k2": {
          "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hnp25k2/",
          "text": "Holy hell, that's amazing! How did you manage that? I didn't even think most colleges would allow somebody to take 9 classes!",
          "author": "ThoughtCenter87",
          "created": 1638951362,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hno479y": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hno479y/",
      "text": "How many credits? Most full-time students take 14-16 credits each semester. Though you are in class less than you would be in high school, you will have a lot more homework.",
      "author": "zifmer",
      "created": 1638929697,
      "upvotes": 1,
      "replies": {}
    },
    "hnp20et": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hnp20et/",
      "text": "Yes, taking 7 classes is a terrible idea, especially since you work. To give you some perspective, I don't have a job and the max number of classes I will take a semester is 5. It's finals week right now and I am feeling burnt out (to be fair though, my major is bio so these classes are pretty demanding). Only having one day to yourself will make you burn out fast. \n\nYou want to be especially careful as you're starting college. It's hard to understand the workloads and demands of college classes until you take one yourself, and a mistake many freshmen make is that they take a lot of classes their freshman year thinking they can handle them, and then they shit the bed when they realize they can't. You need to learn to walk before you learn to run, otherwise you're going to trip and fall.\n\nWhen I was a freshman at a cc, one of my buddies went off to a uni. They took six classes their freshman year, all of which were pretty demanding, because they thought it wouldn't be so bad. Keep in mind that semesters at his uni only lasted a month and a half or so. He failed the fuck out of most of his classes lol.\n\nI'd say to take between 4 and 5 classes, if you're wanting to go full time try to stick to that full-time credit minimum so as to not overload yourself your first semester (so if 12 units is considered full time at your college, try to stick to a schedule that's about 12 units. If you have 13 or 14 units that's okay, but try not to go for any more than that). Once you finish that first semester, you'll have a better understanding of what college classes are like and you can decide for yourself then whether or not you should take 7 classes.",
      "author": "ThoughtCenter87",
      "created": 1638951239,
      "upvotes": 1,
      "replies": {}
    },
    "hnp4unp": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hnp4unp/",
      "text": "Yes.",
      "author": "Positive-Court",
      "created": 1638953749,
      "upvotes": 1,
      "replies": {}
    },
    "hnpt11t": {
      "link": "/r/college/comments/rbfpo0/is_taking_7_classes_a_bad_idea/hnpt11t/",
      "text": "Yes, it is a terrible idea to do this  your first semester.\n\nYou can take the extra classes later if you can handle it.",
      "author": "PersephoneIsNotHome",
      "created": 1638971292,
      "upvotes": 1,
      "replies": {}
    }
  }
}