{
  "sid": "rbq3fx",
  "link": "/r/college/comments/rbq3fx/so_what_are_the_real_alternatives_to_exams/",
  "title:": "So what are the real alternatives to exams?",
  "text": "So what are the real alternatives to exams?",
  "author": "mavavilj",
  "created": 1638965857,
  "updated": 1639517249,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hnprq3e": {
      "link": "/r/college/comments/rbq3fx/so_what_are_the_real_alternatives_to_exams/hnprq3e/",
      "text": "Presentations , more “authentic “ assignments (present a case study in Anatomy, design a new antibiotic in micro, diagnose this patient in path, design a web site for a mock business).\n\nProblem is, \n\n1) same people who do well on the traditional exams mostly do the same on these.\n\n2) it doesn’t stop any of the complaining\n\n3) you cant passively do these, as you could possible passively absorb stuff for traditional exams\n\n4) These rely more on adjunct skills (writing ,speaking, critical thinking, time management, software and computer, workflow etc) than the exams do.\n\n5) They don’t solve any of the issues with the exams, except that  it is a better measure of really knowing the stuff next semester and not for this 5 min.",
      "author": "PersephoneIsNotHome",
      "created": 1638970623,
      "upvotes": 1,
      "replies": {
        "hnpt5gn": {
          "link": "/r/college/comments/rbq3fx/so_what_are_the_real_alternatives_to_exams/hnpt5gn/",
          "text": "But #5 is what I think true learning is about. I've been very depressed after realizing that there's a huge effort on succeeding on an exam course and then that stuff is plentifully forgotten after a few weeks or months. OTOH, when I tend to do projects, I find that they leave quite a long memory print because I've actually engaged with the stuff, rather than just learned to replicate someone else's course notes. I'm not sure about #1: I think there's a group that's not particularly good in \"exam-taking techniques\" (a skill of its own), but who are competent when they can reference material while working. I.e. they can utilize the information, but they may not be good at condensing material to answer to exams (w/o referencing material).",
          "author": "mavavilj",
          "created": 1638971355,
          "upvotes": 2,
          "replies": {
            "hnpv3km": {
              "link": "/r/college/comments/rbq3fx/so_what_are_the_real_alternatives_to_exams/hnpv3km/",
              "text": "You cant think what you want and every who does bad on exams says they are bad exam takers.\n\nBut all my classes have multiple forms of assignments and assessments.  With very very few exceptions, there is an incredibly high within subject stability (which means that whatever your grade is on one form of assessment , you get the same thing on all the others).  I literally hav students saying , can I do something else, I bombed the exam and I am a bad test taker and they have exactly the same grades on all the other stuff.  So number 1 I have data for, from multiple years and many classes at many levels.\n\nThe problem with number 5 is that if I only did this (at US universities) the grade inflated B/C students would now largely be down a full grade or more.  At least in lower level classes.  \n\nAnd this really only affects the middle 20-30 % of the students.  The top students use active learning and really engage with the material and do the stuff for real and do learn the stuff and remember it.\n\nThe lower third don't at all, even if they pass the class.  The C+/B- students can sometimes be compelled to engage in more active ways if you really force the issue.  But they don’t like it, they really try to do this as passively as they can, and do it to have it done rather than for the reason of the assignment.  \n\nThe assessments aren’t really where you learn, these are where I am measuring what you learned.  The activities and resources and discussions etc in the class (and what you do on your own) are where you get up to the point where you know the thing and can demonstrate that you know that thing.\n\nIf you are engaging with the stuff actively, you will remember it.\n\nDoing number 5 just compels a few more people who wouldn’t do that without being forced to do that to do that.\n\n\nIt is also murder to grade .  And particularly murder to grade the stuff handed in from people who have be dragged in chains to the active learning against their will.",
              "author": "PersephoneIsNotHome",
              "created": 1638972326,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hnpjv9b": {
      "link": "/r/college/comments/rbq3fx/so_what_are_the_real_alternatives_to_exams/hnpjv9b/",
      "text": "That can’t be easily cheated on? Not a damn thing. That you can cheat super easily on? The obvious stuff: projects, graded homework’s, etc",
      "author": "harry01772",
      "created": 1638966069,
      "upvotes": 2,
      "replies": {}
    },
    "hnqjm2b": {
      "link": "/r/college/comments/rbq3fx/so_what_are_the_real_alternatives_to_exams/hnqjm2b/",
      "text": "Projects or papers. But not all subjects are as suited for them.",
      "author": "tpfang56",
      "created": 1638982636,
      "upvotes": 1,
      "replies": {}
    },
    "hnql7ux": {
      "link": "/r/college/comments/rbq3fx/so_what_are_the_real_alternatives_to_exams/hnql7ux/",
      "text": "I'm a college students and I don't have exams. I do extensive projects in groups, 4 a year.",
      "author": "IwanST",
      "created": 1638983250,
      "upvotes": 1,
      "replies": {}
    },
    "hnq999i": {
      "link": "/r/college/comments/rbq3fx/so_what_are_the_real_alternatives_to_exams/hnq999i/",
      "text": "Papers. Personally I preferred papers to exams. Exams you could memorize, but constricted what you could do. There was a right answer and it is your job solely to find the right answer. Papers allow one to fully express themselves. Rather than a correct answer, papers are about your argument and your research. It is more fluid, dialectical rather than pure logic. Maybe more than one answer exists, papers allow for that possibility. Not to mention the fact papers allow for individuality in artistry, argument, and research.",
      "author": "DrAlawyn",
      "created": 1638978555,
      "upvotes": 0,
      "replies": {}
    }
  }
}