{
  "sid": "pr1lu5",
  "link": "/r/college/comments/pr1lu5/im_a_freshman_and_just_started_studying_computer/",
  "title:": "I'm a Freshman and just started studying computer engineering, however, I'm considering changing degrees to IT. Can anyone offer advice?",
  "text": "So I'm a freshman and just started 2 weeks ago. It's been a bit rough with my physics class because of the expected level of knowledge. My High School did not have algebra or calc based physics so I'm not familiar with a lot of the things they are talking about and I am doing catch up along with learning new content.\n\nI've never been crazy in love with math and sometimes struggle with it, I usually would get a B+ or A/A- though so I'm not bad at it. I'm just concerned though that I'm getting into a more intense degree than I realized. I picked Comp. Eng because I've always been really fascinated by how computers work on a fundamental level. Like, sure I get my harddrive stores information, but how the fuck do you make one of them. I'm looking at my school's other degrees and Computer Information Systems has gotten my interest.\n\nIt has far fewer math classes, and less demanding ones as well. I have a lot of questions and concerns though. For starters, is the pay still good? I've always liked the pay aspect of computer engineering and I'm pretty sure IT jobs still make a really good amount of money as well, but I wanna be sure. Two, what sort of jobs can I expect? The other aspect of Comp. Eng that I liked is the hands-on working with real-life chips, sensors, and electronics. I think I would not love a job where I sit and program all day.\n\n&#x200B;\n\nAny other advice degree-specific, or just in general would be greatly appreciated. Thank you!",
  "author": "Geeekus",
  "created": 1632027278,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hdfu13s": {
      "link": "/r/college/comments/pr1lu5/im_a_freshman_and_just_started_studying_computer/hdfu13s/",
      "text": "I've done internships in IT, and I am a computer science major interested in low level programming. Not necessarily building computer components, but topics interacting with them like operating systems. I think I can shed some light on your situation since we're somewhat similar.\n\nIT does pay very well. However, IT professionals need to know less about how a computer works. IT is often like being a mechanic, a computer handyman of sorts. You don't give two fucks about how buses work, or how CPUs process things, how you store information electronically. You need to know enough to fix the damn thing when it breaks, and that's it! This is still a path of extreme knowledge and study though, since real life operation tends to be extremely complicated. But you'll get a surface level (comparatively) understanding of how computers work compared to a comp. engineering degree. Are you okay with that?\n\nThis is a personal choice, but please, don't shy away from the hard things in life. Math is hard, and a pain in the ass, but you don't need to be a math genius to get through computer science. Getting B+s/A-s is what I got all throughout high school in math and I'm doing pretty okay in my computer science degree. You are clearly competent enough to excel in college level math with those grades, given enough work. Yes, it would be easier to just say fuck it and do IT. But you won't learn what you want to, and you might not work with what you want to either when you get older. If you really are passionate and intensely curious about how computers work, computer engineering is perfect for you. But it is an engineer's degree, truly! It will be hard. But everything worth doing is hard dude. That's what makes it awesome when you graduate. :)",
      "author": null,
      "created": 1632039033,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634056174
}