{
  "sid": "ralw4e",
  "link": "/r/college/comments/ralw4e/has_anyone_had_a_bad_experience_with_community/",
  "title:": "Has anyone had a bad experience with community college advisors? Like they almost want to keep you longer?",
  "text": "I’ve noticed throughout mine and others experiences that community college advisors are always trying to add more classes than you need. My personal experience I was told I needed at least 3 more semesters of classes that would boost my applications to transfer. I got into my choice school after graduating with my associates and ignored their advice. \n\nI later learned some friends of mine stayed for a few extra semesters to transfer to relatively easy schools because “the advisor told me I needed them”. Now my gf is at her 5th year of community. Most of it can be chalked to her light schedule and some personal tragedy in her life, but I found her advisor telling her the same bs I had to deal with. She could’ve easily graduated last year, but she’s taking all these “booster classes”.\n\nWhat gives? Do CC’s give grants for higher enrollment? Do they get better transfer numbers if they keep them longer?",
  "author": "ItsNjry",
  "created": 1638836341,
  "updated": 1639517752,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hnj3qqd": {
      "link": "/r/college/comments/ralw4e/has_anyone_had_a_bad_experience_with_community/hnj3qqd/",
      "text": "I’d also like to add that the kicker. Once I pointed out to my gf that she had enough credits to graduate, we took a look at her needed curriculum to graduate. Of course, the two actual classes she really needs to meet requirements to graduate are in her very last semester. So she’s been taking booster classes for 3 semester, when she could have just taken the 2 classes 3 semesters ago and call it a day. What’s interesting is the advisors discouraged taking those final two needed classes until later because the boosters would help to do well in them. \n\nIt’s like they are purposefully sabotaging you so you stay as long as possible. My gf is smart and even has a better GPA than I did when I got into my choice, but she takes the advisors advice as law.She doesn’t really pay attention to her curriculum because she assumed they had her best interests in mind. It’s so frustrating",
      "author": "ItsNjry",
      "created": 1638837001,
      "upvotes": 1,
      "replies": {}
    },
    "hnjyfxi": {
      "link": "/r/college/comments/ralw4e/has_anyone_had_a_bad_experience_with_community/hnjyfxi/",
      "text": "There’s no conspiracy I was a peer assistant at a community college. Some advisors would stick to the rules and recommend getting associates others would recommend just transferring and taking the least amount of classes to get in. She might just have had an inept advisor.",
      "author": "BlueOcean7987",
      "created": 1638850546,
      "upvotes": 1,
      "replies": {
        "hnk8mm2": {
          "link": "/r/college/comments/ralw4e/has_anyone_had_a_bad_experience_with_community/hnk8mm2/",
          "text": "That’s the thing, my gf could’ve graduated for her associates already. 3 semesters ago, she could’ve taken 2 classes and applied to graduate. They have her taking more math and more science before she take two classes slightly related, but not prerequisites. I don’t think it’s a conspiracy, I was thinking there’s an explanation. I’ll elaborate on my experience. I was graduating with my associates and applied to 5 schools. My advisor discouraged me saying I would not likely get into my top 3 schools without some extra classes to pad my GPA and prerequisites. I got into all 5 and have since graduated from my choice. Same thing with some friends getting encouraged to take extra classes for schools they were very qualified to transfer into with an associate. It’s just odd. If it helps it was multiple CCs in NJ",
          "author": "ItsNjry",
          "created": 1638856149,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}