{
  "sid": "qlzn8y",
  "link": "/r/college/comments/qlzn8y/college_isisnt_for_you/",
  "title:": "College is/isn’t for you",
  "text": "How did you know college is/isn’t for you? Got some people in my life trying to convince me to drop out (again) and it’s some bs. Just want an outside perspective.",
  "author": "yougotknoped",
  "created": 1635960776,
  "updated": 1636137503,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hj6bohq": {
      "link": "/r/college/comments/qlzn8y/college_isisnt_for_you/hj6bohq/",
      "text": "A.) Do your studies stimulate you. B.) Do you enjoy what you're doing C.) Do you see yourself utelizing anything you've learned or will be learning in the future (do you feel like you're wasting your time)",
      "author": "Waffl3_Ch0pp3r",
      "created": 1635961395,
      "upvotes": 1,
      "replies": {
        "hj6c0k7": {
          "link": "/r/college/comments/qlzn8y/college_isisnt_for_you/hj6c0k7/",
          "text": "In the past, yes. \nThis semester, not so much, but I need these classes to graduate. \nThe motivation for me is to get out of this cycle of working shitty retail jobs and to finally find something worth doing. I think that’s enough. According to my partner that’s a waste because I don’t know exactly head-on what I want to do in life. (Nobody does!!)",
          "author": "yougotknoped",
          "created": 1635961522,
          "upvotes": 2,
          "replies": {
            "hj6cjju": {
              "link": "/r/college/comments/qlzn8y/college_isisnt_for_you/hj6cjju/",
              "text": "That's the scam of college, they convince you that you'll never find gainful employment without them, however if you have a general goal or subject in mind it's an extremely beneficial experience to have. And you don't *have* to go to get experience for jobs, you can just go to learn something that you're passionate about.",
              "author": "Waffl3_Ch0pp3r",
              "created": 1635961723,
              "upvotes": 1,
              "replies": {}
            },
            "hj6cvvv": {
              "link": "/r/college/comments/qlzn8y/college_isisnt_for_you/hj6cvvv/",
              "text": "Never let the voices of others dictate what you want to do with your life. Even if everyone is telling you that you're wasting your time, if it makes you happy with yourself an you can look in the mirror with a sense of pride in yourself over what you're doing, then fuck em, you keep doing you.",
              "author": "Waffl3_Ch0pp3r",
              "created": 1635961850,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hj6jkqu": {
      "link": "/r/college/comments/qlzn8y/college_isisnt_for_you/hj6jkqu/",
      "text": "If you are able to earn decent grades (mostly As and Bs) in a college major that should help you find a good job after college, then I would stick with it. This is assuming you aren't taking out a burdensome amount of student loans to complete your degree.",
      "author": "clearwaterrev",
      "created": 1635964394,
      "upvotes": 1,
      "replies": {}
    }
  }
}