{
  "sid": "ri0efq",
  "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/",
  "title:": "Mental health issues? How much of a problem is it?",
  "text": "I read some of the posts on r/professors occasionally, and I always see professors complaining that their students use mental health as an excuse for poor or missed work. And then I come here and see that the students complain that the professors don't care for their mental health.\n\nI'm conflicted. On the one hand, there will always be students faking their mental health to get better grades with no effort. But then there will be those who actually do struggle. But like, who gets to decide if a student is actually struggling?\n\n&#x200B;\n\nHere's the issue. I saw a recent post saying that the students don't know how to differentiate regular stress and anxiety from a full blown problem, implying that the latter is necessary for legitimate concern. But does it have to be clinically diagnosed to be a problem? It seems a bit wrong, no? But on the other hand, I feel like having the \"stress and anxiety\" card will psychologically affect the student because they'd think that it's not normal to struggle. But how much struggle is normal??? What about the fact that some people have more tolerance for struggle than others?\n\n&#x200B;\n\nI don't know. I'm stressed on behalf of both sides. I'm a student now, so I understand the student's side well, but I can imagine how difficult it must be for a professor to take \"proper measures,\" whatever that may be. \n\nI'm not justifying or criticizing anyone or anything. I'm just genuinely conflicted.",
  "author": "International-Band52",
  "created": 1639689236,
  "updated": 1639787391,
  "over_18": false,
  "upvotes": 28,
  "upvote_ratio": 1.0,
  "comments": {
    "hou4wi8": {
      "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/hou4wi8/",
      "text": "At my school, you cannot bring up mental health issues pertaining to late work, missed exams & absences to profs unless you have an accommodation with the school and to get the accommodation you need a clinical diagnosis plus a psychiatrist has to fill out like a 15 page packet. \n\nThis seems like a fool proof method to the university but having access to these resources is a luxury and a lot of people can not afford a psychiatrist or therapist, even with insurance. A 45 minute appt with my psychiatrist costs $760 and i’m left with a $200 or so bill after insurance which for some college kids is simply not attainable. \n\nThe real gut of the issue is that a lot of college students aren’t taught proper studying techniques, time managment, problem solving or stress coping skills. Without those skills you become chronically stressed which can feel like or even eventually lead to having anxiety. \nUntreated stress can cause:  \n-  hair falling out \n\n-  heart attacks \n\n-  alcohol & drug abuse \n\n- GI issues\n\n- Headaches\n\n- High blood pressure \n\n- Diabetes \n\nand many more issues beyond the ones I listed above. So, you are correct in the fact that stress goes hand in hand with anxiety & depression. \n\nMy take as someone in psych is that those who are consistently faking mental illnesses to get out of assignments are 1. not so great people 2. will eventually end up dropping out or failing in their career. My other take is that even if it’s tiring profs need to have compassion towards those coming to them with their mental health issues and if they don’t want to be that support then they need to refer them to a campus resource that WILL help them.",
      "author": "rynpickles",
      "created": 1639692282,
      "upvotes": 12,
      "replies": {}
    },
    "hov83dq": {
      "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/hov83dq/",
      "text": "This is very important to discuss. Yeah, it’s becoming apparent to me too that a lot of students don’t know how to differentiate between struggle and a valid excuse to not properly do their work. \n\nFor example, I have legitimate mental health issues, but because of how badly I responded to it (not communicating with my professors and or least *trying* to get extensions, not getting therapy, not asking for advice). The nature of my problems made it harder to reach out for help, but harder doesn’t mean impossible. I know that’s not completely what you meant, but it’s the closest way I can relate. \n\nWell, I think clinically diagnosed MH issues is a sign that it’s a problem, a sign that should be taken seriously. But there are instances where you can’t diagnose it, but it’s still a major problem. An example of this instance is a sudden loss, bad breakup, or recent trauma (especially if it’s huge). \n\nAt the same time, I don’t blame professors for being skeptical. From my own experience, I think students in general can do a better job at not expecting everything to be catered to them. They have just as much as a responsibility. I know they technically know that they have a responsibility to meet professors/mental health professionals halfway, but the complaining I commonly hear kinda gives me a reason to think that they’re not putting in the effort. \n\nPS: I am not talking about students that are OBVIOUSLY struggling to the point of no doubt (schizophrenia, bipolar, major trauma, financial problems, family problems, physical impairments, dyslexia) to the point where they actually cannot cope for longer. I am talking about students that are in the gray area between having little to worry about (having financial and family support, being neurological) and literally not being able to cope.",
      "author": "Person9183736",
      "created": 1639709551,
      "upvotes": 4,
      "replies": {}
    },
    "hovuxkm": {
      "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/hovuxkm/",
      "text": "Lots of comments already talking about the students' sides so I'll add my 2 cents. \n\nI am also a student and I have seen others use mental health as an excuse for the stress that comes from their own actions. Ex. Someone procrastinates big time on an essay, which makes them stressed, which exacerbates their depression/anxiety, which leads to them not doing it. It's a repeating cycle. At that point you are owed no accomodations because it's a consequence of your own actions.",
      "author": "d6410",
      "created": 1639720932,
      "upvotes": 3,
      "replies": {}
    },
    "houb8hu": {
      "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/houb8hu/",
      "text": ">  On the one hand, there will always be students faking their mental health to get better grades with no effort. \n\nThis gets to the crux of why you hear professors complain-- it's because you assume it will \"always\" be a thing but it really is an extremely new phenomenon that none of us ever expected to actually see. \n\nIt sticks out in professors' minds as a bizarre and weird consequence of modern culture. Most professors-- the reasonable ones, at least-- care deeply about the mental health of their students and want what's best for them. But you see these discussions on r/professors because aside from the rising rates of mental health problems in college, we are taken aback and startled that mental health fakers *exist*. Like... what's up with that? Even as a millennial, this is something I never saw when I was in college, and I can only imagine the phenomenon seems even weirder to those who are older than me. So we want to discuss it. Not because we hate the mentally ill or because we want to play armchair psychologist, but because we are perplexed and want to understand what's going on.\n\n> But like, who gets to decide if a student is actually struggling?\n\nA professional. It sucks that not everyone has access to a professional, and we need to fix that problem, but the bottom line is that only a professional can and should be diagnosing mental health issues. \n\n> I saw a recent post saying that the students don't know how to differentiate regular stress and anxiety from a full blown problem, implying that the latter is necessary for legitimate concern.\n\nI disagree that the post implies that only a \"full blown problem\" is necessary for legitimate concern. What it did imply, I believe, is that it was necessary for accommodations. Mild manifestations of mental health issues do deserve concern, but if a person can get by without an accommodation, then they are expected to get by without an accommodation. Accommodations are there for those who need them, with \"need\" being the key word here. An anxious person who can do a presentation but doesn't want to due to the uncomfortable feelings that the presentation triggers is still expected to do the presentation. Why? Because they *can*. However, a person who has a panic attack the moment they get in front of people is a person with a more severe anxiety issue who cannot be reasonably expected to give a presentation. As such, that person-- the person with the \"full blown\" disorder-- gets an accommodation.\n\nNone of this means that we should not be concerned about the person who can't perform a presentation without shaking so much they can hardly talk. Professors care about those students too. But those students are *capable* of presenting, so there is no reason to accommodate them.",
      "author": "HumanDrinkingTea",
      "created": 1639694909,
      "upvotes": 6,
      "replies": {
        "houpnnm": {
          "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/houpnnm/",
          "text": "I went to class in the middle of a psychotic break and the teacher didn’t notice\n\nConversely this was at a school where you could take your pet if you just said it was your emotional support animal",
          "author": "cambriansplooge",
          "created": 1639701302,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "houhr14": {
      "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/houhr14/",
      "text": "I think it's helpful to remember the professors generally have no particular expertise in mental health. They're experts in history, biology, musical composition, or whatever else. Even psychology or social work professors are usually not certified as therapists or counselors and in any case can't be such for their students.\n\n  \nWhich means if a student approaches a professor with a mental health concern there's really a limited amount that can be done beyond referring them to people who do have that expertise. Certainly professors should (and my experience most do) offer sympathy for students in difficult situations. And many professors will build in extensions or dropped assignments or other ways for a student who had a bad go at something a chance to recover.\n\n  \nWhere the challenge comes in is a student whose mental health really stops them from engaging with the class enough to learn the material. There are mental illnesses that might mean for weeks at a time a student has trouble getting out of bed dealing with their classwork. but in those situations you have to respond much in the same way you would if a student got a serious concussion and needed weeks to recover, or was hospitalized for weeks and couldn't complete their work. \n\nAt some point you can't practically make up many weeks of missed material in a 15 week semester and the best option is to take advantage of the options for students who had shit happen mid-semester (either medical withdrawal or an incomplete for things that happened at the last minute) and seek assistance from people who can help deal with the mental health issues. And that sucks, because it fundamentally isn't the students fault and fundamentally there should be systems in place that allow the student to seek help with fewer barriers than their currently are. But somebody teaching the student in the class has limited options to help the student to learn the material before the end of the semester.",
      "author": "Melodic_Echidna",
      "created": 1639697730,
      "upvotes": 5,
      "replies": {}
    },
    "houglmb": {
      "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/houglmb/",
      "text": "One thought that just occurred to me here that I think plays into what you talk about with the prevalence of mental health and that is that anxiety is such a blanket term with varying causes and severities that causes it to be ignored. Reading posts here and other places online, I feel like most people deal with perfectionism as much as they do with anxiety. They can go hand in hand, but people get so anxious about tests and essays and presentations because they think they still need a 4.0 if that's what they always did in high school, or because they think that if they don't have friends by the end of the first month of school they miss their chance, or a bunch of other issues with whether or not they did it the \" right \" way.\n\nFor me, if more students identified the root cause of their anxieties and tried to find actionable ways to address them I think it would let those who suffer from \"serious\" anxiety and depression be taken more seriously. Everyone has stress generally and figuring out what lets you have a healthy response to it, and how much you can handle are invaluable skills that most people don't really have to learn until they go to college. \n\nIt's not college's job to teach you how to be a functioning adult, so if you need to take time to do that before your education, do it. Non-traditional students, even though to start just a three or four years after high school tend to be more mature, more successful, and more focused in my experience. Similarly, it's not the university's job to diagnose your mental health issues. If they have minimal resources that can point you in the right direction, or help you understand if you are out of the norm, I think that's good. But sometimes it feels like people think every University should have 100 license psychiatrist on staff and that's just not feasible without increasing fees on the students, many of whom may never even use those services.",
      "author": "Thelton26",
      "created": 1639697220,
      "upvotes": 4,
      "replies": {}
    },
    "hovcpbr": {
      "link": "/r/college/comments/ri0efq/mental_health_issues_how_much_of_a_problem_is_it/hovcpbr/",
      "text": "Let’s just say that my school’s counseling center is always packed. We have tons of therapists, but it’s still so packed. So many students at my school have issues with depression and anxiety. There’s even a waitlist for the group therapies. It’s honestly so sad. I found out that so many of us are on antidepressants as well, myself included. I would definitely say that school, work, and relationship/family stress are typically the main causes for stress among our demographic. The education system and capitalism has honestly failed so many of us",
      "author": "violetdesigned",
      "created": 1639711655,
      "upvotes": 1,
      "replies": {}
    }
  }
}