{
  "sid": "qxhocz",
  "link": "/r/college/comments/qxhocz/pros_cons_of_a_small_school_vs_big_school/",
  "title:": "Pros & Cons of a small school vs big school?",
  "text": "I am planning to go to college but I don’t know if I want to go to a small school vs big school. Smallest school would be 4,000 highest would be 25,000. I feel like going to a small school would be high school 2.0 and it would be hard to find someone because of the size. Does anyone have any experience when they decided?",
  "author": "Waste_Beginning7395",
  "created": 1637333072,
  "updated": 1637402261,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hl9uugy": {
      "link": "/r/college/comments/qxhocz/pros_cons_of_a_small_school_vs_big_school/hl9uugy/",
      "text": "I went to a small school and loved it. Honestly, with a big school, you only encounter people in your own major/classes/dorm/fraternity/club anyways. So the actual number will be much lower. \n\nIf you are looking to make meaningful connection with people, it’s much easier when you see them more often. \n\nThere are other trade offs of course.",
      "author": "onthevergejoe",
      "created": 1637340536,
      "upvotes": 2,
      "replies": {}
    },
    "hl9d6fw": {
      "link": "/r/college/comments/qxhocz/pros_cons_of_a_small_school_vs_big_school/hl9d6fw/",
      "text": "A small school could be really cool too because you would know a lot people. Like walking through the halls and saying hi. You’d probably know all the people in your major.",
      "author": "kapbear",
      "created": 1637333294,
      "upvotes": 1,
      "replies": {}
    },
    "hl9v7ld": {
      "link": "/r/college/comments/qxhocz/pros_cons_of_a_small_school_vs_big_school/hl9v7ld/",
      "text": "I go to a school with over 30,000 students and I’m transferring into a smaller school next year. In my experience, with so many people there isn’t really a sense of community within the school and it’s hard to meet people",
      "author": "ba-len-ci-10",
      "created": 1637340676,
      "upvotes": 1,
      "replies": {}
    },
    "hla0li4": {
      "link": "/r/college/comments/qxhocz/pros_cons_of_a_small_school_vs_big_school/hla0li4/",
      "text": "For context, my university has over 30,000 students.\n\nGoing to a larger college was one of the best choices I've ever made. Maybe it's because I grew up in a super small school (like, graduating class around 60), but going to a big university allowed me to grow so much into myself. I wasn't as afraid to take risks as I was in high school, because I knew that my actions weren't being micro-managed by everyone around me. (By risks, I mean like talk in class, answer questions, ask questions, etc.) I could be myself without being afraid of what other people would say, because even though gossip still exists, it's no where near where it was in my small high school. I felt like I could be me for the first time in my life, even when things got super hard. \n\nIn terms of community, I found my people over time. COVID didn't help, but I did encounter some of the same people in class after class because of my major and classes. I got an on-campus job and have some friends that way. More than anything, I pursued an interest of mine--D&D--and found some of my best friends ever. I even ended up dating one of them, who I've been with for over a year now). \n\nI won't lie, college hasn't always been easy. There have been hard times for sure. But I don't think I would be as well off now if I had gone to a smaller school.",
      "author": "This-is-fine---not",
      "created": 1637342780,
      "upvotes": 1,
      "replies": {}
    },
    "hlatduf": {
      "link": "/r/college/comments/qxhocz/pros_cons_of_a_small_school_vs_big_school/hlatduf/",
      "text": "A small college will have 1 main cafeteria, and maybe a coffee shop. It's easy to just run into someone you know to eat with, but there will be fewer food options. A large campus will have dining halls and cafes all over. It will take some effort on your part to meet someone at the same place and time. It's going to depend on your personality which is the best fit. It's the same with clubs and activities.",
      "author": "fawkes_fiesta",
      "created": 1637353588,
      "upvotes": 1,
      "replies": {}
    },
    "hlcerwq": {
      "link": "/r/college/comments/qxhocz/pros_cons_of_a_small_school_vs_big_school/hlcerwq/",
      "text": "Spent two years at a very small (less than 500 students) art school before Covid. We had a mandatory entry level course that threw all the freshmen and incoming transfer students together which made it pretty easy to meet people and make friends, but the school closed due to mismanagement and ended up merging with a larger institution. Don’t go to a school that’s *too* small, lol. It did feel pretty “high school” at times, but I was only there as a freshman and a sophomore, so I guess few of us hadn’t moved on from that mindset. The community was nice, but very insular. Everybody knew everybody, which has its own pros and cons. There was also a small café on campus and the library was pretty well-stocked. The campus was literally a single building (formerly a movie theater) in which all courses were held, with a few admittedly very good creative workspaces (wood shop, dark room etc.) for the different majors.\n\nI ended up transferring back to my home state rather than getting grandfathered in to the other school and am now studying at a community college (just under 25,000 full time students). My classes are all online and I haven’t actually been on campus despite attending the school for two years (I’m still on a lease a few states away lol) so I can’t say much about the social aspect of things here or the campus, but some of the resources for students (advising, tutoring etc.) are much better. \n\nThere were maybe 2-5 professors to a major at the smaller school I attended, so you didn’t have many options for classes. You’d be stuck with the same few people for the entire course of study for a major (and the same people taught electives, too), but again, it was significantly smaller than 5,000, so I don’t know if that would carry. Between the two experiences I’ve learned more from the courses I’ve taken in community college, and have felt more supported by the faculty there, even in fully-online courses. I have also liked the variety of courses available but I’m coming from an arts-focused institution, so I can’t really count that specifically in favor of small school/big school. \n\nIt’s up to your preference, I think. I wouldn’t worry too much about the high school mindset, I figure you will find people who are stuck in it anywhere. Join clubs, be yourself, friends will come to you naturally :) it sounds cliche, but that is very much my experience. \n\nHope this helps, and good luck!",
      "author": "magician-scientist",
      "created": 1637378754,
      "upvotes": 1,
      "replies": {}
    }
  }
}