{
  "sid": "qukre6",
  "link": "/r/college/comments/qukre6/hating_my_professor_right_now/",
  "title:": "Hating my professor right now.",
  "text": "Got a 0 on a midterm. Noticed that I uploaded the wrong file so before she could grade it or upload solutions online, I emailed her asking if I could email her the PDF of the exam. She has a recording of me doing the exam and scanning it. I sent her receipts of the times I had uploaded it and scanned it (thank you scannable). Yet, she didn’t answer me. This morning (5 days later) during lecture, she  says she can’t do anything because she already uploaded the solutions… this morning… even though I sent her receipts as proof I didn’t change anything and I can even screen record me retrieving the fucking exam and uploading it to show I didn’t change shit.",
  "author": "SmugFaces",
  "created": 1636995065,
  "updated": 1637181483,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkqr95e": {
      "link": "/r/college/comments/qukre6/hating_my_professor_right_now/hkqr95e/",
      "text": "Go to the department head or the dean",
      "author": "Can3333",
      "created": 1636997572,
      "upvotes": 4,
      "replies": {
        "hkqv288": {
          "link": "/r/college/comments/qukre6/hating_my_professor_right_now/hkqv288/",
          "text": "What would I say? I’ve had a similar experience a year ago (given a 0 despite the work being there on time, however professor couldn’t download it on his side). And the dean didn’t do anything.",
          "author": "SmugFaces",
          "created": 1636999069,
          "upvotes": 2,
          "replies": {
            "hkr8q2e": {
              "link": "/r/college/comments/qukre6/hating_my_professor_right_now/hkr8q2e/",
              "text": "A lot of schools and teachers are struggling to adapt to the challenges of online teaching. Even entire departments might not have good policies on when technology fails. You might have to look outside of the teaching faculty for guidance like an ombudsman or Student Affairs office.",
              "author": "hdorsettcase",
              "created": 1637004469,
              "upvotes": 2,
              "replies": {
                "hkrq1o0": {
                  "link": "/r/college/comments/qukre6/hating_my_professor_right_now/hkrq1o0/",
                  "text": "Thank you for the advice.",
                  "author": "SmugFaces",
                  "created": 1637011260,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}