{
  "sid": "rc2snm",
  "link": "/r/college/comments/rc2snm/going_back_to_school_after_3_year_break_supplies/",
  "title:": "Going back to school after 3 year break. Supplies advice appreciated!",
  "text": "I’m a 26F going back to college after working a corporate job which wrecked me. \n\nI’m looking to refresh my gear. Links welcomed!\n\nWhat’re some of your favorite supplies?\n\nLooking for:\n\n-Backpack (15in laptop)\n\n-Quiet mechanical keyboard\n\n-Planner (I’ve used Erin Condren for years, might want a switch up)\n\nI also really appreciate any extra tools not listed above that help with success or are a godsend that you didn’t know you needed. \n\nThanks!!",
  "author": "ManySunsAgo",
  "created": 1639002744,
  "updated": 1639517225,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hns1ziy": {
      "link": "/r/college/comments/rc2snm/going_back_to_school_after_3_year_break_supplies/hns1ziy/",
      "text": "USB’s. Yes multiple. I’ve had a few that decided I didn’t need my assignments and hone work I had saved on them and dumped themselves. \n\nI have a large wall calendar which also helps keep my thoughts straight for deadlines. \n\nColor’s tabs and post it notes for marking pages in text books and writing notes on. \n\nThe usual pens. pencils. Calculator. Highlighters. Snacks. Something to figgit with. White out. \n\nWelcome back to school.",
      "author": "skippy5433",
      "created": 1639003553,
      "upvotes": 1,
      "replies": {}
    },
    "hns4wh4": {
      "link": "/r/college/comments/rc2snm/going_back_to_school_after_3_year_break_supplies/hns4wh4/",
      "text": "My recommendation on the backpack is an ogio backpack. I got one as swag from an internship and it's phenomenal. I had a dedicated laptop sleeve on the back that kept it nice and protected as well as a huge pocket that could fit several textbooks and a 5-centric notebook. It also have pockets with all the pouches and slots for pens pencils and calculators.\n\nNow that I'm graduated when you set as an emergency 72 hour kit and it's stuffed to the brim but is extremely sturdy and comfortable to wear even when it's so full.",
      "author": "Thelton26",
      "created": 1639004772,
      "upvotes": 1,
      "replies": {}
    }
  }
}