{
  "sid": "qv5ds7",
  "link": "/r/college/comments/qv5ds7/23_going_to_college_how_do_i_prepare_for_math_and/",
  "title:": "23 going to college. How do I prepare for math and science?",
  "text": "23, heading to college next fall. I’ve always been pretty good with all the other subjects. I’ve always been terrible at math, which in turn makes me terrible at science. I forgot a lot of the stuff that I did know about math and science. I got a 18 on my ACT.\n17 Math, 17 Science, 20 English, 20 Reading. What do I need to do to prepare, you could basically say I’m starting from scratch that’s how bad I am at math now.",
  "author": "dropdeaddaddy69",
  "created": 1637060538,
  "updated": 1637387182,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "hkunb8o": {
      "link": "/r/college/comments/qv5ds7/23_going_to_college_how_do_i_prepare_for_math_and/hkunb8o/",
      "text": "Khan Academy, Professor Leonard",
      "author": "ShadowIG",
      "created": 1637069591,
      "upvotes": 9,
      "replies": {}
    },
    "hkunofb": {
      "link": "/r/college/comments/qv5ds7/23_going_to_college_how_do_i_prepare_for_math_and/hkunofb/",
      "text": "Youtube, Professor Dave Explains",
      "author": "milk1tea",
      "created": 1637069775,
      "upvotes": 4,
      "replies": {}
    },
    "hkuqdpr": {
      "link": "/r/college/comments/qv5ds7/23_going_to_college_how_do_i_prepare_for_math_and/hkuqdpr/",
      "text": "Seconding Khan Academy.  Also, from someone who teaches math at a uni, take your time and try to understand why things work.  The problems I see from students just coming in tend to be with exponents, logarithms and trig functions.  Beyond that, it's a case of people rushing and missing small things.",
      "author": "FreakyBlueEyes",
      "created": 1637071106,
      "upvotes": 2,
      "replies": {}
    },
    "hkvevab": {
      "link": "/r/college/comments/qv5ds7/23_going_to_college_how_do_i_prepare_for_math_and/hkvevab/",
      "text": "The best thing you can do for yourself in math is make sure that all your foundational skills are in place. No doubt you’ve heard “math builds on itself,” and that is absolutely true (although not in quite the linear way that it’s often said). \n\nGet on Khan Academy ASAP and go all the way back to the beginning (the beginning-beginning, I mean it). You’ll fly through material at first and that’s great, but the instant you’re not clear on WHY a problem works, never mind the *how*, that’s when you slow down and start watching the explanation videos. Pay particular attention to fractions, division/grouping, and all that middle school math-as-language material - it’ll be reinforced hard in Algebra II. Once that’s solid, you can start working through HS courses. \n\nThis WILL be time-consuming, but twenty minutes a day, every day, is better than long cram sessions. KA does a good job of breaking large concepts down into bite-size skills and helping you diagnose weaknesses. You can, of course, get a tutor who will help you simultaneously with any current classwork as well guiding the finding-and-filling-foundational-holes process (shameless advertising: hi, “fixing” adult learners is literally my specialty and yes I am taking new clients), but that can get expensive long-term and the KA route works as well. Best of luck!",
      "author": "themathymaestro",
      "created": 1637081494,
      "upvotes": 1,
      "replies": {
        "hl3ttas": {
          "link": "/r/college/comments/qv5ds7/23_going_to_college_how_do_i_prepare_for_math_and/hl3ttas/",
          "text": "Thank you so much. I was in dire need of guidance because I had no direction whatsoever. The highest class I need to take for my major is Calc. \nI tried helping my sister with a multiplication problem (4th grade) and she tried showing me some turtle method or something and I didn’t understand and I didn’t remember how I used to do it. Like when I saw I’m bad I’m BAD. \nI know how to multiply numbers and all the roots of the multiplication table because it was something I could always remember. Trying to do that longhand KILLED ME.",
          "author": "dropdeaddaddy69",
          "created": 1637232165,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkw79bu": {
      "link": "/r/college/comments/qv5ds7/23_going_to_college_how_do_i_prepare_for_math_and/hkw79bu/",
      "text": "I think your best bet will be preparing your discipline. Discipline will get you through college. \n\nI came back after a long period away and I haven't had any issue getting right back into it. I was always good at math and science though. \n\nDepending on the major you're going into, it can be pretty basic. There will be tutors available on campus as well. \n\nHonestly though, what will make you successful is doing every single assignment and practice problem the professor suggests. Failing is super easy once you stop going to class and doing the assignments.",
      "author": "Awkward_Mail_2786",
      "created": 1637092594,
      "upvotes": 1,
      "replies": {
        "hl3tj9e": {
          "link": "/r/college/comments/qv5ds7/23_going_to_college_how_do_i_prepare_for_math_and/hl3tj9e/",
          "text": "I’m very disciplined. That’s a skill I had to relearn throughout me years out of school. Glad I learned it, but my teachers always did my problems for me during school If I couldn’t figure it out. At the time I thought it was amazing. Now I regret them ever doing even one problem for me :(",
          "author": "dropdeaddaddy69",
          "created": 1637231932,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}