{
  "sid": "qpgbza",
  "link": "/r/college/comments/qpgbza/deciding_on_off_campus_apartment_or_living_with/",
  "title:": "Deciding on off campus apartment or living with parents in college.",
  "text": "Looking of insight on this difficult decision. Currently I live with my parents and commute 45 minutes - 1 hour (depending on traffic) to campus for college. Currently I feel this hinders my ability to participate in study groups or other social college activities. My university however does not have much dormitory housing (so that is not an option). I would have to live off campus and being in a major USA city the cost of rent is anywhere from $850-$1,300 a month. I would have to take this out in students loans. In short with the time I have left in college this would add $10,500 in student loans. Making my total loans for my undergrad come out to $78,000 upon graduation. My question is. Is this worth it? Is this too much? Is it pointless to get an apartment close to campus?  \n\n\nSome Pros & Cons I have listed:  \n**Pros:** \n\n* Freedom\n* Possible higher social involvement\n* Closer to campus (possibly bike to campus)\n* More living space\n\n**Cons:**\n\n* $10,500+ extra in unnecessary student loans\n* Poses a risk to future finances\n* Added stress of renting an apartment\n\n**TLTR:** Thinking of taking out $10,500 in student loans just to move 45 minutes closer to campus to be more involved on campus (hopefully). Is it worth the extra loans?",
  "author": "the_Trumoo",
  "created": 1636386405,
  "updated": 1639859044,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hjts4w4": {
      "link": "/r/college/comments/qpgbza/deciding_on_off_campus_apartment_or_living_with/hjts4w4/",
      "text": "Honestly for $10,500 I’d live with my parents",
      "author": "roachincalzone",
      "created": 1636392656,
      "upvotes": 14,
      "replies": {}
    },
    "hjv4jvk": {
      "link": "/r/college/comments/qpgbza/deciding_on_off_campus_apartment_or_living_with/hjv4jvk/",
      "text": "For me personally, $10.5k in unnecessary student loans would not be worth it at all.",
      "author": "NoDryHands",
      "created": 1636412210,
      "upvotes": 7,
      "replies": {}
    },
    "hjva4tc": {
      "link": "/r/college/comments/qpgbza/deciding_on_off_campus_apartment_or_living_with/hjva4tc/",
      "text": "Absolutely not worth it. That stuff will come up to bite you the worse way possible. And since it's off campus that's a commitment, unless it's SPECIFICALLY off campus housing catered to students, then that's a regular apartment that from my understanding cannot be covered by loans. \n45min to an hour is a walk in the park. It's not going to hinder anything for you, you just have to plan in advance and get there early, or stay in the area and occupy yourself with other things on campus or nearby.",
      "author": "Jusunie",
      "created": 1636414643,
      "upvotes": 5,
      "replies": {}
    },
    "hjvuueo": {
      "link": "/r/college/comments/qpgbza/deciding_on_off_campus_apartment_or_living_with/hjvuueo/",
      "text": "Dude live with your parents. You're not gunna go out nearly enough for it to be worth it. If you wanna get opportunities after school, you absolutely need a 3.5+gpa, in addition to at least an internship or two in your field of study. Which takes a fuck ton of work, speaking as a computer science major. Getting a good job is super tough and competitive now a days, so that's the only way to stand out",
      "author": "menglish025",
      "created": 1636424042,
      "upvotes": 2,
      "replies": {
        "hp06u3w": {
          "link": "/r/college/comments/qpgbza/deciding_on_off_campus_apartment_or_living_with/hp06u3w/",
          "text": "A little hyperbolic. Unless you are going to graduate school or medical school, or you are simply attempting to work for a place that values grades highly during the screening process, your GPA will be fine as long as it's not under a 3.0, especially in a field like computer science.",
          "author": "ScaredOfLife666",
          "created": 1639796570,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}