{
  "sid": "r6985v",
  "link": "/r/college/comments/r6985v/minoring_in_a_profitable_field_doublemajoring/",
  "title:": "Minoring in a profitable field? Double-majoring?",
  "text": "Cut straight to the chase:\n\nI’m majoring in music composition, and it is a field that does not make much money by nature (unless you’re… really good.) I really want to apply myself in the time that I am in college to achieve a living that is fun (through my music degree) also one that gives me a decent living. I also want to major in trumpet performance to supplement that degree, although I’m not necessarily on that path, and I may not choose to do so. Depends on whether I decide to also major in a profitable field.\n\nI was pretty good at mathematics in high school, did well in mostly all subjects. (Aside from maybe English classes). What advice do you have for this?",
  "author": "zah_vee",
  "created": 1638343786,
  "updated": 1638480389,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hms4hid": {
      "link": "/r/college/comments/r6985v/minoring_in_a_profitable_field_doublemajoring/hms4hid/",
      "text": "A minor works as a supplement. It doesn't really stand on its own. For instance, a CS major with a business minor is good because your CS major shows your quant skills and your minor shows your aptitude for soft-skills and general knowledge on business. A business major and a stats minor works well because you have strong business knowledge and can leverage statistical skills to do roles like business analytics.\n\nMath doesn't really support music to make you a more attractive job candidate unfortunately. Besides teaching, or as you say, being very, very good, you're pretty shit out of luck for profitable work for your degree.",
      "author": "maora34",
      "created": 1638354357,
      "upvotes": 3,
      "replies": {
        "hmshmea": {
          "link": "/r/college/comments/r6985v/minoring_in_a_profitable_field_doublemajoring/hmshmea/",
          "text": "Fuck. Thanks for your reply.",
          "author": "zah_vee",
          "created": 1638363727,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmrz77l": {
      "link": "/r/college/comments/r6985v/minoring_in_a_profitable_field_doublemajoring/hmrz77l/",
      "text": "You could also major in teaching.  Teach music in a school somewhere",
      "author": "Lord_Olga",
      "created": 1638349746,
      "upvotes": 2,
      "replies": {
        "hmshsrv": {
          "link": "/r/college/comments/r6985v/minoring_in_a_profitable_field_doublemajoring/hmshsrv/",
          "text": "Thought about that too.",
          "author": "zah_vee",
          "created": 1638363829,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}