{
  "sid": "qzsdgr",
  "link": "/r/college/comments/qzsdgr/buying_a_bed_framemattress_on_a_college_student/",
  "title:": "Buying a bed (frame/mattress) on a college student budget?",
  "text": "I'm moving into my first unfurnished apartment in a little under two months. I've never bought my own bed before, and I'm overwhelmed by all the options out there. Also, I've heard that people usually spend $1000+ on a mattress alone, which seems outrageous for a college student :(\n\nSo, where did you guys go to get a bed frame and/or mattress? I know that people sometimes buy furniture from Facebook Marketplace, Craigslist, etc., but I'm wary of doing that for a bed. \n\nI'm open to pretty much any recommendations, but I'd prefer something that's relatively easy to assemble. Also, my budget is flexible, but it'd be amazing to get an entire bed for under $500.",
  "author": "a_wagen",
  "created": 1637606408,
  "updated": 1637689066,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlo4uhi": {
      "link": "/r/college/comments/qzsdgr/buying_a_bed_framemattress_on_a_college_student/hlo4uhi/",
      "text": "There are some great cheap options on Amazon, Walmart, Target etc. I would consider buy a cheap mattress and then buying a more comfortable mattress topper to put on top afterwards; that might be a good option to save some money. I don’t recommend a mattress off Facebook Marketplace for the risk of bedbugs",
      "author": "waterfall_777",
      "created": 1637606730,
      "upvotes": 2,
      "replies": {}
    },
    "hlo7991": {
      "link": "/r/college/comments/qzsdgr/buying_a_bed_framemattress_on_a_college_student/hlo7991/",
      "text": "I got my mattress and bed frame from Amazon. Pretty sure i got zinus brand items",
      "author": "biggestbaddestnerd",
      "created": 1637607689,
      "upvotes": 2,
      "replies": {}
    },
    "hlo5j2c": {
      "link": "/r/college/comments/qzsdgr/buying_a_bed_framemattress_on_a_college_student/hlo5j2c/",
      "text": "This is going to sound crazy, but hear me out.\n\nWe got a bedbug infestation and for a while we got really cheap metal bed frames that fold from walmart\n\nhttps://www.walmart.com/ip/Mainstays-18-High-Profile-Foldable-Steel-Bed-Frame-Powder-Coated-Steel-Twin/580430886?wmlspartner=wlpa&selectedSellerId=0&&adid=22222222227153932566&wl0=&wl1=g&wl2=c&wl3=265173891516&wl4=pla-440382023675&wl5=9004422&wl6=&wl7=&wl8=&wl9=pla&wl10=8175035&wl11=online&wl12=580430886&veh=sem&gclid=CjwKCAiAnO2MBhApEiwA8q0HYaFWbAweGkKKNPzzGPvwB2CXJ61Qt0wX_AsFA0EmLtAKu3u9opwOQRoCsVMQAvD_BwE&gclsrc=aw.ds\n\nAn air mattress with a built in pump and a 2 in gel mattress topper.\n\nNobody wanted to go back to their regular mattresses because this was so comfortable.\n\nIf you want a real mattress you can also get a cheap one from walmart with a topper.\n\nI would not buy either a bed frame or a mattress second hand",
      "author": "PersephoneIsNotHome",
      "created": 1637606998,
      "upvotes": 1,
      "replies": {}
    }
  }
}