{
  "sid": "q1k68k",
  "link": "/r/college/comments/q1k68k/should_i_get_a_workstudy_job/",
  "title:": "Should I get a work-study job?",
  "text": "I'm a freshman who commutes to school. On average, I'm at school 8 hours a day Mon-Thurs. I'm taking five classes (three 4 credit, one 5 credit, one 1 credit). FAFSA covers my entire year. I want to dorm or get an apartment next year but FAFSA won't be able to cover everything. That said, I'm wondering if I should get a work-study job to cut down some of the costs. But I'm not sure because I'm taking 18 credits and it's a lot of work.",
  "author": "itrashcannot",
  "created": 1633396735,
  "updated": 1634084187,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hffxd01": {
      "link": "/r/college/comments/q1k68k/should_i_get_a_workstudy_job/hffxd01/",
      "text": "Faculty here.\n\nFrom years of experience working with students, I can tell you without doubt that working while in school definitely makes things harder.  Still, millions of students do it every semester, so you can too if you really want to.\n\nIf you decide you want to get a job to help save up some money, then I *strongly* advise you to worker the fewest number of hours a week that you can get away with that still meets your financial needs or goals.  Remember that as a student your highest goal is to learn as much as possible and perform as well as you can in your classes.  It doesn't help in the long run for you to make some money with a job, only to see your grades suffer such that you lose financial aid or have to re-take some classes or something like that.\n\nSo if you feel that you are absolutely on top of your studies and you have a number of free hours that you could use to work, then it's probably ok.  If you think working would interfere with your ability to perform well in your classes, then I suggest you not get a job, or if you have to have a job that you work as little as you can get away with.  One final thing to keep in mind is that it will be your responsibility to manage both your work and your academic responsibilities.  Being at work doesn't mean you get to ignore the homework deadline, and having a big test this week doesn't necessarily mean that you can skip your work shift.  Stuff like that.\n\nSo just take a hard and honest look at your personal situation and decide whether you think you can integrate work responsibilities into your life as it currently is.  If you think you can, then go for it.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1633406789,
      "upvotes": 1,
      "replies": {}
    }
  }
}