{
  "sid": "rdclqq",
  "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/",
  "title:": "I’m supposed to graduate next weekend but might have failed a class and won’t even know until after the graduation ceremony",
  "text": "I’ve struggled a lot in one of my classes and have a D in the course. I prepared so hard for this final because the professor said it would cumulative but it turns out it only covered the most recent 3/13 chapters covered in the class, which I didn’t prioritize since they were recent. \n\nI know I bombed the exam and now I’m worried it could drop me below a D. I’m supposed to walk at graduation next week and I have a job lined up with my dream company starting next month that’s contingent upon graduating. \n\nI don’t know what to do I’ve tried emailed my professor and he never responds to any of them. I’m panicking because I have family coming in from out of state too.",
  "author": "MagicalSwagbat",
  "created": 1639154253,
  "updated": 1639516607,
  "over_18": false,
  "upvotes": 152,
  "upvote_ratio": 0.99,
  "comments": {
    "ho065ht": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho065ht/",
      "text": "If you fail the class you could probably ask them to still let you walk but you’ll probably have to make it up in the winter session or spring semester. Hopefully you didn’t fail though",
      "author": "2lit_",
      "created": 1639154407,
      "upvotes": 123,
      "replies": {
        "ho06vaf": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho06vaf/",
          "text": "I wouldn’t even know if I failed before I walk. The graduation ceremony is Dec 18 and grades are posted Dec 20. This is also a course that is only offered in the fall because my major is not a very popular one.",
          "author": "MagicalSwagbat",
          "created": 1639154691,
          "upvotes": 56,
          "replies": {
            "ho070i3": {
              "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho070i3/",
              "text": "Oh damn that’s weird. Usually grades are posted before graduation I thought. Wtf\n\nMaybe try taking it at a diff school this winter or spring if you do fail",
              "author": "2lit_",
              "created": 1639154749,
              "upvotes": 51,
              "replies": {
                "ho0s86e": {
                  "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho0s86e/",
                  "text": "Most schools only post grades before the spring ceremonies, not winter ceremonies in my experience. My schools winter ceremony is the Saturday before finals even start!",
                  "author": "rebluorange12",
                  "created": 1639163117,
                  "upvotes": 14,
                  "replies": {}
                }
              }
            },
            "ho0szbi": {
              "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho0szbi/",
              "text": "What class?",
              "author": "GenXtreme1976",
              "created": 1639163422,
              "upvotes": 1,
              "replies": {}
            },
            "ho0ym5x": {
              "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho0ym5x/",
              "text": "Why don’t you ask the professor… you know… the one grading the exam?",
              "author": "SubparMeteorologist",
              "created": 1639165692,
              "upvotes": -12,
              "replies": {
                "ho12e1j": {
                  "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho12e1j/",
                  "text": "I’ve tried. He doesn’t respond to emails",
                  "author": "MagicalSwagbat",
                  "created": 1639167191,
                  "upvotes": 9,
                  "replies": {
                    "ho12u9a": {
                      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho12u9a/",
                      "text": "Office hours? His actual office, knock on the door? Did you talk with him throughout the semester, ask for ways to improve or feedback, or attend office hours prior? I see the same stuff year after year. If you build no relationship with a professor, or don’t at least talk with them enough for them to know you and know what class you’re in - then yeah, emailing them the last 1-2 weeks is probably not gonna work well..\n\nIf grades aren’t posted till after then you’ll be able to walk fine but you’ll have your degree held until you pass the class.",
                      "author": "SubparMeteorologist",
                      "created": 1639167371,
                      "upvotes": -15,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ho1jvmw": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1jvmw/",
          "text": "I'm gonna second this because I know someone that this happened to and this is what they allowed him to do, when he was about to graduate the school noticed he was going to fail the one class and told him he could still walk and just take the class over the summer.  Obviously YMMV but I feel like this happens relatively often to students about to graduate and they don't want to make you stay an entire extra half a year for one class",
          "author": "SynthExe",
          "created": 1639174132,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "ho1cg7x": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1cg7x/",
      "text": "I would schedule a meeting with your academic  advisor. They should be able to point you in the right direction or at least lay out all of your option, and I’m sure they’ve dealt with this before.",
      "author": "georgeoscarbluth99",
      "created": 1639171141,
      "upvotes": 20,
      "replies": {}
    },
    "ho0ygkz": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho0ygkz/",
      "text": "Is it a thing to confirm graduation while still having marks for courses outstanding.\n\nIf so that seems hopelessly cruel. If you didn't pass you should not have been offered the opportunity to graduate.",
      "author": "Impressive-Name5129",
      "created": 1639165630,
      "upvotes": 19,
      "replies": {
        "ho131m0": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho131m0/",
          "text": "It’s a thing at my school at least. I agree it’s cruel",
          "author": "MagicalSwagbat",
          "created": 1639167452,
          "upvotes": 9,
          "replies": {}
        },
        "hojz4ci": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/hojz4ci/",
          "text": "i agree, i just took my finals and the graduation ceremony is about a few days away. Im not sure i passed on class tho but it doesnt matter to me since im skipping it",
          "author": "busy_moderator",
          "created": 1639513162,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho1e3pc": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1e3pc/",
      "text": "That’s seriously rough 😔 Idk what to do exactly but at the very least I would let your job connection know about it so they can at least be aware and you can assure that that if you didn’t pass you’ll just retake and pass next semester.\n\nOfc this is just sssuming it’s a major course you need to graduate, if it’s not it shouldn’t really mess anything up for you.",
      "author": "airbear13",
      "created": 1639171798,
      "upvotes": 6,
      "replies": {}
    },
    "ho2sei5": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho2sei5/",
      "text": "my university is like yours, i graduate tomorrow but my grades won’t be posted till after. speak to your advisor about your concerns, they might be able to help you. for example, my advisor manually made some of my classes count for other requirements that the system does not automatically count them for. so i didn’t need to take that extra class. maybe the same could happen here? it will come down to how many credits you have. \n\nif you don’t want to go that route, reach out to your professor in literally every way possible. one of my classes this semester allows you to sub a failed exam for a 15 page research paper. maybe this professor would make an exception if you provided additional exceptional work. \n\nwishing you luck! this happens, don’t be too hard on yourself.",
      "author": "amandaisprettygreat",
      "created": 1639193892,
      "upvotes": 3,
      "replies": {}
    },
    "ho2tuhc": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho2tuhc/",
      "text": "I hope everything works out for you",
      "author": "fhuff556",
      "created": 1639194587,
      "upvotes": 2,
      "replies": {}
    },
    "ho3nex8": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho3nex8/",
      "text": "As always, taking part in commencements does not mean you graduated. Many schools don’t have enough time between finals and the ceremony to certify graduates. Go to the ceremony as planned but talk to your advisor about what you need to do if you don’t pass the class. This scenario happens every semester to many students. \n\nDon’t expect a miracle, if you failed, you failed, be honest with your pending job and accept the consequences.",
      "author": "drock13",
      "created": 1639213261,
      "upvotes": 2,
      "replies": {}
    },
    "ho3phye": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho3phye/",
      "text": "Most likely the same here....sigh",
      "author": "MrMeatyOgre",
      "created": 1639214954,
      "upvotes": 2,
      "replies": {}
    },
    "ho0ji0f": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho0ji0f/",
      "text": "u/PersephoneIsNotHere may have a better perspective on this as a professor, but I suspect the fact that the professor told you the exam was cumulative means you have a strong case for some sort of appeal. Therefore, I advise the following:\n\nIf you can, maybe go to the professor's office hours. Tell them that you thought the exam would cover all 13 chapters and you studied under that assumption, and you are worried that your final grade will suffer as a result. If you have any evidence of what he said, present it. Ask them if there is anything you can do to boost your grade (for example, take a TRULY cumulative exam). If you can't do anything, maybe ask them if THEY can do something.\n\nIf the professor won't help, go to the department chair. As with the professor, tell the chair that the professor told you the exam was cumulative and you studied under that assumption. \n\nSometimes, part of being an adult is advocating for yourself. It's recognizing when someone gives you bad information that is harmful to you, and taking action where legal & possible to mitigate the harm.",
      "author": "Comprehensive-Ad3963",
      "created": 1639159653,
      "upvotes": 7,
      "replies": {
        "ho1eldq": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1eldq/",
          "text": "There’s no way they’re gonna let you appeal that lol it’s well within what a prof is allowed to do",
          "author": "airbear13",
          "created": 1639171992,
          "upvotes": 13,
          "replies": {
            "ho1hqt1": {
              "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1hqt1/",
              "text": "The professor said the exam would be \"cumulative.\" Generally, a cumulative exam would cover all units/chapters. Therefore, unless the professor clarified, prior to the exam date, that the exam would only cover 3 chapters, the professor kind of lied.",
              "author": "Comprehensive-Ad3963",
              "created": 1639173266,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ho0m981": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho0m981/",
          "text": "I appreciate your response. This professor is honestly one of the most difficult people I’ve ever dealt with. His syllabus states he’ll only meet with students in his office if they go in pairs, he won’t meet 1:1.\n\nOn top of that he doesn’t respond to emails. I’ve sent him multiple emails and the only times I’ve gotten a response was when it was concerning a death in my family, and when I followed up multiple times. \n\nHe’s also cancelled multiple classes last minute this semester, has assigned additional research papers not covered in the syllabus, and has not uploaded a single grade the whole semester. The only indicators he’s given us of our standing in the class is verbally telling us 2 of our exam grades. \n\nTo top it all off this professor is also the head of the department and would be handing me my diploma at graduation so he could know I won’t pass his class and then still act like I’m graduating. \n\nSorry for the wall of text I’m just ranting it’s been a long 4 years and it seems like it’s ending in the worst way imaginable.",
          "author": "MagicalSwagbat",
          "created": 1639160743,
          "upvotes": 11,
          "replies": {
            "ho0pyeu": {
              "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho0pyeu/",
              "text": ">His syllabus states he’ll only meet with students in his office if they go in pairs, he won’t meet 1:1.\n\nThat's....odd. Is he a sex offender? Is he afraid of being *accused* of something sexual?",
              "author": "Comprehensive-Ad3963",
              "created": 1639162220,
              "upvotes": 17,
              "replies": {
                "ho0snme": {
                  "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho0snme/",
                  "text": "I would assume just cautious if at a school that has had waves of accusations or  a particularly stringent definition of inappropriate behavior. Or,  he's a turd and chose this avenue as a way of holding himself accountable and ensuring students are comfortable that they have a witness. IMO That's really the least problematic of his behaviors. Not grading assignments or responding to emails is sketchy af for a department head.",
                  "author": "SemanticBattle",
                  "created": 1639163289,
                  "upvotes": 12,
                  "replies": {
                    "ho17dik": {
                      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho17dik/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1639169144,
                      "upvotes": 1,
                      "replies": {
                        "ho1bthg": {
                          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1bthg/",
                          "text": "If it's regarding section 444, then the student would benefit from including the Office of Educational Accessibility (or their school's equivalent) to arrange appropriate meetings. If you're just referencing the ability to discuss grades or reviewing assignments, then it's still the professor's prerogative. It's crappy, but technically, professors are not obligated to entertain our existential crises over grades or even to re-teach in private. I have no idea why this professor has the rule, I'm just offering explanations that I can think of for setting this boundary.",
                          "author": "SemanticBattle",
                          "created": 1639170888,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ho1etu0": {
                  "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1etu0/",
                  "text": "Bro what he’s probably just using this as a way to screen out students unless a lot of them have the same issue",
                  "author": "airbear13",
                  "created": 1639172086,
                  "upvotes": 4,
                  "replies": {}
                },
                "ho2yfxn": {
                  "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho2yfxn/",
                  "text": "It really doesn't seem so odd in today's socio-political climate. I don't blame him being afraid of being accused at all. I'm a professor myself, and I  recently spoke to all my A students from each of my class, asking them what I could do better to streamline the class, and for one class, I realized that all my A students were woman, and when I realized it, I did stiffen at first, but then the anxiety went away, as I knew I wasn't doing anything malicious, but the fear was there for a second.",
                  "author": "GhostlyMuse23",
                  "created": 1639196909,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ho1gmuq": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1gmuq/",
          "text": ">professor told you the exam was cumulative means you have a strong case for some sort of appeal\n\nyou are going to get laughed at once you leave the room. this is not a basis of appeal. what you learn later in the semester is dependent on what you've learned previously.",
          "author": "wobbletelescope",
          "created": 1639172821,
          "upvotes": 7,
          "replies": {
            "ho26azw": {
              "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho26azw/",
              "text": "\"what you learn later in the semester is dependent on what you've learned previously\"\n\nThis statement is not always true. It really depends on the course. In fact this wasn't true in half of my own courses this semester. \n\nI do agree that this is not basis for an appeal though.",
              "author": "gpgc_kitkat",
              "created": 1639183776,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ho2xuld": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho2xuld/",
          "text": "It's interesting how people mock Karens but college is filled with Karen's willing to go to the department and dean when things don't go their way; why does Karen-ing in college seem so supported?",
          "author": "GhostlyMuse23",
          "created": 1639196606,
          "upvotes": -1,
          "replies": {
            "ho3ayls": {
              "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho3ayls/",
              "text": "I think because if you're in the US, you're paying thousands upon thousands of dollars and getting into debt for your degree. I think students have the right to be Karens once in a while if they're paying that much.",
              "author": "szatanna",
              "created": 1639204059,
              "upvotes": 1,
              "replies": {}
            },
            "ho3e1rt": {
              "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho3e1rt/",
              "text": "Except that this is no more Karening than complaining when you pay for extra sauce at a restaurant and don’t get the extra sauce.",
              "author": "Comprehensive-Ad3963",
              "created": 1639206123,
              "upvotes": 1,
              "replies": {
                "ho3v0ri": {
                  "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho3v0ri/",
                  "text": "What's the\"extra\" that's being paid for in this scenario?",
                  "author": "GhostlyMuse23",
                  "created": 1639219265,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho2a8qh": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho2a8qh/",
      "text": "+1 for talking to an academic advisor ASAP they might be able to pull some strings for you !",
      "author": "Buzzindown",
      "created": 1639185544,
      "upvotes": 3,
      "replies": {}
    },
    "ho3q9l9": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho3q9l9/",
      "text": "THIS IS WHAT YOU DO.\n\nGO TO THE PROFESSOR AND SAY YOU NEED EXTRA CREDIT AND WILL DO ANYTHING TO GET A C IN THE CLASS.\n\nI WOULD EVEN CRY IN FRONT OF HIM JUST TO MAKE THE PROFESSOR FEEL LIKE YOU NEED HIM.\n\nEMAIL HIM NOW AND GO TO THE OFFICE HOURS",
      "author": "andwhosaysicant",
      "created": 1639215565,
      "upvotes": 0,
      "replies": {
        "ho3qcir": {
          "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho3qcir/",
          "text": "This is your grade. Your life. Take control or no one else will..",
          "author": "andwhosaysicant",
          "created": 1639215632,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ho1iu6t": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1iu6t/",
      "text": "[removed]",
      "author": null,
      "created": 1639173707,
      "upvotes": 1,
      "replies": {}
    },
    "ho1wi2x": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho1wi2x/",
      "text": "I don’t know how things work at your university, but you may be able to get a satisfactory or unsatisfactory instead of an actual grade. I know for some places a D is considered satisfactory.  I had several friends at my university get a satisfactory instead of a D and they counted the credit. Another option might be walked at graduation and retaking the class in the summer. Some colleges will let you walk and participate in graduation as long as you complete the required class or classes in the summer. I would check with an advisor",
      "author": "Kohldsmoke",
      "created": 1639179476,
      "upvotes": 1,
      "replies": {}
    },
    "ho3bqgj": {
      "link": "/r/college/comments/rdclqq/im_supposed_to_graduate_next_weekend_but_might/ho3bqgj/",
      "text": "I don't have any good advice but I sincerely hope you can find some answers. This must be fucking awful for you. I'm in a somewhat similar boat because I'm supposed to graduate my CC in two days and I've been accepted as a transfer ready to start with my new school next spring, and my CC just informed me I need to register for another semester. I don't know if this is a fuck up by my advisor or what it is, but I'm freaking out too. I guess you should contact your professor and see if you can get a pass/no pass mark instead of a grade. I think your situation is extreme enough that maybe they'll take mercy and allow you to graduate, especially because it happened over misinformation. Good luck, man.",
      "author": "szatanna",
      "created": 1639204558,
      "upvotes": 1,
      "replies": {}
    }
  }
}