{
  "sid": "e3x7lt",
  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/",
  "title:": "A Small adivce I thought I'd share, helped me a lot",
  "text": "if you have to write an essay, whatever is the required font size, start writing it on a smaller one. For me, the required right now is 12, and i'm writing at 9. The stress and the focus of writing will easily make you forget you made this change, and when you are absolutely desperate, on the cusp of the panic attacks that are a basic component of writing essays:  Select your whole text, and adjust the font size up. \n\nI just checked where my progress is actually at, and I'm legit almost crying from happiness. It's a great source of catharsis. Helped me finish a lot of essays without nervous breakdowns.",
  "author": "Doveen",
  "created": 1575124479,
  "over_18": false,
  "upvotes": 1469,
  "upvote_ratio": 0.99,
  "comments": {
    "f9ccfzt": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9ccfzt/",
      "text": "I wish I could do this... My university goes by word count instead of page count. So the two I'm working on: \"Between 3500-4000 words\" and \"no more than 2000 words.\"\n\nI might try the smaller font for the psychological effect but I doubt it'll work :(",
      "author": "HPxGunshot",
      "created": 1575221903,
      "upvotes": 1,
      "replies": {}
    },
    "f99h2t6": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f99h2t6/",
      "text": "Huh. Thanks for the tip lmao. I'll try this on my upcoming paper",
      "author": "ayarlagadda",
      "created": 1575191129,
      "upvotes": 1,
      "replies": {}
    },
    "f98h7vg": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f98h7vg/",
      "text": "If it's double spaced, I always type single space and then change it when I'm a little over halfway to the page limit. Say it's 12 pages long, I stop at 8 and make it all double, and it looks perfect.",
      "author": "AntiqueMemeDreams",
      "created": 1575178269,
      "upvotes": 1,
      "replies": {}
    },
    "f98186a": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f98186a/",
      "text": "Yes i do this all the time!! Makes me feel so good at the end. Or another tip is if it’s double spaced, write the whole thing single spaced and watch your paper magically double in size!",
      "author": "kmn19999",
      "created": 1575172729,
      "upvotes": 1,
      "replies": {}
    },
    "f97y6mr": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f97y6mr/",
      "text": "I do this sometimes. Usually after 3 hours of writing and revising, I bump up my text to 12pt and I only got a paragraph written. I usually just call it a night at that point and restart.",
      "author": "ayojamface",
      "created": 1575171720,
      "upvotes": 1,
      "replies": {}
    },
    "f97vem8": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f97vem8/",
      "text": "[deleted]",
      "author": null,
      "created": 1575170750,
      "upvotes": 1,
      "replies": {
        "f99mlno": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f99mlno/",
          "text": "What?",
          "author": "Doveen",
          "created": 1575192838,
          "upvotes": 1,
          "replies": {
            "f9cwzul": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9cwzul/",
              "text": "[deleted]",
              "author": null,
              "created": 1575228097,
              "upvotes": 1,
              "replies": {
                "f9cxozz": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9cxozz/",
                  "text": "I wish english had at least a semblance of logic to its countable/uncountable nonsense...\n\nAnyhow, the more I know, i guess.",
                  "author": "Doveen",
                  "created": 1575228261,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f97ief0": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f97ief0/",
      "text": "I used to make my font size 12 or whatever the professor wanted. Then I would replace all the periods with one font size higher. It would look exactly the same but it’d expand the lines more without having to use double spacing that they would notice.\n\nJust a ULPT for you all.",
      "author": "BrolyDisturbed",
      "created": 1575166006,
      "upvotes": 1,
      "replies": {}
    },
    "f97g001": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f97g001/",
      "text": "Any tips on how to write faster? It takes me a day to write one paragraph.",
      "author": "cold-smilehoodie",
      "created": 1575165092,
      "upvotes": 1,
      "replies": {}
    },
    "f97d6w8": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f97d6w8/",
      "text": "I do mine in Onenote because it has no word count and just transfer it to word. Most of the time I go over the page req. and can cut stuff out!",
      "author": "jink144",
      "created": 1575163908,
      "upvotes": 1,
      "replies": {}
    },
    "f9790ax": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9790ax/",
      "text": "If you know how to plan out a proper outline, any essay writes itself.",
      "author": "CasinoCoinRich",
      "created": 1575162092,
      "upvotes": 1,
      "replies": {}
    },
    "f977p1r": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f977p1r/",
      "text": "I do something almost opposite that. I zoom in to 150% so it looks like I'm writing a lot more than I really am. The effect is that I feel like I'm getting into a good flow quicker, and that keeps me motivated and I continue writing.",
      "author": "bl1y",
      "created": 1575161302,
      "upvotes": 1,
      "replies": {}
    },
    "f96z6bn": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96z6bn/",
      "text": "I've tried this, and I know I am in the minority but I've written so much that if it isn't 12pt TNR then I can't type it. I just have to change it so it looks proper to me. I set Word so it automatically starts on 12pt TNR 2x spaced so I don't have to since I type in it all the time.\n\nI guess this helps with some people but for me it just causes another small thing of stress that I need to change rather than ignore it.",
      "author": "brotallyswagical_",
      "created": 1575155496,
      "upvotes": 2,
      "replies": {}
    },
    "f96rs9d": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96rs9d/",
      "text": "And pick a font that YOU like to write in.. then when you’re done convert it to the required font (if any)",
      "author": null,
      "created": 1575150791,
      "upvotes": 2,
      "replies": {
        "f96vj5k": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96vj5k/",
          "text": "\\^\\^ YES. THIS. I can't tell you how much writing in your college's prescribed style guide SUCKS. Write in whatever color, font, spacing works best for you, then format it all back to your college's style guide at the end. This way you'll feel happier about your end product and your brain will be more engaged as a project about YOU and not your professor. :)",
          "author": "CatheterZetaJones",
          "created": 1575153043,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f96rdfu": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96rdfu/",
      "text": "I start with the default (11pt font, single spaced) for pages and then at the very end change it to MLA (12pt, double spaced). So satisfying to watch a 3 page paper become 6 or 7 pages.",
      "author": "ep1c-d0g-m0n3y",
      "created": 1575150544,
      "upvotes": 2,
      "replies": {}
    },
    "f96mdi4": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96mdi4/",
      "text": "Google docs default 11pt and non double spacing has almost the same effect after resizing at the very end",
      "author": "JasorYeh",
      "created": 1575147601,
      "upvotes": 1,
      "replies": {}
    },
    "f96lo2n": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96lo2n/",
      "text": "What do I do for word count?",
      "author": "Lloydster",
      "created": 1575147102,
      "upvotes": 1,
      "replies": {
        "f96lw4u": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96lw4u/",
          "text": "My usual response is gettng a panic attack, taking maximum recommended daily amount +1 of my herbal sedatives, then wondering where the 6 pm to next day 11 am time period went. \n\nLuckily, word count based minimums are exceedingly rare in my uni.",
          "author": "Doveen",
          "created": 1575147260,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f96k1v3": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96k1v3/",
      "text": "This is dumb, but I used to just open a word document and start typing like it was a text to my friend. I'd be vulgar and cuss but also use the context and facts I wanted to. Then I'd find references and elaborate.\n\nBut that first step was pivotal in getting the idea/structure of the essay out for me.",
      "author": "Caribbean_engineer",
      "created": 1575146402,
      "upvotes": 3,
      "replies": {}
    },
    "f96jzpw": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96jzpw/",
      "text": "For a bit more grimy tip, I'd recommend also paraphrasing citations instead of directly quoting them. First, it's typically preferred by professors to do this since putting things in your own words gives more originality to your paper, but it also means you can drag out your paper by being a bit wordy with citations \n\nMade a 15 page paper a bit easier to go through",
      "author": "Chawinyaw",
      "created": 1575146376,
      "upvotes": 2,
      "replies": {}
    },
    "f96if6b": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96if6b/",
      "text": "most essays i've been given thusfar hav been given as a word limit instead of a page limit. it's helpful hut means that this tip won't work for me. i hope i don't need it",
      "author": "Greenoob",
      "created": 1575145541,
      "upvotes": 4,
      "replies": {}
    },
    "f96furm": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96furm/",
      "text": "What I do is keep the 12 pt font but use single space instead of double space",
      "author": "nhaire123",
      "created": 1575144469,
      "upvotes": 2,
      "replies": {}
    },
    "f96cnam": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96cnam/",
      "text": "This won’t work for me since my essay that’s due on Monday is limited to four pages and high school drilled me into writing 12 page essays all the time so I’m used to rambling and can’t keep things concise.",
      "author": "microfsxpilot",
      "created": 1575143078,
      "upvotes": 1,
      "replies": {}
    },
    "f96cc52": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96cc52/",
      "text": "So, after a couple years of suffering from long stretches of procrastination (like right now) and subsequent essay panic, I've figured out a decent system for getting a 3000-4000 word research essay in roughly 6 hours from scratch. This means I wake up at 9am with no progress at all, and finish by 3pm with a completed paper. In the process, I build an outline by stringing 3 quotes in 400-500 word chunks, and use that to rapidly finish a paper.\n\nFirst, you want to come up with a good number of sources. Note when an essay required peer reviewed, scholarly sources. For that, a lot of people go to the pain of looking at physical books, and I say fuck that. Instead, open up your university's library webpage and see if they have a search engine for that library. If so, you might be lucky and have access to a database of scholarly peer reviewed sources, usually in research articles posted to research journals. Do a bit of skimming and collect ones that work with your argument and have quotable material.\n\n\nSecondly, read your sources, obviously, and remember to grab quotes that support that thesis and put those into a word document. This will come in handy later. If you don't have a thesis, just grab interesting quotes that you could build into a thesis. For my Saudi Arabia history class, I had to come up with a way of critiquing King Faisal's attempts at reforming the state government, and noticed that they poured millions of dollars in supporting an agriculture industry while I was doing research. Stuff like that.\n\nFinally, the research usually takes me 2-3 hours, and this includes building what I like to call an essay skeleton. As you collect quotes, start organizing them by common argument. Multiple quotes about agriculture sucking might be sorted into a \"agriculture sucked, therefore [Argument]\" kind of deal. That's the good shit that forms the bulk of what your thesis is arguing towards. For a 4k paper, I ended up with 1 main argument, and 4 sub arguments at 1k words each, usually well quoted.\n\nFinally, the dastardly writing phase has begun. I find a good 3 quotes is sufficient for a decent 400-500 word chunk. My formula is always; [Present Argument] \n\n[Either use a quoted paraphrase or a blended direct quote to further an argument] \n\n[Explain why the quote furthers your argument] \n\n[Set up sentence for next argument]\n\nThis setup allows you to blitz an essay in 500 word chunks and provides for richly detailed word chunks with research supporting a majority of your essay. If they're sourced from peer reviewed databanks, even better. I always have quotes left over as I finish and that's a good sign.",
      "author": "Dathlos",
      "created": 1575142871,
      "upvotes": 21,
      "replies": {
        "f99jp37": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f99jp37/",
          "text": "This is how I A+ my way through my MBA.  \n\nEventually I realised that I only had to write enough myself to join the quotes together\ncoherently. \n\nI wouldn’t even have an argument at the beginning... I’d pull loads of related articles just like you said, then as I read them I’d dump any quote I found relevant into a Word doc.  When I got sick of reading I’d group the quotes based on what they had in common. \n\nBy this stage the arguments started to make themselves, and I’d order them into something that made sense from the perspective of a whole essay, then I’d finish by sticking the quotes together to form coherent sentences.  Intro and conclusion last and all done.",
          "author": "pennells",
          "created": 1575191912,
          "upvotes": 3,
          "replies": {}
        },
        "f9ezmiq": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9ezmiq/",
          "text": "You and OP might have straight up helped me with my essay thats due tomorrow tysmmm",
          "author": "w4h4b",
          "created": 1575255699,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f968wq8": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f968wq8/",
      "text": "Change punctuation size to a higher font. Near unnoticeable and spaces out words more",
      "author": "Krock01",
      "created": 1575141517,
      "upvotes": -9,
      "replies": {}
    },
    "f968mn3": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f968mn3/",
      "text": "Also find and replace all your periods with periods that are one or two font sizes larger. This will add a good half a page or more on your longer papers.",
      "author": "GoneZombie",
      "created": 1575141356,
      "upvotes": -7,
      "replies": {
        "f976gpp": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f976gpp/",
          "text": "And it's really obvious when you've read 40 papers in a row. Same goes for fucking with margins.",
          "author": "plumcots",
          "created": 1575160458,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f968hs7": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f968hs7/",
      "text": "I also only write it single spaced until the end! Single spacing + tiny font = happy me when I finally see how much progress I've really made!",
      "author": "Calligraphee",
      "created": 1575141265,
      "upvotes": 5,
      "replies": {}
    },
    "f968anm": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f968anm/",
      "text": "I do this, but only because I feel I have better control of what I'm writing if I can look the whole thing with a single glance. Nothing to do with the fact that it looks more when you size up.",
      "author": "idyllif",
      "created": 1575141227,
      "upvotes": 3,
      "replies": {
        "f96ffhb": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96ffhb/",
          "text": "That's a huge thing. I'm actually considering getting a second monitor so I can read the sources and write without incessant alt tabbing.",
          "author": "Doveen",
          "created": 1575144282,
          "upvotes": 3,
          "replies": {
            "f96nsr3": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96nsr3/",
              "text": "Good thinking. Maybe one that can be used in portrait mode?",
              "author": "idyllif",
              "created": 1575148574,
              "upvotes": 1,
              "replies": {}
            },
            "f9ozdwx": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9ozdwx/",
              "text": "I do this and it’s such a huge help!",
              "author": "cfayeshu",
              "created": 1575517435,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f9672q9": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9672q9/",
      "text": "Fr i so this but write my essay in single space so it feels like less then double space it every so often/ when im done to keep me motivated.",
      "author": "AH_Matthew",
      "created": 1575140736,
      "upvotes": 4,
      "replies": {}
    },
    "f962rta": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f962rta/",
      "text": "A different font size also helps you catch mistakes easier.",
      "author": "arlomilano",
      "created": 1575138907,
      "upvotes": 2,
      "replies": {}
    },
    "f961lf9": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f961lf9/",
      "text": "My problem is always writing too much and having to spend hours figuring what I need to cut.",
      "author": "peregrin5",
      "created": 1575138462,
      "upvotes": 19,
      "replies": {
        "f96csye": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96csye/",
          "text": "Exactly. I had to do a 4000 word essay back in high school. Accidentally went up to 5000 and spent five hours trying to cut out what I didn’t need.",
          "author": "microfsxpilot",
          "created": 1575143188,
          "upvotes": 7,
          "replies": {
            "f970ea6": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f970ea6/",
              "text": "4000 words huh, you wouldn’t happen to have been in the IB program would you?",
              "author": "linlinnay",
              "created": 1575156323,
              "upvotes": 3,
              "replies": {
                "f972ke8": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f972ke8/",
                  "text": "Unfortunately yes haha. Nice to see another IBer. We’re a rare bunch.",
                  "author": "microfsxpilot",
                  "created": 1575157796,
                  "upvotes": 2,
                  "replies": {
                    "f974t3h": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f974t3h/",
                      "text": "also IB, but not in high school :/",
                      "author": "lildukeofwellington",
                      "created": 1575159348,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f96fgzy": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96fgzy/",
          "text": "I wish I could have that problem",
          "author": "Doveen",
          "created": 1575144310,
          "upvotes": 11,
          "replies": {
            "f97b6ty": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f97b6ty/",
              "text": "No. You don’t.",
              "author": "IthacanPenny",
              "created": 1575163056,
              "upvotes": 2,
              "replies": {
                "f99n4vq": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f99n4vq/",
                  "text": "\"Oh no, i am so smart i can actually write stuff, what a curse!\" You could slap a 2000 page encyclopedia in front of me, amd at best  i could crounge up one or two sentences on a better day. It's incomparably easier to cut down from what you have.",
                  "author": "Doveen",
                  "created": 1575193045,
                  "upvotes": 0,
                  "replies": {
                    "f9bikf7": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9bikf7/",
                      "text": "The encyclopedia is so condensed that it’s actually really hard to source information from it, so that’s a terrible example. Yes, you’re right, in order to write too much you do have to have an original thought. I’ve had a few assignments where I’m like “I legitimately have nothing to say”, but they were like inane discussion posts. So I do kind of get it. For longer assignments, honestly you have to come up with an idea. Once you have an idea, it’s so easy to fill pages.",
                      "author": "IthacanPenny",
                      "created": 1575213046,
                      "upvotes": 1,
                      "replies": {
                        "f9bn7tz": {
                          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9bn7tz/",
                          "text": "Having an idea is not the problem, focusing it down is. One professor will nag me for not including stuff that I thought would be meaningless tangent, the other would scold me for not focusing the topic down enough, because I wrote about *all* the hairs on Charlemagne's left knees lower quarter, and he wanted a mor concise analysis about the curvature of only one specific follicle.\n\nI'm really close to *Not* joking with the above example, btw",
                          "author": "Doveen",
                          "created": 1575214315,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f96tm50": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96tm50/",
          "text": "Yep that’s my problem too.  Last essay my teacher took 10 points off for “too many details.”",
          "author": "simplysydney22",
          "created": 1575151752,
          "upvotes": 5,
          "replies": {
            "f96uyqq": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96uyqq/",
              "text": "Believe it or not, there's a pedagogical reason for that. It builds the habit of succinctness, both because people don't like someone who goes on and on (in a conversation, in a presentation...), and because it shows you know your subject.",
              "author": "CatheterZetaJones",
              "created": 1575152663,
              "upvotes": 6,
              "replies": {
                "f96va5o": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96va5o/",
                  "text": "I think I’m mostly annoyed because she took points off my first essay for “not enough details” and points off the second for having to many.  I definitely know that my essay was longer than expected, but I did not think it was too detailed, nor did my proofreader.  Hopefully third time’s the charm as I have another essay due for her this week.",
                  "author": "simplysydney22",
                  "created": 1575152877,
                  "upvotes": 5,
                  "replies": {
                    "f96wujj": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96wujj/",
                      "text": "Ok, that's actually just rude. You followed directions and then were punished for it. :( Sorry to hear that.",
                      "author": "CatheterZetaJones",
                      "created": 1575153923,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f95y3ey": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95y3ey/",
      "text": "I always double space it after I'm done writing.",
      "author": "BlitzkriegBomber",
      "created": 1575137042,
      "upvotes": 1,
      "replies": {}
    },
    "f95sgvc": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95sgvc/",
      "text": "Huh most of my essays are by word count not pages but I will check it out",
      "author": null,
      "created": 1575134480,
      "upvotes": 23,
      "replies": {
        "f96utag": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96utag/",
          "text": "Yes, but, trust me, when they're paper essays, us professors aren't literally counting the words. Hell, we're barely reading them. We just know it's \\~250 words per page. Why do you think almost every essay is a multiple of 250?",
          "author": "CatheterZetaJones",
          "created": 1575152561,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "f95r2ct": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95r2ct/",
      "text": "I love doing this! I'm doing this for my current paper and I only enlarge when I'm getting anxious. The wash of relief that sprays over me when I see that I'm nearly at my goal or past it is *amazing*.\nIt almost feels like a reward lol. \n\nFor me I keep the paper at Arial, single spaced, and at 11. When I'm stressed, I put it to the required, then I change it back and keep on writing. Idk why it happens, but it's great and I'm not trynna question it to ruin it.",
      "author": "NoodleEmpress",
      "created": 1575133657,
      "upvotes": 25,
      "replies": {}
    },
    "f95qo0t": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95qo0t/",
      "text": "Wait, I submitted an essay on font 11 last week, now I just remembered the required font was 12...\n\nWhy...",
      "author": "rich-fertilizer",
      "created": 1575133423,
      "upvotes": 111,
      "replies": {}
    },
    "f95q4cg": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95q4cg/",
      "text": "I’ve always done this, made it seem like I was writing more than I had to, then changed the font and double spaced it. Kabaam. 7 page essay done in 2-3 hours.",
      "author": "fatherkade",
      "created": 1575133099,
      "upvotes": 44,
      "replies": {}
    },
    "f95nhiz": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95nhiz/",
      "text": "Omg thank you! Such a great tip",
      "author": "lunalolita18",
      "created": 1575131624,
      "upvotes": 6,
      "replies": {}
    },
    "f95n00x": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95n00x/",
      "text": "I do this with spacing. When it needs to be double spaced, I keep it at 1.25 until the end. Same with 10 font.",
      "author": "Midnite024",
      "created": 1575131341,
      "upvotes": 179,
      "replies": {
        "f96a5so": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96a5so/",
          "text": "[deleted]",
          "author": null,
          "created": 1575142052,
          "upvotes": 70,
          "replies": {}
        }
      }
    },
    "f95h93z": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95h93z/",
      "text": "Well, it's a way to hide the pain haha.\n\nMy advice is: if you find something on Google that you want to use on your essay, and especially, if it's something that you can copy to save effort and time: copy the paragraphs you want to use, paste it on your document, read a sentence, write the sentence's idea using your own words and ideas, delete the sentence, repeat previous steps until you've copied the whole text. Don't forget to add everything to your sources and keep things in order, just in case :p",
      "author": null,
      "created": 1575127692,
      "upvotes": -4,
      "replies": {
        "f95t1v4": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95t1v4/",
          "text": "This is bad advice don’t ever, ever copy a paragraph into your essay. This is just asking for trouble.",
          "author": "VROF",
          "created": 1575134865,
          "upvotes": 19,
          "replies": {
            "f95vcb0": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95vcb0/",
              "text": "I always copied practically everything and reworded and cited it. There's really no other way for me. I'm not making anything up myself, I'm a student. All I can do is write about what other people have said. If I ever wrote something original, the professors would always ask for a source.",
              "author": "purplelovely",
              "created": 1575135914,
              "upvotes": -2,
              "replies": {
                "f965xeh": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f965xeh/",
                  "text": "No offence, but your profs sound like d*cks.  IMHO the best source of original thought are my students, so why should you be denied the opportunity to show that?  Such a shame that you feel you can’t write something original. \n\nHow about this? Next time a prof calls you out for not citing an original thought (and please keep having them!) dig out one of their papers, find an idea which isn’t cited and demand to know what their source was. When they say it was their own, ask why they are training you differently to how they behave...",
                  "author": "purplechemist",
                  "created": 1575140191,
                  "upvotes": 6,
                  "replies": {
                    "f96hqgr": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96hqgr/",
                      "text": "Some essays might allow for just a persons reflections or thoughts, but if it's supposed to be a research paper, there should be research. Even when you have original thoughts, you need to support claims you are making along the way (the way you are interpreting the data can be original, but you can't just make stuff up). Otherwise, this is how we get to people just saying they've decided climate change isn't real because they decided that was the case and they are entitled to their own opinion.",
                      "author": null,
                      "created": 1575145305,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f95taoa": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95taoa/",
              "text": "Mmmm, but, for example, if you need to talk about a theory, or a research made by X, what would you do to present that information in your essay/report? That's why citation was created, we can't do all ourselves. \n\nYes, I agree, don't copy paragraphs, paraphrase the information you find and complement it with other info you have, that's what I said on my original message.",
              "author": null,
              "created": 1575135027,
              "upvotes": 0,
              "replies": {
                "f95ytla": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95ytla/",
                  "text": "But doing it sentence by sentence is just a bit too close to what the original text says. You should try to paraphrase things by gathering big ideas from a text not just individual sentences.",
                  "author": "PonchoHung",
                  "created": 1575137303,
                  "upvotes": 9,
                  "replies": {
                    "f95zkfe": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95zkfe/",
                      "text": "Yes, I agree, also not every sentence is useful to create meaningful ideas. As I said, even to copy-paste things you have to work and make sure to do everything possible to make a good composition, one that makes sense and feels connected.",
                      "author": null,
                      "created": 1575137672,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f95qk5u": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95qk5u/",
          "text": "This is definitely plagiarism.",
          "author": "grahamalondis",
          "created": 1575133359,
          "upvotes": 18,
          "replies": {
            "f95r5ux": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95r5ux/",
              "text": ">It depends, of course if 50% of your report is made this way people will eventually find out, teachers aren't stupid. However if you do this to describe a concept, a theory or the pillars of your investigation, then I don't see why it should be a problem, we need to begin from somewhere, and knowledge is built on previous one, theoretical framework for example needs to come from somewhere else, not from you.",
              "author": null,
              "created": 1575133712,
              "upvotes": -1,
              "replies": {
                "f95s67y": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95s67y/",
                  "text": "Plagiarism isn't just when people find out. Yes, knowledge is built on previous knowledge, but that previous knowledge must be cited and only used as support for your own original ideas. There's no getting around the fact that this is plagiarism and grounds for expulsion. It also can be caught by plagiarism software, just so you know.\n\nNobody fucking do this ever.",
                  "author": "grahamalondis",
                  "created": 1575134300,
                  "upvotes": 15,
                  "replies": {
                    "f967q6w": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f967q6w/",
                      "text": "Paraphrasing/summarizing other work is standard practice in academia because believe it or not, inline citations exist and aren't mutually exclusive with paraphrasing. If you're citing things it's not a problem at all unless you're just throwing down sources without some kind of analysis to link them together into a coherent argument.",
                      "author": null,
                      "created": 1575140968,
                      "upvotes": -2,
                      "replies": {
                        "f967up2": {
                          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f967up2/",
                          "text": "What this guy said is not merely paraphrasing.",
                          "author": "grahamalondis",
                          "created": 1575141058,
                          "upvotes": 5,
                          "replies": {
                            "f9682ew": {
                              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9682ew/",
                              "text": "> write the sentence's idea using your own words and ideas\n\nbruh",
                              "author": null,
                              "created": 1575141178,
                              "upvotes": -5,
                              "replies": {
                                "f968l1y": {
                                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f968l1y/",
                                  "text": "\"repeat previous steps until you've copied the whole text\"\n\nBruh",
                                  "author": "grahamalondis",
                                  "created": 1575141326,
                                  "upvotes": 7,
                                  "replies": {
                                    "f96dh1d": {
                                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96dh1d/",
                                      "text": "Would you like to explain the difference between paraphrasing and copying and why this guy's idea is definitely copying to the class?",
                                      "author": null,
                                      "created": 1575143489,
                                      "upvotes": -4,
                                      "replies": {
                                        "f96q46s": {
                                          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96q46s/",
                                          "text": "Paraphrases are supposed to be used just like quotes. Each paraphrase gets cited properly to the page number. Each paraphrase needs an introducing sentence and a follow-up sentence to directly explain the citation's relevance, to clarify points, to agree/disagree. Paraphrases are just like quotes—they restate someone else's work in your own words; that you state it in your own words does not make it your work or unworthy of elaboration and citation.\n\nOne who writes an entire essay made of paraphrasing is copying the work of the original author and cheating the assignment. The point of essays is to make a contribution to the scholarly conversation, not to repeat someone else's contribution to the conversation. The student is to be a participant in the conversation, not a little bitch who hides behind his big friend and repeats everything he says.",
                                          "author": "grahamalondis",
                                          "created": 1575149739,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "f95suaa": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95suaa/",
                      "text": "Yeah, that's why I always have my sources in order, that's the most important part when using others ideas, I agree with you in that part. Moreover I never use others ideas to create my conclusions, or results for example, now that would be troublesome and would make the exercise meaningless, the main use of my technique is to help me write the introduction or the theoretic framework, which are usually the hardest part of a report. On essays I use this to help create the description of the situation.\n\nSoftware is way more sensitive, because it's basically a window to the programmers mind. Using code to do generic tasks is ok, but using others code to solve specific problems is definitively stupid and useless, if something goes wrong you'll not be able to even know where to start looking.",
                      "author": null,
                      "created": 1575134727,
                      "upvotes": -4,
                      "replies": {
                        "f96070s": {
                          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f96070s/",
                          "text": "I think it is totally fine to use other's words/ideas when explaining an abstract or theoretical concept because, oftentimes, you need an expert to accurately describe the concept and lend credibility to it--that is where citing sources comes in. But, at the same time, sources should be used to support *your* ideas, expound upon concepts you wish to discuss, or provide necessary context. \n\nThe OP in this comment thread is suggesting essentially plagiarizing other people's ideas and paragraph structures which is definitely plagiarism.",
                          "author": "Lady_Caticorn",
                          "created": 1575137887,
                          "upvotes": 8,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f95lxaa": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95lxaa/",
          "text": "that’s also very useful but make sure it’s a credible source",
          "author": "JesusRocksSocks",
          "created": 1575130659,
          "upvotes": 8,
          "replies": {
            "f95m39g": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95m39g/",
              "text": "Well, I mean, even to copy-paste things you need to do some research and work, if you don't even do that, then why are you're in school on the first place?",
              "author": null,
              "created": 1575130767,
              "upvotes": 7,
              "replies": {
                "f95mj5c": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95mj5c/",
                  "text": "you’ve got a point and it might seem obvious, but think about the people in some of your classes. there’s definitely a few folks who have for some reason or another, who have somehow skated into college by being idiots. even in the prestigious ivy league schools there are idiots",
                  "author": "JesusRocksSocks",
                  "created": 1575131068,
                  "upvotes": 6,
                  "replies": {
                    "f95n0n8": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95n0n8/",
                      "text": "Yeah, but I think it's a waste of energy to care about them, if someone managed to get to college using \"alternative\" ways that's not my problem. Every single student is responsible for their actions and it's their duty to do something about it. Moreover, maybe getting to college could be a wake up call for some of them, we don't know for sure, every persons has the chance to improve themselves and start to get serious, we should let them live their life haha.",
                      "author": null,
                      "created": 1575131351,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f965737": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f965737/",
          "text": "Yeah... that’s still plagiarism, and TurnItIn is getting better at spotting substituted text. \n\nMy advice: find something you want to use, read it, think about it, close the original source then write it in your own words as though writing an email to explain it to a friend. \n\nEven better; find two (or more things) you want to write about, and do the same thing BUT now you blend them together to create your own remix. \n\nAs a prof it simultaneously amazes me the efforts that students put in to try and circumvent the exercise, but also the sheer laziness that my colleagues show in not giving two f*cks about whether their students learn anything...\n\nI want my students to be a better scientist than me, I would *love it* if one of them becomes my boss one day - it means I’ve done my job well. \n\nPage counts in essays suck...",
          "author": "purplechemist",
          "created": 1575139913,
          "upvotes": 10,
          "replies": {
            "f9680j5": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9680j5/",
              "text": "It's funny because I too agree with everything you guys have said so far, how much of my reports/essays do you think are done this way? \n\nAnother thing, I use more than one source, the idea is to work over the original sentences, that's why I said you need to use your own words and ideas, that way you develop the original idea, and if possible merge info you read from other sourcers in a single paragraph. Why is my method something I like? because I can create a skeleton of the ideas I want to talk about way more easly. Having an starting point by usng an external source is the most useful thing when.",
              "author": null,
              "created": 1575141152,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f95zppf": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95zppf/",
          "text": "If you want to paraphrase or summarize a source, it's always a good idea to read the source, then set it aside and write it in your own words. What you are suggesting is essentially changing the word choices while keeping the overall structure and ideas from the paragraph which constitutes plagiarism. \n\nWhile YES you need to include sources, an essay is supposed to be \\~75% of your own material and \\~25% cite material (this differs for higher-level research papers where you might have to include significantly more sources). If the majority of your paper is just rewording other people's ideas, the paper is not original work. Remember plagiarism includes copying word choices, sentence structure, *and* ideas!",
          "author": "Lady_Caticorn",
          "created": 1575137696,
          "upvotes": 5,
          "replies": {}
        },
        "f95v500": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95v500/",
          "text": "Isn't that the basic idea of writing papers and essays? Find other sources and paraphrase them.",
          "author": "purplelovely",
          "created": 1575135786,
          "upvotes": -4,
          "replies": {
            "f95wh9h": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95wh9h/",
              "text": "No, it's not actually\n\nThe basic idea is reach a conclusion or insight about a specific topic. Sources are only for creating the foundation of the composition, which is usually the hardest part",
              "author": null,
              "created": 1575136403,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "f95dj59": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95dj59/",
      "text": "Smart -- very smart!",
      "author": "reddyplayer12",
      "created": 1575125440,
      "upvotes": 41,
      "replies": {}
    },
    "f95cr22": {
      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f95cr22/",
      "text": "Yes! Do this! Essays small and large always seem easier when I do this! If I was a psych major I would try to figure out why this is, but oh well maybe someone else knows why.",
      "author": "psychitsmike1",
      "created": 1575124925,
      "upvotes": 383,
      "replies": {
        "f97g3po": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f97g3po/",
          "text": "[deleted]",
          "author": null,
          "created": 1575165131,
          "upvotes": 80,
          "replies": {
            "f988cmg": {
              "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f988cmg/",
              "text": "What psych major names his reddit account bigcheese, bro?\n\nEdit: It is a joke people.",
              "author": "lolyayfun",
              "created": 1575175152,
              "upvotes": 18,
              "replies": {
                "f98twlh": {
                  "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f98twlh/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1575182852,
                  "upvotes": 16,
                  "replies": {
                    "f98usd6": {
                      "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f98usd6/",
                      "text": "hol up, it is bigch**ea**se.\n\nSilly me.",
                      "author": "lolyayfun",
                      "created": 1575183184,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "f9bz9yg": {
          "link": "/r/college/comments/e3x7lt/a_small_adivce_i_thought_id_share_helped_me_a_lot/f9bz9yg/",
          "text": "Or if you used common sense :p",
          "author": "DashHex",
          "created": 1575217801,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634056700
}