{
  "sid": "q2lv3l",
  "link": "/r/college/comments/q2lv3l/how_does_one_include_keywords_in_their_resume/",
  "title:": "How does one include “keywords” in their resume?",
  "text": "I was told before that you shouldn’t put interests in your resume, but I’ve been reading some advice that says otherwise. For big companies such as boeing, NASA, etc, people say keyword interests are key to get past the initial scanning when getting hired. Are these the only times where it’s okay to include an “interests” section on your resume to put some keywords from the job description?",
  "author": "glocks9999",
  "created": 1633531293,
  "updated": 1634083706,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hflz5ri": {
      "link": "/r/college/comments/q2lv3l/how_does_one_include_keywords_in_their_resume/hflz5ri/",
      "text": "You can put interests to fill your resume up and show your potential in that field. Once you have enough job experience that’s usually the first thing to go. For example I had some interests (analog/RF engineering) that was like one line, but now that I have actual experience in that field it’s 1) not necessary and 2) wasting space legitimate work can fill in. Also stating your interests narrows your market/malleability, so if you care about Electrical Engineering but don’t exactly know what to do, don’t specify analog design until you know that’s what you want to do",
      "author": "harry01772",
      "created": 1633531970,
      "upvotes": 0,
      "replies": {
        "hfm3q2l": {
          "link": "/r/college/comments/q2lv3l/how_does_one_include_keywords_in_their_resume/hfm3q2l/",
          "text": "Couldn’t I just change up my resume and interests depending on the job description?",
          "author": "glocks9999",
          "created": 1633533901,
          "upvotes": 1,
          "replies": {
            "hfm5hmn": {
              "link": "/r/college/comments/q2lv3l/how_does_one_include_keywords_in_their_resume/hfm5hmn/",
              "text": "Yes, but also you’ll probably be applying to hundreds of positions, so it’s much easier to just send one good resume versus multiple less good ones. And it’s also kind of disingenuous to change your interests based on where you apply, as they’ll assume your interests are your top interests if it’s on your resume. Also your multiple resumes may have you running thin on important things to have. Better to concentrate your achievements on one document, it’s highly unlikely at this point in your career you’ll have so much varying experience to fill multiple resumes if that makes sense. Less filler > tailoring your resume to the position",
              "author": "harry01772",
              "created": 1633534648,
              "upvotes": 1,
              "replies": {
                "hfmaswc": {
                  "link": "/r/college/comments/q2lv3l/how_does_one_include_keywords_in_their_resume/hfmaswc/",
                  "text": "I get how it can be disingenuous to change the interests based on where I apply, but how exactly does it make the resume quality worse? Shouldn’t interests be a line or two max, so changing these wouldn’t really affect the resume that much since 99% of the resume would be the same? Are you saying I should be putting the interests in a different format than I think?\n\nThank you for all the help so far!",
                  "author": "glocks9999",
                  "created": 1633536799,
                  "upvotes": 1,
                  "replies": {
                    "hfmd8ju": {
                      "link": "/r/college/comments/q2lv3l/how_does_one_include_keywords_in_their_resume/hfmd8ju/",
                      "text": "Not interests in particular, but if you have a resume for Analog engineering, DSP, RF, and EMAG, you’re going to have both a lot of overlap, but also a lot of filler, so better to give a wholistic overview than dive deep into something you most likely don’t have the proper experience to dive deep into if that makes sense. Changing only interests between resumes is pretty unnecessary, if you’re interested in the position that’s why you applied (I hope). If you have 4 important projects across 4 disciplines, better to have one sheet of all 4 than 4 sheets of 1/4 value and 3/4 filler if that makes sense",
                      "author": "harry01772",
                      "created": 1633537804,
                      "upvotes": 1,
                      "replies": {
                        "hfmgsyw": {
                          "link": "/r/college/comments/q2lv3l/how_does_one_include_keywords_in_their_resume/hfmgsyw/",
                          "text": "Ah that makes sense. I forgot to mention that I’m a junior trying to get a summer internship and I have no experience and hardly any big projects. I made the mistake of never getting involved (I’m trying to get involved this year) so I have a lot of filler on my resume anyways. I’ll keep your advice in mind for when I get experience so thank you so much",
                          "author": "glocks9999",
                          "created": 1633539266,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}