{
  "sid": "qs0sgo",
  "link": "/r/college/comments/qs0sgo/burnt_out_college_student_2873728288182/",
  "title:": "Burnt out college student #2873728288182",
  "text": "Like literally tho wtf has college been these past two years during Covid. I feel so mentally, physically, and emotionally drained. Granted, I took summer classes this past summer online so I didn’t really have a break but no one told me college was gonna be this draining. Maybe it’s just me maybe it’s Covid maybe it’s a factor amongst other things but lemme just say that college is not what it’s made out to be all throughout high school. \n\nThere’s a bit over one month left for me this semester and I’m literally counting down the days. I think my grades are starting to be affected by this too. I use to be a straight A high school student haha and now look at me. I’m at the point that I’m happy as long as I pass the class with a C lmaooo. I use to be involved in so many extracurriculars and activities and whatnot. But now I’d rather just stay at home if I don’t have to be on campus for classes. Clubs? No thanks. Lemme sleep in. \n\nI’m not sure what got lost in translation or interpretation when I was in middle and high school being told that college would be the best four years of my life, but obviously someone got my hopes up way too high. Do not go to college if you value your happiness.",
  "author": "_YouSaidWhat",
  "created": 1636682589,
  "updated": 1636745744,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.72,
  "comments": {
    "hkad8fw": {
      "link": "/r/college/comments/qs0sgo/burnt_out_college_student_2873728288182/hkad8fw/",
      "text": "Hi There! Sorry to hear you are having such a hard time, but I do have to say it is only going to get as great as you make it. There is plenty of opportunity for you to have fun and enjoy your experience, but it's not usually going to fall onto your lap - just like anything else in life - you have to work at it!  \n\n\nPersonally, college was the best 4 years of my life so far! I loved it so much so that I am now 25 and working as a Residence Director at a college in Massachusetts! Here is some advice I can give to you that helped make my experience so great:  \n\n\n\\- The best parts of the college experience come outside of the classroom. Yes you are there to get an education, but there is so much more to college than that. You stated that you do not want to do clubs, let me ask, Why? Personally, I was a tour guide, Student Government Member (for 4 years), Orientation Leader, Resident Advisor (My favorite), I played in Intramural Sports, and did a wide variety of other things. And all of these things are what made my experience SO GREAT! In each of the clubs/organizations I joined, I made friends in every single area who all had some impact on me to help me grow and become a better person. I met a wide variety of people (some of whom I absolutely did not like, but most I did) and meeting these people and establishing friendships was what helped my experience be so great. It was amazing having different friends in all different areas that I could connect with and hang out with at different times, it was great. Becoming an RA (aside from getting free room and board) instantly exposes you to a whole group of people and you become a part of a new community - and this is exciting! Half of my friends that I still talk with, even 3 years after college, were all RAs with me and they are amazing individuals whom I never would have met if I did not become an RA. Joining clubs and Organizations is one of the best things you can do to meet new people and expand your idea of what college is.\n\n\\-If you have the opportunity to, STUDY ABROAD! I spent 3 months living in London and taking a semester overseas. And something a lot of people usually do not know, is that it costs the same of what you would pay to attend college for a semester. The only thing that costs more is out of pocket expenses for things like traveling and going out more, but those expenses are WORTH IT x 1000! The experience you get from living in a different country and exploring a different culture is unparalleled to anything else in college. This is easily a top tier thing you can do to enhance your experience. I would have studied abroad more than once if I could have. One of my best friends from high school (whom I still talk to frequently) studied abroad in 2 different semesters: once in Argentina and once in Spain and LOVED both of them!\n\nThese are the two biggest tips I would personally give. I do not know your reason for not wanting to join clubs, but if you are someone who would rather sleep than go out and try new things and meet people, that may explain why you are having a poor experience.\n\nI do have to acknowledge that you have been a student most of the time through COVID and it was completely out of your control. As a Residence Director - I worked with college students every single day through that AND IT WAS SHITTY. But we are now coming to a place where we are moving forward from the shittiness of that experience. \n\nAre you gonna let that poor experience of the past two years ruin the rest of your experience? Or are you going to try and have a more positive attitude and outlook on the two years you have left. At this point, the only person who can do something to change your experience for the better is you, and that is going to require some sort of change and effort from your part. You can do it, but it will take effort and it may be hard at times. But life is hard - it is rare for things to come easily. \n\nSo let me ask you, are you going to continue down the path you are on, or are you going to get up and do something about it. There is so much potential for greatness - you do not want to look back on life with regret for things you did not do.  \nGood luck my friend - sending positive vibes your way.",
      "author": "Dirixio",
      "created": 1636686940,
      "upvotes": 1,
      "replies": {}
    }
  }
}