{
  "sid": "rc804o",
  "link": "/r/college/comments/rc804o/didnt_get_into_my_cc_nursing_program/",
  "title:": "Didn't get into my CC nursing program",
  "text": "Yesterday, my community college gave out application results for their spring 2022 ADN program. And as my title suggests, I didn't get accepted. They put me on the alternate list. I don't really know what to do with my life now and so, I'm posting on Reddit. Why? I sorta need reassurance that I am not a failure and I want some advice for what I should do next in my life. \n\nI'm gonna start by saying my grades and stats. For all the prerequisite courses, I have A's. However, my GPA is 3.907/4.000. This is because I was an education major and got one B in my biology class last year. So overall, I've taken 18 classes, 17 A's and 1 B. 54 total credits. 13 of those classes are prerequisites for the nursing program, and I received A's in all of them.\n\nI'm only 19 years old, but I've taken 5 semesters of college courses and changed my major three times. I decided on nursing 2 semesters ago. Here are the exact courses I've taken.\n\nMicrobiology -----Human Anatomy & Physiology I ----- Human Anatomy & Physiology II ----- Developmental Psych: Life Span ----- General Psychology ----- Statistics Soc/Beha Sciences ----- PHILO-Ethics ----- English Composition ----- English Composition 2 ----- Intro Humanities: The Arts ----- Fundamental Speech Communication ----- Cert. Nurse Assistant Training ----- General Education Math\n\nALL A grade\n\nIntro Humanities: Ideas/Values ----- Introduction to Literature ------ General Education Math ----- CIT-1121 Introduction to Networks ------ CIT-1710 Introduction to Servers ----- BIOLO-Principle Biological Science } These classes were taken when I was an education major and then a CS major.\n\nALL A. except BIOLO, which has a B\n\nMy school required us to take the HESI. I got these grades, Reading: 92 Vocab: 92 Math:96 Anat: 80. My Average was a 90%\n\nSo, that's it. Those are the items considered for admission. My school ranks you and if you have a GPA higher than 3.89 and get a 90 or higher average on the HESI, you get all the points. I got all the points but still didn't get in. \n\nI didn't really have a backup plan and now I don't know what to do during my spring semester. Should I just apply again for the Fall start date? I'll just be sitting at home for the next 8 months, and I don't want to do that. Since I haven't taken chem, I can't apply to BSN programs for another year since I have to take 2 semesters of chem. What do you guys think I should do? I'm sorry that all this info is jumbled. I feel emotionally crazy right now and super upset. I wasn't able to sleep all night.\n\nI was overconfident that I would get into the program since a lot of my classmates didn't have as good stats as me and since I got all the points. But, I didn't get accepted and now I'm torn. I see my stats, I know I'm not 'dumb' or untalented. But, I feel like a failure. A lot of my self-worth has been put into my education and grades. They were all I had since I wasn't in sports or clubs in my childhood. I just feel empty right now and want to cry. I started a part-time PCT job yesterday too. I got my results during the orientation and went to the bathroom cuz I was tearing up. I feel like such a failure.\n\nEveryone in my family got into med school or nursing school on the first try. And it makes me feel even more like a disappointment. I haven't even told my parents yet. \n\nSorry for all the overwhelming and bombardment of information.",
  "author": "anonymous_617",
  "created": 1639018766,
  "updated": 1639517129,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "hnt15ep": {
      "link": "/r/college/comments/rc804o/didnt_get_into_my_cc_nursing_program/hnt15ep/",
      "text": "have you talked to a advisor yet at your school and see what they say?\n\nI went to a prehealth heavy undergrad and know its hard to get in.",
      "author": "enoughstreet",
      "created": 1639019118,
      "upvotes": 2,
      "replies": {
        "hnt389o": {
          "link": "/r/college/comments/rc804o/didnt_get_into_my_cc_nursing_program/hnt389o/",
          "text": "Thanks for your reply. \n\nBefore applying, I tried to talk to a HEALTHadvisor. But, was shut down and sent to my regular advisor. She said I had good chances of getting in.\n\nI've scheduled an appointment with an actual health advisor to see what went wrong. Won't be speaking with her for another 3 weeks though.",
          "author": "anonymous_617",
          "created": 1639020088,
          "upvotes": 3,
          "replies": {
            "hnt8p7b": {
              "link": "/r/college/comments/rc804o/didnt_get_into_my_cc_nursing_program/hnt8p7b/",
              "text": "Take the time. \n\nI’m at cc for post bacc classes and am now calling deans of the school over why I never got confirmation to keep my laptop and hot spot. I really need the internet access. \n\nIt might be a glitch but again it’s good to know why",
              "author": "enoughstreet",
              "created": 1639022761,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnvenfe": {
      "link": "/r/college/comments/rc804o/didnt_get_into_my_cc_nursing_program/hnvenfe/",
      "text": "It’s ridiculous how hard it is to get in the nursing program. I say try a different healthcare field, or even go for medical school. Your stats are great! You should feel proud of yourself. And they say they lack nurses everywhere yet make it hard for prospective students to get in the program to become nurses. What a joke.",
      "author": "FluffyStuffInDaHouz",
      "created": 1639069311,
      "upvotes": 2,
      "replies": {}
    },
    "hnt20h0": {
      "link": "/r/college/comments/rc804o/didnt_get_into_my_cc_nursing_program/hnt20h0/",
      "text": "Talk to the program and find out your chances of getting in off the wait-list are, and if there are things you can do to enhance your application for the future. Your grades sound awesome, but they may have ideas. Plan to take Chemistry for the BSN program in the spring and summer if you don't get in off the wait list. Reapply for fall. If you don't already have a related job (CNA, Medical Assistant) work on doing that in the spring (not sure what a PCT is?), and/or step up volunteer hours. Don't give up, it's way too soon for that.",
      "author": "kittycatblues",
      "created": 1639019520,
      "upvotes": 1,
      "replies": {
        "hnt3jw1": {
          "link": "/r/college/comments/rc804o/didnt_get_into_my_cc_nursing_program/hnt3jw1/",
          "text": "Thank you for your advice. A PCT is a patient care tech. It's the same thing as a CNA in my state since you have the same licensure. I emailed several people yesterday about why I didn't get in and if they could talk to me about getting in next time. No replies yet, but hopefully soon.",
          "author": "anonymous_617",
          "created": 1639020241,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnxsp6u": {
      "link": "/r/college/comments/rc804o/didnt_get_into_my_cc_nursing_program/hnxsp6u/",
      "text": "This isn't going to alleviate the nursing shortage.",
      "author": "lkmk",
      "created": 1639105154,
      "upvotes": 1,
      "replies": {}
    }
  }
}