{
  "sid": "qgi0ev",
  "link": "/r/college/comments/qgi0ev/what_are_lowertier_students_supposed_to_even_do/",
  "title:": "What are lower-tier students supposed to even do after college?",
  "text": "I know I'm not going to get a job remotely related to my major (environmental science) when I graduate even though it's what I want to do. I'm a senior with a 3.2 GPA, one non-competitive internship at a nonprofit staffed by volunteers, and no research experience even though I tried for years to get a position, and to make matters worse I'm very shy so not about to make up for it with my networking skills. Honestly, for those of us that aren't at the top of our classes, what are we supposed to even do when we graduate? I feel like I wasted so much money honestly and I'm already depressed since I can see the years of stress ahead. I'd appreciate some advice from anyone who was once in the same place.",
  "author": "UnderstandingOk7037",
  "created": 1635287520,
  "updated": 1636184798,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.75,
  "comments": {
    "hi6et3y": {
      "link": "/r/college/comments/qgi0ev/what_are_lowertier_students_supposed_to_even_do/hi6et3y/",
      "text": "1. Don’t give up. 2. Identify 20 different companies you want to work for 3. Apply to an entry level job in each of those companies - 1 per month. 4. Make sure u tailor your resume to fit the job description, even if you have to highlight volunteer work or classroom learning.  Persistence and endurance will get you there. Don’t give up on your dreams, ever.",
      "author": "Go_City_6367",
      "created": 1635289549,
      "upvotes": 6,
      "replies": {}
    },
    "hi71cqk": {
      "link": "/r/college/comments/qgi0ev/what_are_lowertier_students_supposed_to_even_do/hi71cqk/",
      "text": "Honestly, what I’m seeing is you have a pretty good GPA and an internship under your belt-don’t sell yourself short. The majority of college graduates in the world were not top of their class, and end up doing just fine :). Persistence is key- and, if you need a little bit of a break, it’s okay to go into a “less prestigious” adjacent field, or any job you could gain applicable skills, and come back to it. There’s no one straight path to success, not to be a cliche but it’s all a journey and your experiences will build up and benefit you along the way.",
      "author": "potatosnack21",
      "created": 1635299777,
      "upvotes": 1,
      "replies": {}
    },
    "hi7niia": {
      "link": "/r/college/comments/qgi0ev/what_are_lowertier_students_supposed_to_even_do/hi7niia/",
      "text": "3.2 is consider low tier?",
      "author": "Catanddogg",
      "created": 1635311300,
      "upvotes": 5,
      "replies": {}
    },
    "hi7paoz": {
      "link": "/r/college/comments/qgi0ev/what_are_lowertier_students_supposed_to_even_do/hi7paoz/",
      "text": "Why are you labeling yourself as a “lower tier student”? You first need to work on not viewing yourself as that because you are not low-tier anyway. 3.2 GPA is pretty good and you already have one internship. Some students don’t even have one internship. Stop doubting yourself because you’re just going to create mental road blocks for yourself unconsciously.",
      "author": "pink_meow",
      "created": 1635312500,
      "upvotes": 4,
      "replies": {}
    },
    "hi8bgj6": {
      "link": "/r/college/comments/qgi0ev/what_are_lowertier_students_supposed_to_even_do/hi8bgj6/",
      "text": "My dad’s best friend graduated with a 2.3 and he’s one of the most successful people my family knows.\n\nGPA doesn’t matter. Employers don’t really care.",
      "author": "Megadog3",
      "created": 1635330634,
      "upvotes": 3,
      "replies": {}
    },
    "hi9oxmt": {
      "link": "/r/college/comments/qgi0ev/what_are_lowertier_students_supposed_to_even_do/hi9oxmt/",
      "text": "3.2 isn’t that low. My biochemistry teacher made to grad school with a 3.0 that was originally a 2.99 that his advisor bumped up. You may have to work a shitty job for the first few years to build up to what you want to do, but you’re not doomed.",
      "author": "denver_rose",
      "created": 1635354408,
      "upvotes": 2,
      "replies": {}
    }
  }
}