{
  "sid": "qjd62t",
  "link": "/r/college/comments/qjd62t/is_it_okay_to_send_a_followup_email_to_an/",
  "title:": "Is it okay to send a follow-up email to an individual student if the first email was unsolicited? (Crosspost)",
  "text": "The club rugby team at my college has been struggling to put together a roster, we just can’t find enough people who want to come out and play. So, I’ve sorta taken it upon myself to go on a little recruiting spree. What I’m doing is looking through the old rosters of the varsity sports teams here at school, and then shooting emails to the guys who aren’t on them anymore. So, if I look at last year’s football roster and find a kid who’s not listed on the current year’s roster, I’ll send him an email asking if he’d like to play rugby. I’ve sent about ten such emails now, and I’ve gotten a few responses. However, a majority of them have not responded, and I’d like to just check in and make sure that they actually saw the email in the first place- I don’t want to be pushy or anything, but I would also like to get a concrete answer. I understand that it’s normal and encouraged to send follow up emails to things like your professors or clubs that you’re interested in joining, but I’m not sure what a follow up to an individual student would sound like. Would it be socially acceptable to do such a thing? If so, how long should I wait before sending another email?",
  "author": "aiuthrowaway98",
  "created": 1635636373,
  "updated": 1635779774,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hiq0e7l": {
      "link": "/r/college/comments/qjd62t/is_it_okay_to_send_a_followup_email_to_an/hiq0e7l/",
      "text": "Hi name,\n\nIf you didn't see my previous email, blah blah blah blah repeat what your first email said with contact info if they want to join.\n\nBest/whatever closing,\n\nOP.\n\nWait at least 3 days between emails, because students check their email less than faculty. Reply to your own email or send a fresh thread, either is fine.",
      "author": "wobbletelescope",
      "created": 1635649164,
      "upvotes": 2,
      "replies": {}
    }
  }
}