{
  "sid": "q8kltt",
  "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/",
  "title:": "Seriously, how the hell do I win a scholarship?",
  "text": "I’m a junior in college and not once have I won a scholarship. A major problem is a lot of them require you to talk about things you did in high school or sometime in the past, like clubs, community service, etc. Well, I’ve done jack shit. I never once have been in a club and I never really did any more than show up for school.\n\nMost scholarships don’t seem like they’re worth the time anyways. For those that are smaller amounts of money, they still want a full on essay for a SMALL CHANCE to win. And I just know I won’t win, because I’ve nothing to my name. Why would they pick me? Honestly. I’d have a better chance of winning from a lottery drawing, maybe like those “no essay” ones.\n\nSeriously, how do I even have a shot of getting any significant scholarships? I’m seriously gonna need some now because my mom’s income went up and it slashed my FAFSA money by about 3.5k despite her saying she’s not going to help. Fucking hell. I really relied on that money since it covered most of my costs.",
  "author": "SNRNXS",
  "created": 1634289312,
  "updated": 1634587178,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hgqfemf": {
      "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/hgqfemf/",
      "text": "Try applying to local scholarships in your area, they using have fewer applicants so you have a higher chance. You might still need to submit an essay, but if you're applying to outside scholarships you're going to have to do that at some point anyway. O have a hunch that no one really wins those \"no essay\" ones. Also, you could consider a state college that offers merit scholarships based on GPA/sat score if that's available to you and if you meet the requirements. I did zero extre curriculars and got a HEFTY amount based on those two factors alone.",
      "author": "NoDryHands",
      "created": 1634302916,
      "upvotes": 3,
      "replies": {
        "hgtllk0": {
          "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/hgtllk0/",
          "text": "I can't switch colleges because my degree is something I'm pretty sure an equivalent is hardly offered anywhere else.",
          "author": "SNRNXS",
          "created": 1634355724,
          "upvotes": 1,
          "replies": {
            "hgtlwdq": {
              "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/hgtlwdq/",
              "text": "My apologies, I completely missed the first line of the post and thought you were applying to colleges for some reason. Please blame my stupidity on anesthesia. \n\nHowever, the local scholarships thing still stands. There are usually more available for high schoolers, but some of them include undergrads too, so look out for those or look around on local high school websites, which sometimes list local area scholarship opportunities for its students.",
              "author": "NoDryHands",
              "created": 1634355903,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgqgird": {
      "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/hgqgird/",
      "text": "Haven't done crap during my highschool years either, like literally nothing\n\nLooks like I'm out of luck for scholarships too then lol",
      "author": "Rare_Cobalt",
      "created": 1634303485,
      "upvotes": 2,
      "replies": {}
    },
    "hgs4bbf": {
      "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/hgs4bbf/",
      "text": "“I haven’t done anything and no one will give me money for it!”",
      "author": "gb8er",
      "created": 1634328760,
      "upvotes": 1,
      "replies": {}
    },
    "hgqp3lo": {
      "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/hgqp3lo/",
      "text": "If paying for college will be an issue, have you considered community college?\n\nI wasn’t in your predicament, very little scholarships offered and only $2k for pell grants. I didn’t get involved in high school. And my SAT was low because I was unable to study due to being hospitalized most of my junior year, and Covid hitting making me unable to retake them in them my senior year. \n\nThe only thing I had growing for me was my 4.0 GPA which put me at the top 15% of my class. And as a result I was able to go to cc for free through my states scholarship program. See if your state offers something similar.\n\nCommunity college in general is significantly cheaper than a 4 year institution anyways, and by transferring you’ll be able to save yourself from a lot of debt in the future.",
      "author": "kizeltine",
      "created": 1634307508,
      "upvotes": 1,
      "replies": {
        "hgtlh6f": {
          "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/hgtlh6f/",
          "text": "How am I supposed to finish my degree at a community college?",
          "author": "SNRNXS",
          "created": 1634355652,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgw05c9": {
      "link": "/r/college/comments/q8kltt/seriously_how_the_hell_do_i_win_a_scholarship/hgw05c9/",
      "text": ">Well, I’ve done jack shit. I never once have been in a club and I never really did any more than show up for school.\n\nYeah, thats a problem.  You don't get scholarships for just showing up to school. You gotta go beyond the classroom.  Get on it.",
      "author": "FreeThinkingGrandpa",
      "created": 1634409094,
      "upvotes": 1,
      "replies": {}
    }
  }
}