{
  "sid": "rhkg2x",
  "link": "/r/college/comments/rhkg2x/how_are_people_able_to_handle_college/",
  "title:": "How are people able to handle college extra-curricular plus maintaining good grades and having a good social life?",
  "text": "I would like to do more on the campus even though im In a community college, but I get tired easily during the day, also exhausted from being around people as an introvert",
  "author": "kaqarotchain",
  "created": 1639635527,
  "updated": 1639787800,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hor1kiw": {
      "link": "/r/college/comments/rhkg2x/how_are_people_able_to_handle_college/hor1kiw/",
      "text": "You naturally give up some things when prioritizing other things. A social life can also mean different things to different people. Ie, in your example, someone could get all the social interactions through classes and extra-curriculars, whereas the social life of others is defined by parties and casual hangouts.\n\nTime management/budgeting is very important during and after college.",
      "author": "Cocainefanatic",
      "created": 1639636381,
      "upvotes": 3,
      "replies": {}
    },
    "hor1q5f": {
      "link": "/r/college/comments/rhkg2x/how_are_people_able_to_handle_college/hor1q5f/",
      "text": "Some people have better study methods or can simply just learn quicker and better. It’s really situational. I got away with doing like 2 hours of homework a week all this quarter and ended the quarter with a 3.77. Some people I know needed to spend 10-15 hours on homework a week to understand it. It really just depends.",
      "author": "maora34",
      "created": 1639636484,
      "upvotes": 2,
      "replies": {}
    },
    "hosjoty": {
      "link": "/r/college/comments/rhkg2x/how_are_people_able_to_handle_college/hosjoty/",
      "text": "Extracurriculars, especially time intensive ones, are often that person’s social life.\nAlso being more invested in clubs and hanging out earlier in the semester when the work load is a bit lighter.",
      "author": "Katherington",
      "created": 1639669937,
      "upvotes": 1,
      "replies": {}
    }
  }
}