{
  "sid": "qttzon",
  "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/",
  "title:": "What are some other viable career paths if I choose not to go to college & do you think going to college is worth it?",
  "text": "I’m 17, currently a senior in high school, and I honestly just feel like school isn’t for me. I’ve heard of people that did terribly in high school but did fantastic in college, and although that could possibly be the case with me as well, I don’t want to risk drowning myself in student loans to test that theory. \n\nAlthough my parents would most definitely prefer if I went to college, they aren’t completely against the idea of me doing something else, because they know how much I struggle in school. However, I’m at a loss as to what other viable career paths are out there if I choose not to go to college. \n\nWhat do I do from here? What are some viable career paths? Am I completely fucked in life if I don’t go to college? \n\nI would greatly appreciate the help, because this is something that has been weighing down on me HEAVILY these past two years. I’m terrified. I don’t want to be a disappointment/failure.",
  "author": "starboyandy",
  "created": 1636908984,
  "updated": 1637181545,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 0.93,
  "comments": {
    "hklv264": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hklv264/",
      "text": "Trade school is a great option for learning a hands-on trade like welding, HVAC, electrical, machining, drafting, etc. I went to trade school and learned drafting which made me decide to go ahead and enroll for community college for mechanical engineering which is what I’m doing now, but I could’ve gotten a job straight out of trade school with my certification",
      "author": "darkerthanthenight",
      "created": 1636909408,
      "upvotes": 27,
      "replies": {
        "hkmipml": {
          "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkmipml/",
          "text": "Can you draft my fantasy football team 😂😂😂😂😂😂😂😂😂😂",
          "author": "shugapro_YT",
          "created": 1636918434,
          "upvotes": -21,
          "replies": {}
        }
      }
    },
    "hkn4pc8": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkn4pc8/",
      "text": ">Am I completely fucked in life if I don’t go to college? \n\nNo, but you'll be completely fucked for life if you go to major in woman's studies or English or any other \"economically worthless\" degree with 100k in student loans. I will mention these subjects are NOT intellectually worthless, but don't expect to get the same job as an accounting major.\n\nIf a job you want to do REQUIRES or benefits from college, Electrical Engineering, Civil Engineering, Accounting, Nursing, Computer Science, medicine, etc. and you can go without debt, then go. It is very worthwhile.\n\nIf it is in a degree that doesn't give you hard skills and you have to take on 100k in debt, don't fucking go! Simple as that.\n\nYou could consider going to community college/ non for-profit trade school for a 2 year degree or a certificate in something like HVAC, IT, Engineering Technology, Dental Hygiene, Automotive Technology, etc.)\n\nI personally advise against for-profit trade schools because they are way overpriced compared to CC, lack the same recognition and accreditation standards, and are just as predatory as for-profit universities like ITT Tech, U of Phoenix, and DeVry.\n\nThe military is an amazing option if you want to have your education paid for or you want training in a career field without paying for it at a trade school, or both (for example, you are trained in becoming a car mechanic and then you go to college to study mechanical/ automotive engineering. These two things compliment each other and you have no debt because it is paid for.)\n\nJust my $0.02",
      "author": "Papaadumbass",
      "created": 1636926865,
      "upvotes": 5,
      "replies": {
        "hkqd19a": {
          "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkqd19a/",
          "text": "Sure.  Military without a college degree mean you'd be an enlisted man.  With a college degree- or getting one which you're in it- you'd easily make 7x what you'd make without a college degree.  But if you don't want to get to school, $1,700/ month.\n\nAny trade profession you'd have to go to school for training and then an apprenticeship. No school?  Ignore that option.\n\nA liberal arts program would teach you how to write, critical thinking skills, and so on.  Good jobs after that. Doesn't have to be a 6 figure school.  But NO school?\n\nHmmm... wait tables, check out at grocery store.... these come to mind.\n\nSo, the answer- yes, ~~you'd be fucked~~ it would be unfortunate.  Unless you're the best guitarist in your region- tour with a band, hope to break through.  Which you're not.\n\nEdit: To be less offensive.",
          "author": "TuftedWitmouse",
          "created": 1636991856,
          "upvotes": 1,
          "replies": {
            "hkqr2lm": {
              "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkqr2lm/",
              "text": ">But NO school? \n\nYou obviously need to have some sort of post-secondary education but not necessarily a four year degree.\n\n>Any trade profession you'd have to go to school for training and then an apprenticeship. No school?\n\nIf it is a trade that requires licensure you will need that on top of trade school. I was saying learning auto-repair is a good way to compliment a mechanical engineering degree.\n\n\n>So, the answer- yes, you'd be fucked. Unless you're the best guitarist in your region- tour with a band, hope to break through. Which you're not.\n\nNever said I was a guitarist. Is this message meant for OP?",
              "author": "Papaadumbass",
              "created": 1636997500,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hkmrt1t": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkmrt1t/",
      "text": "outside of college, there are many jobs still available, for one becoming a realtor is a very well-paying option and personally the option I would take if I was going to school. But the most important thing is to consider jobs that involve activities that you already like doing. if you like working with your hands and making things, you may like welding, fabrication, glazing, electrical, or HVAC work. there are plenty of well-paying jobs out there and probably one in a field you will enjoy showing up to everyday! i recommend you do some research on things you enjoy doing and how you can start making money by doing them",
      "author": "_TheArgonaut",
      "created": 1636921838,
      "upvotes": 5,
      "replies": {}
    },
    "hkm3qrj": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkm3qrj/",
      "text": "The trades pay pretty well",
      "author": "ogorangeduck",
      "created": 1636912931,
      "upvotes": 5,
      "replies": {}
    },
    "hkmt33s": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkmt33s/",
      "text": "I would suggest looking into a vocational school! You won't have the stress of doing gen eds and a major, but you can make a lot of money with something like welding or carpentry. Also, it takes less time to complete these degrees than college degrees.",
      "author": "Turbulent-Rip-5370",
      "created": 1636922339,
      "upvotes": 5,
      "replies": {}
    },
    "hkn1kq7": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkn1kq7/",
      "text": "I you want to try college with no debt, maybe look into ROTC. You have to serve in the military, but at least you can get free college. \n\nIf you don’t want college at all, look into trade school. There are plenty of well paying careers that don’t require a bachelor’s degree.",
      "author": "JupiterRocket",
      "created": 1636925653,
      "upvotes": 3,
      "replies": {}
    },
    "hkm3but": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkm3but/",
      "text": "There are tons of options! If you have any interest in health care you could look into being a CNA or a pharmacy technician! Both are very decent career paths with decent pay:) College has been greatly romanticized and exaggerated, especially by high school counselors and educators imo. College is not a sign of your worth or intelligence. Plently of people go on to make far more money than some college grads do.",
      "author": "thot_bryan",
      "created": 1636912761,
      "upvotes": 7,
      "replies": {
        "hknizw9": {
          "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hknizw9/",
          "text": "Don't be a CNA. You will literally be shit on, thrown up on, and physically run down for $14 an hour.",
          "author": "wolfy321",
          "created": 1636932913,
          "upvotes": 6,
          "replies": {}
        },
        "hkmzv4g": {
          "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkmzv4g/",
          "text": "You couldn't have said it better. My mom was a CNA. She said she felt stupid because she never became an RN, despite the fact that it wasn't a viable option for her at that time and she was making decent money.",
          "author": "Papaadumbass",
          "created": 1636925010,
          "upvotes": 3,
          "replies": {}
        },
        "hkn7xf2": {
          "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkn7xf2/",
          "text": "Don’t go to school for pharmacy technician programs.  Please look up r/pharmacytechnician or r/pharmacy before jumping into it.",
          "author": "Pianonubie",
          "created": 1636928180,
          "upvotes": 4,
          "replies": {
            "hkn8v1e": {
              "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkn8v1e/",
              "text": "Why do you regret it?",
              "author": "Papaadumbass",
              "created": 1636928571,
              "upvotes": 0,
              "replies": {
                "hkng726": {
                  "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkng726/",
                  "text": "You don’t need schooling for it in some states. It depends. Most just require certification and most places will train you on the job to pass it. Idk why this person is being so ominous about it (source: i’ve been a tech for 12 years and make $20/hr, and now i’m in a pharmD program)",
                  "author": "thot_bryan",
                  "created": 1636931698,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hkn08or": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkn08or/",
      "text": "Community college (for things like HVAC, respiratory therapy, pharmacy technician,etc.)\n\nThe military who pays for your education and your training in a vocation.\n\nThese are the best and cheapest options I recommend.",
      "author": "Papaadumbass",
      "created": 1636925144,
      "upvotes": 2,
      "replies": {}
    },
    "hkn6idy": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hkn6idy/",
      "text": "I would also agree with the others suggesting trade school or community college. There are programs that don’t require Gen Ed classes (you won’t get an associate’s degree with that route, but you’ll learn the skills you need for a career). Many corporate career routes really aren’t going to make substantially more than a good trade/skilled career, and you might find that doing something a bit more physical is more appealing than office work if you’re not into school either (they tend to feel similar imo).",
      "author": "begrudgingly_zen",
      "created": 1636927598,
      "upvotes": 2,
      "replies": {}
    },
    "hknl5ab": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hknl5ab/",
      "text": "Don’t go to college it’s a complete waste of time.\nHonestly everything they teach you is indoctrination depending on your major. I can’t believe all the bs they taught me I wasted my time getting a sports management degree and an associates degree in arts. Everything was unrelated to the topic they taught. It was a political indoctrination course every course for me. Whether you disagree you’ll be wrong and marked as an F in their grade book. Don’t be afraid of failure because you learn from mistakes to become successful. Not everything has to happen instant take your time. If I were you I’d attend career fairs. You can easily scope out potential jobs that may interest you that don’t require a degree. Honestly bro the debt isn’t worth it. Hasn’t paid off for me. Fuck college. I’ll wait for anyone to argue with me. My time in college has been a waste. It’s to fucking expensive and half the shit they teach us useless. Seriously go to a career fair. If you want to ask what I went through please message me. You’ll completely understand what I’m coming from.",
      "author": "Cobi6947",
      "created": 1636933842,
      "upvotes": 1,
      "replies": {}
    },
    "hknoi80": {
      "link": "/r/college/comments/qttzon/what_are_some_other_viable_career_paths_if_i/hknoi80/",
      "text": "I suggest a gap year. Work for a company, build some skills, and think about things. So many people rush into decisions and drop out later. Take your time!!",
      "author": "unoriginalluckpusher",
      "created": 1636935338,
      "upvotes": 1,
      "replies": {}
    }
  }
}