{
  "sid": "q46f21",
  "link": "/r/college/comments/q46f21/can_anyone_recommend_some_paths_i_could_look_at/",
  "title:": "Can anyone recommend some paths I could look at career-wise based on my skills, interests and weaknesses?",
  "text": " I have one semester left after this fall. After covid I was going through some existential crisis stuff regarding my major and what I want to do with my life. \n\nI have switched my degree from Music Ed to just a B. A in music because I just don't enjoy certain aspects of teaching. I'm struggling to find out what kind of things I'm interested in pursuing after college and what I can do with the experience I have now.\n\nIf anyone has any suggestions about what paths I could look into here are some skills/interests I have... \n\n- I do play a musical instrument and I enjoy being creative. \n- I like looking at details and data and organizing or categorizing. \n- I enjoy helping people/guiding people in some way. It's very fulfilling to see people do better. \n- I don't know much about computers or coding but I can learn quickly and maneuver technology well. \n- I enjoy problem solving/finding solutions for people\n- I enjoy doing research gathering information \n- I am resourceful and like finding all possible answers to an issue \n\nSome things I'm bad at... \n- Being in the spotlight (one of the reasons I don't like teaching) \n- Not being able to be myself in a work setting\n- Math \n- Public speaking on the spot (but if I'm prepared not so bad)\n- Long term projects that take months/years to complete \n- Anything sales related. I don't believe I'm convincing or persuasive unless I 100% know what I'm talking about\n\nMy friend suggested looking into social work. I'm taking a cybersecurity class currently and I really enjoy it too. I'm wondering if anyone knows what type of careers out there need people with these skills? I'm very little stuck and would appreciate any recommendations.",
  "author": "genericusername_____",
  "created": 1633725872,
  "updated": 1634083195,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hfx4d7e": {
      "link": "/r/college/comments/q46f21/can_anyone_recommend_some_paths_i_could_look_at/hfx4d7e/",
      "text": "Music production maybe?",
      "author": "skippy5433",
      "created": 1633737650,
      "upvotes": 2,
      "replies": {}
    },
    "hfzdgk9": {
      "link": "/r/college/comments/q46f21/can_anyone_recommend_some_paths_i_could_look_at/hfzdgk9/",
      "text": "[removed]",
      "author": null,
      "created": 1633788002,
      "upvotes": 1,
      "replies": {}
    }
  }
}