{
  "sid": "rgefpy",
  "link": "/r/college/comments/rgefpy/how_to_get_my_professor_to_bump_my_grade/",
  "title:": "How to get my professor to bump my grade?",
  "text": "I am 0.11% away from an A and he refuses to bump my grade because it would be unfair to the other students. \n\nI tried telling him that an A was a better representation of my level of effort and enjoyment of the class, I tried telling him my grades are very important to me because I'm trying to get into a competitive program, and I tried telling him that he could give me extra points on my paper because grading a paper is often subjective but nothing has worked. \n\nI'm going to pursue getting an A until the very last day that grades are due. Please give me any ideas on getting him to bump my grade?",
  "author": "RainyBlueDays",
  "created": 1639508118,
  "updated": 1639516039,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.22,
  "comments": {
    "hojobii": {
      "link": "/r/college/comments/rgefpy/how_to_get_my_professor_to_bump_my_grade/hojobii/",
      "text": "It’s not going to happen. Grades are not and should not be a sole reflection of effort, and enjoyment is irrelevant. I’d he said no, then the answer is no.",
      "author": "PhDapper",
      "created": 1639508949,
      "upvotes": 1,
      "replies": {}
    },
    "hojnmj7": {
      "link": "/r/college/comments/rgefpy/how_to_get_my_professor_to_bump_my_grade/hojnmj7/",
      "text": "There is nothing you can do. He will not change/bump your grade.",
      "author": "music_movie_shows",
      "created": 1639508677,
      "upvotes": 11,
      "replies": {}
    },
    "hojqcjx": {
      "link": "/r/college/comments/rgefpy/how_to_get_my_professor_to_bump_my_grade/hojqcjx/",
      "text": "Agh I fucking hate 89s. Most professors will bump up if you’re past 89.5 but I’ve had two that didn’t budge. It’s awful but if the answer is no, it’s best to just accept it. You’re not going to get anything from bothering him during a time he probably has a million other students asking the same thing and whatever grading he’s dealing with.",
      "author": "Hot_tamami",
      "created": 1639509746,
      "upvotes": 1,
      "replies": {}
    },
    "hojqj81": {
      "link": "/r/college/comments/rgefpy/how_to_get_my_professor_to_bump_my_grade/hojqj81/",
      "text": "I’m always one to ask the question once if I need to, because you never know, but if the professor has already said no then I am sorry but I don’t think that there is much more that you can do on your end. I would probably reply with a thank you and put it to rest. \n\nThere could still be a chance, but you will kill whatever chance is left by pushing the issue. Profs can be easily agitated with this stuff. \n\nGood luck I hope you get the A!",
      "author": "Deepseadyson",
      "created": 1639509818,
      "upvotes": 1,
      "replies": {}
    },
    "hok3mhy": {
      "link": "/r/college/comments/rgefpy/how_to_get_my_professor_to_bump_my_grade/hok3mhy/",
      "text": "Well if it was my first try and knew he’d be hard to persuade I’d write an email with all the reasons you should get an A while keeping it very polite, neutral and reasonable.",
      "author": "elpresidentdeusa",
      "created": 1639514950,
      "upvotes": 1,
      "replies": {}
    }
  }
}