{
  "sid": "rdfkyq",
  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/",
  "title:": "What do you guys think about cheating in college?",
  "text": "The title, what do you guys think? I’m just curious as to see what everyone’s view point is. I’ve heard some of the shit you learn in college you don’t even use in the real world (in some cases) or your job. I believe it really depends on the job you get I guess. Like I don’t want a doctor to operate on me not knowing wtf they’re doing lol. I’m a sophomore in college going towards an economics degree & double minor. Again, just curious as to how all you college students think of cheating\n\nEdit: y’all I don’t condone cheating. I don’t LIKE it. Just to be clear",
  "author": "sleepyyvirgo",
  "created": 1639162217,
  "updated": 1639516617,
  "over_18": false,
  "upvotes": 62,
  "upvote_ratio": 0.86,
  "comments": {
    "ho0qim4": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho0qim4/",
      "text": "I’m a community college prof. The purpose of college is to learn skills and knowledge, not to get a grade, but unfortunately grades are what determine your future. Cheating is what happens when someone thinks they can’t get a grade based on their own skills and knowledge, and values the grade more than they do the skills and knowledge. Honestly, if we could do away with grades entirely, and replace with actual feedback, that would help students’ learning a lot more. (It’d be a lot harder for profs though.)",
      "author": "AceyAceyAcey",
      "created": 1639162445,
      "upvotes": 185,
      "replies": {
        "ho1n7z4": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1n7z4/",
          "text": "Just got done with my mechanics class in college. I like the subject get A’s on all assignments and homework and what not. But I generally bomb tests. Test anxiety is a bitch.\nI even got offered to become a TA by the professor when I had a C in the class solely because 3 tests lowered my grade by a ton. Professor also thought i was cheating, until I explained to him my situation, and also solved different variations of my test problems at ease when I didn’t know they were from a test.",
          "author": "Camaroni1000",
          "created": 1639175530,
          "upvotes": 33,
          "replies": {}
        },
        "ho0qzr8": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho0qzr8/",
          "text": "This. I’m in a class where the midterm was worth 25% of your grade and the final is worth 30%. We all cheat on it bc if we didn’t there’s just no possible way we would pass; also, she’s a horrible professor. Doesn’t answer any questions and says “refer to the slides” when her slides don’t make sense as it is. I really think if graded weren’t an issue, then there would 100% be less cheating than there is now. It’s shitty that grades and a GPA depict your future",
          "author": "sleepyyvirgo",
          "created": 1639162630,
          "upvotes": 22,
          "replies": {
            "ho4uglf": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho4uglf/",
              "text": "Not to be rude, but 25% and 30% are ridiculously percentages. Your professor is being extremely kind there and giving you lots of chances.",
              "author": "catfeinee",
              "created": 1639239234,
              "upvotes": 3,
              "replies": {
                "ho542th": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho542th/",
                  "text": "30% of our grade for the final? That’s generous? Our grade is literally based on testing which is complete and utter bullshit. I have a 95% and if I completely bomb the final I’ll leave the class with a 66%. That’s not realistic.",
                  "author": "sleepyyvirgo",
                  "created": 1639243283,
                  "upvotes": -1,
                  "replies": {
                    "ho549ct": {
                      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho549ct/",
                      "text": ".. most finals are 40-50%",
                      "author": "catfeinee",
                      "created": 1639243360,
                      "upvotes": 0,
                      "replies": {
                        "ho54c9j": {
                          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho54c9j/",
                          "text": "Nah I’ve never had a class where that was a thing lol",
                          "author": "sleepyyvirgo",
                          "created": 1639243394,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ho4vcl2": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho4vcl2/",
                  "text": "[removed]",
                  "author": null,
                  "created": 1639239622,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho1onen": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1onen/",
      "text": "Interesting how many Redditors see cheating as common. I saw some cheating, but it was mostly confined to the small-scale homework (the assignments which are often just busy-work anyways), as it can be hard to cheat on many in-person exams or on a paper and not get caught. I mostly resided in the humanities departments (and some social sciences) in college though, where grades were determined 1/4 by active participation and debate, and 1/4 each by a paper. Hard to cheat on participation and hard to cheat on papers. Usually, if someone had the drive to actually cheat on a major exam, the amount of time one spent coming up with a way to cheat could usually be better spent actually studying.\n\nWill you need to know everything in college for a job? Absolutely not, but college is more than trade school writ large. Cheating, and the mindset that if a job doesn't require it who cares, negates the unique knowledges college can provide. I will probably never need to know the Quantity Theory of Money for any job, but I am a much more informed human because I do.",
      "author": "DrAlawyn",
      "created": 1639176134,
      "upvotes": 19,
      "replies": {
        "ho1phan": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1phan/",
          "text": "I absolutely agree. The time you put into figuring out a way to cheat is more time you could be spending studying. You made some great points!",
          "author": "sleepyyvirgo",
          "created": 1639176476,
          "upvotes": 6,
          "replies": {}
        },
        "ho2e8or": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2e8or/",
          "text": "A big part is also whether or not you are looking for it. Once I started sort of subconciously being aware of it in highschool, I started seeing it WAY more. I have never snitched on anybody but it still isn't a great thing all the same, kind of wish I would stop noticing it in the first place lmao. And since my classes are all still online, I can only imagine how bad it has gotten over the last year.",
          "author": "As_Seen_on-TV",
          "created": 1639187344,
          "upvotes": 3,
          "replies": {}
        },
        "ho5fzhq": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho5fzhq/",
          "text": "Agreed! Is college supposed to teach you skills that you will use in a future career? Of course. But it’s also supposed to make you a well rounded, thinking person.",
          "author": "Business_Remote9440",
          "created": 1639248244,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho16e0t": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho16e0t/",
      "text": "Thats depend on assignment type. Exam? Absolutely No, but look for hw help, if you can't understand your prof explanation is ok.Hw purpose is to help student understand new material, not to check knowledge like exams.",
      "author": "smoked___salmon",
      "created": 1639168755,
      "upvotes": 37,
      "replies": {
        "ho16yps": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho16yps/",
          "text": "Agreed. For classes like accounting, however, I have written down formulas simply bc it’s unrealistic to memorize multiple formulas for multiple different things. You won’t be tested on that in the real world.",
          "author": "sleepyyvirgo",
          "created": 1639168983,
          "upvotes": 7,
          "replies": {
            "ho17ucz": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho17ucz/",
              "text": "I hate classes without formulas on the exams. My intro in linear algebra professor literally allows everything except internet on the exams, and I undertood this class much better than other classes which require memorizing. I would like to spend time understanding the class instead of memorizing it.",
              "author": "smoked___salmon",
              "created": 1639169328,
              "upvotes": 8,
              "replies": {
                "ho183dq": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho183dq/",
                  "text": "Exactly! I cannot tell you how many times I’ve had to memorize shit in classes rather than learn it. And you know what? I almost always passed the tests with an A. It’s all about grades rather than learning, and it’s sad",
                  "author": "sleepyyvirgo",
                  "created": 1639169424,
                  "upvotes": 4,
                  "replies": {
                    "ho1a6s4": {
                      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1a6s4/",
                      "text": "Imo for many majors is better to make a big projects instead of exams to check student knowledge, since it more looks like a real life problem. Students cant fully cheat on those projects and make good presentation without an effort.",
                      "author": "smoked___salmon",
                      "created": 1639170240,
                      "upvotes": 3,
                      "replies": {
                        "ho32obt": {
                          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho32obt/",
                          "text": "typically what happens is that the student pays some cheating service to do it for them. this is exactly what happens with college essays.",
                          "author": "wobbletelescope",
                          "created": 1639199147,
                          "upvotes": 2,
                          "replies": {
                            "ho337hx": {
                              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho337hx/",
                              "text": "Dang, I hate essays with all my soul, but I never tried to copy any of them.",
                              "author": "smoked___salmon",
                              "created": 1639199443,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho0r4nx": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho0r4nx/",
      "text": "I never liked it, but I used to do it anyways. I would often try to justify why I needed to cheat.\n\nBut now I just focus on learning the materials. If I know it, I’ll do well.",
      "author": "ErrorMessages",
      "created": 1639162684,
      "upvotes": 51,
      "replies": {
        "ho0s1mi": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho0s1mi/",
          "text": "I think everyone does at some point. Honestly I have learned more from cheating in the past (they show how to do the work on some problems) than I have in my past classes",
          "author": "sleepyyvirgo",
          "created": 1639163043,
          "upvotes": 3,
          "replies": {
            "ho2gosj": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2gosj/",
              "text": "This is a strange assumption. I always either tried to learn the material or fucked up and took the low grade, and I know there are many people like me.",
              "author": "plumcots",
              "created": 1639188459,
              "upvotes": 2,
              "replies": {
                "ho2hn66": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2hn66/",
                  "text": "Good for you. I know a lot of people that cheat and continue to cheat, however, I don’t condone it and learn the material as best as I can. But tbh if a few extra points on a homework assignment will allow me to pass a class & idk how to do it then I will probably cheat.",
                  "author": "sleepyyvirgo",
                  "created": 1639188896,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ho0tmov": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho0tmov/",
          "text": "Totally agree.",
          "author": "mike_dean_junior",
          "created": 1639163685,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ho260op": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho260op/",
      "text": "i don’t cheat but in regards to others, if it’s on something that’s not curved i don’t care you’re really just screwing yourself, but if you cheat on something that’s curved then you’re screwing with everyone else’s grade and that’s shitty",
      "author": "mojominn",
      "created": 1639183650,
      "upvotes": 7,
      "replies": {}
    },
    "ho1uswe": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1uswe/",
      "text": "College is supposed to teach you life skills. One of those skills is that you can't cut corners on the less important things. In the workplace it is noticed so starting the habit of cheating on less important classes will hurt you in the long run.",
      "author": "Blutrumpeter",
      "created": 1639178742,
      "upvotes": 5,
      "replies": {}
    },
    "ho124pk": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho124pk/",
      "text": "It's everywhere, you can't get away from it. I've been working on my BA for a few years (returning student, was PT for a while) and I still can't get over how much cheating goes on....and that was pre covid. There was a stupid simple project to put an income statement and balance sheet together, I say simple because the format and info was straight out of the book with pictures too! But my classmates were struggling with googling/chegging/quizlletting the exact answers. I know hardly anyone reads the book, but if they did, the solution was right there. \n\nOnce covid came around all this discussing came about anxiety levels and privacy concerns regarding proctored exams. Meanwhile in class group me/discords, it was all about faking anxiety and those other concerns to faculty so that they wouldn't use proctor software and the exam answers could be shared/used during g the exams. Yeah sure there were a lot of A's, but I was totally satisfied with my well earned B-.\n\nTo be clear, I'm not discounting that there are students with legitimate issues with anxiety, but I don't like how so many students took advantage of that. \n\nIt sucks, but it's life, cheating is out there. Good luck in real life though, because your thought process sometimes give you away.  I can start to see it in some of the other seniors I have class with during class discussions where you have to think on the spot.  \n\nTLDR: cheating is everywhere, but it'll hurt you down the road...so cliche. ikr.",
      "author": "Defrost_ThenStir",
      "created": 1639167086,
      "upvotes": 11,
      "replies": {
        "ho12wdq": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho12wdq/",
          "text": "No I totally agree! Even in high school, I was ALWAYS the ONLY one doing my work and literally all my “friends” would take it from me and start copying my answers. Let’s just say I was soft and didn’t know how to say no lol. When I did I would get called names and all that bullshit. But it’s ridiculous to cheat when, like you said, the answer is right there. It’s not only a waste of time but pointless. As for anxiety, I can understand that. And it sucks knowing people that don’t have it use that excuse to their advantage. It’s not fair to those who do have it. I have never had test anxiety, but ever since using lockdown browser for exams, I’ve had it critically. I just think at some point it’s inevitable to cheat in some cases, especially with really shitty professors. They’re supposed to help you learn and take in the material and some just don’t care enough.",
          "author": "sleepyyvirgo",
          "created": 1639167394,
          "upvotes": 5,
          "replies": {
            "ho14zmf": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho14zmf/",
              "text": "Oh yeah, people asking for your work still happens in college. The first time I might give the person the benefit of the doubt,, and help them out a bit.. But second time I start asking questions about how far they got, what are they stuck on, how much time they put into it, and then only offer them suggestions. That usually bites it in the ass real quick without just saying no to them.",
              "author": "Defrost_ThenStir",
              "created": 1639168205,
              "upvotes": 3,
              "replies": {
                "ho1687g": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1687g/",
                  "text": "I do that too… then it gets tiring. Like just do it yourself dude. I have saved so many peoples asses with grades",
                  "author": "sleepyyvirgo",
                  "created": 1639168691,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho24k0x": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho24k0x/",
      "text": "I feel like cheating is a waste of time that could have been spent actually learning. Open book take home exams have become much more common since covid and I think its the way to go. I guess some extra effort is needed to design exams that can’t be answered by copy pasting google search results.",
      "author": "Vast-Revenue-1098",
      "created": 1639183002,
      "upvotes": 3,
      "replies": {}
    },
    "ho28q56": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho28q56/",
      "text": "If a homework is graded for accuracy, cheating is basically required. I dont cheat on exams cuz I don’t wanna get fucked over but so many people do it that you basically get penalized for bot doing so",
      "author": "ThatsSoMerlyn_x3",
      "created": 1639184862,
      "upvotes": 5,
      "replies": {}
    },
    "ho2s6el": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2s6el/",
      "text": "Honestly, there are some Professors that are horrible. Just this semester I had an experience with a professor from hell. The entire class had a shared study guide and we all used that for all our tests. She didn’t even teach… we needed to contact the psychology chair so she could record our lectures again. (The entire class was remote and asynchronous)",
      "author": "DepressyFanficReader",
      "created": 1639193782,
      "upvotes": 4,
      "replies": {}
    },
    "ho1aw2l": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1aw2l/",
      "text": "For exams and stuff I think it’s bad. You signed a paper sometime, somewhere, saying you wouldn’t do it. To me it’s just about keeping your word. \n\nHowever - for assignments and homework and stuff I have no problem with anyone exploiting the gray area to help each other out. I think everyone should give an assignment the old college try before seeking help but help is valid.",
      "author": "Diligent_Pangolin178",
      "created": 1639170514,
      "upvotes": 16,
      "replies": {
        "ho1dt6k": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1dt6k/",
          "text": "Understandable! Helping each other with homework isn’t cheating to me in the slightest. I had past teachers in high school that would get pissed if you did the homework together, which never made sense to me",
          "author": "sleepyyvirgo",
          "created": 1639171681,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ho1zvqc": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1zvqc/",
      "text": "I’ve found that cheating is two things. Number one, cheating is morally wrong. Number two, cheating only comes back to bite you in the rear end later down the road, and for the most part the truth always finds it’s way the surface. A college/university can and will revoke your degree/certification if they find evidence that you have cheated. Even years/decades later. Your best bet is to invest more time into the topic and actually study. It’s easier said than done but you’ve got this don’t cheat and don’t give up!",
      "author": "shitshow_420",
      "created": 1639180942,
      "upvotes": 8,
      "replies": {}
    },
    "ho1tdze": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1tdze/",
      "text": "There’s no point in cheating in college. The whole point of college is to learn critical thinking and work through issues. If you’re cheating you’re not really learning or improving your skills. People who cheat see college as a way to get a degree rather than a way better themselves.",
      "author": "ender7887",
      "created": 1639178144,
      "upvotes": 7,
      "replies": {
        "ho2gf7x": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2gf7x/",
          "text": "Who goes to college to better themselves other than trust fund kids? \n\nIm in engineering and every single one of my peers is here for the degree, because we know you need a job to survive and would rather be a priveledged worker if anything else.",
          "author": "Affectionate-One5180",
          "created": 1639188339,
          "upvotes": 9,
          "replies": {
            "ho30iy5": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho30iy5/",
              "text": "I did, and I grew up poor, from a single mom, and a Hispanic immigrant community. I am using my degree for my career too.\n\nYour peers are probably saying that because being an engineering major is like the new nursing major: everyone hears about the money, thinks they can become one, so they major in it and end up hating it.",
              "author": "GhostlyMuse23",
              "created": 1639197992,
              "upvotes": 5,
              "replies": {}
            },
            "ho2h8na": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2h8na/",
              "text": "This 100%. The system puts too much emphasis in grades if what they truly wanted was for students to “better” themselves lol",
              "author": "spicyystuff",
              "created": 1639188710,
              "upvotes": 7,
              "replies": {
                "ho31vjj": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho31vjj/",
                  "text": ">The system puts too much emphasis in grades if what they truly wanted was for students to “better” themselves lol\n\nThis might be true in the STEM field, but, from my experience, this wasn't true in the Humanities field. Essays were evaluated based on how I responded to the prompt.",
                  "author": "GhostlyMuse23",
                  "created": 1639198712,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "ho21e2k": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho21e2k/",
          "text": "Maybe it’s the system that is messed up.",
          "author": "nathani3l0g",
          "created": 1639181610,
          "upvotes": 5,
          "replies": {}
        },
        "ho4b96k": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho4b96k/",
          "text": "yeah sorry but I'm not paying 50k to better myself. I'm paying 50k to become a licensed Healthcare worker...",
          "author": "postyswife2",
          "created": 1639230004,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "ho1ytw0": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1ytw0/",
      "text": "I’m using university/college as more a tool to test myself and grow good habits. Of course I want a good grade, but I’d rather build skills at I can utilize outside the classroom to help me after grad.",
      "author": "kantian_noodle",
      "created": 1639180488,
      "upvotes": 3,
      "replies": {}
    },
    "ho24wnh": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho24wnh/",
      "text": "My opinion is people shouldn’t do it and you should try to be as honest as possible. I hate to sound like a cliche but really, the only person you’re cheating is yourself.",
      "author": "cody_d_baker",
      "created": 1639183159,
      "upvotes": 3,
      "replies": {}
    },
    "ho2tdk4": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2tdk4/",
      "text": "I used to be a cheater. I'm not anymore though. It's not worth it- I'd rather struggle and make a subpar gpa than cheat & worry. I have to make sure my class schedule is bearable though & I withdraw from classes when I'm desperately struggling.",
      "author": "Positive-Court",
      "created": 1639194363,
      "upvotes": 3,
      "replies": {}
    },
    "ho4g3jt": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho4g3jt/",
      "text": "I would rather have my grade tank than cheat… I just can’t justify it to myself.",
      "author": "Sambbradford",
      "created": 1639232520,
      "upvotes": 3,
      "replies": {}
    },
    "ho1dk8n": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1dk8n/",
      "text": "Why the fuck would you pay to be educated and then cheat?",
      "author": "BananaKuma",
      "created": 1639171581,
      "upvotes": 9,
      "replies": {
        "ho5geip": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho5geip/",
          "text": "Because some people aren’t paying for an education. They’re paying for the piece of paper that will help them get a job",
          "author": "MakinBaconPancakezz",
          "created": 1639248424,
          "upvotes": 5,
          "replies": {}
        },
        "ho1dnv9": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1dnv9/",
          "text": "Because some professors don’t care and don’t bother to educate you. It’s all about the grades and getting the degree, unfortunately.",
          "author": "sleepyyvirgo",
          "created": 1639171621,
          "upvotes": 1,
          "replies": {}
        },
        "ho26zqe": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho26zqe/",
          "text": "Lots of white college collar jobs that shouldn’t require a degree, now require a degree. Blame it on that.",
          "author": "NoSpaceAlien",
          "created": 1639184082,
          "upvotes": 2,
          "replies": {}
        },
        "hodt4lm": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/hodt4lm/",
          "text": "I completely understand your point and it is valid. \n\nBut I think it‘s worth considering that there can be situations where you will get a failing grade despite having mastered the material due to circumstances out of your control. \n\nFor example, if a course requires a 20-30 page paper, you will have to put in a lot of time and energy, regardless of how well you know the subject, which you may not have if you faced some personal issues (e.g. death of a family member, depression, eviction), especially if profs and administration refuse to support you. \n\nIn this situation, if that circumstance would greatly set you back financially and career-wise, I feel cheating would be morally justified and honestly also a moral responsibility to oneself.",
          "author": "Uncommented-Code",
          "created": 1639406515,
          "upvotes": 1,
          "replies": {}
        },
        "ho2z4iw": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2z4iw/",
          "text": "Because many programs require classes you will not use and aren't interested in. I didn't cheat but I sure don't blame those who do after how much I hated this term.",
          "author": "Sendhentaiandyiff",
          "created": 1639197254,
          "upvotes": -3,
          "replies": {}
        }
      }
    },
    "ho26r3p": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho26r3p/",
      "text": "This was my time in undergrad: everybody cheated, but were smart enough to not: get caught or overdo it",
      "author": "Chowder1054",
      "created": 1639183974,
      "upvotes": 2,
      "replies": {}
    },
    "ho20sph": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho20sph/",
      "text": "A lot of people cheat. I don’t think it’s wrong. GPA is what people worry about. They want to do anything so that their Gpa remains competitive for programs and masters and scholarships. Most people cheat now because they want to inflate their grades. It’s not about no studying at all. It’s more about studying and using aid so that their grades are higher rather than completely being lazy and cheating the entire exam. I think if you don’t study at all that is a problem. However, if you want to use aid to fill in the gap of information you didn’t study well, then it is fine. That will get you from an B+ grade to an A grade. You still passed the exam, but your grade is inflated. That’s just the consequence of grades and high expectations.",
      "author": "nathani3l0g",
      "created": 1639181346,
      "upvotes": 6,
      "replies": {
        "ho50j5a": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho50j5a/",
          "text": "Yeah, it's true that people cheat and that it's hard to stop it. But do you seriously condone it? GPA cutoffs are there for a reason, if the person doesn't have the aptitude to hit it, they don't get through. How can you say that cheaters who undermine the reputation of a college aren't wrong? I think they should be suspended for at least 3 years on the 1st offense (2nd offense for accidental plagiarism and 1st offense for intentional plagiarism).\n\nIf you think that your college has poor assessment (which don't get me wrong is absolutely rife), then transfer to a different institution where faculty actually care.",
          "author": "thegodofeverydamn",
          "created": 1639241796,
          "upvotes": 3,
          "replies": {
            "ho5eddn": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho5eddn/",
              "text": "[deleted]",
              "author": null,
              "created": 1639247560,
              "upvotes": 0,
              "replies": {
                "ho5nq2c": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho5nq2c/",
                  "text": ">It’s just school and not that serious.\n\nIf this is the attitude that you or someone else employs, why does that person even attend any reputable institute? That's called being entitled. You're doing so many people, people who's grades may have actually reflected their passion and understanding for the subject, a complete disservice. People like you are why universities have gone to such shit over the past decades. They accept this apathetic attitude themselves. By playing this game you're playing, you're driving society's failings and pushing bright and talented people out of your university.\n\nBy right, it's extremely serious to cheat in college as you're being dishonest of your academic ability. Do you think that professors should be allowed to plagiarise their research? Cause if not, I don't see why you'd think grade manipulation is okay.",
                  "author": "goodluck907",
                  "created": 1639251541,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho1qlww": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1qlww/",
      "text": "As somebody that works with doctors, itll surprise you. Not discrediting them, but there is a lot of research they do on the job. So I say, why can't we use the internet? Its literally on us.",
      "author": "guy_with-thumbs",
      "created": 1639176947,
      "upvotes": 2,
      "replies": {
        "ho4b3id": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho4b3id/",
          "text": "I'm in a disease and physiology class right now where the prof let's everything be \"open book\" his reasoning is that if you don't know something on the job, you look it up. so when I look things up for tests and what not I don't know if I'm cheating or not because he's technically allowing it .. but then he Says don't cheat .. like what's cheating then????",
          "author": "postyswife2",
          "created": 1639229917,
          "upvotes": 1,
          "replies": {
            "ho4t83d": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho4t83d/",
              "text": "Copying someone else?",
              "author": "guy_with-thumbs",
              "created": 1639238682,
              "upvotes": 1,
              "replies": {
                "ho7dq2g": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho7dq2g/",
                  "text": "it's an online class",
                  "author": "postyswife2",
                  "created": 1639280423,
                  "upvotes": 2,
                  "replies": {
                    "ho7g5q5": {
                      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho7g5q5/",
                      "text": "Oh, I was just stating what cheating would be if you were able to look up answers online. Be pretty hard to copy someone else.",
                      "author": "guy_with-thumbs",
                      "created": 1639281648,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho2iz12": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2iz12/",
      "text": "Been cheating since day 1 and don't regret it. Now i have a 3.6 gpa and graduating a semester early. Thanks online classes. Also, college is a gamble. If i don't cheat i have the possibility of failing my classes and dropping out. I'd rather be known as a cheater than be a failure aka college drop out.",
      "author": "milk690",
      "created": 1639189500,
      "upvotes": 4,
      "replies": {
        "ho2j1uv": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2j1uv/",
          "text": "What’s your major?",
          "author": "sleepyyvirgo",
          "created": 1639189537,
          "upvotes": 1,
          "replies": {
            "ho2jnej": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2jnej/",
              "text": "I don't want to give out too much information because i'm not sure someone will snitch on me. But i'm majoring in liberal arts. Something close to philosophy.",
              "author": "milk690",
              "created": 1639189808,
              "upvotes": 0,
              "replies": {
                "ho2jsty": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2jsty/",
                  "text": "Ohhhh okay okay. I doubt anyone will even know who you are let alone snitch on you. Your name on here is milk my guy",
                  "author": "sleepyyvirgo",
                  "created": 1639189877,
                  "upvotes": 1,
                  "replies": {
                    "ho2lb5b": {
                      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2lb5b/",
                      "text": "Ya I don't want to encourage cheating but you have to realize students who do it are in a desperate situation. for example, before online classes and covid. I was in community college failing multiple classes like calculus. My GPA was literally a 2.2 and if i had failed one more class they would have put me on academic probation and i would have lost my financial aid. Then when the pandemic hit and online classes came rolling. I took advantage with sites like chegg and multiple tabs. I just want to graduate, get my degree, and pay off my 30,000 dollars of student debt. Not to mention in the asian community. Dropouts are seen as morons and are often shamed.",
                      "author": "milk690",
                      "created": 1639190566,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ho2dztg": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2dztg/",
      "text": "I think it depends. For example if your a CS major then you should try not to cheat in your CS classes. But other easy classes unrelated to your major go ahead. Because you won’t need your other classes like chem, sociology or some other random class you had to take just to fill a requirement. People in CS jobs use absolutely zero chemistry, sociology etc.\n\n The reason I don’t recommend cheating is because it has a compound effect. If you start cheating in your CS class for example you may get used to cheating and solely relie on other peoples work. Which means you won’t be learning and future classes will be hard af if not impossible to complete. \n\nTldr: Only cheat on the easy classes in your first two years at college that are unrelated to your major. If your a CS major then go ahead and cheat in your history, sociology etc classes that you don’t need on the job.",
      "author": "National_Ad_1872",
      "created": 1639187235,
      "upvotes": 2,
      "replies": {}
    },
    "ho0qeyv": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho0qeyv/",
      "text": "Usually with stiff like Comp Sci a cheater makes a better professional. Now idk about economics ig it's about what you wanna do like stock trading just go to WSB&Kamikaze Cash and for Fin Advice go to Dave Ramsey. But like large scale stuff you're gonna need college.",
      "author": "JohmasWitness",
      "created": 1639162404,
      "upvotes": 1,
      "replies": {
        "ho0r5yu": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho0r5yu/",
          "text": "How do you think it makes a better professional? But I can understand that 100%. I feel like a lotttt of the shit you learn is bullshit though",
          "author": "sleepyyvirgo",
          "created": 1639162697,
          "upvotes": 2,
          "replies": {
            "ho10baw": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho10baw/",
              "text": "Professional programming is a combination of writing your own code, but also to save time you generally recycle code that other people have written — “don’t reinvent the wheel”. Closed-book tests therefore are *really* not representative of reality, even less so than in many other subject areas.",
              "author": "AceyAceyAcey",
              "created": 1639166362,
              "upvotes": 11,
              "replies": {}
            },
            "ho0rj28": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho0rj28/",
              "text": "Well with programming&cyber security your actual job will require you to know where to Google and what exactly to find and modify/apply to your current issue, cheating promotes this. Like college for anything in Comp Sci feild is a waste and you end up in the same place as someone who didn't but just kinda liked it as a hobby",
              "author": "JohmasWitness",
              "created": 1639162840,
              "upvotes": 1,
              "replies": {}
            },
            "ho34iyv": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho34iyv/",
              "text": "it does not because someone had to write that code that they're copying, and who's going to do it? a cheater who can't write their own code? one day (one day out of the thousands they will work) they're going to have a problem that nobody's ever programmed the solution for, and they'll be screwed because they can't write code, only copy.\n\nemployers dont just want people that are efficient, they also want people that are competent.",
              "author": "wobbletelescope",
              "created": 1639200176,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ho2ccbv": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2ccbv/",
      "text": "In all honesty I have cheated multiple times and would do it again if it meant getting a good grade. There was a point in college where I realized the amount of work I was getting was too much to do legitimately so I started just prioritizing the final grade by any means necessary. The ends justified the means, in my eyes. I’m not proud of this but the slight guilt I get from cheating is nowhere near the pain I would have experienced from failing classes. Unless you’re in a very specific degree such as law or medicine, half the classes you take in college are nowhere near crucial to your education and are more or less taken to satisfy a gen Ed requirement. Cheating isn’t cool and there are certainly very real consequences to it, but it’s also pretty damn easy to get away with so long as you’re not a belligerent fool about it. I guess we all have different morals and some people may think I’m a scumbag, but at the end of the day I got my piece of paper that said I did all the stuff and that’s all I really gave a fuck about once college started getting really grindy.",
      "author": "MidwestSpecial",
      "created": 1639186488,
      "upvotes": 2,
      "replies": {}
    },
    "ho1wjx1": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1wjx1/",
      "text": "If you ain’t cheating you ain’t trying.\n   - high school history teacher",
      "author": "Musclemanic003",
      "created": 1639179499,
      "upvotes": 1,
      "replies": {
        "ho22gdq": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho22gdq/",
          "text": "Bruh my high school AP human geography teacher knew everyone cheated. He was supposed to use a software that you can see through the school computers while taking an exam. However, I don’t think he ever used it.  I used to just put my laptop on airplane mode while taking the exam. I would pull out quizlet and everything was on the test bank which was so nice because I just searched all of it up. When you look out the corner of your eyes, you can see people using quizlet and googling stuff. Everyone admitted to cheating in the class even the smartest people that I knew. It was obvious he didn’t care because he never read our papers. I wrote fuck your bitch on one of my assignments and did not hear a single word from him.",
          "author": "nathani3l0g",
          "created": 1639182075,
          "upvotes": 1,
          "replies": {
            "ho345h8": {
              "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho345h8/",
              "text": "people like your high school teacher are part of the reason why nobody takes high school diploma seriously anymore, though i might also crack if i had a principal and hundreds of parents pressuring me to pass their kid.",
              "author": "wobbletelescope",
              "created": 1639199967,
              "upvotes": 2,
              "replies": {
                "ho38py4": {
                  "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho38py4/",
                  "text": "Oh yeah my teacher he wanted everyone to pass so they didn’t have to retake so for one of the final exams the answers were all A for multiple choice. Some of my teachers I had missing assignments but they did not give me a zero, instead they just didn’t put any points into the assignment so it was ignored. I love high school so much. Those times were easier and way less stressful.",
                  "author": "nathani3l0g",
                  "created": 1639202636,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ho2m4ri": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2m4ri/",
      "text": "Do what u gotta do to get that degree",
      "author": "BigDick115",
      "created": 1639190941,
      "upvotes": 1,
      "replies": {}
    },
    "ho1ba9z": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1ba9z/",
      "text": "In my opinion, unless every single bit of knowledge is absolutely vital for you to learn, then I think if you are smart enough to cheat your way through the class and get away with it then you deserve the grade",
      "author": "Accurate-Bluebird-43",
      "created": 1639170675,
      "upvotes": 0,
      "replies": {}
    },
    "ho2ehvt": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2ehvt/",
      "text": "I don’t care if others cheat. That’s their risk not mine",
      "author": "Amxricaa",
      "created": 1639187458,
      "upvotes": 1,
      "replies": {}
    },
    "ho2q1m8": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho2q1m8/",
      "text": "Having online tests w/ no supervision was basically an invitation to google stuff I didn’t know or look at notes.",
      "author": "REEEEEEEEEEE_OW",
      "created": 1639192761,
      "upvotes": 1,
      "replies": {}
    },
    "ho1y9dj": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1y9dj/",
      "text": "I don’t see a problem with it all tbh. I’m about to graduate in a few weeks with a BS and I won’t say I cheated in every course because not are all applicable but if you think everyone else isn’t then boy can I tell you something. I tried my best in my core classes and would study but I would never let myself fail. Electives? Who gives a shit man get the A. If you cheat in your core classes then you need to make up for it when it comes time to start interviewing. I recently landed an 85k base salary software Dev position in the Midwest and it was all from internship experience since most of my coursework was the bare basics and hardly beneficial. Obviously it depends on your major and line of work so it all’s situational. Just my opinion",
      "author": "yaboigooster",
      "created": 1639180239,
      "upvotes": 0,
      "replies": {}
    },
    "ho1hdmn": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1hdmn/",
      "text": "[removed]",
      "author": null,
      "created": 1639173122,
      "upvotes": 1,
      "replies": {}
    },
    "ho3f99q": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho3f99q/",
      "text": "[removed]",
      "author": null,
      "created": 1639207004,
      "upvotes": 1,
      "replies": {}
    },
    "ho4aq07": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho4aq07/",
      "text": "my one professor makes every test and homework assignment open book. it's kind hard not to cheat when he makes it that easy. and you can take all homework assignments as many times as you like until you get them all right.",
      "author": "postyswife2",
      "created": 1639229713,
      "upvotes": 1,
      "replies": {}
    },
    "ho4wdnw": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho4wdnw/",
      "text": "I think colleges are cheating you and your parents.",
      "author": "PracticalPractice732",
      "created": 1639240062,
      "upvotes": 1,
      "replies": {}
    },
    "ho5001l": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho5001l/",
      "text": "It would be perfectly fine if professors put more time/effort into ensuring that grades actually reflect mastery. Many don't in my experience (though I do know a few that do a good job). This completely undermines the goals of the class. Grades are handy because they provide a more transparent way of seeing how well you know something. Grades should reward \"bettering oneself\", they should reward going beyond the class syllabus and reading up/researching things that you found interesting. They should reward excellent comprehension of the material, ambition, dedication and research skills. If professors put more effort into giving higher quality assessments (like challenging exams, big projects/research tasks) then grades would align with the goal of getting students to \"better\" themselves.  \n\nIt's very hard to do this with a large class size unfortunately. For large class sizes, it would be better to have one big test or research project worth 100% of the grade as it reduces the amount of grading that professors have to do. \n\nThis is not me going after professors being \"lazy\". They have an insurmountable amount of other work to do. I just feel that high quality assessment should be rewarded far more in teaching than it currently is, given how important it is to stimulate learning.",
      "author": "thegodofeverydamn",
      "created": 1639241576,
      "upvotes": 1,
      "replies": {}
    },
    "ho58kr4": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho58kr4/",
      "text": "I don’t do it because if I get caught my grad school dreams would die, but I don’t think there’s anything wrong with it. Students are asked at 18 years old to figure out what they want to do and go into thousands of dollars of debt for it. Then they’re told if they do badly in classes that may not even pertain to their end goal in life all that debt and time is wasted. Modern day college has nothing to do with integrity or learning critical thinking skills - it’s a business transaction. Nothing irritates me more than when professors bring it up as an integrity issue, meanwhile school is raising tuition every year, all the stores on campus insanely up charge their food, and that same professor makes you buy his $200 textbook that you use twice. For some reason it’s less frowned upon to walk all over a bunch of 18 year olds than it is to be freaked out and cheat so you don’t fail a course.",
      "author": "Sweet_Coffee4823",
      "created": 1639245170,
      "upvotes": 1,
      "replies": {}
    },
    "ho1onm8": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1onm8/",
      "text": "[removed]",
      "author": null,
      "created": 1639176136,
      "upvotes": -6,
      "replies": {
        "ho1oy80": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1oy80/",
          "text": "I think you got the wrong thread buddy……",
          "author": "sleepyyvirgo",
          "created": 1639176261,
          "upvotes": 9,
          "replies": {}
        },
        "ho1zwhl": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho1zwhl/",
          "text": "I need to know more",
          "author": "doshi333",
          "created": 1639180951,
          "upvotes": 2,
          "replies": {}
        },
        "ho21kv4": {
          "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho21kv4/",
          "text": "Copypasta",
          "author": "nathani3l0g",
          "created": 1639181693,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ho5nhot": {
      "link": "/r/college/comments/rdfkyq/what_do_you_guys_think_about_cheating_in_college/ho5nhot/",
      "text": "It depends on if it’s related to my major or not. If it’s just a regular Gen Ed and the professor makes the class unnecessarily hard, I will cheat. If it’s for my major, I actually want to learn it because I find it interesting and will need it for my job.",
      "author": "rynaco",
      "created": 1639251438,
      "upvotes": 0,
      "replies": {}
    }
  }
}