{
  "sid": "qqqofc",
  "link": "/r/college/comments/qqqofc/can_i_flunk_for_being_sick/",
  "title:": "Can I flunk for being sick?",
  "text": "So, over this past weekend i developed a gross cough which has developed into very intense symptoms, leaving me up all night wheezing and coughing for the past 3 days. I’ve also had constant migraines, and even a few bloody noses. I am almost positive I have bronchitis. I have been so tired and miserable that I have emailed my professors 3 days in a row to tell them I cannot make it. The policy for my school is you can only miss 4 days a semester. I have already missed 2 days before this but I was told I can make up my labs. This is genuinely the most sick I’ve been in years, I always make sure to email my professors extremely early to let them know I am still sick and have been trying to get to my campus health office (they have very limited hours). Can I be potentially failed because of these absences even if I do the work? I get extremely anxious thinking about this and need some advice. Thanks.",
  "author": "Maleficent_Onion_932",
  "created": 1636537000,
  "updated": 1636655161,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hk1uard": {
      "link": "/r/college/comments/qqqofc/can_i_flunk_for_being_sick/hk1uard/",
      "text": "You may have Covid, and yes you can fail if the school/class policy says 4-days is the max you can miss.",
      "author": "WCCobra",
      "created": 1636538261,
      "upvotes": 10,
      "replies": {
        "hk2c0g3": {
          "link": "/r/college/comments/qqqofc/can_i_flunk_for_being_sick/hk2c0g3/",
          "text": "Agree, you should absolutely get tested if you haven't already",
          "author": "biggestbaddestnerd",
          "created": 1636550440,
          "upvotes": 4,
          "replies": {}
        },
        "hk2viz4": {
          "link": "/r/college/comments/qqqofc/can_i_flunk_for_being_sick/hk2viz4/",
          "text": "If there unexcused absences then yeah but most prof. excuse you for being sick",
          "author": "cheesynachoman",
          "created": 1636559066,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hk20fb9": {
      "link": "/r/college/comments/qqqofc/can_i_flunk_for_being_sick/hk20fb9/",
      "text": "You should probably contact your school and ask them honestly. I would assume that the four day limit just means normal circumstances, that would be ridiculous if someone got into a car wreck and missed a week due to injury and had to fail for example.",
      "author": "Sermos5",
      "created": 1636543304,
      "upvotes": 5,
      "replies": {}
    },
    "hk2usxt": {
      "link": "/r/college/comments/qqqofc/can_i_flunk_for_being_sick/hk2usxt/",
      "text": "Find an urgent care center in your area. They're staffed by healthcare providers and many don't require an appointment. Get a \"doctor's note\" so you can be excused from school long enough to recover.\n\nMy university requires students who are ill to be excused from classes for a certain period of time.",
      "author": "Comprehensive-Ad3963",
      "created": 1636558795,
      "upvotes": 2,
      "replies": {}
    },
    "hk3jn4w": {
      "link": "/r/college/comments/qqqofc/can_i_flunk_for_being_sick/hk3jn4w/",
      "text": "I'd look up what your dean of students office says about absences due to illness this semester. Many have modified policies. At mine, you're supposed to notify the Dean of Students office of absences over one week, and they log it and notify the professor.",
      "author": "mmarkDC",
      "created": 1636568483,
      "upvotes": 1,
      "replies": {}
    },
    "hk4mpeb": {
      "link": "/r/college/comments/qqqofc/can_i_flunk_for_being_sick/hk4mpeb/",
      "text": "Don’t wait around on the colleges healthcare system. They’re all useless. Hit an urgent care and get treated asap.",
      "author": "Parking_Cranberry935",
      "created": 1636583748,
      "upvotes": 1,
      "replies": {}
    }
  }
}