{
  "sid": "q3z7zi",
  "link": "/r/college/comments/q3z7zi/how_to_stay_focused_for_8hrs_of_school_lessons/",
  "title:": "how to stay focused for 8hrs of school lessons",
  "text": "I'm on my first year of med school (in Italy) and i have to take lessons from 9.00 to 13.00 and from 14.00 to 18.00 every single day except Saturday and Sunday. How tf am i supposed to mantain attention all these hours :(((.\n\npls don't just say \"adderall\" like all the answers I received on r/medschool :/",
  "author": "Ildebrandon",
  "created": 1633704345,
  "updated": 1634083177,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hfuyuai": {
      "link": "/r/college/comments/q3z7zi/how_to_stay_focused_for_8hrs_of_school_lessons/hfuyuai/",
      "text": "I think those Colombian peeps might just have the substance for your predicament 👀",
      "author": "PutSimply1",
      "created": 1633704516,
      "upvotes": -3,
      "replies": {}
    },
    "hfvmymf": {
      "link": "/r/college/comments/q3z7zi/how_to_stay_focused_for_8hrs_of_school_lessons/hfvmymf/",
      "text": "Mr.happy stack is based off souvenaid, a treatment to Alzheimer’s in Australia, helps with focus and motivation while still being good for your brain in the long run. Could also try eating healthier, keto helps my concentration tremendously once I’m in ketosis(my version includes lean meat and lots of monounsaturated fats), improve your quality of sleep and make sure your getting enough of it (things like sleep masks, ear plugs, valerian root/lemon balm/ magnesium glycinate help), meditation helps if your struggling with stress which can lead to adrenal fatigue or ashwaganda could help which regulates gaba and cortisol, hydration, water soluble vitamins like Bs, electrolyte balance are all incredibly important for energy levels. Lastly mindset, having a growth mindset vs a fixed mindset for example is beneficial, mindset by carol s. Dweck is a good read for this, also the book atomic habits by James clearwould make these transitions easier.. also make sure you take small breaks otherwise you’ll get burnt out, every 30 minutes or so take a 5 minute break.",
      "author": "Alternative_Global",
      "created": 1633714602,
      "upvotes": -1,
      "replies": {}
    }
  }
}