{
  "sid": "q7uplm",
  "link": "/r/college/comments/q7uplm/im_a_junior_in_a_secondary_english_education/",
  "title:": "I'm a junior in a Secondary English Education program and the amount of essays is just completely ruining my passion for reading and writing.",
  "text": "I'm burned out beyond belief. I have written what is probably the equivalent of three or four books at this point and it's leaving me doubting my degree choice. I have a huge passion for science but my math skills are abyssal so I'd probably find myself in the same situation anyways. Has anyone else encountered this? It's horrendously painful and I'm just trying to claw through these last three semesters of work...",
  "author": "Impressive-Fix8903",
  "created": 1634196301,
  "updated": 1639853328,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hglb2yl": {
      "link": "/r/college/comments/q7uplm/im_a_junior_in_a_secondary_english_education/hglb2yl/",
      "text": "Yes the reading and writing burns you out.\n\nI took a speed reading course that helped me get through texts faster. It cost a couple hundred bucks but was worth the tips. \n\nYou do not have to read everything. \n\nLet's say your American modernism class assigns three texts to be read within first month, and then you write an essay covering one of them. You have to prioritize--there may not be time to read every word of every text.",
      "author": "ObjectiveAnalysis643",
      "created": 1634203166,
      "upvotes": 2,
      "replies": {}
    },
    "hgljeq1": {
      "link": "/r/college/comments/q7uplm/im_a_junior_in_a_secondary_english_education/hgljeq1/",
      "text": "My English class is English 101 and I swear I we have 4 800-1000 word essays and he gives so many assignments per week it is utterly ridiculous. And I can't understand how someone would want to read so many essays & assignments but I guess this is why he became an English professor",
      "author": "TragicalKingdom",
      "created": 1634210082,
      "upvotes": 3,
      "replies": {}
    },
    "hmvjnyi": {
      "link": "/r/college/comments/q7uplm/im_a_junior_in_a_secondary_english_education/hmvjnyi/",
      "text": "Probably that is happening in the English classes and not the education ones. Know that when you get into the meat of the education side, it comes alive!",
      "author": "TravelFlaky8107",
      "created": 1638409379,
      "upvotes": 1,
      "replies": {
        "hmvjpy4": {
          "link": "/r/college/comments/q7uplm/im_a_junior_in_a_secondary_english_education/hmvjpy4/",
          "text": "I’m an English teacher educator for context",
          "author": "TravelFlaky8107",
          "created": 1638409403,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}