{
  "sid": "pwxk19",
  "link": "/r/college/comments/pwxk19/got_a_d_on_my_college_assignment/",
  "title:": "Got a D on my college assignment",
  "text": "Isn’t it fun when you put hours of effort and passion into an essay thinking you’re going to get an A or B but end up getting a D? \nIt’s so annoying. My professor tells me that my essays are well written but I’ve failed some of them because I didn’t indent (I guess using the tab key is wrong now) my paragraphs the way he wanted or I didn’t put a period in the right places when citing my sources.\nLike I know this is my fault for failing, but it’s so annoying because I’m trying my best at writing and I think my work is really strong yet I fail because of some minor grammar mistakes.\n\nI think it’s insane that my grammar is more important than what I’m actually writing but whatever.\nI expected this first year seminar class to be a lot better.\n\nI’m so angry at myself.",
  "author": "Mirror_Opposite",
  "created": 1632799540,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 1.0,
  "comments": {
    "hekpdwd": {
      "link": "/r/college/comments/pwxk19/got_a_d_on_my_college_assignment/hekpdwd/",
      "text": "Failing you for that is extreme. Taking off a point or two, sure. I’ve never known a prof to do this. That being said, you probably can’t change the professor’s preferences, so just remember to format correctly in the future.",
      "author": "ctrldwrdns",
      "created": 1632820105,
      "upvotes": 3,
      "replies": {}
    },
    "hekp97g": {
      "link": "/r/college/comments/pwxk19/got_a_d_on_my_college_assignment/hekp97g/",
      "text": "[removed]",
      "author": null,
      "created": 1632819983,
      "upvotes": 1,
      "replies": {}
    },
    "hekjbdq": {
      "link": "/r/college/comments/pwxk19/got_a_d_on_my_college_assignment/hekjbdq/",
      "text": "Why don't you try assignment writing service..for eg.\n[Assignment desk](https://www.assignmentdesk.co.uk)",
      "author": "naomi_wilson",
      "created": 1632814414,
      "upvotes": -2,
      "replies": {}
    },
    "hek38yu": {
      "link": "/r/college/comments/pwxk19/got_a_d_on_my_college_assignment/hek38yu/",
      "text": "I teach first year writing at a university. I will start by saying, formatting, grammar, punctuation and mechanics are things you shouldn't neglect. They are ways you show you know the genre in which you're writing, in this case, academic writing.\n\nThat being said, giving a student a D on a piece of writing with the only feedback being fixing grammar stuff is absurd, unless the grammar was so bad the essay wasn't readable (this doesn't sound like the case with you).\n\nMy advice is to go to your university's writing center, and have them help you with formatting and mechanics. Also, you now know how much value your professor puts on these aspects of writing. Part of learning to write in college is learning to write for an audience. Each of your professors will want something different. Pay attention to what they value, so you can write better for them. This is a skill that will help you far beyond college.",
      "author": "Coloradical27",
      "created": 1632802749,
      "upvotes": 12,
      "replies": {}
    },
    "hejyx8z": {
      "link": "/r/college/comments/pwxk19/got_a_d_on_my_college_assignment/hejyx8z/",
      "text": "Next time after you write your paper, take it to the college writing center or lab (if you have one) and they will help you proofread it so that you don’t get points taken off for things like that. Also as far as the indentation goes, does your professor have a rubric with the exact margins that he wants you to use? If so that’s on you, if not I would take issue with it. \n\nGrammar is really important. It’s college. This is a higher level of learning; you either buy into it or you don’t.",
      "author": "auntiepirate",
      "created": 1632800270,
      "upvotes": 32,
      "replies": {}
    }
  },
  "updated": 1634051330
}