{
  "sid": "rfaag7",
  "link": "/r/college/comments/rfaag7/im_really_scared_i_already_walked_the_stage_for/",
  "title:": "Im really scared. I already walked the stage for college graduation but I am unsure if I failed a class or not",
  "text": "I have been in college for 6 years already and my parents have been waiting for me to finish. I applied for graduation this semester and got to walk the stage but they dont actually give you that piece of paper until the grades come out. This one class , the teacher had a point system set up but he cut out some homework and quizzes which changed up the points but I have no idea how that is now. I walked the stage, cried with my parents, got told they were proud of me and even got a celebratory dinner.  Now I am super scared and dont know what to do if I didnt pass this class.. UGH God im so scared",
  "author": "iamyiyaj",
  "created": 1639381109,
  "updated": 1639516152,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hod4mvf": {
      "link": "/r/college/comments/rfaag7/im_really_scared_i_already_walked_the_stage_for/hod4mvf/",
      "text": "Clench your ass and wait. I’m sure you did well anyways!",
      "author": "maora34",
      "created": 1639391491,
      "upvotes": 2,
      "replies": {
        "hoe9l5n": {
          "link": "/r/college/comments/rfaag7/im_really_scared_i_already_walked_the_stage_for/hoe9l5n/",
          "text": "I emailed the professor and he updated a grade for me which in turn made me get a C which is passing!",
          "author": "iamyiyaj",
          "created": 1639413427,
          "upvotes": 3,
          "replies": {
            "hofkutg": {
              "link": "/r/college/comments/rfaag7/im_really_scared_i_already_walked_the_stage_for/hofkutg/",
              "text": "Congratulations! Good job on graduating! What degree did you finish?",
              "author": "maora34",
              "created": 1639432464,
              "upvotes": 2,
              "replies": {
                "hofntrh": {
                  "link": "/r/college/comments/rfaag7/im_really_scared_i_already_walked_the_stage_for/hofntrh/",
                  "text": "Thank you!! I finished it in Computer Science! Definitely a challenge for sure",
                  "author": "iamyiyaj",
                  "created": 1639433705,
                  "upvotes": 1,
                  "replies": {
                    "hofpq85": {
                      "link": "/r/college/comments/rfaag7/im_really_scared_i_already_walked_the_stage_for/hofpq85/",
                      "text": "Amazing! Great job dude I’m proud of you! What do you want to do with it?",
                      "author": "maora34",
                      "created": 1639434498,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoezpht": {
      "link": "/r/college/comments/rfaag7/im_really_scared_i_already_walked_the_stage_for/hoezpht/",
      "text": "Not sure how other schools or majors work but at my school in the engineering department, they dont fail seniors in 500 level classes unless u really f up(i.e. way below average, missing major assignments or exams). As long as u show up and turn something in u will pass. \n\nSchools have a major incentive to pass seniors through to keep grad rates up and they understand that seniors are mainly focusing on interviews and looking for their first real job. If u have a job lined up and they fail u that would be a major hassle so they dont want to do that.",
      "author": "Red-Stoner",
      "created": 1639423779,
      "upvotes": 2,
      "replies": {}
    }
  }
}