{
  "sid": "k7fvb1",
  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/",
  "title:": "Anxiety over my supposedly \"useless\" biology major",
  "text": "Hello,\n\nI am a junior in college. I am currently majoring in biology, and minoring in chemistry. I had origninally planned on going to medical school, but I'm not sure it's right for me. I am certain I want to go to graduate school, but am not sure how long after obtaining my bachelors I would like to persue more education.\n\n&#x200B;\n\nI hear often that a biology major can be completely useless, unless I want to be a doctor. I am passionate about biology, so I feel as though I should continue with this major, especially since I am nearing the end of my bachelors.\n\n&#x200B;\n\nI am not so sure about my minor now, however. What good will a chemistry minor do for me? I'm considering completing a  buisness minor instead, because I feel it will give me more practical skills. I'm not sure how a biology major and a buisness minor will go together though.\n\n&#x200B;\n\nMy biggest fear is graduating, struggle to find a job, and feeling like I wasted my time and money on a worthless degree.\n\n&#x200B;\n\n\\[Edit\\] Thank you for all of the replies! I am completing an internship this semester that has given me tons of connections in biology fields, and has really opened my eyes to all of the options biology has to offer. \n\nI am now planning on applying to vet school when I graduate! Wish me luck. ",
  "author": "bad-at-chemistry",
  "created": 1607202758,
  "over_18": false,
  "upvotes": 789,
  "upvote_ratio": 0.98,
  "comments": {
    "gid3bfu": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gid3bfu/",
      "text": "Hey there it's ok to do a bio major and a business minor. Sounds really cool to me. That could be really helpful to u one day especially if ur passionate about it. I do a physical science major and minor in management out of interest in it and the courses are cool. Enjoy :)",
      "author": "SuomynonA6944",
      "created": 1609976961,
      "upvotes": 1,
      "replies": {}
    },
    "gf47gkk": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gf47gkk/",
      "text": "Im glad i ditched bio early for electrical engineering.",
      "author": "defrap22",
      "created": 1607474689,
      "upvotes": 1,
      "replies": {}
    },
    "geuqijv": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuqijv/",
      "text": "a college major opens MANY doors, unless if it's a career-specific degree like nursing or engineering. right now you are psychologially learning about the material but in real world, you will be utilizng practical skills like reading and communication and number sense. Many people don't go to college, so feel proud that you will have a degree",
      "author": "Comfortable-Night-78",
      "created": 1607277818,
      "upvotes": 1,
      "replies": {
        "geurchc": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geurchc/",
          "text": "Some creative careers could be sports coaching/industry, nursing home managenet, retail, environmental agencies , public health, churches/non-profit orgs, comp sci, and even opening up a restaraunt",
          "author": "Comfortable-Night-78",
          "created": 1607278225,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "geuq4y8": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuq4y8/",
      "text": "I once saw an ask reddit about how literally every major is useless. Its not about what you major in. Its about what you have to offer and what you do with your degree",
      "author": "wolfy321",
      "created": 1607277634,
      "upvotes": 2,
      "replies": {
        "geuq60k": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuq60k/",
          "text": "[removed]",
          "author": null,
          "created": 1607277649,
          "upvotes": 0,
          "replies": {
            "geuq8rd": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuq8rd/",
              "text": "Well that's annoying",
              "author": "wolfy321",
              "created": 1607277686,
              "upvotes": 1,
              "replies": {}
            },
            "geuzhwf": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuzhwf/",
              "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #4: Don't be an asshole.  \r\n\r\nAnything threatening or harassing is immediately removed and often results in a ban. That includes slurs against oppressed or disadvantaged people of any stripe.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
              "author": "VA_Network_Nerd",
              "created": 1607281639,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "geumsnu": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geumsnu/",
      "text": "My useless biology major brother in law is a Vice President of food research at a frozen foods distributor.",
      "author": "vicemagnet",
      "created": 1607275973,
      "upvotes": 1,
      "replies": {}
    },
    "geuisdp": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuisdp/",
      "text": "Maybe look into audiology. It's an awesome career, ranked one of the happiest jobs. You change lives through helping people with their hearing. Grad school is 3 years to practice.",
      "author": "Leontxo_",
      "created": 1607274000,
      "upvotes": 1,
      "replies": {}
    },
    "geui56o": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geui56o/",
      "text": "I think you could be a dentist.",
      "author": "SinfullySinatra",
      "created": 1607273660,
      "upvotes": 1,
      "replies": {}
    },
    "geudheb": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geudheb/",
      "text": "My older sister majored in biology. She got a job immediately after college working in a nephrology (kidney) lab. It’s not a useless major. Trust me.",
      "author": "QueenZeon101",
      "created": 1607271154,
      "upvotes": 1,
      "replies": {}
    },
    "geubtx5": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geubtx5/",
      "text": "Look up Americorps! Entry level programs in the conservation field. I’m doing one right now. It’s a lot of physical labor but it’s great to get your foot in the door. \n\nTbh it doesn’t pay well but I moved across the country for it and I’m doing well. Some benefits.",
      "author": "EPalmighty",
      "created": 1607270255,
      "upvotes": 1,
      "replies": {}
    },
    "geubd28": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geubd28/",
      "text": "It’s interesting to see a BIO major saying this! Like what? Try being an English major lmao.",
      "author": "TheMorningSage23",
      "created": 1607269996,
      "upvotes": 1,
      "replies": {}
    },
    "geu6feq": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu6feq/",
      "text": "Listen, I’m now graduating with a Bachelors in Anthropology. People told me I should major in stem but I wasn’t interested in engineering. I am scheduled to go into the FEMA Corps in March- which usually leads to advancement opportunities after completing service. I never would have considered FEMA had it not been for my education. Do what you are interested in (as long as your not taking out massive loans). If you want a fulfilling career- you likely aren’t going to get that studying something you hate.",
      "author": "annirosec",
      "created": 1607267454,
      "upvotes": 1,
      "replies": {}
    },
    "geu3v1y": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu3v1y/",
      "text": "Hey! I majored in bio in undergrad, and decided to do public health for grad school. Try looking into this, if it's something that interests you!",
      "author": "glkn6",
      "created": 1607266461,
      "upvotes": 1,
      "replies": {
        "gev8zic": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gev8zic/",
          "text": "What does public health involve?",
          "author": "bad-at-chemistry",
          "created": 1607284931,
          "upvotes": 1,
          "replies": {
            "gevk5uq": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gevk5uq/",
              "text": "I just started, but it's a lot of fun. It's mainly about preventing disease and improving the quality of life, but it really depends on what concentration you go into.",
              "author": "glkn6",
              "created": 1607290222,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "getv1ev": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/getv1ev/",
      "text": "I feel no major is useless, you have to work hard and show your passion tho. There are opportunities out there, but you’ve got to look for them. I feel a Chen minor might be more useful unless you plan for a biological negotiations career path. Chen can give a stronger base and help you understand more sophisticated techniques for research.",
      "author": "Born-Pea",
      "created": 1607262752,
      "upvotes": 1,
      "replies": {}
    },
    "getg5ne": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/getg5ne/",
      "text": "No degree is a guarantee. My ex’s brothers both got engineering degrees and they ended up working in supermarkets. If you want to work in science and you’re passionate about it, do that. Work on getting some experiential learning stuff in. Find internships (plural) that you can do to build up your working resume and your connections/network— BEYOND what your major requires. Don’t waste your time (especially this deep into your degree plan) worrying about how employable you will be in general. Figure out some jobs you might want and try to figure out whatever additional skills you’ll need to be good at that. Also look at the people who are telling you a bio major is useless— are those people bio majors? Did they apply themselves? College degrees are not one way tickets fo the job market like they were back in the 70s when like nobody had them. You have to put work in to make yourself stand out and have a little vision. Do the business minor if you want but I can tell you that there are plenty of people who come out of there learning how to be “entrepreneurs” in theory and absolutely nothing else of use without an MBA.",
      "author": "Jasmotron3k",
      "created": 1607255259,
      "upvotes": 1,
      "replies": {}
    },
    "get697v": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/get697v/",
      "text": "Have you looked in the environmental field? You can become an environmental scientist that studies the air, land, or trees. Look at state jobs or internships now to see what you want to do with your degree.",
      "author": "Icious_",
      "created": 1607250385,
      "upvotes": 1,
      "replies": {}
    },
    "gesvd20": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesvd20/",
      "text": "As I'm sure other people have said, a biology degree is not useless. You can get jobs using that degree. However, since you already have a heavy science background and are considering a business major, you might want to look into environmental (ENVR) management or ENVR science. ENVR management is a mix of science, business, law and a little bit of history. While ENVR science is science studying the various interactions occurring in the environment and can break off into either ENVR biology, ENVR chemistry, ENVR chemistry, Industrial Hygiene and Occupational Safety. Both ENVR's management and science materials connect and can lead into various business and scientific jobs.\n\nMeanwhile, if you haven't already, start networking, volunteering and getting as much experience as possible while you figure out what to do. I'd tell any college student to do that regardless.",
      "author": "Living_On_A_Prayer",
      "created": 1607244859,
      "upvotes": 1,
      "replies": {}
    },
    "gesp5xu": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesp5xu/",
      "text": "Junior Bio premed here, i had the same problems as you heard that bio is useless unless pursuing higher education. You could do research with a bachelor's but so far i heard that doing masters as BME is really great as a masters because biology is going to more of a statistical computing science.\nMaybe that'll help if you like/ are fine with math.",
      "author": "hoodedfigureee",
      "created": 1607241721,
      "upvotes": 1,
      "replies": {}
    },
    "gesocck": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesocck/",
      "text": "[removed]",
      "author": null,
      "created": 1607241333,
      "upvotes": 2,
      "replies": {
        "geu4tk9": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu4tk9/",
          "text": "Sorry, it seems your thread or comment is in violation of /r/college Rule #5: Keep it legal and safe.  \r\n\r\nWe permanently ban members whose posts or comments either describe participation in or advocate for illegal or dangerous behavior. The number one offense in this category is piracy. If you link or otherwise refer someone to a repository of pirated material, it's a no questions asked permanent ban. Same for drugs, same for any other activity that breaks the law or endangers safety.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
          "author": "VA_Network_Nerd",
          "created": 1607266861,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gesl0th": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesl0th/",
      "text": "If you look at the labor research, you'll find that most workers in the U.S. will change *careers* (not just jobs) multiple times before retirement. Your college major represents (at best) the starting point of a potential career, not the end. \n\nRegardless of your major, it's not \"useless\" *if* you: \n\n* learn how to study.\n* learn to work collaboratively. \n* learn to write effectively.\n* learn to speak publicly. \n* learn enough basic statistics to understand how society uses them these days.\n* learn to follow through and do what's necessary, even when you don't want to. \n* learn to think \"beyond the givens\" about any subject. \n* learn to live a modest lifestyle over the short/medium term so you can \"put in your time\" at the start of your career. \n* learn to persevere in the face of doubt and anxiety. \n* learn to fail then get back up and figure out how to succeed.",
      "author": "grab_bag_2776",
      "created": 1607239788,
      "upvotes": 1,
      "replies": {}
    },
    "gesij8w": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesij8w/",
      "text": "You still have a lot of options, even without grad school. There is a lot of interesting research going on and if you couple your degree with a minor in business or something you will greatly expand your potential avenues.",
      "author": "ResidentStriking",
      "created": 1607238672,
      "upvotes": 1,
      "replies": {
        "gevas09": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gevas09/",
          "text": "I have been considering minoring in business, actually. Either that, or management. I don’t know why I thought my major and minor had to fit together. I feel as though a management minor would provide great leadership skills.",
          "author": "bad-at-chemistry",
          "created": 1607285796,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gesh9qx": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesh9qx/",
      "text": "Go to nursing school! Best you can do with that degree, unless you want to be an educator - but you'll need a masters for that. Another idea - a sales rep for prosthetics like hips and such. It's a real solid job that does require some education vaguely related to medicine. At the end, a bio degree is much less useless than a degree in art history for example! Hope this helps.",
      "author": "TheVoidWithout",
      "created": 1607238066,
      "upvotes": 1,
      "replies": {}
    },
    "gesfwq8": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesfwq8/",
      "text": "Biology is not a useless major and its not always pre-medical in context. It's applicable in scientific context and even law enforcement. Plenty of variety in job availability unlike some much more less-useful majors.",
      "author": "AzrielK",
      "created": 1607237134,
      "upvotes": 3,
      "replies": {}
    },
    "gesdg41": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesdg41/",
      "text": "I totally understand your fears, but I think that the struggle of finding a job is not only in bio major. I used to be a bio major and then changed my major to computer science for this same reason, thinking that majoring in computer science would make finding a job easier. It turns out it is not easy at all. The competition is really high and finding a job is still a very stressful process.  \nSo, I'd say if you are passionate about your major, then try to stick to it. I'm not saying passion is the most important aspect of such a decision, but I think having a passion will ease the stress that you go through during your study period and afterwards.  \nGood luck!",
      "author": "the_tortoise_girl",
      "created": 1607235251,
      "upvotes": 2,
      "replies": {}
    },
    "gesa1sp": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesa1sp/",
      "text": "My sophomore year roommate was a bio major/chem minor, and she got a job within a month or so after graduation working for the lab at a major hospital near her hometown! She only has a bachelor’s, and she was able to find a job in her field that she loves.I definitely would not say your major is useless!",
      "author": "MiyaDoesThings",
      "created": 1607233204,
      "upvotes": 1,
      "replies": {}
    },
    "ges62bf": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges62bf/",
      "text": "I’m an English major so I’m already toileted, but my roommate is a chemistry major and she’s working a paid internship at this place called Monolith. I don’t think you need to worry, just do some networking, a few interviews here and there and I’m sure you’ll be ok. Best of luck",
      "author": "honalele",
      "created": 1607230869,
      "upvotes": 1,
      "replies": {}
    },
    "ges5n96": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges5n96/",
      "text": "Bio with a Chen minor would be perfect for making thc distillate from marijuana. Just a thought",
      "author": "skinnyjoints",
      "created": 1607230654,
      "upvotes": 1,
      "replies": {}
    },
    "ges4vye": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges4vye/",
      "text": "Rest assured that no matter what you study, there's a job out there for you:\n\nProfessor",
      "author": "whitelife123",
      "created": 1607230289,
      "upvotes": 2,
      "replies": {}
    },
    "gerzsdq": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerzsdq/",
      "text": "It depends on what you do during the degree and after. If you just sit around all day and don't actively seek out opportunities or ignore them as they come, then ANY degree is useless. No degree is going to get you anywhere unless you actively do something with it.",
      "author": "NeitherReaction6937",
      "created": 1607228024,
      "upvotes": 1,
      "replies": {}
    },
    "gerzevs": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerzevs/",
      "text": "Got my degree in bio then went back for nursing.  Hoping to go to CRNA school in the future with NP as a backup.  Have you looked into a PA program?",
      "author": "redditbrock",
      "created": 1607227823,
      "upvotes": 1,
      "replies": {
        "gevae2t": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gevae2t/",
          "text": "I had originally been interested in doing PA work when I started college. I should look into it again. Thank you!",
          "author": "bad-at-chemistry",
          "created": 1607285608,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gerxvdq": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerxvdq/",
      "text": "I majored in English and planned on becoming a teacher. I decided against the teacher thing after my first semester of college. The common wisdom is that you can’t do anything with an English major if you don’t teach. But I am 28, work at a place I love, and just finished my Master’s degree and bought a house this year. Now, I will say to take those particular results with a grain of salt because scholarships allowed me to finish school with no debt, and I won’t pretend that being debt-free made no difference in my ability to afford a house. But I was definitely still able to find a job with my “useless” degree, and my work paid for most of my Master’s degree, too. It’s okay to not have your career path completely decided before graduation. When people asked me what I planned to do with an English major if I wasn’t going to teach, I just shrugged and said, “Every company needs someone who can write well.” There are plenty of uses for biology, too!",
      "author": "lumabugg",
      "created": 1607227131,
      "upvotes": 1,
      "replies": {
        "geu24ew": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu24ew/",
          "text": "Out of curiosity, what do you do for work?",
          "author": "vnok",
          "created": 1607265674,
          "upvotes": 1,
          "replies": {
            "geu7vzc": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu7vzc/",
              "text": "I currently work as the sole grant writer at a community college. Before that, I was a marketing writer at a different community college. This year I finished a Master’s in Higher Education Administration.",
              "author": "lumabugg",
              "created": 1607268052,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gertbhd": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gertbhd/",
      "text": "An option is doing a business minor and then some kind of science based consulting",
      "author": "Hereforchickennugget",
      "created": 1607225141,
      "upvotes": 1,
      "replies": {}
    },
    "gersb8m": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gersb8m/",
      "text": "I didn’t read anything but the title to be honest but whoever told you that doesn’t know what they’re talking about. \n\nI will soon have a degree in microbiology but before university I worked in a micro lab doing quality control for a major company. There I learned just how many jobs there are available for any science degree. I saw people making a killing in commission selling lab/medical equipment that cost thousands and I mean thousands. There were techs coming in to fix and calibrate our equipment that made like $30 an hour (and I knew how to calibrate some of that stuff, super easy). Biologists making a killing consulting for companies going through FDA audits and inspections and so forth and so on.  \n\nThere’s a lot you can do, I wouldn’t worry too much. Do your research and know you’ll have to start at the bottom (a tech like I was) but you’ll see a lot of different jobs and network which will help you. I was a tech and I didn’t have even an AA at the time so I doubt you’ll struggle. You just need to be prepared to move somewhere more lucrative for your industry. \n\nEdit: I also wanted to go to med school but decided against it. My plan is to get back into the lab with my 3 years of experience and maybe get a nice gig as a microbiologist so I can consult one day. Good luck and God bless!",
      "author": "Ohhiitsmeyagirl",
      "created": 1607224673,
      "upvotes": 2,
      "replies": {
        "gertodt": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gertodt/",
          "text": "Did you like your micro lab tech quality control job? It sounds really interesting. I’d like to have that experience under my belt. Was it minimum wage pay?",
          "author": "kh7190",
          "created": 1607225302,
          "upvotes": 3,
          "replies": {
            "gerupbg": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerupbg/",
              "text": "It was literally a blessing and for a good company that owns several personal care brands so I got to buy them at super low prices in the company store 😂\n\nI did like it honestly. I did both chemistry and micro and actually changed my major from chemistry to micro because of it. I love bacteria I can’t explain it lol but it was cool being able to grow them and observe them with super high quality equipment. I already did most of the stuff we do in labs because of that job. \n\nI liked it because it was nice and easy but interesting. I didn’t feel bored or like it was mundane and I got to do both Chem and micro which most places have. Micro does the bioburden (how much bacteria is present in this product if any) and Chem does the physicals (viscosity, small, pH, etc). We also did testing in the plant so I got to be social with the factory workers. It was a nice gig and I made $17 an hour without a degree. For half a year I worked overtime (60 hrs) every week and bought an almost brand new car lol. They let us work overtime frequently but I just took advantage of the opportunity to do so. What I’m trying to say is that it was a really nice opportunity as a whole, for anyone but especially someone in or straight out of college which was the majority of us. My friend started a month before me and she’s now a microbiologist 2 at a large pharmaceutical company so growth is also possible if you’re a good/ hard worker. I left to finish my degree so I could basically do what she’s doing and I have a guaranteed job with her when I’m done because of the networking. So yeah I think it’s great. Also to add to that my boss is the head microbiologist at the company my friend is at and he makes well over $100k a year. It’s good work and great pay once you get settled.\n\nI keep thinking of more stuff to say lol but once you get experience one place, it’s easy to work for other places. I met people who worked for cover girl, Johnson and Johnson, Mary Kay, etc. I learned a lot of secrets lol about a lot of different brands. QC labs are pretty much the same in every company so it’s easy to move to another place of the opportunity occurs.",
              "author": "Ohhiitsmeyagirl",
              "created": 1607225794,
              "upvotes": 3,
              "replies": {
                "gerwj8y": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerwj8y/",
                  "text": "Wow! That’s really interesting. I’m really interested in microbiology too. I want to study biology and I originally wanted to study animals but microbiology was a close second option for me. I feel like microbiology would have more job opportunities to be honest. Do you think I could get a micro lab job like that without a degree still? Or are they hard to find? Any advice on how to find a job like that? Lol should I just type in “microbiology lab tech” into Indeed? :P also, are you going to graduate with a bachelors or a masters??",
                  "author": "kh7190",
                  "created": 1607226588,
                  "upvotes": 3,
                  "replies": {
                    "gerxjij": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerxjij/",
                      "text": "I worked in a lab with about 30 people give or take and the majority of them had biology or biomed degrees on the micro side and chemistry degrees or chemical engineering degrees on the chemistry side only myself and my friend were actually micro majors. Even the bosses had molecular bio or biology degrees because it doesn’t really matter honestly. Well, it does and it doesn’t. \n\nAs for finding a job, I think I got super lucky but it’s worth a try. How it worked for me is that I got a paid internship (through my community college believe it or not) and after like 5 months they hired me as a tech. I would look for jobs and just apply to tech jobs and when you get the opportunity, share with them that your in college. Many listings will say that you need a bachelors but they’ll hire someone if they fit the job who doesn’t have one. There were a couple techs who didn’t even have AAs and weren’t going to get one but they had experience so they were hired. The only downside to that is that you’ll never get promoted but you’re getting your degree so that doesn’t matter. LinkedIn is good for finding jobs I’ve noticed. There are a lot of places with labs: the food industry has labs like Coca Cola and Pepsi, as well as personal care items like sunscreen or makeup. It’s easier to find a job in these areas without a degree in my experience then like a pharma company. Anything that goes on your body or inside it has QC labs. Products have to pass USP/USDA/FDA regulations to be able to be sold. \n\nWhen I graduate I will have a BS I thought about a masters but maybe in the future. I’m so ready to graduate lol. I just want to start my life already lol which is why I decided against med school.",
                      "author": "Ohhiitsmeyagirl",
                      "created": 1607227003,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gers90g": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gers90g/",
      "text": "Who says a biology degree is useless outside of medicine?   You’re going to need grad school, certainly, but you have a wide range of options to choose from.  What do you love about biology?  Start with that question and identify some areas of study.   Talk to your advisor.  Talk to profs working in your most loved area.  Do some library searches and find researchers or other professionals working in your most loved field and reach out to them.  \n\nIf you majored in biology with the sole goal of making loads of money as a doctor, start your thinking more broadly and consider other fields.",
      "author": "Ocean2731",
      "created": 1607224644,
      "upvotes": 1,
      "replies": {}
    },
    "gerrpkm": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerrpkm/",
      "text": "Fellow engineering major here. The reason I’m here is to tell you that post graduation job seeking is in the end going to be up to you. Degrees don’t find jobs, people do. My engineering degree hasn’t done anything for me because I haven’t done anything with it yet, my point is your degree is highlighted only if you have the skills to market yourself and network, it’s just a stepping stone",
      "author": "johnbenede",
      "created": 1607224395,
      "upvotes": 5,
      "replies": {
        "gerteir": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerteir/",
          "text": "Yes! That’s why internships are so important",
          "author": "kh7190",
          "created": 1607225181,
          "upvotes": 1,
          "replies": {
            "gervzdl": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gervzdl/",
              "text": "Yes they did, sorry it was unclear, but my point was that since graduating I haven’t made much of an effort to find a job (many personal reasons for that) except for occasionally sending out resumes and I have had any real hits except for low paying positions or jobs I just wouldn’t want to do anyway, and it’s proven to me that my degree is not going to find the job for me, it’s my proactiveness in the job hunt that will",
              "author": "johnbenede",
              "created": 1607226357,
              "upvotes": 3,
              "replies": {}
            },
            "gertlfu": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gertlfu/",
              "text": "I did three internships that last three months each before I graduated. The most important thing is solely how you want to market yourself and how much effort you want to put into finding a job. If you aren’t about sending out multiple resumes all day everyday and adamantly answering your phone and being prepared for mock interviews at any time then you don’t want a job bad enough",
              "author": "johnbenede",
              "created": 1607225266,
              "upvotes": 1,
              "replies": {
                "gervnez": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gervnez/",
                  "text": "Sooo.. your internships helped or naw?",
                  "author": "kh7190",
                  "created": 1607226227,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gerriko": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerriko/",
      "text": "So biology degrees are really generalized and then some majors like zoology/wildlife biology/etc are reaaaally competitive. Make sure you do internships to develop your skills and actually use the knowledge you learn. Internships will also help you figure out what area of biology you want to lean in to for a career. But I’ve heard the same thing about biology degrees - people finding it difficult to find a job with it. I want to get my bachelors in biology too. But unfortunately I don’t think you can do much with just a bachelors degree anymore. Someone told me it’s equivalent to a high school diploma. So keep in mind that you’d have to get your masters if you want a job making more than $40k a year.\nA big thing that will help you too is research what exactly you want your end goal career to be. Start there and work backwards.",
      "author": "kh7190",
      "created": 1607224306,
      "upvotes": 5,
      "replies": {}
    },
    "gerr2dh": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerr2dh/",
      "text": "I’m only in my 2nd year of college, but I was planning on heading into the forensics field! Not sure what you want to do, but I was feeling this way too after realizing I don’t want to head into med school. Its nice reading these comments and knowing it’s not a dead end degree",
      "author": "diabIo_666",
      "created": 1607224095,
      "upvotes": 1,
      "replies": {}
    },
    "gerq1j1": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerq1j1/",
      "text": "I graduated with a biology degree many years ago. Being able to check the box that says (✓) Post Secondary is what matters. Everything else is up to you and your gumption. Your major and minor don't matter as much as the fact that you completed that portion of your life successfully and moved on. I've worked many different jobs and being happy with who you are, who your people are (choose them wisely), and where you are, matter. College helps you find that out for yourself.",
      "author": "kiaminnesota",
      "created": 1607223595,
      "upvotes": 1,
      "replies": {}
    },
    "gerpb1r": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerpb1r/",
      "text": "So I googled “jobs for biology degrees” and some of the things that popped up are Park Rangers, Food Scientist, Physician Liaison (which the description I’m looking at says a minor in sales helps so business minor might be helpful here), Health teacher/educators, Forensic Scientist, and Pharmaceutical Sales Rep. \n\nThere’s plenty out there and some only require a cert after graduation so if you decide not to pursue graduate school you won’t hurt your job prospects. You have time so take a look around and see if anything jumps out at you as possibilities.",
      "author": "JDMOokami21",
      "created": 1607223261,
      "upvotes": 2,
      "replies": {}
    },
    "gerp1ck": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerp1ck/",
      "text": "Hi there, I got a BS (‘09) and an MS (‘13) in biology. Things are going great for me and a bunch of my fellow graduates! I’m mostly from the wildlife end of biology, which is supposedly even worse, but we are doing fine. We were all told the same nonsense that it’s super hard to find work... and it isn’t exactly easy, but you work your way up super fast. Just gotta accept entry level will be hard for a few years but after a bit you’ll do great doing something you love.\n\nOh, and your minor doesn’t really matter no matter what it is lol. Just do finish it out, chem always looks good next to a bio degree. Don’t sweat it.\n\n* I am making good money as a professor. I set my own schedule, wear what I want, and have a wonderful work/life balance.\n* my best friend in grad school is a biologist in the private sector (makes >$100k/year as a project manager) and gets to work from home 2-3 days/week. \n* I’ve  got friends who work in the state parks and wildlife department doing awesome work.\n* I know people who work in the county health department\n* I’ve got a few in public health divisions of the state, county, and federal levels\n* I have a friend who worked her way up pretty well in the CDC\n* I know those doing nonprofit work (did that myself for a while) doing habitat restoration and conservation \n* one realized she loved painting the birds she was studying and now teaches wildlife art classes as well as makes a ton of money off her artwork...  she gets invited to join in some of the coolest bird banding stuff I’ve seen\n\nI actually have tons more jobs I know I’ve seen people get into. It’s just a mater of finding your joy and following it, accepting it’ll be hard in the beginning, but SO worth the effort if you show passion and put your all into it and build connections along the way.\n\nYou’ve got this! If you love it, do it! \n\nYour graduate work will help define what you do with that BS.",
      "author": "Nerobus",
      "created": 1607223132,
      "upvotes": 26,
      "replies": {
        "geu9zvy": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu9zvy/",
          "text": "Now only if professorships are as easily available in other majors... or with tenure at all.",
          "author": "comped",
          "created": 1607269211,
          "upvotes": 2,
          "replies": {
            "geuyrmq": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuyrmq/",
              "text": "Well, Math, Chemistry, and a lot of the Technical fields (including IT, industrial tech, and health science: nursing, medical imaging, physical therapy, message therapy, nutrition, etc) are always having a hard time finding enough applicants.\n\nBiology was a tough gig to get, I was hired out of 100 applicants and our last round of hires was about the same. What gets you the job are having teaching experience (as an adjunct- do at least 2 colleges at once) and getting in good with the department chair and full-time faculty. Ask for advice, work on mastering the craft (go to any trainings they offer), offer to help setup labs, volunteer to tutor, or run any events they’ve got going on... then when a spot opens, they will put in good words for you.\n\nOh, and a community college only requires a masters and is a WAYYY less stressful job than at a university. No research required, smaller classes, better one-on-one with students, you get to go to conferences all over the country still, and weirdly (at least in my area) it pays way better!",
              "author": "Nerobus",
              "created": 1607281336,
              "upvotes": 2,
              "replies": {
                "gf7f1bj": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gf7f1bj/",
                  "text": "Community college professor is my dream job! I love teaching (worked as an English teacher for two years abroad), and would love to do it in an adult setting, where everyone is choosing to be there. A few years ago as an undergrad student I took an extracurricular evening class and it was such an amazing experience. The small class sizes made the experience more intimate and by the end of the year we were almost like family.\n\nI'm now back in school getting my masters and would love to teach in community college.\n\nI don't suppose you have any advice for someone in the UK who wants to move to the US to become a community college professor? I was born in the US so citizenship is not an issue!",
                  "author": "ChameleonTwist2",
                  "created": 1607546255,
                  "upvotes": 2,
                  "replies": {
                    "gf7rtzy": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gf7rtzy/",
                      "text": "I was in the UK last year and loved it!! Spent most of my time in Scotland visiting colleges and the anatomy museums. \n\nI’d say my best advice is to start out as an adjunct, the pay is shit, but every college I worked at but one used it as a training ground and a sort of a trial run. Adjunct jobs are easy to get, just highlight your teaching experience as much as possible. They eat that up.\n\nOnce you’re in an adjunct spot, get in good with the department chair and full time faculty by making sure to attend meetings you’re invited to, volunteer to help the department whenever you can, and just be an all around great professor and team mate. Then when an opening comes around, apply. They always ask the full timers who they think would be a good fit from their adjunct pool (and at my college the full timers serve in the hiring committee too). \n\nJust be patient since full time spots take time to come around (took 2 years for me), but my teaching got tremendously better the longer I adjuncted, so it wasn’t wasted time. Adjunct at a handful of colleges and keep at it! If you have passion for it, it’ll show and you’ll get hired on in time (and it’s SOOO worth it when you do).\n\nGood luck to you!!",
                      "author": "Nerobus",
                      "created": 1607552397,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gev6x39": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gev6x39/",
                  "text": "Just need a master's degree then! And a college, community or not, that wants somebody who's got a theme park management degree, to teach...",
                  "author": "comped",
                  "created": 1607284124,
                  "upvotes": 1,
                  "replies": {
                    "gev7804": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gev7804/",
                      "text": "Well, someone’s got to teach those future theme park managers lol.. yea, that ones not going to be in high demand, but I’m betting more general managment classes could be something with a broader appeal.",
                      "author": "Nerobus",
                      "created": 1607284221,
                      "upvotes": 1,
                      "replies": {
                        "gev7kti": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gev7kti/",
                          "text": "Funny enough, the degree pre-COVID was a direct pipeline to the industry. Management jobs out the ass. Not so much now.",
                          "author": "comped",
                          "created": 1607284329,
                          "upvotes": 2,
                          "replies": {
                            "gev80wq": {
                              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gev80wq/",
                              "text": "Oh I believe it, but the professor needs might be lower.\n\nA college near me has one of the best hotel managment degrees in the country and those graduates can’t get hired fast enough!! (Of course- there is now a lag there too)\n\nGive it time, root for that vaccine to be distributed fast. I know everyone will be excited to hit the theme parks again next summer.",
                              "author": "Nerobus",
                              "created": 1607284476,
                              "upvotes": 1,
                              "replies": {
                                "gevjeh0": {
                                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gevjeh0/",
                                  "text": "Cornell, UNLV or UCF? Those are the traditional top 3.",
                                  "author": "comped",
                                  "created": 1607289857,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gernz5t": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gernz5t/",
      "text": "Everyone that claims a degree is useless is rooting for others to fail so they can feel better about themselves and their life choices. Fuck em' all.",
      "author": "Nullveer",
      "created": 1607222512,
      "upvotes": 2,
      "replies": {
        "gf49f91": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gf49f91/",
          "text": "Or we are trying to help ppl not major in worthless sh*it. 🙂. Better to tear off the bandaid now than beat around the bush and tell pretty lies",
          "author": "defrap22",
          "created": 1607475608,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "germsja": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/germsja/",
      "text": "I think whether or not a bachelor's in biology is useless is very debatable. \n\nI have an significant other that has a bio degree and it was hard to find a job. Not saying he couldn't, but it wasn't as easy or as well-paying as some other fields. Moving forward, he decided to pursue becoming a physician assistant, so he ended up finding his bio degree very useful in that sense. \n\nIt really depends on what you plan on doing. Some fields require that you have a master's/doctorate's in order for it to be worth it.",
      "author": "-Avira",
      "created": 1607221779,
      "upvotes": 10,
      "replies": {}
    },
    "germif1": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/germif1/",
      "text": "My wife was in the exact same boat. She got a BS in Biology thinking she was going to med school but changed her mind. After a lot of looking around and searching, she decided to get a Master’s degree in healthcare management (HMA).\n\nAn HMA degree is very versatile. You can end up a CEO of a hospital, run a department in a hospital, run an outpatient clinic, a chiropractic office, an assisted living facility, etc. \n\nHaving a biology background can be useful to understand how the body works, how different medications work and affect the body and such. My wife runs a hospice office and enjoys the flexibility that her degree can offer her in the future should she switch jobs.",
      "author": "rmanwar333",
      "created": 1607221608,
      "upvotes": 2,
      "replies": {
        "geuappm": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuappm/",
          "text": "My hospitality school now literally offers a senior living management BS... Nobody takes it.",
          "author": "comped",
          "created": 1607269629,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "germdey": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/germdey/",
      "text": "I'm an English major, talk about useless lol.",
      "author": "Zibilicious",
      "created": 1607221524,
      "upvotes": 1,
      "replies": {
        "gesj8bq": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesj8bq/",
          "text": "Serious question(s): why so? what did you expect to do with it? what would have been a better choice in your opinion?",
          "author": "grab_bag_2776",
          "created": 1607238986,
          "upvotes": 1,
          "replies": {
            "gew498g": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gew498g/",
              "text": "I started with Electrical Engineering and half way through it I decided that I wanted to be entrepreneurial and chose English because it was the easiest major to me. Also, at the time, I had a side hustle of writing essays for people and loved creative writing. \n\nMy idea was to get done with school ASAP and jump into business. \n\nI don't think I'd choose a different major because I think my logic was sound. If anything, Id say architecture or design because I love doing UI/web design.",
              "author": "Zibilicious",
              "created": 1607300474,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ges4g9o": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges4g9o/",
          "text": "I downvoted you for conforming to the belief that a liberal arts degree is useless.",
          "author": "Simpull_mann",
          "created": 1607230086,
          "upvotes": -1,
          "replies": {
            "gew4foi": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gew4foi/",
              "text": "Depends on what you get out of it. I say mine was useless because I had crappy professors that didn't really do much. \n\nAlthough I chose English, nothing I do now has anything to do with English.",
              "author": "Zibilicious",
              "created": 1607300566,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "germad5": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/germad5/",
      "text": "I think every major feels like their major is useless. I’m a geology major and we legit look at biologists in jealousy bc they’re the ones that are guaranteed to get jobs. There’s no available jobs in geology and many of us end up working for water or oil companies so a lot of us thinking about how we should switch to biology just to get a job",
      "author": "Estate_Soggy",
      "created": 1607221474,
      "upvotes": 2,
      "replies": {}
    },
    "germ98v": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/germ98v/",
      "text": "There is nothing useless about your biology major. A big reason people might consider it useless is because of how broadly it can be applied and how many of those people may not really know what specifically interests them that they want to try and pursue with biology. It's all about having an idea of what you want to pursue.",
      "author": "mightbe1nsane",
      "created": 1607221456,
      "upvotes": 3,
      "replies": {}
    },
    "gerl6s4": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerl6s4/",
      "text": "I did this! Biology major with a chemistry minor, originally planned to go to med school, started shadowing and preparing for the MCAT in like my 3rd year when I realized I didn't really want to do that, but I finished out the degree anyway. I chose Biology because it interested me, and the minor was just kind of a freebie because the major required so many chemistry it was practically built into the degree.\n\nThe major is definitely not useless. It's a great starting point for a variety of professional degrees. I graduated with people who went on to different professional schools including medicine, optometry, veterinary medicine, dentistry, etc. Some went on to complete laboratory tech programs.  Some went into teaching. Others stuck with Biology and went on to pursue masters degrees and Ph.Ds. I personally went to pharmacy school.\n\nYou should check and see if your school offers some type of career services program to help grads find jobs. They would probably have a ton of information they could share with you on different opportunities.",
      "author": "LordMudkip",
      "created": 1607220813,
      "upvotes": 3,
      "replies": {
        "gern0an": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gern0an/",
          "text": "How was your experience with pharmacy school? I am currently a junior majoring in microbiology and minoring in pharmacology, and I’m really considering pharmacology school!",
          "author": "pathetic_puta",
          "created": 1607221912,
          "upvotes": 1,
          "replies": {
            "gers8xw": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gers8xw/",
              "text": "Not to sound like a wet blanket but working with the public as a pharmacist is a nightmare I’ve heard. This one pharmacist I know makes like $230k a year but she’s over $100k in debt so.. you gotta balance that out. But if you are reaaaaalllllyyy passionate about medicine and helping people then go for it. Pharmacists and dentists have some of the highest student loan debt of any career",
              "author": "kh7190",
              "created": 1607224643,
              "upvotes": 2,
              "replies": {}
            },
            "ges0778": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges0778/",
              "text": "I definitely felt like my undergrad degree prepared me pretty well for pharmacy school. In particular, I think the physiology, molecular biology, and statistics classes I took in undergrad gave me a pretty significant advantage in a lot of different pharmacy classes compared to those in my class who hadn't taken them.\n\nPharmacy school itself was hell, but that's probably what people in pretty much any doctorate program would tell you. You cover a ton of information in a pretty wide variety of areas, so some parts of it were definitely more interesting than others, but I like pharmacology/toxicology and real-life applicable clinical type classes, and thankfully there was no shortage of those. \n\nBefore you go into pharmacy, just keep in mind that our job market is super saturated, so getting a job straight out of pharmacy school isn't as easy as it used to be, and it's not projected to get any easier. There are definitely jobs out there, but finding one in a desirable location in whatever setting you prefer will be difficult. You'll have more opportunities if you choose to pursue a fellowship or a residency after school or if you do a dual degree program to get an MBA or Ph.D. with your Pharm.D., but those programs are all extremely competitive. Lol I don't mean to scare you, because I'm sure with a lot of hard work you could do it, but I think it's important to have that realistic picture of where the profession is at and where it's likely to be going before you make that commitment to it. If you have any more questions about it though I'd be happy to answer them!",
              "author": "LordMudkip",
              "created": 1607228220,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gerkbf9": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerkbf9/",
      "text": "You should definitely go to graduate school or medical school (or even nursing, which pays well in states like California).",
      "author": "NewCenturyNarratives",
      "created": 1607220343,
      "upvotes": 2,
      "replies": {}
    },
    "geriw65": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geriw65/",
      "text": "you could go work in pharmaceuticals. They like a biology background and if you can get sales experience and do sales then you can make a decent salary.",
      "author": "Risky_biskuits",
      "created": 1607219662,
      "upvotes": 1,
      "replies": {}
    },
    "gerhphh": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerhphh/",
      "text": "There are plenty of things you can still do with a bio major and more education(masters)  can help you focus on something you’re more interested in as well",
      "author": "night2016",
      "created": 1607219091,
      "upvotes": 4,
      "replies": {}
    },
    "gergval": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gergval/",
      "text": "If you like math, biostatistics.",
      "author": "veeeerain",
      "created": 1607218670,
      "upvotes": 2,
      "replies": {}
    },
    "gergg34": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gergg34/",
      "text": "Biology is a dope major. Far from useless. It’s a STEM major. Just market yourself well and you can have a career in a variety of fields. Hopefully your grades were good? Having a 3.5+ will open more doors for you. \n\nYou can apply for a master’s in a lot of disciplines",
      "author": null,
      "created": 1607218456,
      "upvotes": 27,
      "replies": {}
    },
    "gerg9ot": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerg9ot/",
      "text": "There really is no useless major. You will always be better off for having a degree as opposed to not having one regardless of major.",
      "author": "Smitty_Jarrett",
      "created": 1607218364,
      "upvotes": 2,
      "replies": {
        "ges55m9": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges55m9/",
          "text": "I feel like this is true, but only if you have a way to spin it and work for you. Like majoring in Art. Stereotypically there isn’t much you can do with that, but if you market yourself a certain way, and possibly pick up some skills that would help you such as business, you could make it work out by having that degree.",
          "author": "ArmyBrat2SouthnBelle",
          "created": 1607230406,
          "upvotes": 1,
          "replies": {}
        },
        "geu9oot": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu9oot/",
          "text": "Completely untrue",
          "author": "ChaosLordSamNiell",
          "created": 1607269030,
          "upvotes": 1,
          "replies": {}
        },
        "geuan26": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuan26/",
          "text": "*looks at you as a theme park management major.*\n\nStill no useless major?",
          "author": "comped",
          "created": 1607269587,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gerfuf2": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerfuf2/",
      "text": "My friend was told the same thing when getting his Bachelor's in Biology. He just defended his thesis for his Master's in Microbiology, and he has a job working for the DHSS (Department of Health and Social Services) basically as a data analyst.\n\nDon't listen to the naysayers, it's ridiculous to me that some people think science degrees are useless. Keep in mind you can get a Master's in whatever you want and with a science degree you can get a wide variety of jobs if you sell yourself the right way. For example, I'm a geologist and I've heard of other geologist getting jobs in finance of all places due to their abilities to analyze data.",
      "author": "supbrother",
      "created": 1607218149,
      "upvotes": 18,
      "replies": {}
    },
    "gerfu5y": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerfu5y/",
      "text": "Have you considered forestry? There are lots of bio based grad programs from tree improvement, ecology, reforestation/restoration etc.",
      "author": "shenrbtjdieei",
      "created": 1607218146,
      "upvotes": 5,
      "replies": {}
    },
    "gerasty": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerasty/",
      "text": "If you took stats, and are comfortable with R/Python/SAS you could look into bioinfomatics.",
      "author": null,
      "created": 1607215649,
      "upvotes": 19,
      "replies": {
        "gerpzpc": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerpzpc/",
          "text": "Oh! This reminds me, along the same note look into GIS software. They need biologists that know GIS!! I’ve seen tons of these jobs.",
          "author": "Nerobus",
          "created": 1607223569,
          "upvotes": 5,
          "replies": {
            "gesllcl": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesllcl/",
              "text": "I’m a bio wildlife major and have taken several GIS classes...can you elaborate on these job opportunities?",
              "author": "badgersnuts2013",
              "created": 1607240038,
              "upvotes": 2,
              "replies": {
                "gesn5tq": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesn5tq/",
                  "text": "Ha! I’m wildlife too, which is how I got into GIS.\n\n\nI noticed when job hunting a lot of jobs for local government and private industry are looking for people to do all kinds of stuff. \n\nI had one friend who does it redrawing flood maps.\n\nI have another friend who’s done work for the federal government including the national parks system and is now working in England doing more GIS work. \n\nMight want to check this out: https://www.esri.com/en-us/what-is-gis/careers \n\nThere’s some cool stuff you can do with it.\n\nThen again, a lot of employers expect wildlife majors to be at least moderately proficient in GIS now. So it could just tie in well with any wildlife biologist position as well.",
                  "author": "Nerobus",
                  "created": 1607240783,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gerf5wp": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerf5wp/",
          "text": "You would likely need a masters at minimum for this unless you have an undergraduate specifically in BIN. However, a github or similar portfolio with code samples demonstrating proficiency might be enough for some jobs. Even then you will have to do a lot of searching to find a good fit.\n\nsource:\n\nI completed an undergraduate thesis and an internship in bioinformatics while majoring majoring in Biotechnology",
          "author": "crispybaconstrip",
          "created": 1607217797,
          "upvotes": 4,
          "replies": {
            "geril7z": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geril7z/",
              "text": "depending on what level of a job for sure.  Lots of statistical programmers have degrees in stats or bio.\n\nsource: interned as one, majoring in completely unrelated field.",
              "author": null,
              "created": 1607219516,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gesbq9s": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesbq9s/",
          "text": "just learn to code and get a software job",
          "author": null,
          "created": 1607234158,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ger9wmc": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ger9wmc/",
      "text": "Biology degrees that include a year of physics + chem through orgo 2 lab + calc are pretty solid for employers. You can usually get a lot of physical science jobs. It's the bio degrees that don't include those things that make it difficult to get jobs.",
      "author": "MeGotShadowbanned",
      "created": 1607215183,
      "upvotes": 10,
      "replies": {
        "gersvrw": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gersvrw/",
          "text": "What bio degrees don’t include these pre reqs???",
          "author": "Ohhiitsmeyagirl",
          "created": 1607224945,
          "upvotes": 8,
          "replies": {
            "gesr2m0": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesr2m0/",
              "text": "The private, tiny, liberal arts undergrad school I started at had a very easy biology degree. Transferred to a state school and holy cow I didn't realize I was required to take calc and all that until it was too late. Don't regret it, it was just a major shock",
              "author": null,
              "created": 1607242631,
              "upvotes": 2,
              "replies": {
                "gevgqbu": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gevgqbu/",
                  "text": "I never knew that. Dang.",
                  "author": "Ohhiitsmeyagirl",
                  "created": 1607288635,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "geryl3q": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geryl3q/",
              "text": "A lot of them. Usually BS Bio from liberal arts schools and BA Bio from stem-heavy schools.",
              "author": "MeGotShadowbanned",
              "created": 1607227415,
              "upvotes": 3,
              "replies": {
                "geryosn": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geryosn/",
                  "text": "I’ve never heard of that but I guess so. \nLol what is a bio degree without these classes? Lol",
                  "author": "Ohhiitsmeyagirl",
                  "created": 1607227461,
                  "upvotes": 4,
                  "replies": {
                    "ges2f4h": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges2f4h/",
                      "text": "At a lot of schools, the bio degree just a vehicle to get students the bare minimum to be eligible for medical field grad school programs and and a class or two away from to med school pre-reqs.",
                      "author": "MeGotShadowbanned",
                      "created": 1607229181,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ges56sx": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges56sx/",
          "text": "If OP is up to it, he could also try BME",
          "author": "whitelife123",
          "created": 1607230421,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ger8pjs": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ger8pjs/",
      "text": "Op study biostats , you will be fine",
      "author": null,
      "created": 1607214585,
      "upvotes": 5,
      "replies": {}
    },
    "ger45y0": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ger45y0/",
      "text": "if u still have time to switch to a bio chem major that has more opportunities",
      "author": "catolinee",
      "created": 1607212413,
      "upvotes": 2,
      "replies": {}
    },
    "ger3gev": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ger3gev/",
      "text": "> My biggest fear is graduating, struggle to find a job, and feeling like I wasted my time and money on a worthless degree. \n\nI'm not a bio major, but I also regret my degree because it isn't something I'm passionate about. The finding a job fear is pretty much everyone, so you aren't alone in that fear.\n\nIf you like your major that's what matters. I would start looking at places you want to work and if your college has an office that helps students find jobs and work on their resumes I would utilize it.",
      "author": "SunflowersA",
      "created": 1607212083,
      "upvotes": 11,
      "replies": {}
    },
    "geqzsqb": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqzsqb/",
      "text": "Jobs phrases to search for in Indeed or elsewhere: Lab Assistant, Clinical Laboratory Scientist, Research Assistant, Biological Science Technician.\n\nSearch around on government job listings including the Department of Agriculture, Department of Interior, National Parks, and Fish and Wildlife Services. Look for job postings in states with similar offices including in health and the environment. If you are interested, check out national or local non-profits in related fields like Sierra Club, etc.\n\nOtherwise, a biology degree is a great degree for going into a Master's program that would open up other job opportunities.",
      "author": "zifmer",
      "created": 1607210377,
      "upvotes": 34,
      "replies": {}
    },
    "geqxjv8": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqxjv8/",
      "text": "As someone who’s actually recently graduated with a biology major (and has a lot of friends who did the same), it’s definitely not useless. It’s hard to give suggestions about what you could do since I don’t know your interests, but I work in biomedical research and I have other friends (edit: with just a bachelors in biology) working in various positions at biotech companies, doing covid testing, working in museums, science communication/journalism, and teaching primary thru high school. Yes, a lot of biology majors plan to get a graduate degree later on (I’m one of those), but not necessarily everyone- it really depends on what you wanna do, and that’s regardless of your major. Feel free to dm me advice on your specific interests!",
      "author": "francium_87",
      "created": 1607209335,
      "upvotes": 241,
      "replies": {
        "ges51zg": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges51zg/",
          "text": "With just a Bachelor?",
          "author": "eggquisite",
          "created": 1607230363,
          "upvotes": 19,
          "replies": {
            "gesaupl": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesaupl/",
              "text": "Yup! Of course, with some of these jobs (like research, for me) you’ll need a higher degree of you wanna have more upward mobility in your career, but a bachelor’s in Biology still is far from useless.",
              "author": "francium_87",
              "created": 1607233630,
              "upvotes": 29,
              "replies": {
                "geu78b0": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu78b0/",
                  "text": "But what can you do with just a bachelors in biology? What careers?",
                  "author": "kh7190",
                  "created": 1607267785,
                  "upvotes": 4,
                  "replies": {
                    "geuftyo": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuftyo/",
                      "text": "So I mentioned in my original comment some of them :) Even for research, while like you can’t be a PI with only a bachelors, you can certainly make a career out of it if you just want to stay as a lab technician or something like that. Learning R/Python can also open a lot of doors for bioinformatics jobs. Other people in this post have mentioned environmental testing, jobs with National/State Parks or Fish and Wildlife Services, Sierra Club, data analyst, etc.",
                      "author": "francium_87",
                      "created": 1607272441,
                      "upvotes": 9,
                      "replies": {
                        "geurctb": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geurctb/",
                          "text": "What’s a PI? Some of those jobs though like lab techs don’t make much money, only a couple bucks above minimum wage.. why put yourself in tens of thousands of dollars in student loan debt for that?",
                          "author": "kh7190",
                          "created": 1607278229,
                          "upvotes": -1,
                          "replies": {
                            "geuttu0": {
                              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuttu0/",
                              "text": "Because you need a Bachelor’s in order to move on to graduate school later on\n\nPI = Primary investigator, they usually have doctorate degrees and they’re the head of the research lab",
                              "author": "Giant_Anteaters",
                              "created": 1607279316,
                              "upvotes": 5,
                              "replies": {
                                "geuu0fq": {
                                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuu0fq/",
                                  "text": "So I guess there’s nothing lucrative in the field for bachelor degree graduates. If they didn’t want to go to graduate school",
                                  "author": "kh7190",
                                  "created": 1607279397,
                                  "upvotes": -1,
                                  "replies": {
                                    "geuu7qb": {
                                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuu7qb/",
                                      "text": "Yeah I guess not, but on the flip side of it, if you just have a high school diploma, there are even fewer jobs available",
                                      "author": "Giant_Anteaters",
                                      "created": 1607279485,
                                      "upvotes": 2,
                                      "replies": {
                                        "geuvln3": {
                                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuvln3/",
                                          "text": "ehhh what about an associates degree? lol",
                                          "author": "kh7190",
                                          "created": 1607280078,
                                          "upvotes": 1,
                                          "replies": {
                                            "geuz0v0": {
                                              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuz0v0/",
                                              "text": "That works too, but some academic subjects (like biology) only have 4-year Bachelor's degrees available, so depending on the field you want to study and work in, an Associate's might not be an option\n\nI do still think you might be at a disadvantage in the job market if you have less time spent in post-secondary education though",
                                              "author": "Giant_Anteaters",
                                              "created": 1607281442,
                                              "upvotes": 1,
                                              "replies": {
                                                "gev3wm1": {
                                                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gev3wm1/",
                                                  "text": "Yeah, I want to at least finish my bachelors, but i do have an associates. just worried about that debt",
                                                  "author": "kh7190",
                                                  "created": 1607283193,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "gev72zz": {
                                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gev72zz/",
                                      "text": "For research, generally, yes you’re going to have a hard time finding a lucrative career without getting a higher degree eventually",
                                      "author": "francium_87",
                                      "created": 1607284177,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gesfe3l": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesfe3l/",
          "text": "How did you get into research? I’m a junior and just now realized how much I love research but I’m still unsure about getting a masters",
          "author": "fitzthetantrum",
          "created": 1607236791,
          "upvotes": 4,
          "replies": {
            "geuew66": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuew66/",
              "text": "To get started in research in undergrad, what I did was email professors who had labs to basically say I was interested in their research and would love to join their lab, and if we could meet to discuss this. I went to a SLAC so there weren’t many labs at my school - fortunately I got into one of them, but my plan had been if I didn’t, I would email profs at larger nearby schools too. Bringing that up because you don’t necessarily have to do research at your own school if your college doesn’t have a lot of options. Anyway, I started out as a volunteer, but then eventually had my work study job as a research assistant in the lab which was nice. That all said, I have no idea how covid is affecting how labs are bringing in undergrads :/ but it wouldn’t hurt to ask- maybe you could even start out virtually.\n\nI’m also not sure how covid will be affecting this, but if you can, I’d apply to a bunch of summer research internships (such as NSF-funded REUs). I remember I applied to about a dozen of them and got into 2, so those are pretty competitive, but I had a really great time in my REU. I believe the apps for those are mostly due in Jan/Feb, if I remember correctly?\n\nLastly, if you still want more research experience after you graduate, I would highly recommend a postbac research program. There are PREP programs at various schools meant for underrepresented minorities in the sciences. And then there’s also the NIH Postbac IRTA fellowship, which is what I’m currently doing- you get to work in a lab at the NIH for 1-2 years. How it goes def depends on your PI, but I’m having a great time here. The admissions for this program are rolling, which is also nice, but I’d recommend applying around this time next year when you’re a senior. I’m sure there are other postbac research programs, but those are the ones I’m familiar with. Also, if there’s a specific lab you’re interested in, you could email them to ask to work as a lab tech for a year or two after you graduate, rather than doing a more formal postbac program.\n\nAlso- if you’re more interested in biotech research rather than academic/government research, I’d recommend trying to get a job or internship at a biotech company. One of my friends had an internship (for academic credit) to work at a biotech company one semester senior year, and then worked there after he graduated for a bit.",
              "author": "francium_87",
              "created": 1607271932,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gfr765h": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gfr765h/",
          "text": "this made me feel great. \nim getting my teaching licensure and majoring in bio atm and i want to teach for a few for a break and then go back for my masters and this comment made me so relieved. i love biomedical research",
          "author": "mushbean",
          "created": 1607902030,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gequcs3": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gequcs3/",
      "text": "How about being a PA, EMT? If you are still interested in Healthcare try radiologiy or US tech.",
      "author": null,
      "created": 1607207885,
      "upvotes": 8,
      "replies": {}
    },
    "geqtujr": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqtujr/",
      "text": "If you are passionate about it, why not teach it?",
      "author": "iceman2kx",
      "created": 1607207657,
      "upvotes": 183,
      "replies": {
        "geqxvlq": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqxvlq/",
          "text": "THIS!!!! We need people passionate about Biology and Chemistry teaching it!",
          "author": "Cjb3z4",
          "created": 1607209481,
          "upvotes": 82,
          "replies": {}
        },
        "gereg3f": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gereg3f/",
          "text": "OP, maybe try opening an online teaching YouTube Channel/ business and teach it?",
          "author": "GPA_Only_Goes_Up",
          "created": 1607217448,
          "upvotes": 16,
          "replies": {}
        },
        "gerrfj0": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerrfj0/",
          "text": "Because the only job a BS Bio will get you is K-12. I mean, if you want that, but I don't think they pay enough. \n\nCommunity college teaches less and is not salary based like K-12 is. But yea, there are tons of teaching jobs out there right now if you want to do that.",
          "author": "Flacvest",
          "created": 1607224265,
          "upvotes": 11,
          "replies": {
            "gespp3y": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gespp3y/",
              "text": "[deleted]",
              "author": null,
              "created": 1607241986,
              "upvotes": 7,
              "replies": {
                "gewlkta": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gewlkta/",
                  "text": "Yea; I was thinking of getting a MS in science teaching when I got my MS in biology, as the program was really good. The problem is that unless I want to teach at a really good high school or middle school, the pay won't be good enough and I'll need a PhD to teach at a college level. \n\nIt varies though; I know of some small towns that pay K-12 teachers like 50k a year. I wouldn't mind that if I had a pretty short commute.",
                  "author": "Flacvest",
                  "created": 1607310119,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "geu9oim": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu9oim/",
          "text": "Unfortunately in my case - there's literally two colleges in the US which teach what I teach... and neither of them are hiring for a long time. Guess that's what I get for majoring in theme park management.",
          "author": "comped",
          "created": 1607269027,
          "upvotes": 1,
          "replies": {}
        },
        "gev998z": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gev998z/",
          "text": "Teaching is a great idea! I will definitely look more into it, thank you.",
          "author": "bad-at-chemistry",
          "created": 1607285064,
          "upvotes": 1,
          "replies": {}
        },
        "geu7a1j": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu7a1j/",
          "text": "Bc teachers don’t make good money",
          "author": "kh7190",
          "created": 1607267801,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "geqsqe5": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqsqe5/",
      "text": "I'll be real: a bachelors in biology is near useless. You will have quite a struggle finding a job that uses that degree. I have friends who kinda did the same thing. They wanted to be a doctor, majored in bio, then realized that medical school is cut throat and were plopped out of college with a bachelors in biology. They got jobs, but those jobs do not utilize their biology degree. More like, the jobs wanted someone with a bachelors degree. \n\n&#x200B;\n\nMy father did the same thing too haha. But he taught himself programming, and now has a nice programming job.",
      "author": null,
      "created": 1607207149,
      "upvotes": -1,
      "replies": {
        "gerc5a9": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerc5a9/",
          "text": "I would disagree with this. I think it might depend on what you want to do with a bio degree. I got my bachelors in biology and went into fisheries and wildlife. I’m now starting grad school but I’ve worked with TONS of people who only have a bachelors in biology and have no trouble finding work. It’s a lot of seasonal work starting out but there’s lab jobs in the winter and eventually permanent positions. I’ve had so many opportunities for working in biology, even with covid right now.",
          "author": "JustTheFishGirl",
          "created": 1607216329,
          "upvotes": 13,
          "replies": {
            "gert6e5": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gert6e5/",
              "text": "But aren’t your jobs minimum wage or a little above that? Finding jobs with a bachelors in biology that pay more than $40k a year seem impossible to find",
              "author": "kh7190",
              "created": 1607225075,
              "upvotes": 1,
              "replies": {
                "gervafb": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gervafb/",
                  "text": "No, not minimum wage. It’s not super high paying but a lot of jobs you find provide housing for cheap or free. Starting out after college you qualify for a gs 5 spot for federal jobs (forest service, national parks, noaa, etc). Which is around $15-16 an hour but varies based on your location. There’s also private companies. Again, a lot of it is seasonal. But my job this past summer $16ish but I got free housing (it was actually a vacation rental house on the coast of Oregon. Super super nice). A lot of people in my field will do a wildlife job from April-August and then a fish job from like October-December or do a winter lab job. You do two or three seasons as a seasonal and then you can get permanent positions. Or really lucky people can get permanent straight out of college. It’s definitely not for everyone. But I loved it cause I got a lot of variety in the work I was doing and what animal I was studying and got to see a lot of the country and was able to pay my bills and save quite a bit. Im only going back for my masters now because I want to do more with academia. But I would’ve been totally fine with doing another year of seasonal stuff then applying for permanent positions.",
                  "author": "JustTheFishGirl",
                  "created": 1607226070,
                  "upvotes": 3,
                  "replies": {
                    "gerwwop": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerwwop/",
                      "text": "This was really helpful thank you! Did you go to school in Oregon? Is the field work really really physical? Do you have to be an expert camper and survivalist to be able to do the work you do? Lol. And when you say “starting out after college” do you mean with a bachelors or masters?",
                      "author": "kh7190",
                      "created": 1607226737,
                      "upvotes": 1,
                      "replies": {
                        "gerxd1a": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerxd1a/",
                          "text": "No, I got my undergrad in Alabama. Took a paid summer internship the year after I graduated in Oregon, then went to Georgia for a job, and then went back to Oregon lol. All three of these provided housing though so I never had to worry about that which was super nice. But I met a ton of people who got a seasonal job straight out of college and skipped the internship phase.",
                          "author": "JustTheFishGirl",
                          "created": 1607226924,
                          "upvotes": 2,
                          "replies": {
                            "geryv2f": {
                              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geryv2f/",
                              "text": "Is the field as cut-throat and as competitive as everyone says?",
                              "author": "kh7190",
                              "created": 1607227538,
                              "upvotes": 1,
                              "replies": {
                                "ges0o4f": {
                                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges0o4f/",
                                  "text": "Yes and no. You definitely have to apply for a lot of jobs and federal jobs it helps to be able to talk to them in person or call them after your application is referred. Connections are also super helpful. I got my georgia job and my masters program from the people knowing my undergrad research advisor. But the two Oregon jobs were all me. Overall, getting my masters program was definitely harder. And sometimes I didn’t get my top choice job but Ive always gotten a job. I also double majored in biology and marine biology so I switch from marine to freshwater stuff and marine is waaaayyy more competitive so this doesn’t seem as bad to me lol.",
                                  "author": "JustTheFishGirl",
                                  "created": 1607228430,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "geqs9gv": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqs9gv/",
      "text": "Graduate degrees in Biology have far more hireabilty than undergraduate degrees.\n\nAs for the minor, to be frank, it doesn't matter at all. I don't know why students agonize about their minors - they are all meaningless. All a minor does is demonstrate another area of interest for you; it is not a credential.",
      "author": null,
      "created": 1607206928,
      "upvotes": 97,
      "replies": {
        "gesj37r": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesj37r/",
          "text": "I don't know about completely meaningless, but minors are definitely not something to stress over. For example, I'm fairly certain that a minor in business data analytics (major in CS) helped me land an internship at a financial institution. However, it's definitely not important enough to agonize over. My general advice to first years has been to pursue a major in a field that is different enough from their major to give them a cognitive break and satiate some interest. Getting a chem minor on a bio major seems hardly worth it, since a minor will only express basic knowledge on a subject and bio majors are already expected to have a basic competency in chemistry. Same can be said for CS majors who do math minors. Sure, it might show you're better at math than most CS majors, but CS majors are already expected to be good at math. \n\nIn OPs case, I would recommend getting something like a statistics, data analytics, or computer science minor if any of those things interest them. If those all sound boring as hell, either drop the idea of a minor or choose something that is actually interesting to them regardless of job prospects. For example, after that internship I dropped the analytics minor in favor of a European History. completely useless to my career but extremely interesting to me personally. Later I turned it into a major, but that was definitely an emotional choice rather than a rational one.",
          "author": "dazedconfusedev",
          "created": 1607238926,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "geqq65d": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqq65d/",
      "text": "Environmental testing jobs for meeting government standards I expect would be available if nothing else.",
      "author": null,
      "created": 1607205981,
      "upvotes": 18,
      "replies": {}
    },
    "geql9o0": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geql9o0/",
      "text": "Almost same situation. Also finishing up my Biology degree on a pre-med track, and I'm minoring in Mathematics. Slowly realizing med school and my dreams of being a doctor might not be the best path for me and I've slowly given up. \n\nBut I know no degree is useless and isn't wasted. Your knowledge and new skills can be applied in many places. You can also get a graduate degree and build upon that for even greater opportunities. \n\nMy own plan is hopefully doing teaching/sub work, I've had almost two years experience as a math tutor, while possibly going to get a masters in Environmental Science.",
      "author": "ShiftyElk",
      "created": 1607203790,
      "upvotes": 41,
      "replies": {
        "geqm82g": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqm82g/",
          "text": "[deleted]",
          "author": null,
          "created": 1607204213,
          "upvotes": 21,
          "replies": {
            "gequ9go": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gequ9go/",
              "text": "I have. It seems like the logical choice. But staying at my current university was a factor, and also interest, in choosing Environmental Science. I haven't really made a major decision yet so anything is on the table I suppose, I'd like to get through this first.",
              "author": "ShiftyElk",
              "created": 1607207843,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "geqkv5u": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqkv5u/",
      "text": "I'm a bio major too, planning on going into ecological research. There's bio jobs out there, depending what you want to do. You can also go to graduate school for something else, or go into an unrelated field.",
      "author": "FirestFox",
      "created": 1607203599,
      "upvotes": 45,
      "replies": {
        "gerpsxa": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerpsxa/",
          "text": "True, I know a few geologists that got a BS in bio.\n\nI also know a physiologists that’s has a BS in bio.",
          "author": "Nerobus",
          "created": 1607223484,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "geqjhqt": {
      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geqjhqt/",
      "text": "Fellow bio major here.  You can apply to any type of grad program you want. Any type of master program you want. Any type of science job you want. Prove you’re right for the part and they’ll accept you. No major is useless.",
      "author": "leaaaaaaaah",
      "created": 1607202977,
      "upvotes": 618,
      "replies": {
        "ger2gc2": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ger2gc2/",
          "text": "If they make a Twitch Streaming major you'll be wrong.\n\n&#x200B;\n\nAs someone with a dad who has a PhD in political science ( a major people clown on all the time) and makes six digits a year, no currently existing major that you've probably heard of is useless. I agree.",
          "author": "CobaltCrusader123",
          "created": 1607211616,
          "upvotes": 204,
          "replies": {
            "ges8o86": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges8o86/",
              "text": "You say that, but my school had a \"build your own major\" type of thing, and a kid apparently did \"memeology\" or something. Everyone thought it was a joke until the 2016 presidential election made memes political and he got picked up by one of the campaigns to advise about memes. His major was basically a modern anthropology major with a focus on the internet.",
              "author": "monkeymerlot",
              "created": 1607232365,
              "upvotes": 97,
              "replies": {
                "getgvtl": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/getgvtl/",
                  "text": "An “internet studies” degree actually sounds super useful. Like not necessarily an IT degree but someone who studies how that whole thing works, culturally.",
                  "author": "Jasmotron3k",
                  "created": 1607255614,
                  "upvotes": 31,
                  "replies": {
                    "geu75dk": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu75dk/",
                      "text": "Useful to society maybe. Useless for money making.",
                      "author": "ChaosLordSamNiell",
                      "created": 1607267754,
                      "upvotes": -5,
                      "replies": {
                        "geu7gl5": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu7gl5/",
                          "text": "Tell that to anyone trying to take advantage of trends not centralized to one geographic location, basically any deep-dive journalism outlet, cyber investigators, marketing agencies... I could go on but you get my drift, yeah?",
                          "author": "Jasmotron3k",
                          "created": 1607267870,
                          "upvotes": 10,
                          "replies": {
                            "geu7m48": {
                              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu7m48/",
                              "text": "\"Cyber investigators?\" No, I dont get you're drift. These aren't real jobs.",
                              "author": "ChaosLordSamNiell",
                              "created": 1607267931,
                              "upvotes": -1,
                              "replies": {
                                "geu8kfn": {
                                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu8kfn/",
                                  "text": "I mean really if you’re just worried about traditional jobs, just go to trade school. But there’s a definite need for people who have a knowledge base of important, relatively new dynamics if you can combine them with a few hard skills. I could see a program like that being a decent minor to add onto IT, cyber security, journalism, business, marketing, probably others. I mean an internet studies degree would basically a focused sociology degree in a ubiquitous topic that very few people actually understand on a deep level.",
                                  "author": "Jasmotron3k",
                                  "created": 1607268416,
                                  "upvotes": 3,
                                  "replies": {
                                    "geu8pcp": {
                                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu8pcp/",
                                      "text": "I could see it as a minor. A whole major is just too much.",
                                      "author": "ChaosLordSamNiell",
                                      "created": 1607268488,
                                      "upvotes": -1,
                                      "replies": {
                                        "geu8wlp": {
                                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu8wlp/",
                                          "text": "I mean I’m sure somebody said that about IT degrees once. I’m just saying, just because something isn’t part of the established program offerings that we’re all used to doesn’t mean it wouldn’t be super useful. Especially in a world where we still let kids take out loans to be English majors.",
                                          "author": "Jasmotron3k",
                                          "created": 1607268598,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                },
                                "geu7rfn": {
                                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu7rfn/",
                                  "text": "https://www.eldoradoinsurance.com/private-investigator-industry-news/cyber-investigator-vs-private-investigator-what-you-should-know-about-their-services/",
                                  "author": "Jasmotron3k",
                                  "created": 1607267989,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "geu94a4": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu94a4/",
                  "text": "As somebody more or less majoring in theme park management - I can only hope I'm as successful as that kid.",
                  "author": "comped",
                  "created": 1607268712,
                  "upvotes": 2,
                  "replies": {
                    "geufilx": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geufilx/",
                      "text": "Okay I'm curious, tell us more.",
                      "author": "Ayham_abusalem",
                      "created": 1607272273,
                      "upvotes": 1,
                      "replies": {
                        "geugtv3": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geugtv3/",
                          "text": "Curious about what?",
                          "author": "comped",
                          "created": 1607272979,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "geutrbw": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geutrbw/",
                      "text": "You're telling me that you're majoring in a degree that teaches you how to properly maintain huge equipment and structures that see use by 1000s of people without a single accident? \n\nNo way that'd be useful, better get a new degree. /s",
                      "author": "monkeymerlot",
                      "created": 1607279287,
                      "upvotes": 0,
                      "replies": {
                        "geuzjmu": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geuzjmu/",
                          "text": "That's more facilities management - my program's much more focused on the guest experience and general hospitality end. Which I suppose is useful, but not a hell of a lot.",
                          "author": "comped",
                          "created": 1607281658,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gerg7bp": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerg7bp/",
              "text": "I’m currently getting a poly sci degree. What does your father do for a living? I could look into it and see if I could do it as well",
              "author": "brokebacknomountain",
              "created": 1607218331,
              "upvotes": 58,
              "replies": {
                "gerj4wn": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerj4wn/",
                  "text": "He's a civilian working for the National Air and Space Intelligence Center in the US Air Force. Before, he was doing much the same job, but as a full, proper member of the Air Force.\n\nAnd before THAT he was a professor of Political Science at the Air Force Academy.",
                  "author": "CobaltCrusader123",
                  "created": 1607219777,
                  "upvotes": 60,
                  "replies": {
                    "gerjgzu": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerjgzu/",
                      "text": "Why did he technically leave the military, if you don’t mind me asking?",
                      "author": "5krishnan",
                      "created": 1607219944,
                      "upvotes": 30,
                      "replies": {
                        "gerktd6": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerktd6/",
                          "text": "Probably for the better pay, benefits and hours. (My step dad also left the military to work for them as a civilian)",
                          "author": "kimlovescc",
                          "created": 1607220590,
                          "upvotes": 29,
                          "replies": {}
                        },
                        "gerki11": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerki11/",
                          "text": "that job in particular would be done at more pay at a civilian level. Also he's getting older. \n\nThe sensitive wording of your question indicates you are a kind person. He did not leave because of any PTSD or injury. In fact, the only time he's actually been shot at was once in Afghanistan, and he didn't get hit. Regardless he served, and continues to serve, his country well.\n\nHope this helps!",
                          "author": "CobaltCrusader123",
                          "created": 1607220430,
                          "upvotes": 35,
                          "replies": {
                            "gerkq75": {
                              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerkq75/",
                              "text": "I know veterans tend to have various opinions on this but Thank you to your father for his service, and to your family. Truly. A former coworker of mine has military family and told me about how military specialties pay more outside the military; I just forgot about that lol. Thanks for letting me know",
                              "author": "5krishnan",
                              "created": 1607220537,
                              "upvotes": 18,
                              "replies": {
                                "gerltwl": {
                                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerltwl/",
                                  "text": "No need to thank me specifically- I don't serve. But thanks for the compliments about my father! And yes, it is weird that  military specialties pay more outside the military.\n\nAnd if anyone in the military is reading this-- I appreciate all you do, and please don't start WW3. We've had enough sequels already.",
                                  "author": "CobaltCrusader123",
                                  "created": 1607221195,
                                  "upvotes": 12,
                                  "replies": {
                                    "germrwm": {
                                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/germrwm/",
                                      "text": "Wholesome couple of people you two are :)",
                                      "author": "skr25",
                                      "created": 1607221767,
                                      "upvotes": 15,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gerjr8i": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerjr8i/",
              "text": "I see your poly sci and raise you “Digital Media, Arts, and Technology” degree",
              "author": "AidanTheAudiophile",
              "created": 1607220076,
              "upvotes": 12,
              "replies": {
                "gerjsh0": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerjsh0/",
                  "text": "> I see your poly sci and raise you \n\n**no string bets, please!**\n\n---\n_^(I'm a pointless bot. \"I see your X and raise you Y\" is a) ^[string](https://en.wiktionary.org/wiki/string_bet) ^[bet,](https://en.wiktionary.org/wiki/string_bet) ^(and is not allowed at most serious poker games.)_",
                  "author": "no_string_bets",
                  "created": 1607220093,
                  "upvotes": -5,
                  "replies": {
                    "gerju0o": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerju0o/",
                      "text": "Bad bot",
                      "author": "AidanTheAudiophile",
                      "created": 1607220113,
                      "upvotes": 8,
                      "replies": {
                        "gerjv8r": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerjv8r/",
                          "text": "Thank you, AidanTheAudiophile, for voting on no_string_bets.\n\nThis bot wants to find the best and worst bots on Reddit. [You can view results here](https://botrank.pastimes.eu/).\n\n***\n\n^(Even if I don't reply to your comment, I'm still listening for votes. Check the webpage to see if your vote registered!)",
                          "author": "B0tRank",
                          "created": 1607220129,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gerrxy9": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerrxy9/",
              "text": "Making money has nothing to do with education in the sense that you could be legitimately dogshit retarded and make 6 figs. An education just shows you know how to apply yourself to a certain field and have the skills to commit towards completion",
              "author": "johnbenede",
              "created": 1607224507,
              "upvotes": 10,
              "replies": {
                "geu739y": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu739y/",
                  "text": "Tell me more about making 6 figs and being dumb.",
                  "author": "kh7190",
                  "created": 1607267731,
                  "upvotes": 0,
                  "replies": {
                    "geu8jmp": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu8jmp/",
                      "text": "Lil pump?",
                      "author": "johnbenede",
                      "created": 1607268405,
                      "upvotes": 2,
                      "replies": {
                        "geu8sd5": {
                          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu8sd5/",
                          "text": "Lol I had to look up what that was",
                          "author": "kh7190",
                          "created": 1607268532,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gerjcea": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerjcea/",
              "text": "If they make a twitch streaming major you continue to be tight because of the money to be earned there. I’m confused as to what you’re saying there",
              "author": "5krishnan",
              "created": 1607219880,
              "upvotes": 5,
              "replies": {}
            },
            "gerxe7l": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerxe7l/",
              "text": "My university (Top 1 in my country, Top 5 in latin america) has a major that is essentially learning how to be an online personality...",
              "author": "coldblade2000",
              "created": 1607226939,
              "upvotes": 2,
              "replies": {
                "geu99fh": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geu99fh/",
                  "text": "I'd be interested in seeing that program in their catalog...",
                  "author": "comped",
                  "created": 1607268788,
                  "upvotes": 1,
                  "replies": {
                    "geufmyy": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geufmyy/",
                      "text": "Agreed",
                      "author": "Ayham_abusalem",
                      "created": 1607272339,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ger8fbs": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ger8fbs/",
          "text": "I have a friend of a friend who is getting an independent study triple major in Potato Science.\nDo with that information what you will.",
          "author": "dogtorjoy",
          "created": 1607214436,
          "upvotes": 45,
          "replies": {
            "gerfjqw": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerfjqw/",
              "text": "It's all fun and games til the potato famine happens",
              "author": "dyvrom",
              "created": 1607217996,
              "upvotes": 20,
              "replies": {}
            },
            "ges03fm": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges03fm/",
              "text": "I hope this major involves taste-testing different potato-based dishes. You know, for science.",
              "author": "Laurasaur28",
              "created": 1607228169,
              "upvotes": 10,
              "replies": {
                "ges6q4t": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ges6q4t/",
                  "text": "I will definitely suggest that it be added to the curriculum immediately. What *real* Potato Science major can graduate without an advanced palate of starchy dishes?",
                  "author": "dogtorjoy",
                  "created": 1607231227,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "gethbsu": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gethbsu/",
              "text": "Does she go to University of Tuber?\n\n... U Tuber as it’s known?",
              "author": "Jasmotron3k",
              "created": 1607255823,
              "upvotes": 4,
              "replies": {}
            },
            "gere0sx": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gere0sx/",
              "text": "Yes but is it from Potato College?",
              "author": "perceptionactionprof",
              "created": 1607217244,
              "upvotes": 6,
              "replies": {
                "getu2e2": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/getu2e2/",
                  "text": "You just call us 'Potato College' because we were founded by a potato!",
                  "author": "lucianbelew",
                  "created": 1607262240,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "geue160": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geue160/",
          "text": "Agreed, this really does make the difference here.",
          "author": "Spusk",
          "created": 1607271451,
          "upvotes": 1,
          "replies": {}
        },
        "ger7w5q": {
          "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/ger7w5q/",
          "text": "You can major in lesbian dance theory, some majors are useless",
          "author": "charleff",
          "created": 1607214178,
          "upvotes": -7,
          "replies": {
            "gere8wl": {
              "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gere8wl/",
              "text": "No, it's not useless. You can get into medical school with a major in dance theory.\n\nYou just need to do well in the pre-req classes.",
              "author": "Alyscupcakes",
              "created": 1607217349,
              "upvotes": 31,
              "replies": {
                "gerod2e": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerod2e/",
                  "text": "Seems more and more degrees are becoming nothing more than a pretty piece of paper unless you seek out higher education. Is master’s the new bachelor’s? How long until I need a PHD to make minimum wage? Yeesh.",
                  "author": null,
                  "created": 1607222750,
                  "upvotes": 9,
                  "replies": {
                    "gesfro6": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gesfro6/",
                      "text": "Yeah definitely this. Even with an \"in demand\" major, I still feel obligated to go to grad school to stand out/find a good career",
                      "author": null,
                      "created": 1607237035,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "getv6tt": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/getv6tt/",
                  "text": "Or you can get an academic position researching lesbian dance, or you can choreograph dances for lesbians or whoever else. Some majors definitely have a clearer path than others to a 9-5 job and financial stability, but if you really care about something, are good at it, and play your cards right you can make just about anything work",
                  "author": "SkiMonkey98",
                  "created": 1607262835,
                  "upvotes": 1,
                  "replies": {
                    "gew1wkc": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gew1wkc/",
                      "text": "\"The student becomes the master.\"",
                      "author": "Alyscupcakes",
                      "created": 1607299272,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "geri7e7": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geri7e7/",
                  "text": "I feel like that’s using poor logic. You’re basically saying that the degree is useless in terms of making a career out of it. I’m sure there’s something out there for dance theory majors but saying that they can go into medical school doesn’t really make sense. This could be sarcasm and I’m too dumb to see it though.",
                  "author": "KurisuMakise_",
                  "created": 1607219329,
                  "upvotes": -5,
                  "replies": {
                    "gero3cl": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gero3cl/",
                      "text": "Literally any major can go to medical school. You just need to satisfy some class requirements (prereqs) for them to accept you. Some med schools see med students with those types of bachelor degrees as a way to bring diversity into their classes.",
                      "author": "PhilosophicalElk",
                      "created": 1607222585,
                      "upvotes": 13,
                      "replies": {}
                    },
                    "geskw0w": {
                      "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/geskw0w/",
                      "text": "Any degree, is a stepping stone to a post graduate degree. \nAll you need is the bachelor's in literally anything, pre-req courses, and a specialized test completed like MCAT, DAT, or LSAT.\n\nBut this logic applies to absolutely every degree. You get a bachelor of science in chemistry, and find out there are no jobs with your degree, even in STEM - you can go back to school for a master's/doctorate/ specialized post-grad degree.",
                      "author": "Alyscupcakes",
                      "created": 1607239724,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gerlh2r": {
                  "link": "/r/college/comments/k7fvb1/anxiety_over_my_supposedly_useless_biology_major/gerlh2r/",
                  "text": "You failed to prove how it’s not useless",
                  "author": "Jakeremix",
                  "created": 1607220985,
                  "upvotes": -10,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634051763
}