{
  "sid": "rgdhq6",
  "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/",
  "title:": "idk what to do with office hours?",
  "text": "i see professors always suggesting to go to office hours but what do i do there? idk what to ask or talk about? for example if i’m writing a paper for a class what do i ask so i understand what the professor is expecting? ngl feel kinda dump asking this i am truly lost",
  "author": "lalinlux",
  "created": 1639505592,
  "updated": 1639856214,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.94,
  "comments": {
    "hojij45": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojij45/",
      "text": "I go if I am struggling with concepts or have questions! I usually write down what I’m going to ask about before I go. If you are struggling with a paper you could ask to show them your thesis and part of your outline or something. I would make sure to have something prepared before you go to get more out of it",
      "author": "catlover12321",
      "created": 1639506674,
      "upvotes": 7,
      "replies": {
        "hojrnef": {
          "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojrnef/",
          "text": "writing down actually seems like it may be very helpful. thanks for the tip i will definitely try.",
          "author": "lalinlux",
          "created": 1639510250,
          "upvotes": 1,
          "replies": {
            "hok82dl": {
              "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hok82dl/",
              "text": "It is also very helpful for the instructor because they can target what they cover with you if you know your weaknesses and can convey them.",
              "author": "Cletus-Van-Damm",
              "created": 1639516787,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hojmf8m": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojmf8m/",
      "text": "Along with what the others said, if the professor works in the same field as you're interested in (whether grad school, jobs, etc.), it's a good time to connect with them. Let them know what your goals are, how you plan on achieving it, etc., & see if they can help. For example, want to learn more about a type of job? They might be able to connect you with alumni in that position to tell you more about it.",
      "author": "KayBieds",
      "created": 1639508202,
      "upvotes": 6,
      "replies": {
        "hojrquw": {
          "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojrquw/",
          "text": "i see that makes a lot of sense too! i usually am afraid to take up too much of their time.",
          "author": "lalinlux",
          "created": 1639510288,
          "upvotes": 1,
          "replies": {
            "hok6b9o": {
              "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hok6b9o/",
              "text": "Very few students take advantage of office hours outside of the day before an exam/major assignment.  You won't be taking up too much of their time with these kinds of questions, I guarantee it!",
              "author": "FamousCow",
              "created": 1639516057,
              "upvotes": 8,
              "replies": {}
            },
            "hoobfqb": {
              "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hoobfqb/",
              "text": "Eh it's not taking up their time, they have literally scheduled those hours for students to come and ask questions. Moreover, professors are there because they actually like (well a lot of them at least) helping students and interacting with them. Trust me, you are not wasting their time going to office hours for sure.",
              "author": "stillslightlyfrozen",
              "created": 1639592938,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hojmdjt": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojmdjt/",
      "text": "They are there to answer your questions!  How do I do this homework problem?  What did this concept or idea from lecture mean?  Does this lab report look like what you're expecting us to turn in?  I was thinking of doing X for my research paper / project / report, does that sound like an appropriate topic?  I missed points here on this assignment / test, can you explain what I did wrong?",
      "author": "Green_343",
      "created": 1639508183,
      "upvotes": 3,
      "replies": {}
    },
    "hojr9vw": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojr9vw/",
      "text": "I totally agree. Often times I find that either I understand a class, or I don’t understand enough to even know what to ask.",
      "author": "Softpretzelsandrose",
      "created": 1639510104,
      "upvotes": 1,
      "replies": {
        "hojrhy6": {
          "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojrhy6/",
          "text": "i feel this but about coursework. usually i understand the class but not what the professors wants me to show and idk what to ask to understand.",
          "author": "lalinlux",
          "created": 1639510191,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hojiegs": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojiegs/",
      "text": "That’s exactly what they’re for. For example, I went to my chemistry lab professor’s office hours all of the time to get clarification on the lab reports.",
      "author": "COLUMBIAwindbreaker",
      "created": 1639506623,
      "upvotes": 2,
      "replies": {}
    },
    "hokct5m": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hokct5m/",
      "text": "I would go to each professor’s office hours at least once a month, if not every two weeks. \n\nProfessors are required to have them, and they’re usually bored. Bring a simple question or two, then chit chat for a bit. If you have a big assignment, talk through where you’re at and if you’re on track.\n\nIf you can’t find a question to follow up on from course notes or homework, and don’t have any project work to talk through, then you’re behind and need to be studying more.",
      "author": "peakfreak18",
      "created": 1639518704,
      "upvotes": 5,
      "replies": {}
    },
    "hokqy9p": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hokqy9p/",
      "text": "I think one of my professors aced getting students to office hours. He told us a story about a rescued fish he kept in a tank in his office and that we should just come to check it out. 90% of my profs complained that no one used the office hours and that students should just come down to hang out because the prof is bored.\n\nIf I don't have questions about an assignment specifically I use office hours to just go talk to the prof about some other aspect of what they're teaching that I'm interested in. In the margins of my notes I keep whatever question comes to mind to ask for more info about something that may have only been briefly mentioned.",
      "author": "shark_nebulae",
      "created": 1639524741,
      "upvotes": 6,
      "replies": {}
    },
    "hokz7mk": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hokz7mk/",
      "text": "Professor here -- your post has your questions you want to ask. I think you're overthinking the nature of the conversation. You don't need to have all the answers for how to engage. Just engage and the professor will take it from there. We usually begin by probing for what does make sense and then go from there.",
      "author": "CogPsychProf",
      "created": 1639528495,
      "upvotes": 4,
      "replies": {}
    },
    "hoklek1": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hoklek1/",
      "text": "For papers craft an outline and thesis and visit them in office hours. They often can point out flaws in your paper’s argument and or thesis. It’s also a way to know if your paper is outside their guidelines",
      "author": "jenniferrook9",
      "created": 1639522309,
      "upvotes": 2,
      "replies": {}
    },
    "hokp9vs": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hokp9vs/",
      "text": "Along with what everyone else is saying, it’s also a good habit to email your questions or what you’d like to talk about before arriving so they’re prepared.",
      "author": "Hermes85",
      "created": 1639523996,
      "upvotes": 2,
      "replies": {}
    },
    "hokqck3": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hokqck3/",
      "text": "My professor has open office hours in a lab for all students to talk to her after class. Even if I feel like I have a grasp on a topic, it's nice to have her nearby to clarify things when needed as i do homework.",
      "author": "Baby_Angel_0018",
      "created": 1639524472,
      "upvotes": 2,
      "replies": {}
    },
    "hol2pnc": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hol2pnc/",
      "text": "I go to office hours if I'm having issues with my code loading or I'll ask about something in the report I'm writing to make sure I'm going in the right direction",
      "author": "Waddlewaddle1015",
      "created": 1639530106,
      "upvotes": 1,
      "replies": {}
    },
    "holrrg2": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/holrrg2/",
      "text": "I relate to this so much. I don’t have trouble understanding concepts and I don’t really have any questions… sometimes students wait in line for office hours and i feel left out? Like what am I missing? Maybe I just haven’t met a professor I’m interested in.",
      "author": "hnnyrdnc",
      "created": 1639541699,
      "upvotes": 1,
      "replies": {}
    },
    "homs7tu": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/homs7tu/",
      "text": "I used to not go to office hours at all because I was always confused about what to do in office hours, but I've tried going a couple of times just to discuss my final projects or papers and ngl it's been extremely helpful, because I can just go tell the professor what I am working on/what I am struggling with, and they usually either point out if there's some issue, or point out another source I could use, or if I'm stuck, suggest another direction I can take my topic in. At one point, I've even discussed the courses I'm considering for the next semester with one of my professors lol",
      "author": "wentworthenthusiast",
      "created": 1639567645,
      "upvotes": 1,
      "replies": {}
    }
  }
}