{
  "sid": "qc0dfe",
  "link": "/r/college/comments/qc0dfe/doesdid_anybody_go_to_a_college_with_a_disability/",
  "title:": "Does/did anybody go to a college with a disability accommodation for extended time on homework assignments?",
  "text": "My college doesn't offer that and various disability groups on campus are trying to push for it, so I'm wondering about any personal experience that anybody has or a general overview of the policy at other schools. Thanks!    \n\nEdit: Yes, this is a thing that many colleges do, including [Stanford](https://oae.stanford.edu/students/accommodations-services/academic-accommodations/assignment-extensions). It is actually written into my disability accommodations letter, but my school cannot provide it. Disabled students at other universities that I've been speaking to have this accommodation.",
  "author": "onamonapiaye",
  "created": 1634735026,
  "updated": 1636182427,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhcyl2h": {
      "link": "/r/college/comments/qc0dfe/doesdid_anybody_go_to_a_college_with_a_disability/hhcyl2h/",
      "text": "I've never heard of such a policy and I doubt many - if any - instructors would permit it. To implement that accommodation, you'd need to push back the course's progress for everyone. Since the length of course is determined by the school, this just isn't practical.\n\nThere's also a question what precisely you're 'accommodating'. It's easy to see why it would take someone longer to complete a timed exam. But if it takes some five hours to complete a weekly assignment rather than two hours for a 'normal' students, that doesn't constitute a reason to change a weekly deadline. The 'accommodation' in this case would be to advise the student to take fewer classes so they have more time to complete the assignments.",
      "author": "ViskerRatio",
      "created": 1634736941,
      "upvotes": 5,
      "replies": {}
    },
    "hhd7bp0": {
      "link": "/r/college/comments/qc0dfe/doesdid_anybody_go_to_a_college_with_a_disability/hhd7bp0/",
      "text": "One of my accommodations is \"extended deadline.\" My sense is it's similar to the example you linked. Basically, it doesn't apply universally to assignments, and is there to use as needed with assignments. The expectation is that, when possible, the prof gets some notice. Obviously that isn't always possible to do with a disability, but at least at my school, they want at least a day's notice if at all possible. Some profs I've had (in courses where we just have a few very large assignments) have just set an amount of extra time that we agreed on, and I can use or not as needed.\n\n\n\nMy thought here is that folks who don't view it as reasonable will probably assume you just get unlimited extra time to do everything, but that isn't the case. The prof does have some say in what's reasonable and what isn't, and you get a very short, finite amount of extra time when you utilize the accommodation. I've found it useful when my ADHD is being particularly stubborn, since it's basically a way to legitimize a need for extensions, but it's an emergency valve, not a constant thing.",
      "author": "torgoboi",
      "created": 1634740861,
      "upvotes": 2,
      "replies": {
        "hhde2ej": {
          "link": "/r/college/comments/qc0dfe/doesdid_anybody_go_to_a_college_with_a_disability/hhde2ej/",
          "text": "thank you so much!",
          "author": "onamonapiaye",
          "created": 1634743647,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhcvk3h": {
      "link": "/r/college/comments/qc0dfe/doesdid_anybody_go_to_a_college_with_a_disability/hhcvk3h/",
      "text": "That's not a reasonable accommodation.",
      "author": "2ndChance_1stMistake",
      "created": 1634735490,
      "upvotes": 0,
      "replies": {}
    },
    "hhe733b": {
      "link": "/r/college/comments/qc0dfe/doesdid_anybody_go_to_a_college_with_a_disability/hhe733b/",
      "text": "Yes and no. I get time and a half (1.5x) on in class assignments. That includes exams, quizzes, and assignments in class. But I have also had professors give time and half on homework without asking me (usually online stuff) but usually no, I turn my homework in with everyone else.",
      "author": "Victorian_Era2",
      "created": 1634755196,
      "upvotes": 3,
      "replies": {}
    },
    "hhenxzv": {
      "link": "/r/college/comments/qc0dfe/doesdid_anybody_go_to_a_college_with_a_disability/hhenxzv/",
      "text": "No on homework. Yes on tests, exams & quizzes.\n\nHomework is given 1 week in majority of classes, or shorter number of problems if less than 1 week, like daily might have 1-2 questions.",
      "author": "roguezebra",
      "created": 1634761840,
      "upvotes": 2,
      "replies": {}
    },
    "hhg4n55": {
      "link": "/r/college/comments/qc0dfe/doesdid_anybody_go_to_a_college_with_a_disability/hhg4n55/",
      "text": "I have “extended time on assignments at times of severe worsening of *insert my disability here*. It wouldn’t be helpful to have extended time on all assignments because you still have to catch up at the end of the semester.",
      "author": "UnlikelyMarionberry",
      "created": 1634785512,
      "upvotes": 2,
      "replies": {}
    }
  }
}