{
  "sid": "q81pek",
  "link": "/r/college/comments/q81pek/accidentally_agreed_to_a_wayne_lapierre_quote_in/",
  "title:": "Accidentally agreed to a Wayne LaPierre quote in front of the whole class, definitely a good lesson in critical thinking",
  "text": "\"The only way to stop a bad guy with a gun is a good guy with a gun.\" \n\nI said this was true because I forgot it said \"only\" in the quote. I still maintain that it's not a bad way to fend for yourself as an absolute last resort if your life is in grave danger. I said I partially agree because not every \"good guy\" will remain a \"good guy,\" and that there are multiple angles to consider in a violent interaction, bad and good is binary. But then came the statistics, and other forms of facts and logic to prove the quote completely false. I just sat there in pure regret, wishing I just took a deeper look rather than a surface level evaluation. I disagree with it now, but I just wish I had considered everything before opening my mouth.\n\nI feel so dumb, but I guess you have to dare to be vulnerable and exposed in order to learn some things in life.",
  "author": "WinXP001",
  "created": 1634224305,
  "updated": 1634252161,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hgmbv2w": {
      "link": "/r/college/comments/q81pek/accidentally_agreed_to_a_wayne_lapierre_quote_in/hgmbv2w/",
      "text": "Hey man you made a \"mistake\" and learned from it :) sounds to me like you did well in the situation. Now you know what to do/what not to do to be prepared next time.",
      "author": "NicoDeshee-Hall",
      "created": 1634224521,
      "upvotes": 2,
      "replies": {}
    },
    "hgnegtq": {
      "link": "/r/college/comments/q81pek/accidentally_agreed_to_a_wayne_lapierre_quote_in/hgnegtq/",
      "text": "I really hate when professors ask you to agree or disagree with statements, rather than asking our thoughts on the statement. Completely disregards nuance and critical thinking skills which is what college is supposed to help us get better at :/",
      "author": "ourhouse1970",
      "created": 1634240460,
      "upvotes": 1,
      "replies": {}
    }
  }
}