{
  "sid": "r5b3gb",
  "link": "/r/college/comments/r5b3gb/not_sure_where_to_transfer/",
  "title:": "not sure where to transfer",
  "text": "i don’t like my current school, and am looking around for where to go. i’m in between 3 or 4 colleges. some being in completely different areas that i’m in rn. i’m not sure what’s the right move. one of the colleges is bc i have a friend that goes there and we still talk even after we’ve graduated HS and well before i told her i wanted to transfer. it’s nice having someone i know go to my school but i also don’t know if i only want to go there just bc she’s there. how do y’all choose where you want to go? i don’t want to transfer to a million places lol. i know the school i’m at doesn’t feel right at all for me so i understand that feeling. is there anything more i should look into and consider when it comes to transferring other than money?",
  "author": "layz02",
  "created": 1638235469,
  "updated": 1638480535,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmm01l1": {
      "link": "/r/college/comments/r5b3gb/not_sure_where_to_transfer/hmm01l1/",
      "text": "You kinda have to assess why you are transferring in the first place and be more specific. Do you want to move farther out from home or do you want to be closer to home? Are you not feeling academically challenged or do you want to go to one that’s not as rigorous? Not having the major you want or looking to one that has a better program? Or is it the environment itself? Is there no school spirit? Do you want more sorority/fraternity culture or not much at all? Is the big state school not what you’re looking for or do you want to go to a big school from a small college? \n\nOnce you think about these questions, then take a visit to each of the schools. I’m just now doing this as a sophomore in college and it’s really helped me in having a feel for the school I want to apply to. Since I want to go to a school that is more rigorous and has more school spirit, I have a top choice and have another one I’d like to go just in case I don’t get into the first one. continue doing your research into these colleges since you’ll know what you’re looking for now and you’ll find the right one soon",
      "author": "RichRektz",
      "created": 1638238301,
      "upvotes": 2,
      "replies": {
        "hmm0usd": {
          "link": "/r/college/comments/r5b3gb/not_sure_where_to_transfer/hmm0usd/",
          "text": "these are great questions.. thank you so much! i’ll think it over and see where my heads at. thanks again!",
          "author": "layz02",
          "created": 1638238663,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmlu3bc": {
      "link": "/r/college/comments/r5b3gb/not_sure_where_to_transfer/hmlu3bc/",
      "text": "Tour the schools you are looking at and see which ones you like best",
      "author": "elkfn2",
      "created": 1638235573,
      "upvotes": 1,
      "replies": {
        "hmlu9y4": {
          "link": "/r/college/comments/r5b3gb/not_sure_where_to_transfer/hmlu9y4/",
          "text": "one of them is 2 hours out and i’m not sure i can find a ride to and from, anything else i could/should do?",
          "author": "layz02",
          "created": 1638235656,
          "upvotes": 1,
          "replies": {
            "hmlw2j9": {
              "link": "/r/college/comments/r5b3gb/not_sure_where_to_transfer/hmlw2j9/",
              "text": "Their websites might have virtual tours up there",
              "author": "elkfn2",
              "created": 1638236480,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}