{
  "sid": "q2av2s",
  "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/",
  "title:": "What happen if I drop this semester and start the next semester when it comes?",
  "text": "I'm currently a freshman in college and I am  overwhelm with work and personal struggles so I don't have time for college atm and I'm wondering if I can drop this semester and start the next semester when it comes. Does it affect anything on my transcript or what?",
  "author": "Doujinshi_Pixel",
  "created": 1633486020,
  "updated": 1634083711,
  "over_18": false,
  "upvotes": 29,
  "upvote_ratio": 0.91,
  "comments": {
    "hfk1ju6": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk1ju6/",
      "text": "You might also have some trouble with financial aid, especially if you do not do well your second semester or drop again.",
      "author": "safespace999",
      "created": 1633486573,
      "upvotes": 22,
      "replies": {}
    },
    "hflby2g": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hflby2g/",
      "text": "Professor here: I’m sorry you’re having a bad first semester. Please go see your academic advisor and follow their advice instead of what you read on Reddit. (We don’t know your financial aid situation, for example.) Good luck!",
      "author": "DarciKracht",
      "created": 1633520125,
      "upvotes": 22,
      "replies": {}
    },
    "hfk0wx1": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk0wx1/",
      "text": "You would have all Ws on your transcript. So there would be history of you dropping all the classes permanently.",
      "author": "rynpickles",
      "created": 1633486262,
      "upvotes": 33,
      "replies": {
        "hfk1h5y": {
          "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk1h5y/",
          "text": "Does that affect anything? I'm a freshman so I'm still getting the hang of it.",
          "author": "Doujinshi_Pixel",
          "created": 1633486537,
          "upvotes": 6,
          "replies": {
            "hfk1pq8": {
              "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk1pq8/",
              "text": "potentially it could yeah. It will put you behind a semester and if you get more Ws or get low grades your chances of getting into higher education or transferring to a new school become slimmer.",
              "author": "rynpickles",
              "created": 1633486653,
              "upvotes": 24,
              "replies": {
                "hfk1wf5": {
                  "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk1wf5/",
                  "text": "Can I take a summer semester to bring myself back up?",
                  "author": "Doujinshi_Pixel",
                  "created": 1633486743,
                  "upvotes": 5,
                  "replies": {
                    "hfk2a2s": {
                      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk2a2s/",
                      "text": "unlikely. Not all classes you may need are offered in the summer and it’s typically pay per credit so it would be expensive to do 5-6 classes. \n\nIf your mental health is really deteriorating then withdraw from this semester but don’t come back until you are 100% ready. One semester can be explained away but a pattern of Ws can’t.",
                      "author": "rynpickles",
                      "created": 1633486921,
                      "upvotes": 36,
                      "replies": {
                        "hfk2nuw": {
                          "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk2nuw/",
                          "text": "I see. Thanks for the help.",
                          "author": "Doujinshi_Pixel",
                          "created": 1633487105,
                          "upvotes": 6,
                          "replies": {
                            "hfnaxu4": {
                              "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfnaxu4/",
                              "text": "Don't listen to Negative Nancy over there, coming from someone who has failed and gotten W's, as long as you take the same class again sometime in the future and get a passing grade then your F or W disappears from your transcripts. And as far as transferring goes, unless you're trying to go for Harvard or some Richey Rich private school, then you won't have to worry about that at all. Honestly public universities are cheaper and offer the same education as expensive private universities.",
                              "author": "Ph03n1x_5",
                              "created": 1633551942,
                              "upvotes": 3,
                              "replies": {
                                "hfne3h4": {
                                  "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfne3h4/",
                                  "text": "Not for my school. The W or F remains on your transcript forever but it won’t be computed into your overall gpa. The max you can use this is 5 times, not unlimited.",
                                  "author": "Awesome_Day123",
                                  "created": 1633553296,
                                  "upvotes": 4,
                                  "replies": {
                                    "hfnibhm": {
                                      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfnibhm/",
                                      "text": "Weird...but does it show up when you transfer? I transferred from another school and the classes I dropped there didn't show up on my transcripts. Also do public universities actually care about W and F? I'm still at community college so I wouldn't know.",
                                      "author": "Ph03n1x_5",
                                      "created": 1633555119,
                                      "upvotes": 1,
                                      "replies": {
                                        "hfnw9l4": {
                                          "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfnw9l4/",
                                          "text": "It’s on the official transcript so yes, the new school will see it when you’re applying. Public universities may or may not care. It really depends where you go. The less competitive ones probably won’t care as much.",
                                          "author": "Awesome_Day123",
                                          "created": 1633561546,
                                          "upvotes": 6,
                                          "replies": {
                                            "hfnxcu0": {
                                              "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfnxcu0/",
                                              "text": "I mean I get guaranteed entry to a big public university so....Weird though how your school doesn't replace the bad grade with a better one if you retake the same exact class.",
                                              "author": "Ph03n1x_5",
                                              "created": 1633562091,
                                              "upvotes": 1,
                                              "replies": {
                                                "hfqbf35": {
                                                  "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfqbf35/",
                                                  "text": "It’s not negative to put things bluntly. Most Universities don’t replace your W/F grade, that’s just the way it is.",
                                                  "author": "rynpickles",
                                                  "created": 1633616055,
                                                  "upvotes": 0,
                                                  "replies": {
                                                    "hfqecep": {
                                                      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfqecep/",
                                                      "text": "Even if they don't, does it really matter if I get guaranteed admission anyways?",
                                                      "author": "Ph03n1x_5",
                                                      "created": 1633617354,
                                                      "upvotes": 0,
                                                      "replies": {
                                                        "hfqj5bi": {
                                                          "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfqj5bi/",
                                                          "text": "Not particularly? but you may want to make sure your admission isn’t contingent on anything.",
                                                          "author": "rynpickles",
                                                          "created": 1633619421,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "hfqjuaj": {
                                                              "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfqjuaj/",
                                                              "text": "Nah, it's because my school has a partnership with a big university so they offer that. But as far as I know, it's not uncommon for a smaller schools like a community college to offer guaranteed admission. You may want to check for yourself, it's a great way to save money on college applications.",
                                                              "author": "Ph03n1x_5",
                                                              "created": 1633619715,
                                                              "upvotes": 1,
                                                              "replies": {
                                                                "hfrqcea": {
                                                                  "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfrqcea/",
                                                                  "text": "It’s typically a statewide agreement between universities & their community colleges and all of them are contingent for guaranteed admission. I’m almost done with school so I don’t need it but it’s a good option financially for those who need it.",
                                                                  "author": "rynpickles",
                                                                  "created": 1633637179,
                                                                  "upvotes": 2,
                                                                  "replies": {}
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfk1vgu": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk1vgu/",
      "text": "You will be behind a semester. Also I think any scholarships for the semester will be void so you will probably have to pay a semester out of pocket",
      "author": "GoldRequest",
      "created": 1633486730,
      "upvotes": 11,
      "replies": {}
    },
    "hfkhp0g": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfkhp0g/",
      "text": "My advice is to finish this semester and see how you feel when the next semester starts. If you feel like you need to take a break, do it! It’s ok if you graduate later than you hoped. Take a break, work/find your passion, and take care of your mental health.",
      "author": "MoodyBoi9",
      "created": 1633495357,
      "upvotes": 8,
      "replies": {
        "hflosq7": {
          "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hflosq7/",
          "text": "I agree. It took me one semester to realize that I truly hated it. You might just be uncertain for now",
          "author": "hyeloop",
          "created": 1633527337,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfk5oyf": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfk5oyf/",
      "text": "Try to finish the semester, and take a break afterwards.",
      "author": "JupiterRocket",
      "created": 1633488615,
      "upvotes": 15,
      "replies": {}
    },
    "hfkiys9": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfkiys9/",
      "text": "No issue really. If you have other stuff going on that’s more important, well then you better take care that more important stuff. Some people will say having a bunch of W’s looks bad, but I disagree. For a couple reasons. First reason is that your transcript doesn’t really matter unless you plan on going to grad school. If you don’t plan on going then great not to worry. If you do plan on it you can cite withdrawing for personal reason. It’s your first semester and if you withdrew form every class that’s not going to look bad.\n\nSecond reason is that a job probably won’t ask to see your transcript for anything more than proof of degree. And if you withdraw it wont affect your GPA, and there’s no sense in wasting time with classes if you have other stuff going. I don’t know what that other stuff is, but I’m going to assume that’s it’s more I important than your classes. \n\nAt the end of the day college isn’t going anywhere. If you need to leave and come back when you’re ready then that’s what you should do. \n\nThe only real issue you may have is if it’s related to financial aid, scholarships etc. But I can’t really answer that for you.",
      "author": "HighwayDrifter41",
      "created": 1633496198,
      "upvotes": 5,
      "replies": {}
    },
    "hfkgx00": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfkgx00/",
      "text": "Yes, it affects financial aid and you’ll be a semester behind (which means you’ll do school for another semester).\n\nSeek a counselor but keep going through with work. You only have 10 more weeks to go through. It’ll go fast for you.",
      "author": "kims681",
      "created": 1633494857,
      "upvotes": 8,
      "replies": {}
    },
    "hfnmapd": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfnmapd/",
      "text": "It happened to me last year fall 2020. I was also dealing with private issues and was just not able to concentrate on school. So I dropped it. I got W’s for all classes, which were 4. I have since retaken the classes and applied to a 4-year-college. They haven’t said anything to me about the W’s and I was admitted. I did have to pay back a small portion if my financial aid. If you feel like you just can’t focus on your classes, dropping them might be better than having all F’s or in general bad grades. Essentially, you should always consult your advisor and your financial aid office. Good luck to you 🍀",
      "author": "lastqueen86",
      "created": 1633556897,
      "upvotes": 3,
      "replies": {}
    },
    "hfmid3i": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfmid3i/",
      "text": "The only real affects are going to be falling behind in your timeline and several Ws (as well as losing some cash, can’t imagine you’re going to get a full refund at this point). Some schools, advisors, professors, etc can take things harder on students who “have a history of withdrawing.”",
      "author": "Liam8482",
      "created": 1633539900,
      "upvotes": 2,
      "replies": {}
    },
    "hfoemae": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfoemae/",
      "text": "Well if you’re in between your courses then yes it will affect your GPA and possible pell grants. if you have the chance to withdraw from your courses then do it but keep it mind that you probably won’t receive a refund for those courses. I’d recommend finishing the courses you currently have and then proceed to take a break. I’m also a freshman and I completely understand. I just got done with 2 finals this week ( 8 week courses ).",
      "author": "josh19leundes",
      "created": 1633570340,
      "upvotes": 2,
      "replies": {}
    },
    "hfp4hwh": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfp4hwh/",
      "text": "It is TOTALLY OKAY to withdraw a semester/quarter. At the end u will graduate if it is what u wish. But you MUST talk to your college counselor before dropping any classes. Some times they can come up with useful solutions! They may email your prof to extend deadlines for you if needed or they may suggest you pass/no pass all your courses instead of withdraw.",
      "author": "MaterialEmotional999",
      "created": 1633585082,
      "upvotes": 2,
      "replies": {}
    },
    "hfli4vc": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfli4vc/",
      "text": "Ok for my Uni, idk if it works the same as urs but I also felt overwhelmed so I opted for a “special study plan” whereby I extended my course duration by a semester and just had the modules more spread out",
      "author": "jocelyn_paradoxx",
      "created": 1633523878,
      "upvotes": 1,
      "replies": {}
    },
    "hfmojgp": {
      "link": "/r/college/comments/q2av2s/what_happen_if_i_drop_this_semester_and_start_the/hfmojgp/",
      "text": "It depends on how many classes you are taking maybe full time ain’t the way. But depending on what classes you are taking you may benefit from dropping 1 or 2. You are trying to go nuclear without weighting your options, as there usually are some classes that aren’t to high maintenance. Also what about cutting down on work or the other personal  issues  you have going on id start there if i were you",
      "author": "Coldarturo",
      "created": 1633542438,
      "upvotes": 1,
      "replies": {}
    }
  }
}