{
  "sid": "qu0uke",
  "link": "/r/college/comments/qu0uke/do_most_native_english_speakers_in_college_really/",
  "title:": "Do most native English speakers in college really have poor writing skills?",
  "text": "I have read posts on r/professors lamenting on the poor writing skills that many college students, and even many college graduates, display on their essays.\n\nI am a non-native English speaker, so I am particularly interested in this topic. I am deeply immersed in American media and culture, so I made it my mission to improve my writing skills for job prospects. \n\nI have a low GPA, but seeing as writing skills, a fundamentally important skill for communication purposes, is lacking among college students, then perhaps I can capitalize on this shortcoming in the job market?\n\nI used to work as an analyst and writing skills were pivotal to my position. The job was done remotely, so I mostly communicated with external personnel via email. It was difficult to write informative emails with little to no grammatical errors because my writing skills were poor. Some of the people who I have interacted with were high-level employees in their respective organization, and they typically tend to be less patient with sloppy or uninformative emails. I can inferred from the tone of the emails that these representatives expect high-quality writing, at least writing that conveys the points across effectively.",
  "author": "Enrichmentzin",
  "created": 1636927872,
  "updated": 1637181662,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hknu025": {
      "link": "/r/college/comments/qu0uke/do_most_native_english_speakers_in_college_really/hknu025/",
      "text": "I am a native English speaker and take a lot of pride in my writing, but honestly, I’ve been absolutely SHOCKED by some of my peer’s pieces. I am currently enrolled in a creative writing class which is a 200 level course and we all read and critiqued each others pieces and many of these pieces could have been written by middle schoolers based on grammatical errors. I don’t honestly know if it is a lack of caring, laziness, or what it might be, but it was extremely disappointing because I figured that the higher level class might weed out people who didn’t want to put in the effort. \n\nIf you can capitalize on it, but all means do!",
      "author": "mutual-cacophany",
      "created": 1636937866,
      "upvotes": 7,
      "replies": {}
    },
    "hknj8em": {
      "link": "/r/college/comments/qu0uke/do_most_native_english_speakers_in_college_really/hknj8em/",
      "text": "As a professor, yes, I think that many native speakers have poor writing skills.  Grammar, syntax and structure are simply not emphasized in high schools. It may be because teachers are too overworked to provide detailed feedback on writing assignments.",
      "author": "time2trouble",
      "created": 1636933011,
      "upvotes": 3,
      "replies": {}
    },
    "hknwfwv": {
      "link": "/r/college/comments/qu0uke/do_most_native_english_speakers_in_college_really/hknwfwv/",
      "text": "I can literally count on my hands how many times there was any focus on grammar in school. However, this experience may vary by type of school (private, public, charter, homeschool, etc.) and by state- I learned grammar and phonics as part of my homeschool curriculum as a child, but we really only covered the absolute basics in public school for example. \n\nThere's also just the fact that we're over-tested, and those tests tend to be more multiple-choice than essay based. And if you don't use skills, you don't get better at them. For context, I did some essay writing in 8th grade (age 13/14), but really essay writing started picking up around 10th (age 15/16). In AP classes, which offer the chance to get college credit if we pass the appropriate test in May, we're taught to not stress about the quality, just get our points down. Because we have 45 minutes-ish to write an essay for a prompt we've never seen before (Note: there's like 2-3 essays on history and English AP tests, depending on the specific subject, to be done in a little over 2 hours).\n\nUltimately, it's at least, in part, a systematic issue. However, if you can somehow manage to capitalize on it, by all means do so.",
      "author": "KittyAutor",
      "created": 1636939019,
      "upvotes": 1,
      "replies": {}
    }
  }
}