{
  "sid": "qbonwf",
  "link": "/r/college/comments/qbonwf/what_should_i_consider_taking_up/",
  "title:": "What should I consider taking up?",
  "text": "18M\n\nI just simply can’t decide \n\n(Don’t worry, I won’t be signing up for a degree I don’t want just because you guys told me to. I’m just hoping you guys can help me narrow down the directions)\n\n\n**A bit about me**\nI am currently working as a low tier tv celebrity lol yeah shallow job title \n\nI work on tv as an actor, singer, host and dancer on Philippine television. I am currently a semi lead for a prime time tele-novela\n\nPre-coof I did concerts, live guest performances, judging for events, endorsements, serenading at pageants, and seminars on the business of entertainment and the marketing\n\nIn younger years (13-14) I wanted to become a dermatologist or at the very least a nurse but I kinda went away from that idea growing up.\n\n**Currently my hobbies and interests are:**\n-economics \n-general finance \n-accountancy \n-business \n-construction \n-interior design and decorating \n-creating renderings of my renovated house \n-political science (I independently studied theory for a year for whatever reason)\n-photography \n-videography \n-editing videos \n-restaurants \n-cooking \n-wood working\n-leading people and bringing people together \n-general art and music \n-talking to people\n-meeting new people\n\n\nI know have more hobbies and interests but this is all of what I can think of at the moment",
  "author": "Pleural_Mesothelioma",
  "created": 1634689021,
  "updated": 1634750295,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhax3xn": {
      "link": "/r/college/comments/qbonwf/what_should_i_consider_taking_up/hhax3xn/",
      "text": "What you already learned and accomplishes is impressive.\n\nI think all will depend on what you want to do in the future, for example if you want to continue acting and maybe producing, you might want to learn more literature (history, philosophy, storytelling... etc)\n\nThis will enable you to create more imaginative and deeper works of art\n\nSo the question is, do you want to have a career on the media industry, or you want a new direction?",
      "author": "E-Engineer20Q",
      "created": 1634689972,
      "upvotes": 1,
      "replies": {
        "hhaxy9o": {
          "link": "/r/college/comments/qbonwf/what_should_i_consider_taking_up/hhaxy9o/",
          "text": "Right, It’s very common for people in my industry to transition from being actors and becoming producers/directors or even writers. \n\nI think time trying to get something in college was more of trying to create a bit of sense of extra security and extra income instead of necessity.  For Example, when I have my low’s or time off and I don’t get any movie or program/series work for a couple months, at least I could go work during my down town and keep making money",
          "author": "Pleural_Mesothelioma",
          "created": 1634690366,
          "upvotes": 1,
          "replies": {
            "hhbc71d": {
              "link": "/r/college/comments/qbonwf/what_should_i_consider_taking_up/hhbc71d/",
              "text": "You should think about if you want to plan for success (Plan A as the main focus ) or plan conservatively (Plan B taking part of your focus )\n\nIf you plan with the assumption of success, you will focus on learning a major that support plan A.\n\nIt depends on the country, the career and the person. Sometimes the focus on Plan B will take away from your potential",
              "author": "E-Engineer20Q",
              "created": 1634697036,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}