{
  "sid": "q30c01",
  "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/",
  "title:": "Why can't students in the USA not go to med or law school right away?",
  "text": "First of all, I'm not sure if I'm correct with my assumption, but to me it seems like this:\n\nSo people in the US need at least a bachelor's degree in pretty much anything before they can go on to law or med school?\nIs this obligatory? Are there exceptions?\n\nIf my assumption is true or not, I see too many people going this route. Why ?\nWhat's the point of studying something which doesn't help you one bit towards becoming a lawyer or an MD?\n\nI'm asking because in my country (Germany) it is completely different. You start right away after your Abitur (should be a-level highschool). If your grades are good but not good enough you can choose to wait \"wait\", and every semester not studying at any university is counting towards credit to let you in the near future.\n\nIt takes so long to become an MD or a full-blown lawyer, why prolong it by having this mundane requirement.\n\nI hope you guys can enlighten me on this matter!!",
  "author": "dartthrower",
  "created": 1633577490,
  "updated": 1634083637,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hfove50": {
      "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfove50/",
      "text": "It’s a little arbitrary, especially for law, but for med school in particular there are some advantages, namely that it gives an opportunity to take prerequisite basic science classes (organic chemistry, biochemistry, biology, etc.) that are good preparation for med school. This also allows US medical school to be just 4 years, as opposed to usually longer in Europe. Not to mention the benefits of having the academic maturity that comes with having a bachelor’s already.",
      "author": "DarthKnah",
      "created": 1633579316,
      "upvotes": 8,
      "replies": {}
    },
    "hfov19i": {
      "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfov19i/",
      "text": "In the US medical schools require a bachelors degree plus specific pre-med classes to prepare you for medical school. Law schools require a bachelors degree but they don’t have prerequisite classes as far as I know. For both you have to take and pass the entrance exam, MCAT for medical school, LSAT for law school.\n\nThe reason why we can’t do it like Germany where you go directly to med school or law school I’m guessing is because our high schools don’t even come close to preparing people for that. Our students would drown going straight into med school lol.",
      "author": "ilikecacti2",
      "created": 1633579105,
      "upvotes": 8,
      "replies": {
        "hfp12xt": {
          "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfp12xt/",
          "text": "> The reason why we can’t do it like Germany where you go directly to med school or law school I’m guessing is because our high schools don’t even come close to preparing people for that. Our students would drown going straight into med school lol.\n\nYe seems so, Year 10-12 (or 11-13 how it used to be) are always A-levels, everybody else mostly leaves school after 10th grade.\n\nWhile in the US your high school diploma doesn't carry as much weight and you go into college and do many things we do in normal school !\nI was so surprised to see so many US college students doing gen ed crap.",
          "author": "dartthrower",
          "created": 1633582644,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hfov271": {
      "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfov271/",
      "text": "Most students that want to go to med school or law school get an undergrad degree in something related. For example, biology undergrad degree to apply to med school, or PolySci degree to apply to Law school. I'm not entirely sure why it works this way, if I had to guess I would say that they want to weed out people who won't commit to finishing a Bachelor's instead of having them drop out a few years into med or law school. When I was looking at going to school overseas, I think med school was something like 6 years, but no undergrad degree so about one or two less than in the US. If I went through five years of med school and had to drop for some reason, I would have nothing besides some random college credits. If I got an undergrad in the first 4/5, then went to med school and dropped out, I would at least have a degree to fall back on. \n\nThere might be other reasons why this is the case, but it kind of makes sense to me. We do it for other fields as well. If you want to get a Doctorate in Physics, you don't go straight into a Ph.D. program, you start with undergrad.",
      "author": "Hunt3r8806",
      "created": 1633579121,
      "upvotes": 3,
      "replies": {
        "hfowqpg": {
          "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfowqpg/",
          "text": "> Most students that want to go to med school or law school get an undergrad degree in something related. For example, biology undergrad degree to apply to med school, or PolySci degree to apply to Law school. I'm not entirely sure why it works this way, **if I had to guess I would say that they want to weed out people who won't commit to finishing a Bachelor's instead of having them drop out a few years into med or law school**.\n\nThere are other ways to weed out people. Make it tough from the beginning and weed out ppl by exams. That's how Germany mostly does it.\n\n> There might be other reasons why this is the case, but it kind of makes sense to me. We do it for other fields as well. If you want to get a Doctorate in Physics, you don't go straight into a Ph.D. program, you start with undergrad.\n\nNah, that is a completely different matter. Obviously you need a bachelors (and in most cases a master's) in Physics before you can get a Ph.D. in that area,\nYou just need the knowledge to be able to do research in it.\nIt would be the equivalent of being someone who just started med school and doing coursework people do who are in their last semester.",
          "author": "dartthrower",
          "created": 1633580096,
          "upvotes": -1,
          "replies": {
            "hfpx3c3": {
              "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfpx3c3/",
              "text": "This doesn't make sense to me. If you're promoting an exam to get into med school (which we have already), you need prerequisite knowledge to go into that exam, just like you need prerequisite knowledge to go into a PhD. If anything, I think that weeding is *more* important. If someone can't function in that competitive environment or get through their prereqs, I *definitely* don't want them diagnosing me.\n\n\nThe other thing is... I don't know what it's like where you're from, but all schools certainly are not created equal in the US. If you throw folks in to sink or swim straight out of high school, your exam scores are gonna be disproportionately weighted towards schools in higher income areas, much like standardized tests already are. Coming from a poor rural school, I can tell you with certainty that our math and science skills would *not* be ready for med school.",
              "author": "torgoboi",
              "created": 1633608783,
              "upvotes": 4,
              "replies": {
                "hg2c3nc": {
                  "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hg2c3nc/",
                  "text": "> This doesn't make sense to me. If you're promoting an exam to get into med school (which we have already), you need prerequisite knowledge to go into that exam, just like you need prerequisite knowledge to go into a PhD.\n\n> If anything, I think that weeding is more important.\n\n> If someone can't function in that competitive environment or get through their prereqs, I definitely don't want them diagnosing me.\n\nI think you don't get my point. Why waste 4 years on a stupid undergrad degree which has little value and benefits for your medical career when you could take the premed classes in the med degree itself?!\nJust put the subjects relevant to a medicine degree towards the start of the full medicine degree and weed people out that way. Easy. No need to take the detour route.\n\nIf someone fails them or just isn't cut out to continue they just fail or abort.\n\nThis is the problem with the US college system, people just pass classes almost automatically. Here in europe you have to earn it.\n\nI don't wanna know how many years you lose because you have to do the full undergrad crap even though you just want to study medicine.\n\n> The other thing is... I don't know what it's like where you're from, but all schools certainly are not created equal in the US. If you throw folks in to sink or swim straight out of high school, your exam scores are gonna be disproportionately weighted towards schools in higher income areas, much like standardized tests already are. Coming from a poor rural school, I can tell you with certainty that our math and science skills would not be ready for med school.\n\nWhy is there even a difference? All high schools should be created equal (or almost equal). As I said, the american school system is just downright garbage.",
                  "author": "dartthrower",
                  "created": 1633838065,
                  "upvotes": 0,
                  "replies": {
                    "hg2i3x8": {
                      "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hg2i3x8/",
                      "text": ">Why waste 4 years on a stupid undergrad degree which has little value and benefits for your medical career when you could take the premed classes in the med degree itself?! Just put the subjects relevant to a medicine degree towards the start of the full medicine degree and weed people out that way. Easy. No need to take the detour rate.\n\n\nI don't see why having more extensive training and rigor hurts a field like medicine. At least in the US, every graduate degree I know of requires an undergrad education, and other programs like law school require exams. Why should we eliminate that?\n\n\n>This is the problem with the US college system, people just pass classes almost automatically. Here in europe you have to earn it.\n\n\nThat absolutely is not the case, and it's frankly laughable for you to say that as someone outside of the system. Pre-med is pretty notorious for being competitive and weeding people out with the rigor.  \n \n\n>I don't wanna know how many years you lose because you have to do the full undergrad crap even though you just want to study medicine.\n\n\nI mean... undergrad is four years. It's even less if you do things like take a higher course load or take courses in the summer. And like I said, literally every other grad program here expects the same amount of time. If someone doesn't want to commit a couple more years, they're probably better off pursuing a career that takes fewer qualifications and gives better work-life balance. \n\n\n\n>Why is there even a difference? All high schools should be created equal (or almost equal). As I said, the american school system is just downright garbage.\n\n\nAgain, I'm not sure how you can be so presumptuous as to say it's garbage when you don't seem to know the first thing about it. There are certainly negative aspects of our education, but I have yet to see any evidence that the system you're under is any better.",
                      "author": "torgoboi",
                      "created": 1633841543,
                      "upvotes": 1,
                      "replies": {
                        "hg2j69d": {
                          "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hg2j69d/",
                          "text": "> I don't see why having more extensive training and rigor hurts a field like medicine. At least in the US, every graduate degree I know of requires an undergrad education, and other programs like law school require exams. Why should we eliminate that?\n\nDo you even understand what I'm writing ??? I am not against making it easier or removing obstacles, I am against wasting time on a full undergrad degree (instead of just getting the prerequirements for medicine) when all you want is to study medicine. That undergrad degree has tons of courses which have nothing to do with medicine. What's the point of learning that crap??\n\nPeople in my country start right away. Getting in is extremely hard, like 95% of ppl in it finish it anyway cause they weeded out the others before even getting in. Don't have to worry about people quitting halfway through. Being able to study medicine is a privilege not many who get throw away.\n\nLet the full undergrad degree experience exist for others, but a time-consuming major such as medicine doesn't need useless fluff added in.\n\n> Again, I'm not sure how you can be so presumptuous as to say it's garbage when you don't seem to know the first thing about it. There are certainly negative aspects of our education, but I have yet to see any evidence that the system you're under is any better.\n\nIt is widely better. Our system is based on the scandinavian model. Look it up.\nSadly, germany's system went to shit in recent decades, but the swiss, norwegian or swedish, finnish system are definitely superior.\nI don't need to know the ins and outs of the entire american school and college system to have an opinion. I think I know enough to know it's garbage.",
                          "author": "dartthrower",
                          "created": 1633842251,
                          "upvotes": 1,
                          "replies": {
                            "hg2l85b": {
                              "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hg2l85b/",
                              "text": ">Do you even understand what I'm writing ??? \n\nYou can stop with the attitude. I can read just fine; you're just talking in circles and getting upset when someone is critical of your (uninformed) opinion. \n\n\n>I am not against making it easier or removing obstacles, I am against wasting time on a full undergrad degree (instead of just getting the prerequirements for medicine) when all you want is to study medicine. That undergrad degree has tons of courses which have nothing to do with medicine. What's the point of learning that crap??\n\n\nThat is literally the process of every graduate school pathway in the US, as I have explained multiple times. There's absolutely value to those courses; I certainly don't want a doctor who hasn't had any exposure to cultural material that might make them more sensitive to a diverse patient base, which is what many gen eds are structured to do. I also wouldn't particularly trust someone to practice medicine here in the US if they couldn't get through the rigor of pre-med programs for 4 years, especially hearing what I've heard from folks who teach those required courses.\n\n\n>Let the full undergrad degree experience exist for others, but a time-consuming major such as medicine doesn't need useless fluff added in.\n\n\nAgain, not sure how you can say it's \"useless fluff\" when you aren't in our system to experience it. But if a couple extra years to develop a more well-rounded skill set is enough to take people away from being doctors, again, it likely wasn't the career track for them. And again, you have yet to explain why something that has been deemed part of the qualification (ie, a certain amount of hours dedicated to baseline academic study) is necessary for *entry level* careers and other graduate degrees, why it shouldn't be for a career like medicine where you could literally kill someone. And no, \"this is more time\" and \"my country do it this way\" are not convincing arguments.\n\n\n\n>I don't need to know the ins and outs of the entire american school and college system to have an opinion. I think I know enough to know it's garbage.\n\n\nClearly you don't know anything about it, but I guess it's the cool thing for people outside the US to shit on its system without any quantifiable reason than \"Well WE do it this way.\"",
                              "author": "torgoboi",
                              "created": 1633843677,
                              "upvotes": 1,
                              "replies": {
                                "hg2ovhl": {
                                  "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hg2ovhl/",
                                  "text": "> Again, not sure how you can say it's \"useless fluff\" when you aren't in our system to experience it. But if a couple extra years to develop a more well-rounded skill set is enough to take people away from being doctors, again, it likely wasn't the career track for them. **And again, you have yet to explain why something that has been deemed part of the qualification (ie, a certain amount of hours dedicated to baseline academic study) is necessary for entry level careers and other graduate degrees**.\n\nAre you literally dumb?!?\n90-95% of what you learn in your undergrad before you start med school is USELESS. Period. You don't need anything of it in med school.\n\nPeople could go to med school without doing any of those unnecessary things and would be just fine. Come back to me when this premise is wrong.\n\nIf there is a prerequisite they need to get before starting med school.. well put that requisite right at the beginning of med school. Problem solved. Time saved.\n\n> why it shouldn't be for a career like medicine where you could literally kill someone\n\nWhere did I ever advocate for skipping stuff like that?! Again, learn to read. I want to skip the unnecessary stuff. So you don't have to waste 4 years after high school just to be able to start studying medicine.\nA full medicine degree in any other country not following the american system has all the necessary stuff baked into itself. There is no need for a stupid undergraduate degree which isn't even about medicine to begin with.\n\n> There's absolutely value to those courses; I certainly don't want a doctor who hasn't had any exposure to cultural material that might make them more sensitive to a diverse patient base, which is what many gen eds are structured to do.\n\nGen ed? We do that shit in normal school! *Before* university. No one in university here does stuff like that. All classes are for your degree (maybe a minor too) and that's it.\nWhy the fuck would you take chemistry classes when studying american literature?! That shit stops after regular school here.\n\nIf you can't see how stupid and unlogical the american education system is then sorry, I cannot help you either.\n\nAll this undergad bullshit is only necessary so ppl stay in school longer and pay more money to the government. Nothing else.",
                                  "author": "dartthrower",
                                  "created": 1633846350,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfoz7t6": {
      "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfoz7t6/",
      "text": "Yes thats the way it works in the US.  Most students aren’t sure what they want to study much less their career aspirations. Many change their minds and abandon medicine as a career so it’s important they have a path to another career. \n\nI’d also point out that, as far as timeframes, the US is 8 years total and that’s comparable to Germany (6 years), France (9 years) and UK (5-6 years) for example. I’d also guess that cost has something to do with it since med school is free in Germany: they aren’t interested in funding a liberal arts education prior to med school. \n\nSimilarly, law school time frames also close:  It takes a minimum of 6 years to become a lawyer in Germany (2 exams). It takes 7 years in the US (4 UG and 3 law school) and only one exam (Bar).",
      "author": "Significant-Equal-12",
      "created": 1633581502,
      "upvotes": 3,
      "replies": {
        "hftubhk": {
          "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hftubhk/",
          "text": "> Similarly, law school time frames also close: It takes a minimum of 6 years to become a lawyer in Germany (2 exams). It takes 7 years in the US (4 UG and 3 law school) and only one exam (Bar).\n\nThis is wrong because it takes you 5 years till the first exam (1. Staatsexamen) and 2 more years for the 2. Staatsexamen in Germany.\nThat would be 7 years in total. You do nothing but law during this timeframe.\nMost people take 1-2 years longer than that.\n\nIn the US, the 4 years of UG only teach you very little about law (if at all) because you don't really start until you are in law school. So it isn't really 7 years as you described, more like 3.5.\n\nAlso, Germany is training full lawyers who don't specialize in 1-2 things, they have to learn the whole thing. They also have all their last exams in a very short time-frame, making it very hard to score highly.\nThis is why law in Germany is much harder than in pretty much any other country.",
          "author": "dartthrower",
          "created": 1633677530,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfqei5a": {
      "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfqei5a/",
      "text": "I read an article that said majors with the highest acceptance rates to med school in the US is humanities (Not science!). They also score highest in MCAT. \n\nThose majors are really good at critical analysis and reasoning, and they have years of practice in literature  that makes it a lot easier to understand complicated English.\n\nHigh-schools just don’t provide as rigorous academic training.",
      "author": "gragagaga",
      "created": 1633617424,
      "upvotes": 2,
      "replies": {}
    },
    "hfovcx9": {
      "link": "/r/college/comments/q30c01/why_cant_students_in_the_usa_not_go_to_med_or_law/hfovcx9/",
      "text": "It’s a little arbitrary, especially for law, but for med school in particular there are some advantages, namely that it gives an opportunity to take prerequisite basic science classes (organic chemistry, biochemistry, biology, etc.) that are good preparation for med school. This also allows US medical school to be just 4 years, as opposed to usually longer in Europe. Not to mention the benefits of having the academic maturity that comes with having a bachelor’s already.",
      "author": "DarthKnah",
      "created": 1633579295,
      "upvotes": 1,
      "replies": {}
    }
  }
}