{
  "sid": "gs87ss",
  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/",
  "title:": "The idea of a \"senior gift\" is so absurd",
  "text": "The first time I got approached about it (pre-covid on campus) I thought they were giving *us* some kind of token gift for finally graduating... but no, they suggest that you give $50+ more to this place where I had to take out tens of thousands of loans and pay about as much directly to them over the last 4-6 years? Is this common or is it just my school that has the gall to ask for this?",
  "author": "jaggary",
  "created": 1590679329,
  "over_18": false,
  "upvotes": 1906,
  "upvote_ratio": 0.99,
  "comments": {
    "fs98b29": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs98b29/",
      "text": "They called me at least 6 times a month after I graduated. I asked them to stop calling me because it was way too often.  They stopped.",
      "author": "circadeftones",
      "created": 1590796805,
      "upvotes": 2,
      "replies": {}
    },
    "fs6bib3": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs6bib3/",
      "text": "lol after my sister graduated with her masters from Ohio state (she also got her bachelors there), they sent her a letter with congratulations on it and she was so excited until she read the inside and it asked her to make a donation to the university. She had the same reaction to you, she's EASILY spent over $100,000 to get her graduate and undergraduate degree there and doesn't plan on donating a penny.",
      "author": "mmccnnmm",
      "created": 1590734323,
      "upvotes": 2,
      "replies": {}
    },
    "fs686h6": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs686h6/",
      "text": "My school does a \"Day of Giving\" every year. It's in very poor taste IMO",
      "author": "lijrobert",
      "created": 1590731691,
      "upvotes": 2,
      "replies": {}
    },
    "fs5wypj": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5wypj/",
      "text": "[John Mulaney on alumni fundraising](https://youtu.be/aiqKK4ysI7g)",
      "author": "MohammadRezaPahlavi",
      "created": 1590723917,
      "upvotes": 1,
      "replies": {}
    },
    "fs5usem": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5usem/",
      "text": "My uni asks for like 20.20 (or whatever year you graduated, it goes up by a cent). But they use the donations for a scholarship fund for the incoming freshman",
      "author": "Catelyn_Rose",
      "created": 1590722541,
      "upvotes": 1,
      "replies": {}
    },
    "fs5ncjf": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5ncjf/",
      "text": "lmao I ended up doing my masters at the same place I did my undergrad and the alumni association called me recently and the conversation went like this:\n\nGuy: so you majored in [major], what did you end up doing after you graduated?\n\nMe: I’m actually still attending [school] for my masters\n\nGuy: oh.... uh... so.... did you want to make a donation?\n\nI knew the guy had to ask me and clearly felt bad asking so I just politely declined and ended the call, but I thought it was hilarious. Like, my field won’t be the most lucrative, and I’m still a poor grad student, what more can I give you?",
      "author": "yellow_pineapples",
      "created": 1590718110,
      "upvotes": 1,
      "replies": {}
    },
    "fs5lr4h": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5lr4h/",
      "text": "Lol! I’d laugh in their face. I spent thousands In tuition and books and now you want more money?! Hell no.",
      "author": "EtherealFlower-",
      "created": 1590717198,
      "upvotes": 2,
      "replies": {}
    },
    "fs5g2pv": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5g2pv/",
      "text": "My college did this. But they didnt even tell us it was senior class committee decision. That people not on the committee are not allowed in. It funded a different year the building of a whole fucking clock tower. Our gift is for an alethics student to have a full ride each year. (I am not ok with this)",
      "author": "zebra-eds-warrior",
      "created": 1590713952,
      "upvotes": 2,
      "replies": {}
    },
    "fs5d3ep": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5d3ep/",
      "text": "I can't wait for my college to ask me for money so I can tell them they can keep the money they didn't spend on my graduation that got cancelled",
      "author": "Thor8453",
      "created": 1590712253,
      "upvotes": 1,
      "replies": {}
    },
    "fs574rr": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs574rr/",
      "text": "I just graduated and I’m donating $5 a month to our Student Food Pantry as my senior gift. They awarded me with a philanthropy cord for graduation as a thank you. I feel good about my donation, but definitely feel like it’s inappropriate to ask students to donate, especially if they already had trouble paying for college in the first place.",
      "author": "slysnow99",
      "created": 1590708940,
      "upvotes": 5,
      "replies": {}
    },
    "fs567pl": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs567pl/",
      "text": "John Mulaney is that you?",
      "author": "turboshot49cents",
      "created": 1590708441,
      "upvotes": 1,
      "replies": {}
    },
    "fs53x7m": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs53x7m/",
      "text": "My college hasn't asked for a senior gift, but there's a lot of low-income students here and I'm also graduating in the middle of COVID, so maybe they realized that it would look pretty terrible to ask for money right now, especially since they handled our graduation situation so terribly that so many of us are rather pissed off at them.",
      "author": "LadyWolfshadow",
      "created": 1590707206,
      "upvotes": 1,
      "replies": {}
    },
    "fs50ci0": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs50ci0/",
      "text": "All schools do this, for two main reasons. First, long history shows that graduates who *start* donating *continue* donating. Second, there are a variety of situations in which the *percentage* of alumni who donate is important, even if they only gave $5.\n\nYou may well feel bitter about this, and depending on your college experience you may never give a dime. But *lots* of people do donate. I've been out of college 30+ years and still make a donation every year, and my parents (who graduated in the early 1960s) still make annual donations to their college as well.\n\nOne thing you might want to be aware of: if you do choose to donate you can designation your gift for *anything you want*. While fundraisers want \"unrestricted\" gifts they can use for whatever they want, you can designate yours to a particular fund, a student group, an academic program, literally anything.  I, for example, would never give an unrestricted gift because I don't want my money being wasted on football or a nice new office for the president. So I restrict them to one of the departments I graduated from-- and I know they get the money each year, which they use to help fund a winter event for students.",
      "author": "SnowblindAlbino",
      "created": 1590705323,
      "upvotes": 3,
      "replies": {}
    },
    "fs4z8e0": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4z8e0/",
      "text": "I transfered sophmore year and my old college kept bugging me for donations after I transferred. My new college also asked me for a 'gift' to commemorate the class of 2020 after graduating. They also asked me to write a 'thank you note 'for my scholarship.",
      "author": "IlikeFOODmeLikeFOOD",
      "created": 1590704741,
      "upvotes": 2,
      "replies": {
        "fs79drs": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs79drs/",
          "text": "Wtf who asks for a thank you note?? How did they even phrase that? “Can you please thank us for the scholarship you got?” That’s kind of pathetic",
          "author": "TheMerryBerry",
          "created": 1590761441,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fs4xn8c": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4xn8c/",
      "text": "Wait until they begin calling every few months to hit you up for money. I blocked the one number my college used after they interrupted one of my work meetings. (This was several years ago and I didn't have my phone in airplane mode, so I lost a two-hour voice recording of notes.)",
      "author": "BourbonCoug",
      "created": 1590703919,
      "upvotes": 1,
      "replies": {}
    },
    "fs4xbqx": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4xbqx/",
      "text": "My school postponed the senior gift campaign since they figure most of our lives and job searches are too fucked up to be donating anything",
      "author": "SkiMonkey98",
      "created": 1590703755,
      "upvotes": 1,
      "replies": {}
    },
    "fs4w3o3": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4w3o3/",
      "text": "John Mulaney has a good take on this.",
      "author": "athan1214",
      "created": 1590703129,
      "upvotes": 1,
      "replies": {}
    },
    "fs4rz1c": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4rz1c/",
      "text": "I believe John Mulaney talked about something like this lmao",
      "author": "yuxngdogmom",
      "created": 1590701082,
      "upvotes": 2,
      "replies": {}
    },
    "fs4p0uu": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4p0uu/",
      "text": "My understanding is that a lot of institutional donors look at the percentage of alumni that give to a school, as a criteria for donating themselves. So the school wants everyone to donate, every year, even if it’s just a token amount, so they can claim the percentage is high. That leads to faux-peer-pressure things (that are really organized by the school, not your peers) like senior and class gifts.",
      "author": "mishakhill",
      "created": 1590699624,
      "upvotes": 2,
      "replies": {}
    },
    "fs4myy7": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4myy7/",
      "text": "[Deleted]",
      "author": null,
      "created": 1590698632,
      "upvotes": 8,
      "replies": {
        "fs55ri7": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs55ri7/",
          "text": "My school lets you earmark your donation into existing buckets. You can send it straight to a sports team, to a fund set up by an alumni class, to the general financial aid fund, or the general fund. I generally give to the sports team I was on, along with club sports, and the financial aid.",
          "author": "biggreen10",
          "created": 1590708201,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fs4mini": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4mini/",
      "text": "My school does it but you get to choose which funds the money goes to and if you participate you get your name on the class plaque in the plazza of the student center.",
      "author": "Cinderalea",
      "created": 1590698415,
      "upvotes": 1,
      "replies": {}
    },
    "fs4lxzq": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4lxzq/",
      "text": "I mean it costs more to run a college than we realize. Most professors have PhDs and that’s 8 years of loans they need to pay off as well so they  need to make high salaries to make it worth it. Most big colleges have hundreds and hundreds of professors. Then they also have to pay people in dining services, dozens (and in my school probably hundreds since it’s so big and there are so many places to eat) and hundreds of people serving the food, and the hundreds of people cleaning it up. Then they have to pay for transportation, they have to pay for busses, bus drivers, gas, and any sort of repairs the buses may need. They have to pay an advising staff, administration staff, financial staff, dorming staff, they have to pay for hundreds of janitors to keep that huge campus clean. And labs are insanely expensive, the cost of the equipment alone for one lab can be in ten of thousands of dollars, and most schools have dozens of labs. They have to pay for property maintenance, keeping the grass cut, cleaning up the snow, removing garbage etc.. They also have to pay for computers and library stuff, and the SA gives money to clubs as well. Most schools have on campus pharmacies and doctors too for sick students which costs a lot of money to maintain. Universities are almost mini cities. It takes a lot to keep them running.",
      "author": null,
      "created": 1590698137,
      "upvotes": -4,
      "replies": {}
    },
    "fs4kib7": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4kib7/",
      "text": "Oh sure, I’ll be paying off my loans to you for the next 30 years of my life but let me go ahead and make a donation while I’m at it.",
      "author": "supremedalek925",
      "created": 1590697449,
      "upvotes": 6,
      "replies": {}
    },
    "fs4iqv5": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4iqv5/",
      "text": "My school sort of does this. We as a class are supposed to fundraise money and donate so that it could be used for an endowment scholarship. It usually doesn't get much lol. But we can keep doing it once we graduate and it'll go to that one.",
      "author": "thriftybee123",
      "created": 1590696609,
      "upvotes": 1,
      "replies": {}
    },
    "fs4g7gb": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4g7gb/",
      "text": "My highschool did this. We were class of 2019 so they asked for 20.19 dollars from each of us. They gave us a speech about how good it was to give and basically just tried to sell us into giving. We were a private school as well, so our parents had already spend a lot of money to send us to the school in the first place, and most of our parents were donors to some capacity already. We were in highschool so it’s not like many of us had much money to give. They told us they’d make a plaque with our grad year on it to commemorate our “generous sacrifice” if we all gave. It didn’t sit well with the majority of us did not give, but somehow, they advertised that they had 100% participation. We were just pawns and we knew it.",
      "author": "viridity12",
      "created": 1590695403,
      "upvotes": 3,
      "replies": {}
    },
    "fs4bz5u": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4bz5u/",
      "text": "Yeah, they did that to me.  If you gave them a minimum of $xx, you got some kind of cheesy medal.  I just didn't want to have to pay for my own freaking diploma.  Seriously, they couldn't swallow the $45 and then have the nerve to ask for a donation on my way out?",
      "author": "xmarketladyx",
      "created": 1590693395,
      "upvotes": 3,
      "replies": {}
    },
    "fs4ao62": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4ao62/",
      "text": "I will certainly donate when I have the means, given that I got a full ride from them. Otherwise I probably would not unless I wanted my name somewhere.",
      "author": "favela4life",
      "created": 1590692763,
      "upvotes": 18,
      "replies": {}
    },
    "fs46vgl": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs46vgl/",
      "text": "My private high school did this after dishing out $100k+ for four years. They thought we should give every year as alumni bc they ‘have us the foundation to succeed’ lmao nah I’m good",
      "author": "w4sch",
      "created": 1590690971,
      "upvotes": 67,
      "replies": {
        "fs478rn": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs478rn/",
          "text": "They deadass gave us ugly $5 t-shirts if we signed up to pay like $5 a month for 5 years but I know they said most alumni are still doing it like 30+ years later ????",
          "author": "w4sch",
          "created": 1590691146,
          "upvotes": 25,
          "replies": {
            "fs4eb8n": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4eb8n/",
              "text": "“Buy this cheap, ugly, sweatshop shirt from us! It’s only $300!”",
              "author": "Slothfulness69",
              "created": 1590694504,
              "upvotes": 12,
              "replies": {}
            }
          }
        },
        "fs6sc3n": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs6sc3n/",
          "text": "TIL private high schools can cost over 25k/year",
          "author": "-Isaac",
          "created": 1590749725,
          "upvotes": 4,
          "replies": {
            "fs7455x": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs7455x/",
              "text": "This is America naa naa",
              "author": "Bubbly_Direction",
              "created": 1590758479,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "fs46jhv": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs46jhv/",
      "text": "I had no problem giving my school some money when I graduated.  They provided me with an opportunity to get the skills that led me to my career. \n\nI didn't have to take out loans because I just took whatever grants were there and worked to pay out of pocket for the rest.",
      "author": "dade305305",
      "created": 1590690815,
      "upvotes": 0,
      "replies": {
        "fulx0hn": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fulx0hn/",
          "text": "[deleted]",
          "author": null,
          "created": 1591977001,
          "upvotes": 0,
          "replies": {
            "fulymui": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fulymui/",
              "text": "Just because *you* paid 80k for a degree don't assume I did. Also your comparison is stupid because eating at bk does not provide me any employable skills. \n\nCollege did. My degree is the primary reason that I am working in my desired field.  As such I have no problem giving back to my school. If going to school didn't prepare you for a career, that sounds like a you problem.",
              "author": "dade305305",
              "created": 1591977662,
              "upvotes": 1,
              "replies": {
                "fulz293": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fulz293/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1591977840,
                  "upvotes": 1,
                  "replies": {
                    "fum0pef": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fum0pef/",
                      "text": "> tuition and prey on people like you feeling like you owe them something\n\nNot good at reading I see. I don't owe them anything. I *want* to give them money to show my appreciation for the opportunity they gave me. \n\nAgain some of us who were actually good at school got money from the school. Some of us had professors and faculty put us in touch with people in key positions. etc which are *not* part of the price paid.\n\nSo, again, just because your school school experience sucked and you don't want to give back to your school does not mean that I shouldn't give back to mine.\n\n>You donating just encourages them to harass the rest of us.\n\nAnd I don't give a shit. I like giving back to my school. If that makes them contact you more, then thems the breaks.",
                      "author": "dade305305",
                      "created": 1591978655,
                      "upvotes": 1,
                      "replies": {
                        "fum9fq6": {
                          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fum9fq6/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1591982422,
                          "upvotes": 1,
                          "replies": {
                            "fumamck": {
                              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fumamck/",
                              "text": "> No I can read\n\nObviously you can't. If you *could* you would understand what the word \"want\" means. Listen, just because you wound up with a shitty job that doesn't allow you to do anything other than buy ramen don't try to  get mad because I want to support my school. \n\nDo you understand the difference between \"want\" and \"must\" don't you?",
                              "author": "dade305305",
                              "created": 1591982971,
                              "upvotes": 1,
                              "replies": {
                                "fumglhk": {
                                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fumglhk/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1591985739,
                                  "upvotes": 1,
                                  "replies": {
                                    "fumqq5o": {
                                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fumqq5o/",
                                      "text": "> passing yourself off as the civil one\n\nI never pretended to be civil. I am actively saying fuck you and your opinion. So no pretense here.\n\n>You just assume people who got screwed by their schools or have shit lives don't donate. This isn't just some donation to a school, you've made into a bad people don't donate argument\n\nNo, I'm saying *you* thepurpleapollo are a bad person. Is that more clear.\n\n?They don't deserve any more money than the purchase price of their services. Is it so hard for you to grasp that?\n\nOk I'm pretty sure you're restarted now. Let me say this shit to you slowly since you seem simple. I give money to my school because I want to (you seem to not understand what the word \"owe\" means.\n\nowe\n/ō/\n\nverb\nhave an **obligation** to pay or repay (something, especially money) in return for something received.\n\"they have denied they owe money to the company\"\n\nNow lets look at the word obligation\n\nob·li·ga·tion\n/ˌäbləˈɡāSH(ə)n/\nnoun\nan act or course of action to which a person is morally or legally bound; a duty or commitment\n\nNow just because you're too stupid to understand that some people so things *without* being obligated, that is your own fault. \n\n>Surely you also donate regularly to your high-school\n\nI actually do. In terms of both my time when I can and my money. \n\n>Or your parents?\n\nYea I do. I always ask if they need anything and give it if they do. Again just because you don't has nothing to do with me. \n\n>Or any business you interact with\n\nSome of them I do, mostly non profits i've interacted with in the past. But again, you seem pretty stupid, so let me explain this to you. \n\nOpportunities are *not* business transactions. Me buying a whopper is *not* the same as being give an opportunity to obtain knowledge and skills that have gotten me into my field and allowed me to have the money to do the things i mentioned. \n\nThe fact that you disagree is irrelevant. Do you know why its irrelevant? It because *you* are irrelevant. Neither you nor your opinions are important to care about. \n\nYou are nothing to me and your opinions are worth less than that my most whopper transaction.",
                                      "author": "dade305305",
                                      "created": 1591990812,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fs46fuv": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs46fuv/",
      "text": "Honestly the idea of a senior gift sucks but i also didnt realize it was like that normally until i was talling to some friends at another college. Our senior gift was made up of whatever leftover funds the college had at the end of the year and it went towards improving campus (basically the funds were marked as spend or give back and colleges hate giving back funds)",
      "author": "Aluratherogue",
      "created": 1590690768,
      "upvotes": 5,
      "replies": {}
    },
    "fs42eml": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs42eml/",
      "text": "After I graduated, I got a letter asking alumni for money before they actually got my diploma mailed to me.\n\nLike, you just ate up 4 years of my life, sucked out my soul, and charged me thousands of dollars for it, and now you want me to \"gift\" you more money???\n\nYeah, that's gonna be a no from me.",
      "author": "LordMudkip",
      "created": 1590688856,
      "upvotes": 46,
      "replies": {
        "fs4rdu3": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4rdu3/",
          "text": "To be fair, you ate up 4 years of your life sucking out your soul for the college, the completely overpriced bullshit is the only part they did wrong",
          "author": "Gamerred101",
          "created": 1590700791,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "fs403s6": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs403s6/",
      "text": "How more Money hungry can they get",
      "author": null,
      "created": 1590687786,
      "upvotes": 12,
      "replies": {}
    },
    "fs3ye9l": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3ye9l/",
      "text": "Our senior gift went to the student emergency fund for COVID. I didn't donate anything but they sent me a \"thank you for donating (X amount)\" email so that shows how much my class officers actually know anything about me. Instead of asking us to donate to the student supply closet and emergency fund all the time my school could lower tuition, but instead they beg us for money. I don't trust how my school uses money, there's been financial issues in past years, so if I want to help my friends I'll buy them food directly.",
      "author": "ctrldwrdns",
      "created": 1590686994,
      "upvotes": 32,
      "replies": {
        "fs5ja6t": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5ja6t/",
          "text": "If your school's emergency fund is like my school's emergency fund they often forego the fact that it isn't free money, people have to pay it back (have it added to their next semester bill or claim it on their taxes). They've had incidents in the past with not even telling recipients this at the time.",
          "author": "inthebluejacket",
          "created": 1590715781,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fs3xwxx": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3xwxx/",
      "text": "I keep thinking of the John Mulaney bit- “YOU SPENT IT ALREADY?”",
      "author": "TheBrightLord",
      "created": 1590686771,
      "upvotes": 186,
      "replies": {
        "fs42a61": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs42a61/",
          "text": "I GAVE YOU MORE MONEY THAN THE CIVIL WAR COSTS AND YOU FUCKIN SPENT IT ALREADY?",
          "author": "Dahki",
          "created": 1590688796,
          "upvotes": 111,
          "replies": {
            "fs42pm5": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs42pm5/",
              "text": "WHAT KINDA COKEHEAD RELATIVE-",
              "author": "TheBrightLord",
              "created": 1590689001,
              "upvotes": 54,
              "replies": {
                "fs5mers": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5mers/",
                  "text": "Got a link to the bit?",
                  "author": "trident_zx",
                  "created": 1590717569,
                  "upvotes": 4,
                  "replies": {
                    "fs5nna7": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5nna7/",
                      "text": "https://www.youtube.com/watch?v=aiqKK4ysI7g",
                      "author": "TheBrightLord",
                      "created": 1590718283,
                      "upvotes": 10,
                      "replies": {
                        "fs5nsj3": {
                          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5nsj3/",
                          "text": "Thanks",
                          "author": "trident_zx",
                          "created": 1590718369,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fs48zet": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs48zet/",
          "text": "*Spends it on a duffle bag of baby aspirin instead*",
          "author": "superking75",
          "created": 1590691968,
          "upvotes": 17,
          "replies": {}
        },
        "fs6sah0": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs6sah0/",
          "text": "This was such a good standup episode. Was cracking up over the whole college spending bit. “ONE HUNDRED AND 50 THOUSAND DOLLARS!”",
          "author": "-Isaac",
          "created": 1590749684,
          "upvotes": 4,
          "replies": {
            "fs7qm56": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs7qm56/",
              "text": "I’m a Canadian student and that bit really hammered home how expensive things are for you guys in the states. I can’t believe it costs $120K to get a degree",
              "author": "TheBrightLord",
              "created": 1590769903,
              "upvotes": 2,
              "replies": {
                "fs7sfmf": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs7sfmf/",
                  "text": "It really doesn’t for the average student. In-state tuition is about 11k/year, housing is about an additional 8-12k/year, and misc can be anything from 2-10k. Between working, scholarships/grants, and any family support most students I know aren’t graduating with more than 20k in debt. In fact most I know aren’t taking out much of anything.\n\nI can’t speak for international or OOS students though... that’s a whole different ballgame that I want no part of haha",
                  "author": "-Isaac",
                  "created": 1590770734,
                  "upvotes": 3,
                  "replies": {
                    "fs7w122": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs7w122/",
                      "text": "That's still an insane cost, wow. In Canada tuition is maybe 6K a year as long as you're a citizen (doesn't matter whether you're in or out of province). Housing is maybe 10K (I commute so not 100% sure) and misc maybe 2K. That being said big scholarships aren't as common in Canada as in the States so maybe things even out when that's considered.",
                      "author": "TheBrightLord",
                      "created": 1590772400,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "fs3x04e": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3x04e/",
      "text": "LOL “senior gift” expected from someone who had to pay to graduate",
      "author": "VROF",
      "created": 1590686349,
      "upvotes": 82,
      "replies": {}
    },
    "fs3wxnw": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3wxnw/",
      "text": "I think Berea might do this, but it is an all scholarship school. Students only have to pay for their books, ebooks, etc. All students have one job or another that pays in the area. Berea definitely asks former students to donate to help pay for the cost to teach current students.",
      "author": "PajamaSam24",
      "created": 1590686318,
      "upvotes": 9,
      "replies": {}
    },
    "fs3wgij": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3wgij/",
      "text": "My college wanted us to donate $20.17 to represent the year we graduated. My friend was in charge of organizing it and everyone was promised a free wine glass and one serving of wine. Pretty much everyone went for that and left. They said we could have a second serving if we hit 1k in funds, but I don't even think they hit $50. I felt bad, so I just gave her the dollar I had and left. Now I get non stop calls to thank me for my \"generous donation\" and to contribute more.",
      "author": "Its_Just_Jen",
      "created": 1590686095,
      "upvotes": 455,
      "replies": {
        "fs3xje5": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3xje5/",
          "text": "Trust me, they call the alumni list if you donated or not. If you really want them to stop calling just clearly ask to be removed from the call list for all future semesters and to speak to a supervisor to confirm you were taken off the list for future calling and not just for semester calling. 9/10 the people calling you is a student with a Microsoft Excel spreadsheet and we've been trained to ask for tiered donations after chatting up the alumni for a while.",
          "author": "fritz0126",
          "created": 1590686596,
          "upvotes": 208,
          "replies": {
            "fs588av": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs588av/",
              "text": "Can confirm. I currently do this as a job, and if you don’t explicitly ask to be removed from the calling list, you will be called again in one week.",
              "author": "yeetyeetya0000",
              "created": 1590709542,
              "upvotes": 34,
              "replies": {}
            },
            "fs5jixe": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5jixe/",
              "text": "We have a room at our university that looks like a call center (it is) and they do this. There's a big board with daily goals and stuff.",
              "author": "br1039",
              "created": 1590715921,
              "upvotes": 9,
              "replies": {
                "fs5jzdk": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5jzdk/",
                  "text": "Oof, our call center is in the last classroom with phone jacks and we just unpack and plug in the phones every shift. We usually leave whatever academic stuff was written by the earlier class on the board and use whatever free space is there to play hangman or scattegories or something to entertain ourselves for the night.",
                  "author": "fritz0126",
                  "created": 1590716184,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "fs4576h": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4576h/",
          "text": "Your friend learned a lesson that day.  If you offer free stuff to college students they will come, take the free stuff, and leave your event immediately.  I had a similar experience involving pie rather than wine - a swarm of people came, ate all the pie and left.",
          "author": "pmw7",
          "created": 1590690182,
          "upvotes": 87,
          "replies": {
            "fs4ykpd": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4ykpd/",
              "text": "Hehe organized an event last semester before the quarantine where people could win food, we didn't calculate the ratio of food to points correctly, so they took all of the chips and left.",
              "author": "Celeastral",
              "created": 1590704400,
              "upvotes": 6,
              "replies": {}
            },
            "fs7kfif": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs7kfif/",
              "text": "Was it math club. \nBecause people only join math club for pi day in the first place.",
              "author": "roughhty",
              "created": 1590767006,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "fs5jquy": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5jquy/",
          "text": "$50 a glass implies $200 a bottle and I doubt they paid that much for whatever box wine they were using.",
          "author": "br1039",
          "created": 1590716047,
          "upvotes": 5,
          "replies": {}
        },
        "fs51izm": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs51izm/",
          "text": "Out of curiosity, did that include students under 21 too?",
          "author": null,
          "created": 1590705943,
          "upvotes": 2,
          "replies": {
            "fs51mbv": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs51mbv/",
              "text": "No, we still had to show our licenses.",
              "author": "Its_Just_Jen",
              "created": 1590705992,
              "upvotes": 8,
              "replies": {
                "fs53hes": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs53hes/",
                  "text": "Aww so much for trying to sneak in :p",
                  "author": null,
                  "created": 1590706971,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fs3visg": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3visg/",
      "text": "I work in a call center asking alums to donate so I am pretty familiar with the senior gift and it's commonly the last amount of money people give to their school. I've been one of the top complainers about cost of tuition at my school, (and my scholarship package is ridiculously good in comparison to others)  but working in the call center and seeing how difficult it can be to convince the few alumni who do donate to and  the fact that my school used all of its funds and endowment on an emergency fund for students after campus was closed showed me how much we overestimate what these schools bring in. Yes, the cost of college in this country is ridiculous, but many private schools offer crazy good financial aid packages to students which can drive up the sticker price. We also end up utilizing more school provided resources over the years than we realize. I was a commuter at my college but I still  have access to every free Microsoft, streaming, Google suite, ect platform they give us and at least for my school we'll be able to continue to utilize all of those services after we graduate until we die.  Just because we don't always see or choose to utilize the services our college offers us doesn't mean they're not still dropping money on it. it depends on the school overall, but it can help to be a little more understanding and truly look into what your college is providing you to better understand the cost associated. Also don't forget the scholarship kids! Even if you don't want to utilize the offered services the money still helps with financial aid and I know at least for my college over half of the students would be unable to attend without the generous support of the few alumni who do give back. (Also you can write off whatever you give on your taxes if you decided to take that route)",
      "author": "fritz0126",
      "created": 1590685653,
      "upvotes": 28,
      "replies": {
        "fs3ya6d": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3ya6d/",
          "text": "I feel like this is more of an argument for schools to stop spending money on stupid shit.\n\n\"Oh no, we're broke because all your tuition money went to a bowling alley and hiring Imagine Dragons to play music at homecoming! Please give us a $400 gift\"\n\nMaybe universities should tighten their belt a little and have an emergency fund.",
          "author": null,
          "created": 1590686941,
          "upvotes": 38,
          "replies": {
            "fs51ge6": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs51ge6/",
              "text": ">Maybe universities should tighten their belt a little and have an emergency fund.\n\nYou should actually look at the budget of a non-$$$ college sometime. Mine has an annual operating budget of about $100M.  The large majority of that is labor costs-- salaries/wages for employees, including student workers. Of what's left most goes to operating/maintaining the physical campus and providing the key infrastructure  (like IT) that makes it work. We have no bowling alley and it's been years since we had even a third-tier act on campus. But our price tag is still almost $70K this year-- and in turn we provide enough scholarship money so the average student pays about $30K. That doesn't happen without massive donations from alums and others.\n\nWe also have an emergency fund of about $60M. We used 1/10th of that this spring when students left and residence halls closed. If we aren't on campus in the fall we'll use half of what's left just to keep online classes going. If we're \"closed\" all year from COVID the reserves will likely be exhausted. Should that happen, you'll see hundreds of colleges in the US close forever-- not because they wasted their revenues on Imagine Dragons but because they are non-profits that ultimately depend on tuition and room/board revenues-- and annual giving --to fund their operations.",
              "author": "SnowblindAlbino",
              "created": 1590705905,
              "upvotes": 2,
              "replies": {
                "fs54yqx": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs54yqx/",
                  "text": "Sorry if I was unclear, the \"tighten their belt and have an emergency fund\" comment was a tongue-in-cheek reference to the age old advice by older folks telling young people to quit complaining and pick themselves up by their bootstraps. More of a tables turned scenario.\n\nThe crux of my point however doesn't have to do with the impact of COVID-19 on university revenue, because it's been happening for many years before shutdowns happened.\n\nMy universities love to preach about how \"we're a family\" and \"We want you to be happy and successful\" before and after you attend. But while you're there they will nickle and dime you for as much as you're worth with absolutely zero remorse. \n\nI spent $300 on a parking pass but was given tickets for daring to park within 5 miles of the stadium before a football game. \n\nI was required to buy a $200 textbook that my professor wrote that was never even once used in class, but proving we purchased it was required before having access to homework. \n\nI had a suicidal friend sent home from the university counselor because \"If you're able to get dressed and seek help it must not be that bad\"\n\nIf I wanted to walk at graduation I was required to rent a cap and gown for $80 that I had to return within two days of graduation or I would be charged $250.\n\nI have to pay $20 every time I want to send a PDF of my transcripts anywhere. A damn PDF that is sent by an automated system costs $20.\n\nAnd if at any point I lapse in my payments to the University I'll be kicked out without a second thought by the administration. But that's OK! Honestly there's no problem with that because a University is just a glorified corporation, we're making a business transaction and I need to hold up my end of the bargain. But you can't possibly expect me to spend 6 years being treated like a customer and then to suddenly act like we're a family that cares about each other. I've never had my apartment complex ask me for a donation, why should my University? We had a business transaction, and now it's done. Don't call me.",
                  "author": null,
                  "created": 1590707770,
                  "upvotes": 3,
                  "replies": {
                    "fs5ohxb": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5ohxb/",
                      "text": "> a University is just a glorified corporation, we're making a business transaction and I need to hold up my end of the bargain.\n\nGotcha-- that's your experience. That's not how *my* university works, nor a great many others of which I'm aware. But yes, there are certainly places like that our there...I got my Ph.D. from one years ago. And I've never given them a dime, whereas I've been donating to my undergraduate alma mater annually since that Good Ol' Senior Gift over 30 years back. Because they did care, they didn't nickle and dime me, and they certainly didn't think of themselves as a business or me as a customer.",
                      "author": "SnowblindAlbino",
                      "created": 1590718785,
                      "upvotes": 2,
                      "replies": {
                        "fs9gdn7": {
                          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs9gdn7/",
                          "text": "Does there happen to be a list of universities that are not glorified corporations? I haven't had very much luck here :'(",
                          "author": "Alt_F4_Designer",
                          "created": 1590801509,
                          "upvotes": 1,
                          "replies": {
                            "fs9vhzx": {
                              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs9vhzx/",
                              "text": "Pretty much all PUIs (primarily undergraduate institutions), which would include most private liberal arts colleges and community colleges, plus a fair percentage of public comprehensive (masters) universities. Unfortunately nobody explains that to high school students.",
                              "author": "SnowblindAlbino",
                              "created": 1590811032,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "fs54yus": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs54yus/",
                      "text": "5 miles is 8.05 km",
                      "author": "converter-bot",
                      "created": 1590707772,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fs3yi5t": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3yi5t/",
              "text": "Or it's an argument reminding you that you'll have access to a lot of amenities the college offers even after graduation and it's on you if you chose to take them or not. These amenities are sometimes recreational like a bowling alley, but are largely academic or professional tools.",
              "author": "fritz0126",
              "created": 1590687043,
              "upvotes": -1,
              "replies": {
                "fs3z1tx": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3z1tx/",
                  "text": "But I don't want them. Why on earth would I willingly pay money to support my old University frivolous wasting money.\n\nI'm an adult with a job. If I want photoshop I'll buy it.",
                  "author": null,
                  "created": 1590687294,
                  "upvotes": 8,
                  "replies": {
                    "fs43jqc": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs43jqc/",
                      "text": "Then don't donate and ask for them to not contact you regarding alumni donations or events.",
                      "author": "fritz0126",
                      "created": 1590689401,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fs51om6": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs51om6/",
          "text": ">I work in a call center asking alums to donate\n\nI have degrees from three schools. The only one I will take calls from is my undergraduate college and I look forward to talking with the students there every year. It's hard work, but the call centers driving annual giving are a big part of what makes it possible to run a private college in the US. Thanks for your work!",
          "author": "SnowblindAlbino",
          "created": 1590706024,
          "upvotes": 6,
          "replies": {}
        },
        "fs3yqtw": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3yqtw/",
          "text": "Did you copy and paste this straight from the manual you use to convince alumni into donating?",
          "author": "Mustbeover4letters",
          "created": 1590687154,
          "upvotes": 14,
          "replies": {
            "fs3yxyn": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3yxyn/",
              "text": "No, but I'll admit I developed more of an appreciation for what my college offers to students as a result.if it weren't for alumni donations I would never have been able to afford college.so yes, I'm appreciative of what I get from it.",
              "author": "fritz0126",
              "created": 1590687245,
              "upvotes": 6,
              "replies": {
                "fs45mxn": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs45mxn/",
                  "text": "Hi there!\nMy sister works as someone who calls alumni asking for donations. I think that she enjoys her job. I have always thought that donating money to a school that is always charging me money was silly.\n\nBut what you said has really put it into perspective for me. I am not sure if I could afford to donate in the future, but I think it is important to provide resources for the students. I think the most important resources for me would be career services.\n\nThank you for sharing!",
                  "author": "HERO-IDLE",
                  "created": 1590690390,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fs3tmft": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3tmft/",
      "text": "I remember my college doing something like that and I just deleted the email. It's in poor taste.",
      "author": "Laurasaur28",
      "created": 1590684773,
      "upvotes": 160,
      "replies": {
        "fs4bxdy": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4bxdy/",
          "text": "Thank you for being a mod that doesn’t pin every single one of their comments.\nGood mod",
          "author": "YaBoiSlimThicc",
          "created": 1590693371,
          "upvotes": 88,
          "replies": {
            "fs4kcu7": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4kcu7/",
              "text": "They also don't have to distinguish the comment. But baby steps I guess.",
              "author": "unemployedemt",
              "created": 1590697378,
              "upvotes": 23,
              "replies": {
                "fs55iqr": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs55iqr/",
                  "text": "how else are they gonna flex on the plebs for a feeling of superiority?",
                  "author": "YoungLecter",
                  "created": 1590708069,
                  "upvotes": 14,
                  "replies": {}
                },
                "fs5glpr": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5glpr/",
                  "text": "I distinguish to be transparent about my mod status while still contributing. I was a member of college well before I joined the mod team.",
                  "author": "Laurasaur28",
                  "created": 1590714254,
                  "upvotes": 16,
                  "replies": {
                    "fs5n49w": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5n49w/",
                      "text": "I don't see why anyone needs to know unless you're taking a mod action. But we all have different perspectives.",
                      "author": "unemployedemt",
                      "created": 1590717977,
                      "upvotes": -9,
                      "replies": {}
                    },
                    "fs5yx9h": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5yx9h/",
                      "text": "I really don't see the point of this, unless you're fishing for karma. What do you want to be transparent about?\n\nIt's not like you see other r/college members including \"Got a 4.0 from MIT\" in every post, just to be transparent about a bias towards MIT and enjoying higher education.",
                      "author": "InverseLink",
                      "created": 1590725170,
                      "upvotes": -7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fs4j5ak": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4j5ak/",
          "text": "At my schools 2018 graduation the graduates got emails the night of graduation asking them to donate 😂 they said that it was a way for them to celebrate",
          "author": "thriftybee123",
          "created": 1590696800,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "fs3qx8c": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3qx8c/",
      "text": "Wait until you are an alumni and they ask for a lot more than that.\n\nIt's just a tradition thing for seniors. It's not meant to be a financial gift or require much effort from individuals.\n\nI'm only donating to my college when I need something from them. I'd rather donate to the student orgs I was in.",
      "author": "br1039",
      "created": 1590683534,
      "upvotes": 861,
      "replies": {
        "fs44kjz": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs44kjz/",
          "text": "My school isn't going to see a cent from me after I graduate. If I manage to come into some money I'll donate to organizations that help underprivileged students pay for school. But the university it's self can suck it.",
          "author": "casual-captain",
          "created": 1590689884,
          "upvotes": 434,
          "replies": {
            "fs4ni8k": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4ni8k/",
              "text": "The only place I’d donate to for my school is the athletic department (I go to a small D2 school so this isn’t a big department) as I have been a part of the XC team from its resurrection in 2017 and have had a job as a student worker in the department. \n\nSo i would be contributing to the XC program mostly but would give some to the general AD fund.",
              "author": "TurnerK28",
              "created": 1590698888,
              "upvotes": 66,
              "replies": {}
            }
          }
        },
        "fs49at0": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs49at0/",
          "text": "What would you need from your school that would cause you to donate?",
          "author": "SupremacyZ",
          "created": 1590692117,
          "upvotes": 70,
          "replies": {
            "fs4hy6t": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4hy6t/",
              "text": "Admission for their child.\n\n( :P )",
              "author": "wherewegofromhere321",
              "created": 1590696230,
              "upvotes": 110,
              "replies": {
                "fs4ob84": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4ob84/",
                  "text": "Isn't that just tuition with extra steps?",
                  "author": "ANTI-aliasing",
                  "created": 1590699280,
                  "upvotes": 46,
                  "replies": {
                    "fs4qxs1": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4qxs1/",
                      "text": "For admission? Its bribery, actually. Though depending on how you deliver the bribe it can be legal.\n\nAfter admission? Then yeah its tution.",
                      "author": "wherewegofromhere321",
                      "created": 1590700571,
                      "upvotes": 44,
                      "replies": {}
                    }
                  }
                },
                "fs4z2h3": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4z2h3/",
                  "text": "We have a 60% acceptance rate so personally not for that reason.",
                  "author": "br1039",
                  "created": 1590704656,
                  "upvotes": 15,
                  "replies": {}
                },
                "fs5zr02": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5zr02/",
                  "text": "just put 'em on the rowing team, done deal.",
                  "author": null,
                  "created": 1590725712,
                  "upvotes": 3,
                  "replies": {
                    "fs6oieh": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs6oieh/",
                      "text": "Right. But that needs “donations”",
                      "author": "Tyrion69Lannister",
                      "created": 1590746098,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "fs50pp7": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs50pp7/",
              "text": "I would donate under the following circumstances:\n\n1. They are considering making significant changes to a program or organization I have feelings about.\n\n2. The money would aid students in need who are on a track to build a good career.\n\n3. The money would aid important research that could be valuable to society or a cause I am familiar with.\n\nI would not donate under the following circumstances:\n\n1. The money would be used to create new non-teaching positions or increase the salaries of the administration.\n\n2. The money would be used to fund aid programs that aren't merit based (I want to support a lot of students in my life, but I can't see the value in giving academic aid to people likely to go on academic probation).\n\n3. The money would be used to create facilities or offices that don't really add to the value of the learning environment (like a luxury dorm, new starbucks, etc.).\n\n\nI just see massively more benefit from giving away scholarships in almost all situations. I'd rather do that and give directly to good students.",
              "author": "br1039",
              "created": 1590705515,
              "upvotes": 31,
              "replies": {
                "fs5ii8p": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5ii8p/",
                  "text": "“I can’t see the value in giving academic aid to people likely to go on academic probation” \n\nThis... I come from a poor but not poor enough family that can’t afford to pay college. FAFSA didn’t give me any aid whatsoever. My school doesn’t do a lot of merit based scholarships (max I got was $10k over four years when it would cost well more than that to attend). I received nothing from my school. I graduated top 3% of my class in high school and just finished my first year of college with almost 50 credit hours at a 4.0 GPA (didn’t even have to use pass/fail for any classes). Yet students who can barely maintain a 2 get scholarships? Completely unfair.",
                  "author": "microfsxpilot",
                  "created": 1590715338,
                  "upvotes": 12,
                  "replies": {
                    "fs6zvs0": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs6zvs0/",
                      "text": "Why not apply only to schools that might offer you merit scholarships that will make it affordable?",
                      "author": "sealifes",
                      "created": 1590755764,
                      "upvotes": 2,
                      "replies": {
                        "fs77d36": {
                          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs77d36/",
                          "text": "My major is only offered at like five different schools in the country. The school I go to now has the cheapest out of state tuition. All the other schools I applied to barely gave me any money to make it worth attending when compared to their extremely expensive out of state tuition. And conveniently, my state doesn’t have any schools that offer my major other than private universities",
                          "author": "microfsxpilot",
                          "created": 1590760328,
                          "upvotes": 1,
                          "replies": {
                            "fs92ak3": {
                              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs92ak3/",
                              "text": "Oh shit, I didn’t think about what happens when you have an uncommon major. That sucks.",
                              "author": "sealifes",
                              "created": 1590793371,
                              "upvotes": 1,
                              "replies": {
                                "fs9341i": {
                                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs9341i/",
                                  "text": "It’s a rough life. My college is the cheapest option but luckily still ranks as one of the top programs in the country and is widely recognized. Not bad for a school with an 81% acceptance rate",
                                  "author": "microfsxpilot",
                                  "created": 1590793833,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "fs5ihc1": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5ihc1/",
                  "text": "This is why I want to wait until I'm an actual alum to donate to my school. At least where I go, the senior gifts just get thrown into a \"senior gift fund\" for my administration to create whatever their slimy hands desire, but being a (hopefully) successful alum with money is when you get a voice.",
                  "author": "inthebluejacket",
                  "created": 1590715324,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "fs49b7k": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs49b7k/",
          "text": "I remember at my high school graduation practice they made us show up at 8 am on a Saturday where they gave us an hour talk about the alumni association and passed out blank checks where we could make donations. Many people straight up laughed at them. After that was done we ran through a 30 minute practice and went home.",
          "author": "Mail540",
          "created": 1590692122,
          "upvotes": 45,
          "replies": {}
        },
        "fs4aein": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4aein/",
          "text": "The Alumni Association is a union for graduates. You don't have a choice about joining and they won't use their resources to promote or support enrolled students. Their only jobs are gluing their name to successes, distancing the school from unpopular graduates, and fundraising for themselves.\n\nEdit: What I meant to say was support your alma mater.",
          "author": "DeeEffTeeBeeEh",
          "created": 1590692635,
          "upvotes": 27,
          "replies": {}
        },
        "fs5vj69": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5vj69/",
          "text": "We want a GIFT! But only if it's MONEY!",
          "author": "ctrldwrdns",
          "created": 1590723015,
          "upvotes": 4,
          "replies": {}
        },
        "fs5dkcn": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5dkcn/",
          "text": "Please donate to programs that directly help students, and student orgs themselves. $1000 means a TON to a program that offers free tutoring to students or for an academic club. This is coming from a guy that works for his University as a student.",
          "author": "DynamicHunter",
          "created": 1590712520,
          "upvotes": 2,
          "replies": {}
        },
        "fs5tp19": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs5tp19/",
          "text": "if they ask it often enough they can sure pretend it is a tradition",
          "author": "DictatorKris",
          "created": 1590721860,
          "upvotes": 1,
          "replies": {}
        },
        "fs59jcb": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs59jcb/",
          "text": "Mine will get money from me once I repay my student loans.",
          "author": "suprstar16",
          "created": 1590710256,
          "upvotes": 1,
          "replies": {}
        },
        "fs4qolp": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4qolp/",
          "text": "By orgs do your mean orgies?",
          "author": "DaDudeNextToYou",
          "created": 1590700446,
          "upvotes": -3,
          "replies": {
            "fs4yt5w": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4yt5w/",
              "text": "Organizations",
              "author": "br1039",
              "created": 1590704522,
              "upvotes": 5,
              "replies": {
                "fs4z29k": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs4z29k/",
                  "text": "I see.",
                  "author": "DaDudeNextToYou",
                  "created": 1590704653,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "fs3izc8": {
      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3izc8/",
      "text": "It is fairly common, but normally the amount is fairly low. The idea is to build a habit of donation that continues after you've become an alum.\n\nAt many schools the cost of full tuition doesn't cover the actual cost of each student. At my school people paid about 60K a year, but the total cost was more like 100K. So even people who paid full ticket were getting some benefit from the college.",
      "author": "biggreen10",
      "created": 1590679835,
      "upvotes": 124,
      "replies": {
        "fs3kb93": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3kb93/",
          "text": "I’ve never looked into it but I can’t imagine that’s the case at my school. I wonder how much it matters if you live on campus or not. \n\nIn my time I hardly used campus resources (for better or for worse). Genuinely the only thing the school needed to supply was the classroom, the professor (which I pay tuition for), and lab materials (which I also had extra fees for).\n\nI don’t want to sound rude but schools don’t get to be the way they are by losing money on each student",
          "author": "Softpretzelsandrose",
          "created": 1590680472,
          "upvotes": 104,
          "replies": {
            "fs3knyk": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3knyk/",
              "text": "It likely does vary school to school. This was a well-endowed Ivy, so that extra money generally comes from the draw on the endowment. At a school with a smaller endowment obviously that number would have to be much smaller.\n\nMy school also had a lot of people on financial aid, many on full rides, and generally senior class gifts are targeted for scholarship for the class that is about to start in the fall.",
              "author": "biggreen10",
              "created": 1590680639,
              "upvotes": 24,
              "replies": {
                "fs7111u": {
                  "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs7111u/",
                  "text": "Harvard's endowment could cover the cost of tuition for every student for the rest of eternity. Not even kidding, it's a real thing.\n\nThey're the exception, not the standard",
                  "author": "psilvs",
                  "created": 1590756527,
                  "upvotes": 2,
                  "replies": {
                    "fs756f1": {
                      "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs756f1/",
                      "text": "Quick back of the napkin math ($40B endowment, divided by 20K students times a very lowball $50K tuition) comes out to 40 years. The point of the endowment is to have a source of funding in perpetuity. That's why the draw is generally only about 5% and why it is risky to up the draw in times like this. If your fund has lost value due to a weak stock market, and you draw on it more heavily, there will be less to draw on when times are normal again.\n\nHarvard already uses its endowment generously providing full cost scholarships to anyone making under (I think) 100K.",
                      "author": "biggreen10",
                      "created": 1590759097,
                      "upvotes": 1,
                      "replies": {
                        "fs75ue9": {
                          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs75ue9/",
                          "text": "Your don't know how endowments work. The endowment would continue to grow. If you used the endowment to cover all the students full tuition, the endowment would still have grown back.\n\nThis isn't napkin math or some shit I'm making up. It's a fact",
                          "author": "psilvs",
                          "created": 1590759485,
                          "upvotes": 2,
                          "replies": {
                            "fs77isw": {
                              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs77isw/",
                              "text": "I'm well aware how an endowment works. I've managed non-profits, and worked in a university setting for years, including taking courses on university finances. \n\nYour point is fair, I did oversimplify it, but if you used it in the manner you are suggesting, it would still shrink year-over-year. Their 10-year return was about 8.5% from what I can find. The endowment is 40b, and their annual budget is 4.5B. That means each year it is growing by 8.5%, but being spent at ~11%, so it wouldn't be 40 years, but it wouldn't be forever.",
                              "author": "biggreen10",
                              "created": 1590760417,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fs3qwcm": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3qwcm/",
          "text": "[deleted]",
          "author": null,
          "created": 1590683522,
          "upvotes": 43,
          "replies": {
            "fs3rdih": {
              "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs3rdih/",
              "text": "You're right that folks are worried, but everywhere that collect tuition is worried, even schools with large endowments. My point was simply that tuition doesn't always cover the full cost. That point is ignoring things like need-based financial aid, which is generally where senior class gifts are targeted.",
              "author": "biggreen10",
              "created": 1590683744,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "fs53l47": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs53l47/",
          "text": "Calculated how? I bet if you divided total costs to the university by the number of students, you might arrive at that. But for my school, we have about 3 soccer fields too many to eliminate the possibility of our tuition being used elsewhere.",
          "author": "xNINJABURRITO1",
          "created": 1590707026,
          "upvotes": 4,
          "replies": {}
        },
        "fs568bm": {
          "link": "/r/college/comments/gs87ss/the_idea_of_a_senior_gift_is_so_absurd/fs568bm/",
          "text": ">At many schools the cost of full tuition doesn't cover the actual cost of each student\n\nabsolute bullshit",
          "author": "YoungLecter",
          "created": 1590708450,
          "upvotes": 7,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634055982
}