{
  "sid": "q5nueh",
  "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/",
  "title:": "I’m lonely, depressed, and worried college is just going to be high school 2.0",
  "text": "I’m a freshman at a small liberal arts college (2k students) and we’re 7 weeks in and I’m lonely as fuck. There is a group of girls I met during orientation (they broke us up into groups for orientation and these 4 girls were some of the people in mine) who I’m in a group chat with and I sometimes hang out with them from time to time. There’s also this guy who I kinda like who was also in my orientation group who I hang out with sometimes….and those are literally all the people I hang out with. \n\nI have severe social anxiety, I’m socially awkward asf, and I get so sad when I see other people hanging out with people all the time and getting invited to stuff. I was talking to one of the girls in the group chat I’m in about how I see her and the other girls always walking around and hanging out with various people they met in their classes, in their floor, etc. and I don’t get why I can’t do the same. I got so sad when I was talking to the guy im interested in and I asked him about what his plans for Halloween were and he told me he got invited to a rave by some guy on his floor. I feel sad bc I don’t have that many people I talk to and I don’t get invited to go anywhere. I spent entire days alone sometimes and I hate it. My depression is worsening and im afraid that im going to be just as lonely in college as I was in high school. \n\nWhat do I do? I have like 1 club I go to every week (and another one that I’m going to start attending this week) and I haven’t really met anyone I have been able to work up the courage to ask to hang out. I get so scared and nervous in my classes that I can’t really talk to anyone. I’m fucking lonely and I hate this…it’s also fall break rn and the campus is extra empty so I’m even lonelier than usual.",
  "author": "Glittering_Carrot923",
  "created": 1633925322,
  "updated": 1634082973,
  "over_18": false,
  "upvotes": 32,
  "upvote_ratio": 0.94,
  "comments": {
    "hg719vf": {
      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg719vf/",
      "text": "start talking to more people and take notes on what does and doesnt work in your head or written. be ok with bad social interactions and have the confidence to shrug it off. look into guides on how to communicate with people. a lot of people have studied social interaction and written about it in depth. be open and know that it is possible to be more socially successful if you put your mind to it and dont give up",
      "author": "AsUcanseebythisgraph",
      "created": 1633928557,
      "upvotes": 17,
      "replies": {}
    },
    "hg731nh": {
      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg731nh/",
      "text": "Wanna play warzone ?",
      "author": "gnarlyjae",
      "created": 1633929739,
      "upvotes": 13,
      "replies": {}
    },
    "hg7dbdx": {
      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg7dbdx/",
      "text": "First off, consider therapy for your anxiety. That's obviously not helping things. Then also consider you might need to work on your social skills actively vs hoping things will get better. I have anxiety as well but you must know at least intellectually that no one is paying nearly as much negative attention on you as you think they are.",
      "author": "comfort_fiend",
      "created": 1633937645,
      "upvotes": 7,
      "replies": {}
    },
    "hg81kp7": {
      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg81kp7/",
      "text": "Hey I totally understand you, I am in the same boat as you. I do not have anyone not even a single friend in my life. If you wanna hang out play some video games with me feel free to dm me:)",
      "author": "Coconeko2845",
      "created": 1633956857,
      "upvotes": 2,
      "replies": {}
    },
    "hg87ncm": {
      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg87ncm/",
      "text": "I wish I had advice to give but I’m in the same position.",
      "author": "PikaDicc",
      "created": 1633960037,
      "upvotes": 2,
      "replies": {}
    },
    "hg9rrnu": {
      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg9rrnu/",
      "text": "I was in the same position as you. As a freshman I didn't have many friends, and I didn't do much either. I basically just sat in my Dorm room all day watching Netflix or doing homework. \n\nBut an important thing that I learned was that you have to get out of a High School mentality and start thinking like an Adult. When you're in College, you're no longer forced to be around the same people all day and befriend those people like you are in High School. You're an Adult, you can go anywhere in the world. \n\nDon't feel like you have to meet people on campus. Go to bars, go to nightclubs, go to music festivals. Find events for yourself to go to, don't rely on invites from other people. And once you're out in the world, I guarantee you will meet people. \n\nOnce you're out of College and in the real world, this is how you're going to have to meet people. I moved across the country and literally knew no one in the City I'm in. How did I meet people? I went out to the hottest nightclubs in the city, I went to Bars and hung out, I went to Music Festivals and met people from all over the world that I still talk with",
      "author": "IzzyValentiiina",
      "created": 1633984038,
      "upvotes": 1,
      "replies": {}
    },
    "hg79yxi": {
      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg79yxi/",
      "text": "so ur gay?",
      "author": "jackxlawrie",
      "created": 1633934883,
      "upvotes": -16,
      "replies": {
        "hg7a1bn": {
          "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg7a1bn/",
          "text": "No? When, throughout this entire post, did I ever state I was a dude?",
          "author": "Glittering_Carrot923",
          "created": 1633934935,
          "upvotes": 6,
          "replies": {
            "hg7a3mv": {
              "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg7a3mv/",
              "text": "u never said if u were a girl or a guy",
              "author": "jackxlawrie",
              "created": 1633934984,
              "upvotes": -5,
              "replies": {
                "hg7a6n0": {
                  "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg7a6n0/",
                  "text": "I didn’t think it mattered",
                  "author": "Glittering_Carrot923",
                  "created": 1633935049,
                  "upvotes": 10,
                  "replies": {
                    "hg7aa5j": {
                      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg7aa5j/",
                      "text": "I mean it could matter but either way I was confused and jw",
                      "author": "jackxlawrie",
                      "created": 1633935126,
                      "upvotes": -8,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hg79zrs": {
          "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg79zrs/",
          "text": "or a girl?",
          "author": "jackxlawrie",
          "created": 1633934901,
          "upvotes": -1,
          "replies": {}
        }
      }
    },
    "hg80ga2": {
      "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg80ga2/",
      "text": "Depends on course. I mean my English 2 course (took English 1 as a dual enrollment student in  high school as a  Junior), it was full of high school students(like 16/30 were from high school. It was mature, honestly the course was structured distinctly from a high school course, and there was minimal interaction unless it was a group project.",
      "author": "jameskishtok",
      "created": 1633956230,
      "upvotes": -3,
      "replies": {
        "hg8ed0j": {
          "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg8ed0j/",
          "text": "I’m kind of confused as to what this has to do with my post…I think you may have commented this on the wrong post?",
          "author": "Glittering_Carrot923",
          "created": 1633963154,
          "upvotes": 1,
          "replies": {
            "hg8gcdx": {
              "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg8gcdx/",
              "text": "That you said that you are concerned at that it might be “high school 2.0”.\n\nI’m saying it is quite varying on the degree of student. \n\nI got a group of high school students in one course, so it was more like high school, but other courses had more mature students in it, and they didn’t bother you unless it was a group assignment.",
              "author": "jameskishtok",
              "created": 1633964016,
              "upvotes": -1,
              "replies": {
                "hg8jj7h": {
                  "link": "/r/college/comments/q5nueh/im_lonely_depressed_and_worried_college_is_just/hg8jj7h/",
                  "text": "Please read the post. I was referring to the fact that I was very lonely and didn’t have many friends in high school and I’m worried that is going to also be the case in college.",
                  "author": "Glittering_Carrot923",
                  "created": 1633965410,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}