{
  "sid": "rgj96s",
  "link": "/r/college/comments/rgj96s/i_cant_feel_proud_enough/",
  "title:": "I can’t feel proud enough?",
  "text": "Just a heads up that this is my first post ever on Reddit after reading so many! I apologize for the tangent.\n\nSooo I’m a junior in undergrad and on a Pre-PA track, but I don’t feel happy enough? :/ \n\nMy GPA has gone up, but it’s low compared to competitive averages. I don’t feel proud at all. Even working my ass off during this pandemic I feel like I won’t reach my goal of getting into grad school. It’s weird cause I say “oh it went up” but it’s not enough. It’s went from a 2.8 to 3.2 in two years… I hope someone here gets me it’s hard to put into words. \n\nI plan on taking a gap year to gain clinical experience and study for the GRE before applying, but the numbers I see weigh me down so much. I’ve gone suicidal many times yet I know how AWFUL the consequences will be if I do. I have/had a therapist but I ghosted him for whatever fucking reason. \n\nSome days I feel optimistic and this being a day where I feel unhappy. I feel so overwhelmed and hate it a lot. I genuinely have a passion for pursuing in the health/medical field, but my GPA doesn’t look like it. I learned about what quarter life crisis’ are and it definitely feels like I’m in one. 😵‍💫\n\nI’m such an off/in person and was recommended to take depressants… couldn’t afford it and overall couldn’t see myself taking them anyway. I’m a first gen so I was thrown into college with zero guidance and flopped terribly freshman year. I’ve definitely grown but my mind is just saying it isn’t enough. My friends have phenomenal GPA’s and I feel nothing at times lol. \n\nI’ve done tons of research about PA and many associates have said you can do it, but I can’t believe it? Why? I genuinely want to be one but I don’t look competitive. I feel so messy and don’t like it. My family aren’t supportive either which sucks even more. :/",
  "author": "Certain-Ad7602",
  "created": 1639521376,
  "updated": 1639787964,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hokqmml": {
      "link": "/r/college/comments/rgj96s/i_cant_feel_proud_enough/hokqmml/",
      "text": "I feel for you, I really do.\n\nBut if you are choosing to ghost your therapist and refusing to take medication recommended to help you, I doubt anything I can say on Reddit is going to help. \n\nI agree wholeheartedly with you on one thing - suicide is __NOT__ the answer.\n\nI hope you are able to find some solace during the break.",
      "author": "cajunsoul",
      "created": 1639524598,
      "upvotes": 1,
      "replies": {}
    }
  }
}