{
  "sid": "qmm2n8",
  "link": "/r/college/comments/qmm2n8/can_i_get_a_bachelors_in_physiology_and_still/",
  "title:": "Can I get a bachelors in physiology and still become a high school teacher? And if so, what kind of teacher? And can I work for masters while teaching?",
  "text": "I don’t want to be a teacher that much I want to be a high school counselor… but it requires me to have two years of teaching experience. So can I get bachelors degree in physiology and become a teacher and is it possible to teach while working for the counselor masters to be able to become a high school counselor?\n\n\nI tried looking it up before asking teenagers but couldn’t find an answer, and believe it or not many of y’all are really smart so that’s why Im asking.",
  "author": "cutemermaidaqua",
  "created": 1636036889,
  "updated": 1636137413,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hjaqqbn": {
      "link": "/r/college/comments/qmm2n8/can_i_get_a_bachelors_in_physiology_and_still/hjaqqbn/",
      "text": "The requirements will vary by state.\n\nThe best way to get a good answer for this question would be to talk to the counselor in your high school. Even if you're out of high school, you can almost certainly call up the school counselor at a local high school, indicate that you're interested in the career path and ask if you can sit down to talk with them.",
      "author": "ViskerRatio",
      "created": 1636042467,
      "upvotes": 2,
      "replies": {
        "hjb0ks3": {
          "link": "/r/college/comments/qmm2n8/can_i_get_a_bachelors_in_physiology_and_still/hjb0ks3/",
          "text": "Thanks",
          "author": "cutemermaidaqua",
          "created": 1636046251,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjajegs": {
      "link": "/r/college/comments/qmm2n8/can_i_get_a_bachelors_in_physiology_and_still/hjajegs/",
      "text": "Why would you ask teenagers? I assume because they're your peers, but that's exactly why you shouldn't ask them-- they know as much as you do. Being able to find the \"right\" person to ask questions is a more challenging but also more useful skill than most people realize. My strategy is to just keep asking different people to point me to the right people until I actually find the right person. Takes effort, sure, but works quite well, actually. This is more general advice, than anything, because there will be a lot of times in the future where you'll be in a pickle and won't know what direction to go in, so just keep this advice in the back of your mind. Don't be afraid to ask around.\n\nTo answer your question, rules for teaching licenses and counseling licenses depend on state, so it will be hard for internet strangers to help you without knowing what state you want to work in. In many states, due to teacher shortages, there are ways to become a teacher with just about any major, but the path is less direct than if you major in a traditional school subject plus education. \n\nI'm also curious if you mean \"psychology\" rather than \"physiology,\" since physiology is kind of a weird major to pair with your career goals. If I'm wrong and it's not just a mistake, why are you interested in physiology?\n\n> is it possible to teach while working for the counselor masters to be able to become a high school counselor?\n\nAgain, this will depend on state, but everyone I personally know in my state that has become a counselor took this route, so this is probably a solid plan.",
      "author": "HumanDrinkingTea",
      "created": 1636039636,
      "upvotes": 1,
      "replies": {
        "hjb0iow": {
          "link": "/r/college/comments/qmm2n8/can_i_get_a_bachelors_in_physiology_and_still/hjb0iow/",
          "text": "Yes I ment phsychology oops, my phone has autocorrect and it changed it. And I mean like if I get a bachelor in phsychology can I become a teacher with that? If so what kind of teacher because I need to teach like two years before being able to become a high school counselor",
          "author": "cutemermaidaqua",
          "created": 1636046229,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}