{
  "sid": "qt34cn",
  "link": "/r/college/comments/qt34cn/im_failing_hard_and_bad/",
  "title:": "I'm failing hard and bad",
  "text": "I just moved here 3 weeks before school. this is my first ever semester of college. the first month went fine. \n\nThen I started getting more and more late to my classes. then missing assignments. then skipping classes. I haven't been to them in like 4 or 5 weeks. All of my grades below 60. i dont know what to do. I want to get back into therapy and get my add treated again. I just lost motivation but gained all the guilt for not putting the work in. \n\nI don't know what to do.",
  "author": "CowCheese123",
  "created": 1636816022,
  "updated": 1637181983,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hkgtwro": {
      "link": "/r/college/comments/qt34cn/im_failing_hard_and_bad/hkgtwro/",
      "text": "I would drop all your classes instead of trying to make them bounce back and deteriorate your gpa. The semester is almost over, therefore you will only likely get up to a mid level 60, or even at best, 70s if you ace your finals. Your first grades, you always want them to be your best or near best in MY personal opinion. You don't want to start off with like a 2.0. You can always retake them.",
      "author": null,
      "created": 1636818491,
      "upvotes": 3,
      "replies": {
        "hkgwheu": {
          "link": "/r/college/comments/qt34cn/im_failing_hard_and_bad/hkgwheu/",
          "text": "Who should I speak to go about doing this and how badly would this effect me?\n\nclasses are a philosophy class, stats, public speech, and an econ course. I already have 2 English credits and 1 math credit from dual credit. These are mostly gen courses so I don't think I would be too much of a hindrance, just set me back a bit while I get back on track.",
          "author": "CowCheese123",
          "created": 1636819631,
          "upvotes": 1,
          "replies": {
            "hkh2krh": {
              "link": "/r/college/comments/qt34cn/im_failing_hard_and_bad/hkh2krh/",
              "text": "id speak to an advisor before doing this. Also you dont want to procrastinate AT ALL because the withdrawal date before you have to suffer with an D is coming up really soon.",
              "author": null,
              "created": 1636822290,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}