{
  "sid": "qqh9x5",
  "link": "/r/college/comments/qqh9x5/should_i_consider_transferring_to_an_online/",
  "title:": "Should I consider transferring to an online degree program?",
  "text": "First, it might be wise to take a cursory glance at the last few posts (not comments) I’ve made to get an idea of where I am mentally right now. You’ll se why.\n\nAs the title suggests, I just have some questions about whether or not I should stick with my current degree program or just transfer to an online one. I only have 15 hours remaining, and ideally I would just finish on-campus at the university I’ve been attending since fucking **fall of 2015**, but that’s not an option, as I can’t find any housing options for just one semester, and I’m not commuting 3 hours round-trip every day. I would also be perfectly content, if not downright happy, if I never had to set foot on that campus again.\n\nAs for the degree, it’s a BA in political science. Fucking useless. I don’t see it as a passion by any stretch of the imagination, and I’m really not too sure I even want a career in a related field. At one point I thought I wanted to become a policy analyst, but that’s not possible without grad school. Not only is there no chance *at all* that I’d get into a grad program at this point, I’m simply not capable of just leaving to somewhere far away. IIRC from when I was actively researching this kind of stuff, there are no MPP or related programs within 4-5 hours of me.\n\nAs for the online programs, my biggest concern is having the self discipline to stay on top of things when I’m not actively on campus and going to class. I know there’s no avoiding having to stay disciplined if I do go with this option, but I’m really not sure that I could do it. \n\nAlso, I cannot stress enough how much I have absolutely fucking *hated* the online classes I’ve already had to take. So that might be an obstacle.\n\nNot that I go to a reputable school at the moment, but will an online degree look worse? Is it even worth finishing considering how apathetic I am about all of this?",
  "author": "hdaigre47",
  "created": 1636503414,
  "updated": 1636655218,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hk0e6rh": {
      "link": "/r/college/comments/qqh9x5/should_i_consider_transferring_to_an_online/hk0e6rh/",
      "text": "I have a question to ask. Why have you committed to college thus far if you have been experiencing these emotions for over a year? It's clear there is some underlying drive that has kept you committed to college. You may not care about your degree, but you're still here for a reason.\n\nI'd normally say to people don't finish college if they don't want to because it is not for everyone, and correct me if I'm wrong, but I feel like not finishing your degree may only make things feel worse if you don't. I'm basing this off my experiences with mental illness. I've let my depression and anxiety become an excuse for quitting everything I do throughout my childhood.  I just had a breakdown yesterday about what I'm majoring in. I'm a freshman, and I'm *fucking terrified* to get cold feet and drop out because I'm tired of feeling like a failure. \n\nSo I think you should seek out in finishing your degree even if you don't give a shit. You don't have to put in the maximum amount of effort if you don't want to. Just do the bare minimum to pass the classes so you can graduate. If it's not something you may be proud of in the end, but at least it's one less thing that will make you feel like a failure. \n\nThe caveat is though, is that you don't have to do it in one full semester if you don't want to.   \nYou've mentioned people suggested you seek psychiatric help. Why not enroll yourself in an IOP or PHP program and do classes part-time if you can handle it? I've seen it done when I was in an ED program, and the brainpower of those girls was fueled by only rice cakes and energy drinks. So it seems manageable to do.\n\nAlternatively, you could just say fuck it and drop out. That's totally cool too. Honestly, you should prioritize your mental health and if hospitalization was recommended, it may not hurt to consider it. You should ultimately choose the decision that improves your mental health and quality of life, even if it's just slightly. Your life may not be full of rainbows, but at least when you wake up, the day will seem a little less shitty than before.",
      "author": "kizeltine",
      "created": 1636506546,
      "upvotes": 1,
      "replies": {}
    }
  }
}