{
  "sid": "rigswk",
  "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/",
  "title:": "We love being placed on residential warning for a piece of fabric 😍😍😍",
  "text": "Nothing really to it. My tapestry was a little too high on my dorm wall so my RA texted me to move it down a little bit. \n\nDid that but the office of student living still wants to place me on residential warning for it. Literally trying to get me to sign a letter that basically would be me admitting to ‘disrupting the residential learning environment’. Obviously not signing it because the guidelines never gave a specific measurement for how much the distance of the tapestry should be from the ceiling, so basically I was out of the loop\n\nLove to know how a fabric in my room is more disruptive than the kids who literally cause Armageddon in the study lounges every night. \n\nAnywho, I hope y’all are having a better end of semester than I am.",
  "author": "annatheperson8",
  "created": 1639745585,
  "updated": 1639862200,
  "over_18": false,
  "upvotes": 385,
  "upvote_ratio": 0.98,
  "comments": {
    "hox03cl": {
      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hox03cl/",
      "text": "Its just cause tapestries are against the fire code most places. I know that my school uses weird terms like that in the code of conduct but its just how they code things. Having an animal sometimes gets coded as failure to comply with university officials \n\nEdit: Don't think too deep into the name of the violation. It sucks but its still a violation",
      "author": "Nosleep_9764",
      "created": 1639748511,
      "upvotes": 168,
      "replies": {
        "hox0i5c": {
          "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hox0i5c/",
          "text": "My school allows tapestries as decor. I’ve asked my RA and they said it was okay to have. The issue is that they never explicitly stated the explicit measurement for the tapestry to be away from the ceiling.",
          "author": "annatheperson8",
          "created": 1639748705,
          "upvotes": 67,
          "replies": {
            "hoxcvi6": {
              "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoxcvi6/",
              "text": "Ah, I mean it probably says it somewhere in your housing license and housing policies. You should get a student judicial hearing about it and just explain to them that you didn't know what the rule was specifically",
              "author": "Nosleep_9764",
              "created": 1639754111,
              "upvotes": 63,
              "replies": {
                "hoxd08y": {
                  "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoxd08y/",
                  "text": "Plan to. Thanks for the advice.",
                  "author": "annatheperson8",
                  "created": 1639754165,
                  "upvotes": 25,
                  "replies": {
                    "hoxeqwl": {
                      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoxeqwl/",
                      "text": "No problem, I've been an RA for 3 years so I'm fairly familiar with my school's judicial process. Usually for fire code violations like that the first time offense is a fire safety class and if you take responsibility they usually won't drop the hammer.\n\nEdit: Good luck",
                      "author": "Nosleep_9764",
                      "created": 1639754867,
                      "upvotes": 31,
                      "replies": {
                        "hoy9ziu": {
                          "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoy9ziu/",
                          "text": "Fire safety class what a joke. His tapestry was a few inches too high.\n\nImagine students having any tenants rights for what were at my university, closets, that they pay the going rate for an off campus HOUSE to live in.\n\nAdministration at these places is always so incredibly petty and toxic I swear to god.",
                          "author": "PainFlavoredBaby",
                          "created": 1639766841,
                          "upvotes": 9,
                          "replies": {
                            "hoyd6za": {
                              "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoyd6za/",
                              "text": "It has nothing to do with the administration. Its the state fire code. My school refrences the fire code in the housing contract when it comes to what you can and can't have. At my school the fire marshal does room checks for fire code violations. When they find violations its not even a class its a fine from the state so at the end of the say the school is doing a favor. Student judicial is about education (in most cases) so the fire safety class may suck but its better than a fine.",
                              "author": "Nosleep_9764",
                              "created": 1639768068,
                              "upvotes": 0,
                              "replies": {
                                "hoyeggz": {
                                  "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoyeggz/",
                                  "text": "Rooms are inspected by the student housing authority before fire inspections are carried out. So being fined isn't even an issue here. The issues almost always get caught ahead of time.\n\nSo why is the student being forced to waste their time on a fire safety course? Having a tapestry too high does not mean someone is a moronic danger that needs to be educated.  If the administrators had even the slightest modicum of respect, it would be a two minute conversation. \"Hey, just so you know, that's too high, let's get that lowered\" and then maybe review some of the other common violations.\n\nI've lived in slums where the landlord treated me with more respect than what you're describing.",
                                  "author": "PainFlavoredBaby",
                                  "created": 1639768564,
                                  "upvotes": 1,
                                  "replies": {
                                    "hozbkzv": {
                                      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hozbkzv/",
                                      "text": "Its student housing....the school has a responsibility to make sure the building is safe for everyone that lives there hence all the rules (guests, COVID, alcohol/drugs, noise, fire safety).  \n\nPlus the fire safety class may be that short conversation to explain why the violation is dangerous. At the end of the day living in student housing has rules that everyone has to follow. Plus my school requires every student to attend an initial fire safety class as a condition of their housing contract. Yes some rules may be dumb but they exist for a reason.",
                                      "author": "Nosleep_9764",
                                      "created": 1639782026,
                                      "upvotes": 1,
                                      "replies": {
                                        "hozcnfv": {
                                          "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hozcnfv/",
                                          "text": "Sorry no. If they're requiring a student to go out of their way to speak to someone about their extremely minor infraction that couldve easily been corrected on the spot, that shows a disgusting lack of respect. I have no doubt those 'conversations' are extremely condescending because frankly there's no other way to frame that horseshit.",
                                          "author": "PainFlavoredBaby",
                                          "created": 1639782473,
                                          "upvotes": 1,
                                          "replies": {
                                            "hp0xb61": {
                                              "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hp0xb61/",
                                              "text": "go to bed",
                                              "author": "bigzim420",
                                              "created": 1639813215,
                                              "upvotes": 0,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoxzmyp": {
      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoxzmyp/",
      "text": "That sucks. Apparently it's a fire code thing and has to do with how high up the walls the sprinklers can hit. When I lived in the dorm we had the same rule but they at least gave us the specific distance things had to be from the ceiling and didn't leave it vague like that.",
      "author": "thierryh14",
      "created": 1639762870,
      "upvotes": 12,
      "replies": {
        "hoz0cwb": {
          "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoz0cwb/",
          "text": "If that’s the case, then I shouldn’t be getting this all. My tapestry, even before lowering it, was below the levels of the sprinkler. Then again, we only have one sprinkler per room and it was on the other side of it.",
          "author": "annatheperson8",
          "created": 1639777352,
          "upvotes": 5,
          "replies": {
            "hoz3pfy": {
              "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoz3pfy/",
              "text": "It's been like 5 years since I lived in the dorm so I'm not positive but I believe it was something like 18 inches or something like that that things had to be away from the ceiling. But like I said, they didn't leave it vague, they told us at our dorm orientation the rule. That's bs that they didn't give you an exact rule and then are punishing you for it.",
              "author": "thierryh14",
              "created": 1639778733,
              "upvotes": 1,
              "replies": {
                "hoz3qml": {
                  "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoz3qml/",
                  "text": "18 inches is 45.72 cm",
                  "author": "converter-bot",
                  "created": 1639778746,
                  "upvotes": 2,
                  "replies": {
                    "hoz3txo": {
                      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoz3txo/",
                      "text": "Good bot",
                      "author": "thierryh14",
                      "created": 1639778783,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoz3rm5": {
      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoz3rm5/",
      "text": "That’s fire code. They probably did outline the fire code in your handbook or had a disclaimer that you must abide by whatever the current fire code is. Kind of dumb to write you up for it if you moved it without giving them any hassle, though.",
      "author": "DinahTheLance",
      "created": 1639778757,
      "upvotes": 2,
      "replies": {}
    },
    "hoxrol6": {
      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoxrol6/",
      "text": "[deleted]",
      "author": null,
      "created": 1639759842,
      "upvotes": 1,
      "replies": {
        "hoy1njb": {
          "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoy1njb/",
          "text": "Right. At my school there’s so many residents who have hung flags and banners that say “I ❤️ hot dads” or spelling “milfs” & “daddy” with post its. They take up the entire window and are visible in places where profs and admins walk by every day. Nobody cares. This isn’t even a Greek life school.",
          "author": "parkeddingobrains",
          "created": 1639763641,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoz3vtu": {
      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hoz3vtu/",
      "text": "I got placed on it at my school for leaving a singular open pop tart on my desk (which I was right about to eat when the RA knocked)  when the kid across the hall basically had a meth lab... \n\nI got a new inspection done so they didn't fully give me a warning but I literally was so pissed at my RA.",
      "author": "Javret",
      "created": 1639778804,
      "upvotes": 0,
      "replies": {
        "hozwx1d": {
          "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hozwx1d/",
          "text": "How on earth did you get in trouble for a poptart? Did your dorm not allow food?",
          "author": "studdlyduyard",
          "created": 1639791698,
          "upvotes": 2,
          "replies": {
            "hp03pnw": {
              "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hp03pnw/",
              "text": "We have a major mouse problem because we are in a city and there are some slobs on campus, so they have a very strict closed container policy for food. My school is actually decent about rodent control and doesn't ignore it like some schools do. \n\nI actually had a mouse in my room this year but he seemed to move along. I don't keep food other than fruit snacks and pop tarts and I keep them sealed now. \n\nTHE IRONY of this is the RA that wanted to give me the warning was the central room for this year's mice sightings...",
              "author": "Javret",
              "created": 1639794954,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hozrne5": {
      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hozrne5/",
      "text": "Just tell them to eat a bag of dicks.",
      "author": "Savekennedy",
      "created": 1639789243,
      "upvotes": 2,
      "replies": {}
    },
    "hozvikp": {
      "link": "/r/college/comments/rigswk/we_love_being_placed_on_residential_warning_for_a/hozvikp/",
      "text": "To be fair... it was a nazi flag...",
      "author": "jetclimb",
      "created": 1639791046,
      "upvotes": -1,
      "replies": {}
    }
  }
}