{
  "sid": "rgyqii",
  "link": "/r/college/comments/rgyqii/i_need_advice_on_if_i_this_is_a_reasonable/",
  "title:": "I need advice on if I this is a reasonable decision.",
  "text": "I am currently 18, I'm still in highschool and I graduate on march first. I have been planning on going to university in Massachusetts somewhere (I'm from Iowa). The thing is I've honestly realized that I have no idea what I want to do, or that I want to do so much that it's so difficult to pick right now. To get to the point I'm really considering going to community college and transferring because it's way cheaper and I have a better chance of succeeding (my transcripts are kinda bad and i didn't take any of the college tests). I don't have a problem with community college at all but the thing is I have to leave where i'm at right now. I'm not being abused or anything but it's so toxic and I will never grow if I stay. I really really don't want to stay in Iowa while I go to school either. So I was thinking that if I saved up a lot of money until the end of summer and moved to Massachusetts and took a year off to work then I couldn't go to community college and do the whole transfer thing. I'm just not sure where I would work for a gap year or if this is even a reasonable option. I'm just trying to see what the best option is for me. I would appreciate any feedback. Thank you.",
  "author": "kennaalien",
  "created": 1639573732,
  "updated": 1639787898,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hon346s": {
      "link": "/r/college/comments/rgyqii/i_need_advice_on_if_i_this_is_a_reasonable/hon346s/",
      "text": "If money is a concern, it's important that you're looking into and considering all your options. It's okay to go to college (community or 4-years) without a major in mind, but still be thoughtful about money.\n\nPersonally, I'd look into low cost universities near you. Many 4-year public universities in the midwest offer in-state tuition to students from all neighboring states. That could get you out of Iowa, into a good 4-year university, all without breaking the bank. \n\nCommunity college is a fantastic option for your situation, but it sounds like housing would be a major challenge for you. Most young adults in community college live at home, saving a lot of money. Community Colleges can also be cheaper for in-state residents - look into this! \n\nAll in all, if I was you, I'd do 1 year of community college in Iowa to save money and narrow down interests, then I'd head out to a \"reasonably\" priced 4 year. That could very well be in Massachusetts. \n\nIf you're willing to play a long game, see how long you need to live in MA to be considered a resident for tuition reasons. If it's only 2 years, you could do 2 years of CC and save, living in MA, then transfer to UMass for cheap, in-state tuition.",
      "author": "IceRose39",
      "created": 1639574474,
      "upvotes": 3,
      "replies": {}
    },
    "hon4kbk": {
      "link": "/r/college/comments/rgyqii/i_need_advice_on_if_i_this_is_a_reasonable/hon4kbk/",
      "text": "I'd consider that Massachusetts is a really high cost of living state, particularly if you want to live anywhere within easy commuting distance of Boston. The pay is higher than in Iowa, but somebody coming in with a high school diploma and no particular work experience is going to be on a tight budget. There's lots of good options for colleges if you want to stay long enough to qualify for in-state tuition, but it's something you want to have a budget for before doing because you could easily stay for a year and not have any savings for college at the end of it.",
      "author": "Melodic_Echidna",
      "created": 1639575232,
      "upvotes": 2,
      "replies": {}
    },
    "hongske": {
      "link": "/r/college/comments/rgyqii/i_need_advice_on_if_i_this_is_a_reasonable/hongske/",
      "text": "Considering mass is a very high cost of living compared to where you are now, you would probably be able to make more and save more staying put.  I’m curious what draws you to Massachusetts? I’m from Rhode island.",
      "author": "capresesalad1985",
      "created": 1639580919,
      "upvotes": 1,
      "replies": {
        "hont6lu": {
          "link": "/r/college/comments/rgyqii/i_need_advice_on_if_i_this_is_a_reasonable/hont6lu/",
          "text": "Honestly I’ve always wanted to go there but if I can find anything I would move anywhere in New England.",
          "author": "kennaalien",
          "created": 1639585857,
          "upvotes": 1,
          "replies": {
            "hoo7yk4": {
              "link": "/r/college/comments/rgyqii/i_need_advice_on_if_i_this_is_a_reasonable/hoo7yk4/",
              "text": "I would check out Rhode Island than!  There is CCRI, URI and RIC - all good schools and the cost of living will be lower than mass!",
              "author": "capresesalad1985",
              "created": 1639591579,
              "upvotes": 1,
              "replies": {
                "hoogk6b": {
                  "link": "/r/college/comments/rgyqii/i_need_advice_on_if_i_this_is_a_reasonable/hoogk6b/",
                  "text": "Will definitely do. Thank you!",
                  "author": "kennaalien",
                  "created": 1639594913,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}