{
  "sid": "qp6og5",
  "link": "/r/college/comments/qp6og5/i_have_no_idea_what_i_want_to_do_and_nothing_i/",
  "title:": "I have no idea what I want to do and nothing I can do professionally, what do I do???",
  "text": "Hey all, I’m sorry if this isn’t the right place to say this, but it seemed like there were a lot of question posts and this is something that keeps me up at night. \n\nSo, Basically the title, I’m 16, turning 17 in December, and recently I got my first letters from colleges in my area. I always have gotten decent grades (Mostly A’s and B’s), but I have absolutely nothing that I’m good at to anywhere near even a high school level. My original plan was to become a graphic designer/animator for a studio that would take me. I draw a ton of cartoon stuff, but my skills are once again very bad (I barely sketch anything I draw before I draw it), and I can animate things at a beginner level but not much beyond that. \n\nOther than that, I genuinely am terrible at everything, that is not an exaggeration, I have things I like, such as music and video games, standard stuff that I wouldn’t even know how to begin converting into actual skills that would be usable in a career environment.\n\nI guess my real question is, what should I do? How do I find out what I want to do, and what are the best ways of improving my current skills or any future ones for a college environment?",
  "author": "Cup_juice",
  "created": 1636348434,
  "updated": 1639865678,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjrtvl7": {
      "link": "/r/college/comments/qp6og5/i_have_no_idea_what_i_want_to_do_and_nothing_i/hjrtvl7/",
      "text": "A lot of people I know personally went into college not really knowing what they wanted to do and went to college because it’s what they think is just the next step in life. Usually in college your first and second year are all core credits and don’t focus much on an actual major. So a lot of people figure out what they’re good at and what they enjoy during those two years through electives and such. \n\nOn another note not everyone can afford to do two years of school and hate it then drop out. I know going to a junior college or technical school is a cheaper option because many local techs have bridge programs with bigger colleges. It allows you to do your two years of core classes and some electives cheaper before you transfer to a 4 year. These schools usually have trade jobs as well where they actually teach you specific skills so you can do your two years or however long the program is and go right into the workforce. So that’s an option as well if you want to at least get an associates. \n\nAlso a lot of people think they have to actually have a wealth of knowledge about a subject right out of high school to major in that subject and that’s not true. It’s college and the whole purpose is for you to learn and strengthen your skills and knowledge in whatever major you choose. Professors aren’t expecting you to know every single thing or be amazing in a subject because then what’s the point of being there.",
      "author": "Liss_Lestrange",
      "created": 1636350077,
      "upvotes": 2,
      "replies": {}
    },
    "hm6stal": {
      "link": "/r/college/comments/qp6og5/i_have_no_idea_what_i_want_to_do_and_nothing_i/hm6stal/",
      "text": "Balls",
      "author": "dafucanowa",
      "created": 1637955628,
      "upvotes": 1,
      "replies": {}
    }
  }
}