{
  "sid": "r1gtny",
  "link": "/r/college/comments/r1gtny/if_the_instructions_to_the_assignment_were/",
  "title:": "If the instructions to the assignment were unclear, is it my fault for not understanding?",
  "text": "I got major points off for doing the assignment wrong (barely in my opinion and have elaborated and can prove it) and wasn't given opportunity to redo it.  If the grade stands, I dont graduate.",
  "author": null,
  "created": 1637792482,
  "updated": 1638207294,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hlylbuv": {
      "link": "/r/college/comments/r1gtny/if_the_instructions_to_the_assignment_were/hlylbuv/",
      "text": "It depends on how much of an effort you made to understand it. Did you ask your professor earlier than the night the assignment was due?",
      "author": "LeadershipSweet",
      "created": 1637793654,
      "upvotes": 8,
      "replies": {
        "hm0xfc3": {
          "link": "/r/college/comments/r1gtny/if_the_instructions_to_the_assignment_were/hm0xfc3/",
          "text": "ya, turned it in 3 days early, i've also emailed before about how i'm confused why i'm the only one participating in discussion (online).  Through under hand methods he explained how it's an elective and there's only 5 people in the class and basically if I may paraphrase said no one takes it serious and it's just for credit, and I also see how I can blindly click through the quizzes with out studying and get at least a 90% every time.  I dont like your attitude (assuming, derogative.)  Let me guess, you teach?  Or, you're teachers lil pet, hm?  Line leader?  Fuck off if you're not trying to help, I left my bootstraps back in my dorm room.",
          "author": null,
          "created": 1637841327,
          "upvotes": 1,
          "replies": {
            "hm1rfd3": {
              "link": "/r/college/comments/r1gtny/if_the_instructions_to_the_assignment_were/hm1rfd3/",
              "text": "I asked a question, you fragile, hypocritical dickhead. I WAS trying to help. It’s not my fault you haven’t grown up like the rest of us. Just do you and your college a favor and drop out. You clearly lack the drive or maturity needed to pass.",
              "author": "LeadershipSweet",
              "created": 1637857534,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "hlyit0i": {
      "link": "/r/college/comments/r1gtny/if_the_instructions_to_the_assignment_were/hlyit0i/",
      "text": "What were the instructions?",
      "author": "PhDapper",
      "created": 1637792607,
      "upvotes": 6,
      "replies": {
        "hm0witj": {
          "link": "/r/college/comments/r1gtny/if_the_instructions_to_the_assignment_were/hm0witj/",
          "text": "write a 1-2 page summary of any article from the university library about \"Minerals\" for a geology class.  The only instructions were, \"1-2 page summary on the topic of \"Minerals.\"  Nothing else.  So, I went to the this chapter's module and was reading about \"park rangers.\"  So, I found an article about 2 people who went to a national park that doesnt get many visitors looking for certain types of rocks and minerals when they were murdered, me being a Forensics major and taking this class out of interest I summarized the article and elaborated about it's applications to park rangers and forensics/detective work/and more.  The only notes the teacher left on my 50% grade was, \"Sad, but irrelevant.\"  I emailed about it since it's a remote course and I have no other way, he refuses to do anything even though I elaborated further in these emails.",
          "author": null,
          "created": 1637840629,
          "upvotes": 1,
          "replies": {
            "hm1extj": {
              "link": "/r/college/comments/r1gtny/if_the_instructions_to_the_assignment_were/hm1extj/",
              "text": "Ah. Well, I’m not positive, but it sounds like what you summarized was an article about a murder case rather than information on the topic of minerals. The reference to rocks and minerals seems tangential in this case; you could have probably swapped that out for “pine cones,” and it wouldn’t have really changed the story.",
              "author": "PhDapper",
              "created": 1637851824,
              "upvotes": 4,
              "replies": {}
            },
            "hm26bju": {
              "link": "/r/college/comments/r1gtny/if_the_instructions_to_the_assignment_were/hm26bju/",
              "text": "I can understand how you made that mistake, but the paper really wasn’t on the topic of minerals",
              "author": "when-words-fail",
              "created": 1637863790,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}