{
  "sid": "qw46ns",
  "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/",
  "title:": "Option of In-Person College Classes vs. Online...",
  "text": "I am a 35-minute drive away from my college. I  have been enrolled my last two semesters in online classes. Part of me misses being in-person and having interactions be in-person with my professors and classmates. On the other side, I am/ have gotten very used to having my classes be online. Which do I pick? Online or In-Person classes? I know that there are pros and cons to both options. Anyone out there in a similar predicament?",
  "author": "No_Grapefruit3291",
  "created": 1637169755,
  "updated": 1637398165,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.93,
  "comments": {
    "hl0p1su": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl0p1su/",
      "text": "You would save gas money, commute and no traffic. I like online learning ig it's based off how u learn.",
      "author": "Tempintern23",
      "created": 1637174120,
      "upvotes": 1,
      "replies": {
        "hl0qur6": {
          "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl0qur6/",
          "text": "Hi and I wanted to say thank you for responding! 😀\n\nI am leaning towards online classes again this semester for some of the reasons you present and more! \n\nAlthough by NOT taking in person classes I am afraid I will miss out on most is in-person interaction, community (and friends)… would I be missing out in this area do you think, or maybe not?",
          "author": "No_Grapefruit3291",
          "created": 1637174820,
          "upvotes": 1,
          "replies": {
            "hl0s2ui": {
              "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl0s2ui/",
              "text": "real talk man, at the end of the day you gotta focus on your edu, and your career. Friends come later, you aren't doing college for your friends. I feel like so many young people these days are dependent off their friends for everything you know wheter that be eating outside, attending classes by yourself etc.\n\nYou just gotta act like an adult and do your things by yourself you know. Cause your getting a degree for yourself not your friends you gotta look at it long term right. You are doing this for yourself your friends ain't gonna do sh\\*t right. \n\nLemme tell you something, in my opinion there are wayy more pros to doing online school compared to in person. Convenience, flexibility and you get to WFH. Take advantage of it. Why go to a in person one like your gonna have to spend time on commute, etc. Waste of money and all that.",
              "author": "Tempintern23",
              "created": 1637175295,
              "upvotes": 1,
              "replies": {
                "hl0uclm": {
                  "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl0uclm/",
                  "text": "Yeah man you are sooo  right I feel!\nYou literally are firing off the words of wisdom I needed!\n\nAlthough some friends are long-term… it does come down to what I want to achieve and my own goals, and no one else is going to set and achieve these goals except me…\n\nI am not the type of person to be dependent off of my friends, I just want some more people to talk with/ relate to. \n\nThank you!!!",
                  "author": "No_Grapefruit3291",
                  "created": 1637176198,
                  "upvotes": 1,
                  "replies": {
                    "hl0yafv": {
                      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl0yafv/",
                      "text": "glad i could help :)",
                      "author": "Tempintern23",
                      "created": 1637177777,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hl1ni47": {
                  "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl1ni47/",
                  "text": "Agreed. I prefer online classes because i can save money on not commuting a long distance and overpriced cafeteria food. not to mention, online classes are generally easier because they are most of the time open book and you can use the internet to search up answers. Don't understand why people stress about going to college just to make \"friends\" when there is an easier alternative option that is less expensive. Having an easier academic life that is less stressful is more important than making short term friendships.",
                  "author": "ReadyCarpet1",
                  "created": 1637188037,
                  "upvotes": 2,
                  "replies": {
                    "hl1or7w": {
                      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl1or7w/",
                      "text": "exactly, ig its because so many of these youngsters are just insecure and those who say \"that's the whole point of college is to make friends\" that's just total bs in general. The point fo getting your degree is to get ur edu and that diploma to help you in your career, not friends.\n\nFriends in college are especially a distraction as well, you gotta look at what helps you. Having friends, how is that gonna provide value to you. That's the way u have to see it.",
                      "author": "Tempintern23",
                      "created": 1637188566,
                      "upvotes": 2,
                      "replies": {
                        "hl2yzw2": {
                          "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl2yzw2/",
                          "text": "You must just go to a bad college to have such a bleak outlook on the merits of college.",
                          "author": "imalwaysalittletired",
                          "created": 1637209890,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl0y5b2": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl0y5b2/",
      "text": "If I were you, I’d try to at least have ONE class on campus just to try it out.  I think it’s just as important to develop social and networking skills in college in addition to academic skills.",
      "author": "Ill-Ad-8151",
      "created": 1637177720,
      "upvotes": 1,
      "replies": {
        "hl0zg1b": {
          "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl0zg1b/",
          "text": "Hello. I agree with you entirely. Taking one class would be good to kinda of strike a balance and get reacquainted with in person classes and have more interactions that are in-person. \nI am torn though,still…As an essential worker with 3-part time jobs my time management skills are better with a more consistent schedule - and online classes seem to meet that flexibility and time management checkbox for me. I like your idea though.\nThank you!",
          "author": "No_Grapefruit3291",
          "created": 1637178236,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hl1dapi": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl1dapi/",
      "text": "Whichever helps you learn the best.",
      "author": "SenoraGeo",
      "created": 1637183825,
      "upvotes": 4,
      "replies": {}
    },
    "hl1f3ce": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl1f3ce/",
      "text": "So I had a 40 minute commute to and from class. First year I was in person which I enjoyed. Second year I was online. Third year I was hoping to be fully in class, so I moved to campus. I'm a hybrid right now. 2 in person, 4 online. \n\nTbh I hated online class all throughout second year, mostly because of being stuck at home with my family. Which lead to me moving out eventually anyways. I think if you live by campus then you take advantage of in person, since you have access to the teachers right there. I had teachers online ignore me for weeks when I would email them questions about assignments. \n\nIf you commute, I would say do what's better for how you think you'll learn. If you need a teacher's attention then in person is best. If you're more independent then go for online. Online I found that I taught myself the material more when in person I felt that my needs were met. \n\nCommuting does suck tho, I hated it. Did it for 2 years and wanted death. Especially for 8ams.",
      "author": "Successful-Painter87",
      "created": 1637184547,
      "upvotes": 3,
      "replies": {}
    },
    "hl1aox4": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl1aox4/",
      "text": "I have a 30-minute bike ride to campus - most of my classes are in person but have recordings, only 1 is 100% offline. I thought I'd be going to class a lot more, but after a week I almost completely switched back to online whenever possible. The bit of social interaction just doesn't weigh up against not having to rush to class, being able to eat in peace at home, and working through the recordings at my own pace.",
      "author": "Han_without_Genes",
      "created": 1637182725,
      "upvotes": 2,
      "replies": {}
    },
    "hl1rpcf": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl1rpcf/",
      "text": "Can you do both? I know I'm signing up for RA and in person classes for spring, half because some of my classes are only available online. But it saves gas if you can only go in person T/TH and online MWF or something. Also I've found for some of my classes I'm learning better online",
      "author": "aisfog",
      "created": 1637189833,
      "upvotes": 2,
      "replies": {}
    },
    "hl2gg9x": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl2gg9x/",
      "text": "If possible, I’d say do half and half. I did 2 in person classes and 2 online ones this semester and my commute is an hour. I also stacked up my classes between 2 days so I don’t commute 4 days a week.",
      "author": "MoodyBoi9",
      "created": 1637201018,
      "upvotes": 2,
      "replies": {}
    },
    "hl2ip3s": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl2ip3s/",
      "text": "Im doing half of classes online, half in person",
      "author": "Negat1veMasterpiece",
      "created": 1637202026,
      "upvotes": 2,
      "replies": {}
    },
    "hl2ob5c": {
      "link": "/r/college/comments/qw46ns/option_of_inperson_college_classes_vs_online/hl2ob5c/",
      "text": "If you really have to do in-person class, try to squeeze 2 classes on the same day so you can make the most of that commute",
      "author": "FluffyStuffInDaHouz",
      "created": 1637204597,
      "upvotes": 2,
      "replies": {}
    }
  }
}