{
  "sid": "rg20in",
  "link": "/r/college/comments/rg20in/is_a_35_gpa_good/",
  "title:": "Is a 3.5 GPA good?",
  "text": "So I'm taking finals right now as a freshman and instead of studying for the last hour, I've been calculating my grades. If I do as well as possible on my finals as I hope, I'm going to end my first semester with a 3.53 GPA. This seems low because I came out of HS with a 3.9 GPA, but I know they weigh things differently in college so I just kind of want a feel for how I did this semester.\n\nI'm currently in a chemical engineering program if that matters.",
  "author": "jamestar1122",
  "created": 1639466422,
  "updated": 1639847937,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.65,
  "comments": {
    "hohpei8": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hohpei8/",
      "text": "How dare you post such a crap GPA on this subreddit. Be gone peasant.\n\n/s",
      "author": "ShadowIG",
      "created": 1639472840,
      "upvotes": 17,
      "replies": {}
    },
    "hohhbw6": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hohhbw6/",
      "text": "Yes bro",
      "author": "2lit_",
      "created": 1639466482,
      "upvotes": 10,
      "replies": {}
    },
    "hohhkiz": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hohhkiz/",
      "text": "I mean, I made it into a PhD program and my gpa ran between 3.2 and 4.0 depending on the semester (final cumulative GPA was a 3.6). It really just depends what you want to do after college. If you want to just get a job then gpa doesn't matter as much. If you want to keep going up in academia then it matters more. \n\nIn general though, 3.5 is really good.",
      "author": "verbatimspades",
      "created": 1639466657,
      "upvotes": 6,
      "replies": {}
    },
    "hoihzrk": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hoihzrk/",
      "text": "This is a question to which you could've gotten more than credible answers to on the internet. You've spent a couple semesters in college and still don't know what a good GPA for college is? I wonder if you just posted this question here to try and get validation. Keep it up though, 3.5's great.",
      "author": "_pavmah_783",
      "created": 1639491884,
      "upvotes": 3,
      "replies": {
        "holxhh5": {
          "link": "/r/college/comments/rg20in/is_a_35_gpa_good/holxhh5/",
          "text": "He’s a freshman probably just curious",
          "author": "lucky_pebblez",
          "created": 1639544788,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hohl6ah": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hohl6ah/",
      "text": "Although it may change from country to country but 3.5 gpa and above  puts you in the dean's list and that's, at least in my opinion, impressive",
      "author": "Taz_502",
      "created": 1639469390,
      "upvotes": 2,
      "replies": {}
    },
    "hoibkl6": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hoibkl6/",
      "text": "That's Dean's List for my school.",
      "author": "Threethirtysix",
      "created": 1639488658,
      "upvotes": 1,
      "replies": {}
    },
    "hoif7nl": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hoif7nl/",
      "text": "You can get into a decent graduate school with that gpa, so yes.",
      "author": "diptheshit",
      "created": 1639490476,
      "upvotes": 1,
      "replies": {}
    },
    "hoioj14": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hoioj14/",
      "text": "I'm graduating with a 3.5 GPA and that qualifies me for latin honors (cum laude) at my school.",
      "author": "The-Great-Outd00rs",
      "created": 1639494847,
      "upvotes": 1,
      "replies": {
        "hokcm87": {
          "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hokcm87/",
          "text": "Lucky! Cum Laude is a 4.0 at mine.",
          "author": "FaithlessnessNo6444",
          "created": 1639518625,
          "upvotes": 2,
          "replies": {
            "houhd54": {
              "link": "/r/college/comments/rg20in/is_a_35_gpa_good/houhd54/",
              "text": "Ours is Summa cum laude for 4.0",
              "author": "The-Great-Outd00rs",
              "created": 1639697559,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hoj4x6u": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hoj4x6u/",
      "text": "that’s a really good GPA especially for a freshman college student. it’s hard adjusting to the way college does things so it’s impressive when freshmen get used to it so quickly",
      "author": "maya0310",
      "created": 1639501380,
      "upvotes": 1,
      "replies": {}
    },
    "hokrx54": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hokrx54/",
      "text": "We need to stop allowing these posts lol",
      "author": "wolfy321",
      "created": 1639525177,
      "upvotes": 26,
      "replies": {
        "holc36c": {
          "link": "/r/college/comments/rg20in/is_a_35_gpa_good/holc36c/",
          "text": "Nah I love it, stick ur test on the fridge king🙌",
          "author": "endmee",
          "created": 1639534370,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "hokch7k": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hokch7k/",
      "text": "For the people who need this. Grades aren't everything. You really only need to keep above a 3.0. My college only needs a maintained 3.5 to keep a full ride. Even in accounting where we were taught that GPA means the world it's your character and how you've learned to enjoy learning that matters. Take it from me. Have a 4.0 and I'm not much better than any other candidate who got their degree like myself.",
      "author": "FaithlessnessNo6444",
      "created": 1639518570,
      "upvotes": 2,
      "replies": {}
    },
    "hokuryo": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hokuryo/",
      "text": "Yes!",
      "author": "101daffyduck",
      "created": 1639526462,
      "upvotes": 2,
      "replies": {}
    },
    "hoksz47": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hoksz47/",
      "text": "NEEEERRRRRRDDDDD. Yes you're fine lmao",
      "author": "LeadingYogurtcloset8",
      "created": 1639525652,
      "upvotes": 1,
      "replies": {}
    },
    "holbyfw": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/holbyfw/",
      "text": "Fukkin sick dude just reached the same gpa myself🙌🙌🙌 thriving🙏",
      "author": "endmee",
      "created": 1639534311,
      "upvotes": 1,
      "replies": {}
    },
    "holc3nm": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/holc3nm/",
      "text": "Absolutely terribleeee! Jk u good",
      "author": "zzz44532",
      "created": 1639534376,
      "upvotes": 1,
      "replies": {}
    },
    "hom5lni": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hom5lni/",
      "text": "It depends on how your colleges weighs your GPA because depending on where you go they could do it differently. Based off what you said I'm assuming you're being graded on a 4.0 GPA scale, which from what I know is typical for american schools.\nA 3.5 GPA is not that bad, it's really good. You shouldn't worry about how your GPA is lower than it was in high school, you're in college now. College is very different from high school, you should always do your best, but you should base your grades on what you need to keep. Like say, \"oh, I need a 3.0 GPA to be able to study abroad and keep my financial aid.\" something like that. I don't know about grad school and if you need a certain GPA for it, but you have plenty of time to turn everything around.\nI suggest focusing all your energy on your courses specifically for your major. All of your gen ed requirements come second to your major requirements and if all else fails you can take it again. For example, at my college I just need a D to get the credit for my class requirement, sure that's nice, but I'm not going to let that slide for my major requirement classes, but I will let it slide for my gen ed classes, unless I truly want to take it again for other reasons.\n\nDon't run around like a chicken with it's head cut off trying to calculate your overall grades for each semester, frankly in my opinion you're wasting your time doing that. Like you said, you're doing this instead of studying, STUDYING. To pass your final!!!\n\nWhen you are in the middle of the semester and trying to up your grades when you don't do well on say homework or in class work, find out your teacher's policies on making up work and such. My pre-calc teacher had it set up where we receive half a point (instead of one point) for a question if we re-do it and get it right if we got it wrong when he returned it to us after grading. That's a bit of a mouthful, but you get the idea. Another example, my physics teacher had no extra credit or make up, so what we got is what we got.\n\nJust study, do well, and know your goals. Your major doesn't matter when it comes to this. To someone else it's going to be ahhh chemical engineering is so hard, but accounting is a super easy fly by, while you're over here like chemical engineering is easy, accounting us hard. You know?\n\n\n\n\nTLDR; dont worry about calculating your gpa, it's a waste of time, spend it studying instead. Know what grades you need to keep during the semester by checking your scores for each piece of classwork and try to get extra credit or make-up work if you truly need it.",
      "author": "Jusunie",
      "created": 1639549687,
      "upvotes": 1,
      "replies": {}
    },
    "hom6dj6": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hom6dj6/",
      "text": "lmfao",
      "author": "Melon-Kolly",
      "created": 1639550201,
      "upvotes": 1,
      "replies": {}
    },
    "honci0x": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/honci0x/",
      "text": "As a freshman that’s pretty good. What are you majoring In? A lot of times GPA isn’t as high your first semester of school, which is totally fine. You need to get adjusted and that sort of thing. You are also in college in a pandemic which makes things much weirder. All in all that’s pretty good, better than my first semester haha",
      "author": "Secret_Schedule4644",
      "created": 1639579033,
      "upvotes": 1,
      "replies": {}
    },
    "hopmtkf": {
      "link": "/r/college/comments/rg20in/is_a_35_gpa_good/hopmtkf/",
      "text": "As others have already shared, 3.5 is great but it does depend on what you want to do and if you have a scholarship that requires you to keep a certain gpa. Our daughter had an engineering scholarship that requires a minimum 3.5 gpa. That can be stressful so she tried to get as high a goal as possible each class/semester to offset a bad semester. \n\nLikewise some internships require a certain gpa or if you want to get into grad school. But chances are your first semester freshman year is a learning curve. Be proud of your hard work and 3.5!",
      "author": "ChillinatthePO",
      "created": 1639611693,
      "upvotes": 1,
      "replies": {}
    }
  }
}