{
  "sid": "q5nif7",
  "link": "/r/college/comments/q5nif7/diploma_or_degree/",
  "title:": "Diploma or degree",
  "text": "Hey, so I’m going back to college in January and ill be late 2 semesters because I couldn’t transfer my credits. I don’t want to start from the beginning so I’m wondering if i should do a diploma in marketing, like is the diploma worth it being only 2 years or should i accept starting again going for a 4 years degree?",
  "author": "h1rdc0re",
  "created": 1633924037,
  "updated": 1634083023,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hg6urx7": {
      "link": "/r/college/comments/q5nif7/diploma_or_degree/hg6urx7/",
      "text": "First, look at why you couldn't transfer the credits. Were the national accredited and you are going somewhere that is regionally accredited, which is a higher level? Does your new college accept any CLEP tests or DANTES exams? How about credit for previous experiential learning (jobs, licences, certificates? I would absolutely go for the bachelor's degree.",
      "author": "CindsSurprise",
      "created": 1633924788,
      "upvotes": 2,
      "replies": {
        "hgbv4z1": {
          "link": "/r/college/comments/q5nif7/diploma_or_degree/hgbv4z1/",
          "text": "I tried but no way it will work, i finished my first year outside the country and they won’t transfer them. If this was not an option do you think the diploma is worth it?",
          "author": "h1rdc0re",
          "created": 1634023676,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgco0hz": {
      "link": "/r/college/comments/q5nif7/diploma_or_degree/hgco0hz/",
      "text": "I don't think just a diploma will cut it so I'd pursue a degree, but make it cheap by transferring in cheap credits like CLEP (modernatates.org has review classes and vouchers for the exams free- you might pick up credit for the classes you've taken elsewhere that way). ASU.edu has transfer agreements with a couple of universities in Mexico - could your foreign university have any possible transfer partners here?  Ea.asu.edu has an earned Admissions path. You take a certain number of hours according to your age for $425 per class, no fin aid, and you can drop classes without penalty. Starbucks has a deal where you work for them and they'll pay your online tuition at ASU and a lot of people do that.",
      "author": "CindsSurprise",
      "created": 1634045134,
      "upvotes": 1,
      "replies": {}
    }
  }
}