{
  "sid": "qaej8k",
  "link": "/r/college/comments/qaej8k/professor_has_made_a_grade_mistake_twice/",
  "title:": "Professor has made a grade mistake twice.",
  "text": "In my biology class I recently took an exam and “received” a 72 on it. After looking the exam over, I noticed that my professor counted up my points wrong and my actual grade on the exam was an 89. I emailed them and talked to them in person and after a few days it all got fixed. I wasn’t upset or mad at them at all, I understand that mistakes happen. Midterm grades for the semester have just been posted and I currently hold an A- in the class. I didn’t understand how I hold an A- when the only thing I got a less than an A on was a B+ on this exam. Everything else I’ve received an A. The exam is currently worth 35% of my grade and the Multiple quizzes + assignments are worth 25%. Long story short I calculated my current grade and I should have an A not an A-. I don’t want to bring this up to my professor because I don’t want to seem like a nag, my professor is also my advisor, and midterm grades don’t count towards anything. My only concern is that I don’t want my final grade to be wrongfully calculated based on my midterm grade. What should I do?",
  "author": "thunderfig",
  "created": 1634528293,
  "updated": 1634654790,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh2j1ut": {
      "link": "/r/college/comments/qaej8k/professor_has_made_a_grade_mistake_twice/hh2j1ut/",
      "text": "If you're in-person, ask to see your professor during office hours and ask them to explain how they calculated your grade.  If possible, try to get them to show you the process - they may not be aware that they could be doing something incorrectly.\n\nNo need to be confrontational or hostile, just explain that you don't get it and you'd like them to help.",
      "author": "DeskRider",
      "created": 1634529308,
      "upvotes": 5,
      "replies": {}
    }
  }
}