{
  "sid": "r406je",
  "link": "/r/college/comments/r406je/death_in_the_family_losing_motivation_as_the/",
  "title:": "Death in the family, losing motivation as the semester reaches its end",
  "text": "Throwaway account. \n\nA couple weeks ago, there was a death in my family. I went into Thanksgiving break knowing that the last two weeks of class, the weeks after break, would be absolute hell if I didn't get a lot of work done. Instead of doing work, I spent my break at the funeral and attending various other family obligations. \n\nI had today to get a start on my work, but instead I just stared at my wall for a couple hours, gave up, and then spent the afternoon with friends. I came back after that and spent another couple hours doing nothing productive. I didn't even have the motivation to play games on my phone like I usually do when I want to turn my brain off. I just stared off into space.\n\nIt's been about a week and a half like this. In the day I'm exhausted and distracted, and I have a feeling I wouldn't sleep well at night even without my neighbor blasting their music at 4am. \n\nThe worst part is that almost all of my classes are heavy in group work. If it was just my grades on the line, I could probably deal with it, but I hate knowing that I can't be productive and that if I fail to complete my work, my teammates' grades will suffer for it. That's the detail that tips the situation into being too much for me to handle.\n\nRight now, what I need more than anything is a break. I know it won't happen, though, until after the semester is done. I don't think I have any choice but to power through for the next two weeks (plus finals after that, but I'm not as worried about that). \n\nDoes anybody have any advice for moving forward in a case like this?",
  "author": "traaaaaaaaaaaashhh",
  "created": 1638090346,
  "updated": 1638206798,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hmdtssp": {
      "link": "/r/college/comments/r406je/death_in_the_family_losing_motivation_as_the/hmdtssp/",
      "text": "God I am right there with you. I’ve been struggling with my studies all semester and needed to focus during this week off. But there was a lot going on, including a death in the family that prevented that. All I need is that break and I feel like hell and I’m not processing my emotions in the way that I should. \n\nThis isn’t the first time this has happened to me. There was another death 2 years ago that affected me pretty hard emotionally and academically. All I can say while enduring this situation again is that you can pull through. It’s going to suck, but find that strength in you to keep pushing forward. Let your group mates and professors know that there was a death and hopefully they will help pick up any slack. Lean on your friends and family, and take the breaks when you need it. Don’t blame yourself for being unproductive when you don’t get enough done. Death is…hard. Not everyone reacts the same way or in ways we expect. You’ll get to the end of the semester and no matter the outcome, it’ll be ok.",
      "author": "Former_Afternoon9662",
      "created": 1638092336,
      "upvotes": 2,
      "replies": {}
    },
    "hmdt2gh": {
      "link": "/r/college/comments/r406je/death_in_the_family_losing_motivation_as_the/hmdt2gh/",
      "text": "I'm sorry for your loss.\n\nI understand what that is like and the best thing to do is unhinge yourself and finish classes strong. We are literally almost there so just hold on a bit longer. The break will come and you can take better care of yourself.\n\nHave you told your professors that this situation may affect your performance in classes?",
      "author": "QueenOfTheStrings",
      "created": 1638091760,
      "upvotes": 1,
      "replies": {}
    },
    "hmf2vqw": {
      "link": "/r/college/comments/r406je/death_in_the_family_losing_motivation_as_the/hmf2vqw/",
      "text": "Dude, I can't relate more to this thread. My grandpa died a week ago, I lost all my motivation to pay attention to school, I met a girl and got a crush on her and I really can't see her a lot and I keep on working just to keep my self busy enough to stop thinking for a while. I think I am going through the most stressful period of my life, yet. Yesterday I lost all of motivation and I don't even want to work anymore. The loss and the fact that I can't see the girl I have a huge crush on combined have brought my soul to its knees. I just hope for the better days, people say, to come soon. All this stress and anxiety that I don't blow off, also brought a lot of thoughts that my life has no worth and no meaning and my only destiny is to work and make progress, essential becoming a human machine. I try to keep myself strong and get through this \"thunderstorm\" at one piece.\n\nMy personal advice, talk to people, friends, basically anyone and try to go out and have fun whatever you want and/or desire. Keep moving on strong ! Some day all of the pain we endure, physical or psychological, will be rewarded with the biggest and best prizes ! \n\nKeep on moving ! Be strong !",
      "author": "Ok_Negotiation5162",
      "created": 1638118827,
      "upvotes": 1,
      "replies": {}
    },
    "hmh0zhv": {
      "link": "/r/college/comments/r406je/death_in_the_family_losing_motivation_as_the/hmh0zhv/",
      "text": "See if you can get an incomplete.",
      "author": "GenXtreme1976",
      "created": 1638147614,
      "upvotes": 1,
      "replies": {}
    }
  }
}