{
  "sid": "qaskpj",
  "link": "/r/college/comments/qaskpj/help_making_a_decision_about_transferring/",
  "title:": "Help making a decision about transferring",
  "text": "I’m currently a freshman at the U of Oregon. I’ve been here for a little over a month and I’m struggling to get my feet under me. I haven’t made many friends and I’m a little worried bc the only friends I’ve made aren’t people that I feel like myself around. I’m thinking about transferring schools and going to ASU in Tempe. I have a couple of friends in Phoenix and I’m super familiar with the city. \n\nI’m just worried that I might not like it and then I will have wasted time and money at two schools for no reason. \n\nCan anyone give me some advice or help talk me through making this decision? Thank you",
  "author": "notsure1328",
  "created": 1634581174,
  "updated": 1634654739,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hh4yz71": {
      "link": "/r/college/comments/qaskpj/help_making_a_decision_about_transferring/hh4yz71/",
      "text": "Don't look at college as a venue for making friends. Obviously you should endeavor to make some friends or you will be bored and lonely, but that is not and never should be the point. You're there to get a degree to enable you to get a job in the field you picked. You should decide whether or not to transfer based on academics primarily, and only make an exception if you're beyond miserable.\n\nEdit to add: it's hard to tell from your post, but you may be at the point of miserable enough to make that exception. So don't take this as \"don't do it\", take this as a caution.",
      "author": "SouthernRhubarb",
      "created": 1634581389,
      "upvotes": 4,
      "replies": {
        "hh5005t": {
          "link": "/r/college/comments/qaskpj/help_making_a_decision_about_transferring/hh5005t/",
          "text": "Yep that completely makes sense. Only issue is I’m currently undecided with no clue what I want to major in/do in life. All of the people in my life said “that’s the way to go, you’ll figure it out at college” but I don’t know if I can figure it out in a place where I’m not happy.",
          "author": "notsure1328",
          "created": 1634581812,
          "upvotes": 1,
          "replies": {
            "hh50nvr": {
              "link": "/r/college/comments/qaskpj/help_making_a_decision_about_transferring/hh50nvr/",
              "text": "Whoever told you \"figure it out at college\" is full of shit. I would finish this semester then take time off to figure it out. If you want something to do while figuring it out, you could stay and just work on your gen eds until you do, but you should absolutely not go beyond gen eds without knowing. But you're probably better off doing your gen eds at a cheaper community college and not university. School ain't cheap and having loans against a degree you discover you hate too late to change your major is crap. And just going to school without knowing because \"that's what you're supposed to do\" is how you get in that boat. \n\nYour school may have resources to help you figure it out as well, engage with those.",
              "author": "SouthernRhubarb",
              "created": 1634582083,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    }
  }
}