{
  "sid": "reb5tk",
  "link": "/r/college/comments/reb5tk/resource_help/",
  "title:": "Resource Help?",
  "text": "So I'm planning on going to college next spring and I'm wondering about what I'll need to look up and all that. Sort of like a journal but not? I've made a moving Helper but moving is very different from just college. I know I'll need disabled student tips but that's all I got",
  "author": "TheLavenderAuthor",
  "created": 1639263920,
  "updated": 1639516596,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho7etw4": {
      "link": "/r/college/comments/reb5tk/resource_help/ho7etw4/",
      "text": "1) fill FAFSA for financial aid (is pretty much mandatory but also free money)\n\n\n2)take a SAT or ACT test\n\n3)apply for your dream college and check their submission deadlines\n\n4)if you are a foregein have your transcripts evaluated and ready to send",
      "author": "kadxar",
      "created": 1639280981,
      "upvotes": 1,
      "replies": {
        "ho7hp11": {
          "link": "/r/college/comments/reb5tk/resource_help/ho7hp11/",
          "text": "I'm planning on going to community College, if that helps",
          "author": "TheLavenderAuthor",
          "created": 1639282441,
          "upvotes": 1,
          "replies": {
            "ho7uvud": {
              "link": "/r/college/comments/reb5tk/resource_help/ho7uvud/",
              "text": "Are you talking about starting in January of 2022 or 2023?\n\nThe college’s website should help, but here are the basics for most colleges.\n\nApply online, which may include having your high school transcript sent to the college along with proof of any vaccinations required.\n\nContact admissions to check on the status of your application.\n\nApply for financial aid, which usually begins with completing the FAFSA, but be sure to apply for any non-federal aid available. Contact the financial aid office with questions.\n\nMake an appointment to see an advisor to help register for classes.\n\nRegister for classes if you didn’t do that with the advisor.\n\nPay tuition and fees. \n\nCommit to going your best every day.",
              "author": "cajunsoul",
              "created": 1639289875,
              "upvotes": 1,
              "replies": {
                "hoarb5c": {
                  "link": "/r/college/comments/reb5tk/resource_help/hoarb5c/",
                  "text": "Starting the fall semester of 2022(Had to take a big break after high-school) and I know I have some help with alot of the tuition! Thank you for the info!",
                  "author": "TheLavenderAuthor",
                  "created": 1639344933,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}