{
  "sid": "r0lzn0",
  "link": "/r/college/comments/r0lzn0/help_me_with_college_options/",
  "title:": "Help me with college options.",
  "text": "I plan on majoring in Finance or Accounting with a possible double major or minor in political science(my original major but, I changed it). I will be a transfer student for Fall 2022 most likely an incoming Junior. I have NO idea which of these schools I want to go to. I will be an out of state transfer to all of them.  I have no idea what I want to be, do career-wise so, networking and internships are incredibly important to me so I can get an idea of the opportunities that are out there.   \n\n**Give me some pros/cons, advice, or anything you know about these schools. I’m really struggling!**\n\n\n#1. University of Mississippi \n\nI visited the school and really liked the traditional feel. It was a nice average sized college which I would be able to easily walk from class to class on campus. The town of Oxford was tiny and very community oriented but, it felt kind of too small for a college student IMO. I feel like I could potentially get tired of being there. Idk much about their finance program but, their accounting program is supposedly very good. I also applied for the public policy program. \n\n\n#2. University of Alabama\n\nI visited this school and my first thought was wow this campus is way too big for me. It felt super spread out and I did not get a nice community feel while I was there. That was literally the only downside, the size of the campus and the feel I got while walking around. I have heard good things about the Culverhouse Business School but not sure about their accounting and finance programs. \n\n\n#3. Auburn University\n\nUnfortunately, I have not visited yet. In fact, I wasn’t considering Auburn until I read online that overall Auburn slightly outranks UA. Their business school seems nice as well as their campus. Just looking at the pictures and watching videos online, I think I might like Auburn more than UA. Idk why but my gut instinct, or something internally is pushing me towards Auburn over UA and even over Ole Miss (I know that might sound silly) ever since I’ve been researching more about the college.\n\n\n#4. University of North Dakota\n\nI have not visited. I know, it’s the only school outside of the south, seems like the anomaly. However, UND was originally on my list because I got some junk mail from them and applied just for the hell of it, in fact, it was the first college that I applied to. I started looking into the school more, specifically their business school and must say that UND does not seem like a bad choice what so ever. Nistler College seems like it offers some great opportunities to students. Grand Forks and Fargo don’t seems like terrible cities for college graduates either.",
  "author": "nobleinquiry",
  "created": 1637698141,
  "updated": 1638207434,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hlt789h": {
      "link": "/r/college/comments/r0lzn0/help_me_with_college_options/hlt789h/",
      "text": "How do your credits transfer at each of these universities?",
      "author": "Missmaniequinn",
      "created": 1637698564,
      "upvotes": 1,
      "replies": {
        "hlt7pxc": {
          "link": "/r/college/comments/r0lzn0/help_me_with_college_options/hlt7pxc/",
          "text": "Around 80% of them transfer over. I know this because some college offer a transfer equivalency calculator with a few courses. I won’t know until a transfer credit report/evaluation is completed. I don’t think that can be done until AFTER I accept 😢",
          "author": "nobleinquiry",
          "created": 1637698758,
          "upvotes": 1,
          "replies": {
            "hlt8pk8": {
              "link": "/r/college/comments/r0lzn0/help_me_with_college_options/hlt8pk8/",
              "text": "Gotcha! I ask because that would be a priority to me. Also, you can usually get transfer equivalencies down prior to getting in. You can just email someone from admissions. That’s what I did at the school I currently go to. Some other factors to consider is cost, though I’m not sure what your situation is. I don’t know much about these schools but if networking is important to you, I’d instinctively lean more towards Mississippi and Alabama. But idk that’s just my two cents. You’ll probably get more helpful advice from people who are more familiar with these schools.",
              "author": "Missmaniequinn",
              "created": 1637699150,
              "upvotes": 1,
              "replies": {
                "hltaq4i": {
                  "link": "/r/college/comments/r0lzn0/help_me_with_college_options/hltaq4i/",
                  "text": "Thanks! What exactly did you email the admissions office? Did you just say, “can I have a transfer credit report?”lol. Although, they might be waiting for me to send my next set of transcripts as the semester at my community college ends in a few weeks. Not sure though",
                  "author": "nobleinquiry",
                  "created": 1637699938,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlu59l1": {
      "link": "/r/college/comments/r0lzn0/help_me_with_college_options/hlu59l1/",
      "text": "I'm stoked you asked this question, I literally just finished putting together a spreadsheet analysis of over 100+ top colleges in the US as research for a YouTube channel I've started.\n\nSome things to consider from my perspective:\nUniversity of North Dakota is significantly cheaper than either of them. Saving yourself 30k in tuition over two years could save you a lot of loans.\nUniversity of North Dakota also had the highest average salary for graduates\nUND and Alabama both are only about 1/3 in state students, so you'll feel like less of an outsider at those schools\nUND is a smaller school, so it may be more forgiving to a transfer student, and it is lower ranked so you may be able to stand out from your classmates better.\n\nOn paper, I think UND is the way to go. I myself transferred schools for my last 5 semesters and but he time you're a junior, you're pretty focused on studies and your experience is so different from regular freshman. Sure the \"feel\" of a college can be nice and you can always trust your gut, but don't be swayed by thing that probably won't make that big of a difference to you.",
      "author": "Thelton26",
      "created": 1637712725,
      "upvotes": 1,
      "replies": {
        "hlu5sn5": {
          "link": "/r/college/comments/r0lzn0/help_me_with_college_options/hlu5sn5/",
          "text": "Thanks for your perspective! Also, what’s your YouTube channel?\n\nEdit: yes UofAlabama has a HUGE out of state population and UND does too but, most of them are from right next door, Minnesota.",
          "author": "nobleinquiry",
          "created": 1637712973,
          "upvotes": 1,
          "replies": {
            "hlue51z": {
              "link": "/r/college/comments/r0lzn0/help_me_with_college_options/hlue51z/",
              "text": "Fair point, I did see a lot of colleges that had \"regional\" tuition rates or reciprocity with a neighboring state.\n\nIt's called \"The College Guide\", I've been doing a 30 day video challenge to get off my butt and get started, so the quality is definitely that of a beginner. BUT, because we talked I'll make a video this weekend about my transfer student experience, so keep an eye out for that on Friday or Saturday!\n\nHere's a link to my channel intro: https://youtu.be/_UvlCPwYaA8",
              "author": "Thelton26",
              "created": 1637716875,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}