{
  "sid": "q4251c",
  "link": "/r/college/comments/q4251c/how_to_cold_email_someone/",
  "title:": "How to cold email someone",
  "text": "I regularly reach out to random strangers online via a variety of channels (Email, Linkedin, Twitter, Reddit — to name a few).\n\n**I do this for a few reasons:**\n\n* To learn from someone new\n* To make a connection in a new industry or business\n* To pitch a partnership or service\n* To form an introduction\n* To make a new friend\n\n&#x200B;\n\nFrankly, I’d attribute a lot of career success to my ability to ‘network’ and form new relationships with folks over the internet.\n\nHere’s the thing: ***it’s not super intuitive.***\n\nWhen I first started, I was *way* too lengthy with my emails and would lose my ability to capture someone’s attention. Other folks are too brief, which may come across as overly direct and discourteous\n\nIt’s an art form that takes a bit of trial and error.\n\nI’ve spent the past *six years* honing this skill by sending out thousands of emails and messages to peeps on every online platform imaginable.\n\nAnd as a result, I’ve made quite a few connections and formed deep relationships with people that I now call close friends, mentors, and mentees.\n\n**I’ll sum up the elements of an effective cold outreach into 5 rules:**\n\n>**Introduce Yourself, Briefly** — how would you describe (and sell) yourself in one or two sentences?  \n**Give Specific Praise** — provide genuine praise and mean it.  \n**Demonstrate Value** — not always needed, but often helpful to signal the value you bring to the table.  \n**Show Appreciation** — an authentic ‘thank you’ is always nice. And remember, there are multiple ways to say thank you.  \n**Have A Clear Ask** — be direct and specific on what you’re asking for.\n\n95% of cold outreaches can be done with the existing formula above.\n\n&#x200B;\n\n#### Here’s how it works in action:\n\nI’ve included a sample of a recent cold email I sent out to a writer and tech executive, that converted into a chat.\n\nHi \\_\\_\\_\\_\\_\\_\\_\\_,\n\n###### INTRODUCE YOURSELF, BRIEFLY\n\n>A bit about myself: I’m a Business Planning & Operations Lead at \\_\\_\\_\\_\\_\\_\\_\\_\\_ based out of New York City. Our team is focused on improving the performance of our global sales teams.\n\n###### GIVE SPECIFIC PRAISE\n\n>I’m a big fan of your writing on \\_\\_\\_\\_\\_\\_\\_\\_ . My favorite articles are \\_\\_\\_\\_\\_\\_\\_\\_, \\_\\_\\_\\_\\_\\_\\_\\_, and \\_\\_\\_\\_\\_\\_\\_\\_. I also closely follow \\_\\_\\_\\_\\_\\_\\_\\_, and I think you’re all best-in-class writers who are great are evoking emotion, passion, and conviction via writing.  \nInspired by your thoughts, I started journaling, writing, and sharing my thoughts publicly on growth, productivity, and performance.\n\n###### DEMONSTRATE VALUE\n\n>A few months later, by diving into different growth-hacking and audience building rabbit holes, I’ve grown my newsletter [**Musings & Perspectives**](https://www.andrew.today/) to 1,400 readers.\n\n###### SHOW APPRECIATION\n\n>I would’ve never gotten started if it wasn’t for your spiel on writing. Thank you!\n\n###### HAVE A CLEAR ASK\n\n>**If you have 20 minutes to chat in the coming weeks, I’d love to ask you a few questions** on your career journey (principles, habits, investments), your writing process — how you’ve optimized it, and what you’re currently focused on today.\n\nThanks,\n\nAndrew\n\nThis example is for a virtual chat, but the same principles apply for other asks as well.\n\n&#x200B;\n\nI write more on tools, frameworks, and tricks to improve your business performance at [Musings & Perspectives](https://www.andrew.today/about).",
  "author": "Jumpsaye",
  "created": 1633713081,
  "updated": 1634083192,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {}
}