{
  "sid": "pxroll",
  "link": "/r/college/comments/pxroll/will_my_2nd_job_affect_my_fasfa/",
  "title:": "Will my 2nd job affect my FASFA?",
  "text": "Okay so I live in California and go to a state school. \nMy first job pays 16/hr, but I literally only get 6 hours a week. My potential 2nd job pays 16.50/hr, and i’m hoping to work at least 20-25 hours combined.\n\nNow my question boils down to: How much can I make before it affects my FASFA? I keep hearing mixed numbers, I want to see if anyone can clear it up :)",
  "author": "Consciousbeingg",
  "created": 1632907220,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hepc30j": {
      "link": "/r/college/comments/pxroll/will_my_2nd_job_affect_my_fasfa/hepc30j/",
      "text": "You should talk to your schools financial advisors about this. The number is likely specific to the exact city you live in. I also live in California although I don't get FAFSA. However I know how varied income rates are and what's considered low or average. I mean, San Francisco has low income listed around $80k for a single person last time I looked. It's stupid crazy.",
      "author": "Comipa47",
      "created": 1632908029,
      "upvotes": 1,
      "replies": {
        "hepc690": {
          "link": "/r/college/comments/pxroll/will_my_2nd_job_affect_my_fasfa/hepc690/",
          "text": "Oh no way! That’s super crazy but it makes sense. I got to Fresno state but getting in contact with the financial aid department is literally a whole hassle, but i will ask :)",
          "author": "Consciousbeingg",
          "created": 1632908109,
          "upvotes": 1,
          "replies": {
            "hepcs32": {
              "link": "/r/college/comments/pxroll/will_my_2nd_job_affect_my_fasfa/hepcs32/",
              "text": "Does your school offer zoom appointments? My school has a zoom thing setup for academic counseling and tutors and I imagine for financial counseling too. It's a little easier to use than trying to call them because I make an appointment and then wait at home for them to let me into the session.",
              "author": "Comipa47",
              "created": 1632908675,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634057720
}