{
  "sid": "qlkhi6",
  "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/",
  "title:": "Should I miss class for my job?",
  "text": "Hi all,\n\nRecently I was hired for my “dream” job at a very competitive job as a Hospital 911 EMT in the city. I had to work a lot to get the job and have a mandatory job orientation tomorrow which means I need to miss 2 classes. So far I’ve had perfect attendance and any missed were excused. The reason I am conflicted is that if I don’t go to orientation I lose the job (it’s the best EMS job you can get and has the best pay I’ll ever get in undergrad tbh ($24.50/hr) so I don’t want to give it up as well as I am super passionate about helping others. I emailed my professors out of curiosity to tell them I won’t be in class cause of orientation. One Professor sent a harsh email stating I can’t miss and need to tell my job I can’t go. Issue is, this is a very different job from normal ones and since it’s EMS, we do orientation at once; it’s not like they walk you around rather they go over procedures, scope of practice, EMS laws exclusive to the city, operations etc that takes multiple hours and they can’t cater it. After the email my professor sent, I felt kinda down and now am wondering if I should give up the job and go to class even though all the time I sacrificed applying to the job and dozens hours of government courses I had to take to apply. Should I still go to the orientation and miss class? Will it sour my relationship with my professors? \n\nThanks for reading",
  "author": "maxone2",
  "created": 1635905937,
  "updated": 1636137567,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj3ilnh": {
      "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3ilnh/",
      "text": "If you feel like this is the only time you will have to miss class for this job, i say miss it. If you foresee having to miss even more class for the job down the line, then maybe this isn't the job to take while you're finishing school.",
      "author": "afipunk84",
      "created": 1635906182,
      "upvotes": 5,
      "replies": {
        "hj3iqpd": {
          "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3iqpd/",
          "text": "I only need to miss for orientation otherwise I’ll be doing shifts on the weekend",
          "author": "maxone2",
          "created": 1635906243,
          "upvotes": 3,
          "replies": {
            "hj3uk5d": {
              "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3uk5d/",
              "text": "Definitely skip class then, goodluck!",
              "author": "afipunk84",
              "created": 1635911578,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hj3p72b": {
      "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3p72b/",
      "text": "Your teacher sounds like one of those dickheads that thinks the entire world revolves around his class. Fuck him and go to your job orientation",
      "author": "YouBoreMeHard",
      "created": 1635909067,
      "upvotes": 3,
      "replies": {}
    },
    "hj3ih3t": {
      "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3ih3t/",
      "text": "If you need/want the job, go to it. As you said, it only interferes with one day. Is one absence going to drop your mark significantly to be a serious issue?",
      "author": "InsulinBlue",
      "created": 1635906127,
      "upvotes": 2,
      "replies": {}
    },
    "hj3og2e": {
      "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3og2e/",
      "text": "Go for it. You’re bound to miss classes for job interviews/orientations even if you don’t go to this certain orientation.",
      "author": "hercomesthesun",
      "created": 1635908728,
      "upvotes": 2,
      "replies": {}
    },
    "hj461vf": {
      "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj461vf/",
      "text": "As a professor, I would tell you to do what you feel is best for your situation. This would mean doing what you need to do to get caught up on your own.\n\nGiven your situation, it sounds better to skip class for orientation and be sure not to miss any more classes. Your professor may not excuse the absence, but what is one absence and associated lost points compared to a great job opportunity that you’ll lose if you don’t go to orientation?",
      "author": "PhDapper",
      "created": 1635918378,
      "upvotes": 2,
      "replies": {
        "hj4wad5": {
          "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj4wad5/",
          "text": "Thank you for the reply! Yeah I’m going to go plus I have 0 I excused absences this year so far",
          "author": "maxone2",
          "created": 1635939441,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj3q1s6": {
      "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3q1s6/",
      "text": "First you need to carefully read your syllabus and see what the professor already said about missing class. If they said that you will lose points then email them back and explain that you must miss for this job opportunity for your own financial well-being and you understand that you will lose the points, but you would appreciate an opportunity to earn them back if it is possible. \nMake him be the bad guy that says you need to lose points for the opportunity of a good job. Some professors are too full of themselves to admit that their class is not the most important thing in the world so just accept the outcome and do your best moving forward. If you hadn’t told him and just made an excuse like being sick, he would have never been able to tell you that you can’t miss. It sucks that professors power trip like this when given a chance. Just be nice about it and hope he will relish the chance to be benevolent.",
      "author": "Scholarscollective",
      "created": 1635909458,
      "upvotes": 1,
      "replies": {
        "hj3q8oh": {
          "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3q8oh/",
          "text": "Yeah I should have said sick or something. I was being too honest and “nice” I guess. I only ever missed 1 class so far and that was for my doctors appointment",
          "author": "maxone2",
          "created": 1635909547,
          "upvotes": 1,
          "replies": {
            "hj3sb58": {
              "link": "/r/college/comments/qlkhi6/should_i_miss_class_for_my_job/hj3sb58/",
              "text": "I’d bet any money that he still would have said something along the lines of “bEiNg SiCk iS nO eXcUsE” 🙄🙄",
              "author": "DanielaThePialinist",
              "created": 1635910509,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}