{
  "sid": "r00c8o",
  "link": "/r/college/comments/r00c8o/today_i_was_on_campus_for_the_first_time_since/",
  "title:": "Today I was on campus for the first time since March 14, 2020",
  "text": "I had to do a chemistry lab that I didn't do when I took the class because I took it remotely.\n\nI was a freshman in March 2020 and now I'm a junior. It was pretty weird. The campus still felt super familiar but I felt so awkward. I felt like I was a freshman again. It's so weird that last time I was on campus I was younger than most people and now I'm the same age or older than most people. Half of the people on campus are new (those who were juniors/seniors when I was a freshman have graduated and now there are freshmen/sophomores I've never seen before). And the freshmen look more confident and comfortable than me.\n\nI guess it's the typical I-still-feel-like-developmentally-I'm-2-years-younger-than-I-actually-am covid student syndrome. But I'm 20. I'm supposed to be and act like an adult. Feeling younger than I am is not an option, because my responsibilities and worries for the future are only increasing.\n\nI also just felt like everyone has been moving forward for months, or even a year if they returned to campus in Fall 2020 which many people did. And I was stagnant, at home, hibernating or something, even though I was taking classes -- I mean, no one cares about what classes I completed/how well I did except for my counselor, who only thinks about me for 5 seconds a semester anyway. I feel like the most valuable thing at this point in my life is social experience/skills, and I am far behind compared to everyone I know in real life who is in college right now.\n\nI'll be going back to campus for the rest of my college career in the spring. It will be my junior spring, and my first spring semester spent completely on campus. I'm pretty nervous. I'm going to try to avoid telling people I spent the past 2 years at home because it's embarrassing. Most people I know jumped at the chance to go back to campus as soon as it was possible (and I don't judge them for that). I have my reasons for not going back sooner, but I'm always second-guessing if it was the right decision.\n\nIt was just strange and I wanted to share. Maybe if there's anyone else who has also not been on campus for a while they can relate, and if you've already gone back after being gone for a while, please let me know how you felt and how you re-adjusted.",
  "author": "p0k3b0wl",
  "created": 1637627436,
  "updated": 1637689040,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlpo2i8": {
      "link": "/r/college/comments/r00c8o/today_i_was_on_campus_for_the_first_time_since/hlpo2i8/",
      "text": "That’s great. I transferred during the pandemic and I haven’t even been to my school…and I’m about to graduate XD",
      "author": "DramaQueen100",
      "created": 1637630370,
      "upvotes": 1,
      "replies": {
        "hlqbhqi": {
          "link": "/r/college/comments/r00c8o/today_i_was_on_campus_for_the_first_time_since/hlqbhqi/",
          "text": "I'm sorry, that sucks :(",
          "author": "p0k3b0wl",
          "created": 1637641676,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlrid6d": {
      "link": "/r/college/comments/r00c8o/today_i_was_on_campus_for_the_first_time_since/hlrid6d/",
      "text": "I’m in the same exact fucking boat. I was a bright eyed freshman back in 2020 and now how the fuck did I end up as a junior?? People ask me my age and I literally have to stop and think “Oh I’m 20 now, not 19.”  Honestly I’m focusing on the social aspect the most. Covid ripped it away from us so fast and I don’t care what anyone says, I gotta be doing well socially to be doing well in school. Here with u bud",
      "author": "Sensitive-Put-4912",
      "created": 1637673226,
      "upvotes": 1,
      "replies": {}
    }
  }
}