{
  "sid": "qsci6r",
  "link": "/r/college/comments/qsci6r/transferring_to_a_community_college/",
  "title:": "Transferring to a community college",
  "text": "So I am currently a freshman at a university and want to transfer to an online community college after my first semester mainly to focus on my mental health and because I am struggling at my current university. \n\nI am currently a computer science major but I felt like it’s too hard for me, so I want to go to a community college with an undecided major. Is this a good decision?",
  "author": "pearybeary_",
  "created": 1636727795,
  "updated": 1637396181,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkcarms": {
      "link": "/r/college/comments/qsci6r/transferring_to_a_community_college/hkcarms/",
      "text": "Yes.  As someone who flunked out of college years ago, and just recently went back, due to mental health issues I think this would be a very wise decision.  Your mental health needs to come first and it doesn't matter if you're at a community college or big university.  If you need to take some time off school to get to feeling better there's nothing wrong with that either.",
      "author": "1976Raven",
      "created": 1636730593,
      "upvotes": 2,
      "replies": {}
    },
    "hkd8791": {
      "link": "/r/college/comments/qsci6r/transferring_to_a_community_college/hkd8791/",
      "text": "Yes. In fact, if you have to then take a semester off and focus on your mental health, or take like 2-3 classes at your CC.",
      "author": "WalmartDarthVader",
      "created": 1636744270,
      "upvotes": 1,
      "replies": {}
    },
    "hke4buc": {
      "link": "/r/college/comments/qsci6r/transferring_to_a_community_college/hke4buc/",
      "text": "If you can afford it, taking courses in things that fill basic requirements or things that seem fun can improve college abilities and help with figuring out a new path.",
      "author": "zifmer",
      "created": 1636758298,
      "upvotes": 2,
      "replies": {}
    }
  }
}