{
  "sid": "qwvonl",
  "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/",
  "title:": "Will anything actually happen if im reported to the dean for “cyber bullying?”",
  "text": "I asked my groupchat how everyone is doing so well in chemistry and I was basically asking like “the secret” to passing chemistry. This girl said I’m an attention seeking complainer because all I’ve ever mentioned in the groupchat is my bad grades. I do mention them a lot but I wanted a genuine answer; I wasn’t trying to seek attention or sympathy. So I told her to stop being a cunt. Then everyone got mad at me. Then this other kid kept making fun of me for failing chemistry, so I called him a dipshit. And then girl said she was reporting me to the dean for “cyber bullying.” Will anything actually happen? Was I in the wrong?",
  "author": "Castor346",
  "created": 1637258792,
  "updated": 1637354143,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hl5e9wh": {
      "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl5e9wh/",
      "text": "Calling someone the C-word is wrong. Insulting people is wrong too, but that just means you’re both wrong (and you more than her). \n\nThey’re unlikely to actually bother reporting you if you just stop trying to take advantage of them and being a jerk. If they do, you’ll have to talk to the Dean of Students and they’ll tell you more details there.",
      "author": "AceyAceyAcey",
      "created": 1637259290,
      "upvotes": 4,
      "replies": {
        "hl7biht": {
          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl7biht/",
          "text": "How was I taking advantage of them and being a jerk? They were horrendously rude to me.",
          "author": "Castor346",
          "created": 1637288471,
          "upvotes": -2,
          "replies": {
            "hl7fx3c": {
              "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl7fx3c/",
              "text": "It sounds to me like you’re using them for help on HW without giving anything back.",
              "author": "AceyAceyAcey",
              "created": 1637290480,
              "upvotes": 1,
              "replies": {
                "hl80htx": {
                  "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl80htx/",
                  "text": "Definitely not the case. We’ve all helped each other in the group.",
                  "author": "Castor346",
                  "created": 1637301008,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl5f59k": {
      "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl5f59k/",
      "text": "Is this at a college? I'm not saying either party is right, but school admin does not give a f*ck about classmates not getting along. As long as its not assualt, deadly threat, or sexual, school admin would probably tell this reporting figure to avoid contact with you, or outright ask why this would be their responsibility.",
      "author": "AHumbleLibertarian",
      "created": 1637259630,
      "upvotes": 2,
      "replies": {
        "hl661n3": {
          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl661n3/",
          "text": "often they don't even care if it's sexual assault",
          "author": "antidolphinactivist",
          "created": 1637270258,
          "upvotes": 2,
          "replies": {}
        },
        "hl80re3": {
          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl80re3/",
          "text": "Hopefully that’s the case. I honestly am not a mean person and I normally don’t lash out like that, but damn if that comment didn’t get me boiling.",
          "author": "Castor346",
          "created": 1637301172,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hl5osdr": {
      "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl5osdr/",
      "text": "Yes you were in the wrong. You're both acting like children. Since presumably you're not actual literal children, the school probably won't care. In the mean time, grow up.",
      "author": "HumanDrinkingTea",
      "created": 1637263439,
      "upvotes": 3,
      "replies": {}
    },
    "hl64iwm": {
      "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl64iwm/",
      "text": "Quit acting like an entitled child, and everything in your life will improve.",
      "author": "lucianbelew",
      "created": 1637269643,
      "upvotes": 4,
      "replies": {
        "hl7bgbe": {
          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl7bgbe/",
          "text": "How was I entitled? I asked a question and I was met with hostility.",
          "author": "Castor346",
          "created": 1637288444,
          "upvotes": 1,
          "replies": {
            "hl7c20q": {
              "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl7c20q/",
              "text": "Keep looking in the mirror.  If you even remotely deserve the opportunities you've been given in life, you'll figure it out.",
              "author": "lucianbelew",
              "created": 1637288720,
              "upvotes": 0,
              "replies": {
                "hl7dta4": {
                  "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl7dta4/",
                  "text": "You didn’t answer my question. What makes me entitled?",
                  "author": "Castor346",
                  "created": 1637289519,
                  "upvotes": 2,
                  "replies": {
                    "hl7mp9s": {
                      "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl7mp9s/",
                      "text": "Look in the mirror. If you are remotely deserving of the opportunities you have received in life, you'll figure it out. If you don't figure it out, that just confirms that you're another overprivileged piece of shit who deserves every last consequence they'll never understand.",
                      "author": "lucianbelew",
                      "created": 1637293614,
                      "upvotes": 0,
                      "replies": {
                        "hl80kc4": {
                          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl80kc4/",
                          "text": "Damn, I want what you’re smoking cause you don’t make any fucking sense lol.",
                          "author": "Castor346",
                          "created": 1637301052,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "hl80xrb": {
                          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl80xrb/",
                          "text": "Literally, what does this have to do with my original post? What is hard about it to understand? 2 people in my group were being dicks, and I said something back. I just wanted to know if the dean would actually give a shit about this situation. Calling me privileged? I grew up in poverty and fought tooth and nail to get the grades and get into the college I wanted. So try again.",
                          "author": "Castor346",
                          "created": 1637301283,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hl7hlo8": {
      "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl7hlo8/",
      "text": "How bout you stop being a cunt",
      "author": "MaleficentDistrict22",
      "created": 1637291246,
      "upvotes": 2,
      "replies": {
        "hl80ndp": {
          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl80ndp/",
          "text": "What made me the cunt in the situation? I asked a question to the group; they responded with hostility.",
          "author": "Castor346",
          "created": 1637301103,
          "upvotes": 2,
          "replies": {
            "hl82dkr": {
              "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl82dkr/",
              "text": "Someone got annoyed with you and you escalated to 100 by using a pretty bad insult for no reason. Also given that everyone got mad at you you probably were being annoying in the chat.",
              "author": "MaleficentDistrict22",
              "created": 1637302227,
              "upvotes": 1,
              "replies": {
                "hl84cjs": {
                  "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl84cjs/",
                  "text": "I don’t try to be annoying. I’m on the spectrum so I’m not great with social cues especially over text. If I was being annoying, I definitely wasn’t aware of it :/",
                  "author": "Castor346",
                  "created": 1637303533,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl9y774": {
      "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl9y774/",
      "text": "This depends on your school, look for their harrassment and bullying policy. \n\nYour unlikely to get more then told to stop being a cunt yourself, unless you continue to harass them. Most people recognize a one off argument, and it doesn't sound like you made a threat. Now if this is a pattern of behavior or you continue to be a cunt, then yeah no your going to get in shit. \n\nLeave the group chat or stfu for a while.\n\nGo to the school tutors. You pay for them.\n\nFind other communities like /r/getstudying for answers on how to get A's. \n\nStop asking for the secret and admit that you need to do work. \n\nStop immediately getting pissed when someone tells you your being annoying. Also it's a group chat, you literally can go put your phone down.\n\nStop monopolizing the group chat with complaining, especially if this is a casual group chat not like a school focused one. No one wants to hear constant complaining, especially when it sounds like you didn't take the advice last several times. \n\nSometimes people are cunts. But if everyone is being a cunt to you, your probably the cunt. I recognize social skills are hard, but dude your acting like a child.",
      "author": "adhdeedee",
      "created": 1637341838,
      "upvotes": 1,
      "replies": {
        "hlagu6f": {
          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hlagu6f/",
          "text": "Well, I do study and use resources. That’s why I asked what I asked. Doesn’t really make sense that I’m doing everything right and not getting good grades. I wasn’t trying to be annoying.",
          "author": "Castor346",
          "created": 1637348899,
          "upvotes": 1,
          "replies": {
            "hlaisip": {
              "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hlaisip/",
              "text": "It doesn't matter if you weren't trying to annoying, sadly. People got annoyed. You apologize, dissect why, and try again later.\n\nI get it, it sucks. It's frustrating. And dear god are NTs annoying, but people don't care what you meant. \n\nIn this case the why seems to be interrupting, not listening and applying previous advice, or asking too much. Probably would have been better to ask and segue to a one on one chat with whoever was willing to help. \n\nAlso if you don't know why (I get it, college is hard) try office hours and ask what particular things your struggling with. A lot of times it's not obvious that your choices in sources, writing style, grammar, not writing in-between steps for math and science, using pencil in lab notebook or whatever is causing marks to go down. \n\nDon't challenge the professor, just be like I have gotten lower grades then I would like on these assignments, I'd like to know what I can do to improve in the future. Bring the assignments btw. Try to suss out the reasons. \n\nIf it's wrong answer in math, you probably need to restudy the steps. You might be struggling with a primary one. If it's wrong answers on like, multiple choice only one true answer things, you might need to up your spaced repetition studying. If it's English, you probably need to improve the formatting and grammar.\n\nIf it's stress in exams or distraction Steve is chewing gum the entire fucking exam again, you might need to go to disability services and take exams in a private room instead.",
              "author": "adhdeedee",
              "created": 1637349606,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hl6b5nr": {
      "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl6b5nr/",
      "text": "Lol. It's college, you should be able ti say whatever you want outside of class.\n\nIf she really tries to report you nothing much will come from it. Either nothing at all or a \"talking to\" in order to make that cunt happy",
      "author": "WhatTheBruh694206942",
      "created": 1637272314,
      "upvotes": -1,
      "replies": {
        "hl7dx2f": {
          "link": "/r/college/comments/qwvonl/will_anything_actually_happen_if_im_reported_to/hl7dx2f/",
          "text": "Yeah she literally said “don’t mind me I’m gonna be a Karen and send these screenshots to the dean 🤪” like girl really thought she did something lol.",
          "author": "Castor346",
          "created": 1637289568,
          "upvotes": 0,
          "replies": {}
        }
      }
    }
  }
}