{
  "sid": "bd96qy",
  "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/",
  "title:": "Professor lowered my grade from a C to an F after the semester ended",
  "text": "As the title says. I took a Financial Literacy course last semester and completed it with a 76. That was the number on my transcript when the semester was fully over (finals were graded and entered). I checked my transcript again today, more than halfway into the next semester, and found that my grade for the course was now a big fat F. I asked the professor why they would go back and change it and they claimed that \"they didn't feel I knew the material well enough.\" Is there anything I can do about this? Should I bring it up with the dean?",
  "author": "Uplision",
  "created": 1555284953,
  "over_18": false,
  "upvotes": 736,
  "upvote_ratio": 0.99,
  "comments": {
    "ekyexv2": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekyexv2/",
      "text": "Haha yeah that's not gonna stick. You're probably not the only person this happened to. The school will fix it. They don't want Fs either.",
      "author": "ikilledtupac",
      "created": 1555349866,
      "upvotes": 2,
      "replies": {}
    },
    "ekyd7a4": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekyd7a4/",
      "text": "The syllabus constitutes a contract between you and the instructor. If you can prove to the department chair that you did receive a 76 and the syllabus says a 76 corresponds to a 'C,' they should advocate for you to get your grade changed. Put it in an email with the syllabus attached and screenshots of your grades. Put a brief, unemotional, polite, nice but firm couple of paragraphs that sum up the situation.",
      "author": "jonblaze32",
      "created": 1555348803,
      "upvotes": 2,
      "replies": {}
    },
    "eky5vp8": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/eky5vp8/",
      "text": "Report to school ASAP.\n\n&#x200B;\n\nNot sure what else I can say, but WTF man.",
      "author": "Demosama",
      "created": 1555344222,
      "upvotes": 2,
      "replies": {}
    },
    "eky2ij5": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/eky2ij5/",
      "text": "This also happened to me.  My Econ 102 prof gave me an F, even though I had a 71 overall in the class.  This prof was a super \"by-the-numbers\" guy.  Like, would give you a 80.7% on homework assignments.  He explicitly stated in the syllabus that 70.0 through 79.9 would receive a C as a final grade.  \n\nI went to him after grades posted and gave him the math that I calculated to receive a C.  He even agreed, but said that he felt that too many students scored \"too low\" and that he failed those in \"that category\" (undefined).  \n\nI went to the Econ Chair and after a few interactions, I had the grade changed to a C.  Like many have suggested in the thread,  and considering my case, I'd go above his head.  Good luck,",
      "author": "denytheembargo",
      "created": 1555342045,
      "upvotes": 11,
      "replies": {}
    },
    "ekxy7ao": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekxy7ao/",
      "text": "Are you sure the 76 was the *weighted* average?\n\nI think just because it’s on blackboard / wherever, it doesn’t mean it’s weighted, if the professor didn’t set it up to be. \n\nI would do the math yourself just to make sure, if you can.",
      "author": "PianoConcertoNo2",
      "created": 1555339073,
      "upvotes": 3,
      "replies": {}
    },
    "ekxsckc": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekxsckc/",
      "text": "You could definitely do a final grade appeal on that.",
      "author": "patmorgan235",
      "created": 1555334511,
      "upvotes": 1,
      "replies": {}
    },
    "ekxiy2l": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekxiy2l/",
      "text": "Ok first off there is always a chain of command (sorry I used to be in the army) or in this instance a chain of authority.  Start of by going to the head of the department then go from there if they do not assist, but never accept that F, and here is why. \n\nA professor is not supposed to change a grade after the fact, there is a reason even THEY have a deadline to have grades in.  So that they can’t go in later and change them for things like, personal reasons, like if they get a bad review from a class and they perceived that it came from a certain student. There are checks and balances to both protect not just the professors but students as well, so that you can feel safe to report bad professors. \n\nThen that brings us to this point, a CLEAR violation of school policies, changing a grade after the fact. You have the proof. So bring the actual proof of the before and after to the head of the department and explain the situation, as unbiased as possible. If they do not assist, go to the next in line in the chain.  But never go straight to the top.   Remember, everyone is human, and we are all flawed and make mistakes. Maybe there is something going on? Idk, but that’s your job to figure it out since it is your grade on the line. Good luck 👍",
      "author": "Plain_Jaine",
      "created": 1555323570,
      "upvotes": 8,
      "replies": {}
    },
    "ekx2cb6": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekx2cb6/",
      "text": "Did you sleep with his wife or something? Jeez that's totally unwarranted on his part for any reason.",
      "author": null,
      "created": 1555299819,
      "upvotes": 25,
      "replies": {}
    },
    "ekx2998": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekx2998/",
      "text": "Look in the university handbook there maybe actual rules against this. I know at my university professors can't change grades after theyve been posted for 2 weeks without a \"trial\".",
      "author": "freshmanstruggle",
      "created": 1555299742,
      "upvotes": 14,
      "replies": {}
    },
    "ekwxmah": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwxmah/",
      "text": "Absolutely escalate it.  That is not a valid reason at all.\n\nSource: I'm a college program coordinator and would give any of my students the same instruction (and provide them with appeal instructions).",
      "author": "i_yac",
      "created": 1555295823,
      "upvotes": 65,
      "replies": {}
    },
    "ekwxid4": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwxid4/",
      "text": "Check the Syllabus first!\n\nShow the Dean what grade percentage your professor said a 76% should roughly correlate to.\n\nAlso, at my school, the professor can lower grade standards but cannot increase them.\n\nSo in both a super hard and easy course, a 75 must at least be a C. See if you have something similar.",
      "author": "Burritoassasain",
      "created": 1555295740,
      "upvotes": 35,
      "replies": {}
    },
    "ekwvrgy": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwvrgy/",
      "text": "Definitely go to the DEAN! That is utter bullshit!",
      "author": "SpicyHashbrowns",
      "created": 1555294403,
      "upvotes": 0,
      "replies": {}
    },
    "ekwtbd0": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwtbd0/",
      "text": "absolutely go to the dean",
      "author": "Ffom",
      "created": 1555292425,
      "upvotes": 4,
      "replies": {}
    },
    "ekws4oa": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekws4oa/",
      "text": "Most colleges have internal grading regulations that prohibit \"arbitrary and capricious\" grading. If what you're saying is accurate, then it plainly violates that standard, so you should appeal to the next highest-person (typically, the chair of the department).",
      "author": null,
      "created": 1555291353,
      "upvotes": 201,
      "replies": {}
    },
    "ekwnafm": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwnafm/",
      "text": "Same thing happened to me. If you dont think the professor will negotiate with you then get all documentation of talking with that professor and screenshot all of your grades if possible to prove that you mathematically deserve the grade. Bring that to whoever is the higher up at your school and speak to your advisers about the best plan of action.",
      "author": "coffeecomp",
      "created": 1555287206,
      "upvotes": 91,
      "replies": {}
    },
    "ekwmtb0": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwmtb0/",
      "text": "The next line up is the chair, not the dean. Only go to the dean if the chair is unwilling to listen to you.",
      "author": null,
      "created": 1555286810,
      "upvotes": 710,
      "replies": {
        "ekwnmak": {
          "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwnmak/",
          "text": "[deleted]",
          "author": null,
          "created": 1555287478,
          "upvotes": 177,
          "replies": {
            "ekwtugk": {
              "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwtugk/",
              "text": "It tends to go something to the effect of Professor < Department Chair < Dean.  Your mileage may vary.\n\n/u/HallowedNight's advice, in the governmental context, would be akin to saying, \"don't go to the President before checking with the relevant Cabinet secretary, first.\"",
              "author": "jreed11",
              "created": 1555292903,
              "upvotes": 191,
              "replies": {
                "ekwvbyc": {
                  "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwvbyc/",
                  "text": "I don't understand how this is so difficult to grasp in this sub, but every post is full of people telling OP to march straight into the dean's office.",
                  "author": "Inactive_Account",
                  "created": 1555294089,
                  "upvotes": 70,
                  "replies": {
                    "ekxbejm": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekxbejm/",
                      "text": "My college has zero chairs and tons of deans. So, indeed the correct next step is the dean. \n\nThe only universally correct advice is to determine and follow the correct order of steps at your own particular school.",
                      "author": "Violet_Plum_Tea",
                      "created": 1555310229,
                      "upvotes": 39,
                      "replies": {}
                    },
                    "ekwwanx": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwwanx/",
                      "text": "Ummm, maybe people don't know?",
                      "author": "totally80s",
                      "created": 1555294815,
                      "upvotes": 53,
                      "replies": {
                        "ekwxnke": {
                          "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwxnke/",
                          "text": "You're in college, you're expected to be able to figure basic shit like this out.\n\nI know admissions standards have declined in recent years, but jesus christ.\n\nIt's like if you have a problem at work... who are you going to go to, your manager or the president of the company?  Hint: the president doesn't give two shits about your problem.",
                          "author": "wolf2600",
                          "created": 1555295851,
                          "upvotes": -71,
                          "replies": {
                            "ekx94aq": {
                              "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekx94aq/",
                              "text": "Or, yknow, nobody ever discusses this shit.\n\nI didn't know departments had chairs until my professor became the chair of my department. Nobody ever said \"hey, by the way if you have issues, talk to this person! Don't bother the dean.\" It was just \"don't bother the dean.\"\n\nNot *once* did I learn from my university of where to go if I had issues. So when I attempted to solve them, and tried to go to the appropriate department to do so, I was talked down to (in a similar fashion to how your comment is). Sent on my way with a nasty \"this isn't the place.\" Well, sorry, I didn't know. I attempted to research it but all sources led to your department.\n\nYknow what you're also expected of in college? To treat your peers, students, professors, everybody with professional respect. And yet, some people just can't figure that out.",
                              "author": "SammieLily2",
                              "created": 1555307057,
                              "upvotes": 49,
                              "replies": {}
                            },
                            "ekx9yxt": {
                              "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekx9yxt/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1555308181,
                              "upvotes": 22,
                              "replies": {
                                "ekz8d73": {
                                  "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekz8d73/",
                                  "text": "Professor here: Not who you were replying to, but it is true that on the national level in the United States many schools have been lowering entrance standards. During the recession more people went to school, and when the economy improved those students dried up. Couple that with low birth rates across the country at the end of the 90's during the tech boom, and we are all competing for a smaller groups of students than we did 10 years ago (this has been teaches with high school graduation numbers). The solution to make up the gap in enrollment is to decrease standards so more people can get in. At my University, we have started admitting more students on a provisional basis who had lower than 18 on the ACT. They generally don't make it past their first term.",
                                  "author": null,
                                  "created": 1555369640,
                                  "upvotes": 3,
                                  "replies": {
                                    "ekz8kxv": {
                                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekz8kxv/",
                                      "text": "I was mostly speaking anecdotally. The school I applied to in 2016 had an admissions rate of 32, and now is at 18%. A similar trend is going on at many other top universities, particularly the ivies. Maybe the national trend is different.",
                                      "author": "MaiqTheLiarr",
                                      "created": 1555369794,
                                      "upvotes": 1,
                                      "replies": {
                                        "ekz8qgb": {
                                          "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekz8qgb/",
                                          "text": "Yes, top schools are always very selective, but they are very far from the national trend, and they represent a very small percent of all college students.",
                                          "author": null,
                                          "created": 1555369902,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "el0gybg": {
                                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/el0gybg/",
                                      "text": "Also professor here, and I cannot understand the low quality of students we're getting at a decently ranked R2. Of course, we went test-optional a few years back. And let's not forget the non-English speaking Chinese students who are the only reason we can keep the lights on.",
                                      "author": "bl1y",
                                      "created": 1555415951,
                                      "upvotes": 1,
                                      "replies": {
                                        "el0j9sg": {
                                          "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/el0j9sg/",
                                          "text": "It's pretty much everywhere. We're legit scraping the bottom of the barrel trying to get enough students (and have also been looking the international route as they pay higher tuition). It's unethical, IMO, to let someone in that stands almost no chance of success, knowing many will take out student loans to do so. Then again, I was literally told yesterday on /r/professors that I'm someone that is in favor of denying education to people, so... maybe THAT'S the issue.",
                                          "author": null,
                                          "created": 1555418307,
                                          "upvotes": 1,
                                          "replies": {
                                            "el0ym28": {
                                              "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/el0ym28/",
                                              "text": "Not denying education to anyone. Professors are free to donate their time if they care so much. It's denying TT faculty and admins the right to student loan dollars.\n\nOh, wait, scratch that. You're saying you want standards? Well all I'm hearing you say is you want to go back to Jim Crow.\n\n...God, I wish I only ever heard that argument sarcastically.",
                                              "author": "bl1y",
                                              "created": 1555429421,
                                              "upvotes": 2,
                                              "replies": {
                                                "el1fkxa": {
                                                  "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/el1fkxa/",
                                                  "text": "And you know what? I think it's good to let people with low standards into college. Community college. From there, they can go to a University of they can make it through. Unfortunately, our administration thinks students with a 15 ACT can major in anything successfully. Our \"easiest\" majors on campus are impossible for those students.",
                                                  "author": null,
                                                  "created": 1555439615,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "eky8oqj": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/eky8oqj/",
                      "text": "People like to escalate conflict as quick as possible. Reminded me of those kids during school who would rather go straight to the principal for a minor conflict instead of just telling the teacher right behind them. Now they’re in college and they go straight to the dean instead of at least talking to the department chair first. Like that’s just gonna make ennemies and you don’t exactly want professors and the like to be against you.",
                      "author": null,
                      "created": 1555346025,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "ekx8z2s": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekx8z2s/",
                      "text": "Could be from previous experience of the chair not helping the people commenting so their only option is to go straight to the dean",
                      "author": "funandgames73892",
                      "created": 1555306875,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "eky7c7g": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/eky7c7g/",
                      "text": "It's akin to speaking with the owner or CEO of a business over something that can be handled at a junior management level.",
                      "author": null,
                      "created": 1555345159,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "ekyj9lj": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekyj9lj/",
                      "text": "Part of it is also that high school hierarchy is teacher -> dean-> asst principal-> principal",
                      "author": "SoriAryl",
                      "created": 1555352507,
                      "upvotes": 1,
                      "replies": {
                        "el0na60": {
                          "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/el0na60/",
                          "text": "Where does that happen? My high school did not have anyone called a dean.",
                          "author": "bl1y",
                          "created": 1555421667,
                          "upvotes": 1,
                          "replies": {
                            "el0owho": {
                              "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/el0owho/",
                              "text": "I went to high school in Las Vegas.",
                              "author": "SoriAryl",
                              "created": 1555422870,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "ekxz9fo": {
                  "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekxz9fo/",
                  "text": "Don't the department chair care more about their professors since they're their coworkers than students? (Honest question I'm curious)",
                  "author": "METEOS_IS_BACK",
                  "created": 1555339821,
                  "upvotes": 2,
                  "replies": {
                    "el0nday": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/el0nday/",
                      "text": "Yes, but they're also the professor's direct supervisor.\n\nIf you jump over the chair's head to talk to the dean, all the dean's going to say to the department chair is to handle stuff internally better so they don't have to deal with damn wiener kid complaints.",
                      "author": "bl1y",
                      "created": 1555421733,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "eky05mu": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/eky05mu/",
                      "text": "Possibly, but the dean doesn't give a fuck about what grade you're (not) getting in shakespeare-300 or whatever it is you're taking haha.",
                      "author": "jreed11",
                      "created": 1555340442,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ekwxron": {
              "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwxron/",
              "text": "Prof --> Chair/Department Head --> Dean of the College the department is in --> Provost/VP student affairs.\n\nThere isn't anyone higher to go to really, as the president at universities is there for the running of the university (keeping the lights on, etc...), not the academic side. That's the provost's job.",
              "author": null,
              "created": 1555295939,
              "upvotes": 37,
              "replies": {
                "ekwznnb": {
                  "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwznnb/",
                  "text": "Another option is the Student Ombuds!",
                  "author": "lacrimosa122",
                  "created": 1555297486,
                  "upvotes": 6,
                  "replies": {
                    "ekx05co": {
                      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekx05co/",
                      "text": "That's usually a last ditch effort, and not all schools have them.",
                      "author": null,
                      "created": 1555297898,
                      "upvotes": 5,
                      "replies": {
                        "ekx0bt7": {
                          "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekx0bt7/",
                          "text": "Many schools do. I'd say if OP's college has them, he/she should go there first and see if they can get advice on how to proceed. And then escalate the matter based on the advice they get.",
                          "author": "lacrimosa122",
                          "created": 1555298050,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ekwwf7d": {
          "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwwf7d/",
          "text": "> The next line up is the chair, not the dean.\n\nThis is correct, at least in the US. I'm a department chair, and if a student went to our dean with basically any issue the first thing they'd get back was \"Did you talk to the department chair?\" If not, they'd be told to do so.\n\nDealing with student/faculty issues is the job of the department chair. In my university that's pretty much where things end too...one can \"appeal\" to a dean but I've never heard of one overruling a department chair. However, as a chair I have in fact overruled my faculty on multiple occasions.",
          "author": "SnowblindAlbino",
          "created": 1555294911,
          "upvotes": 25,
          "replies": {}
        },
        "ekyoffi": {
          "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekyoffi/",
          "text": "Check with whatever school you're in. Many schools don't have chairs. In mine, my department had no chair and was temporarily Dean-less so I wound up going directly to the provost.",
          "author": "muranternet",
          "created": 1555355624,
          "upvotes": 1,
          "replies": {
            "ekz47qp": {
              "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekz47qp/",
              "text": "I'm a professor, I wouldn't say \"many\". It would be an exception for most, and usually only during transition times in campus administration.",
              "author": null,
              "created": 1555366835,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ekwkwzw": {
      "link": "/r/college/comments/bd96qy/professor_lowered_my_grade_from_a_c_to_an_f_after/ekwkwzw/",
      "text": "Absolutely bring it up with the dean, and keep all of your communications with this professor to email from now on. That way you’ll have written proof of what he/she says, and if the professor refutes what was said about your original grade to the dean, you can refute it.",
      "author": null,
      "created": 1555285206,
      "upvotes": 216,
      "replies": {}
    }
  },
  "updated": 1634056609
}