{
  "sid": "ramfft",
  "link": "/r/college/comments/ramfft/is_college_actually_worth_it/",
  "title:": "Is college actually worth it?",
  "text": "Is College Actually Worth it?\n\nFor Context, im a 19 yr old homeschooled dude working to get their G.E.D living with their moms currently \n\nIm doing research on college and most importantly my future \n\nand the more I google the more off putting i find college to be \n\nA lot of young adults working their asses off for their degrees, getting a lack of sleep due to assignments given, like, it seems like REALLY hard stuff, mental health issues, and more horrifying enough, COLLEGE DEBT\n\nI don’t want to burden my family \nwith debt because I’m being indecisive \n\nand college debt is still on my mom like a leper to this day \n\nWe’re broke af and I’ve never worked a job in my life due to a very loving but also very protective mother but i also want to move out eventually  (that’s a whole other can of worms entirely)\n\nCollege doesn’t look fun from an outsiders perspective \n\nBut in during my research I’ve also seen people who’ve said the experience alone was more than worth it and that college is where it’s at even if they didn’t get their degree or graduated\n\nMixed stuff\n\nSo if a college degree is something i know im gonna have to work my ass off to get to a seemingly insane degree\n\nIs it worth it in the end?\n\nI remember someone saying\n\n“College isn’t the end but rather the beginning. To open a way for better opportunities in the future” (paraphrasing)\n\nSo yeah that’s about it my dudes😊\n\nComing to grips with getting my shit together n adulting and stuff\n\nEdited: spelling",
  "author": "Social_Confusion",
  "created": 1638838028,
  "updated": 1639517747,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hnj9epp": {
      "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnj9epp/",
      "text": "No one wanta to go to college because its college. People go to college because their careers often demand a degree in a specific major. Without a college degree, there are still career options, and you can even learn the concepts found at college, but the piece of paper is a formal acknowledgement the candidate was taught in X criteria and was proficient enough to pass class.\n\nWhile College financials can be hard, it is also the #1 way to better your living situation in the US. To pursue a degree, loans are always a last resort. Your state may offer post secondary programs for household meeting specific criteria.\n\nSo to answer your question, yes. College is almost always worth it, but there may be other options that better suit you. Do you have any ambitions for a specific career? Any interests in fields of study?",
      "author": "AHumbleLibertarian",
      "created": 1638839566,
      "upvotes": 4,
      "replies": {
        "hnjc4ux": {
          "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnjc4ux/",
          "text": "Thank you fpr spending the time to answer my question\n\nThis helps alot",
          "author": "Social_Confusion",
          "created": 1638840768,
          "upvotes": 2,
          "replies": {}
        },
        "hnjgn94": {
          "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnjgn94/",
          "text": "Plenty of people go to college because it is college. Since Renaissance Humanism until around the 1850s, college-for-college's-sake was basically the only reason to go to college. This college-as-a-path-to-career ideal developed around the 1850s, but only became a common way of thinking much more recently.",
          "author": "DrAlawyn",
          "created": 1638842690,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnk8wdb": {
      "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnk8wdb/",
      "text": "Look into how community college would work with your financials. At the very least, it will be beneficial for you to earn an associate's degree, and that will give you the potential option of transferring to a four-year university later on to earn your bachelor's degree. My local community college is pretty cheap to begin with, and that's not including scholarships, many of which are relatively easy to get. Definitely something to look in to.",
      "author": "SaggiSponge",
      "created": 1638856316,
      "upvotes": 3,
      "replies": {}
    },
    "hnj8ovd": {
      "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnj8ovd/",
      "text": "It depends on what you wanna do in the future, for some jobs you’ll need at least a Bachelor and others will ask for a Masters even, but it really depends. I would start by first searching what you wanna do in the future, what skills you have or would like to develop and after you find out what you wanna do, then start worrying about college debt and stuff. \n\nFor most people it is worth it, like Engineers and Doctors, but not everyone wants or has to be an Engineer or a Doctor. Sadly, College in the US is unnecessarily expensive and I’m sorry about that, but if you end up decide heading into College, apply for as much scholarships as you can and also FAFSA. \n\nI agree that dealing with hundreds assignments and time management can be hard, but it really makes you grow as a person and can be super enlightening, you just gotta put effort into it. \n\nIf you have any more questions feel free to ask me, I’m glad to help!",
      "author": "MMSK_",
      "created": 1638839239,
      "upvotes": 1,
      "replies": {
        "hnjbiua": {
          "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnjbiua/",
          "text": "Thanks, still haven’t decided what career to pursue\n\nBut after alot of pondering I realized i want to pursue a career somewhere in music\n\nEither making money being a saxophonist or a music composer\n\nBut definitely somewhere in music",
          "author": "Social_Confusion",
          "created": 1638840503,
          "upvotes": 1,
          "replies": {
            "hnlctv7": {
              "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnlctv7/",
              "text": "As someone else said, a degree in music is something really delicate. I'm not a Music major myself, so I totally suggest you getting in touch with Music majors/graduates and see what they are up to. The music industry is mostly about luck and connections, no matter how talented you are. \n\nWorst case scenario, keep music as a hobby and major in something else.",
              "author": "MMSK_",
              "created": 1638885166,
              "upvotes": 2,
              "replies": {}
            },
            "hnjn0hf": {
              "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnjn0hf/",
              "text": "\"somewhere in music\" \n\n\nLmao don't get a music degree its a useless waste of money and you would be at the same position you're in now except under debt",
              "author": "elkfn2",
              "created": 1638845437,
              "upvotes": 1,
              "replies": {
                "hnjq0jq": {
                  "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnjq0jq/",
                  "text": "Thanks for the warning\n\nGonna do some more research because of this\n\nEveryone has been extremely helpful",
                  "author": "Social_Confusion",
                  "created": 1638846752,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnjfump": {
      "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnjfump/",
      "text": "I was a homeschooled kid too who took the GED and then went to college (although I was a couple years younger than you are), and I understand your worries.\n\nIs college worth it? That depends on you. Primarily see college as a path to a good-paying job? Plumbers can get paid more than many college graduates. For some, dependent not only on personality but also on their major and what college they go to, they do a lot of work for their degree. That being said, many do not. I went to a fairly competitive college, and never once did I or anyone I know complain about a lack of sleep due to the number of assignments given. They complained about sleep because they did other things, but not purely due to assignments.\n\nCollege can be expensive, but it isn't always expensive. Community colleges are really cheap, FASFA provides some funding for low-income students. My community college was so cheap, not only did FASFA give me enough money to pay for it, I had extra money left over! Debt is awful though, and with college costs so insane in the USA, you are right to be wary of it.\n\nPersonally, I adored college. Did I get a great paying job? No, but I didn't go to college to get a job: I went to college to learn. Through college, I learned more about the world than I would have learned through decades of self-study. It opened my eyes to so many things. Even esoteric curiosities became fascinating and relevant. No, quantum mechanics, nuclear weapon policies, or the history of Ptolemaic Egypt isn't useful for any job, but I loved learning about it all anyways.\n\nAs is becoming increasingly common, many people view college purely in terms of getting a job. If this is your ultimate goal, for most degrees you won't be paid more than an electrician or plumber. Sure, engineers, cyber security, and programmers are in demand, but not every engineering major gets a good-paying job. And yes, genius or even top-20% engineering majors may find it easy to get a high-paying job, but what about the rest of their cohort? If you purely are going to college for a high-paying job, you better either love that job even if you won't get paid much or be insanely confident in yourself.\n\nIs college worth it? That depends on you. What are you career plans or do you have a subject that is especially interesting to you?",
      "author": "DrAlawyn",
      "created": 1638842342,
      "upvotes": 1,
      "replies": {
        "hnjgrsy": {
          "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnjgrsy/",
          "text": "Thank you, i just decided i wanted to get a degree in music (not sure what tho still narrowing down from there) \n\nThis was extremely helpful, thank you",
          "author": "Social_Confusion",
          "created": 1638842744,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnk0l0p": {
      "link": "/r/college/comments/ramfft/is_college_actually_worth_it/hnk0l0p/",
      "text": "Stress wise, no, financially yes",
      "author": "SadAcadia2747",
      "created": 1638851626,
      "upvotes": 1,
      "replies": {}
    }
  }
}