{
  "sid": "rcsung",
  "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/",
  "title:": "Incomplete grade for being too sick to come to finals?",
  "text": "I have been to all of my classes basically everyday. It is now finals week and I have come down with a sickness where I was recommended by my doctor to go to the emergency room. I spoke to the dean as well as my professors and they said I might get an incomplete grade. They explained it to me but I didn't quite understand. Did I just fail 3 classes because I couldn't make their finals?",
  "author": "UndeadKi11er",
  "created": 1639088387,
  "updated": 1639516731,
  "over_18": false,
  "upvotes": 18,
  "upvote_ratio": 0.91,
  "comments": {
    "hnwqwyq": {
      "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnwqwyq/",
      "text": "That’s not what an incomplete means. An incomplete means you don’t get a final grade in the course just yet; you arrange with each professor what you will need to do to finish after the semester ends, at which time your final grade is determined.",
      "author": "PhDapper",
      "created": 1639088548,
      "upvotes": 36,
      "replies": {
        "hnwr394": {
          "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnwr394/",
          "text": "My professors keep saying they need to get their grades in and one of them literally extended my final till tomorrow. What should I say",
          "author": "UndeadKi11er",
          "created": 1639088622,
          "upvotes": 3,
          "replies": {
            "hnwr8q9": {
              "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnwr8q9/",
              "text": "There’s a formal process for getting incompletes. Our university handles that through the Dean of Students. I’d start there.",
              "author": "PhDapper",
              "created": 1639088686,
              "upvotes": 13,
              "replies": {
                "hnwrdtj": {
                  "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnwrdtj/",
                  "text": "I already did. She added all my professors to the email and had a pdf for filling out an incomplete grade.",
                  "author": "UndeadKi11er",
                  "created": 1639088745,
                  "upvotes": 2,
                  "replies": {
                    "hnwrpq0": {
                      "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnwrpq0/",
                      "text": "I’m not sure, then. Incompletes can be anywhere from a week or two to a few months. What have you said or asked about scheduling the finals?",
                      "author": "PhDapper",
                      "created": 1639088883,
                      "upvotes": 3,
                      "replies": {
                        "hnws699": {
                          "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnws699/",
                          "text": "I asked if they could give me an extra extension even to just next week. But they said the semester will be over by then. But my one professor just emailed me now and said he's giving me an incomplete but allowing me to take it as soon as classes begin again. So I've asked my other ones if they would do the same.",
                          "author": "UndeadKi11er",
                          "created": 1639089071,
                          "upvotes": 1,
                          "replies": {
                            "hnx4y0c": {
                              "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnx4y0c/",
                              "text": "I wonder if this was a miscommunication with vocabulary. Did you ask for an \"extension\" or an \"incomplete?\" Maybe they didn't realize what you were asking for in the rush of finals week, and maybe they didn't see a communication from the dean of students yet? \n\nI would send one more communication asking for an incomplete specifically and explain you are working with the dean of students. If that doesn't go anywhere, go back to the dean and explain that the instructor is being uncooperative (but be professional in that complaint, of course).",
                              "author": "mizboring",
                              "created": 1639094553,
                              "upvotes": 4,
                              "replies": {
                                "hnxc5ry": {
                                  "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnxc5ry/",
                                  "text": "Yeah, \"extension\" and \"incomplete\" mean very different things. I had to give a student an incomplete because they were sick and missed the final exam and there was no time to grant an extension because course grades were due the next day. Student made up the exam a few days later, and we do the paperwork through the registrar to change their incomplete to a regular letter grade.",
                                  "author": "puzzlealbatross",
                                  "created": 1639097815,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnwsh6f": {
      "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnwsh6f/",
      "text": "No -- an incomplete is for a situation where you did most of the work but got hit with something at the last minute that meant you couldn't finish on schedule. You'll have to arrange with the school/professor to take the finals you missed sometime after break and based on how you do that grade combined with all the work you completed before you got sick will replace the I.\n\nIf you don't finish the classes on the universities timeline (often about a semester) the incomplete may revert to a failing grade, but that shouldn't be a problem if you take the finals once you feel better.",
      "author": "Melodic_Echidna",
      "created": 1639089198,
      "upvotes": 9,
      "replies": {
        "hnwtgpe": {
          "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnwtgpe/",
          "text": "Okay thank you!",
          "author": "UndeadKi11er",
          "created": 1639089617,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnyk7w3": {
      "link": "/r/college/comments/rcsung/incomplete_grade_for_being_too_sick_to_come_to/hnyk7w3/",
      "text": "I’ve been sick all week and I just tested positive for covid today and will miss 2 out of my 4 finals. Thus I will be getting an incomplete in 2/4 classes until I take the makeup final in January, just before classes start again. I assume you will have a similar arrangement, though I could be wrong.",
      "author": "cigarettedaydreams27",
      "created": 1639119531,
      "upvotes": 1,
      "replies": {}
    }
  }
}