{
  "sid": "rgvuf4",
  "link": "/r/college/comments/rgvuf4/how_to_move_on_from_past_regrets/",
  "title:": "How to move on from past regrets?",
  "text": "There was a situation back in high school.\n\nSome asshole pulled a humiliated prank on me junior year.\n\nI retaliated by slandering him online senior year.\n\nI wish I slandered him earlier. But for some reason, I never picked up on him being mean to me back in my junior year of high school.\n\nI slandered him only after some time. I didn't do it right away. Why?",
  "author": "snoogle999",
  "created": 1639563003,
  "updated": 1639787915,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "homzath": {
      "link": "/r/college/comments/rgvuf4/how_to_move_on_from_past_regrets/homzath/",
      "text": "There’s no way to change the past.\n\nSomeone in the world regrets smoking their first cigarette because now they can’t stop. But at the time, it made sense, because they just wanted to share a moment with their closest friends. Someone else regrets not being a better son because their parents died suddenly. But at the time, rebelling made sense because those parents’ expectations were suffocating them.\n\nYour actions made sense because you decided to take your time to understand the hurt he put you through, and decide on the right way to make him feel the same way.\n\nIn some parallel universe, you process your emotions faster and retaliate earlier. Maybe he stops picking on you. Maybe everyone else understands you a bit better and everything is resolved peacefully.\n\nOr maybe literally nothing changes. Maybe you mess up, get caught, and the school decides to expel you.\n\nYou can’t know the consequences of fixing a regret. The worst thing you can do is wallow in self-pity because you think things might have turned out better. Then the regret becomes wasting all those years dwelling on the past before you decided to fix yourself.\n\nThings can get better right now. The smoker can devote the rest of his life to quit smoking. The son can start working on his other relationships and hope to eventually be a good dad.\n\nAnd you can try to dig yourself out of whatever hole you’re in and give people a reason to respect you. What’s it going to be?",
      "author": "Slow-Manufacturer-55",
      "created": 1639572328,
      "upvotes": 2,
      "replies": {}
    }
  }
}