{
  "sid": "qm6v3t",
  "link": "/r/college/comments/qm6v3t/i_really_dont_want_to_go_to_my_graduation/",
  "title:": "I really don’t want to go to my graduation…",
  "text": "I graduate in December, and I just got all the forms to buy my cap and gown and stuff and just…really don’t want to go. I was at home for so long because of covid and then went back for only my final semester and it’s 50/50 online and in person. I don’t know anybody anymore, and I don’t want to go. It sucks seeing as I worked for 3.5 years now and paid so much money that now I just have no desire at all to celebrate that. That’s all",
  "author": "lfreeman6490",
  "created": 1635980896,
  "updated": 1636137438,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hj7w2kq": {
      "link": "/r/college/comments/qm6v3t/i_really_dont_want_to_go_to_my_graduation/hj7w2kq/",
      "text": "Then just collect the degree at your university in person",
      "author": "Impressive-Name5129",
      "created": 1635983869,
      "upvotes": 7,
      "replies": {}
    },
    "hj840gu": {
      "link": "/r/college/comments/qm6v3t/i_really_dont_want_to_go_to_my_graduation/hj840gu/",
      "text": "I don't know anyone who is going to be at my graduation in December. Everyone I went to highschool with that did uni either hated me and acted like highschool kids still or dropped out half way through. I may be a loner but I worked my ass off to finish my degree so I'm going with my head held high. Go to your graduation because you did the work, you deserve recognition, and even though you may not know anyone just go for yourself. And when you're there remember, you did it, you got through it despite set backs, you are proud of yourself and deserve to walk up there and collect that little piece of paper that proves you can do anything you set your mind to ❤️❤️",
      "author": "Wynonna99",
      "created": 1635987354,
      "upvotes": 2,
      "replies": {}
    }
  }
}