{
  "sid": "riekc7",
  "link": "/r/college/comments/riekc7/professor_gave_us_32_minutes_for_a_cumulative/",
  "title:": "Professor gave us 32 MINUTES for a cumulative business stats final",
  "text": "Before the final, I was at a 94% (A). Now, after taking the final, my best case scenerio is looking like a 78% (C+) or a C. The exam had 8 questions and was open note (on Zoom), but we only had 32 minutes. I could tell that most, if not all students needed a lot more time. I believe the time we were given was completely unfair. \n\nFor the previous tests he usually gave us 40 minutes but for only 4-5 questions and on only 3-4 chapters. \n\nIs there anything I can do about this? Should I speak to the dean or just take the L?",
  "author": "hmroue",
  "created": 1639736915,
  "updated": 1639787325,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 1.0,
  "comments": {
    "howstbz": {
      "link": "/r/college/comments/riekc7/professor_gave_us_32_minutes_for_a_cumulative/howstbz/",
      "text": "did he make it shorter to “test people” on how well they know the content because or the shorter time? Did anyone do well? Did he mention curving it? What was the average grade vs. average grade on the previous exams?",
      "author": "catlover12321",
      "created": 1639744754,
      "upvotes": 10,
      "replies": {}
    },
    "hoxuft6": {
      "link": "/r/college/comments/riekc7/professor_gave_us_32_minutes_for_a_cumulative/hoxuft6/",
      "text": "Was it in the syllabus?",
      "author": "wafflepancake5",
      "created": 1639760881,
      "upvotes": 3,
      "replies": {}
    },
    "hoxhlrn": {
      "link": "/r/college/comments/riekc7/professor_gave_us_32_minutes_for_a_cumulative/hoxhlrn/",
      "text": "That doesn't seem right, usually, final exams are around 1-2 hours. I don't know if your college allows the professors to set the exam time. To my knowledge, the higher-ups in the college are supposed to decide the duration time of the exam. Maybe you can bring the issue up with your department chair or dean?",
      "author": "ShyCoconut0_0",
      "created": 1639755996,
      "upvotes": 2,
      "replies": {}
    }
  }
}