{
  "sid": "qd35st",
  "link": "/r/college/comments/qd35st/how_to_make_friends_in_college/",
  "title:": "How to make friends in college?",
  "text": "I'm enrolled at a local university and commute to class every day. Everything is fine besides the fact I can't seem to actually make any friends. 2 of my old friends from highschool also go to the same university as me and back then I thought we'd all stick together since we've all been friends since 9th grade. They ended up completely ditching me at the beginning of the semester which really annoyed me. Since I first stepped on campus I'd talk to people in hopes of making new friends but all those people veered off into their own friend groups and never acknowledge me unless I say hi to them when they walk by me. \n\nIt just feels so lonely and I don't know what I'm doing wrong. It just hurts me emotionally when I see everyone in their groups and there's just me alone especially when it's my 2 old friends that ditched me in their new friend group posting at parties, hanging out together, etc. While I haven't really seen anyone since the beginning of August and spend all my nights alone in my room doing nothing. The only person I talk to consistently is my old friend who enrolled in the military a month ago and we talk every few weeks since he's at training. I've been trying to make new friends by joining a club and everything but it just hasn't worked out for me. Sorry if this sounds weird, im just looking for tips to hopefully make new friends soon.",
  "author": "dimaskeleton",
  "created": 1634855616,
  "updated": 1635184786,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhjwczm": {
      "link": "/r/college/comments/qd35st/how_to_make_friends_in_college/hhjwczm/",
      "text": "Join clubs in your college, you get to meet people and they're already guaranteed to have at least one common interest with you so you can have something to talk about",
      "author": "cowfishAreReal",
      "created": 1634857790,
      "upvotes": 1,
      "replies": {}
    },
    "hhke1tc": {
      "link": "/r/college/comments/qd35st/how_to_make_friends_in_college/hhke1tc/",
      "text": "Unfortunately it’s sometimes very hard to make friends in college if you aren’t in the dorms your first year or into the party scene. There are definitely some other ways to get involved and meet people though! I know you said you joined a club, but I’d definitely look into more clubs that pique your interest - even the ones that sound silly. They can be a great way to connect. Also, if you’re comfortable, try to reach out to your peers in your classes. Even asking a question you already know, or complaining about work load can start up a conversation. Look for campus study groups or activities and events that your university puts on. Also, if you’d be open to it, a campus job could be a great way to connect. Most university’s offer flexible schedules and you’d have the time to talk to peers and earn some extra money. Volunteer opportunities on and off campus can also be a great way to connect to others.",
      "author": "Ok_Mycologist330",
      "created": 1634866119,
      "upvotes": 1,
      "replies": {
        "hhkfhlk": {
          "link": "/r/college/comments/qd35st/how_to_make_friends_in_college/hhkfhlk/",
          "text": "Will definitely take this and hopefully help me, thank you so much",
          "author": "dimaskeleton",
          "created": 1634866778,
          "upvotes": 1,
          "replies": {
            "hhkg8ok": {
              "link": "/r/college/comments/qd35st/how_to_make_friends_in_college/hhkg8ok/",
              "text": "Absolutely! I’ve definitely been there. Also, a suggestion for student orgs. It’s a bit late in the semester now, but toward the spring look for openings for Organization Board Members. If an org piques your interest, applying to be one of the board members can help to get active (and you always have to meet w the other members and talk with them)!",
              "author": "Ok_Mycologist330",
              "created": 1634867127,
              "upvotes": 2,
              "replies": {
                "hhkhbah": {
                  "link": "/r/college/comments/qd35st/how_to_make_friends_in_college/hhkhbah/",
                  "text": "Sounds good, never even knew that existed",
                  "author": "dimaskeleton",
                  "created": 1634867630,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}