{
  "sid": "qrzhsw",
  "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/",
  "title:": "Can someone please proofread this essay and give me some tips its for a game dev course thanks.",
  "text": " \n\n**This is the essay i will post what i have written in a link underneath.**\n\n\"what I want you to do is write me a review of a game you have played this year. \n\nI want you to discuss the following;\n\n\\-  The art style\n\n\\-  The game mechanics and functionality\n\n\\-  Level design\n\n\\-  Enemy design\n\n\\- The user interface\n\n\\- Progression \n\nI would then like you to compare the game against other similar games giving your opinion on which game you think is superior and why.\n\n**Valorant - Game Review**\n\nRiot games’ Valorant is now one of the top tier FPS games, the system implements elements of MMORPG, RPG, and FPS to provide players with a unique gaming experience. Players can choose from multiple weapons to arm themselves before they jump into battle against enemies both human and computer-controlled. Beyond that, Valorant also offers eventful PvP battles where many skill levels can participate for fun or competitively for “rank rating.”\n\n**The Game**\n\nIf you have played Counter Strike before, Valorant will be immediately familiar, teams take turns as either the Attackers or Defenders in a best of 25 Rounds. Attackers carry the “Spike” (a bomb) and attempt to plant it and hopefully defend it long enough to win the round. The defenders have to attempt to lock down the site, not allowing attackers to plant the spike or eliminate all 5 attacking heroes. Just like Counter Strike you will have to buy abilities and weapons between rounds with money earned during them.\n\n**Agents and Weapons**\n\nWhile overwatch-type abilities in an FPS game might sound odd, the time to kill in valorant stays extremely low with just 1 well-placed bullet can end the fight in an instant. Valorant balances the extraordinary ultimate abilities by making them cost points rather than a timer like one of its competitors, Overwatch. You gain these by dying, defusing spikes, collecting resource nodes off the ground or killing enemies. Although there are overpowered abilities in valorant, that's not to say the game doesn't require skill because as soon as you use them up you will need to refer back to 2 of the 17 guns in valorant to finish the fight. Each gun has its own unique recoil pattern, the Vandal for example will spray all over the place if you don’t learn to aim at the head for a one-shot kill or burst fire. Though there are simpler guns like the Judge shotgun which will easily shred enemies health.\n\n**Art and Music**\n\nValorants simple art style is specifically made for a fast paced FPS game, every visual cue is from a simple muzzle flash to an agent ultimate is instantly recognisable thanks to clearly designed art. So when a big red beam is firing towards you, you know sova is nearby. Even though Valorant opted for a more basic color pallet compared to some other modern games, a chaotic firefight won’t get muddled. Saying that, valorant still has some amazing effects and skins for weapons, this can be shown by a new collaboration with world famous DJ, ZEDD where they incorporated music created by him into the game with certain skins. This addition alone makes the game a lot more interesting and keeps things upbeat and not as boring as some other FPS games.\n\n**Comparisons with similar games**\n\nValorant is an FPS well-worth your time. The game does take cues from very similar game CSGO, but neither game can be proclaimed as the ultimate winner of the multiplayer FPS genre, from an unbiased standpoint. I have played both games for a few years and would say that Valorant is the much more fun and exciting game due to its RPG input within, with unique abilities coming with each agent and a more “cartoony” look which adds more character to the game. CSGO is a harder game but both games have upsides and downsides, you could say CSGOs movement is more complex but the concept of the game is easier to grasp as there’s only terrorists and counter-terrorists and no abilities, just a plain FPS game. Which is why in conclusion Valorant would be my choice.\n\n**Thanks**",
  "author": "Akido--",
  "created": 1636678277,
  "updated": 1637395776,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hka0wch": {
      "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hka0wch/",
      "text": "It’s a bit off boss man. Just by skimming it there are a ton of grammatical mistakes and some of the sentences are just weird and lack context. It’s quite verbose and you really are giving up a lot of information by trying to make the essay sound more intellectual or complex. You tend to give very general and vague statements and then kind of just leave them, not explaining further or going in depth on really anything. All in all, it’s verbose, vague, and riddled with grammar errors. Feel free to ask me if you are confused about anything I said and I’ll explain further because I know a lot about the subject and would be happy to help.",
      "author": "ActualSeven",
      "created": 1636681228,
      "upvotes": 2,
      "replies": {
        "hka341s": {
          "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hka341s/",
          "text": "I just wanted to add this is the first draft and wrote this in about 2 hours not very thought through but did need another pair of eyes on it.",
          "author": "Akido--",
          "created": 1636682252,
          "upvotes": 2,
          "replies": {
            "hka6wp9": {
              "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hka6wp9/",
              "text": "Make sure to delete this post before submitting or else it’ll get caught in the plagiarism software if the teacher uses it!",
              "author": "M33RHARIS",
              "created": 1636683990,
              "upvotes": 2,
              "replies": {
                "hka9lq6": {
                  "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hka9lq6/",
                  "text": "what do you mea.. ahhhh, im pretty sure he wont, ill give you a little more context he’s asked me to do this because i dong have any gcses and the course requires 5 with d+ for a level 2 and 5 with c+ for level 3 but from the interview we had he thinks ill do really good on the course so he’s asked me to do this to give him a better idea on what level i’m at and so on but thank you and i will just to be safe :)",
                  "author": "Akido--",
                  "created": 1636685222,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hka8ytq": {
              "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hka8ytq/",
              "text": "yeah no problem man",
              "author": "ActualSeven",
              "created": 1636684936,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hka25r1": {
          "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hka25r1/",
          "text": "I would appreciate the help greatly this is my first course in game development and don’t know much yet.",
          "author": "Akido--",
          "created": 1636681811,
          "upvotes": 1,
          "replies": {
            "hka8kuk": {
              "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hka8kuk/",
              "text": "I actually have no experience in game development lol, I've just played a lot of video games. The game development side of the essay isn't bad, the issues lie more on the English, grammar, and clarity.\n\n&#x200B;\n\nHere is your first sentence - \"Riot games’ Valorant is now one of the top tier FPS games, the system implements elements of MMORPG, RPG, and FPS to provide players with a unique gaming experience\"\n\nThis sentence doesn't flow well. Using your wording, I might change it to something like \n\nRiot games’ Valorant is currently one of the top FPS games on the market due to its unique gaming experience, achieved by implementing elements of MMORPG, RPG, and FPS style games into its design.\n\n&#x200B;\n\nAnother example - \"If you have played Counter Strike before, Valorant will be immediately familiar, teams take turns as either the Attackers or Defenders in a best of 25 Rounds.\"\n\nThere is a lot going on with this sentence. First of all, I would try to avoid using the word \"you,\" as it can easily be replaced and will make the sentence sound a lot better. The second thing here is that it's kind of misleading. You say that Valorant and CSGO are similar but then bring up an aspect in which they are different, the 13 vs 16 rounds off valorant and CSGO respectively. \n\n&#x200B;\n\nHere's how I might approach this sentence, again, using primarily your wording.\n\n\"Valorant will be immediately familiar to anyone who has experience with Counter Strike, as players in both games face off in five versus five competitive or casual battles in games of about 25 rounds.\"\n\nI don't want to do this for your whole essay as I think you should still be the one writing it, but I hope I've helped a bit in terms of helping you edit the rest. Again, let me know if you have any questions or need help with anything.",
              "author": "ActualSeven",
              "created": 1636684758,
              "upvotes": 2,
              "replies": {
                "hka9ysj": {
                  "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hka9ysj/",
                  "text": "I appreciate you helping me and taking time to do this and i see what you mean,  im only 16 and this is my first essay so i am a little nervous and made a lot of mistakes so thank you.",
                  "author": "Akido--",
                  "created": 1636685385,
                  "upvotes": 1,
                  "replies": {
                    "hkaoy2k": {
                      "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hkaoy2k/",
                      "text": "Why are u 16 in college lmao",
                      "author": "ActualSeven",
                      "created": 1636692695,
                      "upvotes": 1,
                      "replies": {
                        "hkbdwz4": {
                          "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hkbdwz4/",
                          "text": "i live in the uk",
                          "author": "Akido--",
                          "created": 1636711233,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "hko3mrn": {
                          "link": "/r/college/comments/qrzhsw/can_someone_please_proofread_this_essay_and_give/hko3mrn/",
                          "text": "ive just posted the updated and hopefully final version before i post it if you just wanted to see it :)",
                          "author": "Akido--",
                          "created": 1636942318,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}