{
  "sid": "qdgdme",
  "link": "/r/college/comments/qdgdme/master_thesis_abroad_goal_destination_usa/",
  "title:": "Master Thesis Abroad (goal destination: USA)",
  "text": "I didn't know what flair I should use so I chose 'global' considering the fact that I study in Europe, I have a Middle Eastern passport and my goal is to go to the US.\n\n*Background check:* I am Lebanese. I study in Italy (University of Bologna). I am currently pursuing a Master degree in Automation Engineering (some of y'all would use the nomenclature: control engineering). I am in my 2nd year - 1st semester - I guess it's the natural time for someone in my position to be sitting down and thinking a bit about his thesis: what do you want to work on? do you wanna do it at a corporation or in an academic institution? locally or abroad? the usual existential mumbo jumbo.\nI sat down and i figured: alright, I got it. I have all my questions answered one-by-one. Now I gotta figure out how to make things happen.\n\n*Answers:* I'd like to do my thesis abroad snd preferably in an English-speaking country. I figured doing it in the US/Canada would be idealistic.\nMy thought process is: I've been living in Italy for over 5 years now. I even speak the language flawlessly but I do not want to work here. I love it here and all but y'all can see that there's a big flow of Italian youngsters leaving the country. My reasoning is self-explanatory in that regard. I don't care whether I'm going to do it at an academic institution or at a corporation as long as I'm going to work on something I'm interested about. My side goal would be to network and make connections as one would. My fields of interest revolve around optimal control, autonomous robotics, distributed systems, etc. Boring, I know, but I won't deny it - I like it.\n\n*Why am I writing this post?*\nI have an idea of how things are in Europe. I gotta talk to a professor that teaches the subjects I am interested in. They would recommend me some people abroad that could host me - some of his connections. I could talk to some people abroad randomly. I did an internship in Sweden during my bachelor and all I had to do was to randomly write a professor there that had a project I thought I could assist with. But I have no ideas how things are in the North America. How is the master thesis process? Do they normally fund the trainees? What should I consider? I'd like to here from you about your experiences and how you approached that matter. \nAnd of course, I appreciate any comment/advice/criticism that could be of any use, thank you.",
  "author": "ad97lb",
  "created": 1634907476,
  "updated": 1635184743,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhn94r8": {
      "link": "/r/college/comments/qdgdme/master_thesis_abroad_goal_destination_usa/hhn94r8/",
      "text": "For your masters in the US you can often get scholarships or stipends if you are a teaching assistant. If you don't do these things it's much more expensive than a European university. We have public and private universities. Private is generally much more expensive but sometimes they are cheaper if they happen to offer a lot of aid. The F-1 Visa allows for you to do 20 hours a week of OPT (career related) paid work.\n\nYou'd apply to SEVP-approved universities and be eligible to apply for an F-1 Visa if you were accepted. That includes a visa interview and for you it would probably be in Rome because that is the closest embassy.\n\nHave you considered Germany or Switzerland? They are high paying for STEM fields, university expenses would be lower, and the visa process is easier.",
      "author": "darniforgotmypwd",
      "created": 1634924257,
      "upvotes": 2,
      "replies": {}
    }
  }
}