{
  "sid": "psz6qn",
  "link": "/r/college/comments/psz6qn/i_messed_up/",
  "title:": "i messed up",
  "text": "I’m a freshman at a very prestigious school. I came in not with the proper education. i was really behind in comparison. but i’ve been leaning on others to get me through my classes. (it’s week 4) i cannot do anything in any of my classes but mainly (chem, multi calc, comp sci, climate change physics) i don’t know what to do. this school has a very serious honor code. (we take tests at home and are given a lot of trust. )i want to approach my professors but i’m worried about being expelled because if i met with my teachers one on one it would be VERY obvious i have zero clue about the material. any advice?",
  "author": "shhudontknowme",
  "created": 1632282166,
  "over_18": false,
  "upvotes": 20,
  "upvote_ratio": 0.91,
  "comments": {
    "hdus0pr": {
      "link": "/r/college/comments/psz6qn/i_messed_up/hdus0pr/",
      "text": "Trust me, no one knows what they’re doing as much as they make it seem",
      "author": "cow11111",
      "created": 1632324548,
      "upvotes": 1,
      "replies": {}
    },
    "hdtfbwd": {
      "link": "/r/college/comments/psz6qn/i_messed_up/hdtfbwd/",
      "text": "So basically, your friends are nice enough to “explain” everything to you. If you don’t care too much about what comes after college, whether it be education or occupation, feel free to continue on your path. The more pressure your desired industry has, the better equipped they are in identifying bullshit.\n\n\nIgnore anything I said above if you have connections.",
      "author": "b0t0101",
      "created": 1632293325,
      "upvotes": 2,
      "replies": {}
    },
    "hdtdldj": {
      "link": "/r/college/comments/psz6qn/i_messed_up/hdtdldj/",
      "text": "i was at a rather high end school as well and everyone had tutors that may be why some ppl r understanding the material sm better. no one talks about it but everyone has tutors at top schools even the ppl u wouldn’t expect. \n\nif money isn’t a problem i’d strongly suggest u get a tutor esp if ur too scared to go to ur teachers about it due to the whole honor code thing",
      "author": "trackxdreams",
      "created": 1632291904,
      "upvotes": 3,
      "replies": {}
    },
    "hdt5t2y": {
      "link": "/r/college/comments/psz6qn/i_messed_up/hdt5t2y/",
      "text": "I’d speak with your advisor about tutoring options and your concerns. There nothing wrong with your classmates helping you but if they’re doing your work for you it’s going to compound the problem next semester.   I’d also encourage you to be realistic about how you’re doing. Your friends maybe helping you but unless they’re actually taking your exams for you, you’re learning enough to be doing ok. Sounds like you may need some help with note taking, study habits and time management.",
      "author": "Significant-Equal-12",
      "created": 1632286267,
      "upvotes": 5,
      "replies": {}
    },
    "hdt00aj": {
      "link": "/r/college/comments/psz6qn/i_messed_up/hdt00aj/",
      "text": "I’m confused on how you would get expelled for asking a teacher for help",
      "author": "beywill19",
      "created": 1632282674,
      "upvotes": 28,
      "replies": {
        "hdt027i": {
          "link": "/r/college/comments/psz6qn/i_messed_up/hdt027i/",
          "text": "because i’ve been turned in homework’s and getting decent grades/taking quizzes",
          "author": "shhudontknowme",
          "created": 1632282705,
          "upvotes": 5,
          "replies": {
            "hdugte4": {
              "link": "/r/college/comments/psz6qn/i_messed_up/hdugte4/",
              "text": "Bro it sounds like you got imposter syndrome bad. And that fear is normal but if you don't feel comfortable with the material and need more help you need to ask for help from people who can help you. You cant do it all on your own and you'd be screwing yourself even more by not seeking help. You will never get expelled asking for help like this, you can get sacked for bad grades tho.",
              "author": "jsimercer",
              "created": 1632319837,
              "upvotes": 10,
              "replies": {}
            },
            "hdt1twk": {
              "link": "/r/college/comments/psz6qn/i_messed_up/hdt1twk/",
              "text": "Tutoring maybe?",
              "author": "beywill19",
              "created": 1632283758,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "hdt038h": {
          "link": "/r/college/comments/psz6qn/i_messed_up/hdt038h/",
          "text": "like my grades do not reflect my knowledge",
          "author": "shhudontknowme",
          "created": 1632282721,
          "upvotes": 2,
          "replies": {
            "hdt33ct": {
              "link": "/r/college/comments/psz6qn/i_messed_up/hdt33ct/",
              "text": "Are you saying you cheated? I’m sorry your post is kind of confusing to me in terms on what you’re asking for",
              "author": "genz027",
              "created": 1632284530,
              "upvotes": 7,
              "replies": {
                "hdt3ivc": {
                  "link": "/r/college/comments/psz6qn/i_messed_up/hdt3ivc/",
                  "text": "no i haven’t but i’ve had other people explain all the problems to me but i haven’t retained any info",
                  "author": "shhudontknowme",
                  "created": 1632284799,
                  "upvotes": 2,
                  "replies": {
                    "hdtbk6k": {
                      "link": "/r/college/comments/psz6qn/i_messed_up/hdtbk6k/",
                      "text": "Maybe it’s because I’m stoned but I’m really confused with what the issue here is? It’s perfectly normal to *feel* like you’ve forgotten everything you’ve ever studied but really, you haven’t. Your brain retains too much info for you to be able to just start accurately recalling everything you’ve ever studied. It just comes out instinctively when you really need it.",
                      "author": "Viper_Red",
                      "created": 1632290328,
                      "upvotes": 12,
                      "replies": {}
                    },
                    "hdvlleh": {
                      "link": "/r/college/comments/psz6qn/i_messed_up/hdvlleh/",
                      "text": "you aren't cheating, and have nothing to hide.  approach teachers and ask for help, those higher end schools usually have REALLY good resources for networking, support, etc its part of what sets them apart from the norm",
                      "author": "RevolutionaryLeave77",
                      "created": 1632336530,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hdvwh2g": {
                      "link": "/r/college/comments/psz6qn/i_messed_up/hdvwh2g/",
                      "text": "asking other people to explain problems for u isn’t anything bad and definitely isn’t cheating. tell ur teachers that ur not retaining info and they can help u or point u in the direction for some tutors. also look up college study tips",
                      "author": "EdelwoodOil",
                      "created": 1632341252,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634056767
}