{
  "sid": "r3npc5",
  "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/",
  "title:": "I'm in a tricky situation with my world history paper right now.",
  "text": "I recently got feedback for my world history paper. The topic I've chosen was the Spanish Flu. One of the main complaints I got from my professor was that my paper wasn't specific enough. Like, it didn't make a specific enough argument when talking about the Spanish Flu. As a result, my paper was all over the place with potential arguments I could make with where I could go with a specific argument. Unfortunately, no matter which argument I choose, I have to stick with it and take out certain sources. \n\nI could go with how the healthcare industry was not strong enough to deal with this pandemic, why World War I made the Spanish Flu pandemic worse, or even why conspiracy theories made this pandemic go as out of control as it was. **I CANNOT mention anything about COVID-19 in this paper**.\n\nThe final paper is due on 12/6 and is worth 125 points. So whichever argument I make, I would have to choose now and would have to take out certain sources no matter how much I don't want to. Wish me luck on the paper!",
  "author": "Some1inreallife",
  "created": 1638049326,
  "updated": 1638206824,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 1.0,
  "comments": {
    "hmchf0d": {
      "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmchf0d/",
      "text": "It's easy to get more secondary sources. You pull up the article database your school subscribes to and put in your search terms like googling. You can use Google scholar too, and you might find some digitized books in Google or archives.org that coud be primaries.. Jstor is my favorite database.",
      "author": "CindsSurprise",
      "created": 1638063320,
      "upvotes": 11,
      "replies": {}
    },
    "hmcpoa4": {
      "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmcpoa4/",
      "text": "Not sure if this can help but try comparing the amount of sources you have for each topic/argument and how much data they hold. If you feel you are short on time, pick the topic with less bibliography yet enough to have content, otherwise pick the long bibliography topic. Wish you best of success with this!",
      "author": "Marihuazzz",
      "created": 1638067300,
      "upvotes": 6,
      "replies": {}
    },
    "hmd4tnw": {
      "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmd4tnw/",
      "text": "I would do 15ish min of research finding more (potential) sources per argument and chose your argument based on how good your sources are. Most profs appreciate having lots of evidence cited as well , to bolster your argument. Plus if you need to turn your 10 page paper to only have one argument and want to keep it still at 10 pages, you’ll might need loads more sources. Also, outline! Even a 5 min outline will help you keep your paper from going “all over the place,” which you may need since you seem interested in the topic and have done extensive research on multiple areas:) (Also, if your school has a writing center, I recommend checking it out!) \n\nI have only written a handful of long papers, as I’m a stem major, so maybe take my advice with a grain of salt based on your experiences, BUT that ^^^ is what I would do, and I’ve been successful in all my papers so far. Best of luck OP!! \n\n(Sorry for any errors, I’m on mobile)",
      "author": "CalypsoP",
      "created": 1638075078,
      "upvotes": 3,
      "replies": {}
    },
    "hmbtcmz": {
      "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmbtcmz/",
      "text": "Good luck! Which subtopic will you choose?",
      "author": "Awkward_Result6214",
      "created": 1638052333,
      "upvotes": 3,
      "replies": {
        "hmbtotq": {
          "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmbtotq/",
          "text": "To be honest, I'm leaning more towards World War I's impact on the Spanish Flu pandemic or the weaknesses in the healthcare industry making the pandemic worse. There are pros and cons with both of these options, but I have to choose now and I'm absolutely stuck.",
          "author": "Some1inreallife",
          "created": 1638052485,
          "upvotes": 9,
          "replies": {
            "hmbux7d": {
              "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmbux7d/",
              "text": "Well, there *was* no healthcare industry, so you can’t really use that.  \n \nThere were private and public and charity hospitals. Doctors went door to door.",
              "author": "Awkward_Result6214",
              "created": 1638053038,
              "upvotes": 4,
              "replies": {}
            },
            "hmbvdrn": {
              "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmbvdrn/",
              "text": "WWI [WWI and Spanish flu](https://theconversation.com/world-war-ones-role-in-the-worst-ever-flu-pandemic-29849)",
              "author": "Awkward_Result6214",
              "created": 1638053241,
              "upvotes": 2,
              "replies": {}
            },
            "hmfcox1": {
              "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmfcox1/",
              "text": "You could even write about the impact of field hospitals on the spreading of the sickness, which were filled because of the war",
              "author": "Alternative-Mango-52",
              "created": 1638122850,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmbyxti": {
      "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmbyxti/",
      "text": "Spanish flu reaction or how they handle it. to (pick an area) and talk to your local historical society. \n\nLiterally people were calling up constantly in 2020. And were going through local newspapers.\n\nWorked in a library archive",
      "author": "enoughstreet",
      "created": 1638054837,
      "upvotes": 1,
      "replies": {}
    },
    "hmbutuj": {
      "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmbutuj/",
      "text": "My teacher did this with my essay about birth control and honestly said fuck it and ignored her advice because I already wrote 10 pages and I turned it in. Hope my grade is good lolol\n\nedit- quit downvoting me we all know that this is how college goes",
      "author": "Anything-Still",
      "created": 1638052995,
      "upvotes": -1,
      "replies": {
        "hmctlio": {
          "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmctlio/",
          "text": "me crossing my fingers bc i just turned in a 12 page research paper. it was a draft but they are giving me a grade as if it was a final so im aiming for a C or above lmaoo",
          "author": "gguerr07",
          "created": 1638069239,
          "upvotes": 2,
          "replies": {
            "hmd3kh9": {
              "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmd3kh9/",
              "text": "yeah same C's get degrees man",
              "author": "Anything-Still",
              "created": 1638074391,
              "upvotes": 1,
              "replies": {
                "hmd3rwc": {
                  "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmd3rwc/",
                  "text": "at this point in the semester, yep",
                  "author": "gguerr07",
                  "created": 1638074504,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hmbv71j": {
          "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmbv71j/",
          "text": "I mean, my paper is 9 pages long currently (10 if you include the bibliography). I still have until the 6th to get this assignment done and I'm still weighing my options right now of which specific argument to go over with Spanish Flu.",
          "author": "Some1inreallife",
          "created": 1638053158,
          "upvotes": 1,
          "replies": {
            "hmbvk2o": {
              "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmbvk2o/",
              "text": "Well did u include any subtopics in your paper that you feel you could keep writing about? I hate subtopics because I feel I never find enough sources",
              "author": "Anything-Still",
              "created": 1638053318,
              "upvotes": 1,
              "replies": {}
            },
            "hmctfyn": {
              "link": "/r/college/comments/r3npc5/im_in_a_tricky_situation_with_my_world_history/hmctfyn/",
              "text": "since its due in a short amount of time, go with the subtopic u have written the most about and make it stronger",
              "author": "gguerr07",
              "created": 1638069162,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}