{
  "sid": "r6gcno",
  "link": "/r/college/comments/r6gcno/taking_a_semester_off_vs_ruining_my_life_advice/",
  "title:": "Taking a semester off vs. ruining my life advice",
  "text": "Gonna try to not make this an over reacting post like many others on the sub. Basically I got good grades my first semester as a freshman but then it all fell apart when I developed a stomach condition and all my focus had to go to managing that. The past 2 semesters I have tried to do by best but at full capacity I still got grades way worse than my first semester and way worse than I need to to get into dental school.   \n\nBasically where I am now my stomach is really messing up my life and based on the number of mental breakdowns per day and the amount of weight I’ve lost I am only working at like 40% capacity. I truly want to avoid taking a semester off to focus on my health because that would leave me in a weird position and maybe make it harder to get back into it next year but as of now I really can’t imagine continuing another semester like this. \n\n\nDoes anyone have any experience with taking a semester off to successfully reset? Or am I being naive and would be better off keeping on track and doing my best to address my mental and physical state simultaneously and hope I can pull off good grades next semester?\n\n\nI don’t know if these are the types of questions I should be asking here but any help is appreciated it",
  "author": "SquidwardsTenisBalls",
  "created": 1638369944,
  "updated": 1639856824,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.8,
  "comments": {
    "hmtp18i": {
      "link": "/r/college/comments/r6gcno/taking_a_semester_off_vs_ruining_my_life_advice/hmtp18i/",
      "text": "I don’t have experience with it, but I would talk to your advisor or your college to make sure you can still graduate when you want to. I think it can be a good idea, especially when you’re struggling as much as it seems you are. Just make sure to work out all the logistics so you can still finish your degree.",
      "author": "Kouglove",
      "created": 1638382473,
      "upvotes": 3,
      "replies": {}
    },
    "hmtruz7": {
      "link": "/r/college/comments/r6gcno/taking_a_semester_off_vs_ruining_my_life_advice/hmtruz7/",
      "text": "Taking a break off can only be concerning because of the possibility you might not come back. But, if you want a job and you need an education for it, you'll go back. Maybe you'll find a different job you enjoy and make decent money from and won't feel the need to go back, either is fine. If your health is jeopardizing your education, take off. Absolutely.",
      "author": "CowardlyGoblin",
      "created": 1638383554,
      "upvotes": 1,
      "replies": {}
    },
    "hmvs723": {
      "link": "/r/college/comments/r6gcno/taking_a_semester_off_vs_ruining_my_life_advice/hmvs723/",
      "text": "I burned out and fell into moderate depression after my first master's semester in CS.\n\nDo you know what I would do differently, if I could turn back time? I'd take 1 semester off **immediately**. Unfortunately, I was too stubborn and thought I just have to work harder (typical reaction and the worst thing you can do). I did feel better when the second semester started, but was far away from being able to perform well. I fucked up the complete semester. And then fucked up a few more, until I started to go to therapy and my therapist encouraged me to take 2 semesters off to work on my mental health. And that was crucial.\n\nWhen I came back, I got into very interesting courses and kicked ass (even though I didn't have any life during that semester, no free-time, just all-out studying). Unfortunately, that led to another burn-out and I thought I could continue, but fucked up another semester.\n\nThere's only so much your body and mind can take. If you mange to stop before it gets bad, you can recover quite quickly, but once you are over that threshold of burnout or depression, you might be unable to study for weeks or months.\n\nAll I can say is, you have to realistically assess for yourself whether or not you can pull it off. And is it worth it doing knowing you'll get sub-optimal grades? When you finished college and look back at the grades you got, will you be mad you didn't take a break? And maybe a short break is enough? Or maybe a long break is exactly what you need?\n\nSome examples how I know I went beyond my limits and burned out or am about to:\n\n* Not being able to relax, no matter what I do\n* Losing interest in doing things I once loved\n* Not having the energy to do things I would like to do and was able to do every day just a week ago (e.g. Playing an instrument, exercise). Just a week ago, I was playing guitar for 2 to 3 hours every day. I lived for it. I breathed it. I went to bed and couldn't wait to pick it up again. And that was nothing new. It's been like that half my life. And suddenly after my breakdown, I just barely have the mental and physical energy to pick it up again, even though it's more important to me than anything. Just thinking of it, I'm just exhausted. Not to mention the physical exercise, which I did every day, that I couldn't do anymore.\n* Not being rested even after 9 hours of sleep. Waking up every day feeling exhausted and feeling like I could just keep on sleeping. And tiredness during the day even with a lot of sleep.\n* Being overly emotional (e.g. tearing up reading bad news or watching a semi-emotional movie)\n* Sudden breakdows with crying, just thinking of having to study, and when it gets really bad even of simple things like going shopping or to the post office (and I am not someone who usually cries. I usually rarely do it, so that's a big sign for me. It's literally my brain telling me:\"Dude, I can't continue like this. I just can't. This is it. I'm finished.\"\n* Not having the energy to even do everyday tasks or feeling overwhelmed by them (e.g. showering, shopping, post office, washing the dishes)\n* Feeling overwhelmed just by the simplest of decisions (e.g. standing in the super market in front of a shelf for 2 minutes trying to choose between 2 different kinds of pasta of the same maker.)\n* Not having the energy or will to keep up my daily routine\n\n&#x200B;\n\nAnd some of my signs for too much stress:\n\n* Tinnitus\n* Muscle twitches\n* Having a short fuse\n* Stomach problems\n* Rash\n\nI've had enought mental breakdowns in my life because of college. I've had enough of depression, burnout and anxiety, which will accompany me for the next 5 to 10 years (and have already been with me for 4 years, and that only because of university). If I think about how  I was able to perform mentally when I started college and compare it to now, I want to cry. College killed me mentally. Even things I want to do, I just can't because it's too exhausting. And that's just the tip of the ice berg.\n\nWhat I learned, unfortunately, is that it's either mental health or college for me. I cannot handle both for very long. Even this semester, I was not doing terrible bad. Yes, I couldn't study as much as I wanted, but at least I was building up a strong routine of playing guitar and exercising. I was feeling better than in a long time (apart from the stress). And suddenly, one day, my brain said:\"That's it. I'm done.\" On one day, I was fine, the next I had a huge breakdown, crying without reason and been exhausted every since (about 2 weeks ago).\n\nAnd you know what? My general physician warned me in my first semester, a few months before my huge breakdown and following depression, that if I continued like that, it would end badly. I listened to her and learned to relax more, but I didn't do enough. I just kept working and the next time I went to see her, I broke down crying in her office. That was also the first time in my life I hyperventilated. Not funny...\n\nI don't know how taking a break from college works in your country, but in mine, I was able to get 2 semesters off to deal with my mental health. Needed a certificate from my therapist and for the second semester a certificate from a psychologist (which, I only visited that one single time for that one specific reaseon. He was super nice and understanding.).\n\nAlways remind yourself to relax and be kind to yourself. And that is life rule I have to learn: **Be kind to yourself.** That's not a joke. Look up studies about it. Reduces risk for burnout, depression, anxiety etc..\n\n**And learn mindfulness meditation and practice it every day to give your brain a break. Look up studies about it connected to depression, burnout, anxiety. Nothing spiritual about it, but possibly a life changing practice to live life to the fullest.**\n\n/r/mindfulness\n\n/r/meditation\n\nSorry for the huge post. Gotta stay away from reddit.\n\nI'll probably delete this post later.",
      "author": "Tuomas90",
      "created": 1638413062,
      "upvotes": 1,
      "replies": {}
    },
    "hoqfekv": {
      "link": "/r/college/comments/r6gcno/taking_a_semester_off_vs_ruining_my_life_advice/hoqfekv/",
      "text": "Take the semester",
      "author": "warr3nh",
      "created": 1639624500,
      "upvotes": 1,
      "replies": {}
    }
  }
}