{
  "sid": "pxe61c",
  "link": "/r/college/comments/pxe61c/how_do_film_students_deal_with_the_textbook/",
  "title:": "How do film students deal with the textbook readings they need to do",
  "text": "I'm taking film as an elective credit and I never realized so much reading went into it. I knew there'd obviously be some 'cause I've taken an art class in hs and even it had reading we needed to do. However, having to dedicate 2-3 hrs to read my textbook chapter for the week, 2 hours to watch the assigned film, and 4 hours to watching my professor's lectures is not at all what I was expecting. And with my horrendous mental health, I've fallen far behind and midterms are here, and I have a C in the class. I can't even drop it or else I'll turn into a part time student and lose financial aid. \n\nDoes anyone,  even non-film majors, have advice for how to properly balance this so I can end the class with a B?",
  "author": "Mgclpcrn14",
  "created": 1632858222,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "henaoce": {
      "link": "/r/college/comments/pxe61c/how_do_film_students_deal_with_the_textbook/henaoce/",
      "text": "I was not a film student but I had an insane amount of textbook readings to do in college. Between maintaining social relationships, going to work, attending class, fulfilling extracurriculars, and meeting self-care needs, I probably would’ve just collapsed if I actually did the full readings. I know people that did read in full and they had to sacrifice something in return (usually socializing). I, on the other hand, managed to do pretty well with skimming. \n\nI was actually told to skim by a professor. He warned that if we tried to read everything entirely, we’d be cramming way too much info into our minds. It doesn’t work for everyone, but if you want to give it a shot, here are some tips: \n\n1) Learn more about your class: What kind of material is generally on the exams? For instance, I once took a class that assigned one textbook and several small books. After taking the first test, I realized 90% of the material was based on the textbook. So I prioritized that over the small books. \n\n2) Read online summaries: Not all textbooks have online reviews and summaries online, but if they do- read them. \n\n3) Perform triage: Which classes rely more on the books and readings? Focus on reading those ones over classes that don’t depend heavily on readings. \n\nThe rest of it is just learning how to read quickly and scan for important info. Cant really explain how, it’s just a skill you get better at the more you do it.",
      "author": "ludgatedwyer500",
      "created": 1632865308,
      "upvotes": 1,
      "replies": {
        "henax7z": {
          "link": "/r/college/comments/pxe61c/how_do_film_students_deal_with_the_textbook/henax7z/",
          "text": "Thank you sm! I'll try that! 💜💜💜",
          "author": "Mgclpcrn14",
          "created": 1632865417,
          "upvotes": 1,
          "replies": {}
        },
        "hmic838": {
          "link": "/r/college/comments/pxe61c/how_do_film_students_deal_with_the_textbook/hmic838/",
          "text": "Super late, but I took your advice and was able to get the B I wanted in the class. Thanks a million bajillion 😭💜💜💜💜💜",
          "author": "Mgclpcrn14",
          "created": 1638173202,
          "upvotes": 1,
          "replies": {
            "hmm38xj": {
              "link": "/r/college/comments/pxe61c/how_do_film_students_deal_with_the_textbook/hmm38xj/",
              "text": "Oh awesome glad it worked!",
              "author": "ludgatedwyer500",
              "created": 1638239714,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1639864073
}