{
  "sid": "q39ic4",
  "link": "/r/college/comments/q39ic4/thoughts_on_switching_majors_tldr_at_bottom/",
  "title:": "Thoughts on switching majors? (TLDR at bottom)",
  "text": "Hello, I'm a sophomore majoring in Visual Art Education. I'm going to explain my thought process a bit so please bare with me, but if you can't I understand, and like the title says, there's a TLDR at the bottom.\n\nThis is kind of more personal than college related, but I've got social anxiety, and while it's not extremely severe, it is bad enough that I do tend to get anxiety attacks in really stressing situations. Along with this, I believe I may actually be on the spectrum, however it's not for sure and I am working on getting a diagnosis.\n\nBack to the college part, majoring in education comes with many field placements and microteaching (basically just planning a lesson plan and teaching it to your classmates), along with actual teaching to kids. The experience I've had in my field placements has been mainly awkward. I've come to find that it's a bit hard for me to make lasting conversations and sometimes connections with people. Kids to me have been easier to talk to, but in these field placements I find it's still hard to relate to them and making those connections. The biggest \"incident\" that I've had that has made me question my major was a week ago where we had to microteach a lesson to our peers. And everyone did really well, and when I got up front I was a complete stuttering mess. I didn't actually \"teach\" the content but moreso explained how I would have taught it. I had my whole lesson plan written down in front of me, and I lost all ability to read. I skipped out in major parts. And the worst is that I nearly had an anxiety attack during it, which was really scary and later extremely mortifying to think that all my classmates saw me like that. Normally I don't get them until after a presentation is over and I'm able to calm myself down. That also wasn't my first time microteaching, yet it was the worst.\n\nAnother issue I've found is if I get to overwhelmed my mind sort of shuts down? I'm still able to sort of function but not at 100 percent like I usually would.\n\nWhen I spoke to my advisor about this she mentioned the possibility of switching majors. And while it seems like a plausible idea, I'm not sure if I do want to switch.\n\nBecause a small part of me \\*does\\* want to be a teacher. I want to have my classroom, and teach kids about art, and inspire them. But I don't know if I really want to be a teacher, or if I'm just in love with the idea of being a teacher. I don't even know if I would even make a good teacher.\n\nHas anyone else gone through a similar dilemma? Or if you have switched majors, how did you know that you truly wanted to switch majors? Are you happier that you switched majors? Would switching majors as a sophomore even be beneficial?\n\n&#x200B;\n\n&#x200B;\n\nI am planning on speaking with other faculty advisors in possible majors I might switch to, but I just wanted to post one here and try to get a wider perspective. Anything really to help me, I'm at a bit of a loss I'm afraid.\n\n&#x200B;\n\nTLDR: I'm a sophomore Art Ed major, but I fear it may not be my calling. What are your thoughts on me switching majors?",
  "author": "terralacia",
  "created": 1633614590,
  "updated": 1634083615,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfqen3z": {
      "link": "/r/college/comments/q39ic4/thoughts_on_switching_majors_tldr_at_bottom/hfqen3z/",
      "text": "It’s 100% normal and okay to switch or even question your major. I was originally accepted into university as a Pre-PT student and now i’m CJ/psych. I’m so much happier. I would’ve loved to be a physical therapist but I hated the majority of classes (like intense chem n bio) that I would’ve had to take to get me into that career path. \n\nYour anxiety could just be in the way of seeing the potential you have at that career. Public speaking and meeting new people always get my anxiety going personally, doesn’t mean you can’t be a teacher. \n\nMy advise would to find another major that interests you and to take its intro class next semester. You may be surprised how much you like it or it will confirm you want to stay in the visual arts.",
      "author": "rynpickles",
      "created": 1633617484,
      "upvotes": 3,
      "replies": {
        "hfrjs3b": {
          "link": "/r/college/comments/q39ic4/thoughts_on_switching_majors_tldr_at_bottom/hfrjs3b/",
          "text": "Thank you!",
          "author": "terralacia",
          "created": 1633634458,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}