{
  "sid": "qjyuly",
  "link": "/r/college/comments/qjyuly/average_for_class_midterm_was_64/",
  "title:": "Average for class midterm was 64%",
  "text": "As stated above, the average grade for my midterm was 64%. The low was 0%, and the high was 100%. I received a 66%. Before this midterm, I had 100% in the class, so I don't know what the fuck happened. But seeing as a majority of my course also received a D, are we all dumb, or is our professor partially at fault? Should I respectively email her my concerns or leave it be? I am now at 85%.",
  "author": "peachy_night",
  "created": 1635714679,
  "updated": 1635779368,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hitaei9": {
      "link": "/r/college/comments/qjyuly/average_for_class_midterm_was_64/hitaei9/",
      "text": "Without more information, it’s difficult to tell. \n\nFirst, consider how averages work. The low was 0%, which means at least one person didn’t take it and/or cheated and was caught. A zero can pull down an average quite a bit. Now, if multiple people got zeros, then that would make the average look a lot worse than it really is. So, that may be the main reason.\n\nAside from that, is the course face to face or online? Has the professor provided course resources, been available for office hours, taught/directed, etc., or has she been totally MIA? What was expected of the class in terms of preparation, and did the class prepare effectively? What has the average been in recent semesters compared to this one?\n\nIf someone made 100%, then it doesn’t seem likely that she is at any fault. Even if someone didn’t make 100%, there are many factors that might lead to a 64% average that aren’t the fault of the professor. It could be that the class is behind on prior knowledge/skills needed for this course (this has been especially pervasive in recent semesters due to the pandemic and lower standards/rigor). Depending on the discipline and course, a 64% average might also be expected for this particular exam. Or, as mentioned above, it could be a skewed average due to multiple zeros.\n\nSince you still have a mid B average (which is still above average expectations), it seems that the course grading scheme would counterbalance a slightly lower than typical exam average (assuming it actually is lower than typical).\n\nIf you contact her, you should do so from the perspective of “This is what I did to prepare; what could I do to prepare better for next time?” Saying something like “it’s unfair that a majority of us got a D” would not be well received.",
      "author": "PhDapper",
      "created": 1635716293,
      "upvotes": 8,
      "replies": {}
    },
    "hit7n6r": {
      "link": "/r/college/comments/qjyuly/average_for_class_midterm_was_64/hit7n6r/",
      "text": "Has the Professor said anything about it yet? I’d wait and see if they have a statement about the grades yet and if they were lower than expected.",
      "author": "SlinkyAstronaught",
      "created": 1635715034,
      "upvotes": 2,
      "replies": {
        "hit887a": {
          "link": "/r/college/comments/qjyuly/average_for_class_midterm_was_64/hit887a/",
          "text": "Nope. And she finished grading them a week ago",
          "author": "peachy_night",
          "created": 1635715297,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hitcs7n": {
      "link": "/r/college/comments/qjyuly/average_for_class_midterm_was_64/hitcs7n/",
      "text": "For the undergraduate class that I teach this is very much in line with my expectations for the results of the midterm exam.  It is the nature of the class I teach.\n\nAs u/phdapper states a 0 usually means a student  chose not to sit the exam.\n\nIf you have concerns about your grade then contact the professor to discuss your results.  How did you feel when you sat the exam?  Did you feel like you knew the material?  If not, why not?  For my undergraduate classes going into the exam with a letter grade of A means you completed the low stakes assignments.  It does not necessarily mean you learned the material. \n\nReach out to your professor to ask your questions and to be able to address your concerns.\n\nEdit: supporting another comment by u/PhDapper a letter grade of B is good as a letter grade of C is the expectation for the upper division undergraduate classes that I teach.",
      "author": "SlightScholar1",
      "created": 1635717395,
      "upvotes": 2,
      "replies": {}
    },
    "hiuum88": {
      "link": "/r/college/comments/qjyuly/average_for_class_midterm_was_64/hiuum88/",
      "text": "Percentages don't really mean much.  It depends on the grading scale used. If an exam is hard, 70% might get you an A. The old 90-80-70-60 scale used in high school isn't that common in college in certain subjects.",
      "author": "time2trouble",
      "created": 1635747599,
      "upvotes": 1,
      "replies": {}
    },
    "hiuuuaq": {
      "link": "/r/college/comments/qjyuly/average_for_class_midterm_was_64/hiuuuaq/",
      "text": "Had a midterm a week ago with a 54% average, fun times",
      "author": "censqred",
      "created": 1635747796,
      "upvotes": 1,
      "replies": {}
    }
  }
}