{
  "sid": "r049s7",
  "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/",
  "title:": "Lost in life and uncertainty of what the future holds",
  "text": "Honestly, I wasn't the smartest student in high-school nor the one who slacked off majorly. My GPA is quite horrendous, 2.8. So I am looking advice to enlist college this January, I would prefer online but I wouldn't mind. I am looking forward to be an accountant then pursue cpa, which if am not correct, accounting takes 4 years then cpa about 1-2. Where should I go from now on? Would a 2.8 GPA even worth giving a shot at? Or community College then get my associate and hopefully   import it to a university and get my bachelor's. What should I do? Any tips would be appreciated. \nLocation: NYC",
  "author": "AdvisorTaught",
  "created": 1637639828,
  "updated": 1637689004,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlq8wvr": {
      "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlq8wvr/",
      "text": "Colleges just want your money. The lower the GPA, the less schoolerships theyll give. Some state school is dreaming of your application RN.",
      "author": "AHumbleLibertarian",
      "created": 1637640300,
      "upvotes": 1,
      "replies": {
        "hlq96pm": {
          "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlq96pm/",
          "text": "Honestly I am just looking something to fall back on, once my military contract is done. That's why I'll do college while I am in active duty. I signed a six years contract. So why not leverage on college. Ty for your input though.",
          "author": "AdvisorTaught",
          "created": 1637640438,
          "upvotes": 1,
          "replies": {}
        },
        "hlqadst": {
          "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqadst/",
          "text": "What a bunch of horseshit lol, state schools are far better than private ones. You can graduate from state schools for relatively cheap nowadays, a lot of state schools offer free or low income tuition to low income students, UConn, University of Texas, University of Minnesota, University of California are some that come to mind. Not to mention that there are a lot of scholarship opportunities that are not academic based.\n\nState schools > Private schools",
          "author": "M33RHARIS",
          "created": 1637641070,
          "upvotes": 1,
          "replies": {
            "hlqdqkr": {
              "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqdqkr/",
              "text": "Yeah, for people meeting X criteria that applied before Y date and has recomendation from Z congress member. Seriously, these sources of aid are as selective as the ivy leagues themselves. Relatively cheap is rich... literally. My 4 year education has almost doubled my household's annual income; and I'm not even 6 figures deep unlike others.\n\nAnyways, State school, Private school, they're both the same shit. One just gets a bad rep because its associated with degree mills like Harvard, or Brown. Anyways, Ive got like 15 minutes before the mods delete this, so until then I guess.",
              "author": "AHumbleLibertarian",
              "created": 1637642943,
              "upvotes": 0,
              "replies": {
                "hlqe3ar": {
                  "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqe3ar/",
                  "text": "Nope, an example: if your family earns less than $60,000 and live in Connecticut, you can go to UConn for free. I know plenty of people going there for free. Just apply and fill out the FAFSA, as simple as that….\n\nSame thing with University of Minnesota, Texas, California to name a few.",
                  "author": "M33RHARIS",
                  "created": 1637643145,
                  "upvotes": 1,
                  "replies": {
                    "hlqfrzb": {
                      "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqfrzb/",
                      "text": "Yeah, for residents in state that enroll full time and still need to be accepted into those universities. I'm sure plenty of people take advantage of these schoolerships, but it really fits a niche population. Like, what family making less than 50k doesnt have their child working for an extra source of income? That child having a job and then required to be full time a university and then required to maintain \"satisfactory academic progress\" is legitmentally what I ranted about 2 comments ago.\n\nSystems bullshit, if you have money you get the opportunity to pursue a career that will in turn make similar amounts of money.",
                      "author": "AHumbleLibertarian",
                      "created": 1637644145,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlq9mi7": {
      "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlq9mi7/",
      "text": "Are you already enlisted?",
      "author": "Spicybooiii",
      "created": 1637640666,
      "upvotes": 1,
      "replies": {
        "hlq9q4r": {
          "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlq9q4r/",
          "text": "December 1 I am heading to bootcamp, few days from now. I am trying to secure my future while I am in and get some sort of education that would benefit me.",
          "author": "AdvisorTaught",
          "created": 1637640718,
          "upvotes": 1,
          "replies": {
            "hlq9vzy": {
              "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlq9vzy/",
              "text": "Bro relax. Worry about your enlistment. Military is the hard part, the amount of benefits you’re going to receive from veteran status is insane. The GI bill is 👌🏼👌🏼👌🏼\n\nWho knows, you might like it and stay",
              "author": "Spicybooiii",
              "created": 1637640803,
              "upvotes": 1,
              "replies": {
                "hlqa3h3": {
                  "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqa3h3/",
                  "text": "Just checked your reddit history. The irony, I am also picking mos 11B. Thanks for the advice i guess :D\nBranch: Army though xD",
                  "author": "AdvisorTaught",
                  "created": 1637640915,
                  "upvotes": 1,
                  "replies": {
                    "hlqatic": {
                      "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqatic/",
                      "text": "Good luck man, have fun. Probably the greatest advice is could give you:\n\nAs an 11B you WILL destroy your body. You’re going to feel like a 50 year old man at the age of 25. BUT, if you go document every little thing wrong with you during your time in, your future will thank you. VA comp is arguably the best veteran benefit. I get 2000$ for the rest of my life just because my knees, back and shoulders hurt occasionally. (Along with a few other minor things).",
                      "author": "Spicybooiii",
                      "created": 1637641306,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hlqb0y7": {
                      "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqb0y7/",
                      "text": "ALSO don’t worry about colleges. Veteran status will get you put into almost any college and the GI bill will cover tuition, on top of paying monthly for housing allowance.",
                      "author": "Spicybooiii",
                      "created": 1637641417,
                      "upvotes": 1,
                      "replies": {
                        "hlqbpcc": {
                          "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqbpcc/",
                          "text": "Yeah, I am trying to leapfrog my way up before my contract ends. 2-3 classes per semester while I am with tuition assistant  since my career takes around 6 years but due active duty probably more. I'll use the time bill once my contract is done. But you're right though, who knows if I end up choosing the military as my lifelong career, that's whats intriguing to me. The uncertainty of my path. But thanks man --->♡",
                          "author": "AdvisorTaught",
                          "created": 1637641791,
                          "upvotes": 1,
                          "replies": {
                            "hlqc4vz": {
                              "link": "/r/college/comments/r049s7/lost_in_life_and_uncertainty_of_what_the_future/hlqc4vz/",
                              "text": "Stay motivated man, good luck",
                              "author": "Spicybooiii",
                              "created": 1637642026,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}