{
  "sid": "qddb3f",
  "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/",
  "title:": "GF Partying without me - Advice",
  "text": "Guys 100% hit on my significant other at her college when I’m not there (LDR except I see her 3/4 weekends per month). It makes me feel shitty when she goes out even though I trust her. These dudes are coming up and trying to make her ‘dance’ with them, giving her nicknames. I am very uncomfortable with the whole situation.",
  "author": "poor_finances",
  "created": 1634895471,
  "updated": 1635184770,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.36,
  "comments": {
    "hhlptgb": {
      "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhlptgb/",
      "text": "Your girlfriend is an adult. If she didn’t like what was happening at parties she’d say something or stop going. You need to trust her and get over this jealousy or it will be bad for the relationship",
      "author": "Concerned-23",
      "created": 1634898209,
      "upvotes": 27,
      "replies": {}
    },
    "hhltsjz": {
      "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhltsjz/",
      "text": "that’s j what happens when ppl go to parties. it sucks but it is what it is.\n\nthe only thing u can do is get over feeling uncomfortable cuz it might make things go south",
      "author": "trackxdreams",
      "created": 1634901183,
      "upvotes": 12,
      "replies": {
        "hhn6rau": {
          "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhn6rau/",
          "text": "At what kind of parties are you going to?",
          "author": "Itchy_Word_1523",
          "created": 1634923279,
          "upvotes": -1,
          "replies": {
            "hhnbhvk": {
              "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhnbhvk/",
              "text": "at any party or club if ur a girl, guys will probs come up and try to dance… it’s sometimes j friendly and most of the time ppl don’t know if ppl r dating or single.",
              "author": "trackxdreams",
              "created": 1634925190,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhn1ann": {
      "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhn1ann/",
      "text": "If you're not comfortable with the way she parties and feel like she's flirting/dancing/being bothered etc with other dudes, you're not a bad person. But it sounds like you guys would benefit from a DTR (define the relationship) conversation--talk about commitment level and expectations and let her know how you feel about these guys at parties.",
      "author": "HRMqueenofeverything",
      "created": 1634921048,
      "upvotes": 3,
      "replies": {}
    },
    "hhlni3q": {
      "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhlni3q/",
      "text": "If you aren’t ok with her having other guy friends then I don’t see this working out lol. If you trust her then why would you feel uncomfortable? It sounds like you don’t. College is fun for experimenting and long distance just sounds kinda stressful and pointless. Other option is to go party with her lol, but it looks like jealously is getting to you",
      "author": "jt132323",
      "created": 1634896278,
      "upvotes": 6,
      "replies": {
        "hhn749p": {
          "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhn749p/",
          "text": "You sound stupid and pointless, go experiment with yourself lol",
          "author": "Itchy_Word_1523",
          "created": 1634923428,
          "upvotes": 0,
          "replies": {
            "hhnwaxy": {
              "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhnwaxy/",
              "text": "Go complain somewhere else bud, you’re on here for a reason",
              "author": "jt132323",
              "created": 1634933727,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhnkins": {
      "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhnkins/",
      "text": "She’s for the streets my boy. Them niggas piping. Ik from experience, I seen bitches mad shorties with bfs fuck a dude. But aye bro u should work on yourself.",
      "author": "maceybaby",
      "created": 1634928860,
      "upvotes": 2,
      "replies": {}
    },
    "hhlmwz3": {
      "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhlmwz3/",
      "text": "Bro she’s getting laid for sure just accept it and don’t make a big deal about it . Next time you hit it tell her it feels a bit different",
      "author": "MutedInvestigator847",
      "created": 1634895804,
      "upvotes": -22,
      "replies": {
        "hhln2x9": {
          "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhln2x9/",
          "text": "That’s a really fucked up thing to do, so no. She calls or facetimes me when she gets home, my concern is with how she is treated at parties not that she is cheating.",
          "author": "poor_finances",
          "created": 1634895935,
          "upvotes": 9,
          "replies": {
            "hhlngek": {
              "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhlngek/",
              "text": "She wouldn’t go unless she likes it …..",
              "author": "MutedInvestigator847",
              "created": 1634896240,
              "upvotes": -10,
              "replies": {}
            },
            "hhlnhmy": {
              "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhlnhmy/",
              "text": "Don’t be so over beating you gonna push her away",
              "author": "MutedInvestigator847",
              "created": 1634896268,
              "upvotes": -11,
              "replies": {}
            }
          }
        }
      }
    },
    "hhoa3w6": {
      "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhoa3w6/",
      "text": "Is this you not trusting her with other people, or being concerned for her safety? Because one of those is a problem and both require a relationship talk.",
      "author": "Smart-Abroad5861",
      "created": 1634939873,
      "upvotes": 1,
      "replies": {
        "hhoagit": {
          "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhoagit/",
          "text": "Mostly safety. I bought her pepper spray for her keychain but I want to be protective and can’t. Somewhere deep down I think I feel like I’m not doing my job as her boyfriend, which I know I need to address.",
          "author": "poor_finances",
          "created": 1634940038,
          "upvotes": 1,
          "replies": {
            "hhob6uk": {
              "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhob6uk/",
              "text": "Do that for sure. She may not see it the same way, and I guarantee you she already has a safety protocol even if it’s just subconscious habits. But it would be good for both of you to address the concerns openly and if needed find a solution together.",
              "author": "Smart-Abroad5861",
              "created": 1634940387,
              "upvotes": 2,
              "replies": {
                "hhobjdg": {
                  "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhobjdg/",
                  "text": "Thank you for your advice.",
                  "author": "poor_finances",
                  "created": 1634940554,
                  "upvotes": 2,
                  "replies": {
                    "hhpldjz": {
                      "link": "/r/college/comments/qddb3f/gf_partying_without_me_advice/hhpldjz/",
                      "text": "You sound the same as my boyfriend, we technically aren’t long distance since we technically live in the same city, but I commute out of the city for university all week and spend nights in friends’ apartments. He told me once that he felt he wanted to do more to help me be safe, it was a good talk about what I was doing to be more safe and calming to him to know how I knew I could be safe. But we also have had very serious talks about where we see ourselves, our commitment, our future goals, etc; so we are on the same page of trust as much as we can. \n\nIf it is the party aspect itself that worries you, you should have both conversations; it’s not abnormal to worry about your partner and their safety. However, if you don’t fully trust your girlfriend then there needs to be a conversation about that; jealousy breaks the best of relationships. Also make sure to look at your girlfriend’s perspective too. Don’t be controlling of what she does with her time and understand that she probably worries about you too :)",
                      "author": "kt_maee",
                      "created": 1634965203,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}