{
  "sid": "r5k9g4",
  "link": "/r/college/comments/r5k9g4/struggling_in_first_year_college_subjects/",
  "title:": "Struggling in first year college subjects",
  "text": "Its final exam in December and I am struggling in most of the subject. I feel like I dont understand anything in assignments and tests. I believe I did terrible in them. I dont know where I am at in the class. I used to be decent in high school biology, chemistry and have some foundation in calculus yet in all 3 subject I feel like a retard. Is it because I studied them in another language? focusing in lecture is hard cuz all of them are in online.\n\nA 3.4 GPA is the median of declaring major gpa needed. I will need 1 A- in my course but I dont see any of them being within grasp not to mention, I need other courses to have B+s for that to matter.\n\nThe exams are lecture based and similar to assignments but when I see assignments and past papers I dont see their words appearing in lecture nor tutorial at all. Do they just everyone to know them?\n\nI feel lost , hopeless and alone. I keep studying for the exams but I dont seem to go anywhere. Moreover, the competition is high and I am afraid I will lose it.I cant find anyone that is related to me or can share my feelings or situation.My secondary schoolmates are non college students or students that doesnt struggle at all(they played league during exams) or legit 0 fucks given to college or I dont know them well enough. I even spent hours worrying about an assignment I have done. \n\nEitherway, this  post is going to sink in the college reddit anyway.",
  "author": "FuckRNGsus",
  "created": 1638267487,
  "updated": 1638480494,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmnmxzw": {
      "link": "/r/college/comments/r5k9g4/struggling_in_first_year_college_subjects/hmnmxzw/",
      "text": "Hey, it's ok. I know it can be overwhelming, so it's good to take everything one day at a time. Maybe you could spend some extra time watching videos and using other resources to study for the subjects you are struggling with. Resources like Khan Academy and YouTube have videos that can help you learn Calculus, Chemistry, and Biology. Khan Academy is especially good for math because I used that to self-teach some calculus last summer.",
      "author": "Learner-Hardworker",
      "created": 1638276282,
      "upvotes": 2,
      "replies": {}
    }
  }
}