{
  "sid": "rdn2d1",
  "link": "/r/college/comments/rdn2d1/full_time_student_and_worker/",
  "title:": "Full Time Student and Worker?",
  "text": "im going to be moving back home to nyc in sometime 2023 for college (im finishing my associates at a community college bc it was cheaper) and i wanted advice from people who had gone through or is going through what i will do. im stressed about it all. i want my own place bc of medical reasons and my cat so ik im gonna have more to pay on my own. if theres any tips anyone has for doing it all on ur own/ working full time and being a full time student/ or just anything to help me get through things a little better it would be so appreciated",
  "author": "ironyandiconic",
  "created": 1639182781,
  "updated": 1639516689,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "ho270sx": {
      "link": "/r/college/comments/rdn2d1/full_time_student_and_worker/ho270sx/",
      "text": "With my undergraduate- I worked a full time job while going to school full time. At that time (2015)- I was getting paid 13 in an office, I could only afford one meal a day and sometimes not even that. I lived in a one bedroom that was 700 for rent, without anything included. The volume of work I was doing was manageable, because you get used to the routine (assuming you have the same work schedule every week). \n\nI often ask myself how I would have made it work during these times and with the current market and rent, especially in NYC- idk if it’s doable. The highest paying job I ever had was bartending- easily 200-300 a night and on a very busy beach bar. That’s probably the route I would take though it is extremely exhausting and hard work. I think you should look up the areas you’re interested in renting from and see if it is realistic. Sorry I really hate to be the asshole, but it is soo crazy out here rn. I feel so bad for everyone that has to rent rn (me included)- they are jacking things up so much. \n\nAnother option would be to take out the max amount of loans offered to you each semester. Your refund will give you a few thousand each semester if you do that. But I will warn you- this accumulates quickly and can be a huge burden. You may look into your career option offering loan forgiveness after 10 years of qualifying payments. If you call fafsa, they can be more specific. From what I know you have to work either for the government, in education, or for a nonprofit. \n\nGood luck to you. I hope the market settles down by that time for everyone’s sake.",
      "author": "Hot_tamami",
      "created": 1639184095,
      "upvotes": 1,
      "replies": {}
    }
  }
}