{
  "sid": "qctbeb",
  "link": "/r/college/comments/qctbeb/canceling_my_student_housing_contract_mid_year_do/",
  "title:": "Canceling my student housing contract mid year, do you think I will be successful?",
  "text": "I am highly unhappy at my current college. I’m currently living on campus, and my mental health is suffering horribly from being at this school. \n\nI live within a 30 minute commuter distance, and I live in a zip code that would qualify me for commuter student status, so my plan was to leave my residential housing and commute from home until I can transfer or allow my mental health to recover. \n\nI just submitted a housing cancellation request form to change my status by next semester, but i’m worried. My school has a very strict residency policy (pretty sure it’s mostly just to get more money) but I cited reasons for living within commuter distance and the well-being of my health as to why i’m cancelling my contract. \n\nI truly do believe I accomplish more schoolwork and feel more comfortable living back home, it’s been so hard to show up to class and turn in assignments on time since i’ve been here. \n\nDo you think this reason will be approved? If they deny me, i’m just going to petition the school board, it would make my school look horrible if they denied a student access to a situation that would allow them to thrive and achieve their best academic work.",
  "author": "sarcasticinterest",
  "created": 1634827219,
  "updated": 1634849237,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hhi9weh": {
      "link": "/r/college/comments/qctbeb/canceling_my_student_housing_contract_mid_year_do/hhi9weh/",
      "text": "What do you mean by school board? That doesn't sound like the college version.",
      "author": "Violet_Plum_Tea",
      "created": 1634833527,
      "upvotes": 1,
      "replies": {
        "hhibm87": {
          "link": "/r/college/comments/qctbeb/canceling_my_student_housing_contract_mid_year_do/hhibm87/",
          "text": "there is a Housing Contract Appeals Committee. Sorry. Shouldve phrased that better",
          "author": "sarcasticinterest",
          "created": 1634834201,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}