{
  "sid": "raprn8",
  "link": "/r/college/comments/raprn8/sexual_assault_academic_research_study_trigger/",
  "title:": "Sexual Assault Academic Research Study (Trigger warning included in the post)",
  "text": "Hello,\n\nThe  University of Utah is currently conducting a research study to help veterans who have experienced a sexual assault or an unwanted or uncomfortable sexual experience while serving in the military be better understood as they are working their way through college.  We know that these events affect the academic performance of college students.  This study aims to help better understand how these events may be affecting student veterans in their university studies.  It could be instrumental in helping our veterans succeed in their educational pursuits.  \n\nThe survey requirements are as follows:\n\n\\- Sexual Trauma\n\n\\- Enrolled in college in the last eight months\n\nAs a warning, the questions get quite detailed, which can be very triggering. At the bottom of every page, we have linked a helpline, and the individual taking this can stop at any time. (\\*TRIGGER WARNING\\* - An example of how explicit the questions can be is - \"A man put his penis into my vagina, or someone inserted fingers or objects into my vagina without my consent by…\" and then selecting if this was done by force,  threatening physical safety, coercion or by other means) Please remember you can stop this survey at any time, and please use the helpline link at the bottom of the page if you need support during this time.\n\nThank you so much for your willingness to share your story with us, and allow us to understand better the complexities that accompany sexual assault or an unwanted or uncomfortable sexual experience.\n\nHere is the link to the survey: [https://csbsutah.co1.qualtrics.com/jfe/form/SV\\_8eTymKlwKLwkB9P](https://csbsutah.co1.qualtrics.com/jfe/form/SV_8eTymKlwKLwkB9P)\n\nAdditionally,  each person who takes the survey will receive a $10 Amazon gift card. -  This is done by routing the individual to a different survey, so there is no way to link the person's answers to where the gift card can be sent.",
  "author": "KLC-55",
  "created": 1638848406,
  "updated": 1639517732,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {}
}