{
  "sid": "jdo0fd",
  "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/",
  "title:": "Anyone else keep missing that one weird AM due date assignment?",
  "text": "I would like to know the thought process behind setting a due date for 10:30AM. It seems like 95% percent of things are due at 11:59PM; and then I always have that one oddball due date time assignment every couple weeks. Are we doing me a favor with this? or what's the process? Simulating a \"class experience\". \n\n&#x200B;\n\nI've finally annotated my entire calendar, because I forget to read the times for all 4 or 5 things in the color coded square on any given day. Is this just me, anyone else getting burned on this one.",
  "author": null,
  "created": 1603054162,
  "over_18": false,
  "upvotes": 1273,
  "upvote_ratio": 0.99,
  "comments": {
    "g9dalk6": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9dalk6/",
      "text": "I just missed my pre-lecture quiz lol. I have no problem remembering stuff is due at midnight, but for whatever reason I forget mornings.",
      "author": "sleepy_scav",
      "created": 1603142180,
      "upvotes": 2,
      "replies": {}
    },
    "g9d4h7p": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9d4h7p/",
      "text": "got me once and then i started doing them right when they’re posted",
      "author": null,
      "created": 1603139136,
      "upvotes": 2,
      "replies": {}
    },
    "g9bxvhh": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9bxvhh/",
      "text": "just turn it in the night before..? i can’t imagine missing an assignment where your teacher actually lets you turn it in later than 11:59pm. that’s literally a free pass to wake up and turn it in if you forgot or wake up early and do it if you didn’t.",
      "author": "grubbycoolo",
      "created": 1603119768,
      "upvotes": 1,
      "replies": {}
    },
    "g9brj8v": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9brj8v/",
      "text": "YES! And it's literally just that one assignment from that one class! I just really have to remember to do it the day before. I hate that it cuts out an extra day of other studying/assignments I could work on.",
      "author": null,
      "created": 1603116904,
      "upvotes": 1,
      "replies": {}
    },
    "g9botbe": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9botbe/",
      "text": "My ochem lab quizzes and phys prelectures/bridge assignments. Every. Time.",
      "author": "dvdlbck",
      "created": 1603115557,
      "upvotes": 1,
      "replies": {}
    },
    "g9bgpzy": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9bgpzy/",
      "text": "The variant time may be e a mistake. Ask your prof. If it is a class they have used for some time, they might not realize that is how it is displayed in the course. It may have been changed accidentally at some point. I know from experience.",
      "author": "Piglet03",
      "created": 1603111150,
      "upvotes": 1,
      "replies": {
        "g9c02sn": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9c02sn/",
          "text": "I don't think it's in error. It was recently moved from a weekday to a Sunday morning. It is convenient, but if you forget it's a morning assignment it's easy to get the false impression you have 24hrs instead of 12hr.  After, reading over the posts, some professors see it as giving the max. amount of time. I think their intentions are good and I imagine it helps some students. It's just unfortunate that it seems to result in a blind spot for some of us. It would be nice if I could tweak Canvas to automatically load early morning assignments to the previous days line up.",
          "author": null,
          "created": 1603120727,
          "upvotes": 1,
          "replies": {
            "g9c59we": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9c59we/",
              "text": "I don't like anything in my courses to be confusing. Having a specific time all assignments are due seems basic to me. I also only have assignments due on certain days of the week (generally, M, W, F). I don't see any reason to make it hard to keep track of.",
              "author": "Piglet03",
              "created": 1603122950,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g9bg2yt": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9bg2yt/",
      "text": "one of my professors made a take home exam due at 6pm on a friday. like why not just make it 11:59 like everything else",
      "author": "bmoneyy5",
      "created": 1603110774,
      "upvotes": 1,
      "replies": {}
    },
    "g9bd46v": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9bd46v/",
      "text": "If something is due at any time other than 11:59am i just consider it due the prior day, unless its like a timed exam or something. \n\nI dont like that either- its confusing. \n\nI'm taking 18credits online this semester because I refuse to finish late....I'm so done with my bachelor but I'm a strong student. My advice to other students taking literally any online course is get a assignment notebook and write out due dates for all courses so you can keep yourself organized. Check all assignments before going to bed every night, make sure there's no surprises added.",
      "author": "yUmmmmmie",
      "created": 1603108873,
      "upvotes": 2,
      "replies": {}
    },
    "g9bb0k9": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9bb0k9/",
      "text": "Some professors have weird deadlines. During one semester of college, I took an education class that met from 9:30-10:45 AM on Tuesdays/Thursdays. My professor often decided that assignments were due at 9:30 AM on a Tuesday or Thursday (the class time). But then we never used the assignment in class. So there was no point in the assignment being due before class instead of after class. Some other assignments were due at weird times/days, like 9:30 AM on a Wednesday. We didn’t have class on Wednesdays, so I don’t know what the point was of having an assignment due at 9:30 AM on those days.",
      "author": "Fleur498",
      "created": 1603107118,
      "upvotes": 1,
      "replies": {}
    },
    "g9b75zy": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9b75zy/",
      "text": "Those due dates piss me off.",
      "author": "kang1227",
      "created": 1603103271,
      "upvotes": 1,
      "replies": {}
    },
    "g9b1yc6": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9b1yc6/",
      "text": "even better: those teachers that assign all the work at 10:30 on friday and expect it done by 9:00 that night",
      "author": null,
      "created": 1603097272,
      "upvotes": 3,
      "replies": {}
    },
    "g9awd12": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9awd12/",
      "text": "My professor has a Monday 8 am due date for work she assigns",
      "author": "xvxxv_",
      "created": 1603090932,
      "upvotes": 1,
      "replies": {}
    },
    "g9aw55y": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aw55y/",
      "text": "Came here to say that I got a 0 on an assignment randomly due at 1 pm and she wasn’t willing to accept any late work. Then her quiz is due at 5 pm. Like? Why do you have random times of the day when shit is due? I literally could have class at those times and have to remind myself that on a random day of the week, there’s something due at 1 pm. \n\n👺😤",
      "author": "Zahhhhra",
      "created": 1603090706,
      "upvotes": 1,
      "replies": {}
    },
    "g9avmg6": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9avmg6/",
      "text": "We have one at 6pm. Everyone else like you said have it 11.59 but he's like nah fam 6pm.\nI haven't missed it myself but a lot have",
      "author": "astonaidan",
      "created": 1603090173,
      "upvotes": 1,
      "replies": {}
    },
    "g9aso2z": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aso2z/",
      "text": "Turn in the assignment at 11:59 the night before it’s due. You don’t have to wait until the exact moment it’s due.",
      "author": "Opening_Doors",
      "created": 1603087278,
      "upvotes": 5,
      "replies": {}
    },
    "g9ariwc": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9ariwc/",
      "text": "My math professor said the 8am due times are for the night owls that could use a few extra hours to work, I was super against it at first for your reasons but once she explained it I kinda like it now. It'd definitely be a hassle remembering specific times if my other professors had the same mindset though",
      "author": "Gestice",
      "created": 1603086207,
      "upvotes": 3,
      "replies": {}
    },
    "g9ar0xw": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9ar0xw/",
      "text": "I've had my share of these. If it's due the next day, just make it due for yourself the midnight before the actual due date. Don't even focus on what they say the date is, just move it to the day before and knock it out.",
      "author": "thecaptain016",
      "created": 1603085750,
      "upvotes": 4,
      "replies": {}
    },
    "g9aokso": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aokso/",
      "text": "I have one teacher that keeps changing what day she wants things due. Some things it is Sunday before Monday class, other things it is 8 am on Monday for the 10 am class. I'm up late now because I'm having to write a stupid cover letter for job hunting.\n\nI'm employed by three places and have no plans on leaving my employers, in school full time, along with being a single mom to three teenagers. I literally have zero use for a cover letter and have no idea how to make it out so it will get a good grade.\n\nI'm writing it for after I graduate so I'm hoping that she will still give me good points on it.\n\nThis is the same teacher that wanted us to write a three page essay on what struggles and hurdles we have had to overcome to get to where we are in life. She said that we needed to be a specific as possible and that she wanted to know what we have gone through. I got a 100% on it, but the 2 weeks of really bad depression wasn't worth it.",
      "author": "quilterlibrarian",
      "created": 1603083606,
      "upvotes": 1,
      "replies": {}
    },
    "g9anl2j": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9anl2j/",
      "text": "If an assignment is due at 11.59pm, then the prof or TAs get tons of questions at 11pm, which they don’t often answer.   A due time of 10.30am allows for questions to be asked and responded to in a more timely manner.",
      "author": "imjustsayin314",
      "created": 1603082795,
      "upvotes": 1,
      "replies": {}
    },
    "g9alqhx": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9alqhx/",
      "text": "All of my class assignments are due on Sundays at 11:59. I took a 5 week class this semester and half of the due dates for that one were due Fridays at 11:59. \n\nDefinitely threw me off a few times and a couple times I ended up having to bang a paper out at 8 pm that night.  Fortunately they were all opinion papers, but still.",
      "author": null,
      "created": 1603081336,
      "upvotes": 1,
      "replies": {}
    },
    "g9alah3": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9alah3/",
      "text": "Better than having varying due dates for assignments in the same class from 10:30am, 1pm, 5pm, 6pm and 11:35pm the same day.",
      "author": "heyimbasic",
      "created": 1603080991,
      "upvotes": 1,
      "replies": {}
    },
    "g9al3w6": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9al3w6/",
      "text": "I hate the 10am due dates!! I never even wake up in time to finish it in the morning, so have started setting myself the due date of the night before",
      "author": "sashahf",
      "created": 1603080855,
      "upvotes": 3,
      "replies": {}
    },
    "g9ag96k": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9ag96k/",
      "text": "I had a due date of 7:30am on a Sunday about a month ago. It was just a 3/4 page reflection on the last few chapters we’d read.\n\nHe still hasn’t graded it lmaooo",
      "author": "TacoMedic",
      "created": 1603077589,
      "upvotes": 1,
      "replies": {}
    },
    "g9afte0": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9afte0/",
      "text": "My English professor makes everything due one minute before class, so 7:59am Monday, Wednesday, or Friday. I ignore that and pretend everything is due at 11:59pm the previous night. I think he does it that way because he normally has people turn things in on paper in class, but with Covid-19 he switched everything to electronic.\n\nEdit: just remembered one of my classes has everything due the following Monday at 6p, but I also always ignore that and make sure I have everything turned in by 11:59p Sunday.\n\nI also turn in assignments once I'm done with them rather than waiting until the due time. If that means I submit it five days early, I submit it five days early.",
      "author": "Moonstonemuse",
      "created": 1603077310,
      "upvotes": 1,
      "replies": {}
    },
    "g9aezmq": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aezmq/",
      "text": "This semester it's been helping. I'm a full time grad student during the week but my weekends are super busy bc every other weekend I work 12 hour days and the off weekends I usually have a ton of family commitments.\n\nThe reason this helps is because 90% of my assignments are due Sunday at 11:59, except the longest assignment I have every week (it takes a full day to accomplish every week, if not more) is due at 11 am Monday morning. \n\nThis means I can get a bunch of stuff done for Sunday, go to work on Sunday, take a 2 hour powernap and then use the night to get the paper done. I'm still usually done around midnight (assuming I finished the first half before Sunday/focus well), but it takes off a ton of pressure",
      "author": "skelechel",
      "created": 1603076780,
      "upvotes": 1,
      "replies": {}
    },
    "g9aeymm": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aeymm/",
      "text": "Try living in asia and going to school on the east coast. Most of my classes are at 4AM and assignments are due 1PM.",
      "author": "akira19999999",
      "created": 1603076762,
      "upvotes": 2,
      "replies": {}
    },
    "g9adwu1": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9adwu1/",
      "text": "one of my profs makes some of my assignments due at 9am and i didn’t know about it at first so imagine my surprised when i pulled up the assignment at 11:47am the day it was due only to find out it was already late 😭",
      "author": "donutcapriccio",
      "created": 1603076094,
      "upvotes": 4,
      "replies": {
        "g9afag6": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9afag6/",
          "text": "It's the worst feeling getting ready to take care of something and realizing you missed it. If they want to have a silent grace period for the overnight delivery crowd that's fine with me. But, it's the nature of having half standards I guess. I consider it part of the course \"challenge\" at this point. Nice not to suffer alone. Thanks for the comment.",
          "author": null,
          "created": 1603076972,
          "upvotes": 2,
          "replies": {
            "g9agq2l": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9agq2l/",
              "text": "the worst part is i panic emailed my prof to explain and she said it was okay that it was late. then my draft never got peer edited and i was like ?? and after i got a C on it she said it never got peer edited because i turned it in late 🥴",
              "author": "donutcapriccio",
              "created": 1603077885,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g9abxyb": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9abxyb/",
      "text": "When we first went online I had a professor who was a dept. head set most of his due dates to before class began at 9am. The next quarter I had a professor from the same dept set everything to due at 9am. I feel like they're either shooting for consistency, or sharing lesson plans without revising.",
      "author": null,
      "created": 1603074879,
      "upvotes": 1,
      "replies": {}
    },
    "g9abxi4": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9abxi4/",
      "text": "It may be that one instructor is following the administration's rules, whereas the rest are recognizing how bizarre that rule is and ignoring it. The Provost of my school insisted we set due dates during what would have been the face-to-face class periods for all courses that had been moved to a virtual format due to the pandemic. Most of us just decided to do whatever we thought was best for the students in spite of that rule.",
      "author": "blue_arrow_comment",
      "created": 1603074871,
      "upvotes": 4,
      "replies": {}
    },
    "g9aauqe": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aauqe/",
      "text": "I have one class that’s 5pm due dates and another that is 11:59pm and this post actually reminded me of that one as I have 1.5 hours left to respond to 2 people. Thank you OP",
      "author": "taffypulller",
      "created": 1603074215,
      "upvotes": 7,
      "replies": {}
    },
    "g9aar11": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aar11/",
      "text": "I ahve one class where the weekly quizzes and projects are due at 1pm right before the class. \nI actually really like it. Because I can work on the assignments the night before and have enough time to get everythinng done 🤷🏻‍♀️",
      "author": "lilysparkles23",
      "created": 1603074154,
      "upvotes": 4,
      "replies": {}
    },
    "g9aa880": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aa880/",
      "text": "You have to make your own deadlines. My deadline is always the 11 59 closest to the deadline. So that keeps everything in check and nothing gets crammed on one day. The reality is, its an illusion. They really want it at 11 59 pm the day before, but they set it to 10 30 so that if some students need it, they can stay up late and do it. The key is its there if you need it, not that you have to use it. When you get to college, you need to be able to do this because due dates will be random, like at 3 in the afternoon or other random times. A lot are due at 11 59, but a lot are also do when class starts, so you need to hold yourself accountable. In addition, if they were to make it due at 11 59, you would be losing 10.5 hours because they would not make it due that same day, but the night before. If you can't stick to that schedule, that's on you.",
      "author": "smartymarty1234",
      "created": 1603073846,
      "upvotes": 9,
      "replies": {}
    },
    "g9a6zxw": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a6zxw/",
      "text": "I have one that is due at 8 am. I just do it the night before because god knows I’m not waking up that early to finish an assignment.",
      "author": "tonicblitz",
      "created": 1603071913,
      "upvotes": 4,
      "replies": {}
    },
    "g9a6un1": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a6un1/",
      "text": "No I feel this! I had a test due at 9:35am and I thought it was due at 11:59 that night... when I tell you I was stressed, AND IT WAS A HARD TEST! Oof I was already calling my final grade, anticipating the disappointment, and then she just graded it as normal without a late penalty so you know... I’m now and forever turning in assignments the day before because I probably won’t get another chance like that ever again! And I’m also not telling her I turned it in late either 👀👀",
      "author": "Khunte99",
      "created": 1603071828,
      "upvotes": 3,
      "replies": {
        "g9cy44m": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9cy44m/",
          "text": "She was probably able to see that you turned it in late and was giving you leniency lol.",
          "author": "ThoughtCenter87",
          "created": 1603136251,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9a5ovt": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a5ovt/",
      "text": "Two questions:\n\n1. Are the times that are early always even, like 10:30am? Or are they sometimes like 10:27am?\n\n2. What LMS is this? Blackboard? Canvas? D2L?",
      "author": "chrisrayn",
      "created": 1603071156,
      "upvotes": 3,
      "replies": {}
    },
    "g9a5mv5": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a5mv5/",
      "text": "I do. I consistently have my class piano recordings due at 11am on Tuesday, which means I have to record them late at night after work on Monday :(",
      "author": "Ashes171",
      "created": 1603071123,
      "upvotes": 1,
      "replies": {}
    },
    "g9a5cu5": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a5cu5/",
      "text": "We assume you guys are going to stay up all night the night before doing it.",
      "author": "VROF",
      "created": 1603070960,
      "upvotes": 3,
      "replies": {}
    },
    "g9a3w6l": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a3w6l/",
      "text": "I have exams every two weeks for a class. They’re due at 6am on Saturdays and I was up until three on Saturday for the first one because I totally forgot that it was due then. For these weirdly scheduled exams, I try to set time aside in the week to specifically address them without forgetting they exist.",
      "author": "Icarus_Gold",
      "created": 1603070111,
      "upvotes": 3,
      "replies": {}
    },
    "g9a3t94": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a3t94/",
      "text": "Dude literally just had this problem. My bio professor had all his due dates at 11:59pm (like for the entire semester thus far) then this week for some reason he put it as 12:59am so I missed them.",
      "author": "deciduousdreamz",
      "created": 1603070064,
      "upvotes": 6,
      "replies": {
        "g9cxln5": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9cxln5/",
          "text": "It was likely a mistake.\n\nOne of my professors has assignments due at 12 pm sharp on Fridays, but a few weeks ago he accidentally made the assignments due at midnight on Saturday. He got several emails about it from students I guess because later that Friday evening he sent a very charged email saying \n\n\n\"I have opened up the assignments. Even though this entire year the assignments have been due at 12 pm on Fridays, and even though I sent you an email earlier this week saying they were due at 12 pm this Friday. I have re-opened the assignments.\"\n\n\nI recommend talking to your bio professor about that. 12:59 am (basically 1 am) is a very odd time to submit assignments at, and it's also just one hour after the normal due date. Many professors are having trouble adapting to the online format and I imagine if you talk to your bio professor about the odd due date he'll probably be lenient and may allow you to submit your assignments, especially because assignments have been due at 11:59 pm the rest of the year for you.",
          "author": "ThoughtCenter87",
          "created": 1603136016,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9a3kus": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a3kus/",
      "text": "In the homework software I’m using (WebAssign) the default is to set due dates relative to the time of the class. I always set them for 30 minutes before class so students have the maximum amount of time to get them done, but they won’t be late for class because they’re trying to finish. The assignments are all posted about a week ahead of time, so students can do them when it’s most convenient for them.",
      "author": "Act-Math-Prof",
      "created": 1603069930,
      "upvotes": 1,
      "replies": {}
    },
    "g9a35gr": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a35gr/",
      "text": "I know the feeling. I've got a professor with 5 AM due dates for assignments, which correlates into me finishing things at 3 AM.",
      "author": "The_Southstrider",
      "created": 1603069684,
      "upvotes": 5,
      "replies": {}
    },
    "g9a32mo": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a32mo/",
      "text": "Personally if I have any due date that isnt 11:59pm, like I have some assignments due at 8am, I just turn it in the day before so I’m never confused and never forget to turn it in",
      "author": "ElephantsRTasty",
      "created": 1603069639,
      "upvotes": 7,
      "replies": {}
    },
    "g9a27po": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a27po/",
      "text": "My one online class has the quiz due on Monday at 6pm and it doesn't open till 6am the same day and then we have our labs due at 6pm on Friday. Like wtf. I'm tired if it.",
      "author": "hair_of_fire",
      "created": 1603069142,
      "upvotes": 5,
      "replies": {}
    },
    "g9a1seu": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a1seu/",
      "text": "I have a thermodynamics quiz due every Tuesday and Thursday at 9:20 AM (10 minutes before lecture) but only becomes available at 12pm the previous day (mondays or wednesdays). I work 9-5 MWF and have classes Monday and Wednesday evenings so I ALWAYS forget to take this quiz. I think I have missed 4 quizzes because they’re at such an odd time that just doesn’t line up with my schedule at all.",
      "author": "msmechengineer",
      "created": 1603068902,
      "upvotes": 3,
      "replies": {
        "g9cyfcn": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9cyfcn/",
          "text": "Maybe you should talk with your professor about that and your work schedule. I don't understand why your professor would make the quiz available for such a short amount of time.",
          "author": "ThoughtCenter87",
          "created": 1603136395,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g9a10db": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a10db/",
      "text": "One of my professors has our assignments due “before dawn the next morning,” or “before I wake up and check my computer.” He’s a chill dude.",
      "author": "PhoenixorFlame",
      "created": 1603068450,
      "upvotes": 68,
      "replies": {
        "g9b3fe6": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9b3fe6/",
          "text": "Had her a while ago, but my psych 101 prof was like this.\n\n\"I'm not (usually) up at 2 am grading, why do you need it submitted by then?\"",
          "author": "grissomza",
          "created": 1603099008,
          "upvotes": 22,
          "replies": {
            "g9bzw1g": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9bzw1g/",
              "text": "I have a professor that I’m really close to and she’s great but she’s also a night owl so once in a while I’ll get waken up at 4 AM by canvas notifications 🤦🏻‍♀️",
              "author": null,
              "created": 1603120643,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g9b37ym": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9b37ym/",
          "text": "..... are you in my class, or do I have some long lost twin?",
          "author": "Eigengrad",
          "created": 1603098765,
          "upvotes": 7,
          "replies": {
            "g9d3nk5": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9d3nk5/",
              "text": "You must have a humanities-inclined twin because I am definitely not in any chemistry classes (I’m sure you’re great, though)!",
              "author": "PhoenixorFlame",
              "created": 1603138733,
              "upvotes": 1,
              "replies": {
                "g9eefsm": {
                  "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9eefsm/",
                  "text": "Siblin' from another discipline?",
                  "author": "Eigengrad",
                  "created": 1603164592,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g9a0sa2": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a0sa2/",
      "text": "I have a whiteboard up on my wall that spans the entire wall. I write all my weekly assignments on it with their dates and times in large lettering. I'm pretty much forced to look at it. \n\nRegardless, I still did miss an AM quiz I even wrote on that board. I guess my mind is used to seeing PM. \n\nSo now I write it due as 11:59 PM the day before to trick myself into thinking it's due earlier.",
      "author": "lullaby876",
      "created": 1603068321,
      "upvotes": 15,
      "replies": {
        "g9ab8nm": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9ab8nm/",
          "text": "[deleted]",
          "author": null,
          "created": 1603074452,
          "upvotes": 2,
          "replies": {
            "g9c82ya": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9c82ya/",
              "text": "One of them is. But then I don't have too much of an issue remembering because it's every Wednesday at 8 AM or whatever.",
              "author": "lullaby876",
              "created": 1603124165,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g9bjpx7": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9bjpx7/",
          "text": "I also have a white board that has also kept me on track and I have still missed assignments because professors assign them randomly instead of being consistent.",
          "author": "SweetTeaBags",
          "created": 1603112898,
          "upvotes": 1,
          "replies": {
            "g9c7xjc": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9c7xjc/",
              "text": "I got a notifier for my student email that alerts me when new assignments have been posted. I think you might be able to request one from the school somehow.",
              "author": "lullaby876",
              "created": 1603124100,
              "upvotes": 1,
              "replies": {
                "g9cafag": {
                  "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9cafag/",
                  "text": "Yeah they do for mine. Problem was the one important thing that I needed to do didn't have a notification so it wouldn't have done me any good. I apparently have to check in places I don't expect to see them in.",
                  "author": "SweetTeaBags",
                  "created": 1603125171,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g99zfj3": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99zfj3/",
      "text": "One of my class grades got fucked because of this, I thought it was due at midnight and it’s 7PM, what the hell? I wouldn’t mind doing it earlier but it wasn’t clear at all.",
      "author": "violet_skiesss",
      "created": 1603067535,
      "upvotes": 11,
      "replies": {
        "g9a690e": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a690e/",
          "text": "this happened to me too but it was due at 3pm. I've got an F+ in the class and if I don't pass it will genuinely throw my whole future plan off track.",
          "author": "iamfearformylife",
          "created": 1603071483,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g99zcbf": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99zcbf/",
      "text": "If they have a due date like that, I just make sure I do it by midnight the night before. Saves the hassle and you won’t be rushed all morning.",
      "author": "Salty_Average_9824",
      "created": 1603067484,
      "upvotes": 32,
      "replies": {}
    },
    "g99z8bd": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99z8bd/",
      "text": "LMAOOOO, one of my professors has his assignments due at 11:59 AM... like tf",
      "author": "C-CR7",
      "created": 1603067418,
      "upvotes": 44,
      "replies": {
        "g9a65l2": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a65l2/",
          "text": "looks like my mans forgot to change the AM to PM lol",
          "author": "iamfearformylife",
          "created": 1603071427,
          "upvotes": 39,
          "replies": {}
        },
        "g9ammtl": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9ammtl/",
          "text": "Yep... my fluids professor does the same thing",
          "author": "TheBravePaladin",
          "created": 1603082033,
          "upvotes": 7,
          "replies": {}
        },
        "g9biu67": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9biu67/",
          "text": "I actually know a friend who actually turned in his essay late because the due date was 11:59 am instead of pm",
          "author": "desertfox_JY",
          "created": 1603112420,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "g99z7dd": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99z7dd/",
      "text": "There's no one ideal time to have assignments due. Though a lot of us professors use 11:59. \n\nI used to use 5:00 p.m. for some classes, as it was the latest I wanted to wait for papers to come in, print them and go home (yes, I still print certain assignments before grading!) but there were enough complaints, so I started making everything due at 11:59 *the day before*.\n\nNo one complains, they are happy with the \"later\" time but they have no clue that assignments are actually now due 17 hours sooner than they need to be.\n\nSo, I guess I'd say, YOU can make your own deadlines for whatever time of day you want, it's just going to be sooner than the final deadline (which you should be avoiding almost-late submissions anyway, to give yourself a buffer).",
      "author": "Violet_Plum_Tea",
      "created": 1603067403,
      "upvotes": 169,
      "replies": {
        "g9b3dky": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9b3dky/",
          "text": "While she wasn't printing stuff, I really appreciated the one professor who had a Saturday 8 am due date.\n\nShe *SAID* her due date was Friday, \"but I'm *usually* not up at 2 am grading, so don't rush just to get it in. If you're a night owl I don't want you at a disadvantage.\"",
          "author": "grissomza",
          "created": 1603098946,
          "upvotes": 25,
          "replies": {
            "g9d2dzj": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9d2dzj/",
              "text": "That teacher deserves an award",
              "author": "malaphorism",
              "created": 1603138106,
              "upvotes": 3,
              "replies": {
                "g9dntp8": {
                  "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9dntp8/",
                  "text": "A year later, I had one that said 8 AM... so Friday 8 AM was legitimately that time. It's insane the difference psychologically that does to you.\n\nI was annoyed just for that fact, and it didn't help they graded so slow I legitimately could have still gotten a B or worse by the end of the class despite only getting A marks returned by finals week.",
                  "author": "grissomza",
                  "created": 1603149158,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g9aat77": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aat77/",
          "text": "I can’t do that. I work with pressure so have to wait the due date. :(",
          "author": "guevaraN",
          "created": 1603074190,
          "upvotes": 30,
          "replies": {
            "g9aitaj": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aitaj/",
              "text": "Procrastinators unite",
              "author": null,
              "created": 1603079252,
              "upvotes": 15,
              "replies": {
                "g9amar4": {
                  "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9amar4/",
                  "text": "..... tomorrow",
                  "author": "shouvikc206",
                  "created": 1603081771,
                  "upvotes": 29,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g99yicq": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99yicq/",
      "text": "I actually like things due in the morning cause it means you can pull an all nighter before its due.",
      "author": "pandolf86",
      "created": 1603066998,
      "upvotes": 19,
      "replies": {
        "g9adbse": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9adbse/",
          "text": "I was going to say this exact thing. I had a teacher who would make stuff due at like 8:30 am because he knew that some people would rather work all night while others would just get it done ahead of time.",
          "author": "Aralca",
          "created": 1603075731,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "g99xuch": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99xuch/",
      "text": "I have assignments oddly due at 3 and 4 in the morning.",
      "author": "pico_de_gall0h",
      "created": 1603066618,
      "upvotes": 26,
      "replies": {
        "g99yuet": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99yuet/",
          "text": "I like pairing this with the comment that said some teachers set the time to reflect when they like to grade the assignments.",
          "author": "InsaltedPretzel",
          "created": 1603067196,
          "upvotes": 29,
          "replies": {
            "g99yyc5": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99yyc5/",
              "text": "The same teacher then has assignments due at 6 and 11 at night.",
              "author": "pico_de_gall0h",
              "created": 1603067258,
              "upvotes": 16,
              "replies": {}
            }
          }
        },
        "g9axp1e": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9axp1e/",
          "text": "Those are nice because you can do them after the midnight ones.",
          "author": "big-b20000",
          "created": 1603092357,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "g99qyl7": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99qyl7/",
      "text": "For some reason this semester *all* my assignments are due at really odd times like this. I wish I understood why, it’s difficult to keep track of lol. If you can get it done the day before and just submit early that helps a lot, I know at least my brain is too accustomed to things being due at midnight so I try to simulate that.",
      "author": "TheConcerningEx",
      "created": 1603062531,
      "upvotes": 73,
      "replies": {
        "g9a0b3y": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a0b3y/",
          "text": "Mine too, I always have to triple check bc it will be like 2pm or 7:15 am like WHAT",
          "author": "pyjabanana",
          "created": 1603068048,
          "upvotes": 24,
          "replies": {}
        }
      }
    },
    "g99nmij": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99nmij/",
      "text": "My labs only meet every second week, one of my courses, the lab work is due the following week at the same time we would have had classes if we were meeting every week like we're supposed to. I just hand it in the day before, it's too risky that I'll lose track of time on the day.",
      "author": null,
      "created": 1603060631,
      "upvotes": 11,
      "replies": {}
    },
    "g99jmx5": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99jmx5/",
      "text": "The professor may have set the due time when it is convenient for them to grade. They could also set the time because that is when they are available for students who have last minute questions before submissions. They could also set it that time because 1) most students will wait until the last minute to submit and 2) most other classes will have the same deadline so they are tired of getting work for a different class submitted to them and then having to deal with getting it late etc.",
      "author": "DocLava",
      "created": 1603058398,
      "upvotes": 47,
      "replies": {}
    },
    "g99g4df": {
      "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g99g4df/",
      "text": "Do it the day before, my history teacher did this and it just cut out so much stress to get it done ahead. Personally he did it because our class met once a week in person at 12 pm (when he set the due date time) to avoid us chatting about answers and stuff like that.",
      "author": null,
      "created": 1603056502,
      "upvotes": 405,
      "replies": {
        "g9aabmx": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aabmx/",
          "text": "[deleted]",
          "author": null,
          "created": 1603073899,
          "upvotes": 59,
          "replies": {
            "g9acnvp": {
              "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9acnvp/",
              "text": "Same. I also set my class times as five minutes before they actually are so that I’m not late as often",
              "author": "carpe__natem",
              "created": 1603075326,
              "upvotes": 19,
              "replies": {}
            }
          }
        },
        "g9aonvp": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9aonvp/",
          "text": "This is great advice, especially right now where everything is online for most of us. If we get stuff done ahead of time it saves our ass if the internet goes down or the computer gives us the blue screen of death.",
          "author": "quilterlibrarian",
          "created": 1603083677,
          "upvotes": 7,
          "replies": {}
        },
        "g9a06y9": {
          "link": "/r/college/comments/jdo0fd/anyone_else_keep_missing_that_one_weird_am_due/g9a06y9/",
          "text": "As much as I'd like to do this, sometimes it's aost impossible to complete assignments the day before their due, whether it be due to job, other workload or simply just life deciding to flip me off.",
          "author": "CrazyTechq",
          "created": 1603067982,
          "upvotes": 41,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634057535
}