{
  "sid": "qc1tq3",
  "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/",
  "title:": "BSc vs BA in psychology",
  "text": "Uhmmm, can please anyone tell me the difference between these two. I am currently in my 11th grade in India and I hope to do my Undergrad from the UK. I am quite concerned about the difference between these two. I wanna know if the subjects change a bit or the salary differ..... Also which one needs more hardwork. Thank yall in advance!",
  "author": "Viking2149t",
  "created": 1634739245,
  "updated": 1634750239,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hhd8k7c": {
      "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhd8k7c/",
      "text": "Honestly, BA vs BS doesn’t make much of a difference. There is no standardization in the degrees or how people interpret them. Some school offer one or the other. Some offer both. You would just want to look at the course work requirements at a school to see which one would be better for you.",
      "author": "real-nobody",
      "created": 1634741375,
      "upvotes": 2,
      "replies": {
        "hhd8pap": {
          "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhd8pap/",
          "text": "So basically there's no difference in the wages????? Or the difficulty of the courses???",
          "author": "Viking2149t",
          "created": 1634741432,
          "upvotes": 1,
          "replies": {
            "hhdfeqi": {
              "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdfeqi/",
              "text": "Yeah. Pretty much. Some schools might have a BA that is identical to a BS at another school. If a school both, the BA might have more language requirements and the BS more other science requirements, or something like that. Usually though, it seems like schools just have one or the other. If you are at a school with both, you might pick a degree based on other required courses that interest you, or how well it fits with a minor or second major. Ive never heard of an employer or grad program caring what type of psych degree you have. I’m speaking from experience as a US psych professor, but I think it still holds true in the UK.",
              "author": "real-nobody",
              "created": 1634744190,
              "upvotes": 1,
              "replies": {
                "hhdfxvk": {
                  "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdfxvk/",
                  "text": "Wellll, tbh this comment makes so much sense rn and clears basically every single doubt that I had. Thanks!!!",
                  "author": "Viking2149t",
                  "created": 1634744408,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhdbeal": {
      "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdbeal/",
      "text": "It really depends on what you want to do with your degree after you graduate.\n\nBS degrees in PSY typically have more science/research requirements than the BA, so they can be helpful for students looking to become psychiatrists or go into research after graduation. \n\nBAs are typically fine if you’re considering getting a Master’s after graduation or if you’re going into a field that doesn’t require a Master’s. \n\nThe other commenter is right in that these programs aren’t standardized, what makes a PSY BA at one school might qualify as a PSY BS at another. \n\nAll colleges will have their major requirements listed somewhere on their websites, typically in a course catalog. You can compare different programs between colleges by finding these pages for each college.",
      "author": "apatheticpolliwog",
      "created": 1634742552,
      "upvotes": 2,
      "replies": {
        "hhdg39l": {
          "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdg39l/",
          "text": "Yeahh agreed, one last thing tho, I have taken Humanities, can I do BSc????",
          "author": "Viking2149t",
          "created": 1634744467,
          "upvotes": 1,
          "replies": {
            "hhdidpz": {
              "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdidpz/",
              "text": "It’s completely dependent on the school you are applying to. You’d need to contact the Admissions Office at each school to discuss that.",
              "author": "apatheticpolliwog",
              "created": 1634745388,
              "upvotes": 1,
              "replies": {
                "hhdj06v": {
                  "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdj06v/",
                  "text": "Got it, thank you so much for your time man! Have a good one",
                  "author": "Viking2149t",
                  "created": 1634745639,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhdd2q0": {
      "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdd2q0/",
      "text": "Hi there! As someone who started in a BS and switched to a BA I think I can help. There are a few course differences between the two. Those differences depend on the school. In my school, the BA required less math and science (4claszss) and added two semesters of foreign language and two other humanities. This of course will probably be a little different for you, my degree was stem so lots of science and math courses and again, it depends on what school you go to. You should be able to find degree outlines on the university websites that you can look at and email faculty and ask them for more clarification. I was able to Google median, average, and local salaries for BA and BS in my country to compare, BA seemed to make just a little bit left. Good luck!",
      "author": "homeforthelost",
      "created": 1634743245,
      "upvotes": 1,
      "replies": {
        "hhdgckd": {
          "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdgckd/",
          "text": "Thanks man! One basic conclusion is that BSc has more maths and science compared to what's taught in BA, right???",
          "author": "Viking2149t",
          "created": 1634744569,
          "upvotes": 1,
          "replies": {
            "hhdiaym": {
              "link": "/r/college/comments/qc1tq3/bsc_vs_ba_in_psychology/hhdiaym/",
              "text": "Yep! The reason being BS is a bachelor's of science, BA is a bachelor's or arts",
              "author": "homeforthelost",
              "created": 1634745357,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}