{
  "sid": "qecki1",
  "link": "/r/college/comments/qecki1/college_lowkey_sucks/",
  "title:": "College lowkey sucks",
  "text": "I have had a ton of trouble making friends. I’m a freshman and it’s been a real struggle making friends. It seems like everyone has a ton of friends and are always hanging out and doing thing. I live in apartment style dorm that open to the outside so I don’t really have neighbors that I see all the time and my roommates don’t ever do anything. I have joined clubs but I really haven’t met anyone I really connected with. I feel like it’s too late to make a friend group. Not really sure what to do because I have tried really hard to find people. Anyone have any suggestions?",
  "author": "Impressive-Win903",
  "created": 1635020071,
  "updated": 1635184569,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.9,
  "comments": {
    "hhs7bxe": {
      "link": "/r/college/comments/qecki1/college_lowkey_sucks/hhs7bxe/",
      "text": "College is a lot different than high school because in high school everyone talks, you make friends and joke around all day. In college it seems like everyone just wants to learn stuff from the class and GTFO. i’m guessing this is due to more mature people, more responsibilities and the fact that they are paying for classes and don’t want to fuck it up. I don’t really have any advice for you because i have a similar issue 3 years into college, i just want to let you know it’s not your fault",
      "author": "bdrummerj",
      "created": 1635022774,
      "upvotes": 9,
      "replies": {}
    },
    "hhsdhnn": {
      "link": "/r/college/comments/qecki1/college_lowkey_sucks/hhsdhnn/",
      "text": "It is definitely not too late, you meet new people every semester since you have different classes and people switch up their schedules. I found that finding people in your major is a good common starting ground to talking to them. Also try starting study groups with people too, cuz you end up talking about other stuff besides the material if you do it enough. Invite people for food or activities after studying.",
      "author": "NinjaLorian",
      "created": 1635025610,
      "upvotes": 3,
      "replies": {}
    },
    "hht0c8a": {
      "link": "/r/college/comments/qecki1/college_lowkey_sucks/hht0c8a/",
      "text": "i feel you. i had a lot of friends in high school & always had stuff to do but college is definitely a lot harder to meet people. i’m a sophomore in college rn and have literally 1 friend here. just keep being you and hopefully you’ll find your people. if your college has greek life i’d try that as a last resort. even if you have to pay for your friends at least you’ll have something to do on the weekends.",
      "author": "kimmygirl02",
      "created": 1635036293,
      "upvotes": 3,
      "replies": {
        "hhtv1o0": {
          "link": "/r/college/comments/qecki1/college_lowkey_sucks/hhtv1o0/",
          "text": "Greek life is not worth it given all the bad stuff that comes with it",
          "author": "ComprehensiveFeed56",
          "created": 1635052643,
          "upvotes": 2,
          "replies": {
            "hhuxvor": {
              "link": "/r/college/comments/qecki1/college_lowkey_sucks/hhuxvor/",
              "text": "that’s true i think it varies from college to college though. smaller schools who don’t have houses usually are more philanthropy based than partying",
              "author": "kimmygirl02",
              "created": 1635082114,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hhs9ccr": {
      "link": "/r/college/comments/qecki1/college_lowkey_sucks/hhs9ccr/",
      "text": "thanks",
      "author": "Impressive-Win903",
      "created": 1635023701,
      "upvotes": 2,
      "replies": {}
    },
    "hhsfrnj": {
      "link": "/r/college/comments/qecki1/college_lowkey_sucks/hhsfrnj/",
      "text": "I feel like everytime I invite people hangout they always deny me.",
      "author": "Impressive-Win903",
      "created": 1635026653,
      "upvotes": 2,
      "replies": {}
    },
    "hhwulra": {
      "link": "/r/college/comments/qecki1/college_lowkey_sucks/hhwulra/",
      "text": "Focus on school. If you want socialization, get a job/volunteer.\n\nFriends suck in college. Talk to your highschool friends instead. They actually care.",
      "author": "Positive-Court",
      "created": 1635111236,
      "upvotes": 1,
      "replies": {}
    }
  }
}