{
  "sid": "j4ghgh",
  "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/",
  "title:": "Does anyone else feel that the upside of this pandemic has been that anxiety and depression in students is now being recognized and taken more seriously by some schools?",
  "text": "I know people who didn't see these things as being \"real\" in students before the pandemic. It's sad that it took some people having to feel these things before they took the feelings of others seriously. I know students who struggled with having their health be taken seriously far before the pandemic. I've known students who formerly made fun of their classmates with social anxiety/who dreaded going to physical class, who now face severe anxiety with Zoom meetings and dread their own classes. It's been interesting to witness some of these shifts.\n\nAnd before anyone says \"not everyone\" didn't take them seriously-- I know. My school generously provided a wide variety of mental health services pre-pandemic.\n\nAt least now there seems to be an increase in offering of counseling, psychiatric services, more understanding for both students and staff, etc. I hope everyone has a better chance of getting help now, especially those who have been ignored and dismissed for so long before this pandemic ever happened.",
  "author": "petiterunner",
  "created": 1601737402,
  "over_18": false,
  "upvotes": 928,
  "upvote_ratio": 0.98,
  "comments": {
    "g7lwkoy": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7lwkoy/",
      "text": "Mine just got worse. Everything fucking sucks rn.",
      "author": null,
      "created": 1601781775,
      "upvotes": 1,
      "replies": {}
    },
    "g7krs8g": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7krs8g/",
      "text": "What are colleges supposed to do?",
      "author": null,
      "created": 1601767908,
      "upvotes": 0,
      "replies": {}
    },
    "g7kavlz": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7kavlz/",
      "text": "At my school, mental illness counts as a reason to get on disability. This is true for both anxiety and depression. My school has a counseling center which can refer you to disability for both mental illness and mental disabilities (learning disabilities, ADHD etc.). So it’s not that the professors are dealing with it, trained health professionals are dealing with it and then you can ask for accommodations from your professors backed up from those professionals. In fact, if you ask for accommodations and your professor ignores your request they can get in lots of trouble. I think this system works a lot better than just awareness.",
      "author": "femmulator",
      "created": 1601762003,
      "upvotes": 4,
      "replies": {}
    },
    "g7jluxv": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jluxv/",
      "text": "No. I’m being cynical here but I’m thinking the board told them to give a shit about it so students are encouraged to stay in school and not take a break during this time from anxiety related issues. It’s a scheme to keep paying overpriced tuition for online classes.",
      "author": "monsterdogtrex",
      "created": 1601753398,
      "upvotes": 11,
      "replies": {
        "g7jr9ne": {
          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jr9ne/",
          "text": "You are being cynical. That certainly didn't happen at my institution. Most professors actually do care about students.",
          "author": "whats_it_to_you77",
          "created": 1601755274,
          "upvotes": -1,
          "replies": {
            "g7kcgxe": {
              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7kcgxe/",
              "text": "oh oops. The professors care, they would do this regardless of covid at least at my school., the board doesn’t. That’s why I should’ve said that’s why they’re pushing it so hard, it’s the board to keep students coming.",
              "author": "monsterdogtrex",
              "created": 1601762538,
              "upvotes": 2,
              "replies": {}
            },
            "g7o7bwo": {
              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7o7bwo/",
              "text": "While this is true sometimes I can say my school really doesn’t. Most professors just post like 1-2 hour videos of them rambling and then say no notes on quizzes but remember everything in the video and the power point exactly. Then they put short time limits on tests so you can’t cheat but then also make the questions so specific that you can’t answer them without the book or looking directly at the professors notes.",
              "author": "AppleWatchSeries2",
              "created": 1601814779,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g7jjqu9": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jjqu9/",
      "text": "The upside of this pandemic is I know have an excuse to not visit my relatives",
      "author": "JonathanL73",
      "created": 1601752704,
      "upvotes": 0,
      "replies": {}
    },
    "g7jjfdc": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jjfdc/",
      "text": "What school are you from, my school only tool you serious if you provided a literal obituary, nothing less 😂 got a disability letter? Tough luck, you'll get shamed out of ever using it \n\nI'm glad some colleges are improving though. So tired of colleges valuing money over student health and safety.",
      "author": "insertoriginalnameee",
      "created": 1601752597,
      "upvotes": 11,
      "replies": {}
    },
    "g7jeb18": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jeb18/",
      "text": "Truth is my school had only cut down the art and pe sessions and gave us way more homework and exams and cut off marks for any tiny thing, which gave me more anxiety when I'm naturally anxious, I hate this :)",
      "author": "farah_24",
      "created": 1601750822,
      "upvotes": 6,
      "replies": {}
    },
    "g7jaq9n": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jaq9n/",
      "text": "that’s actually a really good point, I’d never thought of that and it helps to know that there are some good things about all this",
      "author": "succulent_samurai",
      "created": 1601749193,
      "upvotes": 3,
      "replies": {}
    },
    "g7j9l9y": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7j9l9y/",
      "text": "Eh, idk. I told my professor I was struggling after the death of a younger family member and she immediately told me about her dog dying and asked for a favor or two.",
      "author": "team_sita",
      "created": 1601748644,
      "upvotes": 19,
      "replies": {}
    },
    "g7j2rtg": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7j2rtg/",
      "text": "Yeah, I have no idea why they waited until a pandemic to address these issues. Students have always struggled with mental health issues, even before the pandemic. It's not new.",
      "author": null,
      "created": 1601744944,
      "upvotes": 8,
      "replies": {}
    },
    "g7j2823": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7j2823/",
      "text": "Zoom lectures are less anxiety inducing for me too, which is nice.",
      "author": "Elastichedgehog",
      "created": 1601744640,
      "upvotes": 15,
      "replies": {}
    },
    "g7izahx": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7izahx/",
      "text": "Yes definitely. I saw this news article recently about suicide rates and I was like \"Bitch where were you when three students committed suicide over student loans two semesters ago?\"",
      "author": "BecuzMDsaid",
      "created": 1601742993,
      "upvotes": 34,
      "replies": {
        "g7kru12": {
          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7kru12/",
          "text": "Out of genuine curiosity, how did they find out it was due to student loans?",
          "author": "theBlueProgrammer",
          "created": 1601767927,
          "upvotes": 5,
          "replies": {
            "g7la70v": {
              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7la70v/",
              "text": "The first was a medical student in her residency (she technically wasn't a student at our school and was just doing her residency at our school but she wasn't attending class at the MD she came from so I count her as a student) She apparently was struggling to keep up with her student loan payments and often discussed with fellow residents the stress it was causing her. She apparently didn't have strong family support and was apparently being mistreated by heads in the residency program and despite reporting the abuse several times according to one fellow resident who chose to keep their identity private in the article but was threatened to be kicked out of the program altogether and feared spending the next two years in rebound or having to drop out of med school altogether. She eventually ended up jumping off of a parking garage in broad daylight and I witnessed the suicide happen. \nThe next person was an MD student at the MD part of the university I attend. This one was more cut and dry as his new wife claimed it had to do with the student loans he had taken out and the stress they were under to make ends meet even almost losing their home at one point and how he often expressed feelings of guilt and how she would be better off if he was dead because the loans would be cancelled. He eventually took his life through the use of drugs. It was believed to have been an OD at first and reported as such until the wife came forward and confirmed it was a suicide. \nThe third dude I don't have a lot of information on but going on his social media pretty much confirmed it based on the stuff he was saying as well as the university's statement. Died from self inflicted gun shot wound.",
              "author": "BecuzMDsaid",
              "created": 1601773915,
              "upvotes": 22,
              "replies": {
                "g7m32kq": {
                  "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7m32kq/",
                  "text": "That is horrible ... Student mental wellness is definitely something that should be made more aware, especially with students showing any signs. I'm fortunate that I don't really experience any serious mental detriment myself, but I see posters and signage around my school that discusses student suicide / mental detriment, and I'm glad they are at least making some attempt to spread awareness and offer assistance.",
                  "author": "theBlueProgrammer",
                  "created": 1601784142,
                  "upvotes": 7,
                  "replies": {
                    "g7mfjkj": {
                      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7mfjkj/",
                      "text": "Worst part is the school tired to cover all three of these up and they only gave the first one a bunch of attention because it happened in the middle of the day in a public place on a school day.",
                      "author": "BecuzMDsaid",
                      "created": 1601788661,
                      "upvotes": 7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g7iz5vl": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7iz5vl/",
      "text": "Yea i agree, i think most importantly the PROFESSORS are starting to take that into consideration at least at my school. I remember i was extremely depressed like 2 years ago and my profs didn’t really care so i failed but now they’re acknowledging it at least.",
      "author": "brainperm",
      "created": 1601742919,
      "upvotes": 72,
      "replies": {}
    },
    "g7iyu6p": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7iyu6p/",
      "text": "(I’m a junior that’s fully online) Currently in the hospital due to anxiety. This condition can get bad when left untreated. Don’t wait if you feel you need help. Call a counselor, get in touch with your doctor, anything you feel might be helpful. Take care of yourselves.",
      "author": "amandast4",
      "created": 1601742731,
      "upvotes": 51,
      "replies": {}
    },
    "g7ixj67": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7ixj67/",
      "text": "It's not colleges don't see these problems as \"real\"--it's that colleges can't intervene in your mental health. That's not the job of administrators and faculty; you're an adult and your mental health is up to you.\n\nYou want to be very careful about insisting that college play a role in therapy decisions. It's one thing to recognize anxiety and depression; it's another thing for a college to begin pigeonholing and mandating treatment, counseling, etc. \n\nUltimately, it's good to recognize that students have mental health issues. It is bad, however, to get too heavily involved in this domain. Administrators, unless they are trained social workers, psychologists, or psychiatrists, have zero business in the mental health industry.",
      "author": null,
      "created": 1601741983,
      "upvotes": 18,
      "replies": {
        "g7izqju": {
          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7izqju/",
          "text": "It’s not that colleges don’t see it as real, it’s just that they don’t do *anything* academically to help unless you’re on disability. Actually encouraging faculty to be empathetic of mental health issues instead of hard asses who invalidate them as failure or weakness is not overstepping. I’m yet to see an admin pretend to be a therapist, but I’ve finally seen professors encourage students to be open if they’re having a difficult time, loosen up a couple strict stressful policies, and post resources for help.",
          "author": "whythenegativityman",
          "created": 1601743251,
          "upvotes": 41,
          "replies": {
            "g7jce6w": {
              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jce6w/",
              "text": "Same experience here. It’s been a massively positive shift and great to see more empathy be extended. I haven’t seen any overstepping yet, only my university providing help by people who are appropriately certified to do so, so I have nothing but positive feedback to give.",
              "author": "petiterunner",
              "created": 1601750000,
              "upvotes": 5,
              "replies": {}
            },
            "g7j30ze": {
              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7j30ze/",
              "text": "College isn't easy and it's not supposed to be easy. You've got to learn how to handle your own problems and face them head-on. Believe me, other people in life won't be sympathetic to your needs and colleges are actually incredibly tolerant of these problems. \n\nAs a lecturer, I recognize legitimate medical needs. Someone saying they're having a tough time coping, however, is work for a therapist. Further, I'm a psychology lecturer (in addition to other areas) and know my bounds; I'm not about to let someone try to bamboozle me for a grade or more time just because times are tough. \n\nAt some point, the training wheels must come off...",
              "author": null,
              "created": 1601745086,
              "upvotes": -11,
              "replies": {
                "g7j40rr": {
                  "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7j40rr/",
                  "text": "I’m doing therapy and am on medication for anxiety disorder. I face my problems every day but sometimes it does get too much and it really helps when professors are understanding about it. I never use my anxiety as an excuse, but it is hard that regards to getting help for my anxiety in an academic setting I’m screwed because it isn’t a disability. Mental health isn’t as simple as “taking the training wheels off” as you put it.",
                  "author": "Avondran",
                  "created": 1601745638,
                  "upvotes": 17,
                  "replies": {
                    "g7j510m": {
                      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7j510m/",
                      "text": "No, legitimate mental health isn't something simple. Believe me, I know better than you. \n\nHowever, the number of people who come to me with bogus sob stories about how \"they're having a rough time\" and \"can I get an extension on this project I should've been working on for the past two months?\" drive me up the wall. It abuses the system and makes it difficult to help people with actual problems. \n\nIf you have a legitimate diagnosis, there are ways to let the college and faculty know so that they can actually work with you. But expecting the entire institution to change just because \"times are tough\" is to demand that the world change and it simply won't--ever. Anxiety and depression are real, but people abuse the terms and toss them about expecting others to feel sympathy for them. \n\nIf you have a diagnosis, your college will have an office to help you. If you are just expecting your instructors to take you at your word and give you special privileges WITHOUT having a diagnosis, be prepared to be told \"No.\"",
                      "author": null,
                      "created": 1601746189,
                      "upvotes": -9,
                      "replies": {
                        "g7kva74": {
                          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7kva74/",
                          "text": "Huh, no wonder Psychology majors have such a bad reputation.",
                          "author": "theBlueProgrammer",
                          "created": 1601769134,
                          "upvotes": 7,
                          "replies": {
                            "g7kzolm": {
                              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7kzolm/",
                              "text": "Huh. No wonder you whinging little brats need your hands held for everything.",
                              "author": null,
                              "created": 1601770562,
                              "upvotes": -1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g7keklx": {
                  "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7keklx/",
                  "text": "how can you be a psych professor but still not recognize debilitating mental illness as a legitimate medical concern? sounds like you didn't actually take anything relevant away from your psychology education. i think you might be in the wrong field",
                  "author": "lyndsay0413",
                  "created": 1601763290,
                  "upvotes": 8,
                  "replies": {
                    "g7kif36": {
                      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7kif36/",
                      "text": "I don't recognize people's claims to having an illness without a notice or a note. What you don't seem to grasp is that, every stinking term, some clown thinks they can waltz in, say, \"I'm just so overwhelmed!\" and that I'm supposed to fall into line and let them not take a final, or turn in a project, or otherwise give them a grade they haven't earned. \n\nThe truth is, universities have a system in place to handle people who have legitimate diagnoses. They receive support. Just because I teach psychology doesn't mean I'm going believe any damned sob story that someone cares to vomit on my shoes when they just don't want to do the work. And yes, that is far more common that students who have actual serious problems. \n\nAs for your assessment of my line of work: step off and keep on steppin', sweetie. Better minds than yours gauged my work.\n\nWhinging about emotional needs is all-too-common today. It's doubly so in the psychology department where students erroneously believe I can't spot fraud from a mile away. If a student has a diagnosis, and if they've handled it the right way, I'm able to find out (though not what the specific diagnosis may be). \n\nIn my more-than-a-decade's experience teaching, I've encountered one person with a legitimate medical reason to postpone, delay, or otherwise qualify for special consideration--and she had given birth the week before. Otherwise, I've encountered a lot of liars and excuse makers who just think that, if they maintain the charade, I'll knuckle under and give them a charity grade. News flash: Those I's turn into F's in a term.",
                      "author": null,
                      "created": 1601764640,
                      "upvotes": 2,
                      "replies": {
                        "g7kldhn": {
                          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7kldhn/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1601765653,
                          "upvotes": 2,
                          "replies": {
                            "g7koq5u": {
                              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7koq5u/",
                              "text": "Yes. The Dean of Student Services where I work. There's an Office of Disabled Student Services that handles these things (very tactfully) and if a student with a diagnosis is having a problem, all I have to do is log into our reporting system, pull up the roster, and there's a flag by their name. I even get a preemptory email if a student in my class is flagged (though I check the roster, anyway, because emails can be forged and the report is a batch process).\n\nI've never worked in this office, but I do know they have a physician, a nurse practitioner, a clinical psychologist, and a social worker on staff / retainer. In essence, there's a system in place that is very reliable. They work with our infirmary to make sure that vulnerable students are taken care of and faculty know when we need to give special consideration for things. (I often see flags, but only student has told me she needed special consideration. Unless a student tells me they need to use that special flag, I don't make an exception because that's stigmatizing and unethical).\n\nMy problem with the initial post and the responses I've received (barring your own) is that it perpetuates the perception that colleges don't accommodate the psychiatric needs of their students--they do. But I've seen this from both ends (as a student with a legitimate neurological diagnosis and as a lecturer dealing with students) and I'm not impressed with the rhetoric on display here. \n\nA new maxim is emerging in psychology: \"Everybody wants a diagnosis until they get one.\" That is, we hear things all the time that simply aren't true. Mental illness isn't fun and I take a very dim view of malingering. One term, I had one young woman tell me that she suffered from \"both dissociative identity disorder and multiple personality disorder\" when, in truth, MPD is no longer in the DSM and DID covers MPD now. Moreover, she gleefully asked if I wanted to meet one of her alters--I almost hit the roof because people with DID never brag about it and are often ashamed to have it. Further, the ability to summon an alter isn't something someone with a recent diagnosis can do; that comes with decades of therapy. \n\nQuite honestly, if people think colleges aren't taking the mental health of their students seriously, they either don't have a legitimate diagnosis or they've made no effort to access the services that are available to them.",
                              "author": null,
                              "created": 1601766825,
                              "upvotes": 3,
                              "replies": {}
                            },
                            "g7mexu5": {
                              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7mexu5/",
                              "text": "Yes. Students with serious mental health issues are encouraged at the start of their first term (and we have a mandatory orientation course that covers it extensively) to interact with the disabled student services office. Those who follow these instructions find a lot of valuable resources at their disposal including on-campus counseling.\n\nAll universities and colleges in the United States are required by federal law to make accommodation for students with disabilities including mental health issues. No university or college can ignored this mandate and no university does. Even if you attend an online school, they have to make accommodation for you if you have some disability that would prevent you from meeting requirements in a timely manner. \n\nSo this whole thread is really quite the sham. No college or university in the US has ever ignored or downplayed legitimately diagnosed anxiety, depression, or other mental illness. The truth is, though, that we get a lot of students trying to abuse the system.\n\nFurther, both anxiety and depression are over-diagnosed in the United States where a cottage industry has been established that hands out benzodiazepines and antidepressants as if they were Pez. While I'm a big fan of properly prescribed medication, I'm not entirely sure that entering college is the right decision for a young person with a legitimate diagnosis of either of these illnesses. \n\nThe abuse of psychiatric medications on college campuses is a quiet epidemic that will eventually come to light in the popular media. Many students who don't need antidepressants seek them out for the cognitive edge they can grant; students who do legitimately need meds often stop taking them. The theft of psychiatric medication in dormitories is another major issue. \n\nIf some young person had a legitimate diagnosis of either anxiety or depression, I would urge them to take a year or two off between high school and college in order to develop good habits with their medications and to minimize reliance on medication by actively pursuing other interventions that can reduce or eliminate the need for such things (cognitive behavioral therapy does wonders for both anxiety and depression and is worth the effort; learning how to control negative thought patterns can and will alleviate a lot of problems).",
                              "author": null,
                              "created": 1601788463,
                              "upvotes": 1,
                              "replies": {
                                "g7mka72": {
                                  "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7mka72/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1601790466,
                                  "upvotes": 2,
                                  "replies": {
                                    "g7mmimd": {
                                      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7mmimd/",
                                      "text": "Ack. It appeared in my feed twice, but I've been having serious issues with reddit lately.\n\nEDIT: Yes. The \"mental illness is a badge of honor\" thing is becoming more and more common. Having encountered factitious disorder, malingering, and even pathological lying, I'm more inclined to believe that most people with a diagnosis will experience some form of stigma over boasting about their problems.",
                                      "author": null,
                                      "created": 1601791305,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "g8aszcc": {
                          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g8aszcc/",
                          "text": "late reply, but just want to point out that depression & anxiety are literally at an all time high in my generation, especially since lockdown started, which i believe is largely responsible for \"whining about emotional needs being all too common today.\" i also want to point out that not having a diagnosis does not mean that their symptoms are not legitimate. mental health services are expensive as f and a lot of people can't afford to see a psychiatrist & get diagnosed. just because i'm fortunate enough to have parents that got me help early on, doesn't mean that my less fortunate peers are any less deserving of empathy & understanding. there's absolutely no need for you to be so incredibly condescending & invalidating. mental health is as important as physical health & it needs to be taken seriously, and it's very clear from this thread that you do not take it seriously. calling your students who have been open & honest with you about their mental health struggles \"liars\" and \"excuse makers\" is SO shitty. you're adding to & perpetuating a stigma that people have been fighting for years to overcome. do you know how difficult it is to open upto a professor about that stuff?? i don't doubt that you come across plenty of students that are lying and making stuff up to get a free pass on late work, but i also have no doubt that you're disregarding students who legitimately need help & are trying their best.",
                          "author": "lyndsay0413",
                          "created": 1602320190,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "g7lbftc": {
                      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7lbftc/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1601774390,
                      "upvotes": 2,
                      "replies": {
                        "g7lbs73": {
                          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7lbs73/",
                          "text": "right!! you would think somebody who works in psychology would understand & have empathy for people who suffer from mental illness, but instead they're helping perpetuate the stereotypes that mental illness isn't serious & that it's just an excuse to get out of doing work",
                          "author": "lyndsay0413",
                          "created": 1601774538,
                          "upvotes": 2,
                          "replies": {}
                        },
                        "g7lulzy": {
                          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7lulzy/",
                          "text": "How have you gone from a senior in microbiology taking gen chem (which in itself doesn't make sense to be taking gen chem as a senior), to being in PA school, to be practicing in the medical field all within the 1 month i've seen you posting here?\n\nNormally I don't care or even notice these things but parading as a medical professional is pretty questionable. Even on reddit.",
                          "author": "siltyclay_clayeysilt",
                          "created": 1601780930,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g7jf1vh": {
                  "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jf1vh/",
                  "text": "I know college isn’t supposed to be easy, I’m in one of the hardest majors in my school, but the “real world” that it prepares you for isn’t anything like college. My internships in the field and the work I see the full time employees doing is totally different than my course load and day to day life. My mental health issues didn’t impede with my work and I was very productive and helpful at my jobs. I’m tired of professors saying “the real world is mean!” when it’s people like them that make it that way, I’ve learned the most and performed the best in classes where professors are empathetic or generous because that actually makes learning enjoyable instead of just a perpetual state of stress.  \n\nAlso I am getting professional help and working on my mental health (as are many struggling college students who can afford it) but if I waited until I was perfectly mentally healthy to do anything with my life I would never go to college, get a job, or be a productive member of society.",
                  "author": "whythenegativityman",
                  "created": 1601751073,
                  "upvotes": 9,
                  "replies": {
                    "g7jgtfq": {
                      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jgtfq/",
                      "text": "Funny how it's now all about YOU when it was about the failure of colleges to handle the general problem of students' mental health. Narcissism, much?",
                      "author": null,
                      "created": 1601751683,
                      "upvotes": -6,
                      "replies": {
                        "g7jjbz7": {
                          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jjbz7/",
                          "text": "I'm stepping in, because this is ridiculous.\n\nYou’re strawmanning severely throughout this entire thread. I said it was nice colleges **recognized** mental health and that services were being **offered**. You responded with the insinuation that I was **insisting** colleges do x and that it was not good for colleges to **mandate** and **pigeonhole** treatment, none of which anyone has even remotely alluded to or stated in this thread. \n\nThe second person you responded to stated faculty being empathetic was not overstepping. You responded by going off on a tangent about how \"college isn’t supposed to be easy\". That person did not even remotely insinuate that college was supposed to be easy.\n\nThe third person you responded to stated they never use their mental health as an excuse, but that they appreciate professors being understanding. Then you strawmanned again. They did not even remotely allude to \"expecting the entire institution to change\". I’m not sure how you initially related that to the person you were responding to. Now you're spinning their post as being \"narcissistic\" when you baited them into speaking more about themselves when you responded to them with several \"you\" statements (\"You've got to learn how to handle your own problems and face them head-on\"). I gave you the benefit of the doubt at first because I thought you might just be generalizing a \"you\" statement, but your comment I'm responding to proves you're not deserving of the benefit of the doubt anymore.\n\nYou seem to be responding to each person with your own frustrations as a professor instead of taking their comment or post at actual stated contribution. You are misconstruing comments and using them to go off on your own \"life ain't easy\" points when those are not the points being made to begin with. A lot of your points would be fine if you made them without strawmanning, but it's hard to want to discuss anything with you when you're severely taking things out of context. As a result, I'm disabling inbox replies on this one, but I'm hoping other people see how ridiculous your comments are as well.",
                          "author": "petiterunner",
                          "created": 1601752565,
                          "upvotes": 12,
                          "replies": {
                            "g7jkhay": {
                              "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jkhay/",
                              "text": "[removed]",
                              "author": null,
                              "created": 1601752943,
                              "upvotes": -2,
                              "replies": {
                                "g7lyhba": {
                                  "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7lyhba/",
                                  "text": "How about you piss off bucko? OP is absolutely right.\n\nYour the one throwing a temper tantrum like a manchild, and it’s obvious you got problems in the head too with your lack of empathy. And the nerve to call someone a narcissist *projection much?*, because your obviously the one with NPD in this situation.\n\nI see right through assholes like you. So to everyone this poster has offended, including OP, take refuge in this\n\nThis asshat is only stuck lecturing and is bitter because he/she knows they went into the wrong profession. They realized psychologists really shouldn’t be getting a power trip from ripping down patients, they realized they couldn’t control their patients lives by enforcing their rules and horrible perceptions and advice on to them. So they probably tossed their hands up and never got licensed\n\nOr they refused to go to therapy themselves which is a requirement for most master degree programs\n\nOr any clinic they did try and do hours at for their license kicked them to the curb the moment they realized who this poster really was, a bully and a raging, abusive, narcissistic asshole.\n\nAnd to you, I hope you never, ever get licensed to practice, your a disgrace to the profession of psychology due to your lack of empathy for people who claim to be suffering. Your the type that turns people who need help away from seeking it. Your looking for a power trip, and that’s it.\n\nSo again I say to you, kindly piss off.",
                                  "author": "Angel_Piper",
                                  "created": 1601782500,
                                  "upvotes": 4,
                                  "replies": {
                                    "g7mbk8p": {
                                      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7mbk8p/",
                                      "text": "[removed]",
                                      "author": null,
                                      "created": 1601787263,
                                      "upvotes": 0,
                                      "replies": {
                                        "g7oq8jg": {
                                          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7oq8jg/",
                                          "text": "I’m not dumb, every professor I’ve had will tell you otherwise, I’m not perfect, but I work hard. Also I’m smart enough to see through what you typed. You were expecting anxious pushovers on this thread not someone with a spine.\n\nI’m not bratty, I’m telling the hard truth to you. It hurts I know, but you came on here and acted, to use your words “like a brat”\n\nAnd little girl? Really? I’m 20 not three, I’ve dealt with people like you for years because I was in the same spot as the other posters you responded to, and people like you love to push people around and abuse them or treat them like garbage. Do you refer to every female with a mental/neurological/learning issue/ or who is generally “having a rough time” in your class like that? If you call them little girls that is a way to Infantilize people, it’s another narcissistic tactic by they way, you’ve been showing us you have a lot of those, you should see it but you really seem to be ignorant to it.\n\nI think your just throwing a bratty temper tantrum because you got called out on your shit behavior, and your not getting bowed down to or getting respect from people here. You’re certainly not getting it from me because I don’t recognize you as an authority figure, I don’t have to.\n\nTo get respect you need to give it, It goes both ways. Real leaders and respectable professors/ TA’s don’t need to call people “little girls” and “dumb brats”. You don’t deserve respect, at least not here, and true respectable leaders don’t play the vicitim, like you seem to be doing with your anger (which most of the time is hiding emotions like shame, guilt, or embarrassment)\n\nSo if respect was what your looking for, maybe you should’ve thought of that at the beginning and treated people commenting here with it and had a little bit of empathy. But you didn’t, you assumed, you made an arse out of yourself, and now people are calling you on it.",
                                          "author": "Angel_Piper",
                                          "created": 1601824350,
                                          "upvotes": 4,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                },
                                "g7jnq2z": {
                                  "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jnq2z/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1601754056,
                                  "upvotes": 1,
                                  "replies": {
                                    "g7jq82c": {
                                      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jq82c/",
                                      "text": "Nobody has offered any evidence of \"debilitating mental illness\" here--just their own avowed self-diagnoses. Get over yourself, child.",
                                      "author": null,
                                      "created": 1601754912,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "g7jmgie": {
                          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jmgie/",
                          "text": "huh? The topic is how colleges handle mental health issues so I’m sharing my relevant experience as a college student with mental health issues. I hope you don’t think every mentally ill person who shares their experience is narcissistic, otherwise I feel sorry for the patients you deal with in your field.",
                          "author": "whythenegativityman",
                          "created": 1601753603,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g7iq26b": {
      "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7iq26b/",
      "text": "[deleted]",
      "author": null,
      "created": 1601737752,
      "upvotes": 158,
      "replies": {
        "g7iq6gh": {
          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7iq6gh/",
          "text": "That's a great point. I've noticed a huge shift in that area too, and I really appreciate it. It really is time more recognition was given.",
          "author": "petiterunner",
          "created": 1601737824,
          "upvotes": 31,
          "replies": {}
        },
        "g7jed2t": {
          "link": "/r/college/comments/j4ghgh/does_anyone_else_feel_that_the_upside_of_this/g7jed2t/",
          "text": "You’re right it is about time even for the abuse. It’s just sad it took a pandemic for them to recognize this.",
          "author": "Scarlaire",
          "created": 1601750843,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050704
}