{
  "sid": "qu7vyd",
  "link": "/r/college/comments/qu7vyd/does_college_dining_food_really_make_you/",
  "title:": "Does college dining food really make you gassy/poop more?",
  "text": "Hi everyone, I know this seems like funny/stupid question but I’ve read a bunch of things about how crappy the food is and how bad of an effect it’s had on peoples stomachs. \n\nI’m a senior in high school now and am currently looking at colleges to attend. So far the ones I’ve been accepted to have dining halls and from what I’ve read, it makes people poop, like a lot. Im planning on rushing a sorority too and if I get into a house, I really don’t want to spend my time actively blowing up the bathrooms because of the dining hall food. \n\nI want to see anyone has experience with this because if I’m going to be walking around like a bloated balloon farting until I shit for the 3rd time that day, I’ll skip on the dining hall and just go buy food from outside. I’d prefer not to crop dust the university and other students. \n\nSeriously need advice because I’d be mortified if I kept blowing up my dorm bathroom/sorority’s bathroom.",
  "author": "TroubledBlondie",
  "created": 1636949995,
  "updated": 1637181554,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hkomcpr": {
      "link": "/r/college/comments/qu7vyd/does_college_dining_food_really_make_you/hkomcpr/",
      "text": "honestly depends on your school and your body frankly. however, if it is something about your school at least you wont be the only one holding on to that toilet LOL. i think people make it sound way worse than it is though you’re not gonna be having emergency bathroom issues unless you have preexisting medical conditions.",
      "author": "thomasshclby",
      "created": 1636951539,
      "upvotes": 3,
      "replies": {
        "hkoto3k": {
          "link": "/r/college/comments/qu7vyd/does_college_dining_food_really_make_you/hkoto3k/",
          "text": "I have IBS so it seems like it could make things worse than they already are. I’ve sorta been eating good right now since I’m home but it’s not full proof. Sometimes my anxiety can cause it to flare up which I know is going to be worse in college so I’ll have to figure out how to manage it. \n\nI asked because off campus food can be pretty expensive and the meal plan seems better financially.",
          "author": "TroubledBlondie",
          "created": 1636955986,
          "upvotes": 1,
          "replies": {
            "hkpoz0n": {
              "link": "/r/college/comments/qu7vyd/does_college_dining_food_really_make_you/hkpoz0n/",
              "text": "If you've got access to a kitchen, it will be absolutely cheaper to buy groceries instead of the meal plan. The meal plan includes labor and utilities to make that food for you, it will be more expensive with lower quality food. \n\nI'm a vegetarian and I live in the sticks. I prepare 95% of all of my own meals. Buying whole foods is by far the cheapest way. Processed boxed meals are more expensive than real food. I buy a 50 pound bag of flour for 25 bucks which equates to 50 cent loaves of bread that are twice the size as store bought and a zillion times better. If you have access to an oven, making bread is so easy. I purchase old fashioned oats in bulk as well, they are incredibly healthy and easy to prepare. \n\nIf you have a kitchen, I'd seriously consider learning to cook if you can't already. It saves my partner and I a ton of money to take control of our own food. Plus, it's much healthier than anything we can buy.",
              "author": "Awkward_Mail_2786",
              "created": 1636980173,
              "upvotes": 2,
              "replies": {
                "hkrxkud": {
                  "link": "/r/college/comments/qu7vyd/does_college_dining_food_really_make_you/hkrxkud/",
                  "text": "This sounds like a great idea! The college I’m looking at does have a kitchen in the dorm so it should be easy for me to cook in. \n\nAlso, where do you buy Whole Foods like that from? Really the closest organic grocery store nearby would be an Aldi, the others are normal grocery stores with mostly packaged goods.",
                  "author": "TroubledBlondie",
                  "created": 1637014231,
                  "upvotes": 1,
                  "replies": {
                    "hks4jqt": {
                      "link": "/r/college/comments/qu7vyd/does_college_dining_food_really_make_you/hks4jqt/",
                      "text": "Anywhere has whole foods. It's just avoiding anything that's had pretty much any processing. \n\nEven Kroger is sufficient for the most part. \n\nI do buy my bulk stuff through GFS and other places. Start calling around, you'll find it.",
                      "author": "Awkward_Mail_2786",
                      "created": 1637017112,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hkqe7d6": {
              "link": "/r/college/comments/qu7vyd/does_college_dining_food_really_make_you/hkqe7d6/",
              "text": "i also suffer from IBS so i understand! yeah, meal plans are the way most people go freshman year at least. it just seems to be easier. however, if you can get a fridge and keep things like fruit and more natural food like salads and such i think that would be beneficial. someone else said that if your dorm has a kitchen, utilize it, and i agree!",
              "author": "thomasshclby",
              "created": 1636992334,
              "upvotes": 2,
              "replies": {
                "hkry1lr": {
                  "link": "/r/college/comments/qu7vyd/does_college_dining_food_really_make_you/hkry1lr/",
                  "text": "There are vegan places to eat on campus so I might go visit that campus and eat from there a couple of times to test it out. If it works, I’ll use the meal plan just at that restaurant and I’ll likely keep a mini fridge full of fruits and other natural food. \n\nA pain in the butt but I gotta do it to minimize the flare ups.",
                  "author": "TroubledBlondie",
                  "created": 1637014418,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}