{
  "sid": "r0x2ul",
  "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/",
  "title:": "Wtf do I do? Will things get better or worse?",
  "text": "My first semester of college was amazing. Partying almost every weekend, pregaming with all of my friends in the dorms and just having fun. I’ve never been happier but that’s until my 3 friends and roommates decided they wanted to rush this specific frat that were all chill with. I would love to rush too it’s just my parents definitely won’t let me and now I’ll be excluded from everyone else. I’ve already begun to feel left out these past couple weeks and now I feel it will get worse as now every weekend we won’t be going to 3 different parties, pregaming together etc bc they will have their own shit to do in their fraternity that will sometimes be exclusive to only the brothers. (Such as mixtures, bonfires, etc). This kills me to think about since nothing will be the same and probably won’t spend as much time together. Yea it’ll be fun when their frat throws but this obviously won’t be nothing like before.",
  "author": "Party_Sale_3275",
  "created": 1637730391,
  "updated": 1638207423,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hlv70rz": {
      "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlv70rz/",
      "text": "Your parent won’t let you? Aren’t you an adult?",
      "author": "Spicybooiii",
      "created": 1637731239,
      "upvotes": 15,
      "replies": {
        "hlvbp6u": {
          "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlvbp6u/",
          "text": "I’m 18, it’s just I would never want to disrespect them by joining a frat and joining one would definitely take time away from my academics because of the amount of events they constantly do",
          "author": "Party_Sale_3275",
          "created": 1637734037,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlv800d": {
      "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlv800d/",
      "text": "If this is what worries , then I got some real bad news for you. You will face much worse, get your self ready mentally.",
      "author": "UntilIFall",
      "created": 1637731809,
      "upvotes": 18,
      "replies": {
        "hlvaxl5": {
          "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlvaxl5/",
          "text": "lmao",
          "author": "Melon-Kolly",
          "created": 1637733568,
          "upvotes": 4,
          "replies": {}
        },
        "hlvbli6": {
          "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlvbli6/",
          "text": "You’ve gotta be a damn idiot to think all I care about is partying. The main thing I’m complaining about is basically losing kids who are like brothers to me.",
          "author": "Party_Sale_3275",
          "created": 1637733973,
          "upvotes": -10,
          "replies": {
            "hlvfh7m": {
              "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlvfh7m/",
              "text": "But it does seem that the lack of partying is your main issue 🤷🏾‍♀️🤷🏾‍♀️ if you have all this time in college to go partying every weekend, it does seem like that's your priority",
              "author": "WilieFern",
              "created": 1637736440,
              "upvotes": 17,
              "replies": {}
            },
            "hlvgabp": {
              "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlvgabp/",
              "text": "> The main thing I’m complaining about is basically losing kids who are like brothers to me.\n\nDude it's your first semester of college, I think using the term brother is a reach here. If you're not going to join the fraternity then join CS/Engineering clubs. Your roommates, if they get in, will probably be moving out anyways to live at the house. You'll meet new people, more programmers and it's a club you can actually put on your resume.",
              "author": "ShadowIG",
              "created": 1637736992,
              "upvotes": 8,
              "replies": {}
            }
          }
        }
      }
    },
    "hlvbw0h": {
      "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlvbw0h/",
      "text": "So nelk dude",
      "author": "gooters14",
      "created": 1637734154,
      "upvotes": 3,
      "replies": {}
    },
    "hlw33qb": {
      "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlw33qb/",
      "text": "If it’s possible talk to your parents and explain how much this would mean to you, highlighting the academic advantages of being in this specific frat. Everyone is always focusing on the academics, you see people posting here about burnout and not having any friends. You are having the time of your life. Having the perfect grades is not worth it without friends in my opinion and this is the time in your life when you can be wild and party if you want to ( better now than when you are 30 with a family and a job). If you can show your parents that you can focus on studying while also having fun, I think they would accept it.",
      "author": "Dry-Razzmatazz8352",
      "created": 1637754870,
      "upvotes": 2,
      "replies": {}
    },
    "hlvcjq4": {
      "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlvcjq4/",
      "text": "I understand where you are coming from. Frats are design so you get closer with one another and go through “brotherhoods.” Soon they will start talking about frat stuff and events that you might not understand and feel left out. You could rush next semester. You could also rush and drop it if it’s too much for you. Just take the chance and it might be fun/ worth it in the end.",
      "author": "justin_v12",
      "created": 1637734565,
      "upvotes": 2,
      "replies": {}
    },
    "hlwazt7": {
      "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlwazt7/",
      "text": "1. I'd recommend not joining a frat. I don't think you will but I'm saying it anyway.\n\n2. I say try to talk to them. Text or something. See if they wanna do anything that isn't frat shit.\n\n3. The big old 3. Haha. Situations like this are common in life, you lose friends or sometimes grow apart. If your attempts to stay close do not work then the suggestion is that you go and make more friends. Your world will not end without those guys, it may hurt but thats just the reality of this. They chose to focus on being frat bros, you're just going to have to deal with that. \n\n4. You're in your first semester. Take a chill pill with these parties before you cause yourself to crash and burn, college is only a time for frequent parties if you're dumb.\n\n5. Brace yourself. Especially with this covid shit. Shit gets fucked up from here on out.",
      "author": "Myphosee",
      "created": 1637759843,
      "upvotes": 1,
      "replies": {}
    },
    "hlwp7ro": {
      "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlwp7ro/",
      "text": "I lost my roommates as buddies very quickly because I got a job that required me to go to bed pretty early, so I feel you there. Being excluded is awful. So you can either disrespect your parents, or not. Up to you. I don’t think Reddit can help too much here.",
      "author": "Temporary_Help3169",
      "created": 1637766624,
      "upvotes": 1,
      "replies": {}
    },
    "hlx053p": {
      "link": "/r/college/comments/r0x2ul/wtf_do_i_do_will_things_get_better_or_worse/hlx053p/",
      "text": "your an adult. you can do what you want. \n\nfrats are really not a good idea unless your planning on devoting time and effort\n\npartying is the least important aspect of college (most dropouts never get this one)",
      "author": "WavyCucumbers",
      "created": 1637771092,
      "upvotes": 1,
      "replies": {}
    }
  }
}