{
  "sid": "qqbin7",
  "link": "/r/college/comments/qqbin7/i_want_to_go_out_on_weekends_and_party_but_i_have/",
  "title:": "i want to go out on weekends and party but i have no friends",
  "text": "i'm a freshman in college, focused a lot on school and work for most of the semester, and i suddenly turn my head up and realize i haven't made any friends, and i spend all of my weekends and my free time alone, and sometimes i don't even talk to anyone for days--i don't even have pset groups or anything even though i go to office hours and all that. since i have some friends from high school here i've been to like three mit frat parties, and i always have fun on those nights, but those friends have kinda moved on from me to new groups and don't invite me to things. my roommates don't really go out and i'm not close to them anyway, and it really feels like everyone around me has good friends and goes out all the time. at this point i'd love to even have fake friends i can just party with because i'm really just so lonely. i've joined some clubs, but they're mostly work-based and i don't interact with anyone outside of meetings. and i have a lot of trouble reaching out to people or figuring out what to do if i were to reach out. i know it's really dumb, but i feel like a massive loser. any advice or reassurance or anything to make friends or even fake friends i can just party with or whatever would be appreciated bc i'm very lonely and sad thank u :)",
  "author": "insectari",
  "created": 1636486889,
  "updated": 1636655227,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk0hztd": {
      "link": "/r/college/comments/qqbin7/i_want_to_go_out_on_weekends_and_party_but_i_have/hk0hztd/",
      "text": "If you want to go out and party you first have to find a friend group or at least some acquaintances. I transferred to a different university as a junior and knew almost no one here.  The first semester sucked, I did nothing and talked to no one. I realized I couldn't do it for another semester so I made a change. I just started talking to everyone I could. It was super hard and awkward at first since I'm very introverted but eventually, I got better. \n\nJust talk to people in the class, at the sub, coffee shop, wherever. Most people are willing to talk to you and are nice. I was always scared of talking to new people but college is designed for you to meet new people so just go for it. Also ask people for their Snapchat or insta. I have found that people don't really like to give out their numbers as much but will give out socials. People also tend to post about events/parties on their socials that you may be able to attend. Just go out and be yourself and you will find people.",
      "author": "skyrizi",
      "created": 1636508260,
      "upvotes": 1,
      "replies": {
        "hk0m1ew": {
          "link": "/r/college/comments/qqbin7/i_want_to_go_out_on_weekends_and_party_but_i_have/hk0m1ew/",
          "text": ">y you first have to find a friend group or at least some acquaintances. I transferred to a different university as a junior and knew almost no one here.  The first semester sucked, I did nothing and talked to no one. I realized I couldn't do it for another semester so I made a change. I just started talking to everyone I could. It was super hard and awkward at first since I'm very introverted but eventually, I got better.  \n>  \n>Just talk to people in the class, at the sub, coffee shop, wherever. Most people are willing to talk to you and are nice. I was always scared of talking to new people but college is designed for you to meet new people so just go for it. Also ask people for their Snapchat or insta. I have found that people don't really like to give out their num\n\nthanks for the reassurance that i'm not alone, it always helps. any tips for what to say when just approaching people? or how to hit someone up if i do have their number? i have a lot of people i met in the first week of the semester but never ended up talking to again.",
          "author": "insectari",
          "created": 1636510090,
          "upvotes": 1,
          "replies": {
            "hk0r6f9": {
              "link": "/r/college/comments/qqbin7/i_want_to_go_out_on_weekends_and_party_but_i_have/hk0r6f9/",
              "text": "So I was really bad at small talk at first and still don't really enjoy it. I honestly watched youtube videos and read articles on how to talk to people. Made me kinda feel like a loser at first but I was doing it to get better. I wasn't good at it so I had to learn. \n\nWhen in class I usually just ask people about a previous or upcoming assignment. It's a pretty good cop-out to get a conversation going. I've met a lot of people by asking if they wanted to study sometime. Even if you never end up studying it's a good way to at least get to know someone a little bit and make it easier to have a conversation later on.   \n\nIf you have someone's number, simply send them a text. You said you're a freshman so I'm not sure if you are 21. But a simple \"hey what are you doing this weekend? Wanna grab a drink/food?\" or \"Hey you going to the upcoming game? Wanna go together?\" You might not get a response or someone might be busy but for the most part, you'll at least get a response and then you can go from there. \n\nYou said you \"had trouble figuring out what to do if i were to reach out\". I've felt the same and for me, it was because i was putting too much pressure on myself to make a good impression, which just made me even more scared to ask people to hang out. Just be yourself and if you don't know exactly what that means then take some time to learn what you like. I found out i like frisbee golf. It always seemed lame to me but i recently found out its kinda fun. Plus i get to meet people playing and we usually have a good time. \n\nAlso, confidence is key. I have dealt with low self-confidence for some time now but therapy has been helping. Im not talking like \"oh you gotta be on some alpha male bs\" but just having confidence in the fact you are a person. Like people aren't going to be scared of you or instantly reject you. Think about it like this. How would you feel if someone just came up to you and started talking? You'd be fine with it and at least humor them for a bit even if it was kinda weird. Chances are most people are going to feel the same way. College is tough but it can be a great time to meet cool people. There's a lot of people just like you out there, you just gotta take the time to find em.",
              "author": "skyrizi",
              "created": 1636512384,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}