{
  "sid": "rc0mus",
  "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/",
  "title:": "I think my professor tampered with my grade",
  "text": "Cross posted in r/Advice. \n\nI am a senior in college currently. I will be graduating next Monday. I have a double major in English and Experimental Psychology. \n\nI’m not too sure what to do about this issue. I’ve been taking a Realism class for my English degree. Throughout the entire semester I have maintained an A in the class. \n\nYesterday, I opened my transcript to see a B as my final grade for the class. I immediately emailed my professor and let her know I was showing an A on the class website, but a B on my transcript. My school also offers a B+, so I was confused as to how my grade could drop so drastically on the last day of class. \n\nMy professor emailed me back to let me know she gave me a 70 on participation. I have only missed 3 classes (the allowed amount), and I have turned in all of my work. I also make it a point to speak in every class. I emailed her back asking to have a meeting about how my participation dropped so low. \n\nThe issue I’m having in believing I earned this grade lies in the fact that I received great feedback on each assignment, and I constantly spoke in class. Also, the day before class ended she asked me what my name was when passing out assignments, which makes me believe she hasn’t been writing credit next to my name for my participation throughout the semester. I believe she is trying to manipulate grades to represent a Bell curve (it is common at the college level). \n\nWhile this may seem insignificant, I am trying to graduate with the highest honors due to the fact that I will be applying to a very prestigious graduate program. This one B will pull my GPA down to where I only graduate with Magna Cum Laude. I also have a 4.0 in all of my classes for both majors (math classes are my only Bs, so my major GPAs are both 4.0).\n\nWhat should I do? She has ignored my request for a meeting, so I’m unsure where to go from here. If we do finally meet and she still refuses to change my grade, who can I go to?",
  "author": "Adorable-Peanut",
  "created": 1638996571,
  "updated": 1639516933,
  "over_18": false,
  "upvotes": 76,
  "upvote_ratio": 0.96,
  "comments": {
    "hnrkm2a": {
      "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnrkm2a/",
      "text": "If she keeps refusing, I would go to an advisor for help or even the dean of that teacher's department. I fully understand why you're worried about this grade, because I wouldn't take that lying down either",
      "author": "Zaharizaka",
      "created": 1638996724,
      "upvotes": 86,
      "replies": {
        "hnrkxwy": {
          "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnrkxwy/",
          "text": "Thank you! I’m literally devastated, as I’ve worked so hard to graduate with these honors. I wouldn’t care at all if I felt I earned that B, but I know I didn’t. It’s nice to hear someone say they understand.",
          "author": "Adorable-Peanut",
          "created": 1638996849,
          "upvotes": 35,
          "replies": {
            "hnrlf4r": {
              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnrlf4r/",
              "text": "No problem. I'm also trying to graduate with the highest honors possible, and this resonated with me because a similar situation happened to me and shot my goal down to a 3.95.",
              "author": "Zaharizaka",
              "created": 1638997031,
              "upvotes": 8,
              "replies": {}
            },
            "hnuud2q": {
              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnuud2q/",
              "text": "Go to the department chair, make your case, and then consider filing a grade appeal.",
              "author": "profmamabear",
              "created": 1639061103,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hnrrkt2": {
      "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnrrkt2/",
      "text": "Talk to the department chair next. Tell them you tried to meet with the professor, but they refused to do so.",
      "author": "AceyAceyAcey",
      "created": 1638999394,
      "upvotes": 26,
      "replies": {}
    },
    "hnt7uiw": {
      "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnt7uiw/",
      "text": ">I have only missed 3 classes (the allowed amount), and I have turned in all of my work.\n\ndoes it say \"you may miss 3 classes without failing the course\" or does it say \"you may miss 3 classes without effect on participation score\"?",
      "author": "wobbletelescope",
      "created": 1639022330,
      "upvotes": 18,
      "replies": {
        "hntfyr0": {
          "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hntfyr0/",
          "text": "It says “if you miss more than 3 classes your grade will drop a letter grade”. It says we can miss two with no effect on participation, but my third was excused so there still should be no effect according to my university’s grading policy.",
          "author": "Adorable-Peanut",
          "created": 1639026658,
          "upvotes": 18,
          "replies": {}
        }
      }
    },
    "hnuhfrr": {
      "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnuhfrr/",
      "text": "Tip: when discussing why your participation should be higher, do NOT mention applying for Grad achools or scholarships. That is not important in this discussion. The only thing that a professor ethically can grade on is the grade you earned and if you bring up why you want a high grade, you will look like you are weasling.\n\nSecond, dont mention how you missed the \"allowed\" number of classes, that's likely a max number before you are dropped, not a number to aim for.\n\nYour two strong points are how you advanced class discussions through participation (write down the best that you can remember what you added for each class if you can) AND the fact that your prof. couldnt remember your name so how do they verify parricipation?\n\nThis is the main reason I dont grade on participation anymore. It was such a hassle as a prof. But I hace heard from so many colleagues how they just do participation based on how they recall students participating.\n\nGood luck.",
      "author": "judashpeters",
      "created": 1639054547,
      "upvotes": 7,
      "replies": {
        "hnv5zgq": {
          "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnv5zgq/",
          "text": "Thank you for the help!",
          "author": "Adorable-Peanut",
          "created": 1639065981,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnv2jwt": {
      "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnv2jwt/",
      "text": "Contact your professor with a request that she forward you your university’s grade grievance procedures. If she does not reply, resend your earlier message, and include the director of her program or the dean. Every university has codified grievance procedures. Basically, start making a stink. The fact she had to ask you your name that late in the semester seems extremely damning about her record-taking for class participation. Good luck!",
      "author": "Elvis_Take_The_Wheel",
      "created": 1639064605,
      "upvotes": 1,
      "replies": {
        "hnv6a2o": {
          "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnv6a2o/",
          "text": "Thank you! My department is one of 3 departments without their grievance procedures posted on the website, which is why I was so confused. This was very helpful!",
          "author": "Adorable-Peanut",
          "created": 1639066101,
          "upvotes": 3,
          "replies": {
            "hnvk7p5": {
              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnvk7p5/",
              "text": "Hope it helps. You deserve that A you worked for!!",
              "author": "Elvis_Take_The_Wheel",
              "created": 1639071462,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hntrtda": {
      "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hntrtda/",
      "text": "I'm not sure why you use the word \"tamper\" when grading is 100% her prerogative. A 70% participation grade for 3 missed classes is fair. Any more than that and you stand to risk failing the class outright.\n\n\nAlso, if a 70% participation grade is putting you into B territory it sounds like you only barely managed an A anyway.",
      "author": "TheProfessorsCat",
      "created": 1639034478,
      "upvotes": -15,
      "replies": {
        "hntvqb0": {
          "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hntvqb0/",
          "text": "70% participation grade for 3 missed classes is fair to you? We’re living in a pandemic that has shaken the lives of many students. Do you have such a shallow understanding of the world that you expect everyone to always be on top of their game? So weird. \n\nOP was just asking for some advice. Not sure where all your rudeness is coming from.",
          "author": "GiraffePresent5822",
          "created": 1639037554,
          "upvotes": 14,
          "replies": {
            "hntyhl7": {
              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hntyhl7/",
              "text": "It says in one of their other comments that they are a professor. I feel bad for their students.",
              "author": "Adorable-Peanut",
              "created": 1639039860,
              "upvotes": 7,
              "replies": {}
            },
            "hnupgvv": {
              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnupgvv/",
              "text": "Yes, a 10% reduction in participation score per class missed is my policy, pandemic or otherwise. \n\nWe've been in the pandemic for over 2 years now. If you are struggling now, you should not enroll in courses until your position improves. We can't coddle students forever. They need to accept responsibility for their courses.",
              "author": "TheProfessorsCat",
              "created": 1639058814,
              "upvotes": -4,
              "replies": {
                "hnvc2so": {
                  "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnvc2so/",
                  "text": "How classist. Do you realize that the pandemic has disproportionately affected lower-income communities the hardest? It is mostly these students that have to juggle with jobs, relationships, school, etc.  \n\nWhat you call “coddling” students is what I call treating people with empathy and decency, weirdo.",
                  "author": "GiraffePresent5822",
                  "created": 1639068328,
                  "upvotes": 4,
                  "replies": {}
                },
                "hoiq1by": {
                  "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hoiq1by/",
                  "text": "You're a fucking asshole. \n\nEven if someone is the most insightful and active participator in your class, despite only attending ~95% of the classes, they would be given a C in participation y your marking schema. Bullshit.\n\nAnd fyi, by definition mental health problems are not self-created. If someone has been severely impacted by the pandemic, they deserve empathy from the person teaching them.",
                  "author": "horfinnpafagaukur",
                  "created": 1639495486,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hntxyev": {
          "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hntxyev/",
          "text": "2 classes is what is allowed without penalty by my university. The other absence was excused. And barely managed is still an A.\n\nAlso, the fact that you’re a professor and you answered in such a condescending tone tells me everything I need to know about how your classes are conducted. I feel bad for the students who are not allowed to question their grades because grading is your “prerogative”. It is students’ prerogative to know their grade prior to the day grades are put in. It is also their prerogative to question why they received a grade, and receive an answer more than “because I said so.”",
          "author": "Adorable-Peanut",
          "created": 1639039403,
          "upvotes": 11,
          "replies": {
            "hnv8zdz": {
              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnv8zdz/",
              "text": "Were all three absences excused? If you get two freebies that doesn't mean they get to be unexcused. Does your professor define participation anywhere?\n\nAlso you said the professor \"manipulates the grades to form a bell curve\" and that is just curving grades. I'm assuming the syllabus has a clearly defined grade range for an A? There is so much detail missing to judge what happened.\n\nIn any case, if your prof hasn't responded yet (how long has it been?) and you are worried you are not being graded fairly you should file a grade appeal. That's what they are there for.",
              "author": "Dr_Pizzas",
              "created": 1639067144,
              "upvotes": 1,
              "replies": {
                "hnvc2qs": {
                  "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnvc2qs/",
                  "text": "I was sick for the other two absences, but I couldn’t afford to go to the doctor because I had an expensive consultation the next week. I emailed her about being sick, and she said not to worry about it and that I could make up the work. So they weren’t necessarily excused, but she did tell me not to come in. Also, our policy at my university is that we must be allowed two absences that will not affect our grades. \n\nAlso, what I mean as far as the bell curve, professors curve grades on exams sure, but she is curving the entire semester grade based off of a participation grade, which is subjective. Students who had an A or B all semester are dropping by an entire letter grade on the day grades are due with no prior notice of our low participation. \n\nIt has been 24 hours with no response to answer your question.",
                  "author": "Adorable-Peanut",
                  "created": 1639068327,
                  "upvotes": 1,
                  "replies": {
                    "hnw7uw5": {
                      "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnw7uw5/",
                      "text": "I understand what you mean about the course grade being curved. Though it is somewhat rare these days some professors do that and most of the time curves are used to shift the grade minimums rather than truly map the grades to a normal distribution (which can hurt students who are performing at high levels). Typically a curve would be communicated to you. \n\nI'm really not sure if you are being curved though or just didn't get your participation grade until the very end. Sounds like the latter, especially if participation was a substantial part of your grade. It would not be weird to have an A in Canvas all semester then upon getting a 70% in participation for that grade to drop down if it is weighed enough. It is not good to provide no indication on participation until the actual grade, but if there were specific guidelines for participation then the prof may have felt that was sufficient. I'm guessing there were no such guidelines. \n\n24 hours is not a lot of time so unless they have a 24-hour response policy in the syllabus I would wait a bit longer. It's a crazy time in the semester for profs too. I would give it at least a couple days.\n\nBy the way, I am not saying you are wrong on any of this but accusing the prof of \"tampering\" with your grade is pretty serious, so I am trying to figure out if there is a more reasonable explanation (even if it may still not be a very fair or nice one). If your online grade is still reported as something and your actual submitted grade is something else then that is grounds for a grade appeal though and I would still think that's the next step for you. Others suggest contacting the chair but I don't think that's really the best strategy, and an appeal likely will pass through the chair anyway.",
                      "author": "Dr_Pizzas",
                      "created": 1639080826,
                      "upvotes": 2,
                      "replies": {
                        "hnwcu6s": {
                          "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnwcu6s/",
                          "text": "I understand what you’re saying regarding the curve. I think I may have phrased it wrong. What I think is that she pulled some students down from an A so her class did not appear to be too easy. Since we never had any indication of our participation grade, this would have been easy for her to do. Also, a 70 is exactly what I would need to be pulled down to an 84, one point below a B+. It’s just sketchy to me. \n\nDuring finals we do have a 24 hour response policy as well. I did attempt to file an appeal, but unfortunately could not find the instructions online, so I reached out to the chair. I didn’t say I felt she tampered with my grade to the chair, I just told her that I would like to have a meeting regarding how the grade for participation was calculated. Once we have the meeting, I’ll present my evidence as to why I think the grade may be a mistake. Thank you for the help!",
                          "author": "Adorable-Peanut",
                          "created": 1639082822,
                          "upvotes": 1,
                          "replies": {
                            "hnwmgty": {
                              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnwmgty/",
                              "text": "That seems very reasonable. Going into your meeting, stick to the facts. A lot of wild accusations are thrown around by students and if you stick to the facts you will get much better results. Good luck!",
                              "author": "Dr_Pizzas",
                              "created": 1639086737,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hnueqp9": {
          "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnueqp9/",
          "text": "Stay over with the other pretentious “I got bullied in school so now I bully students” people on r/professors please.",
          "author": "amehregan",
          "created": 1639052919,
          "upvotes": 6,
          "replies": {
            "hnv6uzy": {
              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnv6uzy/",
              "text": "He didn’t get the response he wanted so now he’s skipped to accusing all of us of fishing for grades. I’m sure he’s a wonderful professor.\n\nEdit: I didn’t cheat my way into a 3.94 GPA. If I didn’t fight this, I would still have a 3.92. It isn’t about the GPA, it’s about the fact that she’s done something morally wrong.",
              "author": "Adorable-Peanut",
              "created": 1639066335,
              "upvotes": 2,
              "replies": {}
            },
            "hnuplzu": {
              "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hnuplzu/",
              "text": "I didn't realize this sub was exclusively for grade-grubbers.",
              "author": "TheProfessorsCat",
              "created": 1639058882,
              "upvotes": -7,
              "replies": {
                "hoiqjcw": {
                  "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hoiqjcw/",
                  "text": "Fuck you.",
                  "author": "horfinnpafagaukur",
                  "created": 1639495696,
                  "upvotes": 1,
                  "replies": {
                    "hoj51ai": {
                      "link": "/r/college/comments/rc0mus/i_think_my_professor_tampered_with_my_grade/hoj51ai/",
                      "text": "Get a grip",
                      "author": "TheProfessorsCat",
                      "created": 1639501423,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}