{
  "sid": "qlb463",
  "link": "/r/college/comments/qlb463/i_feel_like_a_failure/",
  "title:": "I feel like a failure",
  "text": "I’m in my second year of junior college and I’m on track to be here for 3 just to finish my associates before I transfer. I started college late at 22 and that made me feel pretty shitty about myself already. I’m majoring in engineering and just got to my first calculus class this semester and I’m already failing. \n\nOn top of general life stress and other classes, I work in a pretty dysfunctional environment with some pretty bad management. I’d love to leave but I haven’t been able to find another place willing to work with my school schedule. \n\nI have ADHD that’s been untreated for the last couple years and it’s starting to take a toll on my life and school. I’m pretty sure it’s the reason I’m failing 3 classes right now. I’m having to accept that I’ll have to drop this class since I won’t be able to raise my grade to passing and it’s killing me. I already feel like a failure from so much and having to take even longer to get my degree as well as retake this class makes me feel like that much more of a loser. I fucking hate this. I just don’t want to fail anymore.",
  "author": "flobopro",
  "created": 1635878701,
  "updated": 1635890744,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj1q6ic": {
      "link": "/r/college/comments/qlb463/i_feel_like_a_failure/hj1q6ic/",
      "text": "Dude.  Don’t worry.  College isn’t everything.  Your health is.  Have you considered taking a break from school, finding a new job and just doing that which makes you happy?",
      "author": "MetaBrains",
      "created": 1635880319,
      "upvotes": 1,
      "replies": {
        "hj1qva7": {
          "link": "/r/college/comments/qlb463/i_feel_like_a_failure/hj1qva7/",
          "text": "Yeah I’ve considered it, but haven’t done it. What would make me happy is to just do well in school and graduate. I’ve felt like a failure for so long, and honestly I don’t know what else would fix that. I’m already on track to take a 5th year, so the idea of taking even longer doesn’t sit well with me",
          "author": "flobopro",
          "created": 1635880590,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hj220q7": {
      "link": "/r/college/comments/qlb463/i_feel_like_a_failure/hj220q7/",
      "text": "I'm on the track to take a 6th year. Trust me when I say you do not want to prioritize anything over your mental health. I got a 2.5 my first semester and got diagnosed with bipolar so not great. I took a break and went to CC part-time. I then decided to go back to full-time and go to my state school. Even this semester I had to withdraw from a class because it was too much and this pushed me back again. School at the end of the day is nothing compared to your mental health. All in all, school isn't everything.",
      "author": "noelblossom",
      "created": 1635884897,
      "upvotes": 1,
      "replies": {}
    },
    "hj29lj8": {
      "link": "/r/college/comments/qlb463/i_feel_like_a_failure/hj29lj8/",
      "text": "Calm down dude, I get you, I started university later too, because some of my highschool credits didn't transfer from old school I had to repeat some grades. Then when I finally got into uni, I got into an accident and my foot shattered and wrist fractured. But I'm 20 and just starting uni, at first I took 5 courses(full course load), then 3 main ones thinking that I can do 2 others in summer, then 2, and now only 1. I physically couldn't sit or write, I had about 3-6 anxiety attacks a week for 2 months, I ignored it and kept going, then finally I dropped and only took one right now, ill be behind but atleast I can heal and do 1 course. \n\nJust take as minimum as you can do, and work part time or whatever, do rest in summer.\n\nI lost my 2nd year internship(2nd year summer), and 1 summer 1st year which was suppose to be free in which I could have done projects or worked or whatever. But everything was out of my control.\n\n\nBut im actly quite happy, no more anxiety attacks, im healing better and faster, and feeling better. I'm keeping up with one class, and learning new stuff on my own (coding language). Computer science major.\n\nThere's so many people in uni that are older then you, literally no one will care about your age, unless u just make it awkward yourself by doubting urself and keep the mentality of being behind, which won't help you the slightest.",
      "author": "thatandthis1",
      "created": 1635887777,
      "upvotes": 1,
      "replies": {}
    }
  }
}