{
  "sid": "q6toxy",
  "link": "/r/college/comments/q6toxy/to_quit_or_not_to_quit/",
  "title:": "To Quit or not to Quit",
  "text": "Hi Reddit. I just started as a freshman at a D3 school as a computer science major and swimmer. Let me preface this by saying swimming has been a major part of my life since I was 8 years old and I have  put 15+ hours of work into swimming and lifts every week for the entirety of high school.\n\nWhen I arrived at college I was expecting to have to work extremely hard but the reality of 20+ hours of swimming related exercise and early mornings has left me quite drained. Every weekday is entirely composed of swimming, school, and sleeping. While some of my teammates seem fine with this I have been constantly sick and unmotivated.\n\nI came to college to get as good grades as possible and while I am currently very close to where I want to be, I don't think that I have the motivation to sustain my grades with the amount of work I am doing.\n\nAs I have been thinking about my future, I have begun to dislike the idea of swimming in college more and more. If I swam all 4 years I wouldn't have a social life to speak of, I wouldn't have time to explore outside of the classroom, and (I am religious) I wouldn't be able to be a part of a religious community (something I loved in high school).\n\nI haven't quit so far mostly because the school I am at is very good (It would have been hard for me to get in with just academics) and I think the coach helped me get in so I feel an obligation to continue swimming. Because it is D3 I don't have a scholarship riding on sports though. I also don't want my parents or friends thinking that I am giving up because I am lazy etc. It has also been hard to make the decision to quit because swimming has been such a huge part of my life.\n\nRight now I am leaning towards quitting but I wanted to hear some unbiased opinions. If you could share what you would do in my position that would be very much appreciated. Thanks for reading.",
  "author": "Xander_the_tinker",
  "created": 1634066839,
  "updated": 1634082593,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hgeo5it": {
      "link": "/r/college/comments/q6toxy/to_quit_or_not_to_quit/hgeo5it/",
      "text": "Quitting swimming to focus on your studies and activities you find fulfilling is totally reasonable. The coach may be initially upset, but eventually they'll understand (if they don't already) that this is a usual part of their job. They aren't paying you—you don't owe them 20+ hours of week if you've soured on it.\nJoin a masters' league in 5 years or whenever things settle and swimming can still part of your life for decades to come.",
      "author": "trunkNotNose",
      "created": 1634075264,
      "upvotes": 1,
      "replies": {
        "hgesba1": {
          "link": "/r/college/comments/q6toxy/to_quit_or_not_to_quit/hgesba1/",
          "text": "Agreed. Swimming can take a pause for now, it doesnt mean that swimming is out of your life forever.",
          "author": "Chaz_Delicious",
          "created": 1634077053,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgeswwy": {
      "link": "/r/college/comments/q6toxy/to_quit_or_not_to_quit/hgeswwy/",
      "text": "I would definitely quit and enjoy your life more. It seems the pros outweigh the cons very clearly here. And no, i dont think your parents or friends will see you as lazy because you quit swimming. You would be putting more work into studying than before so definitely not lazy in my books.\n\nEnjoy life, go be social and be part of the religious community that you want to be a part of. Swimming isnt going anywhere and its not like you are officially retired from it or something.",
      "author": "Chaz_Delicious",
      "created": 1634077317,
      "upvotes": 1,
      "replies": {}
    }
  }
}