{
  "sid": "qbndkp",
  "link": "/r/college/comments/qbndkp/is_it_okay_to_email_the_department_dean_about_my/",
  "title:": "Is it okay to email the department dean about my professor right now?",
  "text": "For context, the course if fully virtual. I have been trying to contact my professor over an assignment that she is meant to assign per individua (which is a large part of out grade) for about a week. I have contacted my other classmates, too, and no one that has responded has heard from her or received their assignment.\n\nA few others and I have agreed that this is very much out of character for her, as we have contacted her before. She has always been punctual and quick to respond, up until this point.\n\nIs it acceptable to contact the department dean to ask if my professor is okay, or if there is another way they could help me contact her?",
  "author": "WoodlandsWork1889",
  "created": 1634684783,
  "updated": 1634750286,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hhar54r": {
      "link": "/r/college/comments/qbndkp/is_it_okay_to_email_the_department_dean_about_my/hhar54r/",
      "text": "This would go to her chair of dept.\n\nPlease make sure to state it like this is out of character and you are worried , or this person will get another bad thing added to their day.\n\nIt is very nice that you are concerned .  We appreciate these acts of humanity",
      "author": "PersephoneIsNotHome",
      "created": 1634687122,
      "upvotes": 8,
      "replies": {}
    },
    "hharfeo": {
      "link": "/r/college/comments/qbndkp/is_it_okay_to_email_the_department_dean_about_my/hharfeo/",
      "text": "Yes (not sure if that’s the correct person but definitely a higher up) but make sure it reads as an ask for a wellness check and not a complaint about lack of response",
      "author": "Visible_Negotiation4",
      "created": 1634687250,
      "upvotes": 4,
      "replies": {}
    },
    "hhapz24": {
      "link": "/r/college/comments/qbndkp/is_it_okay_to_email_the_department_dean_about_my/hhapz24/",
      "text": "[removed]",
      "author": null,
      "created": 1634686588,
      "upvotes": 1,
      "replies": {}
    }
  }
}