{
  "sid": "qmuhdn",
  "link": "/r/college/comments/qmuhdn/ra_interview_advice/",
  "title:": "RA interview advice",
  "text": "Hey all, \n\nI'm not sure if this is the place to post this, but I could use some help. \n\nI have an interview to be an RA next semester and am feeling quite nervous about it. What kinds of things should I keep in mind, and what kind of questions should I expect.  \n\nI am also unsure of how I should dress, my wardrobe pretty much consists of Flannels, Hoodies, and Denim Jackets. Does anyone have any advice on what I should wear? (It's online btw)\n\nThanks all!",
  "author": "evan352",
  "created": 1636059634,
  "updated": 1636137334,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hjcf42v": {
      "link": "/r/college/comments/qmuhdn/ra_interview_advice/hjcf42v/",
      "text": "I'm a current RA who helps with the hiring process. As far as attire dress for the interview process I suggest buisness casual to maybe buisness (just don't get crazy with it). Definitely don't sign in wearing a hoodie or have a mess in your background. Also if you have anything in violation of the housing license or code of conduct don't have it in the background (yes it happened). \n\nEvery interview is different so I can't really help you with the questions part. I would suggest looking at practice questions for interviews and maybe going to your school's career center for a mock interview (it they offer that). You'll probably get a question about why you want the job, and how you would handle a conflict. Just be honest and do your best with the questions. It can be tricky but at my school the interview part isn't too hard.",
      "author": "Nosleep_9764",
      "created": 1636066324,
      "upvotes": 1,
      "replies": {}
    },
    "hjczy4p": {
      "link": "/r/college/comments/qmuhdn/ra_interview_advice/hjczy4p/",
      "text": "Be yourself. I know that seems like cliche advice, but for the RA job you are really welcomed for who you are, so don't be afraid to show your personality.\n\nFor dress, it might depend on the school, but at mine you can really wear anything you want. Again, the RA job is inclusive, so they welcome you as you are. My school doesn't take your dress into account for anything, so you can just wear whatever makes you feel comfortable.\n\nBe prepared to answer questions about why you want to be an RA (don't say you want it for the free housing), a time you handled conflict, a time you helped someone, diversity and inclusion, and an event idea.\n\nAsk your RA or hall director for tips and advice - they'll probably be happy to help! Good luck!",
      "author": "cereal98",
      "created": 1636075370,
      "upvotes": 1,
      "replies": {}
    },
    "hjda3nc": {
      "link": "/r/college/comments/qmuhdn/ra_interview_advice/hjda3nc/",
      "text": "If it's an online interview have a glass of water nearby. That's my trick to take a breath and think if I'm in the middle of answering a hard question.\n\nWear business casual. A tie doesn't really matter but you need a dressy button down or polo at a minimum. Make sure to test the camera and take your time getting ready in the mirror that morning.\n\nGoogle a list of the top 50 interview questions (there are several lists, all are just fine). Jot down keywords and events for each of the questions and you should be decently prepared. You want to have a lot of examples and prepared responses in recent memory when you do the interview. *Don't* try to memorize entire statements because you will freeze if you forget. Use simple keywords for memory and have main points to hit on for the common questions.\n\nKnow why you want the job. Have 5 questions to ask them because they will ask you if you have any at the end and it shows no enthusiasm if you have none. I usually only ask 3 questions due to time. You'll just want to have 5 ready because they might accidentally answer some during the interview.\n\nWhen in doubt, ask for a moment to think over the question. It's much better to do this than freeze up or give an unintelligible forced response. Absolutely fine to take a moment to formulate a response.",
      "author": "darniforgotmypwd",
      "created": 1636080036,
      "upvotes": 1,
      "replies": {}
    }
  }
}