{
  "sid": "r2qauk",
  "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/",
  "title:": "How college works in the USA",
  "text": "Where I'm from, we graduate from high school at 17-18, and we go straight to university, so I have no experience with the US education system. What exactly is the purpose of college there? I have friends who went to US universities after high school from here, and they were doing just fine, without college education, and they were mostly average guys. Is there any difference between university and college in the US? I know that our universities, and US universities make you qualified to do the same level of jobs. At what age do you graduate from college, and what age do you go to university? Is college a prerequisite for uni? And from what I heard, at college you have 4-6 classes in a semester, which seems extremely comfortable from my perspective. At uni, I never had so few.",
  "author": "Alternative-Mango-52",
  "created": 1637941745,
  "updated": 1638206920,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.57,
  "comments": {
    "hm5zv6x": {
      "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm5zv6x/",
      "text": ">  Is there any difference between university and college in the US?\n\nNo. Actually, I do believe there are some small differences but the degrees and education you get from these institutions are the same so in practice, there's no actual difference. \n\nThis is a common source of confusion on reddit because I know in some countries there *is* a difference (I'm assuming yours is one). \n\nThere's a bit of nuance. A *community* college typically only offers the first two years of the 4 year education you'd receive at a university, but it tends to be much cheaper, so it's common for Americans to take two years of school at community college and then transfer and finish their last two years at a university.\n\nAdditionally, liberal arts colleges are typically 4 year schools just like universities and offer the same undergrad degrees and education but are typically smaller and are less likely to offer graduate degrees or they have graduate programs that are smaller than what you'd see at universities. They are also more likely to have that American style \"liberal arts\" education built into their majors, where you take more broad coursework.\n\nAlso, universities have \"colleges\" housed within themselves. For example, a student in biology at a university may be studying within the \"College of Arts and Sciences\" within a larger university.\n\nIt's kind of complicated, but no one really thinks much about it because colleges and universities in the US are seen as providing essentially an equivalent education.",
      "author": "HumanDrinkingTea",
      "created": 1637942627,
      "upvotes": 5,
      "replies": {
        "hm6eo1n": {
          "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm6eo1n/",
          "text": "Thank you! that was enlightening.",
          "author": "Alternative-Mango-52",
          "created": 1637949160,
          "upvotes": 2,
          "replies": {}
        },
        "hm6ggxx": {
          "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm6ggxx/",
          "text": "Also, I forgot to add, that where I live, we only have universities as institutions, and they are offering 3 year bachelor degrees, and after that, 2-3 year masters. There are some cases(teacher, med school, pharmacy, law, and a few engineering degrees) where there is 5-6 year degrees. Furthermore, I wasn't particularly familiar with the financial side of the US system, because here, if you have a high enough(specific number depends on what degree will you be pursuing) score on the equivalent to the SAT, you automatically get a government tuition for the cost of education. Also, the dormitories cost like 60-90$/month, and you can get a discount on that depending on the distance you live from campus. You also automatically get a scholarship based on your grades, and your families financial situation. So if you cannot afford higher education, and you get straight A's on 30 credits worth of classes/semester, you can finish your degree, and live through those years basically for free. On the other hand, if your GPA gets lower than 3, with the same 30 credits/semester rule, you will have to reimburse the state for every semester in which you didn't get good enough grades",
          "author": "Alternative-Mango-52",
          "created": 1637949954,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hm5zvpn": {
      "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm5zvpn/",
      "text": "Most students graduate high school around 18. If they want to pursue higher education, they will usually apply to college or university end of their 3rd year or beginning of their 4th year of high school. \n\nCollege and university are usually used interchangeably but there can be small differences. \n\nColleges are typically smaller and have fewer programs. They typically do not award doctorate level degrees. They typically award associates degrees (2 year) and bachelors degrees (4 years). Some may have masters programs as well (2 years after bachelors).  \n\nUniversities are usually larger and made of it smaller colleges. So the university is the school you are accepted into but your program and classes are mostly within the same college, like “the college of science “ or “the college of language, arts, and social sciences”. University usually award associates, bachelors, masters, and doctorate degrees. \n\nCommunity colleges are usually much smaller than other colleges. They have mostly 2 year degrees and many students will attend there first because it is less expensive and then transfer to another college or university for the last 2 years of their bachelors degree. \n\nIf someone goes to college/university right out of high school they usually graduate around 22 years old. But everyone takes a different path so it’s not uncommon to be older when you graduate. \n\n4-6 classes a semester is typical because a full time load is 12-18 credit hours and each class is usually 3-4 credit hours. Most 4 year degrees require a total of 120 credit hours to graduate. Obviously, there are variations to this depending on the school but this is on average what you can expect. \n\nMost students go to college to get an education to prep them for a career. A lot of higher paying jobs require more education and college is supposed to help prepare students for entry level positions in those fields. Some jobs just require a degree, regardless of what it is and some jobs require a more specialized degree. \n\nI hope this helps, I’m happy to answer more questions if you want!",
      "author": "usuallyConflicted",
      "created": 1637942634,
      "upvotes": 4,
      "replies": {
        "hm6heri": {
          "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm6heri/",
          "text": "Thanks! This was really comprehensive. 18 credits/semester?!😍 Here, if you do under 24, you are basically guaranteed to drop out. 28-34 is the recommended. I mostly had 2-6 credit classes during all my degrees.",
          "author": "Alternative-Mango-52",
          "created": 1637950370,
          "upvotes": 2,
          "replies": {
            "hm70t0a": {
              "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm70t0a/",
              "text": "Credits are different in America though, American credits are not equivalent to ETCS or other credit-schemes. Most classes in the USA are 3 credits, but some languages and intensive classes will be 4, 5, or 6. 15 credits per semester is considered the normal amount.",
              "author": "DrAlawyn",
              "created": 1637959407,
              "upvotes": 2,
              "replies": {
                "hm79ago": {
                  "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm79ago/",
                  "text": "Here, a credit is supposed to be a measurement of invested time for completing a class. On paper, a credit is 45minutes in class+1 hour of studying per week for the average student. I had a 9 credit advanced linear algebra class, and I had 9*45minutes class, and my 6 credit inorganic chemistry class was 6*45 minutes weekly, and so on... Whether I actually spent the recommended time studying, is of course an entirely different question.",
                  "author": "Alternative-Mango-52",
                  "created": 1637963332,
                  "upvotes": 1,
                  "replies": {
                    "hm7jmyk": {
                      "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm7jmyk/",
                      "text": "In the USA, we have 1 credit for every 15 contact hours (lectures, labs, seminars, tutorials, etc.) per semester. Most classes include 45 contact hours per semester. As most USA semesters are 15 week, we spend about 3 hours per class per week for a normal 3 credit class. \n\nA simple way is to say that 1 credit = 1 hour per week per semester.",
                      "author": "DrAlawyn",
                      "created": 1637968248,
                      "upvotes": 1,
                      "replies": {
                        "hm7m687": {
                          "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm7m687/",
                          "text": "So it is basically the same as here, I guess",
                          "author": "Alternative-Mango-52",
                          "created": 1637969482,
                          "upvotes": 1,
                          "replies": {
                            "hm7oh6e": {
                              "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm7oh6e/",
                              "text": "Not too far off, but ours are an hour long not 45 minutes (and there is no expected time for studying which counts towards credits).\n\nSo, if you had a 9 credit class where you live, you had that class for a total of 6.75 hours a week (Equivalent to 9 meetings of 45 minutes)?\n\nBtw, would you mind mentioning where this is? I'm fascinated by the different ways universities work around the world.",
                              "author": "DrAlawyn",
                              "created": 1637970604,
                              "upvotes": 1,
                              "replies": {
                                "hm7pnkl": {
                                  "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm7pnkl/",
                                  "text": "I can message you the details, but not in comments. With a country as small as mine and with my degrees, you could pretty much find out who I am, and I'm kind of uncomfortable doing it publicly",
                                  "author": "Alternative-Mango-52",
                                  "created": 1637971191,
                                  "upvotes": 1,
                                  "replies": {
                                    "hm7qzpt": {
                                      "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm7qzpt/",
                                      "text": "Then don't worry about it. I don't want to do anything that could make you feel uncomfortable or in any way possibly bring harm to you. I learnt a lot about how different countries do their credit systems and I wish you the best of luck!",
                                      "author": "DrAlawyn",
                                      "created": 1637971855,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hm60ggl": {
      "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm60ggl/",
      "text": "Im only SLIGHTLY familiar with the UK system but the big difference is what they call uni we call college and you go to college at what we call either a college or a university. Your friends who went to US unis were getting 'college education' because they were (colloquially:) \"going to college\" it just heppend to be that they went to college at a university.",
      "author": "trueoctopus",
      "created": 1637942899,
      "upvotes": 2,
      "replies": {}
    },
    "hm73old": {
      "link": "/r/college/comments/r2qauk/how_college_works_in_the_usa/hm73old/",
      "text": "College and university are synonyms in speech and most writing. HumanDrinkingTea already hit the main points, but I do want to elaborate on a few things. Depending on what a higher-education school is officially named (\\_\\_\\_ College vs. \\_\\_\\_ University), certain differences usually exist.\n\n1. Generally research isn't conducted at colleges, but can be at universities. Generally, universities are more highly ranked and respected than colleges, but there are noticeable exceptions. Professors at colleges usually teach more and research less. The school (University of \\_\\_\\_)  I went to had each professor teaching 1 class a semester, at a colleges close to me (\\_\\_\\_ College) professors teach 4 classes a semester.\n2. Colleges often proclaim they ascribe to a liberal arts curriculum, based on the idea of being well-rounded and taking a bit of everything. In my experience, there doesn't seem to be much difference between the two here. I went to University of \\_\\_\\_ as a humanities major but I still spent half of my time taking classes from outside my major. My cousin goes to \\_\\_\\_ College and had to take the same number of classes from outside her major as I did. \n3. Colleges are often smaller. A 3,000 undergrad college is pretty average. Universities are often larger. A 15,000 undergrad university is pretty average and might even be too small.\n\nBut everyone uses college and university interchangeably. In fact, \"going to college\" is the much more common expression than \"going to university\". Nearly no one calls it uni.",
      "author": "DrAlawyn",
      "created": 1637960744,
      "upvotes": 2,
      "replies": {}
    }
  }
}