{
  "sid": "rdfthz",
  "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/",
  "title:": "Can TA teach outside of a classroom?",
  "text": "For example, there is a TA of course ABC 101. Can a student, who is not in that class, ask that TA to teach that course using the same materials, homework, and quiz?",
  "author": "Fluffy_Guarantee_433",
  "created": 1639162830,
  "updated": 1639516654,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 0.79,
  "comments": {
    "ho0uphu": {
      "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/ho0uphu/",
      "text": "As a tutor, maybe. But the TA should not bring assessment (e.g., quizzes and exams) outside of the classroom unless they will be altered for future classes.",
      "author": "AcademicDifficulty",
      "created": 1639164122,
      "upvotes": 10,
      "replies": {
        "ho0uycc": {
          "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/ho0uycc/",
          "text": "Does that means TA is not banned or restricted from teaching that course materials to a student outside of that course?",
          "author": "Fluffy_Guarantee_433",
          "created": 1639164220,
          "upvotes": -6,
          "replies": {
            "ho11a5c": {
              "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/ho11a5c/",
              "text": "Of course not. The only exception might be if the TA is an international student and is restricted in the kind of job they can do.\n\nThere are no rules preventing us from tutoring. But tutoring doesn't grant you the credits you need to graduate. I tutor all the time when I was a grad student to make extra cash.",
              "author": "AcademicDifficulty",
              "created": 1639166745,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ho0wy4e": {
      "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/ho0wy4e/",
      "text": "No. That TA is employee for that class not for students personal use out of that class. Should the TA wish to offer their paid services outside of class as a tutor then that's on them, but homework, quizzes and exams belong to the professor and will not (should not) be used. In addition PowerPoints also belong to the professor along with most teaching materials, meaning the TA will have to put their own materials together.",
      "author": "safespace999",
      "created": 1639165019,
      "upvotes": 13,
      "replies": {}
    },
    "ho0uddj": {
      "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/ho0uddj/",
      "text": "The quizzes might be a problem...",
      "author": "paulfromatlanta",
      "created": 1639163986,
      "upvotes": 3,
      "replies": {
        "ho0umii": {
          "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/ho0umii/",
          "text": "I can ask the TA to grade them for me. TA are graders after all. But only professor can grade final project.",
          "author": "Fluffy_Guarantee_433",
          "created": 1639164088,
          "upvotes": -13,
          "replies": {
            "ho0vv14": {
              "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/ho0vv14/",
              "text": "Do you intend to pay the TA for this? TAs are often graduate students or sometimes early career people working the job temporarily or advanced undergraduates who aren't being paid very much to begin with. They're not going to be inclined to also teach the material and mimic the class to a student outside their normal working hours. \n\nIf you want to pay somebody to teach you material and prepare exercises you can certainly do that. Just hire a tutor. You won't get a grade or credit though.",
              "author": "Melodic_Echidna",
              "created": 1639164583,
              "upvotes": 14,
              "replies": {}
            }
          }
        }
      }
    },
    "ho1caqj": {
      "link": "/r/college/comments/rdfthz/can_ta_teach_outside_of_a_classroom/ho1caqj/",
      "text": "I’m a peer tutor for a class, which is like a TA but volunteer and less responsibility. You gotta do it for a semester atleast before u can apply to TA for this class. Anyway, even though I’m not paid when I became a peer tutor I agreed that I would not help tutor anybody in this class outside of my official capacity. Same deal goes for TAs at my school, it’s an unfair advantage but you can still go to TA office hours for help",
      "author": "BylvieBalvez",
      "created": 1639171081,
      "upvotes": 2,
      "replies": {}
    }
  }
}