{
  "sid": "q3elmk",
  "link": "/r/college/comments/q3elmk/transferring_from_big_university_to_community/",
  "title:": "Transferring from big university to community college- unsure about what I’m doing with my life",
  "text": "Are there any community colleges that offer online bachelors degrees? I’m a sophomore and I’m so indecisive with my plan/major and I don’t want my parents to pay for a big out of state school if I’m just going to keep changing my major. I’m anxious at my school right now, I have no connections and I live in a bad apartment. I feel like I’m stuck here and to be honest, I think I’m a little immature to make such a huge decision about my major right now, so I want to do community college. However, community colleges only offer associates degrees and i want a bachelors degree. Has anyone had a similar experience?",
  "author": "Ladyyybug22",
  "created": 1633629109,
  "updated": 1634083600,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfrrfie": {
      "link": "/r/college/comments/q3elmk/transferring_from_big_university_to_community/hfrrfie/",
      "text": "to my knowledge there’s not community colleges that are online nationwide. I think you would need contact the ones in your area to see if your program is offered in an online format. \n\nTo be honest with you, I think you would be better of taking a gap year and working. You said you’re too immature to deal with making a major based decision right now and to transfer to a new school will keep you in the same place mentally as you are now. There’s not really a point to staying in school while being completely unsure of what you want to do as you will end up taking a decent amount of classes you probably won’t need while trying to do career exploration. \n\nIf you can take a year off, it will allow yourself to really think about who you are and what your passions are. Once you figure that out you can find a major that satisfies you not only emotionally but financially. Maybe try taking an aptitude test as a starting point to build off of. Good luck!",
      "author": "rynpickles",
      "created": 1633637637,
      "upvotes": 1,
      "replies": {}
    }
  }
}