{
  "sid": "r58408",
  "link": "/r/college/comments/r58408/how_to_fit_in/",
  "title:": "How to fit in",
  "text": "Well okay basically i am a 19 year old guy and i just started going to college. Thing is i am super anxious and always doubting what to say or do. And i really wanna fit in so i guess some tips how not to be totally lame would be greatly appreciated",
  "author": "justabiboy77",
  "created": 1638226779,
  "updated": 1638480570,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.66,
  "comments": {
    "hmlep2d": {
      "link": "/r/college/comments/r58408/how_to_fit_in/hmlep2d/",
      "text": "i’m a freshman in college and i just told me self fuck it no one knows me here it’s a fresh start and i started being myself and doing what i wanted",
      "author": "talkingmeatball",
      "created": 1638228563,
      "upvotes": 4,
      "replies": {}
    },
    "hmmfr71": {
      "link": "/r/college/comments/r58408/how_to_fit_in/hmmfr71/",
      "text": "Clubs or activites are a good way to meet people and therefore hangout in smaller or larger groups. \n\nIf you have social anxiety, you could consider attempting to start a study group in a class. Rather than needing to awkwardly introduce and find common interests, you already have a common goal of learning the specific course material.\n\nGoing to the gym has been measured to combat general anxiety induced from stress. If you're new to an athletic enviornment, try and take it slow otherwise you'll quickly hurt yourself. Seperate your workouts into different muscle groups and learn form reduce risk of injury.\n\nAnd then finally, a lot of people are in your shoes, especially freshmen/sophmore year. Its okay to be slow to open up, just go with what makes you comfortable.",
      "author": "AHumbleLibertarian",
      "created": 1638245446,
      "upvotes": 2,
      "replies": {
        "hmn6a5f": {
          "link": "/r/college/comments/r58408/how_to_fit_in/hmn6a5f/",
          "text": "thank you",
          "author": "justabiboy77",
          "created": 1638263141,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmmfcqg": {
      "link": "/r/college/comments/r58408/how_to_fit_in/hmmfcqg/",
      "text": "[removed]",
      "author": null,
      "created": 1638245258,
      "upvotes": 1,
      "replies": {}
    }
  }
}