{
  "sid": "q96opg",
  "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/",
  "title:": "Could use some help on how to get over these feelings?",
  "text": "I took a gap year to try get into the program that I have always dreamed of. I also planned to work on some back up options , travel a bit, basically work on myself. But because of the pandemic I couldn't do all that and ended up just focusing on getting in that program. I failed miserably. I feel like I wasted an entire year for nothing. Not only did I not achieve my main goal , I didn't do anything significant this whole year. Even though I have decided on what to do next and am ready to start all over.... I sometimes go back to thinking...I'm a faliure... I feel like I'm stuck... I find myself feeling jealous of friends who are already in college, studying what they want to...and I hate that I feel this way. If anyone has been in a similar situation, I could really use some advice..",
  "author": "Outrageous-Ad6175",
  "created": 1634366818,
  "updated": 1634582648,
  "over_18": false,
  "upvotes": 12,
  "upvote_ratio": 1.0,
  "comments": {
    "hgugoia": {
      "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/hgugoia/",
      "text": "I too failed very hard to get into my dream program, and I’ve also planned out things and moved on/etc. I also didn’t do much the past year ish after I got rejected… and I have times where I am jealous of my friends who are in the program and feel like my skills are inadequate. \n\nI think imposter syndrome might be the best way to describe how I feel it. I’m not sure what your dream program was, but realizing the different paths I can take outside of the program helped me get over it. This and seeing my other rejected peers’ amazing work. This might sound a bit dumb, but I also realized I do not need some school/review board’s approval to excel in what I do. I think getting into hobbies outside of whatever your academic focus is can help a lot too. I’m in graphic design so a lot of skills just come with time and experience.",
      "author": "kureann",
      "created": 1634380121,
      "upvotes": 8,
      "replies": {
        "hgvmj3d": {
          "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/hgvmj3d/",
          "text": "Thanks for this, realistically I understand all this but its good to hear from someone else.",
          "author": "Outrageous-Ad6175",
          "created": 1634403259,
          "upvotes": 1,
          "replies": {
            "hgw6d7l": {
              "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/hgw6d7l/",
              "text": "Of course. I honestly relate a lot to what you’re going through. If you know other people in the same situation it helps to talk to them about it. I made more friends because I got rejected haha.",
              "author": "kureann",
              "created": 1634411744,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hgvg155": {
      "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/hgvg155/",
      "text": "Try to make the next year better than the last. Correct things you felt were mistakes and see what you can accomplish in days to come. Try to compare yourself to you last self rather than others. If you out in genuine effort to make things better than eventually things will get better. I didn't have the typical college experience and it got me down for a long time but once I changed my focus and started to work hard towards what I wanted, things got so much better.",
      "author": "SquishyPumpkn",
      "created": 1634400380,
      "upvotes": 4,
      "replies": {
        "hgvn3fh": {
          "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/hgvn3fh/",
          "text": "Thank you , I was feeling down and hearing that things will get better eventually makes me feel genuinely good.",
          "author": "Outrageous-Ad6175",
          "created": 1634403505,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hgvwq13": {
      "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/hgvwq13/",
      "text": "I promise you are not a failure or stuck at age 19.  Try, try again.\n\nDr. Grandpa",
      "author": "FreeThinkingGrandpa",
      "created": 1634407627,
      "upvotes": 3,
      "replies": {}
    },
    "hgy0g6s": {
      "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/hgy0g6s/",
      "text": "I didn't get into my PhD program the first time I applied. I was devastated. I took some time to grieve and it helped. You're not a failure, but you did lose your dream, your goal, your plan, the idea of how you're life was supposed to go. That's a huge loss. Grieve it like any other loss. Allow yourself space to grieve, to feel these huge emotions. They'll pass easier if you know why they're there and allow them to pass through. After grieving I went on to my backup plans like you have. I made it into my program the next year and now I'm done with that PhD. Honestly, it turned out way better than I could've imagined, but totally different. Grieve, feel, it'll make it easier to move on and embrace the next thing.",
      "author": "thehelpfulprof",
      "created": 1634442688,
      "upvotes": 2,
      "replies": {
        "hgy90xw": {
          "link": "/r/college/comments/q96opg/could_use_some_help_on_how_to_get_over_these/hgy90xw/",
          "text": "Thank you so much, I just realized  that is my problem , instead of grieving I'm trying to pretend it wasn't a big deal and that everything's okay...",
          "author": "Outrageous-Ad6175",
          "created": 1634447803,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}