{
  "sid": "qrxzym",
  "link": "/r/college/comments/qrxzym/procrastinator/",
  "title:": "Procrastinator",
  "text": "  \n\nListen Up, *Sir Procrastinator*, college student that waits till the last minute on due assignments.\n\nYour ways must stop.\n\nYou could have just gotten it done throughout the week you were assigned it. But instead, you were playing video games for a few hours, watching a movie, watching YouTube, or just letting yourself get distracted by your pet or siblings. Finally getting to the assignment and doing it at the last minute, stressing yourself out. \n\nDid you learn a lesson?\n\nNope.\n\nYou continue because it has turned into a bad habit. \n\nThat was a great example of procrastination.\n\nHow do I know? \n\nWell, I myself am a procrastinator. In fact I did it all week up till this moment.. Thirteen minutes to midnight. I ended up hanging out with my friends bowling going to Walmart plan3t and once I finally got home at around three thirty I had to rush to go to work and stayed there for about five hours once I finally got home again I realized my assignments were due and started writing about procrastination and how it can make you rush and make minor mistakes and run on sentances.\n\nI’m not proud of it but that’s why I’ve chosen to write about it. \n\n(Put some king of metaphor here) It’s like when your given a meal and dessert at the same time, but eating the dessert first because its small, easy, and enjoyable. Then, waiting for a bit until you are about to leave to eat the meal all at once. \n\nhow will you solve this problem? Eat the meal first. life will be far less stressful around due date or “when you’re leaving the restaurant”. You would not have to worry about getting your assignments in because they would already be in. Doing so might even improve how easy it is to fall asleep because you won’t be sitting up around midnight, as well as the grade that the assignment gets. \n\nI’m getting closer to my word count now so I can finally be done and go to bed. Hopefully, one day, you will learn from your mistakes and do what you need to do right away instead of waiting until the last minute to get things done.",
  "author": "Thick_Savings_5390",
  "created": 1636673378,
  "updated": 1637400496,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.95,
  "comments": {
    "hkaisna": {
      "link": "/r/college/comments/qrxzym/procrastinator/hkaisna/",
      "text": "Maybe the fact that a good portion of the human population chronically procrastinates is a sign we’re not all just fucking cogs or molds who came be fit into a rigorous college system \n\nJust sayin",
      "author": "DeepSpaceOG",
      "created": 1636689586,
      "upvotes": 1,
      "replies": {
        "hkbe1q0": {
          "link": "/r/college/comments/qrxzym/procrastinator/hkbe1q0/",
          "text": "We live in a society.......... this says a lot about our society............",
          "author": "censqred",
          "created": 1636711351,
          "upvotes": 1,
          "replies": {}
        },
        "hkcy4n8": {
          "link": "/r/college/comments/qrxzym/procrastinator/hkcy4n8/",
          "text": "I feel like it more indicates that people would rather do things they find fun than things they find difficult.",
          "author": "Jumpy-Elderberry-738",
          "created": 1636740065,
          "upvotes": 1,
          "replies": {
            "hkddhrs": {
              "link": "/r/college/comments/qrxzym/procrastinator/hkddhrs/",
              "text": "Sure, but is it not an inherent flaw when people can’t tackle something because they’re too stressed out. They want to do it, the don’t want to do something fun instead, but they’re too fearful to take action. Or they crack under pressure",
              "author": "DeepSpaceOG",
              "created": 1636746539,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk9vlmv": {
      "link": "/r/college/comments/qrxzym/procrastinator/hk9vlmv/",
      "text": "A+ advice my dude. I remember I would set aside an afternoon of time to sit down and write my papers, all planned out and rough drafted, and just force myself to stay in the library until it was done - one sentence at a time. I hated it, but I never lost sleep over a due date.",
      "author": "Klutzy-Classroom6756",
      "created": 1636678725,
      "upvotes": 1,
      "replies": {}
    }
  }
}