{
  "sid": "qhtizo",
  "link": "/r/college/comments/qhtizo/if_i_copy_and_paste_my_original_work_just_to/",
  "title:": "If I copy and paste my original work just to change the place of the paragraphs or sentences within my own work, is that plagiarism that Turnitin will check?",
  "text": "I have a midterm, where we are allowed to use notes and encouraged to prepare them beforehand. However, the professor said that any \"copy/paste\" function flags the system for cheating. I am not planning on plagarizing or copy/pasting from the internet or anything like that. I'm just wondering if the simple action of copy/paste- such as rearranging lines in your own response will create any red flags on turnitin?",
  "author": "Soulreality",
  "created": 1635446263,
  "updated": 1635456949,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hif6hdb": {
      "link": "/r/college/comments/qhtizo/if_i_copy_and_paste_my_original_work_just_to/hif6hdb/",
      "text": "I haven't used this program, but if it's a lockdown browser there's a chance it might, but if it just scans the assignment after you've already turned it in, you should be fine.\n\n\nEdit: re-read your post. Don't copy and paste, just type it all out again. Just to be safe.",
      "author": "dariamorgandorfferr",
      "created": 1635450146,
      "upvotes": 1,
      "replies": {
        "hif9ngx": {
          "link": "/r/college/comments/qhtizo/if_i_copy_and_paste_my_original_work_just_to/hif9ngx/",
          "text": "Going off of the lock-down browser scenario, you may not even have the ability to copy and paste.\n\nThis is the case when I use Honorlock.",
          "author": "kizeltine",
          "created": 1635451419,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hif7lob": {
      "link": "/r/college/comments/qhtizo/if_i_copy_and_paste_my_original_work_just_to/hif7lob/",
      "text": "Yep. That's self plagiarism. It's better to type everything out again.",
      "author": "AcademicDifficulty",
      "created": 1635450595,
      "upvotes": 1,
      "replies": {}
    }
  }
}