{
  "sid": "pwjy7r",
  "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/",
  "title:": "I feel consumed by Greek Life and I don’t know how to fix it",
  "text": "I’m a sophomore engineering student, and I’m really starting to hate my college experience. \n\nWhen I was in high school, I was an incredible student. Great grades, great extracurriculars, solid academic plan, and I worked hard to get a scholarship into a great school/program but now I’ve just… stopped.\n\nMy entire freshman year was online, so I got an apartment near campus and joined a fraternity in the spring since it was the only thing I could do in person (I know it was irresponsible during covid but I was desperate to have some aspect of a college experience and too selfish to stay at home). Last year was a dream come true for me - I got great grades, secured a paid (remote) research internship at the university, and spent all my free time enjoying the partying and good times that come from greek life at a big university.\n\nNow I’m one month into my sophomore year living in the fraternity house and I hate almost everything about my life. I’m struggling with a severe coke addiction and my response has been to drink and smoke every night until I black out because that’s the only time I don’t think about it. I’m burning through my money and lying to my parents about where it’s going. I lost my internship because I was too busy “having a good time” to realize I missed the reapplication deadline a month ago. I’m skipping classes because I sleep all day, and I’m barely keeping up by buying adderall to binge homework sessions. I haven’t joined a single club or gotten involved with anything outside of greek life, and I can’t bring myself to join the one student organization (a renowned engineering build/design team that was a huge part of the reason I chose this school) because I’m embarrassed of how the people in it will view me. I’m everything that’s wrong with greek life and I feel like a fraud for even being at this school. \n\nI’ve talked to my brothers about some of this, but I’m too embarrassed to be completely honest with them. I love my friends here and I have found some of the most genuine friendships of my life, but they all seem to balance everything perfectly. My closest friends in the frat are doing everything right - staying on top of school work, applying for internships, participating in clubs, only going out on weekends, all of it. They all have this perfect discipline that I just don’t. I can’t live in this environment where I’m surrounded by opportunities to fuck up and get fucked up because I don’t know how to say no. I’m never pressured or forced into anything but in a house of 100+ guys there’s always someone looking to just hang out or have a little fun… and the next thing I know I’m waking up the next day remembering nothing and I’ve missed all my classes. I feel like nobody else has this struggle and I’m the only one dealing with it because I’m now just too fucked up in the head.\n\nI know I need to get myself out of this environment but I’m terrified of what that will mean. I can’t get out of my lease until the end of the semester without forfeiting all my rent (which I can’t afford) but even if I do that it means cutting ties with the only friends I have at school. I have so many friends here that I care about and I feel truly care about me but I literally don’t know a single person outside of greek life. If I deactivate then I’m starting over completely on my own. And at this point I feel like I’ve fucked up my future career by wasting the first two years of college doing nothing but fry my brain. I’m so overwhelmed and stressed about pissing my life away I haven’t slept in days and I don’t feel like I can handle it anymore\n\nI don’t know if anyone will even want to help me because this is entirely my fault and I’ve done this to myself but I’ve completely lost control and I’m going off the rails and I don’t know what to do",
  "author": "TRImeHa",
  "created": 1632757852,
  "over_18": false,
  "upvotes": 19,
  "upvote_ratio": 0.88,
  "comments": {
    "hej4qqd": {
      "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hej4qqd/",
      "text": "I would call my parents and tell them the truth. Then try to get a medical withdrawal from the university, go home, and get clean. You can always try again next year, people of all ages finish engineering degrees",
      "author": "cody_d_baker",
      "created": 1632785921,
      "upvotes": 1,
      "replies": {}
    },
    "heieamj": {
      "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/heieamj/",
      "text": "You have a cocaine addiction. Nothing else you said matters. Go home, tell your parents and go to rehab. This is a critical point in your life. Not because of your degree or university, but because of your addiction. Drop out, tell your family and seek help immediately.",
      "author": "orangesNH",
      "created": 1632773481,
      "upvotes": 4,
      "replies": {
        "hej0o99": {
          "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hej0o99/",
          "text": "You don't have to drop out of college just to get rid of a drug addiction lmao",
          "author": "Beybladeer",
          "created": 1632783947,
          "upvotes": -1,
          "replies": {
            "hej13rd": {
              "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hej13rd/",
              "text": ">just to get rid of a drug addiction lmao\n\nYou sound like a 15 year old. You're a fucking moron.",
              "author": "orangesNH",
              "created": 1632784155,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hehwmih": {
      "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hehwmih/",
      "text": "Your problem is not Greek life.  Rather, your problem is you have a major issue with substance abuse.   Its important that you face that fact, and get professional medical help.  Do not wait; visit your campus health center today.",
      "author": "taxref",
      "created": 1632765451,
      "upvotes": 11,
      "replies": {}
    },
    "hehtv6t": {
      "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hehtv6t/",
      "text": "Please get help ASAP! Go to student health services, meet with your advisor, call your parents. Look into getting a medical withdrawal while you work on getting clean and can return to college when you’re ready. Good luck.",
      "author": "No_Cantaloupe_8281",
      "created": 1632764198,
      "upvotes": 19,
      "replies": {
        "hej44gq": {
          "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hej44gq/",
          "text": "Couldn’t have said it better myself than this here. Very clean and nice. Definitely recommend the medical withdrawal to work with the addiction then come back when you’re ready. There is no bad in taking a withdrawal to work on your health at all. If you do come back to the same college after dealing with this, I recommend staying away from the frat that may enable or make you think about the addiction again.",
          "author": "ThicccPanta",
          "created": 1632785623,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hehn4p1": {
      "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hehn4p1/",
      "text": "You need to take it one step at a time at this point cause you’re overwhelming yourself with all the things you need to fix. \nFirst off please consider seeking out help, if your school offers free therapy I would consider doing that. Talk to your advisors about your school situation as you seem to be skipping a lot of classes and that ain’t no good for your grades. Having an honest talk with your advisor to see what you can do can help you figure out if you need to reduce the classes you’re talking or if you can muster through them.\nDrug addiction is a real issue and clearly being in that frat enables you somehow since there’s always gonna be one dude that wants to have fun…. You have friends who “perfectly balanced” everything but in reality they may have had their own struggles too. \nTry to keep yourself busy, stay away from your frat as much as you can during the day, use the resources in your school to study or take a breather outside. I don’t suffer from addiction but I’m sure being around the source can make you want to take it more.\nIf there is professional help in your school solely for drug addiction, I highly recommend checking it out asap. You can still take control of your life but you can’t just expect it to change within a day. It took you a while to get to this point and it will take you some time to get out of it. Patience, self discipline, self love and self motivation is the key! You acknowledge that you already did this to yourself, now you can move on from that! If you need to cry, cry about it, if you have friends to vent to, vent it out and Complain all you want! But after you left yourself feel your intense emotions, bring yourself back to reality and rationalize yourself to start making steps to a better life! It sounds easier than it is, but taking things one step at a time will help you. Now go take a breather outside! You got this! C:\n\n(P.s. I’m not a professional when it comes to therapy or understanding addictions, I just wanted to comment something and see if I can somewhat give you clarity! If I sound insensitive I’m sorry and if I didn’t clarify some points or kinda jumbled my speech I’m sorry too :/ good luck to you c:)",
      "author": "Damn-it-Nel",
      "created": 1632761067,
      "upvotes": 5,
      "replies": {}
    },
    "hehm0es": {
      "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hehm0es/",
      "text": "You have to find someone to talk to. You have to let go of some things too; you have bigger problems than keeping friends around or getting good grades. Your life, health, and finances are at major risks. I would recommend you consider taking a leave from college to figure this stuff out so you can come back in a better place. Coming clean to your family might be the best move if you feel they will be helpful and receptive. Otherwise, you need professional help. Drug addiction and mental health issues are a bitch; you probably won’t beat them if you’re trying to do school at the same time.",
      "author": "ShinyRaticate",
      "created": 1632760535,
      "upvotes": 12,
      "replies": {}
    },
    "hehga72": {
      "link": "/r/college/comments/pwjy7r/i_feel_consumed_by_greek_life_and_i_dont_know_how/hehga72/",
      "text": "It sounds like you need professional help",
      "author": "TWR3545",
      "created": 1632758042,
      "upvotes": 47,
      "replies": {}
    }
  },
  "updated": 1634055995
}