{
  "sid": "qlt657",
  "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/",
  "title:": "Lost on what degree I want to do. (17m and senior in high school)",
  "text": "I am a senior in high school and I’m lost on what degree to chose. I enjoy building computers and computers in general I would seek a information tech but not CS considering the coding. I don’t HATE coding but I just couldn’t be sitting down and coding all day. I enjoy health and fitness and sorta thought about pharmaceutical stuff but I have no clue what career I could Pursue. Lastly I’ve considered a degree in criminal justice but my younger brother was telling me that it’s really useless to get a degree in it considering i wouldn’t be anything but a cop or state trooper really, unless there’s actually stuff in that which is why im on Reddit asking this. \n\nHealth/fitness, computers, law and creating  stuff w my hands. I can’t see myself at a desk all day. Seeking advice anything really helps.",
  "author": "Arcno_",
  "created": 1635941791,
  "updated": 1636137526,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj59lpt": {
      "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj59lpt/",
      "text": "Your brother is incredibly wrong about criminal justice. You can be a crime analyst, cop, federal law enforcement agent, probation officer, lawyer (some law schools even give you a year off of law school for being a CJ major), victim advocate and there’s a lot of technology jobs coming forward as another commenter mentioned. There’s also a shortage of people going into criminal justice because people think you can only become a cop but that’s not true and many of the jobs start at 60-80K salaries.\n\nedit: this is also only considering jobs with a bachelors degree. If you double major CJ with psychology, social work, legal studies, a language or computer science there’s even more job opportunities with an even higher salary. I’m a double major and the job i’m looking at right now is 90K a year starting with benefits.",
      "author": "rynpickles",
      "created": 1635946520,
      "upvotes": 6,
      "replies": {}
    },
    "hj50cy9": {
      "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj50cy9/",
      "text": "How much do you like Math and Science?",
      "author": "FoxWyrd",
      "created": 1635941864,
      "upvotes": 2,
      "replies": {
        "hj50qnu": {
          "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj50qnu/",
          "text": "I enjoy both, science more than math but barely. I never liked chemistry besides the labs we did. Math is enjoyable, I’m in pre calc right now. Biology was a fun class. But math I’ve always been good at.",
          "author": "Arcno_",
          "created": 1635942071,
          "upvotes": 2,
          "replies": {
            "hj50vrs": {
              "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj50vrs/",
              "text": "I was going to say if you like Chem, Pre-Pharm might be a good road to pursue, but I say that because I wish I had gone the Pharm route myself.\n\n&#x200B;\n\nI will say this though, avoid a Criminal Justice degree.",
              "author": "FoxWyrd",
              "created": 1635942148,
              "upvotes": 2,
              "replies": {
                "hj516lh": {
                  "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj516lh/",
                  "text": "Chem was an ok class. I just hated memorizing all the elements on the periodic table. I took AP chem and that’s really my only qualm about it. The physical labs we did in class I really enjoyed.",
                  "author": "Arcno_",
                  "created": 1635942310,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hj527i1": {
      "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj527i1/",
      "text": "Right now I’m considering pharm or info tech at this point. CJ seems like a shitty idea after what has been said that’s I’ve heard/seen 😂",
      "author": "Arcno_",
      "created": 1635942862,
      "upvotes": 2,
      "replies": {
        "hj584ae": {
          "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj584ae/",
          "text": "I’m currently a criminal justice student. There are many technology jobs in criminal justice and criminology that don't involve coding. I would go as undeclared/undecided and take classes you will need for every major such as English and Science, along with electives to get a sense of different career fields. If you are worried about wasting money on elective classes because you aren’t sure if they will be useful in the future, then do not fret. Electives are usually required for each degree so it’s not going to waste.",
          "author": "SchlapaBtch",
          "created": 1635945830,
          "upvotes": 3,
          "replies": {}
        },
        "hj6cgla": {
          "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj6cgla/",
          "text": "If you don't like chem (which you said above), Pharm will be very painful. If you enjoy science/biology along with health/fitness stuff, have you thought about physical therapy?",
          "author": "SenoraGeo",
          "created": 1635961692,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hj8cekq": {
      "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj8cekq/",
      "text": "Have you considered Computer Networking or CyberSec? Both are pretty hands on and any code you'll write will be to automate what you're doing.",
      "author": "notafloppydisk",
      "created": 1635991086,
      "upvotes": 1,
      "replies": {}
    },
    "hj514d4": {
      "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj514d4/",
      "text": "Go to college. There you will learn more about what you like and don’t like. Just take the classes that interest you and you’ll learn what area(s) to study. Consider a double major, too.",
      "author": "to_walk_upon_a_dream",
      "created": 1635942276,
      "upvotes": -2,
      "replies": {
        "hj7a8xb": {
          "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj7a8xb/",
          "text": "idk why you got down voted for this. This is what a lot of undecided people do.",
          "author": "rynpickles",
          "created": 1635974662,
          "upvotes": 1,
          "replies": {
            "hj7akyn": {
              "link": "/r/college/comments/qlt657/lost_on_what_degree_i_want_to_do_17m_and_senior/hj7akyn/",
              "text": "I mean, that’s what I’m doing. I’m still very undecided but going to college is helping me figure out what I like and don’t like",
              "author": "to_walk_upon_a_dream",
              "created": 1635974793,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}