{
  "sid": "q1b3ic",
  "link": "/r/college/comments/q1b3ic/tips_on_doing_well_in_general_chem/",
  "title:": "Tips on doing well in General Chem?",
  "text": "Hi, I’m currently a pre vet major taking General Chemistry and I’m having a really hard time with a lot of the theoretical concepts. I’m kind of at a disadvantage, as in high school I only took agricultural “chemistry” (horrible class, learned nothing, constantly hating myself for not taking AP Chem) and I’m extremely stressed and burnt out from studying and trying to keep my grade in that class up. I’m currently using ClutchPrep but I honestly don’t know how much it’s helping. Any advice would be amazing, thanks so much in advance!",
  "author": "Environmental_Step21",
  "created": 1633370721,
  "updated": 1637398626,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hff9dr5": {
      "link": "/r/college/comments/q1b3ic/tips_on_doing_well_in_general_chem/hff9dr5/",
      "text": "If it’s conceptual and theoretical stuff you’re having trouble with try creating a mind map. Focus on practicing problems and putting those concepts into action instead of focusing on reading and watching videos. Chemistry classes are less about memorization and more about application. If you can, go to office hours or ta sessions for extra help. Also I was at a disadvantage too, I failed high school chemistry lmao but I did great in my general chemistry classes and even TA and tutor for general chemistry now! You’ll be fine!",
      "author": "RatmiIk",
      "created": 1633394358,
      "upvotes": 1,
      "replies": {
        "hjumhdu": {
          "link": "/r/college/comments/q1b3ic/tips_on_doing_well_in_general_chem/hjumhdu/",
          "text": "Thank you so much! Sorry for the late reply, but I actually ended up using your ideas about actually studying the application and got an A on my last exam!",
          "author": "Environmental_Step21",
          "created": 1636404876,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}