{
  "sid": "qi37by",
  "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/",
  "title:": "How do you cope with bad professors? I just talk shit about them.",
  "text": "It makes me feel so good to talk shit about crappy professors. Honestly if you can’t do your job right how tf is a student supposed to succeed? This is probably the worst way to cope with it but it’s the only way for me. I don’t understand why they can’t fire bad professors. Like if a student acts up they get expelled or if they don’t do well in a class they fail. Why can’t it be the same with incompetent professors?",
  "author": "minidare56",
  "created": 1635476511,
  "updated": 1635779893,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "higus3r": {
      "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/higus3r/",
      "text": "I also enjoy running their name through the mud on rate my prof lmao",
      "author": "SMITHL73",
      "created": 1635476997,
      "upvotes": 3,
      "replies": {
        "higv7bp": {
          "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/higv7bp/",
          "text": "Oh yeah I love to make like 5 posts of how bad the prof is.",
          "author": "minidare56",
          "created": 1635477207,
          "upvotes": 2,
          "replies": {
            "higvbu9": {
              "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/higvbu9/",
              "text": "I love seeing the known bad prof rate themselves to up their ratings and call them selves “Dr” or “Professor” as if a student would write that ya know 😂",
              "author": "SMITHL73",
              "created": 1635477271,
              "upvotes": 2,
              "replies": {
                "hih00co": {
                  "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/hih00co/",
                  "text": "They really rate themselves on there? Maybe that’s why my prof is horrible despite a 4 star rating. God Damn it",
                  "author": "minidare56",
                  "created": 1635479619,
                  "upvotes": 1,
                  "replies": {
                    "hih04x5": {
                      "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/hih04x5/",
                      "text": "Yea and I almost fell into the trap w my first physics teacher glad I realized it early enough",
                      "author": "SMITHL73",
                      "created": 1635479688,
                      "upvotes": 1,
                      "replies": {
                        "hihbpic": {
                          "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/hihbpic/",
                          "text": "Bruh my teacher is a fake doctor I put that in the review. He is has a degree in naturopathic medicine and claims to be a doctor. He spreads is pseudoscience bullshit in his lectures. I fell for his fake reviews I guess. I thought he was a real medical doctor. Maybe if he is a real doctor, anatomy might be easier to learn.",
                          "author": "minidare56",
                          "created": 1635487153,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hijaq5r": {
      "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/hijaq5r/",
      "text": "This might feel good to do in the moment, but this is a dangerous coping method.  Professors talk, and if one catches wind of the comments you’re making, you could find your situation becoming worse",
      "author": "Hyacinth048",
      "created": 1635527585,
      "upvotes": 2,
      "replies": {}
    },
    "hih89m7": {
      "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/hih89m7/",
      "text": "I have the worst English professor ever this semester. I hate him and I complain about him 24/7 to my family. Can you believe that he meets with us only for 30 minutes each month? He just assigns work without meeting with us or explaining clearly what we should do. He meets with us after we have done a first draft and says that what we did is wrong so we should redo all of it or parts of the essay. We are supposed to meet for 2 hours per week and he doesn't meet with us because he doesn't want to. He doesn't even have office hours. I hope they fire him.",
      "author": "AdventurousLook4921",
      "created": 1635484685,
      "upvotes": 1,
      "replies": {
        "hihc4er": {
          "link": "/r/college/comments/qi37by/how_do_you_cope_with_bad_professors_i_just_talk/hihc4er/",
          "text": "The frustrating part is that they don’t fire these professors. I heard becoming a professor is competitive and there are far more competent professors who would like a job",
          "author": "minidare56",
          "created": 1635487466,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}