{
  "sid": "rg4be5",
  "link": "/r/college/comments/rg4be5/i_slept_in_my_roommates_bed_but_i_havent_tell_her/",
  "title:": "I slept in my roommate's bed but I haven't tell her and I feel terrible about it",
  "text": "It happened two months ago when she was away. I basically got too drunk that I couldn't climb to my bed (it is a bunkbed) and I wasn't thinking straight so I put my sheet covers over my roommates bed and layed down to sober up and eventually fell asleep for two to three hours, then after that I took off the sheets and went back to my bed when I felt better, the thing is that I didn't ask for permission because it was 3 in the morning and I assumed she was asleep, and I wanted to tell her when she was back but there was a problem and I pushed telling her to the back in my head and now two months ago have passed and I haven't tell her and I'm afraid that if I tell her she might get mad at me and that would ruin our good relationship.",
  "author": "Specialist_Bar_1153",
  "created": 1639476174,
  "updated": 1639516040,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.43,
  "comments": {
    "hohusfg": {
      "link": "/r/college/comments/rg4be5/i_slept_in_my_roommates_bed_but_i_havent_tell_her/hohusfg/",
      "text": "I endued more pain reading this post than your roommate will endue when she finds out you took a nap on her bed.",
      "author": "WCCobra",
      "created": 1639477458,
      "upvotes": 14,
      "replies": {
        "hohutsw": {
          "link": "/r/college/comments/rg4be5/i_slept_in_my_roommates_bed_but_i_havent_tell_her/hohutsw/",
          "text": "sorry, English is not my first language",
          "author": "Specialist_Bar_1153",
          "created": 1639477492,
          "upvotes": 4,
          "replies": {}
        },
        "hoiamkv": {
          "link": "/r/college/comments/rg4be5/i_slept_in_my_roommates_bed_but_i_havent_tell_her/hoiamkv/",
          "text": "endured*",
          "author": "BellZestyclose",
          "created": 1639488172,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hoiobsk": {
      "link": "/r/college/comments/rg4be5/i_slept_in_my_roommates_bed_but_i_havent_tell_her/hoiobsk/",
      "text": "I don’t know how you or your roommate get on, but honestly, if my roommate told me he got super drunk and took a nap in my bed I wouldn’t care. Honestly, unless you really just feel that guilty about it, you probably don’t even have to tell her. If you do tell her, maybe just offer to wash her sheets for her or something idk, but I can guarantee you, if you guys have a decent relationship, and she’s not super crazy or anything, she’ll probably just find it funny.",
      "author": "thebeesting02",
      "created": 1639494761,
      "upvotes": 3,
      "replies": {}
    },
    "hohy9wp": {
      "link": "/r/college/comments/rg4be5/i_slept_in_my_roommates_bed_but_i_havent_tell_her/hohy9wp/",
      "text": "I’d just tell your roommate what happened and maybe offer to run their sheets as an act of goodwill. It was a very minor mistake made drunk and if you have a good relationship with them, honesty will just work it out with no issues or hard feelings.",
      "author": "SussyVent",
      "created": 1639480320,
      "upvotes": 2,
      "replies": {}
    }
  }
}