{
  "sid": "rciol3",
  "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/",
  "title:": "“Girls are meaner in college” What are your thoughts about this?",
  "text": "This is what my cousins and upper class men who are in college has told me. What are your thoughts?",
  "author": "valteri777",
  "created": 1639059731,
  "updated": 1639517179,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.2,
  "comments": {
    "hnutfg7": {
      "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/hnutfg7/",
      "text": "that wasn't my experience at all, in fact it wasn't until college that I found someone I liked enough to date.",
      "author": "whatistheformat",
      "created": 1639060690,
      "upvotes": 4,
      "replies": {}
    },
    "hnus4ki": {
      "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/hnus4ki/",
      "text": "I mean it depends on what school I guess but my general consensus is that everyone is nicer in college because we all stop caring about teenage bullshit",
      "author": "maora34",
      "created": 1639060084,
      "upvotes": 4,
      "replies": {}
    },
    "hnv525f": {
      "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/hnv525f/",
      "text": "Nah, I found amazing girls in college, a lot of the clique thing is gone and most people just want to learn and make friends, you can even notice people who were popular in high school and how in one or two semesters they give up in trying to replicate that, just be nice to people and they will be nice to you",
      "author": "CollegeGalStuff",
      "created": 1639065610,
      "upvotes": 2,
      "replies": {}
    },
    "hnv7evz": {
      "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/hnv7evz/",
      "text": "I experienced this to a degree when I was in school. My campus was very left wing and a lot of the female students keep the males at an arm’s length, and didn’t seem open to making friends, outside of a few people who gained their trust within the first few days of freshman year. They would give you every nonverbal cue in the book that they wanted you to leave them alone. \n\nI had some female acquaintances that interacted with me at extracurriculars but those relationships were equivalent to a professional relationship. \n\nAt the same time though, I had a lot of bad habits during those days that didn’t make me a particularly good student, or friend at times. I finally started at least trying to clean up my act during the start of junior year.\n\nThen, in senior year, I finally found two female friends that were willing to give me a chance and actually put effort into the friendship.",
      "author": "DCEUrocks222",
      "created": 1639066551,
      "upvotes": 1,
      "replies": {}
    },
    "hnve89m": {
      "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/hnve89m/",
      "text": "I think that is completely false. Most of my friends in college were girls. The ones trying to replicate a high school sense of \"cool\"-ness tended to come off as just mean and immature though, but they didn't get very far in college socially because of that. Same for guys, a guy trying the high school cool style will find themselves isolated very quickly by appearing mean and immature.",
      "author": "DrAlawyn",
      "created": 1639069151,
      "upvotes": 1,
      "replies": {}
    },
    "hnvmlpi": {
      "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/hnvmlpi/",
      "text": "Definitely not",
      "author": "NinjaLorian",
      "created": 1639072368,
      "upvotes": 1,
      "replies": {}
    },
    "hnw4ett": {
      "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/hnw4ett/",
      "text": "Nah.",
      "author": "GenXtreme1976",
      "created": 1639079459,
      "upvotes": 1,
      "replies": {}
    },
    "hnxvp1e": {
      "link": "/r/college/comments/rciol3/girls_are_meaner_in_college_what_are_your/hnxvp1e/",
      "text": "no some middle school girls r complete bullies though",
      "author": "alwaysdream4",
      "created": 1639106488,
      "upvotes": 1,
      "replies": {}
    }
  }
}