{
  "sid": "quvicv",
  "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/",
  "title:": "Likely taking a year off for medical reasons- how can I keep my brain “in shape” to keep learning?",
  "text": "My health’s been worsening and it looks increasingly likely I’ll need a surgery with a 6-8 month recovery time and I’ll be out of college for two semesters. Since so much of college is about momentum, how can I make sure I don’t lose my “edge?” I already read regularly particularly popular physics books but was wondering what else I could do in the meantime?",
  "author": "TiredBread_",
  "created": 1637024838,
  "updated": 1639852168,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hkszvjl": {
      "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hkszvjl/",
      "text": "Learn a new language. \n\nGet on Khan Academy and do like twenty minutes of math a day. Does not have to be particularly difficult math, whatever that means for you (although do primarily focus on word problems), the point of the exercise is more about the problem-solving and analytical thinking. \n\nRead the “great books” of your field. Bonus points: you’ll probably be assigned at least parts of them in class later so this one actually gets you ahead. If you’re so inclined, look up some interesting research papers as well - if you have to give up your institutional database access while you’re out of school you probably have a friend who wouldn’t mind sending you a PDF every now and then. \n\nLearn/keep practicing an instrument. Def also a low-stress and low-impact way to raise your heart rate a bit that you can tailor to wherever you are in the physical recovery process. \n\nBest of luck!",
      "author": "themathymaestro",
      "created": 1637030948,
      "upvotes": 2,
      "replies": {
        "hkt5sia": {
          "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hkt5sia/",
          "text": "Thank you so much! These are great suggestions and I will be sure to do them since they fit perfectly- I used to be fairly good at piano so I can pick it up again. I also think that I’ll be able to keep my institutional login (or at least I hope) so I’ll be able to access scientific articles (i’m going for biology). Also the word problems are a good idea, and 20 minutes a day sounds reasonable. Thanks again! :)",
          "author": "TiredBread_",
          "created": 1637033642,
          "upvotes": 1,
          "replies": {
            "hktdjy2": {
              "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hktdjy2/",
              "text": "No problem!  I hope everything goes well and that you have a speedy recovery!",
              "author": "themathymaestro",
              "created": 1637037512,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hkw6dcg": {
      "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hkw6dcg/",
      "text": "take online courses at your own speed! there’s so many out there you can take advantage of. :)",
      "author": "concinnity1410",
      "created": 1637092244,
      "upvotes": 2,
      "replies": {}
    },
    "hksmh7x": {
      "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hksmh7x/",
      "text": "learn a new language!! latin is particularly fun :)",
      "author": "imabluedot",
      "created": 1637025034,
      "upvotes": 1,
      "replies": {
        "hkt5v2j": {
          "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hkt5v2j/",
          "text": "Ooh good idea! I haven’t touched Duolingo for a while, I’ll redownload the app",
          "author": "TiredBread_",
          "created": 1637033675,
          "upvotes": 1,
          "replies": {
            "hmskc4x": {
              "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hmskc4x/",
              "text": "if u do dm me ur username i use duolingo like a fake social media it’s so much fun :))",
              "author": "imabluedot",
              "created": 1638365225,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hksni5q": {
      "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hksni5q/",
      "text": "I’d say just continue to read college level material and read a lot of it. That’s what I did over summers where I wasn’t taking classes.",
      "author": "dalej42",
      "created": 1637025499,
      "upvotes": 1,
      "replies": {
        "hkt5xun": {
          "link": "/r/college/comments/quvicv/likely_taking_a_year_off_for_medical_reasons_how/hkt5xun/",
          "text": "Thanks for the tip! I plan to keep reading as much as I can",
          "author": "TiredBread_",
          "created": 1637033711,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}