{
  "sid": "qds9b5",
  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/",
  "title:": "College life is so routine",
  "text": "I hate this damn schedule. Everything I do is either determined by my class scheduled or roommates sleeping habits. I love playing music but my damn roommate sleeps in all day. I try to compromise my playing later at night but have early morning classes. Then on the weekends life is rinse and repeat. Go out to a bar or stupid club and drink excessively. What a way to live! Honestly I didn’t think I’d ever be saying this but zoom classes last year make me really miss online school. At least then you could mess about during the classes and have a program to join them for you. Now I have to actually go to class and sleep next to some obese moron.",
  "author": "Equivalent-Aerie7188",
  "created": 1634942784,
  "updated": 1635184698,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.48,
  "comments": {
    "hhog8uk": {
      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhog8uk/",
      "text": "If you think college life is routine now just wait till it’s over 😂",
      "author": "NoFilterNoLimits",
      "created": 1634942838,
      "upvotes": 20,
      "replies": {
        "hhoibo9": {
          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoibo9/",
          "text": "Why is that funny? You think the menial and mind numbingly boring nature of your life is funny? That’s sad really. Not sure why you’d want to make college students feel even worse by bragging about your boring life. Silly in my opinion.",
          "author": "Equivalent-Aerie7188",
          "created": 1634943889,
          "upvotes": -18,
          "replies": {
            "hhoissh": {
              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoissh/",
              "text": "I actually dont find routine menial & mind numbinglg boring, in an of itself.  Im sorry you are unhappy, lashing out at others is unlikely to change that. \n\nI suggest you find a way to find joy & beauty in the routine, because it’s reality for the vast majority, even when the actual job is fascinating",
              "author": "NoFilterNoLimits",
              "created": 1634944133,
              "upvotes": 15,
              "replies": {
                "hhojjmf": {
                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhojjmf/",
                  "text": "That sounds great on paper but you’re essentially telling me to learn to “enjoy routine”. That doesn’t even make any sense. How does one go about “learning” to enjoy something. Isn’t the definition of enjoy to derive pleasure or delight in an activity. Do you expect me to trick my brain into deriving pleasure from completing the same tasks every day without fail? It seems like that paradigm is attempting to address the unhappiness through the wrong mean. Opposed to finding more fulfilling work your suggestion is to merely “enjoy” routine. By that logic every mathematician before the advent of the computer and calculator should’ve learnt to enjoy the mind numbingly boring process of computing data and thus would have never increased computing power. Needless to say I appreciate your advice but disagree with it wholeheartedly.",
                  "author": "Equivalent-Aerie7188",
                  "created": 1634944513,
                  "upvotes": -14,
                  "replies": {
                    "hhokmzn": {
                      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhokmzn/",
                      "text": "No - embracing and finding the joy on routine doesn’t mean no growth or advancement.  I’m not sure how or why you made that logical leap. Nor does it mean the work can’t be fulfilling.  But it still usually starts and ends at the same times, and that work/sleep schedule is often far less flexible than the one you find unpleasant in college. \n\nI’ve learned to enjoy many things in my life, it really is about mindset.  I found my career very fulfilling & retired at a young age, but even with the freedom of retirement, I embrace routine.  \n\nBut by all means, best of luck to you.",
                      "author": "NoFilterNoLimits",
                      "created": 1634945067,
                      "upvotes": 8,
                      "replies": {
                        "hholq8l": {
                          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hholq8l/",
                          "text": "It wasn’t a logical leap as it was more so an opinion. An opinion is a statement consisting of a set beliefs that is INTENDED to be deliberated. By idenfifky my opinion as a logical leap you attempted to dismiss the validity of my opinion before debating its merits. Also to put it simply, why should we have to “try” to enjoy work. If we truly enjoyed work we wouldn’t have to exert any effort in to enjoying it. Because of this the phrase “try to enjoy” seems contradictory. But even if you were right and I could successfully deceive my brain in to enjoy the tedium of work why would I want to do such a thing when I could exert less effort in to something I enjoy more signing having to be dishonest with myself.",
                          "author": "Equivalent-Aerie7188",
                          "created": 1634945618,
                          "upvotes": -6,
                          "replies": {
                            "hhomu16": {
                              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhomu16/",
                              "text": "😂. Aww, thanks for telling me what an opinion is\n\nClaiming that by my logic mathematicians would never advance computing power is the ridiculous leap you made. That’s not what I said or implied, *at all*.  And I didn’t say try to enjoy work, I said try to enjoy the routine that is part of work *even when the work itself is fulfilling*. Loving my job didn’t make the hours & sleep schedule any less routine \n\nBut you seem determined to misconstrue everything, so I’m done.  Again, good luck to you, I hope you find what you are seeking",
                              "author": "NoFilterNoLimits",
                              "created": 1634946182,
                              "upvotes": 3,
                              "replies": {
                                "hhoqlmy": {
                                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoqlmy/",
                                  "text": "I apologize for my actions. I’m sorry.",
                                  "author": "Equivalent-Aerie7188",
                                  "created": 1634948125,
                                  "upvotes": 1,
                                  "replies": {
                                    "hhoqxf1": {
                                      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoqxf1/",
                                      "text": "No apology necessary.  I get you are frustrated. And me telling you it won’t get better didn’t help. \n\nI really do hope you find what you are looking for.  And when the routine is a pleasant one, it’s much easier.  Roommate problems *suck* and at the very least, hopefully that improves a lot after college",
                                      "author": "NoFilterNoLimits",
                                      "created": 1634948291,
                                      "upvotes": 1,
                                      "replies": {
                                        "hhoritr": {
                                          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoritr/",
                                          "text": "Yes I hope I find my calling as well. I suspect I know what it is but unfortunately that doesn’t pay the bills.",
                                          "author": "Equivalent-Aerie7188",
                                          "created": 1634948592,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                },
                                "hhon7rb": {
                                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhon7rb/",
                                  "text": "Why would you need to try and enjoy work if it is as fulfilling as you contend? Once again it seems to be another contradiction in your writing. Also my example about the growth of computation was not a logical leap because if these same matheticans endorsed your logic then the TI-84 calculator would have never been invented.",
                                  "author": "Equivalent-Aerie7188",
                                  "created": 1634946377,
                                  "upvotes": 0,
                                  "replies": {}
                                },
                                "hhoncct": {
                                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoncct/",
                                  "text": "Also in my original comment I implied that my work wasn’t fulfilling so you’re original advice isn’t satisfactory because it operates under the assumption that ones work is fulfilling.",
                                  "author": "Equivalent-Aerie7188",
                                  "created": 1634946443,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhoh15y": {
      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoh15y/",
      "text": "Wait until you find out about jobs…\n\nNo for real though, routines are going to dictate most of your adult life so learn to love them.  Schedule your work day, but also schedule free time and make the most of it",
      "author": "Ecstatic_Sector_4553",
      "created": 1634943234,
      "upvotes": 13,
      "replies": {
        "hhoi28a": {
          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoi28a/",
          "text": "No I don’t think I’m going to learn to love them. Maybe you did but that was your choice.",
          "author": "Equivalent-Aerie7188",
          "created": 1634943757,
          "upvotes": -7,
          "replies": {
            "hhoichk": {
              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoichk/",
              "text": "You're gonna live with them regardless.",
              "author": "FoxWyrd",
              "created": 1634943901,
              "upvotes": 7,
              "replies": {
                "hhoihhb": {
                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoihhb/",
                  "text": "Is that so?",
                  "author": "Equivalent-Aerie7188",
                  "created": 1634943970,
                  "upvotes": 1,
                  "replies": {
                    "hhoikvl": {
                      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoikvl/",
                      "text": "Work is far worse than college and many bosses feel like you're their property.",
                      "author": "FoxWyrd",
                      "created": 1634944018,
                      "upvotes": 4,
                      "replies": {
                        "hhoiwl9": {
                          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoiwl9/",
                          "text": "Maybe you’re in the wrong industry? Did you ever consider that? Maybe if you were a scientist actively working to the better the world around you, your boss would be less demanding that the intellectually taxing nature of your work itself.",
                          "author": "Equivalent-Aerie7188",
                          "created": 1634944187,
                          "upvotes": -2,
                          "replies": {
                            "hhoj9g2": {
                              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoj9g2/",
                              "text": "Lmao, ask some PhD students how they feel about that.\n\nGotta ask though: You ever have a job?",
                              "author": "FoxWyrd",
                              "created": 1634944367,
                              "upvotes": 3,
                              "replies": {
                                "hhojzwp": {
                                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhojzwp/",
                                  "text": "Obviously many pHD students are very unhappy as they have every right to be. They are undervalued(in terms of salary),overqualified(some of the smartest people in the world), and can go their whole lives without receiving acknowledgment from their peers. However it is these same people that are saddened by their low paying careers are the exact type of people that stem careers weed out. A true scientist would never complain of his lack of financial success as he should be completely ingratiated by the work that is completing. To answer your following question, yes I’ve had a job and honestly it’s much more boring than university so I will agreed with you in that regard.",
                                  "author": "Equivalent-Aerie7188",
                                  "created": 1634944742,
                                  "upvotes": -1,
                                  "replies": {
                                    "hhok96o": {
                                      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhok96o/",
                                      "text": "Lmao.\n\nGod, you're gonna love the Real World.",
                                      "author": "FoxWyrd",
                                      "created": 1634944871,
                                      "upvotes": 4,
                                      "replies": {
                                        "hhol18u": {
                                          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhol18u/",
                                          "text": "What was the purpose of this comment? To illustrate that the world is full of routine and that I should just be accustomed to it by now? If so then I’d respond to by saying that opposed to adjusting to the menial nature of work, we ought to instead find work that when completed repeatedly, is paradoxically considered to be engaging.",
                                          "author": "Equivalent-Aerie7188",
                                          "created": 1634945270,
                                          "upvotes": 1,
                                          "replies": {
                                            "hholphp": {
                                              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hholphp/",
                                              "text": "Laughing at how naive you are about the reality of the World was the point.",
                                              "author": "FoxWyrd",
                                              "created": 1634945608,
                                              "upvotes": 2,
                                              "replies": {
                                                "hhomo7u": {
                                                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhomo7u/",
                                                  "text": "Despite all of your self proclaimed wisdom you still ended up on the same reddit thread complaining about the routine nature of work. In this sense to you equate your wisdom to your ability to endure needless suffering? If so that seems to be a pretty odd metric to define wisdom/naiveté.",
                                                  "author": "Equivalent-Aerie7188",
                                                  "created": 1634946098,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hhoo23x": {
                                                      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoo23x/",
                                                      "text": "You'll see in a few years.",
                                                      "author": "FoxWyrd",
                                                      "created": 1634946813,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "hhoogbz": {
                                                          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoogbz/",
                                                          "text": "This was just flat out insulting. I never made any character assassinations during my debate with you and hey you’ve to decided to imply that I’m going to be working at an unfulfilling job in a couple of years. As Michelle from full house famously said “How Rude!”",
                                                          "author": "Equivalent-Aerie7188",
                                                          "created": 1634947022,
                                                          "upvotes": 1,
                                                          "replies": {
                                                            "hhop7oy": {
                                                              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhop7oy/",
                                                              "text": "Here's the reality: Most people hate their jobs, statistically.\n\nOdds aren't in your favor.",
                                                              "author": "FoxWyrd",
                                                              "created": 1634947422,
                                                              "upvotes": 0,
                                                              "replies": {
                                                                "hhopi17": {
                                                                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhopi17/",
                                                                  "text": "You’re right. I concede defeat.",
                                                                  "author": "Equivalent-Aerie7188",
                                                                  "created": 1634947567,
                                                                  "upvotes": 1,
                                                                  "replies": {}
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hhoirac": {
              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoirac/",
              "text": "It’s fine to say that if you’re okay with unpredictability and no structure to your life lol.  It’s okay to be more ‘go with the flow’ but without routines, you probably won’t be using your time as efficiently as you could be.",
              "author": "Ecstatic_Sector_4553",
              "created": 1634944111,
              "upvotes": 2,
              "replies": {
                "hhoki9l": {
                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoki9l/",
                  "text": "Why should I be concerned about the efficiency of my work? I’ve heard multiple accounts where being “too effecting” is actually detrimental to the quality of life of workers as they are excepted to meet that level of efficiency from that point onwards. Similarly, if you truly wanted to be productive and efficient as you claim that you wouldn’t be talking to me on reddit(a social media site that unlike others has no measurable benefit on the efficiency of your work and in many ways is actually counterproductive). Of course me and you and everyone else in the world doesn’t think this way because valuing efficiency over other aspects of our lives such as personal well-being are more important. All of this is to say that while I didn’t disagree with your sentiment as a whole, using “efficiency” as an argument for avoiding routine is silly.",
                  "author": "Equivalent-Aerie7188",
                  "created": 1634945000,
                  "upvotes": -1,
                  "replies": {
                    "hhol7gi": {
                      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhol7gi/",
                      "text": "You will inevitably have work in your life and doing it efficiently means better quality work and more free time.  That is always a good thing.  I try to stick to a routine and get my work done efficiently so I have more time to relax and do meaningful things in my life.  If you don’t want to be disciplined with your time, that’s fine- some people are okay living that way, but for most people some order and structure are good for productivity and work life balance.\n\nFrankly, the way you’re replying to comments in this thread and saying things like how your roommate is an “obese moron” are really childish.  You’re going to be in for a rude awakening the rest of college and your life if you act like this.",
                      "author": "Ecstatic_Sector_4553",
                      "created": 1634945355,
                      "upvotes": 3,
                      "replies": {
                        "hhomgve": {
                          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhomgve/",
                          "text": "I’m very immature. I will not dispute this fact. But that doesn’t address my argument. If employee A is 1.5 times more efficient than employee B but both are payed the same what is the purpose of effecidncy. Wouldn’t it be better to purport yourself as being as efficient as your coworker and then subsequently submitting your work at the same time while secretly acknowledging your real efficiency. Also what do you mean by more “time to relax”. How could you be relaxed knowing that the only reason you worked hard was because of your hatred of your work. At this point you are using your own hatred of work to motivate yourself to compete in a timely manner. At what point does your anger mutilate into apathy and your work becomes incomplete. The point I’m trying to make is that the argument that “I do my work so I could jerk off on reddit” only creates a temporary goal to achieve(“jerking off on reddit) while avoiding your hatred of your work and may be even compounding it even more",
                          "author": "Equivalent-Aerie7188",
                          "created": 1634945993,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhoongh": {
      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoongh/",
      "text": "I feel sorry for your roommate, but if you hate your current situation so much you have every right and freedom to walk away. No one is pointing a gun and a knife at your head telling you to follow the “routine”. College is not for everyone, maybe consider taking time off and go on a journey to find what you love. Moaning on Reddit won’t help.",
      "author": "mikeke3",
      "created": 1634947125,
      "upvotes": 7,
      "replies": {
        "hhop70r": {
          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhop70r/",
          "text": "You’re right I’ve been a complete jerk because I was unhappy. I don’t think any of the other commenters will see this but I am truly apologetic for my actions. I always get too invested in my emotions and it costs me big time. The truth is I’d like to drop out but don’t have enough confidence in myself to succeed in the world without a piece of paper.",
          "author": "Equivalent-Aerie7188",
          "created": 1634947413,
          "upvotes": -1,
          "replies": {
            "hhoq37g": {
              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoq37g/",
              "text": "Don’t worry about it, it takes time to control your emotions. I can tell you feel really frustrated with your life now. Also, you don’t have to necessarily drop out, college allows you to take one year gap or even one semester gap if you want, you can contact your advisor about it if you decide to do that. I was in a similar situation 3 years ago during my freshman year and I took a semester off to readjust my life and finding something im passionate about. Its okay to take some time off and not crash and burn, I hope things work out for you.",
              "author": "mikeke3",
              "created": 1634947866,
              "upvotes": 2,
              "replies": {
                "hhoqju3": {
                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoqju3/",
                  "text": "Thanks m8.",
                  "author": "Equivalent-Aerie7188",
                  "created": 1634948100,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhoqzyw": {
      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhoqzyw/",
      "text": "i like routine, personally. I like consistency & minimal risks. with a routine, it just gives me a schedule that I HAVE to do",
      "author": "vibinggrass",
      "created": 1634948327,
      "upvotes": 2,
      "replies": {
        "hhorle0": {
          "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhorle0/",
          "text": "Idk I guess I just like to take risks more. Just a difference in opinion I guess.",
          "author": "Equivalent-Aerie7188",
          "created": 1634948629,
          "upvotes": 1,
          "replies": {
            "hhorphy": {
              "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhorphy/",
              "text": "to each his/her own! no shame in that. it just comes to personal taste",
              "author": "vibinggrass",
              "created": 1634948688,
              "upvotes": 1,
              "replies": {
                "hhorr4f": {
                  "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhorr4f/",
                  "text": "Agreed.",
                  "author": "Equivalent-Aerie7188",
                  "created": 1634948711,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhp7hzp": {
      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhp7hzp/",
      "text": "Oh darn, you have to go to the classes you are paying to attend. However will you survive. If you don't want to drink, no one is forcing you to. You are free to stop when ever you want.",
      "author": "patrdesch",
      "created": 1634956839,
      "upvotes": 2,
      "replies": {}
    },
    "hhovaao": {
      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhovaao/",
      "text": "Structure and routine are hidden blessings. We are made for routines",
      "author": "JustOneRandomStudent",
      "created": 1634950522,
      "upvotes": 1,
      "replies": {}
    },
    "hhr5piq": {
      "link": "/r/college/comments/qds9b5/college_life_is_so_routine/hhr5piq/",
      "text": "Follow r/antiwork",
      "author": "Frogkoi",
      "created": 1635006009,
      "upvotes": 1,
      "replies": {}
    }
  }
}