{
  "sid": "qf9nq5",
  "link": "/r/college/comments/qf9nq5/how_to_stop_failing_exams_because_of_panic/",
  "title:": "How to stop failing exams because of panic?",
  "text": "So many exams that I studied so hard on, ruined just because I panic on the exam. These are exams I could have easily gotten an A in, but end up getting a C or D just because of panic. On Friday I had a thermo exam that I failed it because I couldn’t think straight and solve simple problems. Right after the exam when my mind cleared up I was able to figure out every single question in my head correctly. Because of this I can’t stop thinking about how fucking dumb I am and it’s been ruining my weekend.\n\nDo I have to resort to medication at this point or is there hope?",
  "author": "therocks41",
  "created": 1635138889,
  "updated": 1635184179,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hhzb3zv": {
      "link": "/r/college/comments/qf9nq5/how_to_stop_failing_exams_because_of_panic/hhzb3zv/",
      "text": "Would extended time or a different testing space ease your panic? As those are accommodations possible to get for anxiety.\n\nAs needed anxiety medication is a useful tool to try. It can make a big difference.",
      "author": "Katherington",
      "created": 1635166835,
      "upvotes": 2,
      "replies": {
        "hhzmpms": {
          "link": "/r/college/comments/qf9nq5/how_to_stop_failing_exams_because_of_panic/hhzmpms/",
          "text": "No. It’s not really that I’m short I’m time nor is the testing space an issue (I still had this problem during virtual classes).\n\nI just don’t know what to tell my doctor. Is my reason valid to get medicated in the first place?",
          "author": "therocks41",
          "created": 1635172436,
          "upvotes": 1,
          "replies": {
            "hhznbhj": {
              "link": "/r/college/comments/qf9nq5/how_to_stop_failing_exams_because_of_panic/hhznbhj/",
              "text": "I feel like it is a valid reason to get medicated, but honestly I’ve been on meds for long enough that I’m not sure about intake stuff",
              "author": "Katherington",
              "created": 1635172701,
              "upvotes": 1,
              "replies": {}
            },
            "hi01g4e": {
              "link": "/r/college/comments/qf9nq5/how_to_stop_failing_exams_because_of_panic/hi01g4e/",
              "text": "Ask your doctor about anxiety diagnosis. Treatment should be what's appropriate for you, personally. Combining medication and CBT (therapy that addresses specific situations and patterns) is common. Take your diagnosis to Accessibility to access accommodations that are appropriate for you, personally.",
              "author": "ResidentNo11",
              "created": 1635178643,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hhzge53": {
      "link": "/r/college/comments/qf9nq5/how_to_stop_failing_exams_because_of_panic/hhzge53/",
      "text": "It sounds like you have test anxiety. See if there's  tips or tricks online to help you. I had a classmate who failed a lot of her exams due to this and she didn't know she had it until the teacher sat down with her one day to encourage her that she did actually know the material. Although most professors at a college don't have the time to do that",
      "author": "Nordic-Blue",
      "created": 1635169500,
      "upvotes": 1,
      "replies": {}
    }
  }
}