{
  "sid": "qqfl68",
  "link": "/r/college/comments/qqfl68/i_feel_like_a_failure_i_question_if_i_can_keep/",
  "title:": "I feel like a failure. I question if I can keep going with my current major.",
  "text": "Background Info: I am currently a sophomore in my undergrad, hoping to get into a grad school (but it’s not likely).\n(Anyways, on with the “story”)\n\nIt hit me last week. There was a mini-seminar ran by professors to educate some students on what their grad school experience was like. I know this sounds dumb, but it never got me until now, at 19 years old, how hellish grad school is going to be. And honestly? I don’t think I’m cut out for it. I’m not competitive enough to be the best among a group of peers. I’m not the best of the best. I’m not..anything. Out of 8 BILLION people, what do I have to offer? Nothing! My hopes and dreams are crumbling around me as I just am a bystander watching it all fall on top of me. \n\nAlong with that, something happened today that made me break down and cry as I sat down and thought to myself for about an hour what I’m even doing. Not in my field or in college, but living in general. Basically I was in my zoology class (I’m a bio major) and we were dissecting a shark. Sound cool, right? Well, honestly, I was a bit grossed out and didn’t touch it much. I helped explain what parts we needed to find and observe separately to my lab partner who did more of the “heavy lifting”. By the end of it I questioned how I could be so squeamish when a few years ago I wasn’t like this at all. My partner joked that I’ve gotten weaker. That got me thinking how much I truly have gotten weaker. If I can’t be willing to get my hands dirty or stick my arm up a shark, HOW am I expected to thrive in a biology field or an outdoor field research type thing? \n\nI feel like I’m on the wrong path. I’m just the same somewhat-suicidal, anxious, terrified-of-failure perfectionist I’ve always been. I’ve spent more of my life anxious and scared than I have happy. If this is the rest of my life, then what is the point? \n\nI haven’t done an internship yet. I only have about a 3.7 GPA. I’m terrified of driving. I obviously can’t dissect animals. And I want to be an entomologist or virologist. What is my future? Is there even a future worth living for me? I may be a bit dramatic but I just don’t see a point to this anymore.",
  "author": "-Trichotillomaniac-",
  "created": 1636498417,
  "updated": 1636655215,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjzxekv": {
      "link": "/r/college/comments/qqfl68/i_feel_like_a_failure_i_question_if_i_can_keep/hjzxekv/",
      "text": "Take a deep breath. You'll be fine. \n\nFor what it's worth, I feel you on this, and I'm *in* grad school. I absolutely love what I do, but some days I feel exactly like you do now. \n\nI think it might be helpful to realize that there are *way* more career paths out there than you're even aware of yet. I have an undergrad degree in the performing arts and am pursuing a career in biostatistics. I didn't even know that biostatistics was a field when I was your age, let along what a biostatistician does (by the way, there's no grossness involved in biostatistics and you should look into it if you like math). \n\nWe're led to believe when we're young that being the \"best\" is the most important thing. It's not. The most important thing is that we're \"good enough.\" A 3.7 is most definitely \"good enough.\" \n\nNot only that, but it's totally normal to not know what lays ahead of you and to be afraid of it when you're 19 years old. You're totally new to being an adult and it's all being dumped on you at once. Not only do you not have to have all the answers now, but no one (aside from yourself and maybe your parents) *expects* you to have all the answers.\n\nTake it one day at a time. You might not have it all figured out right now, but you'll get there. If you put one foot in front of the other and keep pushing, everything will be okay, even if it doesn't feel like it.",
      "author": "HumanDrinkingTea",
      "created": 1636499093,
      "upvotes": 2,
      "replies": {
        "hjzxqjl": {
          "link": "/r/college/comments/qqfl68/i_feel_like_a_failure_i_question_if_i_can_keep/hjzxqjl/",
          "text": "That was very helpful. Thank you! And I hate it how we’re taught that we have to be the “best”. I just can’t get it out of my head that if I’m not perfect then I’m a failure. And I hope grad school is going well!",
          "author": "-Trichotillomaniac-",
          "created": 1636499237,
          "upvotes": 2,
          "replies": {
            "hjzyfgd": {
              "link": "/r/college/comments/qqfl68/i_feel_like_a_failure_i_question_if_i_can_keep/hjzyfgd/",
              "text": ">  And I hope grad school is going well!\n\nThanks! It is. I'm doing \"good enough.\" And I sometimes feel like a failure, but people tell me I'm doing a good job, so I trust them. It's important to reality check yourself sometimes-- I know many, many people who would be extremely jealous of a 3.7-- an outside opinion helps put things into perspective.\n\nI somehow manage to come across literal geniuses on a regular basis, and it skews my perspective. I want to be like *them*. We all want to be the 4.0 student who studies at a top school and \"wins\" at life. Life doesn't really work like that, though, even for the people we perceive as the most \"successful.\" We're all just human, going through life doing human things. It is what it is, and it's okay.",
              "author": "HumanDrinkingTea",
              "created": 1636499539,
              "upvotes": 2,
              "replies": {
                "hjzzoqc": {
                  "link": "/r/college/comments/qqfl68/i_feel_like_a_failure_i_question_if_i_can_keep/hjzzoqc/",
                  "text": "That’s very true. Especially considering how there’s 8 billion (I think) people on Earth now. It’s incredibly hard to be #1 here. I try to tell myself that, but I can’t. Hell, I go to a liberal arts college. An ARTS college for SCIENCE. In the middle of Indiana. I’m certainly not #1, not by a long shot! But I can’t stop holding myself to a standard of perfection. Anyways, I don’t want to keep babbling. Thank you for your advice, I really appreciate it! And I hope your college experience proves to be successful. :)",
                  "author": "-Trichotillomaniac-",
                  "created": 1636500087,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}