{
  "sid": "ritri6",
  "link": "/r/college/comments/ritri6/do_professors_usually_round_up_grades_if_requested/",
  "title:": "Do Professors usually round up grades if requested?",
  "text": "I currently have a 88.81% in the class and I need a 90 for an A. I already emailed my instructor to round up my grade but unfortunately, I haven't heard back. Do some Professors round up if requested or that never happens?",
  "author": "LongjumpingCellist44",
  "created": 1639783801,
  "updated": 1639787342,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hozjyqp": {
      "link": "/r/college/comments/ritri6/do_professors_usually_round_up_grades_if_requested/hozjyqp/",
      "text": "Professors round up when they decide to, but NEVER because a student requests it. Sometimes for me an 89.9 could be an A, sometimes it isn’t. It can depend on the grade distribution.\n\nHow hard one works is not automatically a reason to round up. Performance speaks for itself.\n\nIf a professor were mediocre, and asked you to give them great teaching evaluations, would you do it?",
      "author": "ProfessorUnrat",
      "created": 1639785739,
      "upvotes": 1,
      "replies": {}
    },
    "hozgoky": {
      "link": "/r/college/comments/ritri6/do_professors_usually_round_up_grades_if_requested/hozgoky/",
      "text": "Usually if your grade is above 89.5 & you haven’t missed class or any assignments, yes. Though I’ve had circumstances where a professor didn’t budge even above 89.5, twice. I don’t think they would do it anything lower than that though.",
      "author": "Hot_tamami",
      "created": 1639784225,
      "upvotes": 1,
      "replies": {
        "hoziw9n": {
          "link": "/r/college/comments/ritri6/do_professors_usually_round_up_grades_if_requested/hoziw9n/",
          "text": "I got a round up for an 89.4 but I worked my ass off that semester and did not miss a single assignment.",
          "author": "Deepseadyson",
          "created": 1639785257,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hozhv5j": {
      "link": "/r/college/comments/ritri6/do_professors_usually_round_up_grades_if_requested/hozhv5j/",
      "text": "This is usually considered grade grubbing (and often meets with a negative, if any, response). Rounding would usually apply at 89.5% or higher if it’s done.",
      "author": "PhDapper",
      "created": 1639784790,
      "upvotes": 1,
      "replies": {}
    },
    "hozlb69": {
      "link": "/r/college/comments/ritri6/do_professors_usually_round_up_grades_if_requested/hozlb69/",
      "text": "Many professors will round of slightly bump grades but generally don't want students asking. They know students who are close would like a grade bump, so you aren't communicating new information by asking and you do risk developing a bad reputation. Usually if rounding is going to happen either everybody within a certain margin gets rounded or nobody does, it wouldn't be fair to round people who asked while giving more demure students lower grades.\n\nA grading scale were a B+ is 87-89 thought probably wouldn't result in a 88.81 rounding to a 90. That's pretty close to dead in the middle of the range and, if we're rounding to two digits, would round to a 89 and not a 90.",
      "author": "Melodic_Echidna",
      "created": 1639786341,
      "upvotes": 1,
      "replies": {
        "hozlqzk": {
          "link": "/r/college/comments/ritri6/do_professors_usually_round_up_grades_if_requested/hozlqzk/",
          "text": "The only reason I want my grade to be bumped is because my school doesn't have B+ or B- or any of that sort. If you get anything between a 80 and 89 you will automatically be a B so that's a bit sad.",
          "author": "LongjumpingCellist44",
          "created": 1639786543,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}