{
  "sid": "rb4gwh",
  "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/",
  "title:": "What are the positives of having fraternities and sororities on campus?",
  "text": "I’m 100% against these organizations existing because I feel like they are clubs where you can only join if you: \n- have good looks.\n- have tons of money.\n- have a certain outlook on life where you think you’re above everyone else.\n- basically if you fit a certain demographic.\n\nNot only that, these organizations pick and choose who gets to be a part of the fun and who doesn’t, and I assume that those who don’t get chosen take hits to their self-esteem. \n\nIt is also worth mentioning the countless sexual assaults, rapes, and other horrible things that happen at obnoxious frat parties. Why do college campuses tolerate this? Why allow these organizations that cause more harm than good (if any)?",
  "author": "General-Extent-756",
  "created": 1638899252,
  "updated": 1639517345,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.52,
  "comments": {
    "hnmnfwb": {
      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmnfwb/",
      "text": "Well, Freedom to Associate is a basic human right in America. You have the right to be friends with whom you wish, hang out with them however and whenever you like, and not be forced to invite people you don’t like. Fraternities and sororities are social clubs and are protected by the right of Freedom of Association.\n\nUniversities like them because 1) they add an exciting social life to campus. Lots of students look forward to partying in school, and fraternity and sororities provide that environment. 2) Greek life encourages rituals and traditions that connect students to campus life. By endearing students and fomenting a sense of nostalgia, greek life produces engaged alumni. 3) greek alumni are some of the largest donors to universities. Because of the strong networking and preexisting privilege, the greek system produces a disproportionate share of wealthy alumni donors.",
      "author": "peakfreak18",
      "created": 1638905760,
      "upvotes": 9,
      "replies": {}
    },
    "hnme9sq": {
      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnme9sq/",
      "text": "It much cheaper than living on campus in a lot of cases. For me it’s $2k a semester for the house bill. This includes rent, dues, utilities, food, cook’s salary, etc. it’s less than half the price of room and board. Fraternities where I go are very inclusive, my frat has had plenty of gay and transgender, and minority brothers. Our parties are also much safer than dangerous unregulated house parties. We have multiple sober brothers monitoring each event, and have people sign a contract that includes the fact we will turn them into the police if they try anything belligerent, and we reserve the right to remove them from the premises with any force necessary if rules are violated. We also do not bid people who generalize specific groups of people, it’s wrong under all circumstances and we don’t tolerate that bigotry. To get a bid, show up to events and be a decent human being, that’s all.",
      "author": "diesalotXV",
      "created": 1638901836,
      "upvotes": 4,
      "replies": {
        "hnmhluo": {
          "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmhluo/",
          "text": "May I ask what fraternity you are a part of? Want to know if my school has a chapter or not. Not necissarily interested in joining, but want to see if my school invests in frats like this.",
          "author": "General-Extent-756",
          "created": 1638903239,
          "upvotes": -1,
          "replies": {
            "hnmiauv": {
              "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmiauv/",
              "text": "I’m apart of Theta Xi. But do keep in mind that it’s on a chapter by chapter basis. It’s more the culture of the university I attend. Even Pi Kappa Alpha and Delta Tau Delta chapters where I go are like this.",
              "author": "diesalotXV",
              "created": 1638903535,
              "upvotes": 3,
              "replies": {
                "hnmisqm": {
                  "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmisqm/",
                  "text": "If thats the case about campus culture, then I don't have very high hopes for it lol",
                  "author": "General-Extent-756",
                  "created": 1638903746,
                  "upvotes": -5,
                  "replies": {
                    "hnmjhkx": {
                      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmjhkx/",
                      "text": "I’m just used to people being decent to each other. The fraternities here have done a lot of good for the Flint community. Also, the Greek Life average GPA where I attend is a 3.32 and the non Greek average is a 2.9. One frat here has a 3.7 average GPA",
                      "author": "diesalotXV",
                      "created": 1638904041,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnmc0z3": {
      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmc0z3/",
      "text": "The emotionally mature, responsible people who don’t primarily  see college as a summer camp where they can do whatever they want away from their families can probably get some good out of Greek life.\n\nPeople in the summer camp mentality are the people who ask professors for extensions all the time due to bad time management, and still think they can handle 5 extracurriculars and a frat/sorority. \n\nLike everything else in life, with great power comes great responsibility.",
      "author": "DCEUrocks222",
      "created": 1638900872,
      "upvotes": 9,
      "replies": {}
    },
    "hnmaw3t": {
      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmaw3t/",
      "text": "I was part of a fraternity and I got nothing out of it, partly due to my bad habits (procrastination, spreading myself too thin with extracurricular’s), and partly because the fraternity was poorly run and didn’t have strong leadership or adequate funding. \n\nI wasted a lot of money on dues and didn’t get any lifelong friends out of it. It was an academic fraternity though, so I thankfully never got to see the horrors of frat parties. \n\nI know Greek life has its problems that need to be addressed, and I personally didn’t get anything positive out of it, but I know that many have, so I can’t say that frats/sororities need to be outright eliminated. It feels selfish to push for something like that.",
      "author": "DCEUrocks222",
      "created": 1638900385,
      "upvotes": 3,
      "replies": {}
    },
    "hnmsc9i": {
      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmsc9i/",
      "text": "In the moment, you’re being narrow minded OP. Just because you don’t like something, doesn’t mean others shouldn’t be able to enjoy it.\n\n\nBeing in my fraternity has allowed me to make great friendships, gain leadership experience, gain experience in community service and philanthropy, allowed me to mentor others, and be mentored myself. Most of all, it’s given me a support system away from home.\n\n\nI’m pretty average looking, I don’t have tons of money, and I don’t have an outlook on life to where I think I’m above everyone else. My chapter has brothers of many different interests and many different backgrounds.\n\n\nWe do choose who joins our chapter. We attempt to choose people who have a growth mindset, share common interests with us, and would be kind to others.\n\n\nIt is worth mentioning that sexual assault occurs outside of greek life. There are bad people everywhere, this isn’t unique to greek organizations. Bad people are going to be bad people no matter what environment they’re in.",
      "author": "SockEmRocco",
      "created": 1638907946,
      "upvotes": 5,
      "replies": {}
    },
    "hnmnxof": {
      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmnxof/",
      "text": "> have good looks. - have tons of money. - have a certain outlook on life where you think you’re above everyone else. - basically if you fit a certain demographic\n\nAs someone in a fraternity, this is total bullshit.\n\nJust like everything else, you can't let stereotypes define a whole group of people.  My chapter is extremely diverse (less than half of the chapter is white, multiple brothers apart of the LGBT community) and most people don't come from tons of money.  I enjoy the social aspect, I pay all of my dues myself working part time, I still get good grades, and I have a lot of job opportunities through connections I made in greek life.  Its super easy to hate when youre looking in from the outside at people having a ton of fun ig.",
      "author": "ExitLifeEnterHell",
      "created": 1638905981,
      "upvotes": 5,
      "replies": {
        "hnmwxlj": {
          "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmwxlj/",
          "text": "I go to a big state school so I don't see any frats like these. The guys and girls in frats at my school meet the list of requirements I've stated above.",
          "author": "General-Extent-756",
          "created": 1638909868,
          "upvotes": 0,
          "replies": {}
        },
        "hnmxdqj": {
          "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmxdqj/",
          "text": "And you're right, there are some good frats out there. I'm bashing the ones who do fit the stereotypes and from my observations seem to be the overwhelming majority.",
          "author": "General-Extent-756",
          "created": 1638910059,
          "upvotes": 0,
          "replies": {
            "hnmyc0c": {
              "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmyc0c/",
              "text": "I go to a big state school (60k students).  However, its not an SEC school or something similar so greek life isn't insanely popular here.  I can promise you the \"overwhelming majority\" are like my chapter for the most part.  Most greek life orgs are just college kids that like to have fun, and it pains me that so many people see greek life as such a shitshow because of the news and a few chapters that are full of dicks.",
              "author": "ExitLifeEnterHell",
              "created": 1638910463,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnm9mgj": {
      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnm9mgj/",
      "text": "I had a really negative experience when I was an undergrad. I joined it for social reasons, because I didn't have friends. I was too immature to exert any self-control. I managed to pull a 0.0 in my last semester and left school for years. There were parties all the time, a lot of social pressure to drink, guilted into not studying when I should have. Really just a nightmare.\n\nHowever, my nephew is in one now. It's an Asian-based but inclusive fraternity, and he (non-Asian) and his non-Asian friend pledged, went through that whole thing, but now he's pretty happy and proud of it. he's been the PR chair and has gotten a lot of graphic design experience. Their social outlets revolve around team gaming, not drinking contests. It's been a really stabilizing experience for him.\n\nSo although fraternity life messed me up, I take the blame for it, and it's been really positive for my nephew, so I can't condemn it outright. I think (social) fraternities like his are pretty rare though.",
      "author": "whatistheformat",
      "created": 1638899840,
      "upvotes": 3,
      "replies": {
        "hnmbqzq": {
          "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmbqzq/",
          "text": "This is what fraternaties should be. I'm just sick and tired of seeing how all of these frats and sororities are clubs for only a specific demographic of people.",
          "author": "General-Extent-756",
          "created": 1638900751,
          "upvotes": -3,
          "replies": {
            "hnmkabj": {
              "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmkabj/",
              "text": "Agreed, it's a really upstanding model for what they could be.",
              "author": "whatistheformat",
              "created": 1638904381,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hnmvz66": {
      "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmvz66/",
      "text": "You can pay to have friends",
      "author": "secondaccount55",
      "created": 1638909457,
      "upvotes": 1,
      "replies": {
        "hnmwyp9": {
          "link": "/r/college/comments/rb4gwh/what_are_the_positives_of_having_fraternities_and/hnmwyp9/",
          "text": "Exactly!",
          "author": "General-Extent-756",
          "created": 1638909880,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}