{
  "sid": "qs25g7",
  "link": "/r/college/comments/qs25g7/failing_all_my_classes_first_semester/",
  "title:": "Failing all my classes first semester?",
  "text": "I don't know what went wrong. At this point it seems like I can't do much. I started off alright. \n\nI'm taking like 4 classes. It's not even that much. I was a good high school student. It was more work in a week. But I messed up bad. I really only have issues with one class. The rest aren't even that bad so I don't know why I'm struggling.\n\nWhat should I do? I'm freaking out right now. I'm actually so worried and lost.",
  "author": "SwifferDuster11",
  "created": 1636687170,
  "updated": 1636745749,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkadvjk": {
      "link": "/r/college/comments/qs25g7/failing_all_my_classes_first_semester/hkadvjk/",
      "text": "what classes",
      "author": "lexpc13",
      "created": 1636687240,
      "upvotes": 1,
      "replies": {}
    },
    "hkazvy0": {
      "link": "/r/college/comments/qs25g7/failing_all_my_classes_first_semester/hkazvy0/",
      "text": "Hey, take a breath. Deep breath in through the nose, slowly exhale through the mouth. Do it again. \n\nNow, listen. It’s not too big of a deal to flunk a few classes. Worst comes worst, you’re just there for longer, and you’d be surprised at how many people end up going for 5 or 6 years in order to earn their bachelors degree. (Me included!)\n\nAlso, most classes you can retake to rewrite the grade so it won’t fuck with your GPA. Just make sure failing won’t mess up your scholarships.\n\nAnother tip is to just discuss with your professors and / or advisor how you’re feeling / doing. They will likely help you out!! If that does work, find your student success center on your campus (most have them) and come up a plan for your success!\n\nIt’s likely the lack of structure that you’re struggling with more than anything, and it’s definitely an adjustment but eventually you will find out what works for you. \n\nI hope this helped!!",
      "author": "LCHolland82700",
      "created": 1636699548,
      "upvotes": 1,
      "replies": {}
    }
  }
}