{
  "sid": "qxxdae",
  "link": "/r/college/comments/qxxdae/retaking_a_class_with_same_professor_who_taught/",
  "title:": "Retaking a class with same professor who taught it first time?",
  "text": "There’s a 50-50 chance that I don’t get the C required to move on to Calculus 3, so I may have to retake it next semester. The professor I have now is teaching a section and another professor I haven’t had before also. I was thinking to go with the one I didn’t have because my current professor isn’t making any sense, but on the other hand, he allows people to retake an exam once a semester and I don’t know how the other one does it. Any suggestions",
  "author": "ramman24",
  "created": 1637381104,
  "updated": 1637689313,
  "over_18": false,
  "upvotes": 23,
  "upvote_ratio": 0.97,
  "comments": {
    "hlcjh22": {
      "link": "/r/college/comments/qxxdae/retaking_a_class_with_same_professor_who_taught/hlcjh22/",
      "text": "Have you seen if either of them are on ratemyprofessor? This might give you a bit of a better idea as to what the other professor is like?",
      "author": "TFATFA1",
      "created": 1637381294,
      "upvotes": 15,
      "replies": {
        "hlcjv6a": {
          "link": "/r/college/comments/qxxdae/retaking_a_class_with_same_professor_who_taught/hlcjv6a/",
          "text": "It’s ironic because my current professor has a 4.2/5 on RMP, but the class Average is a 62 , and the other guy has a 2/5 on RMP.",
          "author": "ramman24",
          "created": 1637381512,
          "upvotes": 6,
          "replies": {
            "hlcuedr": {
              "link": "/r/college/comments/qxxdae/retaking_a_class_with_same_professor_who_taught/hlcuedr/",
              "text": "Then I’d stick with the same professor. The class average is only partly due to the professor, and very well could be due to the students. I know you said that this is a prerequisite for Calculus, so I’d try going online and finding someone who can essentially tutor you. Alternatively, you could get with a TA to seek additional help in the class. Just my 2 cents though.",
              "author": "TFATFA1",
              "created": 1637387920,
              "upvotes": 9,
              "replies": {}
            }
          }
        }
      }
    },
    "hlcrdsg": {
      "link": "/r/college/comments/qxxdae/retaking_a_class_with_same_professor_who_taught/hlcrdsg/",
      "text": "Well if u retake with same professor you’ll know what ur getting into and idk if ur school offers free tutoring but I’d try that",
      "author": "Yo_dog-",
      "created": 1637385956,
      "upvotes": 6,
      "replies": {}
    },
    "hlczwf5": {
      "link": "/r/college/comments/qxxdae/retaking_a_class_with_same_professor_who_taught/hlczwf5/",
      "text": "Been in the exact same situation as you. Just take the same prof its like the old expression \"better the bastard you know than the one you dont\" you know what to expect for the tests and the class as a whole \n\nGot a D+ and earned it frankly so had to retake and got A- \n\nIf I were you I'd just take the same prof if you don't pass this semester",
      "author": "Baumgartner025",
      "created": 1637391943,
      "upvotes": 5,
      "replies": {}
    }
  }
}