{
  "sid": "qtupwe",
  "link": "/r/college/comments/qtupwe/a_zero_on_homework/",
  "title:": "A Zero on Homework",
  "text": "Hi Reddit, \n\nSo for context I'm a 20 year old undergraduate junior majoring in physics and music. I am taking a graduate level music theory course at the music school affiliated with my university (very prestigious music school). I thought I was doing well in the course until I got a 79% on my midterm paper. I found out that she had taken off points on my rough draft as she wasn't pleased that there were minor flaws and imperfections and clunky explanations in the rough draft (yes, it was the rough draft, not the final draft). Then one day I had come to zoom class a couple minutes late because I was up late finishing physics problem sets and I had connection issues, so I submitted the homework right before I came in. In this class, homework is due at the beginning of class, and I submitted it only two minutes late. I got a comment from the professor saying that this was unacceptably late work and that I will be receiving a zero for this assignment. It was two minutes late. \n\nIs this normal for grad school? Will it only get more intense as I continue my graduate music theory next semester? I am struggling slightly in my upper level math and physics classes, but now I just feel extremely unfit for college. I have NEVER gotten a zero or even turned in a very late assignment, but now I have. Is this class just one fluke for me, or is this a sign I am in serious trouble in college?",
  "author": "SlowResearch2",
  "created": 1636910975,
  "updated": 1637181539,
  "over_18": false,
  "upvotes": 35,
  "upvote_ratio": 0.91,
  "comments": {
    "hkm1khd": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hkm1khd/",
      "text": "If the expectation is that you submit assignments on time, then that’s the expectation - late is late, no matter what. This is a common expectation not only for grad school but also for undergraduate courses. I wouldn’t take it as a sign that you’re in serious trouble when it comes to your intended path of study, but it would be a good idea to ensure you get things done and submitted prior to deadlines.",
      "author": "PhDapper",
      "created": 1636912050,
      "upvotes": 57,
      "replies": {}
    },
    "hkmojj6": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hkmojj6/",
      "text": "None of these things are bad. A 79 is a normal grade and you didn’t submit on time. It’s okay just do better next time",
      "author": "kapbear",
      "created": 1636920614,
      "upvotes": 16,
      "replies": {}
    },
    "hkm9p09": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hkm9p09/",
      "text": "Keep your chin up. It's just one assignment, and there's still time to bounce back. Take this as your wakeup call to be a bit more proactive. Some professors are a little more flexible on deadlines, but never take that chance unless you know for sure. In grad school there are fewer deadlines and you get past the whole homework every night/all the time thing, but the deadlines that do exist are meant to be met.",
      "author": "KaylamityJane",
      "created": 1636915120,
      "upvotes": 8,
      "replies": {}
    },
    "hkmyp5i": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hkmyp5i/",
      "text": "> Is this normal for grad school? Will it only get more intense as I continue my graduate music theory next semester?\n\nAs is also the case with undergrad, your mileage may vary depending on professor. As someone in STEM who has a music degree, I will say that I've personally found that music departments tend to be much stricter than math departments when it comes to deadlines. I believe that this is an outgrowth of the fact that if you're a gigging musician you'll more or less be blacklisted and have your career destroyed if you're late to a gig even once, but in math there are no deadlines in \"real life\" that are *that* important. Not sure about physics, but I've found that math has a way more laid back culture than music so you may want to be mindful that you'll have to adapt between different cultures if you're jumping between departments.",
      "author": "HumanDrinkingTea",
      "created": 1636924564,
      "upvotes": 6,
      "replies": {}
    },
    "hkm4jiv": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hkm4jiv/",
      "text": "Yes that is normal in most grad courses. Any late work is late work and gets a 0.",
      "author": "Turbulent-Rip-5370",
      "created": 1636913243,
      "upvotes": 15,
      "replies": {}
    },
    "hkmz5u4": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hkmz5u4/",
      "text": "I had an undergrad freshman level professor do this to me with an essay...some professors are just insanely strict.  I straight up wrote my essay so early that I forgot to submit it when it was finally due.",
      "author": "big_nothing_burger",
      "created": 1636924741,
      "upvotes": 3,
      "replies": {}
    },
    "hknm3vd": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hknm3vd/",
      "text": "This is the norm for grad school. If you are going for a PhD you are going to be applying for many, many grants and other academic opportunities. The deadlines for all of these things are exact -- applications close at midnight and there is no recourse if you are 30 seconds late. You should get used to submitting things 24 hours before the deadline.",
      "author": "Bravely-Redditting",
      "created": 1636934266,
      "upvotes": 2,
      "replies": {}
    },
    "hknppup": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hknppup/",
      "text": "It might not be normal but with alllll the time you had to submit the assignment you still were late?  You couldn’t have turned it in when you finished it?  And if you finished it two minutes after it was due that’s on you.",
      "author": "kryppla",
      "created": 1636935874,
      "upvotes": 2,
      "replies": {}
    },
    "hkplrc6": {
      "link": "/r/college/comments/qtupwe/a_zero_on_homework/hkplrc6/",
      "text": "I like to relate college to having a job, because that's exactly what it's preparing you for. \n\nTurning in an assignment late is unacceptable. It's as unacceptable as not meeting a deadline to have a deliverable ready for a client. Even a few minutes late is unacceptable. \n\nIt's a lesson to learn. A hard one to learn but still worth learning.",
      "author": "Awkward_Mail_2786",
      "created": 1636978088,
      "upvotes": 1,
      "replies": {}
    }
  }
}