{
  "sid": "qzre9q",
  "link": "/r/college/comments/qzre9q/is_it_worth_it_to_keep_going/",
  "title:": "Is it worth it to keep going?",
  "text": "Honestly is it worth it to keep going? Has anyone else started the process of dropping out? Has anyone here already dropped out? I’m a sophomore in my first semester and even after transferring back home and giving this second school a chance, things are still not working or getting better. \n\nI don’t know how to talk to people and am mostly just not liked and disarming, so I have absolutely no friends at all. Every time I try to connect and communicate with people, I completely shut down or embarrass myself. I used to be an extrovert but now I have no idea how to talk to people at all.\n\n\nMy grades are absolute shit. In my almost 2 years in college, I have not received a single A. My transcript is littered with C’s and D’s. I have changed my major/minor multiple times but every time I get further into taking the courses required, I run into problems and am too dumb to understand anything. I have (read: had) aspirations of going to law or business school but with the rate at which things are going now, it seems like I can kiss those dreams goodbye. \n\nI’m not achieving anything here, not fitting it, I’m stress, and honestly just feel like my life is going no fucking where and I can’t take it anymore.  \n\nDoes it actually get better or does it just get better for everyone else but not me?",
  "author": "Buffalo-Mountain",
  "created": 1637603886,
  "updated": 1637689054,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlog1tg": {
      "link": "/r/college/comments/qzre9q/is_it_worth_it_to_keep_going/hlog1tg/",
      "text": "Considering nothing is working for you, you might want to take a year off or drop out and figure out what you want to do. It’s better to take time off then spend years upon years on wasting time and money trying to decide what to do when you hate it. After you take time off, I would look at other schools since you don’t seem to be fitting in at your current school.",
      "author": "denver_rose",
      "created": 1637611227,
      "upvotes": 3,
      "replies": {}
    },
    "hlo3nyr": {
      "link": "/r/college/comments/qzre9q/is_it_worth_it_to_keep_going/hlo3nyr/",
      "text": "Honestly same about the whole “sick of college” and “cannot talk to people” thing (though it’s my first year in college) I’ve been through similar stuff and the semester is almost over but I still kinda feel horrible. My grades aren’t really that bad bc I’m actually interested in my major but I don’t know if ‘college’ itself is working for me. I’ve been a straight A student in high school and now I have a few B’s. My parents aren’t exactly happy about it. Socially, I’m not doing good at all. I recently started hanging out with a group of friends but one of them dropped out. Now I just feel lonelier if that’s possible. I’m in a different city with super shitty flatmates and they’re somehow happy. I miss my family and my friends that I left behind. I just wonder if college was worth it. Hope that we’re gonna get through it and go back to our happy and normal lives soon 🙂",
      "author": "Kelsey_Morris",
      "created": 1637606255,
      "upvotes": 1,
      "replies": {}
    },
    "hlouvbb": {
      "link": "/r/college/comments/qzre9q/is_it_worth_it_to_keep_going/hlouvbb/",
      "text": "i have been struggling with what to choose for my career path, currently im on my first year in uni studying business/econ , but my grades arent that good so i have been thinking of changing majors but i dont know what.Based on my experience business/econ major is boring and nothing interesting and pretty hard too but you can always challenge yourself.It really is a major that you have a lot of job opportunities but im thinking of changing it to something more interesting.At first what i thought was graphic design but i have to change universities for that bc they dont have that major here and its too much work.So rn my choice is Public managment and administration but im still not sure and idk if they pay well",
      "author": "imaslutforgojo",
      "created": 1637617204,
      "upvotes": 1,
      "replies": {}
    }
  }
}