{
  "sid": "r7ft4n",
  "link": "/r/college/comments/r7ft4n/is_it_appropriate_to_ask_professors_questions/",
  "title:": "Is it appropriate to ask professors questions (related to their field) that are more about curiosity than coursework?",
  "text": "Hopefully this question makes sense. I know it probably depends on the professor. I'm not trying to have an intense discussion or bother him, I just plan on going into his field (forest ecology) and I want to know more about how forest ecologists can research on protected land.\n\nIt's a plant ecology class, and we haven't gone into any research practices or ethics or really anything about a career in research, so I'm outside the bounds of the coursework. But he's researched riparian forest ecology extensively, and I want to research Pacific temperate rainforest ecology, so is it worth just asking him my questions to see if he has the time and bandwidth right now to give me some information?\n\nMaybe it's also a networking opportunity. I only have one other prof (my forest ecology lab PI) that I'm in one-on-one communication with. I'm getting to the end of my program and I don't want to waste opportunities to learn from others in my field and establish mentorship with profs who are willing to help me. I guess since most of my degree has been online I just don't really know the etiquette with this stuff.",
  "author": "whoontheplanetearth",
  "created": 1638475052,
  "updated": 1638479895,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmz5zh1": {
      "link": "/r/college/comments/r7ft4n/is_it_appropriate_to_ask_professors_questions/hmz5zh1/",
      "text": "Yes that’s fine. Ask if he would be willing to zoom or meet in his office about it.",
      "author": "rynpickles",
      "created": 1638476817,
      "upvotes": 1,
      "replies": {}
    },
    "hmz6var": {
      "link": "/r/college/comments/r7ft4n/is_it_appropriate_to_ask_professors_questions/hmz6var/",
      "text": "Of course! I love it when students show curiosity like this. It makes me so happy.",
      "author": "PhDapper",
      "created": 1638477148,
      "upvotes": 1,
      "replies": {}
    }
  }
}