{
  "sid": "rg42ch",
  "link": "/r/college/comments/rg42ch/thoughts_on_accounting_classes/",
  "title:": "Thoughts on Accounting classes",
  "text": "I am concerned at some of the comments made about  accounting classes and am seeking some input from others experiences, whether it was easy or challenging.",
  "author": "Sp3rmOrOvum",
  "created": 1639475115,
  "updated": 1639516043,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hoi70ju": {
      "link": "/r/college/comments/rg42ch/thoughts_on_accounting_classes/hoi70ju/",
      "text": "If you find accounting classes easy, then it’s a sign you should become an accountant. If the classes are hard (as they are for most people), then accept you’re normal and live your life.",
      "author": "peakfreak18",
      "created": 1639486180,
      "upvotes": 3,
      "replies": {}
    },
    "hoirf5c": {
      "link": "/r/college/comments/rg42ch/thoughts_on_accounting_classes/hoirf5c/",
      "text": "Depends on the class, financial and managerial can be pretty easy depending on prior knowledge. It’s cost and intermediate accounting that most struggle with. Both are weed out courses and are often taken right after the easier Financial and managerial classes. As a result, students don’t realize they need to study and end up failing.",
      "author": "DoodleBobWon",
      "created": 1639496060,
      "upvotes": 3,
      "replies": {}
    },
    "hoitviw": {
      "link": "/r/college/comments/rg42ch/thoughts_on_accounting_classes/hoitviw/",
      "text": "I earned my BS in accounting last spring. Financial 101 and managerial 101 came easy to me. So much so, that the Professor encouraged me to change my major from business to accounting as I was naturally good at it and enjoyed it. I studied a little for the 101 courses and had no issues getting very high As. Intermediate 1 & 2 is where it gets hard. Classes like fed taxes, forensics, auditing, and advanced accounting were relatively easy for me. \n\nSo to answer your question, 101 finance and 101 managerial are easy if you’re willing to learn and put in some effort.",
      "author": "Midwestniceish",
      "created": 1639497051,
      "upvotes": 2,
      "replies": {}
    }
  }
}