{
  "sid": "qsg9ws",
  "link": "/r/college/comments/qsg9ws/should_i_go_for_medical_assistant_or_accounting/",
  "title:": "Should I go for Medical Assistant or Accounting?",
  "text": "Ughhh I don't know what to do.",
  "author": "imeltinthishurricane",
  "created": 1636738257,
  "updated": 1636745430,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkcu0xa": {
      "link": "/r/college/comments/qsg9ws/should_i_go_for_medical_assistant_or_accounting/hkcu0xa/",
      "text": "The day to day jobs of both those careers are likely quite different, so look into what your life will be like after you graduate. They don't seem like very similar careers (to me, at least) so you'll probably find that if you look more into the \"day to day life\" of each of these careers, you'll be more likely to lean one way or the other.",
      "author": "HumanDrinkingTea",
      "created": 1636738407,
      "upvotes": 1,
      "replies": {}
    },
    "hkcxo7p": {
      "link": "/r/college/comments/qsg9ws/should_i_go_for_medical_assistant_or_accounting/hkcxo7p/",
      "text": "Completely different jobs and work schedule. One works with people, the other numbers at a desk prob all day. Med Assistant has various work hours poss 7 days/week and Accounting mainly 8-5pm M-F except in tax season which are long hours. I’d pick what you think you’d enjoy what you do the most and find interesting. Good luck!",
      "author": "krismap",
      "created": 1636739876,
      "upvotes": 1,
      "replies": {}
    },
    "hkd50v4": {
      "link": "/r/college/comments/qsg9ws/should_i_go_for_medical_assistant_or_accounting/hkd50v4/",
      "text": "I'd do neither. Working for someone else your whole life sets you up to be a wage slave at the mercy of someone else. I graduated college but Its gotten me nothing. I started my own business from nothing and now I set my own hours and I don't have to worry about driving somewhere to pretend to give a shit about someone else's mission and goals",
      "author": "ManufacturerNo80",
      "created": 1636742926,
      "upvotes": 1,
      "replies": {}
    }
  }
}