{
  "sid": "rbjjc6",
  "link": "/r/college/comments/rbjjc6/im_going_to_fail_some_classes_and_dont_know_what/",
  "title:": "I'm going to fail some classes and don't know what to do",
  "text": "I'm a freshman about to \"finish\" my first semester of college and I am probably going to fail a couple of classes. I am technically passing everything right now, but all of my grades are around 74-78%. I have NEVER been a good test taker in my life, have learned next to nothing all semester, and have no idea how to study in college, so I don't believe that I have a chance to cram and get super high scores on my final exams. One of my final exams is worth 30% of my grade and I don't even think I will be able to get a 50% on the final. I would be doing much better if I wasn't suffering from extreme anxiety and depression (I have struggled with these my whole life, college amplified things to new levels I have never experienced), and if my parents weren't paying for everything. My parents have no idea of how bad I am doing academically, physically, and mentally. I am at the absolute worst point of my entire life (so far). \n\nWhat should my first steps after failing be?",
  "author": "troyybanks",
  "created": 1638940637,
  "updated": 1639517259,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hnooqzo": {
      "link": "/r/college/comments/rbjjc6/im_going_to_fail_some_classes_and_dont_know_what/hnooqzo/",
      "text": "Register with the disability office. You can get accommodations for things like depression. Depending on how severe it is you may even qualify for a medical withdrawal, chat with your doctor.",
      "author": "SouthernRhubarb",
      "created": 1638941036,
      "upvotes": 5,
      "replies": {
        "hnq8eua": {
          "link": "/r/college/comments/rbjjc6/im_going_to_fail_some_classes_and_dont_know_what/hnq8eua/",
          "text": "You can also register for the anxiety which is likely to get you extended time on exams.",
          "author": "veanell",
          "created": 1638978210,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hnp10x7": {
      "link": "/r/college/comments/rbjjc6/im_going_to_fail_some_classes_and_dont_know_what/hnp10x7/",
      "text": "Hey, it's okay. It's going to be okay.\n\nI know this sucks. The first time I failed a college class, I cried. It stings and I know that it sucks. But, you will get through this. If your parents love and understand you, they'll probably be understanding of what you're going through, especially since this is your freshman year and this is a big adjustment for you. You're young and they're probably expecting you to make some mistakes, everybody does when they're fresh out of high school trying to navigate an adult world. This is coupled on top of the life-long anxiety and depression that you have and that they should know that you have.\n\nAs SouthernRhubarb said on here, register with the disability office to get proper accommodations. You might also be able to drop these classes with an excused medical withdrawal due to your mental health, which would have no effect on your GPA. I would contact your school about this ASAP however (likely the registrar, or start by contacting the help desk to ask who you should contact to get an excused withdrawal for medical reasons) because I'm not sure when the last day to do this at your college would be.\n\nAnyways, you might have struggled this semester but you now have a better understanding of what college is like by being in these classes. Look up tips on how to study for college classes, and learn from what you did this semester so that you can improve for your next.\n\nYour life is just now beginning, and this is only a small bump in the road. This is going to be okay in the end.",
      "author": "ThoughtCenter87",
      "created": 1638950393,
      "upvotes": 4,
      "replies": {}
    },
    "hnq65v5": {
      "link": "/r/college/comments/rbjjc6/im_going_to_fail_some_classes_and_dont_know_what/hnq65v5/",
      "text": "Ideally, you buckle up and study so you don’t fail. I also recommend telling your parents sooner than later that you’re struggling.\n\nI was exactly where you are now when I was a freshman. It’s 15 years later, and things have turned out great. But, that was the hardest time of my life, and I wouldn’t go back and re-live it for all the money in the world. My first semester gpa was a 1.6.\n\nMy parents were mad, but understanding when they found out over break. I waited until my grades were in, and the anxiety waiting kind of ruined the time off. I switched majors second semester and brought a car to campus, but struggled even more. My grades were worse, and I lost my academic scholarship. I decided to drop out rather than make my parents pay full price for tuition. I’d gone to an engineering schools because it was the best for my original major. In the end, I hated it and felt aimless after giving up on engineering since it had been part of my identity.\n\nTransferring with such low grades is impossible. I couldn’t even transfer to state schools, but was lucky enough to call in a favor and get special acceptance to a prestigious liberal arts school.\n\nI enjoyed the liberal arts school, but having missed freshman year it was difficult to break in to the social scene. I’d done greek life freshman year, and was able to transfer that to the local chapter. It was fun, and I liked the guys but my mental health still suffered. My grades weren’t great, but I was able to get things up to a B average for the year. \n\nAfter sophomore year, I said f*ck it and applied to transfer to my local state school. I researched the requirements, drove myself down for an interview (I had to buy my first dress clothes for it), made a resume, and got it on probation. \n\nMy first semester at the state school was the first time I really took ownership of everything in my life. I was so scared of failing by that point. High school had been so easy, and I had been so accomplished, two years of failure really did a number on my self esteem.\n\nI was able to grind it out that fall, and maintain the success going forward. It was hard, but I learned a lot of important lessons and life hacks along the way. A lot of the journey was lonely. I’m happy to share advice if you want it, but just know that things will be ok. Not right away but eventually. Just keep trying.\n\nToday, I’ve worked at the Big Four, did forensic accounting, now do strategy and data analytics for a major tech company. I got married, bought a house, and own a chain of restaurants on the side. I make over $300k a year in salary, and don’t really feel the pressure of money anymore.\n\nIf I told Freshman me how things would turn out, he wouldn’t believe me. I also know that the struggle of fighting through what felt like self-inflicted adversity made me into the successful person I am today.\n\nFeel free to dm me for advice.",
      "author": "peakfreak18",
      "created": 1638977285,
      "upvotes": 3,
      "replies": {}
    }
  }
}