{
  "sid": "q15x9x",
  "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/",
  "title:": "How to conquer Anxiety when asking or participating in class",
  "text": "Hey guys, do you guys know anything in how to conquer this fear? I participated once and i was so off with my answers and i feel like i’m just wasting time whenever i ask questions because mine are so basic.",
  "author": "AveryKindDude",
  "created": 1633355745,
  "updated": 1634084123,
  "over_18": false,
  "upvotes": 51,
  "upvote_ratio": 0.97,
  "comments": {
    "hfd0flq": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfd0flq/",
      "text": "Don’t care, literally. I have anxiety/panic disorder so participating in class can be really stressful bc if i said something off or wrong I would think about it the rest of the day but try to remember thats just our heads playing with us and the majority of people in class aren’t paying that close of attention anyway.",
      "author": "rynpickles",
      "created": 1633361781,
      "upvotes": 31,
      "replies": {
        "hfd1wq7": {
          "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfd1wq7/",
          "text": "Kinda true though… my classmates aren’t really listening x)",
          "author": "AveryKindDude",
          "created": 1633362405,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfdb5su": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfdb5su/",
      "text": "It’s pretty silly, but what helps me is that I tell myself I am paying for education, not for peers to judge me. I want the most out of my money and I will participate whether it is embarrassing or not. Then I don’t let myself analyze what I said.",
      "author": "juicylute",
      "created": 1633366039,
      "upvotes": 10,
      "replies": {}
    },
    "hfcnxrk": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfcnxrk/",
      "text": "Be the expert in your topic. You want to ask questions to further your and your peers pursuit of knowledge. Avoid “what if?” questions but hit the points you assume others might have. Make friends in each class and develop a circle you can communicate the lessons taught. Practice forming the questions in a way that is natural for you and then go back and reiterate for perfection. Practice makes perfect brother, you are at college. You’re a scholar now, never stop asking questions!",
      "author": "schnozbanger69",
      "created": 1633356212,
      "upvotes": 6,
      "replies": {
        "hfcrf09": {
          "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfcrf09/",
          "text": "Got it! Thanks dude",
          "author": "AveryKindDude",
          "created": 1633357792,
          "upvotes": 2,
          "replies": {
            "hfdz275": {
              "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfdz275/",
              "text": "And always give positive feedback. Try not to give negative remarks, in that regard stay neutral but always be confident about whatever you’re stating at that moment. Convince yourself 100% it’s your way and no other way. Great tool. Glad to help.",
              "author": "schnozbanger69",
              "created": 1633374937,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfdbs46": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfdbs46/",
      "text": "Know that everyone else who isn’t talking is in the same boat as you. Imagine one of your fellow students misunderstood the question but answered anyway or stuttered over their words. You wouldn’t think they’re an idiot or a loser, you’d be empathetic of how nervous or anxious they are. That’s how everyone else will feel toward you. Speaking up also has some definite benefits. Regardless of whether or not your question/answer is smart or good, it’ll make you look confident to your fellow students and your professor will like you more for participating. I also struggle with speaking up a lot of the time, but when I muster up the courage, this is what I told myself.",
      "author": "Masterfulidea",
      "created": 1633366272,
      "upvotes": 6,
      "replies": {}
    },
    "hfd1oby": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfd1oby/",
      "text": "When I asked questions in class I legit had complete strangers come up to me afterward and say \"thank you for asking questions I was totally confused but always am afraid to ask\"",
      "author": "emeriktreskovik",
      "created": 1633362310,
      "upvotes": 6,
      "replies": {
        "hfd23zm": {
          "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfd23zm/",
          "text": "Thats really great! Unfortunately i haven’t experienced that, but i’ll try my best to participate",
          "author": "AveryKindDude",
          "created": 1633362491,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfdj34k": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfdj34k/",
      "text": "Sometimes you just gotta blurt out the wrong answer when the class is silent enough and then realize nothing happened. \n\nOne way to deal with it is that nervousness and excitement are kind of the same thing, so try to get excited about it. My professors love class participation, so I try to help them out. Sometimes I blurt the wrong answer, but then other people start answering.",
      "author": "guy_with-thumbs",
      "created": 1633369026,
      "upvotes": 2,
      "replies": {}
    },
    "hfdrtev": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfdrtev/",
      "text": "I know it counts as part of my grade so I suck it up",
      "author": "TragicalKingdom",
      "created": 1633372259,
      "upvotes": 2,
      "replies": {}
    },
    "hfdsphj": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfdsphj/",
      "text": "What you're afraid of is probably looking stupid and sounding dumb by asking/participating. But I promise you, I can't count the times someone asked the question I needed to ask but was too nervous to actually do so. \n\nAt some point I realized that I can't be the only one feeling that same way, so there was no reason to feel the way I did",
      "author": "Tusk617",
      "created": 1633372589,
      "upvotes": 2,
      "replies": {}
    },
    "hfdzee7": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfdzee7/",
      "text": "Unless you're trying to become friends with people who judge you for asking certain questions in school you shouldn't worry about what they think. Also every time you do something that you have anxiety about it gets a little easier. This is coming from someone with diagnosed social anxiety.",
      "author": "torpedokid983",
      "created": 1633375064,
      "upvotes": 2,
      "replies": {}
    },
    "hfew4cc": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfew4cc/",
      "text": "Your questions might be helping someone who is too anxious to even try to ask.",
      "author": "Animasylvania",
      "created": 1633387646,
      "upvotes": 2,
      "replies": {}
    },
    "hff2mvi": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hff2mvi/",
      "text": "If you have a question or are confused about something, 100% of the time someone else also has that question. Continuing the discussion helps others as well. In any case, you're paying for classes to learn and you're not learning if you're not engaging. You can also always hold your question until after class, meet with your professor at office hours, or email them if it makes asking questions easier.",
      "author": "NathanJ529",
      "created": 1633390923,
      "upvotes": 2,
      "replies": {}
    },
    "hfe8p0b": {
      "link": "/r/college/comments/q15x9x/how_to_conquer_anxiety_when_asking_or/hfe8p0b/",
      "text": "Guilt trip yourself into answering",
      "author": "toofeduptocare",
      "created": 1633378441,
      "upvotes": 1,
      "replies": {}
    }
  }
}