{
  "sid": "qthpvz",
  "link": "/r/college/comments/qthpvz/why_am_i_not_having_fun/",
  "title:": "Why am I not having fun?",
  "text": "I grew up believing that college would be the best time of my life. But so far it hasn’t lived up to that. Before you say I’m an introverted loser, I have talked to new people and gone out of my comfort zone to try new things and meet new people. However, being told all about how great college is supposed to be, I don’t feel like it’s as great as I was told. What am I doing wrong?",
  "author": "losty19",
  "created": 1636863135,
  "updated": 1637181947,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkjpz13": {
      "link": "/r/college/comments/qthpvz/why_am_i_not_having_fun/hkjpz13/",
      "text": "What year are you? Your more exciting times may be just around the corner.\n\nYou may have also set your expectations too high. Honestly, a lot of people end up disappointed with college. And that's ok. It can vary greatly depending on your personal background, income, etc. Try to make the best of it any way you can and don't dwell too much on the boring/negative times.",
      "author": "Saint_Skivey",
      "created": 1636864203,
      "upvotes": 3,
      "replies": {}
    },
    "hkkvfb1": {
      "link": "/r/college/comments/qthpvz/why_am_i_not_having_fun/hkkvfb1/",
      "text": "you’re not doing anything wrong. there’s just an unrealistic version of college in pop culture and besides, it’d be sad if the four years or whatever you spend in college are the “best years of your life.” \n\ni’m disappointed by my college experience too but still try to savor the good moments. college really is what you make of it, friends and parties and all that don’t just come to you, you have to go out and make to effort to have them. so if you want to make new friends you should reach out to the people in your classes or join a club or something like that. you got this, hope things get better for you.",
      "author": "chloeclaypipe",
      "created": 1636891921,
      "upvotes": 2,
      "replies": {}
    }
  }
}