{
  "sid": "rbivgn",
  "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/",
  "title:": "How to make friends in college?",
  "text": "Hi all, I’m about to go to college next year and I’m super nervous about how to make new friends. How do I do it? :(",
  "author": "Curious-A--",
  "created": 1638938433,
  "updated": 1639517285,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hnoohxh": {
      "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnoohxh/",
      "text": "Hm, hopefully you choose a college that fits you.  Some prefer huge schools others prefer smaller more intimate schools.  Also, staying in a dorm would help.  \n\nHave you had a hard time making friends in high school?",
      "author": "MetaBrains",
      "created": 1638940872,
      "upvotes": 3,
      "replies": {}
    },
    "hnothnd": {
      "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnothnd/",
      "text": "Talk to people, do activities, be proactive about reaching out. Don't hide in your room all day and then wonder why no one is magically appearing to be your BFF.\n\nEDIT: and it takes time, there is no real time limit, so don't feel like you've missed the window the first few weeks or whatever...you can meet people like 6 months in and they're your BFF",
      "author": "NinjaLorian",
      "created": 1638944348,
      "upvotes": 3,
      "replies": {}
    },
    "hnpk9fi": {
      "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnpk9fi/",
      "text": "Best advice I got was to immediately join societies. Met the majority of my friends though that. Forming or joining study groups also helps since you’ll be seeing them a lot. But dont stress about it, honestly, youll find mates once you get used to campus life :)",
      "author": "Caskinbaskin",
      "created": 1638966322,
      "upvotes": 2,
      "replies": {}
    },
    "hnrtyey": {
      "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnrtyey/",
      "text": "There's a lot of good advice here and hopefully things will work out but when I was a freshman last year I wondered the same thing so wanted to share what helped me. It's a little different depending on the college (which country, if it has greek life, how large, etc.) but really it does boil down to just initiating conversations with people. I was a shy introvert going to college but was determined to make friends since I didn't know anyone where I was going. I watched a ton of youtube videos (like channels like charisma on command) and listened to a lot of podcasts that helped, but this one video I recently saw distilled a lot of that advice when it comes to college: [https://youtu.be/k6R8rWs2hV0](https://youtu.be/k6R8rWs2hV0) .  \nBasically the guy walks through how to start and hold a conversation with a stranger where THEY do most of the talking so you can just listen (that was key since I'm an introvert with social anxiety). And his tactic is to MEET people, not necessarily try to be friends with them. When doing this there's no pressure with who you talk to. You aren't assuming every person you meet will be your friend. But out of a lot of the ones you talk to, you'll surely find a few good friends. Just starting the conversation is the hardest.  \nHe says to start by saying \"Hi I haven't met you yet, I'm \\_\\_\\_\\_\\_\\_\\_\\_\" when in a food court line, beside a stranger at a basketball or football game, at welcome week events, at your dorm etc. Then once the basic introduction is out of the way ask where they're from or if it's a group ask how they know each other (this is where being at college makes it easier to meet people since you can ask questions like this to anybody and it's acceptable). Then he mentions several follow up questions that get the person to talk like \"what's your major\" then asking \"why did you choose that?\" As the person talks they will reveal things about themselves that you can use to keep the conversation going like if they like movies or if they worked a cool job or if they like a certain type of music. And if nothing comes up to keep the conversation going, then use those same tactics to meet someone else until you find someone you click with. The video goes into more detail if you're interested, but that sums it up and really helped me. It sounds hard, but as an introvert I was able to use these tactics to meet new people and become friends with them at my college.",
      "author": "Miserable-Minion",
      "created": 1639000322,
      "upvotes": 2,
      "replies": {}
    },
    "hnov7o2": {
      "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnov7o2/",
      "text": "be a drinker or be good looking gym person 😁\n\ncollege people are very fake - you may have hard time making friends that plan around you, especially if you lack cash! so, focus on doing the studying",
      "author": null,
      "created": 1638945676,
      "upvotes": 1,
      "replies": {
        "hnq9wuy": {
          "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnq9wuy/",
          "text": "U good? Sounds like people in college may have let you down or weren’t good.",
          "author": "flame13438",
          "created": 1638978818,
          "upvotes": 1,
          "replies": {
            "hnqg17q": {
              "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnqg17q/",
              "text": "it is my fault if people have let me down! I am very much a loser! 😭",
              "author": null,
              "created": 1638981264,
              "upvotes": 0,
              "replies": {
                "hnqg8tq": {
                  "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnqg8tq/",
                  "text": "Don’t call yourself that. Just join some clubs that are off intrest. Doing be afraid  to say hello to others. Maybe join their discord. Best wishes and goodluck",
                  "author": "flame13438",
                  "created": 1638981346,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnp8kq5": {
      "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnp8kq5/",
      "text": "Clubs, activities, study groups, church, etc.\n\nAll of mine I've met through clubs.",
      "author": "Gamerz1818",
      "created": 1638957087,
      "upvotes": 1,
      "replies": {}
    },
    "hnxtldc": {
      "link": "/r/college/comments/rbivgn/how_to_make_friends_in_college/hnxtldc/",
      "text": "You don’t.",
      "author": "affennlight",
      "created": 1639105544,
      "upvotes": 0,
      "replies": {}
    }
  }
}