{
  "sid": "q27kew",
  "link": "/r/college/comments/q27kew/is_it_possible_to_transfer_into_the_freshman_grade/",
  "title:": "Is it possible to transfer into the freshman grade",
  "text": "Sorry if this is the wrong place to post. I recently started my freshman quarter and I’m really not enjoying my time at my current 4-year university. I know it’s still early so I’m still trying to meet new people, attend clubs, etc. But I have a sinking feeling that my current university is not for me. So my question is is there an option of just transferring at the end of the year, after I attended one year/quarter of college, to another university but just to join the freshman class and not the sophomore class in order to get another fresh start?",
  "author": "Bruh70986",
  "created": 1633473985,
  "updated": 1634083786,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfjg7yx": {
      "link": "/r/college/comments/q27kew/is_it_possible_to_transfer_into_the_freshman_grade/hfjg7yx/",
      "text": "Straight up that’s impossible because you status (example freshman,sophomore,junior etc..) is mostly based on credits. So if you have 24 credits or more  already you’re automatically a sophomore but if you have less than that than you’re a freshman",
      "author": "DotemupS",
      "created": 1633475934,
      "upvotes": 1,
      "replies": {
        "hfjgu11": {
          "link": "/r/college/comments/q27kew/is_it_possible_to_transfer_into_the_freshman_grade/hfjgu11/",
          "text": "But what if I decide not to transfer over some of the credits I earned to be below the sophomore threshold?",
          "author": "Bruh70986",
          "created": 1633476233,
          "upvotes": 1,
          "replies": {
            "hfjh71a": {
              "link": "/r/college/comments/q27kew/is_it_possible_to_transfer_into_the_freshman_grade/hfjh71a/",
              "text": "Unfortunately college is not like that, your credits is going to be on your official transcript and that’s how they go about things. \nBut there’s another trick if you’re looking to transfer some of your credits from the college you’re in may not transfer to the other college because they have different syllabus so yeah there’s a way and that’s the only way",
              "author": "DotemupS",
              "created": 1633476414,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hfk25xn": {
      "link": "/r/college/comments/q27kew/is_it_possible_to_transfer_into_the_freshman_grade/hfk25xn/",
      "text": "You're not gonna be technically a freshmen if you have over a certain number of credits, but nothing is stopping you from taking a 5th year of college to get the 4 year experience.",
      "author": "GoldRequest",
      "created": 1633486867,
      "upvotes": 1,
      "replies": {}
    }
  }
}