{
  "sid": "qb24ig",
  "link": "/r/college/comments/qb24ig/i_cant_write_essays_about_myself_help/",
  "title:": "I can't write essays about myself, help?",
  "text": "I have a first-year seminar class that is requiring me to write a bunch of essay about myself, and I just can't do it. Every single time I open that Word Doc to begin, I just end up staring at a blinking cursor for 2 hours. Every so often, I'll type out a sentence, but then I will immediately delete it because it just doesn't sound like me.\n\nThe prompt for this essay is \"How have you changed since coming to college?\" and the thing is... I haven't. Sure, my surroundings have changed and I've slightly adjusted my day-to-day schedule, but my personality is the same. My interests and hobbies are the same. Plus, it's only been about 8 weeks since I started college, so that's not a lot of time for personal growth to occur.\n\nI have to write two single-spaced pages on this. I'm clueless on where to even begin. Help?",
  "author": "roaringleu",
  "created": 1634611238,
  "updated": 1634654401,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh6sorx": {
      "link": "/r/college/comments/qb24ig/i_cant_write_essays_about_myself_help/hh6sorx/",
      "text": "Maybe what surprised you coming to college. And you can just write the truth that you didn’t change much, and maybe examples of what stayed the same. Maybe write about how the changed surroundings made you feel. Talk about your goals by the end of the year maybe, and what you’d like to start on in order to reach those goals.",
      "author": "Chokoreitodisku",
      "created": 1634611697,
      "upvotes": 3,
      "replies": {}
    },
    "hh6swjp": {
      "link": "/r/college/comments/qb24ig/i_cant_write_essays_about_myself_help/hh6swjp/",
      "text": "Honestly just exaggerate the small changes. “I was a morning person, now I’m a night owl.” Not everything you say for the essay needs to be 100% true. Nobody is going to fact check your life. You obviously shouldn’t make up an outrageous lie but something that wouldn’t be so far fetched is a good place to start.\n\nYou can try to approach it in the compare and contrast way. I have always been xyz, but since coming to college I have utilized my organizational skills to manage my free time and day to day life. There may be a kind of “universal change” that every student goes through when they transition from high school to college. Those would make great points for your essay",
      "author": "milk1tea",
      "created": 1634611806,
      "upvotes": 2,
      "replies": {}
    },
    "hh782jx": {
      "link": "/r/college/comments/qb24ig/i_cant_write_essays_about_myself_help/hh782jx/",
      "text": "If it makes you feel any better, depending on your major this may never end. I’m a senior and they’re still giving us BS personal reflections. \n\nIf I can’t come up with anything I usually just lie and write a bunch of fluff.",
      "author": "ilikecacti2",
      "created": 1634620872,
      "upvotes": 1,
      "replies": {}
    },
    "hh7ri4j": {
      "link": "/r/college/comments/qb24ig/i_cant_write_essays_about_myself_help/hh7ri4j/",
      "text": "I always combat the empty-page intimidation with an outline. Intro-body-conclusion. Then I change the body to 3-5 topics-- like other commenters suggested, start small. Then write one sentence for each topic-- make it super simple. \"Since coming to college, I have become more independent.\" Do that for each topic and then start filling in details",
      "author": "biggestbaddestnerd",
      "created": 1634637728,
      "upvotes": 1,
      "replies": {}
    }
  }
}