{
  "sid": "rc0vun",
  "link": "/r/college/comments/rc0vun/as_a_hs_junior_should_i_take_emails_from_colleges/",
  "title:": "As a hs junior should I take emails from colleges seriously?",
  "text": "I’m a class of 23 and I have recently gotten emails from a few really good colleges, but I’m not sure what I should do with them. I’m interested in one of the colleges but I haven’t looked at the other. Should I think these colleges want me or should I keep them as an afterthought?",
  "author": "Ilovebrawlstars86",
  "created": 1638997276,
  "updated": 1639517197,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.67,
  "comments": {
    "hnrs34e": {
      "link": "/r/college/comments/rc0vun/as_a_hs_junior_should_i_take_emails_from_colleges/hnrs34e/",
      "text": "It’s nothing but spam.",
      "author": "yshsclg",
      "created": 1638999591,
      "upvotes": 6,
      "replies": {}
    },
    "hnrob5o": {
      "link": "/r/college/comments/rc0vun/as_a_hs_junior_should_i_take_emails_from_colleges/hnrob5o/",
      "text": "I didn't. Only looked at the ones I applied for. If you're uninterested in the college unsubscribe. And don't sign up for those \"give colleges my information\"",
      "author": "WastedHaste",
      "created": 1638998145,
      "upvotes": 3,
      "replies": {}
    },
    "hnrzrr4": {
      "link": "/r/college/comments/rc0vun/as_a_hs_junior_should_i_take_emails_from_colleges/hnrzrr4/",
      "text": "No. They’re just marketing emails that colleges send because they want more students to apply.",
      "author": "Fleur498",
      "created": 1639002633,
      "upvotes": 2,
      "replies": {}
    },
    "hnsbpyp": {
      "link": "/r/college/comments/rc0vun/as_a_hs_junior_should_i_take_emails_from_colleges/hnsbpyp/",
      "text": "no. that's how they get you. they send out these automatic emails once you've done the SAT or PSAT or any big exams, so these colleges can take your money & you end up being in debt",
      "author": "vibinggrass",
      "created": 1639007760,
      "upvotes": 1,
      "replies": {}
    },
    "hnsiahm": {
      "link": "/r/college/comments/rc0vun/as_a_hs_junior_should_i_take_emails_from_colleges/hnsiahm/",
      "text": "No they’re just mass emails send out to everyone who applied. Only reply to the college you’re actually planning on going to, if you need to",
      "author": "Plaintivex",
      "created": 1639010721,
      "upvotes": 1,
      "replies": {}
    },
    "hntr7om": {
      "link": "/r/college/comments/rc0vun/as_a_hs_junior_should_i_take_emails_from_colleges/hntr7om/",
      "text": "A majority of those are spam and marketing emails from various private and career specific colleges that have no admission rates and charge high tuition. Simply put, they want your money. Why accept offers from colleges that you don't know, or don't even offer the major you want?\n\nBy the time you reach senior year, you'll have the opportunity apply for the universities you want to go into, as well as the major you want to pursue. And different colleges offer different majors and classes. A major in one college might not be offered in another. So it's best to start researching about the major you want to pursue, and then see which colleges offer that major. Legitimate and prestigious public 4-years with low admission rates don't come to you. You come to them.",
      "author": "ecstatic-hatter",
      "created": 1639034029,
      "upvotes": 1,
      "replies": {}
    }
  }
}