{
  "sid": "r4ccy6",
  "link": "/r/college/comments/r4ccy6/how_to_get_into_college_when_youre_absolutely/",
  "title:": "How to get into college when you’re absolutely horrible at math?",
  "text": "It might be A.D.H.D, or within the autistic spectrum but I cannot for the life of me get a grip on math. Never have, even in high school when I often retouched on the subject. \n\nI’m now (23 M) and would like to take classes but I fear just not being cut out for it. To give you guys an idea of just how bad it is in h.s the farthest I got was Algebra 1 and some geometry. But that was with the help of a lot of people lol. \n\nAnyone also bad at math and in college? How did you do it and how is it going?",
  "author": "mr_bananabeans",
  "created": 1638128151,
  "updated": 1638206799,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hmfs42q": {
      "link": "/r/college/comments/r4ccy6/how_to_get_into_college_when_youre_absolutely/hmfs42q/",
      "text": "I was awful at math. When you apply for college most make you do a placement test, especially community colleges. Where you place on that test is which math class you need to start with. \n\nI was awful at math and placed pretty badly. I took the recommended college math classes and aced every single one then went on to ace the college level. In college professors have office hours, and most have tutoring centers also. If you use all the resources and practice you may be better at math than you think! I never thought I'd be able to ace a math class, but I did! (I also have ADHD) \n\nGood luck, you got this!!",
      "author": "court114",
      "created": 1638128946,
      "upvotes": 3,
      "replies": {}
    },
    "hmfsrfz": {
      "link": "/r/college/comments/r4ccy6/how_to_get_into_college_when_youre_absolutely/hmfsrfz/",
      "text": "I also was absolutely terrible at math & math-heavy science in high school, but I was required to take 4 years so I had to do Algebra 2, Trig, Pre-Calc & Calc and then I stupidly decided to take statistics. I was mostly interested in liberal arts schools where math is not at all important. My college only requires that we take one math or science course (unless we major in a related field) so next semester I'm taking Intro Astronomy and then I'm completely done. \n\nMy mom was also bad at math, but at her medium/large state school she managed to find math courses specifically intended for her major (education) that were significantly easier than most college level math courses. \n\nI'd say your best bet is to finish on any graduation requirements (but mostly focus on courses you're the most interested in) & find intro level math courses to complete those, and if you're still really struggling, work with your professors and tutors to get through (you only need a C to pass lol).",
      "author": "osrpokerchamp",
      "created": 1638129208,
      "upvotes": 1,
      "replies": {}
    },
    "hmho68i": {
      "link": "/r/college/comments/r4ccy6/how_to_get_into_college_when_youre_absolutely/hmho68i/",
      "text": "I was awful at math, but my major only required Algebra, so I only took Algebra. Once I passed the class I never thought about math again (aside from a few elective courses which involved arithmetic).\n\nMaybe avoid a STEM field, but you would be fine!",
      "author": "DrAlawyn",
      "created": 1638158233,
      "upvotes": 1,
      "replies": {}
    }
  }
}