{
  "sid": "qjy4nr",
  "link": "/r/college/comments/qjy4nr/art_school_college/",
  "title:": "art school college",
  "text": "hallow!! I have been on Reddit for a bit but this is my first time posting.\n\nsee, I am 19, haven’t been to college yet but have been debating and figuring out if I even want to go, and even what I want to do. I have numbed down a bit what I want to do, and I have decided I want to go to college, but for college I want to try to go somewhere else, I have lived in the same town all my life, and as much as I love this town I want to try and go somewhere else, I don’t really like being in the same place for to long and I’m looong overdue for a bit of a change.\n\nfirst hit, as I said I am not to good at staying still, so jobs where I could travel did occur, but I want to do something I will really enjoy, pay has never exactly meant that much to me as long as I can live, I do like to buy and do things I enjoy, but I am kind of a simple person. I do get well into the more artistic things like music, acting, photography, and even design (interior design and clothes design, things like that, though I would not say I am quite as good) so I feel an art school would be a good hit for me?? I don’t know what do you think??\n\nsecond hit, I am so bad at doing my research, I plan to still try and do my own research and everything, but I figured a good way to go may also be here, hopefully find people who go to art school and ask them on their opinion and such, even people who go to regular college may even know more than I do, so any advice or opinions you can give on the topic would be extremely helpful and I would be very great full, thank you.",
  "author": "shylittledoll",
  "created": 1635712479,
  "updated": 1636178987,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hitgec2": {
      "link": "/r/college/comments/qjy4nr/art_school_college/hitgec2/",
      "text": "I feel for what you like college will just leave you in debt when you could start learning these art skills yourself. You're better off getting a basic job roommating with people even better if they are artist themselves. Then growing a portfolio in photography/art/design putting it online selling your services. My friend went to photography school and regrets it so much because she said all that stuff is on some youtubers skill share and took less money. She still has to get her own business off the ground. If I were to pick a degree that would help you it would be marketing/business since getting clients would be the goal. If you're look for a job I think design is important for technology now and app designers make alot of money but they don't necessarily travel like freelance photographers and designers. I feel your free spirit may be happier being thier own boss",
      "author": "Creative_Angela",
      "created": 1635719127,
      "upvotes": 3,
      "replies": {
        "hitis7e": {
          "link": "/r/college/comments/qjy4nr/art_school_college/hitis7e/",
          "text": "I have heard a bit about that, it puts you in debt and such, that, I would not like to go through, and what you say does make a lot of sense and better, kinda, but it also leaves me stuck again, I think it is partly because I don’t quite understand the world and life in general to well, I don’t know how things work, and I think that makes it harder for me to get what I want to do, or what I can do and how I can start or do it, before that, it is a college in general that I want to try, but I am just way lost",
          "author": "shylittledoll",
          "created": 1635720299,
          "upvotes": 1,
          "replies": {
            "hitm9fi": {
              "link": "/r/college/comments/qjy4nr/art_school_college/hitm9fi/",
              "text": "I get that part for sure being lost and basically wanting to be put on a path worth living but makes money too. I would just attempt to do the job you want now. You truly don't know if you love something till you start. I only know photography so I can only tell you how friend started there. If you want to start now she did college so she knew all the camera tricks but for you I bet you can start with YouTube for basic phone camera modes. Then she got in her car drove to beautiful places she knew and picked a location and time of day she thought would pop. Then went to her friends house and picked from thier clothes things that she thought would match her idea. Then started shooting pictures that she then edited put on her Instagram and made a qr code for business cards linking to her Instagram. She then passed it out to everyone she knew and strategic business. Flower shops/hotels/and high schools. She started doing senior portraits and makes enough currently as pocket change but she started a few months ago. This is what she regrets most because she didn't realize she should of started the moment she wanted to be a photographer. Everything is about connections and growing connections takes a few years before you start making enough to travel and do fun things. The starving artist troup is real, currently she works at Amazon as a part time to pay the rest of her living/debt. I am not an artistic person myself and went to college for Computer science and went to a school I didn't have to take out debt for. I personally seen people who took out huge amounts of student debt regret everything way more than community college graduates. Just be picky how well students do after leaving the school over it's ranking. The ranking system they use is half about how much money the school has and none about starting salaries to pay off that debt.",
              "author": "Creative_Angela",
              "created": 1635722044,
              "upvotes": 3,
              "replies": {
                "hitrqrd": {
                  "link": "/r/college/comments/qjy4nr/art_school_college/hitrqrd/",
                  "text": "oh wow, the amount of time and effort she put in, that is a lot, amazing, you things like this would take time and effort though, and that is one thing I will need to do in order to get somewhere, and thank you so much for the advice, I still want to do a little looking around of my own and such, but I will most definitely keep your words in mind",
                  "author": "shylittledoll",
                  "created": 1635724841,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hj7ko5x": {
      "link": "/r/college/comments/qjy4nr/art_school_college/hj7ko5x/",
      "text": "Hey you. It's a very complicated matter you're asking help for. Of course it's fully up to you to decide. But as you say when you don't know what to do it's quite hard to make that decision. You're young, haven't seen much as you told. Let me try to help you as I can. If you want college go college. If you want an art school, go there. Whatever you do, try to figure out in your heart and mind what would make you truly happy. If it's art, try to imagine - would you be able to live without it. If you have an artist soul, I know, whatever other profession you pick up, that artist in you won't be able to be and live content and will remain restless. I have experienced this myself. On the other hand our interests may change. But the core idea remains.\n\nYou might think \"I'll lose time if I choose wrong\" . And that's where you'll be wrong. People try to make perfect decisions, and yet end up having lost so much time, even all their lives. As long as you're learning what you like, and doing what makes you happy, and not just sitting, it's all ok. Explore as much as you can. You are so young. You can do so much. Gain as much knowledge as you can, college or on your own. Your confidence will grow as you let yourself experience. Don't be afraid to take steps. Even if you're afraid, be courageous and  take those first steps. Take risks. Because it's better than saying \"I didn't try that when I was young, and now it's too late\" when you're 50 years old.\n\nGood luck. Hope your future is glorious.",
      "author": "Flat-Ganache-2816",
      "created": 1635978894,
      "upvotes": 2,
      "replies": {
        "hj7mdmg": {
          "link": "/r/college/comments/qjy4nr/art_school_college/hj7mdmg/",
          "text": "thank you so much, part of it is I want to know how to take these steps, I am the absolute worst at asking for help so often times if I do take a step it’s a shot in the dark and I may miss, it is hard for me to find a mindset and figure myself out, plus I feel so stuck, I don’t really live in the type of place where you discover yourself, and who I am, what my personality is, differs from others, like, I like the artistic type things, music, photography, acting, writing, can’t paint or draw to save my life though,my sister got that talent haha, and those are things I can indulge in and have fun with, but I don’t really know how to make things out of them, plus I want to wander, I never have really got to, my family went on vacations sometimes but I never really saw much of the world so it is difficult to decide or picture what I want exactly",
          "author": "shylittledoll",
          "created": 1635979620,
          "upvotes": 1,
          "replies": {
            "hj9yjyw": {
              "link": "/r/college/comments/qjy4nr/art_school_college/hj9yjyw/",
              "text": "I understand. It's not easy to come up with a decision, when you don't have knowledge. But as I said, the more new things you try, the better vision you will get. Going to college, taking classes, courses will help you discover your abilities. Put your hands, mind to work. Telling you experience will get you the results. You'll have more reasons to compare. And remember, that everyone find themselves at a different age. Your time will come.\n\nAlso it is true that those who often risk get more chances just for anything. Important thing you should understand is not be afraid of losing and of failure. Those are simply inevitable, if you wanna succeed. That's how you learn and gain knowledge.",
              "author": "Flat-Ganache-2816",
              "created": 1636030645,
              "upvotes": 1,
              "replies": {
                "hja2fpa": {
                  "link": "/r/college/comments/qjy4nr/art_school_college/hja2fpa/",
                  "text": "yeah, and if I could just get myself to talk my family about it then that would probably help a lot, my dad especially may have some ideas of what to do or say, but my week butt is like orrrrr we can just not, that is one of the better things about jumping with your eyes closed is that you just do it and you get further than just standing there , maybe I just need to start a college in something and see where that goes, I don’t know",
                  "author": "shylittledoll",
                  "created": 1636032534,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}