{
  "sid": "r0mscf",
  "link": "/r/college/comments/r0mscf/is_there_college_but_not/",
  "title:": "is there college but not?",
  "text": "I'm about to graduate highschool and I love to learn and to progress but I hate school and college seems so stressful and expensive and time consuming and I'm gonna spend hundreds of hours and thousands of dollars on things I'm less than passionate about. Im looking into myself but I thought I might as well ask if anyone knows any place of education that's cheaper and more free flowing. I have a sneaking suspicion tis place doesn't exist because most everyone  would want to go there but I thought I might as well ask.",
  "author": "Frankenfarters",
  "created": 1637700265,
  "updated": 1638207433,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hltcljy": {
      "link": "/r/college/comments/r0mscf/is_there_college_but_not/hltcljy/",
      "text": "You can take individual personal development courses but it won’t really mean much without any related work experience. You can also tryout a trade school to learn a trade and work with your hands. \n\nIf you dont think college is the right move right now then don’t go. Wait it out and see what happens. Maybe in 2-3 years you’ll find out what you want to learn. \n\nI was the same way and took off 5 years before I found something i wanted to learn about and went back.",
      "author": "skippy5433",
      "created": 1637700674,
      "upvotes": 3,
      "replies": {}
    },
    "hltdbsk": {
      "link": "/r/college/comments/r0mscf/is_there_college_but_not/hltdbsk/",
      "text": "Every path in life will have pros and cons. \n\nWant to start making decent money right off the bat? Apply for an apprenticeship with trades such as plumbing, HVAC, electricians, etc. \n\nWant to work in the medical field? There’s a lot of straight forward trades that don’t require a lot of schooling like surgical tech, physical therapy assistant, dental assistant, etc.\n\nI’d also recommend the military. 4 years of paid experience, veteran preference hiring, GI bill and a ton of other benefits that make life extremely easy after.",
      "author": "Spicybooiii",
      "created": 1637700959,
      "upvotes": 2,
      "replies": {}
    },
    "hltddfx": {
      "link": "/r/college/comments/r0mscf/is_there_college_but_not/hltddfx/",
      "text": "It doesn't exist. College will never be laid back or a go at your own pace environment. But you could always enroll in a CC or accredited online university part-time to have less stress. \n\nTrade school is also an option. Or you could take a gap semester or year, work and save your money, and explore your options to what you want to do with your life.",
      "author": "kizeltine",
      "created": 1637700976,
      "upvotes": 1,
      "replies": {}
    },
    "hlymqim": {
      "link": "/r/college/comments/r0mscf/is_there_college_but_not/hlymqim/",
      "text": "Community college.",
      "author": "SaggiSponge",
      "created": 1637794257,
      "upvotes": 1,
      "replies": {}
    }
  }
}