{
  "sid": "rg0l3y",
  "link": "/r/college/comments/rg0l3y/college_major/",
  "title:": "College major",
  "text": "I am currently a pre-med student studying biochemistry but I’ve been strongly thinking to switching my entire career to aerospace engineer or astrophysics. I really enjoy learning about space and space exploration itself. I don’t know what to do because I also love medicine. Any advice?! Also I’m on my sophomore year of college.",
  "author": "AdharaNova",
  "created": 1639460981,
  "updated": 1639516047,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hohatcl": {
      "link": "/r/college/comments/rg0l3y/college_major/hohatcl/",
      "text": "Having a passion for a subject is something great! But we really have to think what comes after your degree. Do you see yourself working in a hospital and/or clinical setting interacting with patients? Or would you prefer working in a lab building rockets/designing planes etc. Also, do you enjoy physics? Engineering involves LOTS of physics so if it’s not something you enjoy you might not want to go down that way. I was reconsidering engineering myself and found that I liked the CONCEPT of it but I don’t think I would like the job itself. It’s something you have to research and really think about what you like. I suggest looking up YouTube videos on what you can do with and aerospace engineering or astrophysics degree or “day in the life” videos!",
      "author": "buckarooo869",
      "created": 1639461981,
      "upvotes": 7,
      "replies": {}
    },
    "hoisu20": {
      "link": "/r/college/comments/rg0l3y/college_major/hoisu20/",
      "text": "When it comes to aerospace engineering, I’ll say this: it’s much more likely you’re going to end up in the planes/flight industry at a place like Boeing or Lockheed Martin rather than at NASA or Space-X like you might want. Those are great companies by the way, and are many people’s dream jobs, but it’s something to take into account. If you go pre-med and onto med school, it’s more likely that you’re going to end up doing something that you expected. \n\nTl;dr: even with an aerospace or astrophysics degree, it’s hard to get a job in the space flight industry.",
      "author": "thebeesting02",
      "created": 1639496638,
      "upvotes": 3,
      "replies": {}
    },
    "hojp01s": {
      "link": "/r/college/comments/rg0l3y/college_major/hojp01s/",
      "text": "People who major in physics do extremely well on their MCATs, so these majors would not prevent you from going to medical school.  I also recommend following your passion when you're young - it's much harder to do when you have a mortgage, spouse and children.  It's good to have a reasonable back up plan - but life is too short to always take the absolutely safe route.  You can also keep a bio/chem based minor so you have those classes in case you change your  mind again.",
      "author": "DrPhysicsGirl",
      "created": 1639509215,
      "upvotes": 1,
      "replies": {}
    }
  }
}