{
  "sid": "r0f3y3",
  "link": "/r/college/comments/r0f3y3/i_wish_i_had_found_this_sub_years_ago/",
  "title:": "I wish I had found this sub years ago.",
  "text": "A few years ago, I was a struggling freshman who thought I was failing at life. I did not have the perspective I have now and didn’t understand that many people were going through similar things like I was and that there could be a solution. I wish I had a place like this to come to back then.",
  "author": "Healingpickme",
  "created": 1637679658,
  "updated": 1639853919,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hlst5zg": {
      "link": "/r/college/comments/r0f3y3/i_wish_i_had_found_this_sub_years_ago/hlst5zg/",
      "text": "So sorry to hear that you didn't find us earlier (haven't been on here as a freshman either) but glad you found this community now. ❤️",
      "author": "pinkrosies",
      "created": 1637693047,
      "upvotes": 2,
      "replies": {
        "hlt1upq": {
          "link": "/r/college/comments/r0f3y3/i_wish_i_had_found_this_sub_years_ago/hlt1upq/",
          "text": "Thankyou, I struggled a lot as a freshman and it brought my self worth down a lot. This is the community I needed. I am grateful I found it.",
          "author": "Healingpickme",
          "created": 1637696460,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlu8rnt": {
      "link": "/r/college/comments/r0f3y3/i_wish_i_had_found_this_sub_years_ago/hlu8rnt/",
      "text": "I am currently a freshman and I am so glad that I have found this sub. It has really helped me know that I am not alone in all of this. College is really lonely, IDK what I would do without my small circle of friends and Reddit. Even though I mainly just read posts it is just nice to hear from other people. I have really struggled with adjusting from HS to college but this sub has definitely helped me. I tell everyone about this sub and many have joined!",
      "author": "Big_Importance6729",
      "created": 1637714354,
      "upvotes": 2,
      "replies": {}
    }
  }
}