{
  "sid": "psupbg",
  "link": "/r/college/comments/psupbg/i_need_help_with_my_procrastination/",
  "title:": "I need help with my procrastination",
  "text": "So even though I started college almost a month ago, I still need to work on procrastination as it became a habit since I suffered from seniorities badly, and turned almost all my work in late for my senior year of high school. Now it has become a bad habit to the point where I'm 3 chapters behind on the textbook that I have to read for my psychology class, 2 essays due for my English class, and 3 worksheets due for my algebra/precalculus class. The thing is I just can't bring myself to do the work and I need help in doing so since procrastination has become a really bad habit that I suffer from now due to my last year of high school.",
  "author": "AmphibianNo895",
  "created": 1632266279,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hdsbcb8": {
      "link": "/r/college/comments/psupbg/i_need_help_with_my_procrastination/hdsbcb8/",
      "text": "Step one - get off reddit/social for a couple hours           step two- do it or don’t",
      "author": "bigzim420",
      "created": 1632270347,
      "upvotes": 3,
      "replies": {}
    },
    "hds76iu": {
      "link": "/r/college/comments/psupbg/i_need_help_with_my_procrastination/hds76iu/",
      "text": "i am having issues with this two my first three semesters i would just get the assignments done right away and even work ahead in most my classes. lately though i have been procrastinating a ton. \n\ni might ask do you workout are you physically active? so far the only thing that has helped (other then buying a pack of cigarettes and getting a nicotine high to type out some essays) working out really got me going.",
      "author": "cute_diplomat",
      "created": 1632268332,
      "upvotes": 2,
      "replies": {
        "hdsbpng": {
          "link": "/r/college/comments/psupbg/i_need_help_with_my_procrastination/hdsbpng/",
          "text": "I'm physically active, and I'm thinking of buying gum so that I can chew on it while I'm working",
          "author": "AmphibianNo895",
          "created": 1632270526,
          "upvotes": 1,
          "replies": {
            "hdsg3yj": {
              "link": "/r/college/comments/psupbg/i_need_help_with_my_procrastination/hdsg3yj/",
              "text": "okay that sounds like a good idea. the thing that helped me was running on the treadmill and thinking about the assignments that were do. by the time i did a mile i was ready to sit down and get started i felt like my creative energy was a lot higher after the run.",
              "author": "cute_diplomat",
              "created": 1632272622,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634051289
}