{
  "sid": "rc6mac",
  "link": "/r/college/comments/rc6mac/is_it_appropriate_to_give_a_professor_a_card_at/",
  "title:": "Is it appropriate to give a professor a card at the end of the semester?",
  "text": "I have really enjoyed one of my professors and learned a great amount through the semester, so thought it would be nice to express this with a card written out to them. I would like to give it to them before the holidays, as I will not see them again after. I thought about also including a small gift ($10 amazon card) to express my appreciation. Is this appropriate to give to a professor? I don’t want to create any uncomfortableness but really want to express my appreciation. Also, I do want to note that I have considered asking this professor for a recommendation letter in the future, but don’t at all want to come off as bribing or sucking up for this. Any thoughts?",
  "author": "Ok_Mycologist330",
  "created": 1639014366,
  "updated": 1639517148,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hnsqwc2": {
      "link": "/r/college/comments/rc6mac/is_it_appropriate_to_give_a_professor_a_card_at/hnsqwc2/",
      "text": "I wouldn’t include the gift card for “bribery” reasons (sounds stupid but so are the rules of this world). But a nice little card I think would be welcome if you two are mutually comfortable in that capacity (I.e. he knows your name, knows your face etc)",
      "author": "harry01772",
      "created": 1639014554,
      "upvotes": 10,
      "replies": {
        "hnsr558": {
          "link": "/r/college/comments/rc6mac/is_it_appropriate_to_give_a_professor_a_card_at/hnsr558/",
          "text": "He knows my name and face but we haven’t talked individually much, as I haven’t really gotten the chance. Would you still say it’s okay? I thought about mentioning that I hadn’t gotten the opportunity to speak with him but really appreciated conversations in class etc",
          "author": "Ok_Mycologist330",
          "created": 1639014661,
          "upvotes": 0,
          "replies": {
            "hnuy6p8": {
              "link": "/r/college/comments/rc6mac/is_it_appropriate_to_give_a_professor_a_card_at/hnuy6p8/",
              "text": "If you're insistent on giving a gift, don't make it an Amazon card. That's kinda like slipping your professor money at the end of the semester. Instead see if there's a coffee shop on or near campus and get them a $10 gift card there. There's a lot less issues with buying someone coffee than giving them hard cash.",
              "author": "hdorsettcase",
              "created": 1639062779,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hnt0kgi": {
      "link": "/r/college/comments/rc6mac/is_it_appropriate_to_give_a_professor_a_card_at/hnt0kgi/",
      "text": "I've given my psychology professor a card a couple of years ago, she was sweet and an overall awesome teacher. I think she really appreciated the sentiment. I would probably stick with the card just not the gift card. Like the other comment already mentioned, although your intentions are good it might be interpreted in a different way.",
      "author": "ShyCoconut0_0",
      "created": 1639018852,
      "upvotes": 6,
      "replies": {}
    }
  }
}