{
  "sid": "qpp8mn",
  "link": "/r/college/comments/qpp8mn/failing_first_semester_freshman_year_what_should/",
  "title:": "Failing first semester freshman year, what should I do?",
  "text": "I feel absolutely awful and guilt pretending everything is fine. I'm spiraling down and feeling hopeless as this semester comes nearing to an end.  \nThe guilt that I screwed myself over, like I just dumped thousands of dollars in an oil drum and lighting it on fire. \n\nI hate my major, I thought I had a passion for STEM in high school (Biology) and also my parents wanted me to do it  but college gave me a huge dose of reality, I suck at math and don't enjoy it.\n\n But the fact is my lack of focus, sleep and procrastination is biting my ass. I was one of those students who would ace highschool without  studying at all. It's been severely affecting me since I have not the slightest clue how to study. I do try two days before to review materials via flashcards however I just end up bombing the exam spectacularly. Nothing pisses me and demotivates when you spend 8 hrs studying all the materials. Nothing in Biology fascinates me anymore, it's all math, which I absolutely hate. It doesn't help that I'm taking chem, calc, bio, and on top of that taking german class.\n\nMy gpa would probably be around 1.8 and I would be placed in academic warning.  Freshman year is a hard adjustment to make. I'm planning on changing my major to something I'm more passionate about and meeting with my advisor to talk about it. \n\nWould it get better?",
  "author": "Wide_2077",
  "created": 1636411241,
  "updated": 1636655317,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hjv73vp": {
      "link": "/r/college/comments/qpp8mn/failing_first_semester_freshman_year_what_should/hjv73vp/",
      "text": "If there are any courses you are actually failing with an F and the professor doesn’t see a path forward to you passing the class at this point, withdraw from those courses. It’s better to earn low credits this semester because of Ws than to earn low credits because of Fs and then spend the rest of your college career trying to compensate for the poor start to your GPA. Find out where the office is on campus that coordinates tutoring/learning services. Your tuition is already paying for people whose job includes helping students learn study skills and connecting them with free tutoring and academic supports. Take advantage of their services now. Studying is a skill that can be taught. Then connect with your career services office, which has tools you can use to explore careers and majors that both interest you and play to your strengths. Again, you are already paying for their services via your tuition, so use them. If you feel you would benefit from counseling support to help you get in a better headspace for succeeding at college, visit that office as well. Again, this is a service you are paying for. And as you said, talk to your advisor and make a plan to change your major. Better things are ahead. Do what you need to do now to make sure this poor semester isn’t going to keep dragging you down and haunting you as you try to move forward. Make sure you know the withdrawal deadline for your courses and don’t fail a course when you could still drop it.",
      "author": "ltlwl",
      "created": 1636413318,
      "upvotes": 3,
      "replies": {
        "hjv7s2p": {
          "link": "/r/college/comments/qpp8mn/failing_first_semester_freshman_year_what_should/hjv7s2p/",
          "text": "I'm planning on withdrawing from one of my classes however we only have 3 withdraws all throughout uni. I feel like it's a waste to use 2 of the 3 during the start. I couldn't drop a class in the beginning due to the fact it'll drop be below the minimum credit hr for full time. Thanks! I just hope I work hard to recover from this.",
          "author": "Wide_2077",
          "created": 1636413608,
          "upvotes": 1,
          "replies": {
            "hjv9sda": {
              "link": "/r/college/comments/qpp8mn/failing_first_semester_freshman_year_what_should/hjv9sda/",
              "text": "Drop the one that you are least likely to be able to pull your grade up in. Focus your energy on what you can do to improve your chance of passing in the other courses. Good luck!",
              "author": "ltlwl",
              "created": 1636414489,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjvnrwd": {
      "link": "/r/college/comments/qpp8mn/failing_first_semester_freshman_year_what_should/hjvnrwd/",
      "text": "It's totally normal, I've gotten C's and D's for my first few semesters of College. If you are getting F's too often though, I would definitely go talk to an advisor.",
      "author": "Jayjay_130",
      "created": 1636420864,
      "upvotes": 2,
      "replies": {}
    },
    "hjy5xkw": {
      "link": "/r/college/comments/qpp8mn/failing_first_semester_freshman_year_what_should/hjy5xkw/",
      "text": "This is me right now.",
      "author": "bigdickro",
      "created": 1636473698,
      "upvotes": 1,
      "replies": {}
    }
  }
}