{
  "sid": "r6rcpk",
  "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/",
  "title:": "I'm 32, how do afford to live and go to school at the same time. I feel helpless.",
  "text": "I went to college for one year straight out of high school when you'd be considered an absolute failure if you didn't.\n\nI had no idea what to do, I wasn't prepared and my parents relationship with money and their horrible finances made it very hard for me to take on debt. I was terrified.\n\nNow, I'm single 32m and I want to do something besides tread water. I have jumped around to jobs but I always felt like I wasn't in the right place. I made a post earlier today on r/findapath I have a lot of skills and hobbies but I just don't know what to focus on for a career that won't feel like a waste. I am prepared to figure out how to pay for it and what not but I don't get it.\n\nI can barely make it just working, I pay for everything on my own as many of us do and I know people make it work. But jesus christ, adding that workload and responsibility, gas and time for 4 years seems incredibly daunting. \n\nAny guidance is appreciated",
  "author": "Blackwhitehorse",
  "created": 1638398230,
  "updated": 1638480213,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmv50az": {
      "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmv50az/",
      "text": "I did it with student loans. I didn’t really have a better option and I wanted to be back in school.",
      "author": "ProfessorHomeBrew",
      "created": 1638402982,
      "upvotes": 2,
      "replies": {
        "hmyyc7a": {
          "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmyyc7a/",
          "text": "what did you go for and did it work out well?",
          "author": "Blackwhitehorse",
          "created": 1638473824,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmv7ins": {
      "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmv7ins/",
      "text": "try asychronous online i am in the senior year of my online program i do the work on my time by the deadline it requires alot of self discipline but if u want it bad enough you’ll thrive at it. I currently go to the university of arizona online it is also way cheaper than a traditional college i work full time have a baby and still made it on the deans lists you can as well!",
      "author": "Silver_Least",
      "created": 1638404075,
      "upvotes": 2,
      "replies": {
        "hmyyiqn": {
          "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmyyiqn/",
          "text": "are you from Arizona? that definitely sounds like an option, I'll definitely look into online classes..  you kick ass, glad you made it happen",
          "author": "Blackwhitehorse",
          "created": 1638473894,
          "upvotes": 1,
          "replies": {
            "hmyyy5a": {
              "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmyyy5a/",
              "text": "Nope philly you can do the program from anywhere tbh I had classmates in iran for some of my courses but just keep in mind time zone so when you submit assignments its goes by 11:59 arizona time so thats 2:59 am eastcoast time as they don’t recognize daylight savings I just use the clock on my iphone to keep track but the professors also highlight this is in all of my courses.",
              "author": "Silver_Least",
              "created": 1638474061,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmyon8b": {
      "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmyon8b/",
      "text": "Have you considered a local community college? I can relate with your story. Went to community college right out of high school not knowing what I wanted to do. Did 2 years, terrible student and still didn't know what I wanted to do. Had/have a okay job, got hands on experience in a promotional/print company for the last several years. Getting ready to turn 30 and wanted to do something else. Did some research again at the community college I had gone to. Went back and finished up what I had started originally, but wanted to do more. Started a whole new program in web and mobile development and not far from finishing. All while retaining my current job and everything else that comes with adulting. And the college is significantly cheaper then the big universities around. And if I finish up, and want to pursue one of those, that door is open.\n\nEdit: and this is all while only taking 2 classes a semester. And for me at least, the work load wasn't enough to blow everything else out of the water. So the journey has been long, but im sure it will be worth it.",
      "author": "MrGovenator",
      "created": 1638470091,
      "upvotes": 1,
      "replies": {
        "hmyyyl4": {
          "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmyyyl4/",
          "text": "happy to hear you went back and pursued something to enrich your life. My original school experience was the same and I think create this fog around going to college. I definitely feel in a place to try and make more of myself, thanks for sharing I think you'll be great",
          "author": "Blackwhitehorse",
          "created": 1638474066,
          "upvotes": 1,
          "replies": {
            "hmz0pw8": {
              "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmz0pw8/",
              "text": "Give it a shot. Talk to admissions and advising. And see if they can work out a program with you. For me walking in the door again and sitting down to talk with them was the hardest part. They have always been helpful",
              "author": "MrGovenator",
              "created": 1638474747,
              "upvotes": 1,
              "replies": {
                "hmz1oj8": {
                  "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmz1oj8/",
                  "text": "for sure, that would be best for me. I get anxious going over the site and what not.",
                  "author": "Blackwhitehorse",
                  "created": 1638475130,
                  "upvotes": 1,
                  "replies": {
                    "hmz25v3": {
                      "link": "/r/college/comments/r6rcpk/im_32_how_do_afford_to_live_and_go_to_school_at/hmz25v3/",
                      "text": "Yup, same here",
                      "author": "MrGovenator",
                      "created": 1638475333,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}