{
  "sid": "qpweh6",
  "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/",
  "title:": "I just wanted to tell all of you new to college towns. There's a high concentration of mediocre scammers in all of them.",
  "text": "To give you a little context, I'm not a college student. I'm 32 and both and convicted felon and a landlord. As a former criminal, I've run plenty of scams, as a low income landlord, I've had plenty of them ran on me.\n\nWell I recently rented a room out to two college girls, which is out of the norm for my usual tenant. I have a \"I hope I can afford something nicer than this later\" type of place. One of these girls was from the Ozarks (known rich area in the USA). \n\nI got to know them and they took me to a bar that even as a 32 year old I was way too old to be at. The naivety of everyone I was meeting was in retrospect a scammers wet dream. You have a bunch of kids who just moved out of their parents house loaded up with cash, drunk, and trying to mingle with strangers. Some of which might be from a little town in Kansas making them an even bigger target.\n\nAfter I got tired of being asked who's bodyguard I was, I decided to walk around the area while I waited for the girls to be done getting shitfaced.\n\nI watched a lot of people fall for the most basic and successful scam I've ever seen. I call it \"aggressive panhandling\". They ask you for a dollar or some spare change or something, and make you feel like you're avoiding a confrontation by giving them a menial amount of money. They use body language and and tone of voice to make you feel threatened. Sometimes getting uncomfortably close. They always act like they're using the money for food and they're all obviously homeless.\n\nPro tip: They're buying crack and if you tell them to go away, they usually will. If they don't, say it again louder.\n\nThen there was the wealthy Israeli soldier with PTSD (WTF???) who was going to cash app me thousands of dollars later if I could give him $350 so he could buy a bag of weed (WTF???). He also had a very intimidating looking friend with him. He pled his case and we all just had to listen because of the guy he was with who looked like a very unfriendly rapper. After me and another guy gave them their walking papers the \"soldier\" got really tough while he was half way down the street.\n\nThen there was the guy who just wouldn't get out of the car. All I could think was that if I was not in the car, those two girls would have been raped and robbed. He kept insisting on us all going to the casino where he was going to pay for everyone. He was wearing about $10 worth of clothes. He probably wanted a ride, but if he were the opportunistic type he would have definitely saw that he could have gotten more if I weren't there. I just stayed quiet and kept an eye on him while one the girls threw an absolutely temper tantrum until he finally got out of the car. From experience I can tell you it takes way too much effort to get the \"I'm not getting out of the car\" scammers out of the car. They figure if they can make it into the car they can just finess until they figure out a way to rob you or get whatever they want. The best defense is locking your doors when strangers approach the car and not letting strangers in your fucking car!!!\n\nThe only other time I encountered almost this many scammers was in Boston. The area I was in last night was a known college hangout which there aren't many of in Tampa. I'm sure the bulk of these scammers were making money hand over foot. Drunk college kids seem like the correct target. They're not coming across the bridge to my neighborhood and finding a bar that has that amount of drunk people with limited life experience and lots of money.\n\nJust reminding you all to be safe while you're partying. These scammers are playing a game that you should never have to be good at if you graduate.",
  "author": "jackques_potter",
  "created": 1636434448,
  "updated": 1636655226,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.86,
  "comments": {
    "hjwjvjk": {
      "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjwjvjk/",
      "text": "[deleted]",
      "author": null,
      "created": 1636436340,
      "upvotes": 23,
      "replies": {
        "hjwk0v9": {
          "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjwk0v9/",
          "text": "I've been told it's the only area in Missouri that has any money. I guess I'm gunna have a different definition of rich than most of the people on this sub.",
          "author": "jackques_potter",
          "created": 1636436432,
          "upvotes": 12,
          "replies": {
            "hjxeqky": {
              "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjxeqky/",
              "text": "[deleted]",
              "author": null,
              "created": 1636460643,
              "upvotes": 1,
              "replies": {
                "hjyh6ci": {
                  "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjyh6ci/",
                  "text": "That's rich by my standards. I'd sell my soul for 50k/year",
                  "author": "jackques_potter",
                  "created": 1636478192,
                  "upvotes": 3,
                  "replies": {
                    "hjyw1d3": {
                      "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjyw1d3/",
                      "text": "People always seem to forget that rich is a subjective word, and that many people did not grow up middle class like they assume",
                      "author": "jaweebamonkey",
                      "created": 1636484069,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hjxtfrx": {
      "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjxtfrx/",
      "text": "I'm from Missouri, the Ozarks is mostly uneducated people without money. The only wealth is from people with second homes there and a number of those people are actually just leveraged with debt.",
      "author": "darniforgotmypwd",
      "created": 1636468375,
      "upvotes": 6,
      "replies": {}
    },
    "hjwkwqi": {
      "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjwkwqi/",
      "text": "What scams did you run? Could discuss over PM if you want. Not judgmental, just sounds interesting",
      "author": "EvilBob_RapePants_",
      "created": 1636437006,
      "upvotes": 3,
      "replies": {
        "hjwnujv": {
          "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjwnujv/",
          "text": "As a kid I would find out of towners who needed drugs and I would \"be right back\" with the drugs after I got the money. I was never heavily into scamming as an adult because I learned it's more lucrative to actually give people the drugs and save their number.",
          "author": "jackques_potter",
          "created": 1636438967,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hjxrvqx": {
      "link": "/r/college/comments/qpweh6/i_just_wanted_to_tell_all_of_you_new_to_college/hjxrvqx/",
      "text": "What a disgrace to society you are 🙉\n\nLol just kidding, rob those rich kids of everything they have, teach them a lesson!",
      "author": "youareaweirdo___",
      "created": 1636467658,
      "upvotes": -4,
      "replies": {}
    }
  }
}