{
  "sid": "rgdhq6",
  "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/",
  "title:": "idk what to do with office hours?",
  "text": "i see professors always suggesting to go to office hours but what do i do there? idk what to ask or talk about? for example if i’m writing a paper for a class what do i ask so i understand what the professor is expecting? ngl feel kinda dump asking this i am truly lost",
  "author": "lalinlux",
  "created": 1639505592,
  "updated": 1639515956,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 0.94,
  "comments": {
    "hojij45": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojij45/",
      "text": "I go if I am struggling with concepts or have questions! I usually write down what I’m going to ask about before I go. If you are struggling with a paper you could ask to show them your thesis and part of your outline or something. I would make sure to have something prepared before you go to get more out of it",
      "author": "catlover12321",
      "created": 1639506674,
      "upvotes": 7,
      "replies": {
        "hojrnef": {
          "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojrnef/",
          "text": "writing down actually seems like it may be very helpful. thanks for the tip i will definitely try.",
          "author": "lalinlux",
          "created": 1639510250,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hojmf8m": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojmf8m/",
      "text": "Along with what the others said, if the professor works in the same field as you're interested in (whether grad school, jobs, etc.), it's a good time to connect with them. Let them know what your goals are, how you plan on achieving it, etc., & see if they can help. For example, want to learn more about a type of job? They might be able to connect you with alumni in that position to tell you more about it.",
      "author": "KayBieds",
      "created": 1639508202,
      "upvotes": 6,
      "replies": {
        "hojrquw": {
          "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojrquw/",
          "text": "i see that makes a lot of sense too! i usually am afraid to take up too much of their time.",
          "author": "lalinlux",
          "created": 1639510288,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hojmdjt": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojmdjt/",
      "text": "They are there to answer your questions!  How do I do this homework problem?  What did this concept or idea from lecture mean?  Does this lab report look like what you're expecting us to turn in?  I was thinking of doing X for my research paper / project / report, does that sound like an appropriate topic?  I missed points here on this assignment / test, can you explain what I did wrong?",
      "author": "Green_343",
      "created": 1639508183,
      "upvotes": 3,
      "replies": {}
    },
    "hojr9vw": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojr9vw/",
      "text": "I totally agree. Often times I find that either I understand a class, or I don’t understand enough to even know what to ask.",
      "author": "Softpretzelsandrose",
      "created": 1639510104,
      "upvotes": 1,
      "replies": {
        "hojrhy6": {
          "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojrhy6/",
          "text": "i feel this but about coursework. usually i understand the class but not what the professors wants me to show and idk what to ask to understand.",
          "author": "lalinlux",
          "created": 1639510191,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hojiegs": {
      "link": "/r/college/comments/rgdhq6/idk_what_to_do_with_office_hours/hojiegs/",
      "text": "That’s exactly what they’re for. For example, I went to my chemistry lab professor’s office hours all of the time to get clarification on the lab reports.",
      "author": "COLUMBIAwindbreaker",
      "created": 1639506623,
      "upvotes": 2,
      "replies": {}
    }
  }
}