{
  "sid": "r7208c",
  "link": "/r/college/comments/r7208c/im_falling_apart/",
  "title:": "I'm falling apart",
  "text": "I'm trying to register for spring classes and my account has two holds. One is for volunteering (I basically forgot and still need 30 hours), the other is for not paying my tuition, but I'm on a scholarship that covers everything but books. I'm so scared that these things will ruin my college career and I'll have to pay for classes I've taken and start back at square one. My depression is so severe and I can barely function day-to-day. Please tell me I can get through this.",
  "author": "bugs-are-cute",
  "created": 1638430457,
  "updated": 1639855686,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hmwousj": {
      "link": "/r/college/comments/r7208c/im_falling_apart/hmwousj/",
      "text": "You can definitely get through this. Despite how it may seem, the college wants to see you succeed because it makes them look good. I would just talk to whoever can help you or give you an exemption for the volunteering and just talk to the cashiers office and scholarship providers about the balance to find the misunderstanding. If youre resourceful enough to get a full scholarship, this wont be the end of the world. Good luck!",
      "author": "Mason_08061996",
      "created": 1638431344,
      "upvotes": 3,
      "replies": {}
    },
    "hmws0py": {
      "link": "/r/college/comments/r7208c/im_falling_apart/hmws0py/",
      "text": "I will pray for you how about that",
      "author": "-Triple-HHH-",
      "created": 1638433891,
      "upvotes": 2,
      "replies": {}
    },
    "hn0165n": {
      "link": "/r/college/comments/r7208c/im_falling_apart/hn0165n/",
      "text": "You can get through this, but you'll have to take action. Go to the admissions office and say that you need help figuring out your holds. An admissions specialist will be able to look up your account, look at your holds, and help you figure out the best and quickest way to deal with them.\n\nFor the volunteering requirement, they might be able to give you a deferment and an extra semester to complete your volunteer hours. Or they might tell you that you've got to grind them out over the holiday break, which sucks but is doable.\n\nYou may need to talk to the business office and/or financial aid to figure out the tuition hold, it might be something simple like signing a form to apply the scholarship to your account. \n\nMost college staff are very helpful will do everything they can to get you through the registration process, but you will still need to reach out to them for help and advocate for yourself.",
      "author": "cahutchins",
      "created": 1638489206,
      "upvotes": 1,
      "replies": {}
    }
  }
}