{
  "sid": "qqfs7k",
  "link": "/r/college/comments/qqfs7k/unreciprocated_love_with_my_roommate/",
  "title:": "Unreciprocated love with my roommate",
  "text": "I (20f) have a roommate (19f) and we share a 10x15ft room, probably smaller. She is a great person, and we used to get along mostly well. She has proven to be selfless, caring, and very considerate. But she really likes me! She insisted I meet her parents and family and praised me in front of them. \n\nBut after covid, something has changed and I just don't feel like I want to be friends anymore. I dread when she comes home or approaches me in the class we have together. I feel like I have to 'act nice' around her and it's an actual endeavor instead of just.. coexisting. We barely talk, and every few days she will try to talk to me about something and I will make myself very unapproachable but I will listen. (It's worth noting I am having a hard semester emotionally and mentally.)\n\nI have my own space, I have a room divider which she also appreciates for it's privacy. I use headphones, I find my quiet places outside of the dorm. But the bubbling resentment and just.. anger.. is not great.\n\nMy college discourages single rooms and makes it impossible to live off campus. I feel so stuck. I've felt this way about her since the first week.\n\nTLDR - I can't stand having a roommate even if they are the ideal roommate and I am stuck with this situation. ",
  "author": "castilina",
  "created": 1636498959,
  "updated": 1636655240,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.62,
  "comments": {
    "hjzze24": {
      "link": "/r/college/comments/qqfs7k/unreciprocated_love_with_my_roommate/hjzze24/",
      "text": "Let it out, go somewhere random and yell that frustration out then find a calming place lol. That sounds frustrating and it’s great you’re not taking it out on others. Stay strong, this is only for now.",
      "author": "Bobliomaniac",
      "created": 1636499957,
      "upvotes": 3,
      "replies": {}
    },
    "hk01n6y": {
      "link": "/r/college/comments/qqfs7k/unreciprocated_love_with_my_roommate/hk01n6y/",
      "text": "I think it might help if you have an honest (but diplomatic) conversation with her. Maybe she hasn’t been completely forthcoming either and just talking will help you both be in the page and feel better.",
      "author": "seagreengoddess",
      "created": 1636500949,
      "upvotes": 2,
      "replies": {}
    },
    "hk562o8": {
      "link": "/r/college/comments/qqfs7k/unreciprocated_love_with_my_roommate/hk562o8/",
      "text": "Talk it out like the adults you are. Communication is key in any type of relationship, even roommates. Bottling it up isn't healthy for anyone. Talk it through and tell her how you feel, if you feel uncomfortable about anything, and what you want your roommate relationship to be like going forward. Since you say she's nice, chances are that she will understand and be willing to agree on whatever terms you both discuss. If you don't want to say directly that you don't want to be friends anymore, just say that you're going through something and need a little space from friendships for a while.",
      "author": "NoDryHands",
      "created": 1636592203,
      "upvotes": 1,
      "replies": {}
    }
  }
}