{
  "sid": "r7fxlv",
  "link": "/r/college/comments/r7fxlv/do_professors_ever_let_a_student_redo_an/",
  "title:": "Do professors ever let a student re-do an assignment?",
  "text": "Asking because I recently submitted a project I knew I did terribly on for one really important class that I was on track to get an A in. If my grade comes back and its as bad as I think it will be I want to ask the professor if I can redo the project. Otherwise this grade might prevent me from getting into graduate schools, since I already have a bad semester in my transcript.",
  "author": "o_kurwa_mac",
  "created": 1638475384,
  "updated": 1639845357,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmz6s9k": {
      "link": "/r/college/comments/r7fxlv/do_professors_ever_let_a_student_redo_an/hmz6s9k/",
      "text": "Not usually. Once the assignment is done and graded and the deadline is past, that’s that. Did you seek help or ask questions prior to turning it in?",
      "author": "PhDapper",
      "created": 1638477118,
      "upvotes": 1,
      "replies": {
        "hmz7c89": {
          "link": "/r/college/comments/r7fxlv/do_professors_ever_let_a_student_redo_an/hmz7c89/",
          "text": "no, it was a big project too. we had plenty of time to complete it. i completely put it aside like an idiot until the last minute and now i have 0 hope for my grade and for my future at grad school. im close with the professor so i wonder if they would make an exception for me. but i genuinely dont have a good excuse for why i messed up this badly. i did have a partner for the project who put all the work on me and didnt contribute, but i have reservations about selling them out because they are a close friend. no idea what i am to do with myself. i feel so stupid for my actions...",
          "author": "o_kurwa_mac",
          "created": 1638477317,
          "upvotes": 1,
          "replies": {
            "hmz7ur3": {
              "link": "/r/college/comments/r7fxlv/do_professors_ever_let_a_student_redo_an/hmz7ur3/",
              "text": "It’s a good lesson to learn, if nothing else. They probably won’t make an exception regardless of how close y’all are because that would be unfair to the rest of the class. It’s also just one class, which isn’t going to stop you completely from getting into grad school even with another bad semester.",
              "author": "PhDapper",
              "created": 1638477511,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hn0k314": {
      "link": "/r/college/comments/r7fxlv/do_professors_ever_let_a_student_redo_an/hn0k314/",
      "text": "The ethical ones do not.",
      "author": "Judythe8",
      "created": 1638497681,
      "upvotes": 2,
      "replies": {}
    }
  }
}