{
  "sid": "qcwsav",
  "link": "/r/college/comments/qcwsav/help_us_understand_firstgen_college_students/",
  "title:": "Help us understand first-gen college students!",
  "text": " I am conducing a research study that is investigating how different mindsets among first-generation college students can influence their success in college and in the workplace. If you are a first-generation college student, you are eligible to participate in the study. By participating in the study, you will have the opportunity to help researchers understand the best ways to prepare first-gen students for success in the classroom and in the workplace after they graduate. The survey should take 15 - 20 minutes to complete and has been approved by the University of Southern Mississippi’s IRB Office (IRB-20-503).  \n\n[https://usmep.co1.qualtrics.com/jfe/form/SV\\_1GgEoppou5f4Wai](https://usmep.co1.qualtrics.com/jfe/form/SV_1GgEoppou5f4Wai)",
  "author": "Harper_1933",
  "created": 1634836997,
  "updated": 1636182490,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hhk9xyy": {
      "link": "/r/college/comments/qcwsav/help_us_understand_firstgen_college_students/hhk9xyy/",
      "text": " I believe the study asking for information such as death of family with covid , worry about it etc, could be triggering to some people. I'm not entirely sure why it's in there.",
      "author": "lightbluejellyfish",
      "created": 1634864209,
      "upvotes": 2,
      "replies": {}
    },
    "hhjfi4a": {
      "link": "/r/college/comments/qcwsav/help_us_understand_firstgen_college_students/hhjfi4a/",
      "text": "I think you should know how important it is to pass a college math class (like college precalculus, college calculus 1, 2, 3) (ignore statistics) is to low income first gen students. Its because math class (passing one) is crucial to learn to manage your money. Focus on that before you try to come up with some waste of time idea.",
      "author": "Cylinder126",
      "created": 1634850245,
      "upvotes": -4,
      "replies": {
        "hhjv791": {
          "link": "/r/college/comments/qcwsav/help_us_understand_firstgen_college_students/hhjv791/",
          "text": "Statistics helps you read and understand research articles you will need in many upper-division courses. You do not need calculus to understand personal finance.",
          "author": "dogsandbigfoot",
          "created": 1634857239,
          "upvotes": 3,
          "replies": {
            "higofi4": {
              "link": "/r/college/comments/qcwsav/help_us_understand_firstgen_college_students/higofi4/",
              "text": "I was referring to the self-help aspect found in many books in barnes noble / half priced books / etc or public library not the actual field of study/college major subcategory.",
              "author": "Cylinder126",
              "created": 1635473995,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}