{
  "sid": "qxtmql",
  "link": "/r/college/comments/qxtmql/are_4_college_classes_and_1_ap_class_too_much_or/",
  "title:": "Are 4 college classes and 1 AP class too much, or is it manageable?",
  "text": "I’m a junior in high school planning my schedule for next semester and was wondering if 4 college classes and 1 AP class is too much? As of this semester I’m taking APUSH, honors science (kinda irrelevant), college Spanish 1, and college pre cal algebra and am doing fine. Next semester I’m planning on taking AP Lang, college American government, college pre cal trigonometry, college psychology, and college Spanish 2. I just wanted other peoples input if this would be too much or if it’s manageable?",
  "author": "breezinchicken",
  "created": 1637368591,
  "updated": 1637689552,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.71,
  "comments": {
    "hlc6ymj": {
      "link": "/r/college/comments/qxtmql/are_4_college_classes_and_1_ap_class_too_much_or/hlc6ymj/",
      "text": "Depends on the person.\n\nPersonally  I wouldn't do it, because it would force me to adopt unhealthy habits in order to manage the workload.\n\nBut you're probably smarter than me so go for it.",
      "author": "New_Demon24-7",
      "created": 1637374793,
      "upvotes": 1,
      "replies": {}
    },
    "hlcjepj": {
      "link": "/r/college/comments/qxtmql/are_4_college_classes_and_1_ap_class_too_much_or/hlcjepj/",
      "text": "If you're dual enrolling at a community college that's a pretty easy schedule.  The AP class will probably be your hardest class.  Community college general education credits are almost always really easy.  It just depends on how mature of a student you are.  If high school has consistently been too easy for you, go for it.",
      "author": "CinderSushi",
      "created": 1637381258,
      "upvotes": 1,
      "replies": {
        "hld7k5g": {
          "link": "/r/college/comments/qxtmql/are_4_college_classes_and_1_ap_class_too_much_or/hld7k5g/",
          "text": "Hard disagree on community college gen Ed courses being generally pretty easy. This definitely varies by community college. OP would do better by talking to some students in your school who are taking the courses you’re interested in.",
          "author": "SilverRiot",
          "created": 1637398313,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlcqc9s": {
      "link": "/r/college/comments/qxtmql/are_4_college_classes_and_1_ap_class_too_much_or/hlcqc9s/",
      "text": "Also a junior. Am taking french 4, calc1, ap gov, and just the rest weighted classes rn. Am doing fine but dont have time to do much as i work about 20 hours a week",
      "author": "DeborahButter",
      "created": 1637385305,
      "upvotes": 1,
      "replies": {}
    }
  }
}