{
  "sid": "q0vskd",
  "link": "/r/college/comments/q0vskd/can_i_take_an_online_class_at_any_community/",
  "title:": "Can i take an online class at any community college that offers online classes, even out of state?",
  "text": "I was wondering if it's possible to take a certificate at any online college in the country... I know some don't allow it, but most do, right? How will I know if I'm being charged more than I'm state students? Is this a good idea? My state is absolutely disgusting when it comes to community college. We just recently consolidated all customer service for all of our community colleges and it's a mess. The people that answer are rude and completely unknowledgeable. You can't ask any questions. All they do is tell you that you need to apply before you can talk to an advisor. We have horrible selection as well and our state is hurting for manufacturing workers so they try to push you into manufacturing at all costs.",
  "author": "iwillshampooyouitsok",
  "created": 1633312197,
  "updated": 1634089612,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfcy6f0": {
      "link": "/r/college/comments/q0vskd/can_i_take_an_online_class_at_any_community/hfcy6f0/",
      "text": "You *can* take any online class at any community college/university that offers online but the problem would be whether the school you are earning your degree from accepts credit from that school. Also, you would have to pay out of state tuition for that class.\n\nCan’t really speak on how good of an idea this is. However, you may have better luck asking an admissions counselor at the 4 year you are interested in on whether they would accept those kinds of credits.",
      "author": "shoelaceys7373",
      "created": 1633360797,
      "upvotes": 1,
      "replies": {}
    },
    "hfdsm6d": {
      "link": "/r/college/comments/q0vskd/can_i_take_an_online_class_at_any_community/hfdsm6d/",
      "text": "Yes but I think it'll cost you more since you're considered out of state",
      "author": "TragicalKingdom",
      "created": 1633372555,
      "upvotes": 1,
      "replies": {}
    }
  }
}