{
  "sid": "rhf36e",
  "link": "/r/college/comments/rhf36e/d2l_not_being_able_to_go_back_and_forth_during/",
  "title:": "D2L not being able to go back and forth during exam… Why?",
  "text": "My professor is only showing 2 questions at the time and after completing the page you can’t go back… Why? If the exam is not proctored I understand but if the exam is proctored ( camera and mic on) what’s the point ? I know it’s for cheating but if you’re proctored with camera and mic the possibility of cheating is significantly less and anyways there’s always someone that will cheat so why penalize everyone for a couple of cheater. If we were in person we wouldn’t have this contraint so why put it ?",
  "author": "Thr0w4w4y656",
  "created": 1639618377,
  "updated": 1639787874,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hos1uvj": {
      "link": "/r/college/comments/rhf36e/d2l_not_being_able_to_go_back_and_forth_during/hos1uvj/",
      "text": "Mine is the same except it is 1 question per page. Like dude we are using a lockdown browser with video and mic on, if someone was cheating you'd know. It really hurts people with test anxiety (like me) who will skip around a test to do questions they are comfortable with and then come back to later questions. I have the final tomorrow and know it'll be the same way.",
      "author": "Mushy-froug",
      "created": 1639662143,
      "upvotes": 1,
      "replies": {
        "hosdilu": {
          "link": "/r/college/comments/rhf36e/d2l_not_being_able_to_go_back_and_forth_during/hosdilu/",
          "text": "I know it’s really not good for performance anxiety cuz if you know you put the wrong answer on another page you can’t go back and start spiraling which doesn’t help during a test… and like time management is even harder… sometimes like I take too much time on a page and I end up with like 30 minutes for 30 questions or like 1h for 20 questions….",
          "author": "Thr0w4w4y656",
          "created": 1639667430,
          "upvotes": 3,
          "replies": {
            "hostmn8": {
              "link": "/r/college/comments/rhf36e/d2l_not_being_able_to_go_back_and_forth_during/hostmn8/",
              "text": "I talked to my therapist about it and even he was like what the heck.",
              "author": "Mushy-froug",
              "created": 1639673825,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}