{
  "sid": "rc0st3",
  "link": "/r/college/comments/rc0st3/how_do_i_get_help_to_help_pay_for_my_college/",
  "title:": "How do I get help to help pay for my college tuition?",
  "text": "I don't have much money but I'm trying to get into a college to get my grades up to transfer into a better College but I can't afford the tuition. Any ideas?",
  "author": "New-Marketing-7164",
  "created": 1638997052,
  "updated": 1639517211,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hnrlzjm": {
      "link": "/r/college/comments/rc0st3/how_do_i_get_help_to_help_pay_for_my_college/hnrlzjm/",
      "text": "Have you considered applying for FAFSA, meeting with a financial advisor, or looking and applying for scholarships?",
      "author": "absolutely_funny",
      "created": 1638997247,
      "upvotes": 3,
      "replies": {
        "hnrma06": {
          "link": "/r/college/comments/rc0st3/how_do_i_get_help_to_help_pay_for_my_college/hnrma06/",
          "text": "Yes I have. I scheduled appointment with a financial advisor. \n\nThe process of getting the FASFA approved is kind of complicated and hard to navigate. \n\nI do not know how to apply for scholarships.",
          "author": "New-Marketing-7164",
          "created": 1638997358,
          "upvotes": 1,
          "replies": {
            "hnrmu77": {
              "link": "/r/college/comments/rc0st3/how_do_i_get_help_to_help_pay_for_my_college/hnrmu77/",
              "text": "A financial advisor can help with filling out the FAFSA! All you need are official documents such as taxes, pay stubs, etc of your parents and yours if you work. Depending on how much money your family makes, your tuition can be mostly covered! Have you ever been part of a reduced/free meal program? Are you considered low income? If so, your FAFSA will help cover a large chunk of tuition. An advisor can also help with scholarships! All you need to do is google scholarships online and apply! They can depend on your major, your background (such as race, ethnicity, religion, gender, etc), or other factors.",
              "author": "absolutely_funny",
              "created": 1638997571,
              "upvotes": 2,
              "replies": {
                "hnro8q4": {
                  "link": "/r/college/comments/rc0st3/how_do_i_get_help_to_help_pay_for_my_college/hnro8q4/",
                  "text": "Yes. Thank you.",
                  "author": "New-Marketing-7164",
                  "created": 1638998119,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hntf7w9": {
              "link": "/r/college/comments/rc0st3/how_do_i_get_help_to_help_pay_for_my_college/hntf7w9/",
              "text": "It’s actually not a horribly complicated process. It’s all done online; just Google FAFSA and you’ll find the webpage for it. It’ll ask you to create a login/password and then tells you how to fill out whichever forms you need. \n\nAlso, I’m not trying to be mean when I say this… but if you feel like it’s too complicated/time-consuming, etc. to do the forms that will actually PAY for your college; you may want to reconsider going to college altogether then. Bc college itself is going to be a lot more complicated, time-consuming, hard, etc. than doing a FAFSA form 🤷🏽‍♀️",
              "author": "kturby92",
              "created": 1639026239,
              "upvotes": 2,
              "replies": {
                "hntfel6": {
                  "link": "/r/college/comments/rc0st3/how_do_i_get_help_to_help_pay_for_my_college/hntfel6/",
                  "text": "right.",
                  "author": "New-Marketing-7164",
                  "created": 1639026343,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}