{
  "sid": "rfq7p6",
  "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/",
  "title:": "Do you think I could convince my prof to raise my exam mark up 1% so I can pass the class.",
  "text": "I never have to take this type of class again, and I don’t plan on it if I were to pass. I just need the first semester class for my major.\n\nI really shit the bed on the exam and it was worth almost 50% of our grade. I will fail the exam regardless but if she bumps it up 1% I will pass the class.\n\nIs it worth a shot?",
  "author": "thats-rightcool",
  "created": 1639429776,
  "updated": 1639515970,
  "over_18": false,
  "upvotes": 147,
  "upvote_ratio": 0.92,
  "comments": {
    "hoggzk1": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoggzk1/",
      "text": "IF you ask about this (I advise against it, I find it rude) the question you ask is whether or not your professor rounds grades *in general,* and only if she does not specify her policy towards rounding grades in the syllabus. \n\n**DO NOT** ask her to round your grade in specific. That will only annoy her and will almost certainly result in her not rounding any grades.",
      "author": "patrdesch",
      "created": 1639447066,
      "upvotes": 149,
      "replies": {}
    },
    "hoff9pp": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoff9pp/",
      "text": "Give it a go, but keep your expectations low.",
      "author": "Orkney_",
      "created": 1639430165,
      "upvotes": 140,
      "replies": {}
    },
    "hoh7fuj": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoh7fuj/",
      "text": "Everybody saying it doesn’t hurt to ask - you’re all wrong.  The odds of getting rounded up are so much better by not asking.  We can’t give special treatment - if you ask we will say no for that reason alone. If you don’t ask we will very likely find a reason to add one percent.  Stop asking for this stuff you making it worse for yourself.",
      "author": "kryppla",
      "created": 1639459889,
      "upvotes": 50,
      "replies": {
        "hojgeuj": {
          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojgeuj/",
          "text": "How about phrasing it like you’re looking to do extra assignments or something of that nature?",
          "author": "Sfn_y2",
          "created": 1639505843,
          "upvotes": 1,
          "replies": {
            "hojj974": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojj974/",
              "text": "No.  You need to care this much about your grade all semester not grasp at straws at the end.",
              "author": "kryppla",
              "created": 1639506960,
              "upvotes": 8,
              "replies": {}
            },
            "hok0ttb": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hok0ttb/",
              "text": "Honestly even worse; why do you get to make up for it with extra credit but others don't? If that's a policy in general, the prof will mention it.",
              "author": "gargar070402",
              "created": 1639513832,
              "upvotes": 1,
              "replies": {}
            },
            "hojxhdc": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojxhdc/",
              "text": "If the prof hasn't mentioned specifically that there's extra credit, you're gonna annoy them by asking for it.",
              "author": "farmyardcat",
              "created": 1639512527,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoha6np": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoha6np/",
      "text": "Did you go to class ? Did you go to office hours ? I would raise your grade if you did those things. I can not stress enough how important it is to stop in office hours in a class that you have difficulties  . Showing you want to learn is huge .",
      "author": "Howie773",
      "created": 1639461585,
      "upvotes": 12,
      "replies": {}
    },
    "hoiji53": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoiji53/",
      "text": "I wouldn’t ask about it, unless you are a student that actually turned in every assignment, showed up to class each time, and always gave it their all. If you do ask, don’t butter her up when asking, it will come across as disingenuous. Just ask her if she rounds grades up in general/what her policy is regarding grades on the edge. Don’t be entitled and don’t pester her about it. You may very well need to retake the class.",
      "author": "JupiterRocket",
      "created": 1639492643,
      "upvotes": 4,
      "replies": {}
    },
    "hog6oab": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hog6oab/",
      "text": "If she wanted to she would already done it. Asking would make her change her mind. I've had 4 situations where I was just barely short of the next letter, didn't ask, and my grade got rounded up anyway. the one time I did ask, he said no.\n\n\nSo I suggest you don't ask",
      "author": "elkfn2",
      "created": 1639442336,
      "upvotes": 49,
      "replies": {
        "hogu9ot": {
          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hogu9ot/",
          "text": "[deleted]",
          "author": null,
          "created": 1639453084,
          "upvotes": 30,
          "replies": {
            "hoh16du": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoh16du/",
              "text": "legendary lmao",
              "author": "Mission_Painting972",
              "created": 1639456423,
              "upvotes": 4,
              "replies": {}
            },
            "hoh12j0": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoh12j0/",
              "text": "K",
              "author": "elkfn2",
              "created": 1639456370,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hoh5ita": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoh5ita/",
      "text": "It’s worth a try but don’t directly say you want a raise in your grade. I would go along the likes of talking them up like “I really enjoyed your class, I studied hard to get the best grade possible” maybe ask if you can get an extra credit option? Or a small side assignment to earn more credit. State that is is of your best interest to pass. I have tried this once before and it worked-but it really depends on the professor….. the worse they will say is no sound like you liked the class, and tried your best…",
      "author": "PrincessTML18",
      "created": 1639458763,
      "upvotes": 24,
      "replies": {
        "hoj12ml": {
          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoj12ml/",
          "text": "I’m a professor and this is absolutely terrible advice.  There’s nothing a student can say that will influence us to change a grade.  We are FAR more likely to find a few points as part of our regular end of term review/grading if we hear nothing from you.  It’s not spite, but if you ask and then we give points, that’s giving preferential treatment and we can’t do that.  So only ask if you want to shoot yourself in the foot and NOT get that higher grade you want.  We aren’t morons who can be manipulated by ridiculous methods like this.",
          "author": "kryppla",
          "created": 1639499897,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "hoft9qd": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoft9qd/",
      "text": "I got a notoriously rude professor to let me turn a final exam in three days late. He didn’t take off any points for the lateness either. Just ask they may surprise you! Good luck!",
      "author": "idkwhatimdoing5449",
      "created": 1639435990,
      "upvotes": 8,
      "replies": {}
    },
    "hofeyu0": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hofeyu0/",
      "text": "You have nothing to lose if you're going to fail the class anyway, but I'd say your chances are next to none. Professors can't and shouldn't give special treatment, simple as that.",
      "author": "Thelton26",
      "created": 1639430042,
      "upvotes": 9,
      "replies": {}
    },
    "hoff0am": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoff0am/",
      "text": "Yes, the worst it can happen is that you get a \"no\" for an answer, not a big deal",
      "author": "cegalleta",
      "created": 1639430058,
      "upvotes": 15,
      "replies": {
        "hohcwvk": {
          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohcwvk/",
          "text": "Unless you have to take the class by them again...",
          "author": "veanell",
          "created": 1639463376,
          "upvotes": 6,
          "replies": {}
        },
        "hojxuyg": {
          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojxuyg/",
          "text": "While that may be true in the short term, you create a reputation for yourself when you ask for freebies. That can affect your life in unexpected ways.",
          "author": "farmyardcat",
          "created": 1639512674,
          "upvotes": 1,
          "replies": {
            "hojyzgr": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojyzgr/",
              "text": "If she's never taking those classes again, then what's the deal? The professors that teach in the biological science faculty rarely know other professors from the physics faculty and even if they work together they'd rarely speak about a particular student among the hundreds of students they teach in each course.\n\nAt least in my uni, there are around 30 thousand students, most professors from basic courses (calculus 1, for instance, a course that 80% of my uni has to take) will never remember your name or even your face.\n\nNow, I agree it shouldn't be the main way you approach things, if you're getting your career out of pity, then that's definitely not ok, but if you're a med student sick of basic physics that you'll most likely never use again then screw it.",
              "author": "cegalleta",
              "created": 1639513109,
              "upvotes": 1,
              "replies": {
                "hok0x3a": {
                  "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hok0x3a/",
                  "text": "Again, you're right that, in the short term, there almost certainly won't be consequences. But in my experience, the kids asking for a round-up or a pity extension aren't just asking the one time due to a genuine emergency. It's more or less their M.O. and I guarantee you instructors *do* become aware of those kids.",
                  "author": "farmyardcat",
                  "created": 1639513868,
                  "upvotes": 1,
                  "replies": {
                    "hok43yg": {
                      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hok43yg/",
                      "text": "It'd matter if you plan on working with that professor. My view is that as long as it isn't a common practice (a modus operandi in your words) and it's not your area, then it's not a big deal.",
                      "author": "cegalleta",
                      "created": 1639515144,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hofgn7x": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hofgn7x/",
      "text": "It can hurt to ask, and you should not ask. If the professor has a rounding scheme, she will apply it to all students. If she does not, this is one of the most frustrating grade grubbing emails we receive. It DOES hurt to ask. Don't do it.",
      "author": "Galactica13x",
      "created": 1639430730,
      "upvotes": 16,
      "replies": {
        "hogy8ll": {
          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hogy8ll/",
          "text": "How does it hurt to ask? Whats the prof gonna do, fail him?",
          "author": "ReptyleKing",
          "created": 1639454976,
          "upvotes": 7,
          "replies": {
            "hojbmbw": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojbmbw/",
              "text": ">How many grades have you decreased because a student asked to be rounded up?\n\nIt the grade is a 69.5, then yeah, they're going to fail?",
              "author": "GhostlyMuse23",
              "created": 1639503977,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hofhadf": {
          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hofhadf/",
          "text": "It’s just a question tho",
          "author": "Johnkapler1890",
          "created": 1639430994,
          "upvotes": -20,
          "replies": {
            "hofhflo": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hofhflo/",
              "text": "It's not. It's asking for special treatment, and betrays an inflated sense of entitlement. And it's annoying. Read any thread here or on the other academic subs -- the consensus is that asking will hurt students and that professors find it insanely annoying. Just don't do it.",
              "author": "Galactica13x",
              "created": 1639431054,
              "upvotes": 33,
              "replies": {
                "hofwcm0": {
                  "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hofwcm0/",
                  "text": "am prof, can confirm. Your grade will or will not be rounded up depending on the professor's perspective and perhaps on the scores of other students. Asking will not help and might hurt.",
                  "author": "phainopepla1",
                  "created": 1639437301,
                  "upvotes": 21,
                  "replies": {
                    "hog5kmi": {
                      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hog5kmi/",
                      "text": "Most people are operating under the assumption that a professor would either round up when they otherwise would not have or they will do whatever they planned on doing in the first place. How many grades have you decreased because a student asked to be rounded up?",
                      "author": "jetsear",
                      "created": 1639441815,
                      "upvotes": 4,
                      "replies": {
                        "hogoh2s": {
                          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hogoh2s/",
                          "text": "I tend to round up and look for reasons to do so. Worked hard in class, contributed to class discussions, showed improvement during the semester, etc. But the generosity stops with grade-grubbing. More important, I have never raised a grade based on a student request. If you are asking if I've lowered a grade, then never as the student did not earn a lower grade.",
                          "author": "phainopepla1",
                          "created": 1639450414,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "hofwvzz": {
                  "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hofwvzz/",
                  "text": "So I just asked for a round up from my B to an A because it was an 89.4 and my professor was super chill about it. He also wished me the best after I reached out to him. \n\nMy point here is that maybe there are bigger things to take offense to? These are just people trying to create a future for themselves… not everyone has it easy. Please try to be more empathetic to your students. \n\nWe are tired.",
                  "author": "Deepseadyson",
                  "created": 1639437533,
                  "upvotes": 13,
                  "replies": {
                    "hogwjb9": {
                      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hogwjb9/",
                      "text": "This. Never seen so many educators look more immature in their responses. Life is complicated and so is education, of course kids will reach out to try and better their grade/ future. Maybe as an adult/ educator, you should see people as humans and not some standard annoyance you expect each grading cycle.",
                      "author": "Calintz92",
                      "created": 1639454162,
                      "upvotes": 4,
                      "replies": {
                        "hohd6hv": {
                          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohd6hv/",
                          "text": "It's because grade grubbing is increasing a lot. If you had 30 emails all asking you this in one day, would you act positively. Professors are people to and are allowed to voice there opinions anonymously on here. The student asked professors and professors are being honest",
                          "author": "veanell",
                          "created": 1639463555,
                          "upvotes": 6,
                          "replies": {
                            "hohdca5": {
                              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohdca5/",
                              "text": "Oh, I didn’t say they shouldn’t use their first amendment right. It’s just that, using my first amendment rights, I am calling them immature and petty. Opinions eh… And 30 students asking for a bump? I’d prob just incorporate a curve with that many and tell everyone (before the emails drive you crazy) the bump was given and no further grade changes will be given. I wouldn’t think the students are somehow annoying or immoral. They are being humans and kids",
                              "author": "Calintz92",
                              "created": 1639463663,
                              "upvotes": 2,
                              "replies": {
                                "hohdnvk": {
                                  "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohdnvk/",
                                  "text": "Literally had a student ask for a bump of a bump...",
                                  "author": "veanell",
                                  "created": 1639463880,
                                  "upvotes": 4,
                                  "replies": {
                                    "hohfqfg": {
                                      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohfqfg/",
                                      "text": "And on that I’d be disappointed but understand the students stress. I’d explain it isn’t fair to other students and that I already said no further grade alterations would be made (and possibly give tips on succeeding in the course on their next go through if it’s failing). The students stress is understandable, and it should be a teaching moment for the student. \n\nI agree with your general idea on it being inconvenient, but they are learning in more ways than just the subject you’re teaching. Showing compassion and care during a students worst is a teaching moment in itself.",
                                      "author": "Calintz92",
                                      "created": 1639465325,
                                      "upvotes": 1,
                                      "replies": {
                                        "hojbh8h": {
                                          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojbh8h/",
                                          "text": ">Showing compassion and care during a students worst is a teaching moment in itself.\n\nIt sounds like you want college professors to be more than professors, but also cheer leaders and counselors? This is college, not high school, where accountability and responsibility should exist, as college students are adults.",
                                          "author": "GhostlyMuse23",
                                          "created": 1639503922,
                                          "upvotes": 0,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                },
                                "hojba3q": {
                                  "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojba3q/",
                                  "text": "> They are being humans and kids\n\nThey're literally adults, and professors are human, too.",
                                  "author": "GhostlyMuse23",
                                  "created": 1639503845,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "hojb5jw": {
                          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojb5jw/",
                          "text": ">of course **kids** will reach out to try and better their grade/ future. Maybe as an adult/ educator, you should see people as humans and not some standard annoyance you expect each grading cycle.\n\nWe're talking about college, not high school, so these are young adults not kids. Like professors, the students in a college setting are also adults, so maybe students should see their professors as humans and not some machine who should be expected to comply with every demand a student makes.",
                          "author": "GhostlyMuse23",
                          "created": 1639503796,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "hojathj": {
                      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojathj/",
                      "text": ">Please try to be more empathetic to your students.\n\nWhy can't student shave the same empathy for their professors? It's like students  want to take without giving anything back. Professors are humans, too. Do you think they want to spend. a tedious 5 minutes replying to someone begging when they could be spending those 5minutes getting actual work done?",
                      "author": "GhostlyMuse23",
                      "created": 1639503663,
                      "upvotes": 0,
                      "replies": {
                        "hojckzu": {
                          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojckzu/",
                          "text": "Students want to take without giving anything back? Really??? Jfc.",
                          "author": "Deepseadyson",
                          "created": 1639504346,
                          "upvotes": 1,
                          "replies": {}
                        },
                        "hojjqo6": {
                          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojjqo6/",
                          "text": "As a student, I don’t expect “special” treatment with nothing to offer in return. I work very hard. \n\nI provide all of my professors with an insane amount of time and work, I do what needs to be done to complete the assignment. I have sacrificed my own health in the name of a college education, I now have to rely on a medication for the rest of my life because I pushed myself too hard. I have worked long hours to pay for my tuition out of pocket. I have no social life. \n\nWhat more can I provide in return for your service so that I don’t come off as entitled, sir?    \n\nPlease, explain…",
                          "author": "Deepseadyson",
                          "created": 1639507151,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hohe3m1": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohe3m1/",
      "text": "Just ask, it’s not like you’re losing any money, or anything related to that. You will be losing money though if you do have to retake lol.",
      "author": "Lukerpooker",
      "created": 1639464184,
      "upvotes": 2,
      "replies": {}
    },
    "hohkvzb": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohkvzb/",
      "text": "Clearly asking can’t hurt, because you either fail or you fail and they don’t like you lol. But what I would do is ask if there’s anything you could do to bump up that one percent. Don’t just ask for a free round, basically make a deal",
      "author": "Is_thememe_deadyet",
      "created": 1639469164,
      "upvotes": 3,
      "replies": {}
    },
    "hogeg46": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hogeg46/",
      "text": "Worth a shot! I’m a teacher and when students ask me to bump their grades up, I look at how many assignments were turned in late, their grades on their day-to-day work (not exams), and how they participated during class. The catch is, I only bump up grades if the student is borderline between a D and a C. 🙂 Please let us know what your professor says!",
      "author": "Ashabasha212",
      "created": 1639445902,
      "upvotes": 4,
      "replies": {}
    },
    "hoffst8": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoffst8/",
      "text": "Doubt it but couldn't hurt to ask",
      "author": "ITaggie",
      "created": 1639430385,
      "upvotes": 3,
      "replies": {}
    },
    "hohaogu": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohaogu/",
      "text": "If the other option is to fail the class than I would personally write an email being completely honest. Say that you accept full responsibility for your poor performance but that you really need that 1% boost and are willing to work for it. I was never actually in a similar situation but I do know professors don’t like to be fed BS. They appreciate honesty.",
      "author": "StopPlayingTheGame",
      "created": 1639461892,
      "upvotes": 1,
      "replies": {}
    },
    "hoffm04": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoffm04/",
      "text": "Do it! Maybe she will be nice and bless you.",
      "author": "Ruthless_Aj",
      "created": 1639430307,
      "upvotes": 2,
      "replies": {}
    },
    "hogyfu3": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hogyfu3/",
      "text": "Absolutely ask, i told a teacher i needed an 82 before a final was even graded and she gave me the 82. Hennythings possible",
      "author": "ReptyleKing",
      "created": 1639455076,
      "upvotes": -4,
      "replies": {}
    },
    "hofvc4x": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hofvc4x/",
      "text": "I would just email the professor, explain your situation, and ask about how she plans to handle borderline grades like yours. This will draw her attention to how close you are to passing and doesn't come across like you are asking for special treatment. Oftentimes professors will just pass you in a situation like this, if they can find a reason to.\n\nedit: a small curve will sometimes only really affect borderline grades once the letter grade is put in. This is fine and fair as long as everyone is curved the same amount.",
      "author": "BikeBonanza",
      "created": 1639436859,
      "upvotes": -6,
      "replies": {
        "hofx5pq": {
          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hofx5pq/",
          "text": "I would be just as irritated by this. What do you mean \"plan to handle borderline grades\"? The grades handle themselves. They are entered as is. (Mind you, I'm just a TA, but grade-grubbing e-mails are the worst.)",
          "author": "Bravely-Redditting",
          "created": 1639437650,
          "upvotes": 11,
          "replies": {
            "hogg5ce": {
              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hogg5ce/",
              "text": "I’m also a TA and assuming the student showed up and did the work as expected, or showed substantial improvement over the semester, I’d be more than happy to curve the the 1 point they needed to pass. 🤷‍♀️ Grades are not objective.",
              "author": "BikeBonanza",
              "created": 1639446687,
              "upvotes": 3,
              "replies": {
                "hoggh5y": {
                  "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoggh5y/",
                  "text": "If you don't believe that there is objectivity in grading then you are doing it wrong. Grades mean something. You are doing a disservice to every one of your hard-working students who earned their grade if you adjust the grades of whiny students any which way.",
                  "author": "Bravely-Redditting",
                  "created": 1639446833,
                  "upvotes": 3,
                  "replies": {
                    "hoggquc": {
                      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoggquc/",
                      "text": "To say grades are objective doesn’t make sense when the instructor sets the standards and decides how well the students meet them. Clearly there is some bias/wiggle room in this process. Bumping students up is fine as long as everyone gets equal treatment.",
                      "author": "BikeBonanza",
                      "created": 1639446954,
                      "upvotes": 0,
                      "replies": {
                        "hogo44y": {
                          "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hogo44y/",
                          "text": "1.) Yes, the instructor sets the standard. Grading is meant to objectively assess whether or not students are meeting that standard.\n2.) If you grade with a rubric, there really isn't much bias or wiggle room, even with essays.\n3.) If you bump everyone up, that's fine. That's fair. But you are encouraging OP to write a pleading e-mail for special treatment. That is not fair.",
                          "author": "Bravely-Redditting",
                          "created": 1639450250,
                          "upvotes": 5,
                          "replies": {
                            "hoha9z2": {
                              "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hoha9z2/",
                              "text": "It’s not asking for special treatment to ask if there is going to be any curve/bump. And rubrics do help, but there is no perfect solution. So that’s why I err on the side of kindness fairly. I assume there is some error in my grading, and I’d rather a student get a higher grade than they “should” get instead of a lower grade than they deserve.",
                              "author": "BikeBonanza",
                              "created": 1639461641,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hohdt9o": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hohdt9o/",
      "text": "[removed]",
      "author": null,
      "created": 1639463984,
      "upvotes": 1,
      "replies": {}
    },
    "hojf9oh": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojf9oh/",
      "text": "second to a lot of professors here i agree. i never asked for things like these from any professors but often times three would email me giving me an option for extra credit or such if they saw my grade was lacking a bit. i always tried my best in class and i but think my professors saw it. or maybe i got a good batch or professors. regardless if you tried your best know your professors saw it and that it is very likely they will approach you or bump up on their own if it’s only 1% to pass. they do not want you to fail. i don’t think you should ask as a lot of professors are saying not to. but from my personal experience it’s likely they will bump up your grade.",
      "author": "lalinlux",
      "created": 1639505390,
      "upvotes": 1,
      "replies": {}
    },
    "hojt1oe": {
      "link": "/r/college/comments/rfq7p6/do_you_think_i_could_convince_my_prof_to_raise_my/hojt1oe/",
      "text": "FWIW, as a professor, I don't really give these requests much consideration.  For some of the same reasons outlined here.  It feels too much like special treatment and if all a student has to do to get a better grade is ask, it devalues the work they've done and the work others have done and as a rule, I ignore specific requests.  I tend to take a holistic view of grades and when students' efforts aren't in line with their earned grades, I consider that.  If a student who hasn't done well on an exam has put a lot of effort into classroom discussions or has met outside of class to discuss their issues in advance, that's worth something and is rewarded.  Not helpful to you now, but perhaps something to consider going forward.  If you know you're headed for a wall, it helps to do something about it before you smack into it.  That has helped me in the past as a student and a professional.\n\nAlso, failure is a part of life and a lesson that needs to be learned and a feeling that needs to be felt.  It takes many shapes throughout life.  Failure makes you stronger and it makes you better.  The feeling of failure and the experience of it makes your successes that much more important and valued.  You really earned those successes because your path has been dotted with disappointments and failures.  There is value in considering what failures mean to you and your life path.  Failures hurt and it's easy to get down about stumbles along the way.  Don't.  But also don't think you are doing yourself any favours by avoiding the hard moments in life and school.  That's a recipe for future pain.\n\nI suppose there is a risk analysis in your exercise.  There is a possibility that it does you no good if your professor takes my approach, in which case, there is little risk to you.  There is a possibility that your professor takes a much harder line approach, in which case there is a significant risk that the result is adverse to your interest.  In either event, I would suggest that grade grubbing (or whatever you consider it) is not a good look and is a very temporary solution to a perennial and permanent problem in which you only end up short-changing your future self.  Look at what you get in exchange for what it costs you.\n\nBe well and best of luck to you.",
      "author": "thewaxmania",
      "created": 1639510797,
      "upvotes": 1,
      "replies": {}
    }
  }
}