{
  "sid": "q86k70",
  "link": "/r/college/comments/q86k70/college_pocketing_needbased_grant/",
  "title:": "College Pocketing Need-based grant",
  "text": "I am traveling abroad through IES Abroad and have recently learned about one of my colleges policies. No matter how cheaper tuition is abroad I will still be charged my college's tuition. For example, if my tuition abroad costs $12,000 and my college's tuition costs $18,000 then my college receives a tuition invoice from IES Abroad for $12,000, charges me $18,000 and then pockets the $6000 (the financial aid office even admitted this is how it works.) All other bills like room and board I pay directly to IES Abroad. That isn't even the worst part. Through IES Abroad I qualified for a $2000 need-based grant. Awesome, right? Wrong. I learned that the agreement my college has with IES Abroad is that all grants get credited to tuition. So that $12000 tuition invoice changes to $10,000 and now my college pockets $8000. That's right. My college pockets my $2000 need-based grant that was suppose to help me pay for room and board, flights, transportation, etc. This all seems really shady and infuriates me. Does anyone have any thoughts or similar experiences? My college pushes study abroad really hard stating that \"many times it cheaper than studying here\" but now I am realizing the opposite is true and that they just are making thousands of extra dollars off of students studying abroad.",
  "author": "Own-Smile-9546",
  "created": 1634238727,
  "updated": 1634583572,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgngrpm": {
      "link": "/r/college/comments/q86k70/college_pocketing_needbased_grant/hgngrpm/",
      "text": "[removed]",
      "author": null,
      "created": 1634241404,
      "upvotes": 1,
      "replies": {}
    },
    "hgo7izd": {
      "link": "/r/college/comments/q86k70/college_pocketing_needbased_grant/hgo7izd/",
      "text": "Who issues the each grant? Is the larger grant something with a name, like a pell grant? Is the university public?",
      "author": "darniforgotmypwd",
      "created": 1634253963,
      "upvotes": 1,
      "replies": {}
    },
    "hh3v3w9": {
      "link": "/r/college/comments/q86k70/college_pocketing_needbased_grant/hh3v3w9/",
      "text": "One option might be withdrawing for the semester and then transferring the academic credits from studying abroad back to your school. But there are a lot of potential complications - including whether your school will take those credits, whether it affects financial aid you're receiving, and whether it will affect your class year or standing with the school - that are going to depend a lot on both your personal situation and policies at your school.",
      "author": "burp-king",
      "created": 1634564395,
      "upvotes": 1,
      "replies": {}
    }
  }
}