{
  "sid": "q4cocn",
  "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/",
  "title:": "Not really sure what to do",
  "text": "I’m currently in my fifth year of college, and should be graduating in the spring. This past summer I attempted 3 courses in which I completely neglected out of choice. This semester, I tried for the first two weeks and have also neglected my classes. I never wanted to go to college, but my parents forced me. As someone who just turned 18 at the time, I felt like I couldn’t say no. I am completely disinterested in school I have literally no desire to continue. Although my parents forced me to go to college, I’m the one who has paid all years. I’m aware I’m close to finishing and it’s a huge waste of money but I just don’t want to do it anymore. I am just going back and forth and don’t really know what to do - also my brother dropped out and I would be first gen graduate which is why I’m nervous. Any advice would be great and please be honest :/",
  "author": "imaginarylavander",
  "created": 1633747648,
  "updated": 1634083136,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.92,
  "comments": {
    "hfxq61n": {
      "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfxq61n/",
      "text": "I would strongly recommend pushing through to the end. You’ve worked so hard to make this happen, even if you didn’t want to initially. I promise you, you’re not alone in feeling that way. Put in the minimum amount of effort to pass and graduate, and then once you’ve done that you may never use the degree, but more likely than not it will be helpful at least to some extent. Good luck. Best wishes.",
      "author": "to_walk_upon_a_dream",
      "created": 1633748409,
      "upvotes": 12,
      "replies": {
        "hfxsx8q": {
          "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfxsx8q/",
          "text": "You’re right, at least I will have something to show for after spending all this money. I’m just falling behind so much this semester so it’s intimidating me a lot. But I think I can definitely push through. Thanks so much and thanks for being so kind - a lot of friends I’ve went to with this situation we’re kinda rude to me and acting like I was stupid for feeling this way.",
          "author": "imaginarylavander",
          "created": 1633749854,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hfxq8zn": {
      "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfxq8zn/",
      "text": "Finish it. Even if you don’t end up in your major field, you’ve come so far and spent so much. Finish it, then do whatever you want. If you don’t finish it you’ll have that money hanging over your head for no reason. One year maybe no big deal but you’re so close. You can do it.",
      "author": "auntiepirate",
      "created": 1633748452,
      "upvotes": 7,
      "replies": {
        "hfxt0s7": {
          "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfxt0s7/",
          "text": "So true especially about the money part. At least I’ll have something to show for. Thanks so much for you input and words of encouragement, sometimes I just need to hear something like that to keep me pushing. 😊",
          "author": "imaginarylavander",
          "created": 1633749908,
          "upvotes": 3,
          "replies": {
            "hfxue8i": {
              "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfxue8i/",
              "text": "I’m a professor and see this a lot. You are feeling what a lot of students feel. Just keep swimming a little longer and try to have some fun too. :)",
              "author": "auntiepirate",
              "created": 1633750633,
              "upvotes": 3,
              "replies": {
                "hfxv1ok": {
                  "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfxv1ok/",
                  "text": "It makes me feel a lot better knowing I’m not alone, thank you so much! I see so many people from my high school graduating college now, and it just makes me feel like I’m doing something wrong or like an outcast sort of? Thank you so much again 😊",
                  "author": "imaginarylavander",
                  "created": 1633750975,
                  "upvotes": 3,
                  "replies": {
                    "hfyxgu8": {
                      "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfyxgu8/",
                      "text": "There is nothing magical about 4 years! Just buckle down and finish it. And (almost) congratulations on your degree!",
                      "author": "Awkward_Result6214",
                      "created": 1633778350,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hfxq9gk": {
      "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfxq9gk/",
      "text": "If you are five years in with one semester to go I would just keep going. Even if you don't enjoy it you should still finish because you invested a lot of time and money already and you can do a lot with a degree. If you really really don't have the drive to finish next semester have a back up plan, pickup a trade, find something that you really love to do.",
      "author": "KW01328",
      "created": 1633748460,
      "upvotes": 3,
      "replies": {
        "hfxt5mz": {
          "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfxt5mz/",
          "text": "Thanks so much for the advice, I appreciate it a lot. I at least would like to have a back up plan but I’m so indecisive which discourages me a lot. I think I can push through, especially being all the time and money I put into it. Thanks again 😊",
          "author": "imaginarylavander",
          "created": 1633749980,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfyppbu": {
      "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfyppbu/",
      "text": ">I never wanted to go to college, but my parents forced me.\n\nThat’s your entire problem right there.  If you were first or second year I’d suggest am honest convo with your parents about your goals in life, etc.  But you’re closer to the end than to the beginning, so just do the minimum to pass what you have to pass and gtfo.  Then you can proceed to do whatever you would have done instead of college, but with a degree in hand, which can only help you.\\*\n\n\\*Unless your degree has a negative ROI, meaning that what you spend on it (plus interest on student loan debt) is more than the lifetime earnings increase you get compared to not having it.  It‘s mostly arts and humanities majors who have to worry about this, unfortunately.",
      "author": "civis_romanus",
      "created": 1633772205,
      "upvotes": 3,
      "replies": {
        "hfzwoau": {
          "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfzwoau/",
          "text": "Can’t support this enough as an arts professor.",
          "author": "auntiepirate",
          "created": 1633797006,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfy7110": {
      "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfy7110/",
      "text": "What would you have done if you didn't go to college five years ago?",
      "author": "AcademicDifficulty",
      "created": 1633758154,
      "upvotes": 2,
      "replies": {}
    },
    "hfz26ye": {
      "link": "/r/college/comments/q4cocn/not_really_sure_what_to_do/hfz26ye/",
      "text": "I see this a ton in this sub. \n\nThe reality of it is that a job without a degree will be FAR worse than college. I promise you. \n\nCollege is not a huge waste of money. You're getting a ton of value out of it. I wish it was cheaper, but it definitely pays off. \n\nI dropped out when I was in my early 20s. I'm back a decade later because in 10 years of working jobs, I always easily hit the pay ceiling of my positions. Plus, all those jobs were fucking horrible.",
      "author": "Awkward_Mail_2786",
      "created": 1633781624,
      "upvotes": 1,
      "replies": {}
    }
  }
}