{
  "sid": "rezfb4",
  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/",
  "title:": "How do \"gen-eds\" work in American colleges.",
  "text": "The concept of gen-eds is weird to me. Particularly if you pay very big money for the \"privilege\" of studying in a university. From what I understand, anyone, even an engineering major is forced to attend classes that are totally unrelated to their major. How much time to they take up? Do all universities require the same amount? Are they taken seriously? Doesn't anyone have a problem with paying exorbitant tuition fees and being forced to take classes they don't need? ",
  "author": "CleaverIam",
  "created": 1639346409,
  "updated": 1639516193,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.7,
  "comments": {
    "hoaxlid": {
      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hoaxlid/",
      "text": "Most universities have requirements for an English/writing class, a math class, a science class, a history class, and a foreign language class. The exact details will vary from school to school but that’s the overall idea. I think the general education requirements at my school totaled about 36 credit hours, or about 12 classes spread out over 4 years. Again, it will be different depending on where you go. \n\n(For reference, most bachelors degrees require about 120 credit hours.) \n\nSome of these courses can over lap with your major. For example as a chemistry major I took a lot of math and science anyway. Calc 1 counted as a math gen ed and my chem 1 and bio 1 counted as my science gen eds. \n\nThere are several reasons for them. I personally think money is a big one - they can require them and you have to pay if you want the degree. \n\nBut I think another reason is to ensure that everyone starts off on somewhat equal footing as they get into the upper level classes. High school education varies wildly and some people don’t have the same opportunities, same level of education, or even quality teachers prior to college. They may need some of the gen ed courses to be able to do well in later courses. \n\nI think another idea behind them is that anyone who goes to college will have a basic understanding of math, science, reading, and writing at a higher level than just what’s taught in high school. \n\nNow what is done in theory and how it plays out in reality are two very different things. Colleges have become more and more about making money and less about preparing students to enter a more specialized job field. \n\nThat’s my 2 cents on it anyway.\n\nETA: Some people take them seriously, some don’t even try. Some are stupid easy because the profs know you don’t care so they make it easy to pass. Some profs seem to purposely make their courses super difficult or tedious for some reason. People can and do get very upset about paying for classes they don’t want to take. Other people just try to take the most interesting ones they can.",
      "author": "usuallyConflicted",
      "created": 1639347529,
      "upvotes": 4,
      "replies": {
        "hob830i": {
          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hob830i/",
          "text": ">High school education varies wildly and some people don’t have the same opportunities, same level of education, or even quality teachers prior to college\n\nShouldn't admission exams account for that?",
          "author": "CleaverIam",
          "created": 1639352028,
          "upvotes": 1,
          "replies": {
            "hobbs6f": {
              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobbs6f/",
              "text": "To an extent, yes. Especially at the more selective schools.  \n\nBut let’s say you have one student at a mediocre high school and one at a top high school. They take similar classes and get similar grades. The top school has better teachers and better opportunities. When applying to the local state university, both students get in. The student from the average school might find the gen eds challenging because high school was never that hard for them. But the student from the top school might be bored from the gen eds because they find it similar to some high school courses. \n\nI hope that makes sense, there’s obviously a lot more to it but that’s the first example that came to mind lol \n\nAlso the higher the admissions rate is at a school, the more likely you are to find a range of students with very different high school backgrounds. \n\nAnd more schools are doing away with ACT and SAT entrance exam requirements. I graduated before that came into effect so I don’t really know how that’s changing anything but it could be 🤷‍♀️\n\nThe more selective the school, the more prepared you’d expect the students to be. A lot of private schools are considered liberal arts schools. To get a liberal arts (aka “well rounded”) education, you’re expected to take a wide range of courses. I guess that’s another reason for gen eds? \n\nI hope that sorta helps to explain it? There are a lot of potential reasons for gen eds and a lot of students disagree with them. I’m sure someone smarter than me has ideas on how to change the system, but for now it is what it is",
              "author": "usuallyConflicted",
              "created": 1639353697,
              "upvotes": 3,
              "replies": {
                "hobc69i": {
                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobc69i/",
                  "text": ">But let’s say you have one student at a mediocre high school and one at a top high school.\n\nBut if they both take an entrance exam, one would struggle and the other one would breeze through without issues..",
                  "author": "CleaverIam",
                  "created": 1639353872,
                  "upvotes": 1,
                  "replies": {
                    "hobesrc": {
                      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobesrc/",
                      "text": "no, they make entrance exams super easy in the united states compared to other countries with entrance exams. students at good high schools usually take them in their 2nd year of high school (2 years before finishing).\n\nfor that reason, the best colleges do not really care about entrance exams as long as the applicant has a top score. And all colleges use non-academic factors to admit students like race/ethnicity, work history, volunteerism, awards.\n\nGaokao (I see you made comparison in another comment) is significantly harder than american SAT/ACT. There is no comparison. Chinese students are usually surprised by how easy SAT/ACT are (except for English reading/writing part). There is no science, history, foreign language on SAT. There is a little bit of science on ACT, but still no history or foreign language. Just reading/writing and math. Math does not even cover up to trigonometry (sine, cosine, tangent, radians).",
                      "author": "wobbletelescope",
                      "created": 1639355066,
                      "upvotes": 2,
                      "replies": {
                        "hobfy4j": {
                          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobfy4j/",
                          "text": "I am not a fan of the Gaokao itself (it along with the rather brutal Chinese approach to learning is very stressful for students) but I like the idea of an impartial unified state exam that is the sole determiner for who gets a place in the university. I think it removes all the biases and makes the education both more equal and more academically selective.",
                          "author": "CleaverIam",
                          "created": 1639355585,
                          "upvotes": -1,
                          "replies": {
                            "hobgfw3": {
                              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobgfw3/",
                              "text": "you will get heckled in public for saying that because they will insist that is unfair to poor people. it is, but they do not understand that is how education has been for thousands of years: rich people spend more money on tutoring and books for their kids, poor people can't and maybe their kids have to work instead of study.",
                              "author": "wobbletelescope",
                              "created": 1639355812,
                              "upvotes": 1,
                              "replies": {
                                "hobgydh": {
                                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobgydh/",
                                  "text": "It is more fair to poor people. That way there is no way for a rich parent to \"influence\" the admission team into accepting their child into a program. All would be decided by the exam and the exam alone. No extracurricular achievements, that a poor kid wouldn't have had a chance to get. No sport achievements or what not. Just their brains.",
                                  "author": "CleaverIam",
                                  "created": 1639356044,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hobe4cd": {
                      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobe4cd/",
                      "text": "Ah but not all universities in the US have a set entrance exam and they will consider more than just an exam score for admissions. Many universities take a holistic approach to the admissions process. They take into consideration a students high school grades, extracurricular activities, teacher references, and ACT or SAT scores. \n\nWhile ACT and SAT scores can be important for admission, they are not the only factor. And schools with a high acceptance rate will have students who scored all across the board on the exams. You can have students who scored a 22/36 and a 36/36 on the ACT sitting next to each other in the same gen ed course freshman year.",
                      "author": "usuallyConflicted",
                      "created": 1639354758,
                      "upvotes": 1,
                      "replies": {
                        "hobfh30": {
                          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobfh30/",
                          "text": "Why not use exams as the only parameter for admission? That sounds like a more fair and impartial approach",
                          "author": "CleaverIam",
                          "created": 1639355370,
                          "upvotes": 1,
                          "replies": {
                            "hobh632": {
                              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobh632/",
                              "text": "I’m not an expert on these things so I don’t know, but here are some potential reasons I can think of. I’m sure there are plenty of nuances to this issue and other reasons I’m missing but this is what I can come up with right now. \n\nSome potential reasons:\n- a lot of the exams don’t really test your knowledge or understanding but rather your ability to take a test\n- students in lower income areas are at a disadvantage for a lot of test prep and other educational resources, a more holistic admissions process helps to bring a wider variety of students to a school\n- some very intelligent and capable students just don’t test well\n- a single exam cannot take into account a students total academic history and future academic potential \n- the education system here is just different than in other parts of the world \n\nAlso all of this is in regards to bachelors level degrees. Once you start getting to grad school, test scores play a much larger role. (From my understanding of it at least.)\n\nHow do university admissions work where you are from? Is it all exam based?",
                              "author": "usuallyConflicted",
                              "created": 1639356143,
                              "upvotes": 1,
                              "replies": {
                                "hobjc4n": {
                                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobjc4n/",
                                  "text": ">How do university admissions work where you are from? Is it all exam based?\n\nThere is a unified state exam that after the end of high school. Everyone has to take the exam for Maths (basic or advanced - your choice) and Russian in order to graduate. Other than these two you can take the exam for any other available subject of your choice: physics, chemistry etc. The exam result is graded out of 100.\n\nEvery university has a list of programs (majors) you could apply to. Each major has its list (usually 3) of exams that you have to have taken in order to apply. Russian is a must but the other two depend on the major. The exact subjects are decided by the university. Chemical engineering for example usually requires Russian, Maths and Chemistry. Program engineering - Russian, Maths and IT. Law (we have undergraduate law programs) requires Russian, Social Science and History...you get the point.\n\nEvery program at each university has an X number of places.  All applicants have their exam scores across the relevant subjects summed  and everyone is arranged in order according to this sum. The top X applicants from this list get admitted into the program.\n\nThis system has totally eradicated corruption during admission process since it is both transparent and completely out of hand of the universities, since they have no control over the unified state exam.\n\nIt is actually a very effective social lift, since you can be very poor and still do well on the exams. The rich have a slight advantage of being able to hire tutors, but previously, they could just bribe their way into the university which is now all but impossible.",
                                  "author": "CleaverIam",
                                  "created": 1639357102,
                                  "upvotes": 1,
                                  "replies": {
                                    "hobn522": {
                                      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobn522/",
                                      "text": "Thanks for explaining! I enjoy learning how other countries do things like this. It’s very different from the US lol",
                                      "author": "usuallyConflicted",
                                      "created": 1639358846,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hobwpev": {
      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobwpev/",
      "text": "A big part of college and higher education in general in the US is not necessarily becoming very good at one thing, but learning how to learn and changing your perspective into a more analytical, pragmatic approach that can be applied more broadly than the specific degree you actually earned. A lot of people don't like that they have to take GE classes and would rather just do their major - I used to be one of those people. The reality is that the GE and support classes are honestly more important than your major classes when it comes to actually getting a job and working. This is one of the reasons - I'm going to get downvoted for this, but whatever - that international graduates struggle so much in the US job market. Specifically, in computational fields, the market is essentially flooded with CS graduates from Indian universities, and while they may be good at coding, they lack the basic communication skills and ability to think outside of the box that GE classes teach you. There is such a focus on just being the best at solving specific problems that nobody ever learns what they are actually doing on a level that can be applied to another situation, or how to articulate their thoughts and work effectively on a team. Companies hire you for your ideas - if you have tons of great ideas but can't articulate them, then they are just thoughts. And if you know a ton about one thing but can't extend that to learn about something else, well, your education is essentially devalued.",
      "author": "hardtaildude",
      "created": 1639363223,
      "upvotes": 3,
      "replies": {
        "hod4j5x": {
          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hod4j5x/",
          "text": "> they lack the basic communication skills and ability to think outside of the box that GE classes teach you\n\nOr perhaps they simply don't have the language skills and communication ability of somebody who grew up in the US?",
          "author": "CleaverIam",
          "created": 1639391406,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoaymdg": {
      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hoaymdg/",
      "text": "So the way they work is that they usually aren't specific classes that are required, but competencies. So there's a \"quantitative reasoning\" requirement, so engineers have to take calculus anyways and it's fulfilled along the way while and English major would still have to take College Algebra or Intro Statistics even though it's unrelated.\n\nSimilarly, everybody usually has to take a class for \"Arts\" or \"Civics\" which for the humanities are probably already covered, but as an engineer I had to take an Intro to Music History, History before 1500, World Religions, etc. that was \"unrelated\" to my major.\n\nSo how long it takes really just depends. The better question that maybe you can answer is that in the US, a bachelor's degree takes 120 credits. Some majors only have 40 or 60 credits of required courses, so they have plenty of room in their schedule for the general and still only have to hit the 120 credit minimum. As an engineer, there were more like 80 or 90 defined credits (counting all the pre-reqs like 3 calc classes, 2 physics classes, etc), so the general education credits on top actually made it where even the most efficient degree path for my major (Chemical Engineer) is probably closer to 130 credits. So it'd be 3 or 4 extra classes across 4 years.\n\nDo you have credit minimums for a bachelor's where you're from?\n\nAnd to answer the question, yes lots of people are bitter. However, a lot of schools in the have a flat tuition rate above 12 credits, so if you can manage doing 15+ credits per semester, you're actually not paying much more for those classes. It's if you slow down to 12 credits or go part time that you might pay extra for these gen eds.",
      "author": "Thelton26",
      "created": 1639347954,
      "upvotes": 2,
      "replies": {
        "hobaprc": {
          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobaprc/",
          "text": ">Do you have credit minimums for a bachelor's where you're from?\n\nI am not sure what a credit minimum is. I had no idea we even had a concept of  a \"credit\" until I started studying my university program's paperwork when I accidentally stumbled upon this term. It is not something an average student ever interacts with.\n\nCorrect me if I am wrong, but from what I have heard, in the US, in order to graduate with a major you need to complete a list of classes, but which semester you have is class is at least partially up to you and you are free to take extra classes if you feel like it. This is NOT how it works here in Russia. Once you are admitted to a program, you have a set path which every student in your program has to take. You cannot repeat a class. If you fail a class you will have to repeat the whole year (granted, you wouldn't have to repeat the classes you didn't fail that year). Everyone takes all the classes in the same order with same people (your group). You might be able to choose a class or two along the way but that is something very new which has only starting to appear.\n\nSo I guess we don't really have a concept of a \"credit minimum\".\n\nP.S. I am a chemical engineer too BTW)))",
          "author": "CleaverIam",
          "created": 1639353213,
          "upvotes": 1,
          "replies": {
            "hobbrgv": {
              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobbrgv/",
              "text": "It sounds like the way your country approaches school is more like how we do medical or dental school. My sister did Physical Therapy School, and slit was 3 years if year round school, with all the same students, and if you fail you either quit the program or wait a year for it to come around again.\n\nAs for undergrad, you're correct that they are somewhat linear but there is freedom. My engineering degree had about 5 semesters worth of \"take this class, then take that class, then that class\", but you could spread them out and do it slower if you needed to, and several were offered multiple times a year. As well, we had 12 credits of upper level technical electives that had to be in the engineering college, but we got to choose, so I took a programming class, a Petroleum Engineering class, and a Biomedical Engineering class.\n\nAs for a credit minimum, I would assume there is probably some standardized minimum number of credits or classes in Russia. If you look at other majors, they probably all take about the same amount of time as each other, and that's due to the credit minimum. I assume this is because there are a lot of jobs now that say they want a college graduate, but it could be any degree in a certain field, or even any degree at all. So there needs to be some level of consistency about how much time/effort/education goes into a bachelor's degree.",
              "author": "Thelton26",
              "created": 1639353688,
              "upvotes": 1,
              "replies": {
                "hobcxrc": {
                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobcxrc/",
                  "text": ">As for a credit minimum, I would assume there is probably some standardized minimum number of credits or classes in Russia.\n\nProbably there is one, but I don't know about it. I know that the minimum is 4 years. You cannot get a degree faster than that AFAIK. But different majors may take up wildly different of class time. I think universities are tempted to cheat the system and be very liberal about what counts as \"class time\". One could be off having lunch or drinking in the prep room but be in the lab doing research work.",
                  "author": "CleaverIam",
                  "created": 1639354217,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hob9mx5": {
      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hob9mx5/",
      "text": "Gen-eds take up less then a quarter of graduation requirements. In fact a good chunk of them can be built with your major. It really only takes about 2 years to finish up all your GE's and pre-requiste classes for your major.\n\nI don't really have an issue because unlike most students, college isn't a career college for me. It's a place to get further educated and by happenstance it provides opportunity for career readiness. The reason GE's exist is for the university to have a method of measurement for their graduates. If you graduate in your major you will also be expected to be competent and writing, reading, basic math, and some civics and understand of society. It's the bare minimum but you can find this across most colleges in the US.",
      "author": "safespace999",
      "created": 1639352723,
      "upvotes": 2,
      "replies": {
        "hobaxly": {
          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobaxly/",
          "text": "That may be so, but should high school account for all that? If every student has to be able to do it then why isn't it taught on high school level?",
          "author": "CleaverIam",
          "created": 1639353311,
          "upvotes": 1,
          "replies": {
            "hobbc4c": {
              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobbc4c/",
              "text": "Not all K-12 education across the country is comparable. At least at the college level they can control this through their own curriculum.",
              "author": "safespace999",
              "created": 1639353494,
              "upvotes": 1,
              "replies": {
                "hobbnf8": {
                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobbnf8/",
                  "text": "Why don't they use admission exams to account for it? It sound like the colleges are  trying to correct the job that was supposed to have been done by high-schools.",
                  "author": "CleaverIam",
                  "created": 1639353637,
                  "upvotes": 1,
                  "replies": {
                    "hobdd3m": {
                      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobdd3m/",
                      "text": "We do, but they are not entirely accurately. These exams disproportionately affect students from low-income and rural areas as they are the ones with the worst/detiorarating systems of K-12.\n\nK-12 education is also very difficult to change given how mired it is in politics. Higher education institutions have more freedoms to move around their curriculum and goals given they are institutional businesses. Thus course correcting usually occurs at the higher levels first if at all.",
                      "author": "safespace999",
                      "created": 1639354413,
                      "upvotes": 1,
                      "replies": {
                        "hobe0qv": {
                          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobe0qv/",
                          "text": "This raises the question how college admission works in the US. Is it random? Are there admission exams? I would have expected that all those who are for whatever reason at a lower level shouldn't end up in the same program with those who are on a high level. Here were I live the system is comparable to that of China with its Gaokao. We have a state-wide exam which is the only (major) factor which decides if you get a place at a particular uni. You compete with other people for a set number of places in a program.",
                          "author": "CleaverIam",
                          "created": 1639354716,
                          "upvotes": 1,
                          "replies": {
                            "hobf58r": {
                              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobf58r/",
                              "text": "It's not random it's still purposeful, though secretive. Institutions understand the adversity some groups face and account for it. Exams like the SAT and ACT are somewhat entry exams.\n\nGPA is a huge factor, as well as extra curriculars, but more schools also are beginning to look holistically at applicants. Where did they go to school? How does this affect their education? Their ability to do extracurriculars? It's still fairly traditional but things are changing.\n\nIt's actually well documented that students who may be the top of their class at their schools are way behind normal achieving students from more affluent schools. It's not a cut and dry process.",
                              "author": "safespace999",
                              "created": 1639355224,
                              "upvotes": 1,
                              "replies": {
                                "hobga9w": {
                                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobga9w/",
                                  "text": ">It's actually well documented that students who may be the top of their class at their schools are way behind normal achieving students from more affluent schools.\n\nA unified state exam would be a good way to account for these differences... If everyone takes the same exam it would totally negate their relative place within their own high school and compare everyone to everyone.",
                                  "author": "CleaverIam",
                                  "created": 1639355740,
                                  "upvotes": 1,
                                  "replies": {
                                    "hoc4tpw": {
                                      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hoc4tpw/",
                                      "text": "I think you are forgetting the first topic we discussed. Scores are going to vary with lower scores skewing to places where education is not invested in. Thus under a unified test, groups will be at a disadvantage solely based on their zip codes. It also won't be an accurate measurement of knowledge.\n\nThese unified exams only work when all schools are on the same level teaching the same curriculum.",
                                      "author": "safespace999",
                                      "created": 1639366972,
                                      "upvotes": 1,
                                      "replies": {
                                        "hod34s2": {
                                          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hod34s2/",
                                          "text": ">It also won't be an accurate measurement of knowledge.\n\nHow so? Everyone takes the same test meaning that regardless of your background, the only thing that would be taken into the consideration is your knowledge. \n\n>Scores are going to vary with lower scores skewing to places where education is not invested in.\n\nWhy should a person be given an \"free admission\" just because they were \"disadvantaged\". The person with more academic success should always be given the priority. \n\n>These unified exams only work when all schools are on the same level teaching the same curriculum.\n\nA good way of bringing all schools to a common denominator would be such test.",
                                          "author": "CleaverIam",
                                          "created": 1639390208,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hobbqrm": {
      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobbqrm/",
      "text": "There are education routes with limited \"gen-eds\"  like technical colleges or certification programs. If you really think GE is a waste, go a different route, but expect to be paid less than someone who is both technically trained AND they have a wider knowledge base.",
      "author": "zifmer",
      "created": 1639353679,
      "upvotes": 1,
      "replies": {
        "hobd4w5": {
          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobd4w5/",
          "text": "Are you talking about Associate's degrees or full Bachelor's degrees?",
          "author": "CleaverIam",
          "created": 1639354308,
          "upvotes": 1,
          "replies": {
            "hobfrnx": {
              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobfrnx/",
              "text": "Associates and Bachelor's of Applied Science (AAS/BAAS) tend to have fewer Gen-Ed requirements than AA/AS/BA/BS degrees. Certificate programs in anything from programming languages, culinary arts, welding, and accounting may have none.\n\nIf you want to just get good at something, you can just take courses in that thing from a college or a community education or training center. I believe some companies, like Google, are offering training routes for people without college degrees as well. I'm not sure how competitive these things make someone in a traditional job market, but it is another route.",
              "author": "zifmer",
              "created": 1639355501,
              "upvotes": 1,
              "replies": {
                "hobgn9i": {
                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobgn9i/",
                  "text": "\"Bachelor's of Applied Science (AAS/BAAS)\" Is that for engineers? Are all engineers bachelors of applied sciences? Why do you believe them to be worse?",
                  "author": "CleaverIam",
                  "created": 1639355906,
                  "upvotes": 1,
                  "replies": {
                    "hochfgr": {
                      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hochfgr/",
                      "text": "In general, employers in the US highly value the breadth that comes from a range of classes across disciplines taken in college. I’m a chemistry prof., and my students often tell me down the road that the most valuable / useful classes for them in their careers were courses outside of the major. \n\nCourses in other disciplines let you look at things from a different perspective, which can give you a unique edge to approaching and solving problems. In the US, we tend to value the fact that not all of our students follow the exact same path. Not all students choose to take the same courses within chemistry- some take more physical chemistry, or take physics courses, or they take material science or engineering or even business courses.\n\nI would consider a degree that consisted solely of chemistry courses a weaker overall degree in the long run.",
                      "author": "Eigengrad",
                      "created": 1639373617,
                      "upvotes": 2,
                      "replies": {
                        "hod2dcq": {
                          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hod2dcq/",
                          "text": ">I would consider a degree that consisted solely of chemistry courses a weaker overall degree in the long run.\n\nObviously you need maths and physics and what not for chemistry...",
                          "author": "CleaverIam",
                          "created": 1639389549,
                          "upvotes": 1,
                          "replies": {
                            "hod2osa": {
                              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hod2osa/",
                              "text": "And also some time spent taking classes in philosophy, social sciences and arts. And biology and business. And good foundational courses in communication and writing.",
                              "author": "Eigengrad",
                              "created": 1639389824,
                              "upvotes": 2,
                              "replies": {
                                "hod4sgi": {
                                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hod4sgi/",
                                  "text": "Isn't is what high school is for? Had I been paying tens of thousands of dollars per year, I would have been pretty annoyed about being forced to study irrelevant subjects. I am a chemical engineer myself and at no point did I think \"oh, arts is something super useful I wish I had been taught at my university\". The only irrelevant subject that I found mildly useful was economics.",
                                  "author": "CleaverIam",
                                  "created": 1639391622,
                                  "upvotes": 1,
                                  "replies": {
                                    "hoe4frv": {
                                      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hoe4frv/",
                                      "text": "I thought you were in school for chemicals engineering? Have you graduated and are working?\n\nTaking just discipline specific classes prepares you very narrowly for one career. Taking a broad range of classes prepares you to be able to change careers as well as to be able to rise more rapidly through the ranks.",
                                      "author": "Eigengrad",
                                      "created": 1639411363,
                                      "upvotes": 2,
                                      "replies": {
                                        "hoe7kvh": {
                                          "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hoe7kvh/",
                                          "text": "I am a master student of materials science, with a bachelor's in chemical engineering. I am working part time until I graduate.",
                                          "author": "CleaverIam",
                                          "created": 1639412633,
                                          "upvotes": 1,
                                          "replies": {
                                            "hoex3se": {
                                              "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hoex3se/",
                                              "text": "It seems like you're questioning the validity of an entire educational system based off your (very limited) personal experiences.",
                                              "author": "Eigengrad",
                                              "created": 1639422730,
                                              "upvotes": 1,
                                              "replies": {
                                                "hof9rwc": {
                                                  "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hof9rwc/",
                                                  "text": "It is not my personal experience. I have never even set foot in US.",
                                                  "author": "CleaverIam",
                                                  "created": 1639427881,
                                                  "upvotes": 1,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hobhzui": {
                      "link": "/r/college/comments/rezfb4/how_do_geneds_work_in_american_colleges/hobhzui/",
                      "text": "I was mostly referring to the pay/employment difference between technical/certificate programs versus all Bachelor programs.\n\nI'm not sure if a Bachelor's of Applied Science in Engineering would be treated differently in the employment world compared to someone with a Bachelors of Science in Engineering. That slight difference may not matter much.",
                      "author": "zifmer",
                      "created": 1639356522,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}