{
  "sid": "quumgi",
  "link": "/r/college/comments/quumgi/never_left_bed_today_and_i_feel_so_unproductive/",
  "title:": "Never left bed today and I feel so unproductive . Anyone else?",
  "text": "I had a midterm (remote) yesterday and then homework for another class. I set my alarm for 8 today but my body was not having it. I literally went back to bed and slept till 4 and never left my room. I don’t have classes today though. I was just too exhausted. I’ve been thinking of that damn midterm all last week. Luckily monday is the day when I got no class",
  "author": "Christiano1996",
  "created": 1637022100,
  "updated": 1637181400,
  "over_18": false,
  "upvotes": 44,
  "upvote_ratio": 0.98,
  "comments": {
    "hkskwfs": {
      "link": "/r/college/comments/quumgi/never_left_bed_today_and_i_feel_so_unproductive/hkskwfs/",
      "text": "Sleep is productive for your body for recovering from the stressors of daily life- especially in college. Perhaps you didn’t do any work, but taking a day to rest, sleep and regain energy isn’t a bad thing either.",
      "author": "Hydrogen10101",
      "created": 1637024328,
      "upvotes": 25,
      "replies": {}
    },
    "hksli4w": {
      "link": "/r/college/comments/quumgi/never_left_bed_today_and_i_feel_so_unproductive/hksli4w/",
      "text": "I didn't do much for a week after I had surgery and I ate so much junk. =D One day won't destroy you. Sometimes we need a break.",
      "author": "kyeelee",
      "created": 1637024598,
      "upvotes": 6,
      "replies": {}
    },
    "hkst4z2": {
      "link": "/r/college/comments/quumgi/never_left_bed_today_and_i_feel_so_unproductive/hkst4z2/",
      "text": "Same here. Stress slept a lot which I need to stop doing.",
      "author": "InterstellarCapa",
      "created": 1637027984,
      "upvotes": 3,
      "replies": {}
    },
    "hktlgnx": {
      "link": "/r/college/comments/quumgi/never_left_bed_today_and_i_feel_so_unproductive/hktlgnx/",
      "text": "Currently doing that I was supposed to study for my midterm  and attended class but I can't stay awake for anything that contributes to my stress and it's becoming a problem",
      "author": "Depressy69",
      "created": 1637042111,
      "upvotes": 1,
      "replies": {}
    },
    "hkufnjb": {
      "link": "/r/college/comments/quumgi/never_left_bed_today_and_i_feel_so_unproductive/hkufnjb/",
      "text": "I'm curious about why you're so exhausted. Your other habits are causing you to be exhausted, and that's not good. \n\nEveryone would benefit from having a solid sleep schedule. The college life of sleeping really late into the day or not sleeping at all is incredibly detrimental. I think there needs to be skills built around sleeping for young people in college. \n\nI remember a peer telling me that he missed class and slept until 1 pm. I'm 32 and I can't sleep past 7 am on any day. I'm in bed by 10 pm every day. I never get drowsy and sleepy through my courses. I don't have problems falling asleep either. \n\nGranted, being young makes sleep a lot different. I just really think that parents and high schools should have really drilled sleep skills into kids before pumping them off on their own.",
      "author": "Awkward_Mail_2786",
      "created": 1637065255,
      "upvotes": 1,
      "replies": {}
    }
  }
}