{
  "sid": "btlytk",
  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/",
  "title:": "Anybody else sacrificing yet another summer so they can get the year over with faster?",
  "text": "Sacrificing my third summer to summer classes and I’m just kinda bitter about it, kinda sucks still having that always worrying “college brain” during the time most people are relaxing/partying/working  etc.. I had  a week before my first session started. A fucking week, it really kinda sucks because it’s like I legit have to cancel plans so I can study/read/write a paper or oh let’s not forget the robotic basic ass Discussion boards every week that absolutely NOBODY tries on.  What’s up with that shit anyways? It’s always the same: “this article really opened my eyes” or “I was blown away and now have changed my ways after reading this” like always making some\nBig ass display of empty assertions describing the articles impact on some idea it presented to them. Oh then there’s my personal favorite “nice post today!” *insert complimentary, enlightening detail about the other persons post while using words like: “I, too also think this way” or “Susan, I agree and I must say, great minds must think alike!”*.\nThen you got the professor who’s painfully responding to all this shit who’s probably just as thrilled as we are to be here.",
  "author": "TheAstroPickle",
  "created": 1558963502,
  "over_18": false,
  "upvotes": 715,
  "upvote_ratio": 0.98,
  "comments": {
    "erfhu3n": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/erfhu3n/",
      "text": "I found that it was easier to do well in the short summer courses because (1) I never had to decide whether I had to study *this evening* because I had to study *every* evening, and (2) the courses nearly always just had exams as opposed to papers and I'm better on tests.",
      "author": "dead_pirate_robertz",
      "created": 1560808725,
      "upvotes": 2,
      "replies": {
        "erhk5gv": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/erhk5gv/",
          "text": "Yea I love how everything is so fast paced and the exams are so close together, no room to forget lol.",
          "author": "TheAstroPickle",
          "created": 1560876974,
          "upvotes": 2,
          "replies": {
            "erhljs6": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/erhljs6/",
              "text": "Exactly!! :)",
              "author": "dead_pirate_robertz",
              "created": 1560877715,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "eppxnmp": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/eppxnmp/",
      "text": "I always took summer classes for undergrad. It made my last semester amazing, since I only had to take two classes. Because of getting ahead, I only took the bare minimum for full time and was able to graduate a semester early. I promise it's worth it! \n\nMy Master's also required summer classes, as does my next degree. Those kinda suck because they're cohorts and you're not getting ahead; it's the natural progression, not an acceleration. \n\nBest of luck! No one likes taking classes when they could be relaxing, but you're making senior-year you very happy!",
      "author": "aub51zzz",
      "created": 1559394556,
      "upvotes": 1,
      "replies": {}
    },
    "epj6dvf": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/epj6dvf/",
      "text": "I feel for you.. I’ve been doing summer classes for college since I was going into my sophomore year of high school. So for about 7 or 8 summers now trying to get ahead of everything. Just to be told I’m still behind. I was originally scheduled for summer classes this year but the other day I finally said screw it and dropped them. (Making my parents highly upset, however neither of them went to college, so they do not know what it’s like.) Having no time for yourself is so draining, it’s constantly school, work, more school. I’m taking the summer to finally get my mental state back to where it needs to be.",
      "author": "ealwardt",
      "created": 1559248332,
      "upvotes": 1,
      "replies": {}
    },
    "ep4zqr9": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4zqr9/",
      "text": "I was literally filling out a discussion post for my first day of class as I read this post. I'm doing the same thing except also balancing an internship so we'll see how that goes for me.",
      "author": "lebrondon",
      "created": 1559048392,
      "upvotes": 1,
      "replies": {}
    },
    "ep4u8i9": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4u8i9/",
      "text": "Fuck Discussion boards.",
      "author": "headassboi66",
      "created": 1559045923,
      "upvotes": 1,
      "replies": {}
    },
    "ep4s73v": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4s73v/",
      "text": "This is my first summer. I'm taking differential equations and a stupid english course to get it out of the way. It's gonna be hard though since it's accelerated.",
      "author": "Mouaz314",
      "created": 1559044981,
      "upvotes": 1,
      "replies": {}
    },
    "ep4nz3l": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4nz3l/",
      "text": "Is it expensive?",
      "author": null,
      "created": 1559043107,
      "upvotes": 1,
      "replies": {
        "ep4y10y": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4y10y/",
          "text": "Fuuuuck yes.",
          "author": "TheAstroPickle",
          "created": 1559047645,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ep4n7ku": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4n7ku/",
      "text": "In a few years when you join the workforce, month-long summer vacation won't exist. \"A fucking week\" vacation is all you will get a few times a year anyway. \"College brain\" will compare to \"work brain\". It sucks you aren't getting the same college experience that others are getting, but you sound like you are making the right decision by focusing on college to get it completed.",
      "author": "chuckles21z",
      "created": 1559042777,
      "upvotes": 2,
      "replies": {}
    },
    "ep4n02w": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4n02w/",
      "text": "I never took summer breaks in high school, so I don't anticipating taking any in uni - I do, however, thoroughly anticipate even more stress-related health issues!",
      "author": null,
      "created": 1559042685,
      "upvotes": 1,
      "replies": {}
    },
    "ep420jv": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep420jv/",
      "text": "A very accurate portrayal of online discussion boards lol. I'm taking summer classes by default so I can graduate faster, but I always end up doing accelerated. The winter semester seems worse than summer though.",
      "author": "Muinonan",
      "created": 1559032430,
      "upvotes": 1,
      "replies": {}
    },
    "ep3tt9h": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep3tt9h/",
      "text": "I always have to sacrifice summer to work bc my visa allows me to work unlimited hours during vacation times. Need to hustle so i can pay for school and keep a roof over my head cause its harder to do during the semester while balancing a full course load. Everyone else gets to travel or go home and see their families during breaks but not me! Haven’t been home in over 2 years, nor ever even traveled domestically in my entire life. What’s a vacation? \n\nDoesn’t get the year over faster at all. Time always passes at the same rate.",
      "author": "khaleesi_onthatbeat",
      "created": 1559028534,
      "upvotes": 1,
      "replies": {}
    },
    "ep3o1e4": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep3o1e4/",
      "text": "I don’t even get a week, just 4 days off before summer",
      "author": "ALostPaperBag",
      "created": 1559025908,
      "upvotes": 1,
      "replies": {}
    },
    "ep3io0e": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep3io0e/",
      "text": "Wait... Do people take time off?",
      "author": "TheDookOfCoonterbury",
      "created": 1559023558,
      "upvotes": 2,
      "replies": {}
    },
    "ep3hjwh": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep3hjwh/",
      "text": "Yes and it’s kind of the worst... I’m taking two online classes this summer and even though they aren’t particularly hard, they take up SO MUCH of my free time. But taking these classes means I’ll graduate on time vs a year late, so I guess it’s worth it. I guess.",
      "author": "rocksplayedoutdawg",
      "created": 1559023081,
      "upvotes": 2,
      "replies": {}
    },
    "ep3en5n": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep3en5n/",
      "text": "I mean if I'm not in class I'm working, so hardly partying either way. Might as well get out of college so I can only work instead of work and go to school.",
      "author": "DreadPiratesRobert",
      "created": 1559021838,
      "upvotes": 1,
      "replies": {}
    },
    "ep3bmcr": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep3bmcr/",
      "text": "I didn’t-I chose to take the summer off and I’m regretting it. I’ve got nothing to do,and I’m not closer to reaching my goal.",
      "author": "ainteazybeincheezy",
      "created": 1559020633,
      "upvotes": 1,
      "replies": {}
    },
    "ep3au3u": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep3au3u/",
      "text": "Don’t be in such a rush to be an adult. Enjoy being a “kid” as long as you can.",
      "author": "Jennyboombatz",
      "created": 1559020318,
      "upvotes": 1,
      "replies": {
        "ep4xx5a": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4xx5a/",
          "text": "Oh I’m 23 and  a SAHD of 2, those days of being a kid are long gone for me 😂😂😂",
          "author": "TheAstroPickle",
          "created": 1559047595,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ep34yf0": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep34yf0/",
      "text": "I wanted to but my wife needed me to be available to take care of her (recent cancer diagnosis). She comes first. I even dropped a class last semester despite the risk to my financial aid usage (the university is kinda shitty. If you have units even from other universities or other degree tracks above what your degree needs they put you on probation meaning they refuse to process your fafsa. I caught them giving me conflicting information so much that only their admin is allowed to respond to my emails now, because I keep involving title 9, disability services, and other administration whenever I get two different sets of instructions. It is legal but they should be forced to give the correct info for appeals the first time as to avoid preventing disabled students and people who got their GEDs at a community College from completing their degree. It's entirely descriminatory. If it wasn't, they wouldn't back down every time I bring up how awful their policy is for the downtrodden. )",
      "author": "Ryugi",
      "created": 1559017166,
      "upvotes": 1,
      "replies": {}
    },
    "ep34pq6": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep34pq6/",
      "text": "I took online classes every summer in hs to get ahead and I'll be doing something related to education every summer of undergrad. Sucks to have high aspirations lol but I think a lot of people are in the same boat. Just depends on what your goals are.",
      "author": "kyrarivest",
      "created": 1559016978,
      "upvotes": 1,
      "replies": {}
    },
    "ep3072g": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep3072g/",
      "text": "I've been doing summer classes since freshmen year of college. And get this, I'm still not gonna graduate on time. Smh it sucks but what can you do. Gotta keep moving",
      "author": "Woewz",
      "created": 1559015094,
      "upvotes": 1,
      "replies": {}
    },
    "ep2y5tn": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2y5tn/",
      "text": "Honestly you gotta be more creative on discussion posts than you gotta be when you're replying to a facebook or reddit post.",
      "author": null,
      "created": 1559014319,
      "upvotes": 1,
      "replies": {}
    },
    "ep2qzh0": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2qzh0/",
      "text": "I'm actually working on my last 3 classes over the summer. Like I had a choice between that or the fall, and I want it over sooner than later.\n\n&#x200B;\n\nWhat sucks is I have to take 2 of them during this semester (summer 1), and the last one in a month from now in summer 2. Which means summer classes are normally 11 weeks at my uni. But summer 1 and summer 2 is only 5 weeks long. I just hope my last class is a quizlet and forget so I can at least have an easy time towards the end.\n\n(for those of you anti quizlet, it should be noted that I have all my core classes done in my tech degree. But I needed some science classes to meet all the requirements. Basically, it's one of those junk classes that you forget since it doesn't take any relevance in your life beyond the class & requirement.)\n\n&#x200B;\n\nOh and as far as the discussion boards. Many classes use them to pad the grade or to count attendance. Believe it or not I prefer classes with them since you basically have whatever % locked in.",
      "author": "crua9",
      "created": 1559011755,
      "upvotes": 2,
      "replies": {
        "ep2s5a7": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2s5a7/",
          "text": "I had bio 2  and a lab (both online)last summer and it was most def a Quizlet-go type of deal.",
          "author": "TheAstroPickle",
          "created": 1559012167,
          "upvotes": 1,
          "replies": {
            "ep2u36x": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2u36x/",
              "text": "I'm taking a lab and a weather class. The lab is pretty easy since it's 1 credit hour, and it's a bunch of tree hugging crap. But the weather class is a nightmare. Each semester they change the questions so you can't look up anything. And the teacher doesn't teach, but they yell at you if you ask anything. \n\nAt this point I'm just looking for a D or C since my GPA is so high that I will graduate giving I can at least get a D in all my classes, but it isn't high enough to get honors even if I got a 100% in everything.\n\nMy next class is some class about the history of the ocean. I hope that is a quizlet and forget since 77% of the grade is in test.",
              "author": "crua9",
              "created": 1559012852,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ep2o7l2": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2o7l2/",
      "text": "Currently in summer school so that I can graduate a semester early in December. Feeeeeeel this",
      "author": "BabaYaga129",
      "created": 1559010781,
      "upvotes": 1,
      "replies": {}
    },
    "ep2o2dd": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2o2dd/",
      "text": "wow that’s rough. good on you for pushing yourself so hard!!! that’s weird how different colleges summer sessions are different. i’m taking ochem rn started the week after finals and is only 13 days long 3 hours a day m-f. It’s pretty tough but summer sessions always pay off in the end imo",
      "author": "lovemycats3",
      "created": 1559010728,
      "upvotes": 1,
      "replies": {}
    },
    "ep2neyz": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2neyz/",
      "text": "I think you're doing it wrong.  I took bio 1 and bio 2 lab along with biochem in one summer.  I think I also studied for the MCAT which I took at the end of the summer.  I still had pretty much every evening to chill, workout, play video games, go out to the bars, or hang out with my roommates.  I still had time to do what I wanted to on the weekend.  Don't get me wrong, I studied quite a bit during the day and a few nights a week, but I didn't let that get in the way of my summer.\n\nA lot of it comes down to learning how to manage your time efficiently.",
      "author": "touch_my_vallecula",
      "created": 1559010499,
      "upvotes": 2,
      "replies": {}
    },
    "ep2na4p": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2na4p/",
      "text": "I'm sacrificing my first summer in college to Summer semester. I thankfully don't have to do discussion boards (in person classes), but I have classes 4 days a week as well as my Work-study job, 5 hours a day.",
      "author": "PrincessKitsuna",
      "created": 1559010453,
      "upvotes": 1,
      "replies": {}
    },
    "ep2hh70": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2hh70/",
      "text": "Man, I WISH I could afford summer classes. That shit is too expensive.",
      "author": "nerdyginger27",
      "created": 1559008414,
      "upvotes": 2,
      "replies": {}
    },
    "ep2ebxn": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2ebxn/",
      "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/premed] [I cringe at this](https://www.reddit.com/r/premed/comments/btu0hu/i_cringe_at_this/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "author": "TotesMessenger",
      "created": 1559007214,
      "upvotes": 1,
      "replies": {}
    },
    "ep2chso": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2chso/",
      "text": "Taking 14 credit hours this summer so I can graduate next semester. Just wanna get it over with",
      "author": "Demonsreach",
      "created": 1559006303,
      "upvotes": 1,
      "replies": {
        "ep2cm0n": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2cm0n/",
          "text": "Damn good luck lol",
          "author": "TheAstroPickle",
          "created": 1559006365,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ep29kta": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep29kta/",
      "text": "I’m taking two courses this summer for the first time. I decided to take them now because I’m gonna be studying abroad in France for a year. \n\n\nReason I gotta take the two courses (WRLD 302 and UNIV 200) is because the UNIV 200 is a prerequisite to the senior capstone seminar I have to take when I get back so I can graduate Fall 2020. And for some reason, WRLD 302 is a class that can’t be transferred from another university, I absolutely have to take it at my college. Both courses are online and at least WRLD 302 is fun and easy, don’t know why it absolutely needed to be taken at the college tho. I’m prolly signed up for a similar course in France that woulda given me credit in it. And UNIV 200 is a stupid university college course that’s the last part of a sequence. Basically like a glorified high school English class and being retaught how to write a research paper and shit. This is the one that just assigns a lot of busywork for no reason except to have grades to make the class not seem like a waste of time or a money grab.",
      "author": null,
      "created": 1559004643,
      "upvotes": 2,
      "replies": {
        "ep2cj9o": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2cj9o/",
          "text": "What’s your major?\nI had a course like that it was literally just reading, weekly “journal entries” and a DB every week on a “short” story we all had to read, it was Uni specific and only 1 fucking credit hour. Absolutely held no significance, much like the one you explained",
          "author": "TheAstroPickle",
          "created": 1559006325,
          "upvotes": 2,
          "replies": {
            "ep36v9m": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep36v9m/",
              "text": "I’m international Studies. Unfortunately universities tend to make students take one course or a whole 2 or 3 course sequence of some dumb university college course that holds no significance. Yea it’s like yours, just reading and weekly journals and discussion board posts. Pretty much just straight busy work for a money grab course. Luckily it’s 3 credits tho. It’s not uni specific, but they try to claim the course is.",
              "author": null,
              "created": 1559018721,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ep27njm": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep27njm/",
      "text": "Yep. 5 classes now but by July i'll be finished with 2 and have 3 left.",
      "author": "jg2353",
      "created": 1559003544,
      "upvotes": 1,
      "replies": {}
    },
    "ep23pai": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep23pai/",
      "text": "I'm lucky af my parents support me. Gonna go on vacation this summer.",
      "author": "BrandonTheStoner",
      "created": 1559001328,
      "upvotes": 1,
      "replies": {}
    },
    "ep23hl2": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep23hl2/",
      "text": "Jokes on you. I would not have a life during summer anyway.",
      "author": "timmy_42",
      "created": 1559001219,
      "upvotes": 2,
      "replies": {}
    },
    "ep23ao4": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep23ao4/",
      "text": "I had a really tough choice but I had to turn down a second internship at a company I loved working for so that I can graduate on time by taking a summer semester this year. I'm studying mechanical engineering, and I worked as an engineering and project management intern at a company last year. Really enjoyed it and I got a lot of solid experience while earning some money. The boss really wanted me to come back again, but I had to make a tough choice. I want to have my degree in hand in a year from now, and this is what I have to do to get it. In the end, I'm sure it will all work itself out, can't regret anything at this point. Only looking to the future.",
      "author": null,
      "created": 1559001121,
      "upvotes": 1,
      "replies": {}
    },
    "ep22d38": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep22d38/",
      "text": "As someone in summer classes, the discussion board thing really spoke to me. I really agree with your statement about how basic they are and I loved your examples!",
      "author": "somanystruggles",
      "created": 1559000706,
      "upvotes": 1,
      "replies": {}
    },
    "ep2235a": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2235a/",
      "text": "Hang in there, fren. I feel ya as I’m taking 12 hours this summer. We could relax all summer and take longer to graduate, land jobs, and start earning, or we can hustle and reap the benefits sooner.\n\nDoesn’t change the bitterness, I know, but it’s another perspective.",
      "author": null,
      "created": 1559000571,
      "upvotes": 3,
      "replies": {}
    },
    "ep1vya4": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1vya4/",
      "text": "Summer classes fucking suck, but fortunately you'll be done with your degree quicker. I graduated in December and I never have to worry with that bullshit again. I also found that summer classes were a bit more lenient that regular semester classes. I just did the work and usually got an A. I like that they cut out some of the filler for the summer semesters.",
      "author": "STRAIGHTUPGANGS",
      "created": 1558997381,
      "upvotes": 1,
      "replies": {}
    },
    "ep1uxca": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1uxca/",
      "text": "Taking four courses and working two jobs.  I already missed out on two hikes 😭",
      "author": "Deadlyliving",
      "created": 1558996687,
      "upvotes": 1,
      "replies": {}
    },
    "ep1ufnl": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1ufnl/",
      "text": "Yes",
      "author": "ImPlayingTheSims",
      "created": 1558996352,
      "upvotes": 1,
      "replies": {}
    },
    "ep1se57": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1se57/",
      "text": "I take summer classes every year so I feel you. I only have six weeks of summer classes though so I get a good amount of time off, so it isn’t too bad",
      "author": null,
      "created": 1558994979,
      "upvotes": 1,
      "replies": {}
    },
    "ep1qpx3": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1qpx3/",
      "text": "Yes. Financial Analysis over four weeks. Gonna be a lot of work but getting done quicker will make it worth it.",
      "author": "ireestylee",
      "created": 1558993885,
      "upvotes": 1,
      "replies": {}
    },
    "ep1q4ut": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1q4ut/",
      "text": "You’re not sacrificing . You’re transitioning to the next level where you don’t get summers off.",
      "author": "hayfever76",
      "created": 1558993507,
      "upvotes": 0,
      "replies": {
        "ep1qcm3": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1qcm3/",
          "text": " Way past  “transitioning” lol",
          "author": "TheAstroPickle",
          "created": 1558993649,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ep1q42z": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1q42z/",
      "text": "Nah. I went really hard last semester. If I didn't take the summer off it would probably kill me.",
      "author": "cory453",
      "created": 1558993493,
      "upvotes": 2,
      "replies": {}
    },
    "ep1p8gv": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1p8gv/",
      "text": "[deleted]",
      "author": null,
      "created": 1558992909,
      "upvotes": 1,
      "replies": {
        "ep1pbgi": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1pbgi/",
          "text": "Accounting",
          "author": "TheAstroPickle",
          "created": 1558992967,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ep1kbd8": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1kbd8/",
      "text": "Yup. Cramming for a fucking psychology unit because I'm a cyber security major and I procrastinated that shit because I'm not interested in psych. Straight bullshit.",
      "author": null,
      "created": 1558990288,
      "upvotes": 1,
      "replies": {}
    },
    "ep1jgbl": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1jgbl/",
      "text": "Doing 2 summer courses in summer session 1 and one online course in summer session 2. I don’t want to stay an extra semester at community college.",
      "author": null,
      "created": 1558989958,
      "upvotes": 1,
      "replies": {
        "ep1lefn": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1lefn/",
          "text": "I don’t blame you, I’m a junior that transferred in for  the spring that’s why I went the past few summers was so I could get out CC quicker, uni is a much better experience. Hang in there, I was just where you are only I had to do 4 in the summer (2018) then 19 in the fall so I could arrive in the spring here at Uni, definitely worth it though.",
          "author": "TheAstroPickle",
          "created": 1558990702,
          "upvotes": 2,
          "replies": {
            "ep1mk7y": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1mk7y/",
              "text": "How was it being a spring transfer? I almost ended up having to graduate in December but I’m going to do summer courses so I can graduate in May. I thought that if I went to Uni in the spring I wouldn’t be on track with my major and the courses I need.",
              "author": null,
              "created": 1558991218,
              "upvotes": 1,
              "replies": {
                "ep1osu4": {
                  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1osu4/",
                  "text": "Well everything happened pretty last minute and I didn’t really get a say so in any aspect of my schedule but other than that not bad, I’m just taking 2 Uni specific requirements this summer and an accounting course in June, after THAT I’ll be good, I didn’t want to take a history course and a religion course in the fall, I wanna be done with that shit so when senior year rolls around next year I’ll only have 21 hours left, working my ass off now so I can just breeze on through senior year,",
                  "author": "TheAstroPickle",
                  "created": 1558992610,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ep1i64j": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1i64j/",
      "text": "I see what you're saying, but online classes with those kinds of discussions are easy A's. Just do them and you're good",
      "author": "mets7sabotage",
      "created": 1558989499,
      "upvotes": 1,
      "replies": {
        "ep1kj7s": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1kj7s/",
          "text": "Oh they definitely are, there’s really no reason to not do them,  in my course, mostly all of the DBs are worth 20% of the grade, so it’s easy to OD on As",
          "author": "TheAstroPickle",
          "created": 1558990371,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ep1ghox": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1ghox/",
      "text": "I went 2 summers in a row for the same reason. I was ready to take classes this summer too but my advisor said I didn't have to. I'm looking forward to a little break because I start nursing school in the fall.\n\nCheers to you putting in the time for your education. Hopefully you finish your degree soon. Good luck to you!",
      "author": "ColorMeSalty",
      "created": 1558988881,
      "upvotes": 1,
      "replies": {}
    },
    "ep198og": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep198og/",
      "text": "I have always taken 10 credits in summer but I was planning to have this summer off. It was supposed to be fun and relaxing because the program I just started this quarter normally goes full-time + clinicals even in the summer, so this was my last shot at a real summer break before that. Then my Anatomy & Physiology II class got cancelled in the winter right before the term started and I couldn't get into any other sessions. There wasn't one that worked with my required classes for spring, so now I have to take it over the summer. 5 days a week on top of working 6 days a week. Kill me.",
      "author": "herestoshuttingup",
      "created": 1558986254,
      "upvotes": 1,
      "replies": {}
    },
    "ep16a7w": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep16a7w/",
      "text": "I gotta make up classes :(",
      "author": "havingfun89",
      "created": 1558985075,
      "upvotes": 1,
      "replies": {}
    },
    "ep169ai": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep169ai/",
      "text": "Yeah! Internship and summer classes. Fun fun fun. \n\n^^^please ^^^help ^^^im ^^^dying ^^^inside",
      "author": "MrDToTheIzzle",
      "created": 1558985059,
      "upvotes": 1,
      "replies": {}
    },
    "ep154xc": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep154xc/",
      "text": "I don't see it as a sacrifice but an advantage. I already took like 2 years off before I started college anyway. \n\nI'm still slightly bitter, but I'm focusing on the positive.",
      "author": "anxiouscamper",
      "created": 1558984524,
      "upvotes": 2,
      "replies": {
        "ep172zn": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep172zn/",
          "text": "I’m not really bitter anymore but at the time I made this post I sure was.",
          "author": "TheAstroPickle",
          "created": 1558985468,
          "upvotes": 1,
          "replies": {
            "ep1l513": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1l513/",
              "text": "I get it pal",
              "author": "anxiouscamper",
              "created": 1558990605,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ep145wq": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep145wq/",
      "text": "It's saving my ass with grades from first year.",
      "author": "spacebro123",
      "created": 1558984170,
      "upvotes": 2,
      "replies": {}
    },
    "ep143jg": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep143jg/",
      "text": "I FEEL THIS.\n\nfour summer classes and two jobs. you can just kill me.",
      "author": "divine-mistake",
      "created": 1558984148,
      "upvotes": 4,
      "replies": {
        "ep1rrbi": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1rrbi/",
          "text": "And what is your end goal? Do you think it’s worth it or did you have no choice? Do you have time for a social life? Sorry for all the questions I’m just rlly curious",
          "author": "lylli97",
          "created": 1558994562,
          "upvotes": 1,
          "replies": {
            "ep1vk7v": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1vk7v/",
              "text": "i started late so i feel as though i’m already behind. i’m doing a lot of research projects in the fall + spring which only award me 4 credits, so while i have to be super dedicated, it barely counts. so in order to lessen my classload and still graduate on time, here i am.\n\ntwo jobs is because i’m on my own and have to pay everything myself. between the two, i work full time while going to school full time as well obviously.\n\ni have a social life! i have a long distance boyfriend and tons of friends. it’s hard to balance and i hardly sleep. but thankfully the people that love me understand what pressure im under.\n\nis it worth it? yes. this kind of life is a luxury. only a year ago i was near death, in an abusive relationship with no end. i wasn’t allowed to do anything. he tried to murder me. i wanted to kill myself. so this makes me feel worth something. i feel like i can accomplish things now when before i thought life was meaningless.\n\ndoes it suck? lol yeah but i love it.",
              "author": "divine-mistake",
              "created": 1558997118,
              "upvotes": 4,
              "replies": {
                "ep2i2pw": {
                  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2i2pw/",
                  "text": "Damn that got dark quick",
                  "author": null,
                  "created": 1559008614,
                  "upvotes": 2,
                  "replies": {
                    "ep2x2jd": {
                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2x2jd/",
                      "text": "gotta be real w people when it comes to college. its a luxury lmao.",
                      "author": "divine-mistake",
                      "created": 1559013937,
                      "upvotes": 3,
                      "replies": {
                        "ep5t9im": {
                          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep5t9im/",
                          "text": "Lmao yes",
                          "author": "TheAstroPickle",
                          "created": 1559060614,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ep1377e": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1377e/",
      "text": "Taking accelerated Chem one this summer, with lecture every weekday at 10:50, and lab Wed-Thurs at. 8. fucking. 30. Just to graduate on time thanks to limited geology classes and course sequencing. #yaycollege",
      "author": "soybeanolive",
      "created": 1558983806,
      "upvotes": 3,
      "replies": {
        "ep2hi1x": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2hi1x/",
          "text": "I'm doing Gen Chem 2 this summer. 8 weeks, four days a week lab at 7:30, in the morning and lecture after that. Just so I could take O-chem sooner",
          "author": "snekmomal",
          "created": 1559008421,
          "upvotes": 1,
          "replies": {
            "ep2j7kd": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2j7kd/",
              "text": "I feel like they design these courses to be terrible, and then putting the only time slot so early in the morning? Cherry on top of the pile of shit",
              "author": "soybeanolive",
              "created": 1559009002,
              "upvotes": 1,
              "replies": {
                "ep2kwaz": {
                  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2kwaz/",
                  "text": "The lecture is 11:00-12:30 and they have a lab later in the afternoon as well but I didn't wanna be stuck on campus from 11:00-6:00pm every day plus that lab was with a professor I don't know. \nI took the early lab so I could have my favorite professor and get it over and done with!",
                  "author": "snekmomal",
                  "created": 1559009620,
                  "upvotes": 1,
                  "replies": {
                    "ep2lfyu": {
                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2lfyu/",
                      "text": "My college had one lecture option (10:50-1205) and one lab option (8:30-10:30) and only in the first summermester. Zero options were given unless I want to ensure I’ll be a five year senior.",
                      "author": "soybeanolive",
                      "created": 1559009809,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ep106sy": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep106sy/",
      "text": "I’m going back to school after a year break taking one of these online starting next week. No financial aid though :(",
      "author": "zipfour",
      "created": 1558982686,
      "upvotes": 2,
      "replies": {}
    },
    "ep0zobf": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0zobf/",
      "text": "I am doing an online class and my internship over the summer",
      "author": "colossuskidd",
      "created": 1558982489,
      "upvotes": 1,
      "replies": {}
    },
    "ep0yxi4": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0yxi4/",
      "text": "My experience with discussion boards isn’t as unpleasant as you make it. I’ve had one case where that happened and it was terrible but most of the questions are thoughtful and specific which really helped with the cliche nonsense of vague discussion board prompts.",
      "author": null,
      "created": 1558982219,
      "upvotes": 3,
      "replies": {
        "ep13g6l": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep13g6l/",
          "text": "Definitely, I actually find when not given such a specific prompt, that the discussions are much more in depth. \n\nI love the discussions in my accounting and law courses.",
          "author": "TheAstroPickle",
          "created": 1558983898,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ep0rsz2": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0rsz2/",
      "text": "Yup, finishing my stats and accounting classes",
      "author": "SuperSpartan177",
      "created": 1558979485,
      "upvotes": 1,
      "replies": {
        "ep0utm6": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0utm6/",
          "text": "Nice, which accounting classes?",
          "author": "TheAstroPickle",
          "created": 1558980745,
          "upvotes": 1,
          "replies": {
            "ep0v15q": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0v15q/",
              "text": "2, I don't remember the official name but it's just financial accounting",
              "author": "SuperSpartan177",
              "created": 1558980817,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ep0r8yv": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0r8yv/",
      "text": "Yep I have five years free college waivers. I want an accelerated masters. My waivers stop for nothing and no one once I started using them. If I'm not in class taking advantage of free college then I am wasting them.",
      "author": "QuasiKaiju",
      "created": 1558979297,
      "upvotes": 18,
      "replies": {
        "ep0rld8": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0rld8/",
          "text": "Hell yea",
          "author": "TheAstroPickle",
          "created": 1558979412,
          "upvotes": 5,
          "replies": {}
        },
        "ep22vpx": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep22vpx/",
          "text": "[deleted]",
          "author": null,
          "created": 1559000940,
          "upvotes": 2,
          "replies": {
            "erd4jxc": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/erd4jxc/",
              "text": "Foster tuition waivers. I'm as parentless as Batman. Happy Father's day!",
              "author": "QuasiKaiju",
              "created": 1560730691,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ep0r03c": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0r03c/",
      "text": "As someone who took winter and summer all 4 years, It's good to get these feelings off your chest once in a while! but be wiser about your attitude too, nothing makes an intercession/ summer course drag out longer than cursing youself for having to go",
      "author": "milkytoothy",
      "created": 1558979203,
      "upvotes": 2,
      "replies": {}
    },
    "ep0qypu": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0qypu/",
      "text": "I took 0 summers off for my entire CS degree. Started in the summer too; 2017 summer to 2019 spring. Did 4-5 summer classes each time; graduated a year earlier.",
      "author": "Evariste-Lovelace",
      "created": 1558979188,
      "upvotes": 7,
      "replies": {
        "ep0rhlq": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0rhlq/",
          "text": "Nice, I took 4 last summer and only 3 this summer, I actually enjoy them a lot but it does, at times get a little stressful.",
          "author": "TheAstroPickle",
          "created": 1558979377,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ep0qazl": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0qazl/",
      "text": "I'm going to be real...you sound super spoiled lol. Sorry just had to say it when I read the words \"sacrificing\"... lol WHAT?!?! Keep in mind most people in the world are not given the opportunity to even go to school, let alone college. \n\nI wish I could take summer classes, but I can't. My family doesn't have the money and the money I do have goes to other things like rent, food, and car insurance. Without FAFSA I would not be able to go to school at ALLL and getting a summer loan is challenging.\n\nSome advice:\n\nRATHER, be grateful that you get the chance not only to go to school but get to finish early! Be grateful! How you said you're kinda bitter, I'm kinda bitter at your post. Maybe giving you a different perspective. Maybe your bitterness will fade into gratitude.",
      "author": "sunflowerchild96",
      "created": 1558978922,
      "upvotes": -3,
      "replies": {
        "ep31llm": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep31llm/",
          "text": "Lol a heads up, when you are going to be judgemental, don't tell other people they are the ones at fault.  Everyone has their own shit and you really don't get the right to be an asshat to the poster because you think they are unreasonably bitter. It actually sounds like you have the perspective issue.",
          "author": "NervousPraline",
          "created": 1559015631,
          "upvotes": 2,
          "replies": {}
        },
        "ep0r3ov": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0r3ov/",
          "text": "Lol thanks kid, \n\nP.S. you don’t know how hard I work or the other reasons I have to be bitter.",
          "author": "TheAstroPickle",
          "created": 1558979241,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "ep0n088": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0n088/",
      "text": "Taking two online classes for my major while working morning shifts on Thursdays, Fridays and Saturdays. I'll be busy but if I do everything that's expected of me, then it'll be a breeze. I genuinely like being in school and learning so I'm kinda excited to get back into the swing of things rather than waiting until late August. I can understand how it would be annoying for some, though.",
      "author": "redflavormp3",
      "created": 1558977622,
      "upvotes": 5,
      "replies": {}
    },
    "ep0m2i8": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0m2i8/",
      "text": "If it makes you feel better, this is my last summer off before I graduate and I'm spending it doing a full time journalism fellowship. I LOVE it but it would be a lie to say I'm a little bummed I can't spend the summer doing fun stuff. Hang in there!",
      "author": null,
      "created": 1558977247,
      "upvotes": 9,
      "replies": {}
    },
    "ep0lg1b": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0lg1b/",
      "text": "First summer I haven’t taken classes, but I deeply regret not making last summer full of experiences and fun, because I am interning full time this summer. Next summer I’ll be graduated and moving onto adulthood :(",
      "author": "silentkiller000",
      "created": 1558977000,
      "upvotes": 17,
      "replies": {}
    },
    "ep0jwlv": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0jwlv/",
      "text": "Internships > Taking classes \n\nchange my mind.",
      "author": null,
      "created": 1558976415,
      "upvotes": 48,
      "replies": {
        "ep0suja": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0suja/",
          "text": "Depends on your career goals",
          "author": null,
          "created": 1558979998,
          "upvotes": 19,
          "replies": {
            "ep0tuam": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0tuam/",
              "text": "99% of the time internship is way better. Specially if you get paid",
              "author": "dazecs16",
              "created": 1558980384,
              "upvotes": 40,
              "replies": {
                "ep0v7uz": {
                  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0v7uz/",
                  "text": "Depends if you want to go into a grad school. Internships don’t matter as much for those.",
                  "author": "I-AM-NOT-THAT-DUCK",
                  "created": 1558980876,
                  "upvotes": 3,
                  "replies": {
                    "ep0z8xp": {
                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0z8xp/",
                      "text": "Research does though, and that can be a lot more important than taking classes.",
                      "author": "Comrox",
                      "created": 1558982329,
                      "upvotes": 13,
                      "replies": {
                        "ep0ziu3": {
                          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0ziu3/",
                          "text": "I agree. I never said research wasn’t important.",
                          "author": "I-AM-NOT-THAT-DUCK",
                          "created": 1558982433,
                          "upvotes": 3,
                          "replies": {
                            "ep0zorl": {
                              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0zorl/",
                              "text": "I know, but the more you take classes during breaks the less time you have for research or internships or volunteering or just a regular job.",
                              "author": "Comrox",
                              "created": 1558982493,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "ep0xsom": {
                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0xsom/",
                      "text": "I mean, if you're going to a lower ranked state school grad program, sure.\n\nBut anything in the top 20? Lmao, you *need* internships and decent job experience.\n\nThere's a very real argument that lower ranked grad programs aren't worth the investment, while the top programs pay for themselves many times over. Summer classes won't get you there.\n\n- someone who goes to a lower ranked state school",
                      "author": null,
                      "created": 1558981807,
                      "upvotes": -7,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ep1lys1": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1lys1/",
          "text": "Ugh. This hurts for me. I'm stuck doing classes this summer because of poor advising when i transferred schools. If i don't take summer classes, I have to spend a whole year extra to graduate. I'm hoping I'll be able to get an internship next summer. :/",
          "author": "CoriCelesti",
          "created": 1558990912,
          "upvotes": 4,
          "replies": {}
        },
        "ep14k6x": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep14k6x/",
          "text": "Just do both lol",
          "author": null,
          "created": 1558984319,
          "upvotes": 3,
          "replies": {}
        },
        "ep1upld": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1upld/",
          "text": "Internships are not guaranteed. Registering for summer classes are.",
          "author": "singstrim",
          "created": 1558996543,
          "upvotes": 1,
          "replies": {
            "ep1vtmd": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1vtmd/",
              "text": "Neither is getting a job out of college.\n\nAlso you can always just register for the classes ahead of time and drop if you get an offer. I did that exact thing when I landed a co-op that took place during the fall semester.",
              "author": null,
              "created": 1558997295,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "ep6lr8s": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep6lr8s/",
          "text": "Summer courses the summer before you come in and the summer after your first year => intern sophomore and junior summer. Best route for business majors.",
          "author": "austizim",
          "created": 1559070638,
          "upvotes": 1,
          "replies": {}
        },
        "ep7oz9n": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep7oz9n/",
          "text": "Doing mine right now, just entered the 3rd week. Internships are way more common in accounting (and they pay extremely well, too), but I would def recommend it.",
          "author": "yakuzie",
          "created": 1559084572,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ep0j2x7": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0j2x7/",
      "text": "Yep. Calc and chem, while working all the days i dont have class. First year doing summer classes, friends are already making plans to do stuff.. But getting ahead is worth it to me!",
      "author": null,
      "created": 1558976119,
      "upvotes": 1,
      "replies": {}
    },
    "ep0ik1r": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0ik1r/",
      "text": "Discussion threads are a waste of time and just add \"fluff\" to the grade, it's honestly just bs. Summer classes can be a lot harder than most people realize, longer classes with more material in a short amount of time. It's ridiculous",
      "author": "Finsonicswag99",
      "created": 1558975913,
      "upvotes": 16,
      "replies": {}
    },
    "ep0hlzx": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0hlzx/",
      "text": "Yup. 3 online classes, 2 online academies that can lead to internships, and work. I felt really burnt out the end of the semester(which was last week), and my classes start tomorrow.",
      "author": "D-trece",
      "created": 1558975561,
      "upvotes": 3,
      "replies": {}
    },
    "ep0hgfq": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0hgfq/",
      "text": "I fucking hate the dumb ass discussion boards. A big ass waste of time that nothing is gained from.",
      "author": "Clockwork_Fate",
      "created": 1558975498,
      "upvotes": 73,
      "replies": {
        "ep1v6bq": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1v6bq/",
          "text": "I actually had one class where discussion boards were really useful, because we had legit things to respond to. It was a creative writing class, and we would post our writings and our group members had to give us constructive feedback. \n\nI'm taking a class with the dumb discussion boards now. It's just \"Hi Jim! I, too, think Elvis wrote country-blues style and performed with a guitar. Yup, I agree, this song that's clearly about sex is *secretly* about female empowerment. Yay!\"",
          "author": null,
          "created": 1558996850,
          "upvotes": 23,
          "replies": {
            "ep2f3ur": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2f3ur/",
              "text": "Yeah that fair, there are definitely some classes where discussion boards are legitimately useful, mainly in English classes were specific passages are discussed and subjective input is important. \n\nBut I just finished a math class were specific problems were discussed, but man after a certain point there's not much to add to the Pythagorean Theorem.",
              "author": "Clockwork_Fate",
              "created": 1559007540,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ep0ecvc": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0ecvc/",
      "text": "I wish I was taking summer classes...its only been a month since its started for me and Im already ready for it to be over and go back to college. Fuck summer. I dont want to party. I dont want to work. I want to learn. Alas my GI bill will only pay for spring and fall semester full time so I have to find something to do over the summer...Honestly all I can think about is college and how much fun I had doing research for assignments and I wish I had some things I could do in preparation for college next semester. Ive already thought about buying the textbooks for next semester as soon as I have the money for it and just reading them over the summer to sort of head start myself.",
      "author": null,
      "created": 1558974319,
      "upvotes": 20,
      "replies": {
        "ep225uq": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep225uq/",
          "text": "[deleted]",
          "author": null,
          "created": 1559000607,
          "upvotes": 1,
          "replies": {
            "ep2a1nv": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2a1nv/",
              "text": "That's not what I was told from the vet advisor. Can I pm you and ask more ?",
              "author": null,
              "created": 1559004906,
              "upvotes": 1,
              "replies": {
                "ep36nnr": {
                  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep36nnr/",
                  "text": "Bro. You got shafted. You absolutely can take full course loads in the summer with the GI bill. I start my summer semester tomorrow. Your vet advisor is a fucking idiot.",
                  "author": "fuckingoutbro",
                  "created": 1559018540,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ep0e1gs": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0e1gs/",
      "text": "I'm actually depressed that the Spring semester is over...",
      "author": null,
      "created": 1558974211,
      "upvotes": 5,
      "replies": {}
    },
    "ep0cvi3": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0cvi3/",
      "text": "I’m doing two math classes, 2 days a week. Once I’m done, I only have to take a communications class then everything else is major specific. I had a month off now and will have 3 weeks off before I start fall semester.",
      "author": "toomanygirls99",
      "created": 1558973795,
      "upvotes": 3,
      "replies": {}
    },
    "ep01yol": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep01yol/",
      "text": "Your impression of ppl on those bs discussion boards is so hilarious and true 😂😂😂 I’m also stuck taking summer classes, 2 each session but I’m basically getting a whole semester over with so it’ll be worth it in the end",
      "author": "mbm24CS",
      "created": 1558969579,
      "upvotes": 80,
      "replies": {
        "ep12a8v": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep12a8v/",
          "text": "I see what you did there ;) and I was impressed. The way your thought process works really opened my eyes to a lot of things",
          "author": "peachyyb",
          "created": 1558983471,
          "upvotes": 29,
          "replies": {}
        }
      }
    },
    "eozzrf4": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/eozzrf4/",
      "text": "Yeah taking 3 bullshit classes that I need. Only 7 credits so shouldnt be bad and two are online",
      "author": "JobyC4",
      "created": 1558968740,
      "upvotes": 3,
      "replies": {}
    },
    "eozyqup": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/eozyqup/",
      "text": "I never took a summer off during any of my four years of undergrad and Only one during my masters.",
      "author": "dade305305",
      "created": 1558968354,
      "upvotes": 22,
      "replies": {
        "ep0mfaa": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0mfaa/",
          "text": "Do you regret it?",
          "author": "howlsy",
          "created": 1558977396,
          "upvotes": 10,
          "replies": {
            "ep0nkhl": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0nkhl/",
              "text": "Nope. School is about business. You're there to get in get your degree and get out. I aint have time for all that taking summers off bs. That's just wasted time.",
              "author": "dade305305",
              "created": 1558977838,
              "upvotes": 28,
              "replies": {
                "ep0t5pu": {
                  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0t5pu/",
                  "text": "I don’t know man, for some people it’s important to have that time off to recuperate. Not everyone can do school 365 days a year; they get burnt out.",
                  "author": "sldq",
                  "created": 1558980125,
                  "upvotes": 44,
                  "replies": {
                    "ep0utc7": {
                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0utc7/",
                      "text": "i’m entering my senior year of engineering after doing every summer. i’m burnt out",
                      "author": "1972fordpinto",
                      "created": 1558980742,
                      "upvotes": 26,
                      "replies": {
                        "ep2nye0": {
                          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2nye0/",
                          "text": "No internships? That might have been a mistake...",
                          "author": "misteryub",
                          "created": 1559010688,
                          "upvotes": 3,
                          "replies": {
                            "ep4ywwr": {
                              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4ywwr/",
                              "text": "probably but i’m doing 5 years so i have time\nto get a summer one in and a co-op hopefully",
                              "author": "1972fordpinto",
                              "created": 1559048029,
                              "upvotes": 1,
                              "replies": {
                                "epiq5g7": {
                                  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/epiq5g7/",
                                  "text": "Shiiit. My school is a 5 year engineering degree with 5 mandatory co-ops. No summers off. Are your classes spread out?",
                                  "author": "extremegibberish",
                                  "created": 1559242021,
                                  "upvotes": 1,
                                  "replies": {
                                    "epiuj0z": {
                                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/epiuj0z/",
                                      "text": "sort of but i’m also a fuck up",
                                      "author": "1972fordpinto",
                                      "created": 1559243384,
                                      "upvotes": 1,
                                      "replies": {
                                        "epj0zj8": {
                                          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/epj0zj8/",
                                          "text": "Oh lol I feel that.",
                                          "author": "extremegibberish",
                                          "created": 1559245529,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "ep0ysvw": {
                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0ysvw/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1558982176,
                      "upvotes": -22,
                      "replies": {
                        "ep2hiu8": {
                          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2hiu8/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1559008429,
                          "upvotes": 5,
                          "replies": {
                            "ep2q8ed": {
                              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2q8ed/",
                              "text": "Agree to disagree then.",
                              "author": "dade305305",
                              "created": 1559011483,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        },
                        "ep1r3ok": {
                          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1r3ok/",
                          "text": "May I ask what your major is/goal after graduation...?",
                          "author": "lylli97",
                          "created": 1558994136,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "ep16gtr": {
                          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep16gtr/",
                          "text": "And also like...jobs don't have a summer, unless you're a teacher.",
                          "author": "dontbothertoknock",
                          "created": 1558985191,
                          "upvotes": 3,
                          "replies": {
                            "ep1ht3g": {
                              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1ht3g/",
                              "text": "The big difference between work and school is when I get back from school I'm not free. Also getting paid to do bitch work vs paying to do bitch work. The motivators for a job are much higher than \"well if I do this and finish I might get a job\" like with school.",
                              "author": "ADragonsFear",
                              "created": 1558989364,
                              "upvotes": 10,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eozxru3": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/eozxru3/",
      "text": "I'm taking 2 summer courses this semester (Management and Mythology) while having a full-time internship. This is actually my first summer session, so do you have any tips?",
      "author": "BlueDragon222222",
      "created": 1558967984,
      "upvotes": 21,
      "replies": {
        "ep0hvt2": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0hvt2/",
          "text": "Summer classes (in my experience) meet everyday. Do not miss a single class and you should do fine",
          "author": "BlueberryOnions",
          "created": 1558975670,
          "upvotes": 17,
          "replies": {}
        },
        "ep0prcs": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0prcs/",
          "text": "Do what u/BlueberryOnions said, my prof. never puts up anything online and only speaks with no visual aid so if you miss a class then good luck getting the notes",
          "author": "2shizhtzu4u",
          "created": 1558978703,
          "upvotes": 5,
          "replies": {}
        },
        "ep4sfqs": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep4sfqs/",
          "text": "Mythology sounds really cook, I wish they had that at my uni",
          "author": "Mouaz314",
          "created": 1559045102,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "eozwhvp": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/eozwhvp/",
      "text": "I’m taking an accelerated bio course that’s 4.5 hours a day/3 days a week for six weeks. It’s going to be a pain but at least I will at least get ~2 months of summer afterwards.",
      "author": "UnKnOwN769",
      "created": 1558967524,
      "upvotes": 112,
      "replies": {
        "ep0rx5d": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0rx5d/",
          "text": "Jesus Christ good luck! I got an accounting course that starts in June that’s Mon-Fri, 9-12. I heard it’s intense but I’m looking forward to the challenge",
          "author": "TheAstroPickle",
          "created": 1558979527,
          "upvotes": 31,
          "replies": {
            "ep37i5c": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep37i5c/",
              "text": "Currently taking anatomy 9-12 M-Thurs it’s a 6 week course. Taking chemistry 102 online the second 6 weeks.",
              "author": "onmywaytobegr8",
              "created": 1559018999,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "ep2b9ng": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2b9ng/",
          "text": "Hey I’m new to college and I’m taking bio in the summer as well. It will be three days a week for 6 hours. As someone who doesn’t have a job, this doesn’t really sound to bad. 18 hours a week. Is there something I’m missing, because everyone keeps saying it’s going to be a hard summer class.",
          "author": null,
          "created": 1559005605,
          "upvotes": 8,
          "replies": {
            "ep2svyv": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2svyv/",
              "text": "Unless you're counting both in and out of class, you need to remember the time it takes out of class to do your homework. The fact is I'm in 1 class that is literally taking me a good 8 hours to do 1 assignment. And I have several assignments per week. And then I'm in another class which adds to the overall load no matter how easy it is. \n\n&#x200B;\n\nYou also have to keep in mind the skill level difference and burnout rate. So I'm on my last 3 classes, and I'm beyond ready for it to be over. Believe it or not the burnout adds extra time since screwups can and do happen.",
              "author": "crua9",
              "created": 1559012428,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "ep16n5g": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep16n5g/",
          "text": "me too, but x2 for 12 weeks. I'll get like 2/3 of a month. rip us",
          "author": "fulano_huppeldepup",
          "created": 1558985298,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "eozvxjm": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/eozvxjm/",
      "text": "Took classes during both winter and summer sessions each year.",
      "author": "wolf2600",
      "created": 1558967322,
      "upvotes": 39,
      "replies": {
        "ep0phnp": {
          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0phnp/",
          "text": "How was that?",
          "author": "2shizhtzu4u",
          "created": 1558978588,
          "upvotes": 7,
          "replies": {
            "ep0puh7": {
              "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep0puh7/",
              "text": "I would have 2 weeks break in the winter instead of 6 weeks.\n\nIn the summer, if I wasn't going to school I'd be working anyway, so it's not like I missed out on 3 months of vacation.",
              "author": "wolf2600",
              "created": 1558978736,
              "upvotes": 18,
              "replies": {
                "ep1njjk": {
                  "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1njjk/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1558991827,
                  "upvotes": 16,
                  "replies": {
                    "ep1rxve": {
                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1rxve/",
                      "text": "It’s college. Who doesn’t have that? After finals, you’d have like 4 or 5 weeks off before you start again.",
                      "author": null,
                      "created": 1558994682,
                      "upvotes": 8,
                      "replies": {}
                    },
                    "ep1rz77": {
                      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep1rz77/",
                      "text": "Semester system.  Fall semester ended around Dec 15, spring semester started around Jan 25.",
                      "author": "wolf2600",
                      "created": 1558994705,
                      "upvotes": 4,
                      "replies": {
                        "ep2nq1i": {
                          "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/ep2nq1i/",
                          "text": "I always started back up around Jan 8th.",
                          "author": "misteryub",
                          "created": 1559010602,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "eoztk5o": {
      "link": "/r/college/comments/btlytk/anybody_else_sacrificing_yet_another_summer_so/eoztk5o/",
      "text": "Yup. I’m doing a lab internship starting in July so I can get my Anthropology degree.",
      "author": "sdh96",
      "created": 1558966455,
      "upvotes": 158,
      "replies": {}
    }
  },
  "updated": 1634051294
}