{
  "sid": "rigkr5",
  "link": "/r/college/comments/rigkr5/mcnair_scholarship/",
  "title:": "McNair Scholarship",
  "text": "Anyone have any idea how competitive a McNair Scholarship is? I’m a first gen minority in a STEM program at my school, GPA is a 3.5, and I just got involved with a research lab. My main concern is the letters of rec, I transferred from a community college this semester and have not had a chance to make an impression on any of my professors, and I just joined my research lab this month. While I got good grades this semester I’m not sure any of my professors could write a particularly compelling rec letter seeing as the subject is interest in competing a PhD, and I’m unsure if it’s appropriate to ask my PI for a letter so early on. Any input appreciated!",
  "author": "Difficult-Turn-5050",
  "created": 1639744752,
  "updated": 1639848552,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hox36y2": {
      "link": "/r/college/comments/rigkr5/mcnair_scholarship/hox36y2/",
      "text": "Hi there. For these kinds of questions you are always allowed to ask the group offering the opportunity, in this case it is the Ronald E. McNair Scholarship Program at your university. I am sure if you reached out, told them a \\*concise\\* reason for why you may be unsure of how to apply, explaining this is new to you, since you are a first generation student, they would be happy to help.\n\nI know for a fact that us McNair Scholars are full of people with your background (what little you revealed here). Likewise, the Research Assistant graduate students and coordinators are looking for people like you. Moreover, your being a transfer student, and specifically a transfer student from a community college, is fine. It indicates another underrepresented group in graduate school which you intersect with. If you have a letter writer from the community school that is fine; they are qualified, academically sophisticated PhD holders and can speak to your abilities. When I applied I was also from a 2-year university, but I had developed strong relationships there and done research, so asking them for letters at the new university I was at was natural. In the future, each time you go to a new university, it will be expected that you have letters from the university you just came from. Do not sweat it--it is perfectly normal.\n\nAlso, you could talk to your immediate Principle Investigator (PI) of your new lab and tell them you are interested in the McNair Scholars. Ask specifically if they would feel comfortable writing a \"strong letter\" for you at this point in your relationship. The case is that most PIs want to help younger people do well, and it reflects on them when they have stellar academics in their labs. You will have to decide this on your own and confidently relate a \\*concise\\* explanation of what you are trying to do. I think having your current PI plus letters from your previous university would be a great combination, but also just letters from the latter ought to work just as well.\n\nThe only reservation I would make for reaching out to any group with questions, is to make sure you are quite familiar with whatever they have \\*put in work to make available online\\* lol. In other words, some stressed out intern or some overworked administrator tried to make a pretty website or divulge the information about the scholarship opportunity. Make sure you have read these things--and then among the questions, make sure you put in a sentence like, \"On the website it said, 'x,y,z,' but I am unclear how to interpret 'x,' and 'z' would include letters from my previous 2-year university. Could you please explain x and is my idea for z acceptable?\" This is important to follow not just for McNair, but for EVERYTHING. If you do not believe me, just trust me, and trust me when I say you will realize eventually.\n\nAnd yes, McNair is competitive. It is beginning to become more well known, but your GPA far exceeds what is necessary. There is a selection process where I know they have to pick from many contenders. Make sure you are answering all the prompts for the essay(s). Write clearly, and write about the difficulties in your life, but write 80-85% on how you changed, and mostly how you have been working to become better despite difficulties. If you have a writing center at your school, now is the time to use it. If you have anyone that is willing to help edit and critique your writing, now is the time to ask for there help.\n\nGood luck, and maybe we will meet at a McNair conference one day. Feel free to ask questions here or in direct messages.",
      "author": "non_trad_student",
      "created": 1639749961,
      "upvotes": 2,
      "replies": {
        "hp1ios2": {
          "link": "/r/college/comments/rigkr5/mcnair_scholarship/hp1ios2/",
          "text": "Thanks so much for such a thorough response I really appreciate it!",
          "author": "Difficult-Turn-5050",
          "created": 1639830974,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}