{
  "sid": "qt7mlu",
  "link": "/r/college/comments/qt7mlu/colleges_with_good_dorms_avaliable_for_freshman/",
  "title:": "Colleges with good dorms avaliable for freshman with anxiety?",
  "text": "Hello, I am a senior in high school and have applied to only two colleges, Utoledo and Edinboro of Pennsylvania. My main concern with college is the dorm rooms. I have struggled with anxiety my whole life, and school and family can be a huge stressor, hence why I want to go away to college. I loved Edinboros 4 person single suites. I like the idea of having a room to myself where I can go in the case of a panic attack, but also want some roommates so I'm not alone if my anxiety got too bad. I'm also looking for a quieter college. I'm located in Ohio and I'm, of course,, fine with going out of state.\nWhen presenting this to my guidance counselors they haven't been much help so I hope to find that here.",
  "author": "Queenscrxwn_",
  "created": 1636829716,
  "updated": 1637181982,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.57,
  "comments": {
    "hkhkiuq": {
      "link": "/r/college/comments/qt7mlu/colleges_with_good_dorms_avaliable_for_freshman/hkhkiuq/",
      "text": "I’m not entirely sure about other schools but at my school, it’s relatively easy to go through the student accessibility program and get a single room as an an accommodation for your anxiety",
      "author": "juliettesierra",
      "created": 1636829949,
      "upvotes": 4,
      "replies": {
        "hkhks5i": {
          "link": "/r/college/comments/qt7mlu/colleges_with_good_dorms_avaliable_for_freshman/hkhks5i/",
          "text": "Yea, I assumed most colleges would be, especially since I've been diagnosed for so long. I think the thing with Edinboro is the fact that you have a single room all to yourself but you still have dorm mates and you share a common area, so I'm more so looking for dorms like that.",
          "author": "Queenscrxwn_",
          "created": 1636830061,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkhma3v": {
      "link": "/r/college/comments/qt7mlu/colleges_with_good_dorms_avaliable_for_freshman/hkhma3v/",
      "text": "I work in housing and residence life. You will want to look for a small to medium sized college with apartment style housing. Apartment style houses will have separate rooms for each tenant but shared bathrooms, living room, and kitchen.",
      "author": "Turbulent-Rip-5370",
      "created": 1636830704,
      "upvotes": 2,
      "replies": {}
    }
  }
}