{
  "sid": "rcvm7w",
  "link": "/r/college/comments/rcvm7w/calculator_taken_in_the_middle_of_the_exam/",
  "title:": "Calculator taken in the middle of the exam?",
  "text": "Good evening, \n\nI took my calculus final yesterday. In the middle of the test, a proctor at our testing center took my calculator, saying (paraphrase) it was not allowed even though it gave no advantage. It was a $10 calculator from Walgreens. \n\nAs you can imagine, I bombed the rest of the test. They offered to let me use the calculator on the computer, which had none of the functions I needed. \n\nFor some context, you get your calculator checked and approved before you go into the test and when you walk into the center. I had been using this calculator for tests all semester with no issue. It always got approved by proctors. \n\nEmailed the professor after the test, professor told me I should have read the syllabus, and he's right. But if a proctor had pointed it out to me at any point this semester, I would have changed it immediately. If they had said something when I checked in, I could have gone home and received a calculator in compliance and just re-scheduled the test. \n\nIs there anything I can do?",
  "author": "WopperJunior",
  "created": 1639096498,
  "updated": 1639516788,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hnxnddb": {
      "link": "/r/college/comments/rcvm7w/calculator_taken_in_the_middle_of_the_exam/hnxnddb/",
      "text": "What functions does a \"$10 Walgreens calculator\" even have that a basic 4 function does not? \n\nAlso, getting away with violating a policy in the past never gives you the right to continue violating that policy. Just something to keep in mind.",
      "author": "patrdesch",
      "created": 1639102843,
      "upvotes": 6,
      "replies": {}
    },
    "hnx9z62": {
      "link": "/r/college/comments/rcvm7w/calculator_taken_in_the_middle_of_the_exam/hnx9z62/",
      "text": "What did you need a calculator for in a calc exam? What functions were you lacking?",
      "author": "Uncommonly_comfy",
      "created": 1639096812,
      "upvotes": 2,
      "replies": {
        "hnxo3xt": {
          "link": "/r/college/comments/rcvm7w/calculator_taken_in_the_middle_of_the_exam/hnxo3xt/",
          "text": "primarily the e button. Had 5-6 questions about compound interest",
          "author": "WopperJunior",
          "created": 1639103156,
          "upvotes": 2,
          "replies": {
            "hnxrhlm": {
              "link": "/r/college/comments/rcvm7w/calculator_taken_in_the_middle_of_the_exam/hnxrhlm/",
              "text": "You should be able to answer the questions with e included (e.g., 5e^(2)). You only need an actual number in a business course like economics.",
              "author": "lkmk",
              "created": 1639104620,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hnxrer1": {
      "link": "/r/college/comments/rcvm7w/calculator_taken_in_the_middle_of_the_exam/hnxrer1/",
      "text": ">But if a proctor had pointed it out to me at any point this semester, I would have changed it immediately.\n\nHow often have you seen you're proctor?",
      "author": "lkmk",
      "created": 1639104586,
      "upvotes": 2,
      "replies": {}
    }
  }
}