{
  "sid": "q5wkzh",
  "link": "/r/college/comments/q5wkzh/this_is_the_end/",
  "title:": "This is the end",
  "text": "Okay. At least I've tried. Working my ass off everyday... thanks, but not for me. I'm aware how much I'm potentially throwing away, higher salary etc. But I just don't care. I'm mentally broken. Distance learning killed me, killed my motivation.\n\nI'm just overwhelmed, extremely overwhelmed. I'm sorry but living only with a high school diploma is the best way for me. It's gonna lessen the financial burden of my parents so... I know this is the best way.\n\nI don't want to be stressed ever again. Yeah, school is making me exponentially more stressed than anything else, it has always been like this. Never thinking about anything else, only about grades and being extremely scared of failure... I wasn't a bad student, I was one of the best in my class but now I see how little it matters. That pressure, it was killing me. I would rather work for the rest of my life.\n\nI'm sorry. Farewell to my Mechanical Engineering Major. Thank you for reading this.",
  "author": "International-Gur877",
  "created": 1633961096,
  "updated": 1634082978,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hg8fgww": {
      "link": "/r/college/comments/q5wkzh/this_is_the_end/hg8fgww/",
      "text": ">\"I don't want to be stressed ever again.\"\n\n&#x200B;\n\nDude, I hate to be the bearer of bad news, but welcome to life.\n\n&#x200B;\n\nYeah, life isn't about permanently feeling you want to off yourself and getting by anyway through substances and video games. But the reality is that you're gonna be uncomfortable sometimes. You're gonna be wishing you were drinking and playing Smash with your boys. Yeah, you shouldn't be stressed out, losing your hair 24/7. But having a week on-end burdened with work, unable to have a free moment isn't the most foreign concept and it's not the worst thing always in the long-run.\n\n&#x200B;\n\nI'm sorry you had such a bad experience, man, and I'm not sure how early or late I am in advising this, but *really* consider what you're doing. Because it's easy to forego the benefits of being stressed for a little *now* (4 years isn't a lot in the grand scheme of 70+), but I don't know if you'll be saying the same thing when you remain unskilled, unexperienced, and are *potentially* playing Cashier Simulator 2045 because you never wanted to be stressed again at 20 years old.\n\n&#x200B;\n\nYou *don't* need college to succeed, I'm not saying that at all. But if you were studying MechEng, I'd venture that it's safe to say you have some remote interest in STEM and that life track *does* require some formal education in tech. It's also always possible to drop it for a while and go back when you figure things out a bit more. But that's always harder than sticking with it *while* simultaneously figuring things out.",
      "author": "DoorHingeDeliveries",
      "created": 1633963639,
      "upvotes": 6,
      "replies": {
        "hg8mvqi": {
          "link": "/r/college/comments/q5wkzh/this_is_the_end/hg8mvqi/",
          "text": "We shall see what the future holds for us. School is the place where most of my traumatic memories took place. I'm aware  of all the possible consequences. I know how much I'm throwing away. I've worked for a while in my life. It's nothing enjoyable, but it's still a piece of cake compared to the amount of trauma I have from school.\n\nMy mental health is at serious risk. I can't take it any longer. I'm feeling like I'm on crossroads between these two options - no degree or an absolute mental breakdown.\n\nI'm not as strong as the others. I'm just an ultra sensitive weak fella who has always finished his homework. But now...it's enough. I'm out. I'm too weak.",
          "author": "International-Gur877",
          "created": 1633966828,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg8a36q": {
      "link": "/r/college/comments/q5wkzh/this_is_the_end/hg8a36q/",
      "text": "Good luck. Hopefully you can find success without the college degree.",
      "author": "Spiritual-Band-9781",
      "created": 1633961201,
      "upvotes": 5,
      "replies": {}
    },
    "hg9faxz": {
      "link": "/r/college/comments/q5wkzh/this_is_the_end/hg9faxz/",
      "text": "How many more years do you have left to graduate? I really recommend taking a gap semester or consider becoming a part-time student.",
      "author": "Traaaaaaaaap",
      "created": 1633978600,
      "upvotes": 2,
      "replies": {}
    },
    "hg8nmrc": {
      "link": "/r/college/comments/q5wkzh/this_is_the_end/hg8nmrc/",
      "text": "Just remember that this too shall pass! I dropped out and now I’m back. Just because you feel overwhelmed and need a break, doesn’t mean that you will always feel that way. You can always come back to school again and take it slower if that’s what you want.\n\nI had a pretty successful career on just my high school diploma but decided to go back to expand my horizons. I wasn’t doing hot the first time I went to school but now I know what I should do. So whatever happens, just know it will be okay!!",
      "author": "shoelaceys7373",
      "created": 1633967138,
      "upvotes": 1,
      "replies": {}
    },
    "hg8noxj": {
      "link": "/r/college/comments/q5wkzh/this_is_the_end/hg8noxj/",
      "text": "Do what you have to do, it’s not for everybody. Maybe go in a trade?",
      "author": "matsudasociety",
      "created": 1633967163,
      "upvotes": 1,
      "replies": {}
    },
    "hga02xj": {
      "link": "/r/college/comments/q5wkzh/this_is_the_end/hga02xj/",
      "text": "short term vision, you gave up cushy 100k+ job career, just becuase you didnt want to study for lousy 4 years? welcome to 40+ years of working minimum wage slave job then",
      "author": "ghostmode342",
      "created": 1633987827,
      "upvotes": 1,
      "replies": {}
    }
  }
}