{
  "sid": "qvxpyz",
  "link": "/r/college/comments/qvxpyz/how_can_i_remember_the_definitions_of_key_terms/",
  "title:": "How can I remember the definitions of key terms for tests?",
  "text": "So yesterday, my class got 20 different terms in a study guide sheet. On the test, which is approaching tomorrow, we have to write down their definition and two other things (one being connection to key terms). I'm currently writing them in a Docs and plan to transfer them to paper so I can hammer some of the terms. The catch is only 10 will be on the test. \n\nAny suggestions for how I cab remember these definitions? I'm not the best at recalling terms, especially when only half are chosen.",
  "author": "SportsMajor",
  "created": 1637150285,
  "updated": 1637399086,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkz92ik": {
      "link": "/r/college/comments/qvxpyz/how_can_i_remember_the_definitions_of_key_terms/hkz92ik/",
      "text": "Flash cards for sure. \n\nThere aren't many terms so it won't take long to run through them. Run through them once every so many hours and they'll start to stick. \n\nEasy peasy.",
      "author": "Awkward_Mail_2786",
      "created": 1637151159,
      "upvotes": 1,
      "replies": {}
    },
    "hkzgvoq": {
      "link": "/r/college/comments/qvxpyz/how_can_i_remember_the_definitions_of_key_terms/hkzgvoq/",
      "text": "Quizlet is an online platform for flashcards. I think they also have \"games\" that you can do if you need a more interactive engagement with the terms and definitions.",
      "author": "SeeSea8",
      "created": 1637155716,
      "upvotes": 1,
      "replies": {}
    },
    "hl3aedc": {
      "link": "/r/college/comments/qvxpyz/how_can_i_remember_the_definitions_of_key_terms/hl3aedc/",
      "text": "tbh i’d recommend making flashcards rather than transferring them around in a list to different places. after you finish writing out the info once, then give yourself a quiz on the terms and don’t look at the answers until the end, even if you feel like you can’t remember; don’t worry about getting the exact wording, just writing down one key word if that’s all you can remember is better than nothing. go over your flashcards a few times and make note of the ones you struggle with more, give yourself another quiz. flashcards a few more times, and hopefully by that point you’ll have the ones you’re less confident on narrowed down more! active recall is absolutely the best/quickest way to learn info though, and it kinda sucks to force yourself to recall info if you don’t really know it, but it’s really the only thing that’ll prepare you :) you’ve got this!",
      "author": "hannah_nj",
      "created": 1637216691,
      "upvotes": 1,
      "replies": {}
    }
  }
}