{
  "sid": "rgg7mg",
  "link": "/r/college/comments/rgg7mg/cc_to_semi_targettarget_or_no_name_4_year_finance/",
  "title:": "cc to semi target/target or no name 4 year? (finance)",
  "text": "hey everyone! i tried to post this in the financial career subreddit and got taken down so let’s try here.\n\ni graduated from high school last may and currently waiting to go to bmt (air force). i didn’t perform well in high school, didn’t take the sat or act, and only did two APs (art and physics) so i don’t have a competitive resume. every since i was in middle school, my interest for finance has been growing and ultimately that’s what i want my career to be in (CIB, or consulting). \n\nwould it be wise to go grind a no name four year uni or grind a cc and cross my fingers i can then transfer to a semi or target? i’m a little apprehensive of the second choice as if i don’t get accepted to the target schools (then im back to the first choice which then i should’ve done in the first place.",
  "author": "investmentbanks",
  "created": 1639512949,
  "updated": 1639515972,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hok0rij": {
      "link": "/r/college/comments/rgg7mg/cc_to_semi_targettarget_or_no_name_4_year_finance/hok0rij/",
      "text": "Honestly, just wait it out till your GI benefits kick in for college. What you lack in grades/schooling resume will be made up for in your military experience and you'll get in almost anywhere. Plus you'll have up to 3 years post service to pick any state as your home state and get that in state tuition. For instance, my brother didn't do too well in high school but he knew he wanted to do a stint in the Marines. He got out last May (2020) and even though he enlisted out of the midwest, he picked California as his new residence since he lived there during his contract and is familiar with the area.",
      "author": "bucket_o_stands",
      "created": 1639513806,
      "upvotes": 1,
      "replies": {
        "hok5369": {
          "link": "/r/college/comments/rgg7mg/cc_to_semi_targettarget_or_no_name_4_year_finance/hok5369/",
          "text": "no that’s really smart. i want to study and work in nyc or chicago, but there aren’t any air force bases in either. so if i wanted to go to school there i would have to pick a base a in a different state and then drive back and forth from my base to the school and that would be an absolute headache. \n\nso you would recommend waiting toward the end of my mos then apply to a four year in whatever state i want to be at?",
          "author": "investmentbanks",
          "created": 1639515557,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}