{
  "sid": "r3sn7c",
  "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/",
  "title:": "Anyone else who is graduating in the spring feel super stressed about being able to find a job?",
  "text": "Hello!  I am currently planning on graduating from college in the spring of 2022 and feel super stressed about being able to find a job.  I think it's too early to start applying jobs right now, but finding a job is pretty much all I can think about.  I am also concerned about being able to find a job because I want to be able to live on my own after I move out, which would cost \\~$1,000 a month for just rent, so I need a job that pays decently well.  Anyone else feel this way or able to relate at all?",
  "author": "rye_bread297",
  "created": 1638063778,
  "updated": 1638206794,
  "over_18": false,
  "upvotes": 37,
  "upvote_ratio": 0.97,
  "comments": {
    "hmck3hw": {
      "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmck3hw/",
      "text": "If you're graduating in six months, it's definitely not too early to start applying for jobs. Have you done internships related to your major? If so, you could start by applying at those organizations.\r  \n\r  \nIf your school hosts career fairs, you should attend those and begin networking. Create a LinkedIn account and let people know you're looking to start work in a few months. It's not unusual for organizations to extend job offers to seniors a few months before graduation.",
      "author": "MrsRadarOreilly",
      "created": 1638064594,
      "upvotes": 5,
      "replies": {
        "hmclcda": {
          "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmclcda/",
          "text": "I did an internship last year but I don't want to work there.  Pretty much all the work I've done in the past has been outside, however, I don't really like working outside and I want to work an indoor/office job in the future.  I will attend the career fair in the spring that my school holds, but I've gone in the past and they haven't been too helpful tbh.  Hopefully it will be this year.",
          "author": "rye_bread297",
          "created": 1638065184,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmcjh1g": {
      "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcjh1g/",
      "text": "Depending on your major, now is the time to start. I would maybe just focus on places where the companies come to you (career fairs, info sessions) for now and move to online stuff in February. But my experience with engineering, was that the most competitive companies start handing out offers in October or November.\n\nI don't mean to stress you out though, most of my friends found jobs in the spring, but it's never to early to start.",
      "author": "Thelton26",
      "created": 1638064298,
      "upvotes": 12,
      "replies": {
        "hmcl248": {
          "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcl248/",
          "text": "I'm double majoring in biology and psychology so I don't think the jobs are as competitive as engineering.  I have been looking a jobs that I could possibly apply for, but I haven't applied for anything yet.  My plan is to wait until after the holidays to start applying, but finding a job (or not being able to) is pretty much all that's on my mind, and its stressing me out.",
          "author": "rye_bread297",
          "created": 1638065051,
          "upvotes": 1,
          "replies": {
            "hmclrog": {
              "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmclrog/",
              "text": "You’re right, biology and psych jobs aren’t as competitive as engineering. They’re MORE competitive. The market is absolutely flooded for both majors, well beyond what jobs there are. That’s why everyone says bio and psych degrees are useless if you don’t go to grad/med school. There’s virtually no market for undergrads because there’s less openings than there even are graduate degree holders.\n\nYou need to start applying now. Do like 5 apps a day. You have a very, very upward climb as a bio or psych grad unless you get lucky. Start now.",
              "author": "maora34",
              "created": 1638065388,
              "upvotes": 6,
              "replies": {
                "hmcnz87": {
                  "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcnz87/",
                  "text": "I’m a psych and bio double major and this has me rethinking everything",
                  "author": "Morbidstudent",
                  "created": 1638066465,
                  "upvotes": 2,
                  "replies": {
                    "hmcoiz9": {
                      "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcoiz9/",
                      "text": "You should. The fields are wonderful. I love them myself. AP bio was so fun and I actually do psychology-related work for the military on a part-time basis. But for college? Oh god- fuck. no. Look at the career outcomes and salary statistics for grads in these fields, it’s downright horrifying.\n\nIf you don’t go to med school, you are literally gg. Even if you to go grad school, there’s a helluva lot of grad students in these fields struggling to break hardly above minimum wage with their masters. PhD is better, but it’s still depressing considering how much time they spend in school to still make less than a starting engineer with their BS. \n\nYour only real paths are to go to med school or grad school, and we all know med school is not only impossible to get into, but is also just hard as shit.\n\nPlease go ahead and fact check me too. Look up salaries for these majors. It’s really quite depressing.",
                      "author": "maora34",
                      "created": 1638066738,
                      "upvotes": 1,
                      "replies": {
                        "hmcpa2e": {
                          "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcpa2e/",
                          "text": "I’m actually thinking about applying to law school after a masters degree in bio and doing patent law bc of the depressing job outcomes for PhDs in either fields",
                          "author": "Morbidstudent",
                          "created": 1638067108,
                          "upvotes": 1,
                          "replies": {
                            "hmcpx4b": {
                              "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcpx4b/",
                              "text": "Why law school after a masters? You can go to law school after undergrad. You’re at a bit of a disadvantage in law as a grad in these fields, but you can make it work. The real fear is in law school, as the Bar is a real fear for most students, law school itself is HORRENDOUS, and it’s quite easy to wash out. I’d spend some time on /r/lawschool to see what those maniacs deal with on a daily basis.",
                              "author": "maora34",
                              "created": 1638067421,
                              "upvotes": 1,
                              "replies": {
                                "hmcvtb6": {
                                  "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcvtb6/",
                                  "text": "in order to practice patent law I need a stem degree (https://www.patenteducationseries.com/exam/qualifications.html). I’ve done a bit of asking around and though not officially listed, when it comes to bio degrees it’s recommended that you also hold a masters degree in bio. I’m still deciding what I want to do with my future, and law school/the bar/patent exam do sound terrifying, but I do still have a few years to switch paths if I had to",
                                  "author": "Morbidstudent",
                                  "created": 1638070348,
                                  "upvotes": 1,
                                  "replies": {
                                    "hmhmanw": {
                                      "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmhmanw/",
                                      "text": "Ah I understand. Best of luck. Law is a hard but potentially very rewarding path. I took the easy route and got a good paying bachelor’s so while I will do 2 graduate degrees, it’s optional if I decide not to. But if you do well in law, you’ll make more than I can imagine if you get into big law.",
                                      "author": "maora34",
                                      "created": 1638157356,
                                      "upvotes": 2,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hmcli2f": {
              "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcli2f/",
              "text": "One thing you might look for is a job that will let you be a student intern during the spring. I'm not sure how busy your last semester will be or if you're already working, but it will probably pay better, and also make you a shoe in for a job. And it's not as competitive because a lot of people don't think of it or what to party out their last year or semester.",
              "author": "Thelton26",
              "created": 1638065260,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmcljmg": {
      "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmcljmg/",
      "text": "You should absolutely be scared. There’s a reason people say you need to intern the summer before your senior year. When you intern, you’ll more than likely have an offer waiting for you at the end of your internship if you weren’t a garbage worker. That means you get to cruise your senior year and only apply to more jobs if you want more options.\n\nSince you don’t have an offer, I’m going to assume you didn’t intern. That makes it even more difficult because you also don’t have the real world working experience that companies value. The best time to start planning this out was years ago, the second best time is now. Start sending those apps. Slots for new grads are already getting filled.",
      "author": "maora34",
      "created": 1638065281,
      "upvotes": -7,
      "replies": {}
    },
    "hmefc31": {
      "link": "/r/college/comments/r3sn7c/anyone_else_who_is_graduating_in_the_spring_feel/hmefc31/",
      "text": "I graduate in May and just started my job hunt. Depending on your major it is probably a good time to start. Many of my friends had more luck getting replies and interviews in January and February but others had offers early on so it definitely doesn’t hurt.",
      "author": "zestyrigatoni",
      "created": 1638107795,
      "upvotes": 1,
      "replies": {}
    }
  }
}