{
  "sid": "r72wd6",
  "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/",
  "title:": "F*ck you guys for making me do the entire group project!",
  "text": "F\\*ck you for not doing your part and then guilting me by saying that i was being rude when i said i would be scrapping your part and redoing it. You knew that i would redo it if you gave me shit work! I have four submissions and a term test tomorrow! I hope you fail your finals! B\\*tch!!!!\n\n(i am sorry but i really need to get this out of my system!!)",
  "author": "what_is_acorn",
  "created": 1638434075,
  "updated": 1638479887,
  "over_18": false,
  "upvotes": 157,
  "upvote_ratio": 0.95,
  "comments": {
    "hmww3lf": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmww3lf/",
      "text": "Same thing happened to me last week, the guy told me \"sorry bro I didn't do it because I know you would do a better job\", what an a**hole",
      "author": "TemperatureWise7792",
      "created": 1638437367,
      "upvotes": 82,
      "replies": {
        "hmxe3nb": {
          "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmxe3nb/",
          "text": "You guys should definitely contact your respective professors and get your group member's grades tossed in the trash.",
          "author": "LeadingYogurtcloset8",
          "created": 1638450591,
          "upvotes": 58,
          "replies": {
            "hmxnzsm": {
              "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmxnzsm/",
              "text": "I like how you think.",
              "author": "ApollinaGrindelwald",
              "created": 1638455493,
              "upvotes": 16,
              "replies": {}
            },
            "hmxrqzv": {
              "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmxrqzv/",
              "text": "This guy got some ideas",
              "author": "abetternamethanthat",
              "created": 1638457140,
              "upvotes": 7,
              "replies": {}
            },
            "hmy7a1n": {
              "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmy7a1n/",
              "text": ">This guy got some ideas  \n>  \n>VoteReplyGive Awar\n\nI cant they gave the work but it was so shit that i dont know what to do about it! if i go to the prof, she wont do shit because they submitted the work!",
              "author": "what_is_acorn",
              "created": 1638463450,
              "upvotes": 8,
              "replies": {
                "hmyb3ga": {
                  "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyb3ga/",
                  "text": "If you have messages about you trying to get them to work, or them acknowledging they aren't really trying, etc. Its possible to at the very least get them a lower grade or have yours graded separately, especially if they're dragging you down when you compare the quality of your work and theirs.\n\n  I feel for you OP, I hate group projects because you're at the mercy of other people. Please reach out to your professor and just try to explain the situation. Youll never know until you talk to a prof about the issue. It's better to try than do nothing and guarantee that your grade is dragged with your partners.",
                  "author": "LeadingYogurtcloset8",
                  "created": 1638464899,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmy4ne9": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmy4ne9/",
      "text": "Reminds me of my brother who was doing a group project and all of his group mates ditched him and left him to do all the work by himself. When it was their turn to present everyone got up to go in front of the class but he went to the front and said \"yall can sit down cus you didn't help me at all and I did everything myself so you mfs aren't in my group\"  he presented by himself and the professor looked at him and said good job. You should do the same .",
      "author": "Harajuku_Aj",
      "created": 1638462421,
      "upvotes": 40,
      "replies": {
        "hmycvhv": {
          "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmycvhv/",
          "text": "Man I like your brother’s spunk. I’m downright militant about getting a group project done if it looks like I might have slackers in my group. If that doesn’t work then I drop hints at my prof all passive aggressively.",
          "author": "ApollinaGrindelwald",
          "created": 1638465577,
          "upvotes": 14,
          "replies": {
            "hmyulrc": {
              "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyulrc/",
              "text": "A well placed CC in an Emails can do wonders",
              "author": "FF_01_1999_03_05_01",
              "created": 1638472384,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "hmys01g": {
          "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmys01g/",
          "text": "Damn, what a madlad. It seems we should follow in your brother's footsteps haha.",
          "author": "ThoughtCenter87",
          "created": 1638471382,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hmxnxww": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmxnxww/",
      "text": "Dear just bully them into doing their works. Or passive aggressively tell the prof to be honest. It’s a okay to be rude to people who are rude to you first. Or you could just kill them with kindness. That is so their part but shoddily and then complain about them to the prof.",
      "author": "ApollinaGrindelwald",
      "created": 1638455470,
      "upvotes": 19,
      "replies": {}
    },
    "hmy5vuj": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmy5vuj/",
      "text": "If you ever have group projects with the same group throughout the semester, on the first one I like to redo their work *in a separate document that they don't have access to*. A lot of times as the deadline approaches, seeing that nobody has fixed bad work will scare them into doing it themselves. Just one time is enough to scare them into thinking you won't do their work/fix bad work. I've only ever needed to do it once, but it worked like a charm.\n\nHaving it in a separate document means that if they don't do the work, you'll have it done and can use that if needed.",
      "author": "cas47",
      "created": 1638462906,
      "upvotes": 6,
      "replies": {}
    },
    "hmy3jtx": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmy3jtx/",
      "text": "Now try to tell it to them instead of internet strangers, unless you want it eating out at your mind before going to sleep.\n\nNo need to be this rude (even if they deserve it), but unless you start to make a stand, people will keep walking over you.",
      "author": "MrStealYourFrog",
      "created": 1638461992,
      "upvotes": 4,
      "replies": {
        "hmy7jts": {
          "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmy7jts/",
          "text": "Oh i did tell them but i obviously couldn't be rude so had to get it out here",
          "author": "what_is_acorn",
          "created": 1638463553,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hmydgi5": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmydgi5/",
      "text": "This is happening to me too. Be vocal about it. If you don’t, they know they can treat you like a doormat.\n\nThe graphs for my project had issues with them and I straight up told them to fix that shit. I’m having to write everything though. \n\nIve gotten the “rude” thing before from peers. I just don’t care. I tell em “I’m not here to make friends, I’m here to do my best and if one of you thinks the rest of us will make up for your shitty work, I’ll make sure everyone knows who it is, including the professor.”\n\nA lot of people in college are still on the tit and don’t understand what hard work is. I honestly don’t know how so many students got this far.",
      "author": "Butthole_seizure",
      "created": 1638465797,
      "upvotes": 4,
      "replies": {}
    },
    "hmyehuv": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyehuv/",
      "text": "Our professor assigned a group paper to SIX of us (and the paper is fairly short, like 6-8 pages).\n\nI'm the only native english speaker and I'm doing all the editing. One of the members keeps getting pissy because I took the \"easy\" portions of the writing (the intro, sources characterization, and the conclusion) and I'm trying to be pleasantly professional while internally going \"Lady, I basically have to rewrite the entire goddamn paper every time we turn in a draft, to include finding new sources because people didn't understand the ones they used in their portion properly. I'm also doing all the organizational work because no one else is. Of course I took the 'easy' writing.\"\n\nI should have just offered to write the entire thing and have people just send me sources/look over it when it was done. It would have been less stressful. Fuck group work.",
      "author": "safetimethrowaway",
      "created": 1638466191,
      "upvotes": 4,
      "replies": {
        "hmz30fb": {
          "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmz30fb/",
          "text": "Are you studying in a non-anglophone country and taking an English class in your current university?",
          "author": "Caboverde-Evora",
          "created": 1638475670,
          "upvotes": 1,
          "replies": {
            "hmz65ul": {
              "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmz65ul/",
              "text": "Nope, I am in an anglophone country doing a research paper for a STEM class. Our university happens to have a large international student population though.\n\nIt's frustrating, because everyone is actually working really hard on the paper, but there's a lot of extra work that I feel I need to pick up to make sure that things are readable.",
              "author": "safetimethrowaway",
              "created": 1638476885,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmyiwx7": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyiwx7/",
      "text": "I would do it in a heartbeat as well if it happened to me because it’s just plain unfair to dump the work load onto someone. We’re all overworked, sleep deprived, and stressed out.. we all need to do our part and make sure we do a good job to get a passing grade but thankfully I’ve gotten good group mates in my projects lol",
      "author": "Harajuku_Aj",
      "created": 1638467882,
      "upvotes": 2,
      "replies": {}
    },
    "hmyjrl7": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyjrl7/",
      "text": "Report this to the teacher with proof of your work and his.",
      "author": "toffee_queen",
      "created": 1638468213,
      "upvotes": 2,
      "replies": {}
    },
    "hmyqmjl": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyqmjl/",
      "text": "I have gone through this situation already and i have to admit that it felt so terrible. The goal of group project is to have a best result, gathering ideas and works from ALL members in that group. You in this situation may be a responsible one, a passionate one who tries hard to have a good result. But others may do not have a same goal like you, so they took it for granted, or finish it just for having. This or whatever is frustating. Just see, by knowing those people, you will realize more about doing group project. I think I could give some of MY questions when I have to do a group project: \n- Is there a group leader?/ Do we divide works equally and suitably for each one? \n- How about deadline? If a problem happens, can we redo it again? Can we SUPPORT that person with the problem? \n- If there is a frustration, what can we do? Can we talk in private and solve the problem? Is there any misunderstanding here? \nHave a nice day!! Do not bother about that stuff much. Just relax and take time for yourself. You have worked hard!! \nSorry if any of my ideas go wrong",
      "author": "Icantcreateanynames",
      "created": 1638470853,
      "upvotes": 1,
      "replies": {}
    },
    "hmyrrow": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyrrow/",
      "text": "This is how college group projects usually are. It's gotten to the point where I take action and plan everything, but refuse to do the work for them. I will still do a portion of the group project but won't do the entire thing for them. If they don't do their part I explain to the professor what's up and they usually understand.\n\nIt's even worse for group projects in online classes, lol. You'll repeatedly contact your group hoping for a response and they won't get back to you until like the day/few hours before the project is due. I'm the one who turns in the work to the professor, so I tell them over email that if they don't electronically get their work into me by a certain time (usually 10 pm) then tough shit because I need sleep. You either do the work or you don't, I refuse to do it for them. It felt satisfying to give slackers the final \"fuck you\" (i.e - an email saying \"after repeated attempts to contact you, I was unable to get the work from you and have submitted what our group did of the project to our professor\") before submitting the work I had from our group to the professor.",
      "author": "ThoughtCenter87",
      "created": 1638471293,
      "upvotes": 1,
      "replies": {}
    },
    "hmytbob": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmytbob/",
      "text": "I'm mid project right now, EXACT same issue. Every week it's all 'guys yea we gotta work harder now!' and then it's all me again. The funny thing is using Git you can see who's doing what so have fun when it comes to the marking assholes",
      "author": "Azraelontheroof",
      "created": 1638471891,
      "upvotes": 1,
      "replies": {}
    },
    "hmyuucc": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyuucc/",
      "text": "I once had a classmate text me and ask if I could send her 200+ pages of text book, via iMessage photo, 2 hours before a 10 page theory paper was due. I was stress writing my own paper and said “lol, no.”",
      "author": "Direct_Preference737",
      "created": 1638472476,
      "upvotes": 1,
      "replies": {}
    },
    "hmyvf3x": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmyvf3x/",
      "text": "For my anthropology class in college, my partner and I had done nothing and it was the night before our presentation. I was filling out the slides and told her she was responsible for 5 of like 12 slides. She did two in an entire day and I finally told her I’d just do it. I felt so bad the next day when she showed up to class because she was a mess. Fresh from crying, slept-in bun, sweats and a tshirt and told me her boyfriend dumped her the night before :( I couldn’t even be mad anymore. She left class right after our presentation was over.",
      "author": "Direct_Preference737",
      "created": 1638472699,
      "upvotes": 1,
      "replies": {}
    },
    "hmz6iqp": {
      "link": "/r/college/comments/r72wd6/fck_you_guys_for_making_me_do_the_entire_group/hmz6iqp/",
      "text": "this.",
      "author": "_skullman",
      "created": 1638477018,
      "upvotes": 1,
      "replies": {}
    }
  }
}