{
  "sid": "rhmha3",
  "link": "/r/college/comments/rhmha3/taking_another_course_at_different_school/",
  "title:": "Taking another course at different school",
  "text": "Hi,\n\nI am 22 (F) taking practical nursing from a local community college in my 2nd year. It's a 2 year diploma program.  It is not really my passion to be a nurse but I only took it so I could get a decent job after college. \n\nI have been thinking if I should take a 2-Graphic design diploma, but I'm scared because it is offered at a different college. \n\nI wanted to take it while finishing nursing at the same time, and take one graphic design course at a time... Then I could go full time after I graduate nursing.\n\nIs it a dumb idea?",
  "author": "LividMove9461",
  "created": 1639643728,
  "updated": 1639787824,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hosg2zs": {
      "link": "/r/college/comments/rhmha3/taking_another_course_at_different_school/hosg2zs/",
      "text": "Realistically, getting that LPN degree will immediately plunge you to a nursing assistant job in a hospital or clinic. Im unsure how salaries differ between U.S and Canada, but nurses are high in demand, and there will always be jobs in healthcare. And you'll definitely have a stable and comfortable source of income.\n\nBut healthcare is not for everyone. And if you don't have the slightest passion for physically taking care of people; washing them, bathing them, lifting them, and handling their bodily needs in a steady 12-16 hour shift, chances are you won't survive your first week of training. My brother is a CNA and he hates it. It's a physically demanding job that drains you. \n\nI don't know how far your are into the 2-year program, but if you feel like you need to pursue a major at a different college, it's best that you do so asap. If you have a passion in Graphic Design, why not take a dab at coding? Computer Science and tech is also in demand, and web page design is booming with the emergence of content creation. \n\nIf you're almost done with the LPN program. Finish it and pursue graphic design. Otherwise, pick one career path and stick to it. An LPN diploma will simply open you to one door; nursing. A degree in graphic design will open you to many doors; social media, programming, marketing, advertising, and many other tech related fields.",
      "author": "ecstatic-hatter",
      "created": 1639668491,
      "upvotes": 1,
      "replies": {
        "hosqdjv": {
          "link": "/r/college/comments/rhmha3/taking_another_course_at_different_school/hosqdjv/",
          "text": "Thankyou for the lengthy reply. I have a passion for health/medicine but just not specifically nursing and it was not my first choice. I took it so I can have something to fall back on in case I fail at everything. I don't mind bathing/lifting people as well.\n\nBut it was late for my to realize what I wanted to do. I am 22 now, been back and fort with nursing. But I've learned to love it overtime. But still, there's the thought of me enrolling in Graphic design.\n\nMy first choice was actually compsci when I graduated from high school, but my parents didn't approve of it. I do regret not taking it now. \n\nThe thing is I sacrificed so much in nursing already  and I don't just want to drop out...",
          "author": "LividMove9461",
          "created": 1639672578,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}