{
  "sid": "riro2c",
  "link": "/r/college/comments/riro2c/how_to_deal_with_a_rude_and_unfair_college/",
  "title:": "How to deal with a rude and unfair college professor? Am I overreacting?",
  "text": "\nJust wanted to say I apologize for how long this post is, I just needed to get my thoughts down. Thank you to anyone who takes the time to read this.\n\nTo start off, I am a junior at a university studying graphic design and getting my BFA. My degree requires I take 3 courses outside my major, so I chose a journalism class because I love writing. Since the first day of class I knew this course was going to be trouble. My teacher, a guy in his mid to late 30s, came across as an incredibly arrogant, conceited professor who gets off on control and a superiority complex over his students. He works for a food magazine in a city and gets many free expensive benefits, I think because he “made it” in the industry he formed a huge ego. He’s rudely sarcastic and gets incredibly upset when a student even glances at their phone, demanding that he deserves total respect. I’ve had teachers have a no phone policy in class before but something seemed different about this teacher, as if if he’s not the center of attention at all times he becomes irate. Immediately I tried switching out of the class, knowing it was going to be incredibly hard to listen to this teacher. To my dismay every class I could possibly change into was full, so I decided to put my best foot forward and bare out the semester. This teachers personality however, was not the only reason why I’m coming here today. He warned the class, “most of you will be doing very bad until a month before the semester ends because I am a very hard grader.” He told us if our AP style format was not perfect, many points will be taken off. Great. Formatting and grammar are not my strong suit and I never had heard of AP style before so I relied on him to teach it. He taught AP style the first two weeks of class and then never again. Each 1 hour and 45 minute lecture from then on was mind numbing power point lectures about different aspects of the journalism and media profession. I understand that this is a journalism class and he needs to teach many things, however, he only ever graded on ap style, never content. Immediately I started off with very bad grades. He gave me a 0 on my first assignment because I accidentally handed it in in a different format then Microsoft word and he doesn’t use Mac products because he hates Apple so he was unable to view it. When I explained that I wrote it in word but the submission process somehow changed something because this was the first assignment I ever used word for, he said it was ok but never changed my grade. From that point on I stayed at a consistently low grade.  For every assignment I spent a long time reviewing and still had many AP style errors because it was the beginning of the semester and I didn’t have a chance to read the 400 word AP style book. He would take off points for very minor details which added up to a bad grade. His comments were rude, and not constructive. He would write on other students papers “blow this up” or “this is absolutely horrible” without giving actual critiques that would help future grades. On top of that he would give quizzes worth a lot in the first 2 minutes of class every week. I had a class on the other side of campus that ended 20 minutes before this one started and I often times came in a couple minutes late because of the walk. Because of this I failed many quizzes because I was not there in the first minute. If I walked in a minute late he would refuse to tell me the first questions on the quiz so I would always do poorly on those. I tried in this class, I really tried. I am a straight A student except for some Bs here and there. I put my all into my work. I push myself to understand the material and do well in any class I take. I was failing this intro course, that I showed up to, took notes everyday, and worked hard in. I never complained. But then things seemed to start getting personal. One day the class was going around sharing our weekly story ideas. I had went to a concert a night before and saw one of my favorite artists. Sadly halfway through the concert the artist appeared to take many drugs back stage and came out completely messed up and could barely preform. It was heartbreaking. In class I said I wanted to write a story about drug dependency in the rap industry and how fans sing along to artists lyrics that are wishing for death and it’s disturbing that this is the rap music culture of our society, especially in the wake of music artists death like Mac Miller and Juice Wrld. He told me the idea was stupid. He said it was unoriginal, and that he would be surprised if he went to a concert and the artist wasn’t on drugs. He then turned to the class and asked would anyone even bother reading an article about something as pointless as this? No one answered. He turned back to me and told me to pick a different story. I was shocked. I began to defend myself and my story but that was it. He heard enough. I sat there for the rest of class grinding my teeth as he praised other students ideas,  when their stories consisted of “who has better coffee, Starbucks or dunkin?” I was stunned that a journalism teacher struck down so rudely a topic I was passionate about and believed truly mattered. For another assignment we had to write about a person we knew. I wanted to write about my best friend who is trying to pursue a career in music. This person is the most interesting dedicated hard working person I know. He told me once again that the idea was not good and that he didn’t wanna hear about some kid who dropped out of college to be a “rapper.” I was furious. Later that week in class he said to the class “please don’t come to me with boring story ideas about ur friend who dropped out of college cause he wants to be a rapper” clearly referencing me. I couldn’t believe the level of rudeness. I wrote the story anyway because I knew that’s what I wanted. He graded it and told me it was one of the best stories he read this semester and that I was a great writer. Under that was my grade, a B-. He took off many points for a sentence he deemed was “painfully cliche and to never use again in writing” the “cliche” in question he took off points for was me defining a word. He also took off many points for each comma I missed. I missed 3. Once again I don’t think my grade reflected the hard work I put into it. By the end of the semester I was at my wits end with this teacher. Despite my over the top hard work for this intro class that has nothing to do with my major, I was doing very poorly. His grading is completely absurd. For another assignment he took of 30 points out of 50 for one fact error. I felt like no matter what I did I could not do well. Towards the end of the semester he assigned an extra credit assignment on our off day which required us taking a train 35 minutes to a different city with him and writing about the train station and the experience. I was one of 3 students who showed up. By now the semester was days from being over. I texted him asking how to hand in the extra credit and about a quiz grade he never inputed. He said he didn’t have the quiz and to resend it. So I did with the extra credit. He emailed me back saying why are you sending me this quiz. I was so confused and explained to him the text convo we had a day earlier. He doesn’t reply for the entire day and when he finally does he doesn’t mention the quiz. Instead, he tells me I plagiarized my extra credit assignment and that he could go to higher authority if he wanted to, but decided he just wasn’t going to give me any points. This is when I lost it. The “plagiarism” he was referring to was one sentence out of 300. I forgot the names of the restaurants in the train station. It was late at night and I was exhausted. All I wanted to do was sleep. I looked up the names of the resturants and saw a sentence in an article describing them, so I copied and pasted. I know it was wrong and I should have changed the wording, I was just so tired and it was only one sentence after all, I thought. I’ve had friends who’s teacher called them out for plagiarizing entire papers and still gave them some credit. I know it’s wrong and I am not defending plagiarism or saying I deserve that same treatment. I was just devastated. Never in my education career was I accused of plagiarism. It seemed so absurd to me and just a way for him to have one last f*ck you. Even though I spent hours out of my day to do this extra credit assignment and was one of the few people to care enough to show up, he accuses me of plagiarism and disregards it completely for one sentence. I ended the semester .2 points away from a B-. I understand if I got a C in a class that was hard. I’ve taken incredibly difficult courses where I thought I deserved a C and still worked my way to a B. But this intro journalism course completely beat my ass. I don’t think I have enough evidence to report him to anyone higher up because I believe my problems with him were personal. He seemed to get along very well with the other girls in my class. People reviewed this teacher online calling him hot and sexy to my disgust. Only one other person said he was incredibly creepy and graded unfairly leading me to assume he picks the people he wants to bully. For most people who can’t see through his bs he comes across as a charismatic, funny, chill guy. I know that’s not true. He made my blood boil this semester because he has complete control over my grade. The semester is over and I want nothing more then to forget about this class. I feel so helpless and I can’t help but let this bother me, knowing my last interaction with this professor was him accusing me of plagiarism. It completely ruined my break.",
  "author": "Brief-Ear8304",
  "created": 1639777490,
  "updated": 1639865848,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hozluk3": {
      "link": "/r/college/comments/riro2c/how_to_deal_with_a_rude_and_unfair_college/hozluk3/",
      "text": "He didn't accuse you of plagiarizing, he caught you plagiarizing.",
      "author": "doomsdaea-",
      "created": 1639786589,
      "upvotes": 1,
      "replies": {}
    },
    "hozvkze": {
      "link": "/r/college/comments/riro2c/how_to_deal_with_a_rude_and_unfair_college/hozvkze/",
      "text": "Dooms is correct. You were not accused of plagiarizing, you did. So for one, be grateful that nothing further happened. As for the Professor he sounds like a douche, but a lot of the stuff in the post sounded legitimate. Maybe his methods were a little unprofessional, but it did seem like a lot of the issues were on you as well. \nAlso sometimes professors are strict because that is what is demanded in the field. He knows what gets approved for articles, so a missed comma might seem silly to you, but it may mean an article gets kicked back in the real world. Always try to understand why a professor is the way they are, and take criticism as it comes. Professors have worked in the field, they may seem like they are “power-hungry” or whatever but there is a certain standard that is required in professional fields.",
      "author": "Far_Drink_8879",
      "created": 1639791078,
      "upvotes": 2,
      "replies": {}
    }
  }
}