{
  "sid": "qryawi",
  "link": "/r/college/comments/qryawi/having_trouble_deciding_on_college/",
  "title:": "Having trouble deciding on college.",
  "text": "Basically, I’m in a situation on going either out of state to the University of Arizona or going to PLNU. I will be dorming at either locations so they will essentially come out to about the same price. The university of Arizona has more of a real college experience compared to the other school, but Loma is in a great location as well as a great research program. Thoughts??",
  "author": "Big-Count-8212",
  "created": 1636674306,
  "updated": 1636745752,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hk9vmt2": {
      "link": "/r/college/comments/qryawi/having_trouble_deciding_on_college/hk9vmt2/",
      "text": "Go to whatever is cheapest and has your desired major",
      "author": "Lumpy-Story",
      "created": 1636678741,
      "upvotes": 2,
      "replies": {}
    },
    "hk9r2s6": {
      "link": "/r/college/comments/qryawi/having_trouble_deciding_on_college/hk9r2s6/",
      "text": "PLNU is probably only a good idea if you want to be in a religious education community at a smaller campus (around 3,500 students). UofA is huge (over 33,000 students) and will likely have more options for study, more opportunities to socialize, more employment connections, and it probably has a bunch of research going on at the campus since it is so massive.",
      "author": "zifmer",
      "created": 1636676607,
      "upvotes": 1,
      "replies": {}
    },
    "hk9o4wi": {
      "link": "/r/college/comments/qryawi/having_trouble_deciding_on_college/hk9o4wi/",
      "text": "If you go to University of Arizona, you would be paying double the tuition of your peers. If you’re gonna take out loans then I would highly advise against it. Tuition for both is 28-30k, and if you add housing, you’re easily looking 40k an year which would add up to 160k for a bachelors degree.\n\nIf you graduate with $160,000 in loans, and let’s say your interest is 10/15%, your loans will acquire around $20,000 on interest ALONE, and I won’t sugar coat it, at that point your life would have been ruined or a good chunk of it. You cannot bankrupt your way out of student loans and you can’t pay that much money off with any bachelors job salary.\n\n\n\n\n\nBut if your parents are just crazy rich and they’re paying for it, then go with University Of Arizona and have fun lmao.",
      "author": "M33RHARIS",
      "created": 1636675180,
      "upvotes": 0,
      "replies": {
        "hk9r76k": {
          "link": "/r/college/comments/qryawi/having_trouble_deciding_on_college/hk9r76k/",
          "text": "I have heard that UofA gives out great merit scholarships to students with a certain gpa. They can check that out first.",
          "author": "emerald1001",
          "created": 1636676666,
          "upvotes": 1,
          "replies": {}
        },
        "hkb4uri": {
          "link": "/r/college/comments/qryawi/having_trouble_deciding_on_college/hkb4uri/",
          "text": "I would have to take out loans for both universities.",
          "author": "Big-Count-8212",
          "created": 1636703361,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}