{
  "sid": "r2stx4",
  "link": "/r/college/comments/r2stx4/coming_home_for_the_holidays/",
  "title:": "Coming Home for the Holidays",
  "text": "I’m a college freshman and right now I’m home for thanksgiving break. I love my family and I love being home but I have about two more days left of break and I just can’t wait to go back to school. I just miss my freedom that I have at college. Every day during this break has just been packed full of plans and chores and activities. If I sleep in past 9 I’m ridiculed by my parents. Not to mention me having to see my extended family, which is a whole other story. Back at school, me and my roommate would just relax for the weekends usually. Sleep in, watch a movie, that sort of thing, but here it just like I’m doing so much all the time. I have no clue how I’m going to be able to do this for a whole month during Christmas break. Am I the only one feeling this way?",
  "author": "Anxious_Snack965",
  "created": 1637949100,
  "updated": 1638206889,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hm6jee8": {
      "link": "/r/college/comments/r2stx4/coming_home_for_the_holidays/hm6jee8/",
      "text": "I'm the opposite I couldn't wait to go home. My school is a 9 hour drive from my home..Plus last year with covid we weren't allowed home for the entire year... we had to stay on campus from august 2020-may 2021.. \nI actually had more freedom at home too because I lived in a city while my college was rural and my parents dont constantly blow up my phone when I'm home. Obviously I loved my college but it was a lot being away and never allowed to come back. I took a year off and I'm transferring to a school about an hourish away.",
      "author": "elyse-on-reddit",
      "created": 1637951267,
      "upvotes": 1,
      "replies": {
        "hm75852": {
          "link": "/r/college/comments/r2stx4/coming_home_for_the_holidays/hm75852/",
          "text": "I get that for sure. My parents just aren’t very relaxed so I went from tons of freedom to not a whole lot of it. It feels like I’m back in hs again when I’m home but I also only live 3 hours from school so it’s easier to go back home for me if I need especially with COVID restrictions being more relaxed at my school.",
          "author": "Anxious_Snack965",
          "created": 1637961460,
          "upvotes": 2,
          "replies": {
            "hm7hzur": {
              "link": "/r/college/comments/r2stx4/coming_home_for_the_holidays/hm7hzur/",
              "text": "Yeah I had almost zero freedom at school, I'd have to call home 3 times a day..when I'm home I don't have to do that. I can leave and do what I want whenever I want.  They didnt like how far away I was so they were strict about it.",
              "author": "elyse-on-reddit",
              "created": 1637967459,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hm7ybpj": {
      "link": "/r/college/comments/r2stx4/coming_home_for_the_holidays/hm7ybpj/",
      "text": "I’m a junior but I understand the feeling, especially when I was a freshman and coming back for break. Your parents still see you as a kid and you are so used to just doing whatever you want. Even them asking “what are you doing?” Or “what are your plans?” Can be annoying even if there is no Ill intent. You are just so used to getting up and doing what you want without anybody questioning you.",
      "author": "Physical_Advantage",
      "created": 1637975573,
      "upvotes": 1,
      "replies": {
        "hm87x0l": {
          "link": "/r/college/comments/r2stx4/coming_home_for_the_holidays/hm87x0l/",
          "text": "Lol I got questioned about what I was doing at school more then when I'm home. I had my location on at all times and needed to call home 3 times(and text constantly) when I was at school. If I didnt then they'd call campus security on me.",
          "author": "elyse-on-reddit",
          "created": 1637980418,
          "upvotes": 1,
          "replies": {
            "hm882ea": {
              "link": "/r/college/comments/r2stx4/coming_home_for_the_holidays/hm882ea/",
              "text": "lol I’m so sorry, my parents have never had my location and when I’m at school they just leave me alone",
              "author": "Physical_Advantage",
              "created": 1637980493,
              "upvotes": 1,
              "replies": {
                "hm8886h": {
                  "link": "/r/college/comments/r2stx4/coming_home_for_the_holidays/hm8886h/",
                  "text": "Total opposite then me when I'm home they leave me alone and let me do what I want. Its just my school is so far so they worry more.",
                  "author": "elyse-on-reddit",
                  "created": 1637980574,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}