{
  "sid": "r57i81",
  "link": "/r/college/comments/r57i81/am_i_overthinking_this/",
  "title:": "Am I overthinking this?",
  "text": "I'm applying to college for Anthropology, and I have to write a personal statement and an essay about why I want to go into Anthropology and what sort of career I'm hoping to get with it. There was no given word minimum or maximum, and I think because I really want this, I'm freezing up on it. I've read examples online, but every time I go to write anything, I just got blank. Any advice is helpful, thanks in advance!",
  "author": "CyphinAtSea",
  "created": 1638225031,
  "updated": 1638480578,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hmlbyai": {
      "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmlbyai/",
      "text": "Pretend you’re doing an in-person interview for your major, and you were just asked that question. Record yourself answering it out loud exactly as you would if you really were in an interview. Then use that recording as your outline",
      "author": "when-words-fail",
      "created": 1638227352,
      "upvotes": 2,
      "replies": {
        "hmlk9pi": {
          "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmlk9pi/",
          "text": "Thanks, I'll give it a try!",
          "author": "CyphinAtSea",
          "created": 1638231072,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmljdcj": {
      "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmljdcj/",
      "text": "> There was no given word minimum or maximum,\n\nWithout any additional instructions, I recommend you write no more than 1-2 pages.  Keep in mind that the admissions committee members might have to read dozens or hundreds of essays like this, and they will not thank you for writing 20 pages (they likely won't read it all, either).\n\nBasically, write enough so that your motivation, plans, and career objectives are clear, but resist the temptation to write down every single thought about anthropology that has ever come into your head, etc.\n\nGood luck.",
      "author": "ChemMJW",
      "created": 1638230663,
      "upvotes": 2,
      "replies": {
        "hmlk8lq": {
          "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmlk8lq/",
          "text": "Thanks, I appreciate it!",
          "author": "CyphinAtSea",
          "created": 1638231057,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmm7hz6": {
      "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmm7hz6/",
      "text": "LOL. This post has to be satire.\n\nIf you can't answer this yourself, and are not from a rich family, please stop attending college.",
      "author": "AsleepSoil7426",
      "created": 1638241619,
      "upvotes": -1,
      "replies": {
        "hmm927l": {
          "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmm927l/",
          "text": "You're right, I'm not from a rich family, you get a gold star for the day. Instead I joined the Navy to protect spoiled children like you. So go play with the other little boys and girls, the adults are talking right now.",
          "author": "CyphinAtSea",
          "created": 1638242328,
          "upvotes": 1,
          "replies": {
            "hmm9ax3": {
              "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmm9ax3/",
              "text": "\"Real adults\" can write an essay lmfao. TYFYS though, I'm glad you felt the need to bring up your service. And I appreciate you protecting me.",
              "author": "AsleepSoil7426",
              "created": 1638242438,
              "upvotes": 1,
              "replies": {
                "hmm9myp": {
                  "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmm9myp/",
                  "text": "Real adults ask for help when they need it. Children have to bring up the family bankroll in order to make themselves feel better.",
                  "author": "CyphinAtSea",
                  "created": 1638242586,
                  "upvotes": 1,
                  "replies": {
                    "hmm9sq3": {
                      "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmm9sq3/",
                      "text": "I brought up bankroll because if you want a degree in anthro, and you can't explain why or what you're going to do with it, you need to have money or be prepared to work at target.\n\nI'm glad you joined just for your GI tho buddy.",
                      "author": "AsleepSoil7426",
                      "created": 1638242658,
                      "upvotes": 1,
                      "replies": {
                        "hmmb6xm": {
                          "link": "/r/college/comments/r57i81/am_i_overthinking_this/hmmb6xm/",
                          "text": "Let me worry about how I'll fund my work, I just need the degree for credibility. And trust me, I'm not the first one to do it, I won't be the last, no shame in using the system that uses you.",
                          "author": "CyphinAtSea",
                          "created": 1638243298,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}