{
  "sid": "qumdpl",
  "link": "/r/college/comments/qumdpl/how_to_approach_and_ask_girls_out_on_dates_help/",
  "title:": "How to approach and ask girls out on dates help?",
  "text": "So I’m a freshman in college and I have never dated but would like to try and get myself out there. I’m in a business college and there are a lot of girls in classes and halls. Do you guys have any tips?\n\nAlso pardon the username I just am sick and tired of covid.",
  "author": "coronavirusisshit",
  "created": 1636999385,
  "updated": 1639860480,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hkr77e3": {
      "link": "/r/college/comments/qumdpl/how_to_approach_and_ask_girls_out_on_dates_help/hkr77e3/",
      "text": "Just walk up and talk to them like normal people except make it clear you’re interested in them, there’s no point in beating around the bush with your feelings be honest and vulnerable. Like Casanova said, “I do not conquer, I submit” it will be scary because a lot of people-myself included- will sometimes struggle with approach anxiety and some have it a lot worse than others so be mindful you might slip up and that’s ok and don’t expect the girls you want to just jump into your arms you sometimes have to play the long game. \n\nHere’s a little example I found and kept in my notes just to have an example of how simple and direct I should be.\n\n“Hey, I know this is random but thought you were hot/good looking/stunning and I had to say hi.” (Remember to relax and smile, no one likes the mysterious stone face bad boy.) (if she responds just continue and remember to be direct.) “are you single or doing anything this weekend?” (If she says she’s taken just leave if she says she’s single or not doing anything this week keep going) Cool, I’m [y/n] what’s yours? (Get her name and have a little small talk and end it) “Care if I get your number, we can go [insert something you want to do here.] \n\nThere you go short and straight to the point you don’t have to follow this word for word but it doesn’t hurt to have. \n\nGood luck!",
      "author": "hi_im_luke17",
      "created": 1637003866,
      "upvotes": 0,
      "replies": {
        "hkt9itq": {
          "link": "/r/college/comments/qumdpl/how_to_approach_and_ask_girls_out_on_dates_help/hkt9itq/",
          "text": "I’ve done this before and got called a creep but I guess I try again",
          "author": "coronavirusisshit",
          "created": 1637035419,
          "upvotes": 1,
          "replies": {
            "hkthjrq": {
              "link": "/r/college/comments/qumdpl/how_to_approach_and_ask_girls_out_on_dates_help/hkthjrq/",
              "text": "That’s the mindset to have man keep at it! And care if I ask why you got called a creep? Did you just walk up and ask her on a date or something?",
              "author": "hi_im_luke17",
              "created": 1637039756,
              "upvotes": 1,
              "replies": {
                "hm4ovta": {
                  "link": "/r/college/comments/qumdpl/how_to_approach_and_ask_girls_out_on_dates_help/hm4ovta/",
                  "text": "It’s probably cause I just went up and did just that but I only did it once and it kinda scared me. I guess I just gotta move onto the next one just like that.",
                  "author": "coronavirusisshit",
                  "created": 1637910425,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}