{
  "sid": "9hbtnj",
  "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/",
  "title:": "Early semester reminder: Stop having \"zero\" days",
  "text": "This borrows a quote from [ryans01](https://www.reddit.com/r/getdisciplined/comments/1q96b5/i_just_dont_care_about_myself/cdah4af/) but the idea has existed for much longer than that.\n\nYou're probably a couple weeks into the semester and you may be falling into the early semester trap. You find yourself in a period of time thinking \"Wow, I have no homework this weekend\" or \"Once I turn this in on Wednesday I'm free.\" \n\nIt's an illusion. In reality, you have more work to do; it's just not due until later.\n\nSpend your free days getting started on that work. Even if just for a few hours. Don't have any more days of non-productivity. And by working, I mean really working. Not just staring at a textbook to kill an hour or going to class like you should already be doing, but actually spending Friday making headway on an assignment that's not due until next Wednesday, or getting caught up in a class where you know you're behind.\n\nI give this advice for 3 reasons. \n\n\\#1, A lot of college students (including myself for many years) miss points on assignments because they underestimate how much time it will take to complete. That's the dumbest reason ever to lose points. You're just hurting yourself for no reason.\n\n\\#2, Most students' schedules have a natural ebb and flow: crazy amounts of stress before deadlines, and free time elsewhere. It's not balanced nor healthy. It's the reason some students can't take the pressure when it really builds up. Delegate your work more evenly and you'll still have the ability to take time off and relax, just with less stress hanging over your head.\n\n\\#3, It builds discipline. You have to teach yourself to work even when you don't want to. That's the difference between discipline and motivation. Motivation is nice, but it won't last you all year long. Discipline will. \n\nI hope this is read by at least one person who can apply this to their situation. It will change your grades, your time management skills, and your relationship with your work.",
  "author": null,
  "created": 1537413587,
  "over_18": false,
  "upvotes": 870,
  "upvote_ratio": 0.95,
  "comments": {
    "ea27riu": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/ea27riu/",
      "text": "MALE COLLEGE STUDENTS TAKE THIS SHORT SURVEY: \n\n[http://uwpsychology.qualtrics.com/jfe/form/SV\\_dhRYVuVT66TQfyJ](http://uwpsychology.qualtrics.com/jfe/form/SV_dhRYVuVT66TQfyJ)",
      "author": "alyssaandresen",
      "created": 1542664796,
      "upvotes": 1,
      "replies": {}
    },
    "e6bv7li": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6bv7li/",
      "text": "I just stay a full week ahead of everything. If I have a lab on Monday and the work is do next Monday, I do the work before I even get to the lab where we start it. Every Monday, Tuesday, and Wednesday has it's own classes that I just do the work that's due at the end of next week. Then, Thursday-Sunday is study time first, then just me time. Usually do a bunch of stuff with my dog, play video games, and enjoy life. ",
      "author": "zosomagik",
      "created": 1537465099,
      "upvotes": 1,
      "replies": {}
    },
    "e6behmb": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6behmb/",
      "text": "I counter this with another statement: It is okay to take some time off. If you hand in an assignment and you have the time, watch a movie, go swimming, go see your friends, take a nap, etc. ",
      "author": null,
      "created": 1537451222,
      "upvotes": 10,
      "replies": {}
    },
    "e6b3j06": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6b3j06/",
      "text": "That is usually what I try to do but sometimes taking care of one's mental health comes first. I usually take a day off every two weeks(on weekends I do a minimal amount of work) and end up getting pretty good grades and into grad school. ",
      "author": "SalmonellaSushi",
      "created": 1537435466,
      "upvotes": 5,
      "replies": {}
    },
    "e6azig1": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6azig1/",
      "text": "The way my classes works I turn in my last assignment on Wednesday. Next assignments are due following mon, tues, wedn. You bet you ass I'm not going to leave 3 physics and calc HWs till the last minute over the weekend. I'm already working on the assignment for next Monday by Wednesday,  next Tuesdays' on Thursday, etc...This allows me to actually enjoy the weekend, doing a light resuscitation on Sunday and be golden. Never underestimate the power of a weekend to make you do fuck all. ",
      "author": "shredadactyl",
      "created": 1537427046,
      "upvotes": 2,
      "replies": {}
    },
    "e6az29o": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6az29o/",
      "text": "Yep. I’m guilty of doing that.",
      "author": "favnh2011",
      "created": 1537426241,
      "upvotes": 4,
      "replies": {}
    },
    "e6axpss": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6axpss/",
      "text": "Just had a day where I did nothing, because I have nothing that’s due TOMORROW, but definitely had stuff I COULD do. Great point.",
      "author": "pm_ur_doubts",
      "created": 1537423901,
      "upvotes": 5,
      "replies": {}
    },
    "e6aw8rg": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6aw8rg/",
      "text": "A friend from middle school taught me the trick of doing your homework in school so you have none when you get home, now as a college student I do my homework either in class or at my internship in the free time there since i realistically only do homework at home when I have to! ",
      "author": "mxivme",
      "created": 1537421518,
      "upvotes": 43,
      "replies": {
        "e6azr7p": {
          "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6azr7p/",
          "text": "This works quite well. After my classes (if I didn't work) I go to my study place and do most if not all my hw I was assigned for that day. I might not always finish, but the amount I'd complete was way more then I'd finish at home. I've now been blessed with a job where I can hw at work so I work ft and never to hw at home. If I'm ever doing anything school related at home it's studying for a midterm/final. Separating school and home life is important for your sanity as a student and will actually improve your happiness index. Same is said for work/home life so it's good practice for \"real life\" when you graduate. That being said, god help us all. ",
          "author": "shredadactyl",
          "created": 1537427494,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "e6avt3y": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6avt3y/",
      "text": "I actually had the opposite problem. I worked so hard at getting assignments done and clearing my to do list that I had no time for anything else. Last week I realized that I could loosen up a bit on trying to do everything at once. I’m finding a balance in relaxing and doing work, but I will definitely keep your advice in mind. Thank you so much for sharing! ",
      "author": null,
      "created": 1537420874,
      "upvotes": 17,
      "replies": {}
    },
    "e6avrbe": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6avrbe/",
      "text": "Actually i just learned this the hard way. Not finishing my hw",
      "author": "Foreigner_LivinInUS",
      "created": 1537420799,
      "upvotes": 0,
      "replies": {}
    },
    "e6av30q": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6av30q/",
      "text": "Due tomorrow do tomorrow as I always say ",
      "author": "MrConbon",
      "created": 1537419876,
      "upvotes": 78,
      "replies": {
        "e6avmgu": {
          "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6avmgu/",
          "text": "The *due* date is for doing the work LOL",
          "author": "dreamsofaninsomniac",
          "created": 1537420615,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "e6aswgr": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6aswgr/",
      "text": "Yes! I decided to get a little ahead last week and I'm so glad I did. This week I'm moving into an apartment in the middle of the week and I have had no time to study. Thank god all I have to do is go to class for now and not have to stress too bad next week. ",
      "author": "Sham129",
      "created": 1537417034,
      "upvotes": 1,
      "replies": {}
    },
    "e6asrwx": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6asrwx/",
      "text": "I will say I’d agree with this *if* you’re the kind of student that stresses out. In college, I always had my free day where I did pretty much nothing. It was a great refresher before getting back to it the next week. I never had any problem with my workload while taking a day off a week. ",
      "author": null,
      "created": 1537416880,
      "upvotes": 33,
      "replies": {}
    },
    "e6asrtu": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6asrtu/",
      "text": "This is a great point. Even if you need a break from school work, and that is understandable especially after a round of exams, I would still strive to do something productive every day such as working out, cleaning your place, going grocery shopping, etc. ",
      "author": "saget84",
      "created": 1537416877,
      "upvotes": 8,
      "replies": {}
    },
    "e6asij5": {
      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6asij5/",
      "text": "Counterpoint:\n\nIt's good to relax sometimes. I'm not saying to do every assignment last minute--but taking a free day here and there, leaving your Saturdays open, isn't going to do any harm. Maybe this works for you, but me having something to do literally every day wears me down sooo fast. That's where I'm at now, and I wish I had a day once a week with no class or homework to unwind.\n\nI agree with the overall message--but spending Friday working on an assignment that won't be due for days, spending /hours/ on it, I don't really agree with. It's best to go out and have some fun in that instance, or chill at home. Then you can work on it Saturday or Sunday.",
      "author": "-Knockabout",
      "created": 1537416558,
      "upvotes": 471,
      "replies": {
        "e6asqvr": {
          "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6asqvr/",
          "text": "In my undergrad, there were so many due dates and tests that overlapped that whenever they passed I just took a break from school for a bit. It also helped me mentally to tell myself that I will have some time to relax and de-stress after those dates.",
          "author": "CChilli",
          "created": 1537416844,
          "upvotes": 119,
          "replies": {
            "e6at27y": {
              "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6at27y/",
              "text": "[deleted]",
              "author": null,
              "created": 1537417233,
              "upvotes": 66,
              "replies": {
                "e6benh6": {
                  "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6benh6/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1537451374,
                  "upvotes": 21,
                  "replies": {
                    "e6ldj08": {
                      "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6ldj08/",
                      "text": "Maybe I rather contain the stress in one day than spread it out over multiple days.",
                      "author": "jcoguy33",
                      "created": 1537849639,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "e6at5tc": {
          "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6at5tc/",
          "text": "I definitely agree with this. I used to do a mix of both when I was in college. If a certain paper was due on Monday and then my next deadline was only, say, the following Monday, I wouldn't do anything on that day and I'd start tackling my next paper or whatever on Tuesday. If the deadlines were too close together this wasn't feasible of course, but if they weren't I tried to give myself an off day here and there. It was important to me to have something to look forward, almost like a reward, after working hard on something.",
          "author": "JumpingPoppy",
          "created": 1537417361,
          "upvotes": 23,
          "replies": {
            "e6bn9b7": {
              "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6bn9b7/",
              "text": "Yeah, rewarding yourself is very important. Of course, sometimes you'll get stuck in a cycle where everything is due a day or two from today, but I think the break day is even more important then, wherever it comes by.",
              "author": "-Knockabout",
              "created": 1537458668,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "e6d4ysl": {
          "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6d4ysl/",
          "text": "I agree with you. I tried the whole work hard every single day method and it completely burned me out. This time around I'm letting myself take a day here and there to just relax as long as my homework for the near future is done and it's made a huge difference in my morale. I'm actually excited to do my reading and assignments because I know that once it's all done I'm free to do things I enjoy like spending time with my friends or taking my dogs out to the dog park. This has been my most productive semester so far and I have my more relaxed mindset to thank for it. \n\nIf you're the type of person who needs that daily work to keep motivated that's completely fine, but like everything take it with a grain of salt and do what works for you. ",
          "author": "queenkelevra",
          "created": 1537508855,
          "upvotes": 5,
          "replies": {}
        },
        "e6c1m1a": {
          "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6c1m1a/",
          "text": "I think it’s a good idea to give yourself a free day where you don’t have to do anything in particular. A few hours on an assignment that’s not due for another week just seems pretty extreme, but then again I’m a PT student ",
          "author": "puffy-jacket",
          "created": 1537470410,
          "upvotes": 2,
          "replies": {
            "e6cnq5u": {
              "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6cnq5u/",
              "text": "I'm a Comp Sci student, same as OP, so!",
              "author": "-Knockabout",
              "created": 1537490374,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "e6avmow": {
          "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6avmow/",
          "text": "I feel you, if that works for you and your schedule and you can really promise yourself it's a Friday-only thing on occasion, then you can try it.\n\nThe one thing I don't like about \"cheat days\" of any type is it breaks habit. Deviating from a routine can be a slippery slope. Skip a workout once, and you might not go back to the gym for a year. Tell yourself \"I can just do it Saturday\" and you might say that on Saturday about Sunday. In my experiences, one thing leads to another and I find myself reverting back to my old ways.\n\nEven just a couple hours of work on Friday morning is doing something productive, it leaves you the whole evening to unwind, and most importantly it reminds you that your work is important enough to deserve daily attention. And when you go to bed Friday night, are you going to be upset that you only got 9 hours of free time instead of 12, or are you going to be happy about the 3 hours you spent working? That's my take anyway. ",
          "author": null,
          "created": 1537420623,
          "upvotes": 6,
          "replies": {
            "e6awfgt": {
              "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6awfgt/",
              "text": "Alternatively, leave yourself some menial tasks to do on your \"off day\". \n\nI always have a backlog of emails to deal with, plus I can spend a few hours just planning out future degrees or future classes, organizing my schedule for the next few weeks, doing meal-prep, washing clothes and cleaning the house, looking for research opportunities, reading up on my area of research, or attending to my website/twitter/whatever. \n\nThose things are all kinda important for a lot of different reasons. \n\nI think you've got your idea of a \"zero day\" wrong. A day off from work is not a zero day. A day where you're not doing homework is not a zero day. The important thing is to be doing something purposeful every day of the week, whether that's studying, cleaning your room, going shopping, or just catching up on something. By keeping my life organized, I *am* helping my studies. ",
              "author": "NoxiousQuadrumvirate",
              "created": 1537421797,
              "upvotes": 27,
              "replies": {}
            },
            "e6bn6ot": {
              "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6bn6ot/",
              "text": "Yeah, I get you. I think my schedule plays a part in this, though. Typically I don't get home until around 3 hours before I have to go to bed, so working on homework for a couple hours would take up all of that time, haha. And that's not counting the time in between classes where I am...also working on homework.",
              "author": "-Knockabout",
              "created": 1537458610,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "e6cx6gd": {
          "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6cx6gd/",
          "text": "This. Currently doing my heaviest course load combined with my first time working during school and I'm burning out without break days. Sure, i get a few hours here and there, but it's not the same when you know you have to get right back at it later. Even one day every two weeks can do wonders to help give your brain a break.\n\nOf course, it also depends on the type of student you are. I'm the type that will work on things as soon as they're assigned instead of wait, so I'm more of a workaholic than a procrastinator. OPs advise is helpful for people who tend to have a few *too* many zero days.",
          "author": "CoriCelesti",
          "created": 1537499288,
          "upvotes": 1,
          "replies": {
            "e6cxfba": {
              "link": "/r/college/comments/9hbtnj/early_semester_reminder_stop_having_zero_days/e6cxfba/",
              "text": "I suppose so...I'm a terrible procrastinator myself, but it's often stress-induced. So the less stressed I am, the more work I do. I guess it depends on the person.",
              "author": "-Knockabout",
              "created": 1537499537,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634050309
}