{
  "sid": "pr53tj",
  "link": "/r/college/comments/pr53tj/does_the_prospect_of_settling_down_in_a_job_after/",
  "title:": "Does the prospect of settling down in a job after college scare you'll?",
  "text": "I am a college student currently in my last year. In the first few years of college, all I cared about was that I need a good job after college and then I'll be fine. But now, the thought of taking a job makes me feel like I will be giving up my freedom. Does anyone feel this way? Is this really the case? If it is, then what other options will we have !!",
  "author": "sareKatniss897",
  "created": 1632045423,
  "over_18": false,
  "upvotes": 10,
  "upvote_ratio": 1.0,
  "comments": {
    "hdi9mlr": {
      "link": "/r/college/comments/pr53tj/does_the_prospect_of_settling_down_in_a_job_after/hdi9mlr/",
      "text": "[removed]",
      "author": null,
      "created": 1632083127,
      "upvotes": 1,
      "replies": {}
    },
    "hdhj5tj": {
      "link": "/r/college/comments/pr53tj/does_the_prospect_of_settling_down_in_a_job_after/hdhj5tj/",
      "text": "Just know that you have more time than you think to figure things out",
      "author": "Saint_Bo_Dallas",
      "created": 1632072757,
      "upvotes": 1,
      "replies": {}
    },
    "hdhakkg": {
      "link": "/r/college/comments/pr53tj/does_the_prospect_of_settling_down_in_a_job_after/hdhakkg/",
      "text": "As a graduate, I can tell you having a job isn’t all you need to worry about. I poured all my energy into finding a decent paying job somewhat connected to my field and I managed to do that. Still not happy. As a young adult entering the real world, people also expect you to have a plan, know what you want out of the future, have a good social life, be “young and free” but also responsible and smart, etc…. It’s exhausting. None of my close friends are happy either. I’d love to fast forward to the part where I have it all figured out. \n\nI don’t mean to scare you, but my point is a job is not everything (unless you get your dream job straight out school maybe, which is rare). So don’t stress too much about it and think about what other things you want from life. My tunnel vision about finding a job has helped me financially, but not much with anything else.",
      "author": "ludgatedwyer500",
      "created": 1632069318,
      "upvotes": 2,
      "replies": {}
    },
    "hdg4bgv": {
      "link": "/r/college/comments/pr53tj/does_the_prospect_of_settling_down_in_a_job_after/hdg4bgv/",
      "text": "Yes, IMO options are limited to: fall in like 90% people and just get a job, take huge risks and try to make it big, somehow start a global change in the way we think about work vs free time or just go permanently off the grid. Currently finishing up a bachelors next semester and am going to do a graduate program cuz I don’t wanna give up this life for something that I see as way worse and much longer term. I’m not even interested in my major on my 4th change and just ended up on anthro cuz Indiana jones is bad ass.",
      "author": "S7nse",
      "created": 1632047260,
      "upvotes": 1,
      "replies": {}
    },
    "hdg2twy": {
      "link": "/r/college/comments/pr53tj/does_the_prospect_of_settling_down_in_a_job_after/hdg2twy/",
      "text": "I'm in the same boat as you! I've worked in retail for a few months before leaving so I have experience working but it doesn't help stop this dread I have. I looked through a bunch of job postings on Handshake and I keep wondering if I can even do this job. The best I can do is just push through.",
      "author": "Gahhh2018",
      "created": 1632046066,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634050608
}