{
  "sid": "rgbo6v",
  "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/",
  "title:": "How common is corruption in American universities?",
  "text": "Admission committee receiving/extorting bribes for admission? Examiners receiving/extorting bribes for grades? Does that ever happen? The fact that you don'е have a unified exam like Gaokao would suggest that there is plenty of opportunity for the admission teem members to make money this way.",
  "author": "CleaverIam",
  "created": 1639500641,
  "updated": 1639516010,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hoj91ie": {
      "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hoj91ie/",
      "text": "It happens. Operation Varsity Blues famously involved a number of rich people bribing coaches or admission reps to say they're children had higher standardized test scores then they did or were sport recruits for sports they didn't play (and then getting caught and arrested). It presumably happens somewhat more often accounting for cases where it doesn't get caught.\n\nAdmission decisions are often reviewed by multiple people and a student will take many classes during college. The risk of trying to bribe people is as soon as you hit somebody who you can't buy (or even can't buy with the money you're offering) you can end up in a lot of trouble, certainly denied admission and possibly finding yourself at risk of criminal charges depending on how successfully and seriously you've crossed the line.",
      "author": "Melodic_Echidna",
      "created": 1639502968,
      "upvotes": 3,
      "replies": {
        "hojdlv2": {
          "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojdlv2/",
          "text": "\"It presumably happens somewhat more often accounting for cases where it doesn't get caught.\"\n\nThe people in the Varsity Blues operation were terrible at it IMO. It was like they learned from bad crime movies or something. What you would expect from celebrities with no practical skills. Their way of going about it created more exposure than they would have had if they were smarter about planning it. Lots of written emails detailing their plans and commiting more fraud than was necessary for admissions. Just very loud.\n\nCriminally this is fraud-centric. It isn't so much the bribery (\"bribing\" a private college is different legally speaking than bribing a police officer or government worker), it's defrauding the university by misrepresenting the applicant.",
          "author": "darniforgotmypwd",
          "created": 1639504739,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoj99mu": {
      "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hoj99mu/",
      "text": "We have the SAT and ACT (which are slowly fading away for several reasons), but at a broader level, there are so many universities, many of which will take just about anyone, that bribery to get in is irrelevant (I can’t speak for the Ivies and such, though; that’s a different game altogether).\n\nYou’d have a very difficult time finding a professor who would take a bribe of any kind. The penalties for that are very steep, and it would be a permanent stain on their reputation.",
      "author": "PhDapper",
      "created": 1639503056,
      "upvotes": 2,
      "replies": {
        "hojei05": {
          "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojei05/",
          "text": "Is higher education not at all selective in the US? Like any idiot with below average IQ is able to get a place at almost any university?",
          "author": "CleaverIam",
          "created": 1639505086,
          "upvotes": 1,
          "replies": {
            "hojf25t": {
              "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojf25t/",
              "text": "I wouldn’t go that far, but there are a fair number of universities with very low admissions requirements. For them, it’s become more about enrollment and keeping the money flowing from that rather than academic rigor. The rigorous schools are still rigorous, but there’s an expanding base of institutions that are anything but.",
              "author": "PhDapper",
              "created": 1639505308,
              "upvotes": 1,
              "replies": {
                "hojmbsy": {
                  "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojmbsy/",
                  "text": "Are the degrees from these universities with very low admission requirements worth anything? Like is it any good trying to get an engineering diploma from one of them? Would the employees take graduated from not-at-all-selective schools seriously?",
                  "author": "CleaverIam",
                  "created": 1639508164,
                  "upvotes": 1,
                  "replies": {
                    "hojugpm": {
                      "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojugpm/",
                      "text": "Just like there are exclusive colleges, there are exclusive employers. I interned for a Fortune 50 company and they only recruited from 8 schools in the entire US (plus hiring the kids of any current employees. Nepotism is real).\n\nBut there are plenty of jobs that just need you to have your degree in the right field and they'll teach you the rest on the job. There will be a pay difference if course, but you'll be employed.",
                      "author": "Thelton26",
                      "created": 1639511351,
                      "upvotes": 1,
                      "replies": {
                        "hok124x": {
                          "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hok124x/",
                          "text": "Ok, this is interesting. You seem to have a booming job market then...",
                          "author": "CleaverIam",
                          "created": 1639513926,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "hojw9rg": {
                      "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojw9rg/",
                      "text": "> Like is it any good trying to get an engineering diploma from one of them?\n\nFor something like engineering, there's usually a \"weed out\" process where (particularly at schools with low admissions standards) a large portion of students fail out during their first year. By the time the cohort graduates usually only the more competent students are left, so the degree is still worth something, even though it's from a lower-tier school.\n\nThere are other degrees (mostly in the humanities or the like) where this \"weed-out\" process never really occurs, and those degrees tend not to have much value in the job market.",
                      "author": "HumanDrinkingTea",
                      "created": 1639512051,
                      "upvotes": 1,
                      "replies": {
                        "hok1frm": {
                          "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hok1frm/",
                          "text": "> there's usually a \"weed out\" process where (particularly at schools with low admissions standards\n\nOk, but this again raises the question why there is no corruption. Or why anyone is at all bothered to weed out anyone. If there are lots of students all wanting to get an engineering degree, wouldn't it be tempting to accept bribes (directly or indirectly) from students who want the degree?",
                          "author": "CleaverIam",
                          "created": 1639514078,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hojfabw": {
              "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojfabw/",
              "text": "Google how many colleges exist in the U.S. There are so many options that there’s really no need to bribe your way in (unless you’re talking about Ivies)",
              "author": "BrownRiceBandit",
              "created": 1639505397,
              "upvotes": 1,
              "replies": {
                "hojmgog": {
                  "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojmgog/",
                  "text": "So, except for Ivies and a couple of other top universities you could go to any college you want as long as you are willing to pay?",
                  "author": "CleaverIam",
                  "created": 1639508218,
                  "upvotes": 1,
                  "replies": {
                    "hojvjia": {
                      "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojvjia/",
                      "text": "Private schools (even non Ivies) tend to be pretty exclusive. As for public schools, public schools ranked in the top 100 have average SAT of 1300/1600, ACT of 29/36, and 3.75 GPA and accept 53% of students. I'm not sure if that gives you a comparable estimate with your experience, but it's not that you can just go anywhere. But they're also far from exclusive.",
                      "author": "Thelton26",
                      "created": 1639511769,
                      "upvotes": 1,
                      "replies": {
                        "hojws6t": {
                          "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojws6t/",
                          "text": "> Private schools (even non Ivies) tend to be pretty exclusive.\n\nThis isn't true. There are piles of private schools that you've never heard of that take just about anyone. There are, of course, a number of exclusive private schools, but their numbers pale in comparison to the predatory low-tier private schools (and I'm not talking just about for-profit schools either).",
                          "author": "HumanDrinkingTea",
                          "created": 1639512252,
                          "upvotes": 1,
                          "replies": {
                            "hojyuf1": {
                              "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojyuf1/",
                              "text": "True. I figured since it seemed like he wasn't from the US, I thought he may have been literal about the \"Ivies plus a handful of others\" when in reality there are probably at least 40 or 50 private schools out there who still average 1400+ SAT, 30+ ACT, and near 4.0 admissions standards.\n\nBut you're right that's only a drop in the bucket when it comes to the entire university system in the US so I wasn't the most representative.",
                              "author": "Thelton26",
                              "created": 1639513057,
                              "upvotes": 1,
                              "replies": {
                                "hok3cr3": {
                                  "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hok3cr3/",
                                  "text": "Are private schools considered more selective than state ones? This is very weird. Where I live the situation is the opposite: private schools only care about collecting money, so they would admit anyone who is willing to pay, while the state schools have an obligation to the state to only spend the state's money on those who are worthy of having it spent on them; those who would benefit the society as a result of that money having been spent on them.",
                                  "author": "CleaverIam",
                                  "created": 1639514843,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hojvwe4": {
          "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hojvwe4/",
          "text": "Why do you think the SAT and ACT are falling out of favor and do you agree?\n\nI analyzed a data set for a class and SAT was the strongest predictor of 4 yr grad rate and overall grad rate. Seems like a decent predictor for students and schools to keep using.",
          "author": "Thelton26",
          "created": 1639511907,
          "upvotes": 1,
          "replies": {
            "hok1mey": {
              "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hok1mey/",
              "text": "How do these SAT and ACT exams work? Are they like British A-levels? Do you take different tests depending on subject?",
              "author": "CleaverIam",
              "created": 1639514150,
              "upvotes": 1,
              "replies": {
                "hok5h0h": {
                  "link": "/r/college/comments/rgbo6v/how_common_is_corruption_in_american_universities/hok5h0h/",
                  "text": "There are specific SAT subject tests you can take, but where I was from, no one really took them. The ACT has 4 sections, English, Math, Science, and Reading, all scored out of 36. The SAT is 3 subjects if 800 each, reading, math, and writing, (though usually the 1600 Math/Reading is what's used). The tests are about 4-5 hours long with some breaks.",
                  "author": "Thelton26",
                  "created": 1639515712,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}