{
  "sid": "r07z8i",
  "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/",
  "title:": "I went back home for thanksgiving and my family is not doing ok",
  "text": "I need some advice. My parents look like their health is dwindling and they have a lot to worry about. They are pulling out a huge mortgage, which means they can’t pay for my college expenses. They used to rely on me when I was back home for most stuff since my mom can’t drive and my dad does basically everything. Im in California, so I can transfer to a community college and transfer to a UC afterwards. I just keep thinking about it, should I stay behind and go to cc to help my parents ?",
  "author": "Fun_Holiday_1148",
  "created": 1637653263,
  "updated": 1637688946,
  "over_18": false,
  "upvotes": 40,
  "upvote_ratio": 0.98,
  "comments": {
    "hlqu2nd": {
      "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlqu2nd/",
      "text": " The fact that you’re even asking this means you’re a good person, OP. We don’t know your specific situation. \n\nCan you apply for scholarship? There are also a few universities with full need-based aid.\n\nAlso, I believe Questbridge and collegeboard offer college apps for free for those with financial need.\n\nStay strong OP! You’re a good person and whatever choice you make will be the right one.",
      "author": "Ill_Friendship_4767",
      "created": 1637654146,
      "upvotes": 34,
      "replies": {}
    },
    "hlri248": {
      "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlri248/",
      "text": "As for OP only you can answer that for yourself. Families are so different in terms of cohesion and closeness. What the other commenter said if certainly valid, at the same time with my parents,. If push comes to shove for something important that they can't handle on their own or have sorted in some other way such that it either falls on me or doesnt happen then I'ma be there for my parents 100% .",
      "author": "theashesstir",
      "created": 1637673049,
      "upvotes": 10,
      "replies": {}
    },
    "hlr8szu": {
      "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlr8szu/",
      "text": "Dude could you maybe get a scholarship and just a curiosity with what your majors could you maybe switch to online classes for a bit if you could do that academically if you need to be home so you don't have to change schools? I'm sorry your family is going through this good luck dude sorry it couldn't be more helpful",
      "author": "pygmypuffonacid",
      "created": 1637666899,
      "upvotes": 5,
      "replies": {}
    },
    "hlrlean": {
      "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlrlean/",
      "text": "I kinda feel you should go to CC. It’s one of the few choices that gives you flexibility with helping family while also furthering your academics",
      "author": "Bosschopper",
      "created": 1637674867,
      "upvotes": 5,
      "replies": {
        "hlsbrm1": {
          "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlsbrm1/",
          "text": "Disagree. Op needs to think about themselves and their future and not sacrifice to try and help for parents with money issues.",
          "author": "ActualSeven",
          "created": 1637686347,
          "upvotes": 1,
          "replies": {
            "hlsc5h6": {
              "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlsc5h6/",
              "text": "OP *may* not be able to pay for college, since they said that their parents are dealing with a mortgage. CC may be cheaper and cost-effective for them.",
              "author": "Bosschopper",
              "created": 1637686496,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlrdho8": {
      "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlrdho8/",
      "text": "It's not your job to take care of your parents, especially in the case that they're making unsound financial decisions. Granted, I don't really know their situation. \n\nI've adopted the thought process that I don't owe my parents anything. It's true. I didn't choose to be here, they chose to bring me here. It was their idea to raise a child altogether. For me to owe them anything because my dad decided to keep it in is crazy. \n\nBe careful spending your life tending to others who can't help themselves. Your parents are adults. They need to figure out how to fix their situation and not drag you into it. That's completely unfair. Having a child to use their labor to satisfy your needs is... unsavory. \n\nYou need to focus on yourself. If they can't pay your college expenses, you should find a way. I don't think it's up to you to save your parents from their own doing. I really think it's a bad idea to change your life to cater to theirs, even if they do need help. These are things that grown adults should be prepared for. \n\nUnfortunately, they aren't going to stop aging. I'm 32, my parents are mid 60's and watching them get older has been interesting. I live 300 miles away and don't see them too often. When I do, I can always see the differences between the last time I saw them. They're getting older. It is what it is. They have their own struggles too but that's their life, not mine.",
      "author": "Awkward_Mail_2786",
      "created": 1637670279,
      "upvotes": 4,
      "replies": {
        "hlrdiah": {
          "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlrdiah/",
          "text": "300 miles is the length of approximately 2111994.75 'Wooden Rice Paddle Versatile Serving Spoons' laid lengthwise.",
          "author": "useles-converter-bot",
          "created": 1637670290,
          "upvotes": 5,
          "replies": {
            "hlrhh37": {
              "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlrhh37/",
              "text": "Good bot",
              "author": "theashesstir",
              "created": 1637672713,
              "upvotes": 1,
              "replies": {
                "hlrhhfn": {
                  "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlrhhfn/",
                  "text": "Thanks!",
                  "author": "useles-converter-bot",
                  "created": 1637672719,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hls6og3": {
          "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hls6og3/",
          "text": "I second this. They made their bed. I see a lot of people pulling their hair out trying to escape parents that are dry downing and holding them back. It sounds like your relationship, despite the worry is still healthy. I would focus on getting through school at the top and encouraging them to make some sacrifices that will ease their own burden.",
          "author": "SemanticBattle",
          "created": 1637684316,
          "upvotes": 1,
          "replies": {}
        },
        "hlrdim1": {
          "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlrdim1/",
          "text": "300 miles is 482.8 km",
          "author": "converter-bot",
          "created": 1637670297,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hls3k3o": {
      "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hls3k3o/",
      "text": "Well maybe. What would you be leaving behind? Do you have important things are you right now? You have attachments?\nIf your parents were paying for your college then they didn't really have to do that. So they probably struggled to help you out and in my opinion if they were good parents and they didn't abused you and I think the right thing to do is help them out.",
      "author": "tingreezy",
      "created": 1637683041,
      "upvotes": 1,
      "replies": {}
    },
    "hlsd3hw": {
      "link": "/r/college/comments/r07z8i/i_went_back_home_for_thanksgiving_and_my_family/hlsd3hw/",
      "text": "don’t sacrifice your future, but if your family needs you maybe transfer to a local college. \n\nif your mom could work at home she should, if she’s not pulling her weight you should not pick up the slack, you are their child. i know all families are different, but don’t let them get in the way of your path",
      "author": "4eggy",
      "created": 1637686864,
      "upvotes": 1,
      "replies": {}
    }
  }
}