{
  "sid": "r0z3tm",
  "link": "/r/college/comments/r0z3tm/is_there_a_similar_web_site_like_turnitin/",
  "title:": "Is there a similar web site like turnitin?",
  "text": "I certain that I didn't copy every single word, however, I used a paraphraser. I cited every single sentence or paragraph that I paraphrased (which is almost every thing). It is 20 pages long. So I wanted to make sure that I wouldn't be accused for plagiarism. Do you guys know a website? It doesn't really matter if it costs cause it is my final research paper.",
  "author": "MagazineVivid",
  "created": 1637737604,
  "updated": 1638207389,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hlvofn4": {
      "link": "/r/college/comments/r0z3tm/is_there_a_similar_web_site_like_turnitin/hlvofn4/",
      "text": "I'm sorry, this is probably not what you want to hear but don't use a paraphraser then ask for a plagiarism site. It's not a good look, especially on a final research paper. You're basically taking a shortcut which is in the same caliber as plagiarism.",
      "author": "vessva11",
      "created": 1637743065,
      "upvotes": 4,
      "replies": {
        "hlvs0y9": {
          "link": "/r/college/comments/r0z3tm/is_there_a_similar_web_site_like_turnitin/hlvs0y9/",
          "text": "Thank you for your honest response! I am aware that it wouldn't look good and next time I wouldn't use this shortcut anymore cause it isn't really good. It sounds really not good but as long my teacher doesn't know it is fine I guess. Also I cited everything that I wrote down.",
          "author": "MagazineVivid",
          "created": 1637746070,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlwbkqp": {
      "link": "/r/college/comments/r0z3tm/is_there_a_similar_web_site_like_turnitin/hlwbkqp/",
      "text": "I use the paraphraser sometimes also, it sometimes help put a sentence into better wording for me, but Chegg has cite machine I believe, and it has a plagiarism checker, just use the free trial. Or look for other plagiarism apps that lets you use a free trial , good luck",
      "author": "UchihaClan_Fav",
      "created": 1637760172,
      "upvotes": 1,
      "replies": {
        "hm0evc2": {
          "link": "/r/college/comments/r0z3tm/is_there_a_similar_web_site_like_turnitin/hm0evc2/",
          "text": "Thank you! So citing a paraphrased sentence wouldn't be considered as plagiarism, right?",
          "author": "MagazineVivid",
          "created": 1637826556,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}