{
  "sid": "qk5oho",
  "link": "/r/college/comments/qk5oho/am_i_screwed_if_i_withdraw_pls_help/",
  "title:": "Am i screwed if i withdraw? pls help",
  "text": "hey guys, \ncurrently a freshman cs major who applied for a change to a dif major, just waiting for it to get approved hopefully in the next few days. \n\ni am taking 13 credit hours and 12 is the minimum to be a full time student. there is a programming class + lab i want to withdraw from because i think it will bring down my gpa significantly and it’s causing me a ton of stress because i hate cs and it’s very hard for me. this will bring me to 9 credit hours. \n\ni will be applying to transfer to a different university at the end of this semester (for admission in fall 2022). does me being a student with only 9 credit hours for first sem + a W on my transcript affect my chances? i will be applying for a dif major as this one isn’t a good fit. also the class is a cs class so it isn’t a good fit but i really just don’t want to do anything to mess up my chances of getting in anywhere. \n\n i could really use some advice. thanks.",
  "author": "akh_suna",
  "created": 1635738270,
  "updated": 1635779381,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hiui45t": {
      "link": "/r/college/comments/qk5oho/am_i_screwed_if_i_withdraw_pls_help/hiui45t/",
      "text": "You should be more worried about your financial aid. Do any of your scholarships or other financial aid require you to maintain a certain level of enrollment?",
      "author": "SouthernRhubarb",
      "created": 1635738626,
      "upvotes": 1,
      "replies": {
        "hiui8gs": {
          "link": "/r/college/comments/qk5oho/am_i_screwed_if_i_withdraw_pls_help/hiui8gs/",
          "text": "i currently go to a state school and commute from home. i didn’t get any scholarships or aid.",
          "author": "akh_suna",
          "created": 1635738696,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiuq7j2": {
      "link": "/r/college/comments/qk5oho/am_i_screwed_if_i_withdraw_pls_help/hiuq7j2/",
      "text": "Not sure how it’ll impact you going from a university to a university but from CC to university it’s not a huge deal to have Ws. They usually don’t care about units.",
      "author": "kdrdr3amz",
      "created": 1635744019,
      "upvotes": 1,
      "replies": {}
    }
  }
}