{
  "sid": "qu5oka",
  "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/",
  "title:": "What would you do if you saw a student struggling in a class?",
  "text": "Would you rather help them cheat just so they can scrape by with a C and eventually graduate. Or let them fail the class and possibly drop out of college.",
  "author": "Ph03n1x_5",
  "created": 1636942771,
  "updated": 1637181652,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.43,
  "comments": {
    "hko6thj": {
      "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hko6thj/",
      "text": "Neither. Cheating isn't helpful in the long run for the other person and get both people into trouble. Besides, college students are adults; their success/failure is their own responsibility, and there are *so many* resources for struggling students.\n\n\nIf someone in my class is struggling and they ask for ***actual help,*** I'm completely on board with helping. I'll try to explain concepts and assignments, read people's drafts, point them to resources, hell I'll even talk to a prof with them if I know them and they're nervous. I'm in a small program and want to see folks do well, and I *know* they're capable of that. But cheating is where I draw a line.",
      "author": "torgoboi",
      "created": 1636943768,
      "upvotes": 3,
      "replies": {
        "hkoisuc": {
          "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hkoisuc/",
          "text": "Even if the person is so far behind in education that they cannot understand any form of tutoring or \"actual help\"?",
          "author": "Ph03n1x_5",
          "created": 1636949595,
          "upvotes": 0,
          "replies": {
            "hkolkcc": {
              "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hkolkcc/",
              "text": "I can't imagine anyone being that far behind. If they are, how is cheating going to help? They'll just get further and further behind. When they enter the workforce, their qualifications won't be much help, because the degree is representative of a skill set and assumed baseline of competence that they won't develop because they've relied on someone else.\n\n\nIn cases like this, I'd recommend either looking into remedial classes, looking into a major change, or looking into the viable college alternatives.",
              "author": "torgoboi",
              "created": 1636951093,
              "upvotes": 0,
              "replies": {
                "hkolv41": {
                  "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hkolv41/",
                  "text": "Maybe because college classes and the workforce don't overlap. Sure there's some things that can give you \"extra credit\" in the workforce, but most careers require on the job training.",
                  "author": "Ph03n1x_5",
                  "created": 1636951260,
                  "upvotes": -1,
                  "replies": {
                    "hkorqrt": {
                      "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hkorqrt/",
                      "text": "The material itself may not always overlap, but the baseline skills (ie, writing, communication, critical thinking, ability to learn from feedback) often do. \n\n\nBesides, I'm willing to bet that someone who's cheating to avoid failing out (and from experience, it's taking more than one or two lousy grades to fail out), that's likely a larger issue that's going to translate into a workplace. If you're not willing to spend the time to learn to do something required of you, for example, why should I believe you'll do that at work? If you want to take credit for someone else's work instead of doing your own, why the hell would I want to work with you on a project team where I'm forced to pull your weight for work you're *paid* to do?",
                      "author": "torgoboi",
                      "created": 1636954761,
                      "upvotes": 0,
                      "replies": {
                        "hkq3e00": {
                          "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hkq3e00/",
                          "text": "You're just assuming that someone that struggles in college will be unable to function in the workplace with no proof whatsoever. I would say the most prominent skill learned in college is the ability to memorize questions for a test. Almost no job will put you in a test environment, so that skill is essentially useless for the workplace. And as far as the other skills like critical thinking and learning from feedback can both be learned outside of school.",
                          "author": "Ph03n1x_5",
                          "created": 1636987665,
                          "upvotes": 0,
                          "replies": {
                            "hkq96dk": {
                              "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hkq96dk/",
                              "text": "That isn't what I'm assuming at all. *Nearly everyone* struggles at some point in college, and if you read my original comment, I clearly stated that I am willing to help folks out and to point them to other resources literally designed to aid struggling students. I absolutely want students to succeed.\n\n\nThat's entirely different from students who cheat instead of taking the extra time and effort to learn. If instead of learning to adjust to new environments, you jump to having someone else do the work for you, then yeah, I don't see you having the skills or ethics to be a good worker.\n\n\nIf you can learn the skills outside of school, then you shouldn't have problems applying them to an academic environment. If you put half the effort into your coursework that you put into justifying academic dishonesty, you'd be surprised what you can do. I say that having pushed through some pretty significant struggles myself, and having watched friends do the same.",
                              "author": "torgoboi",
                              "created": 1636990236,
                              "upvotes": 1,
                              "replies": {
                                "hkqbx39": {
                                  "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hkqbx39/",
                                  "text": "I understand what you're saying, but I'm talking about an unusual scenario. Let's say Bob is a college student who barely graduated high school (not his fault aka bad teachers) since he lacks this foundational knowledge normally learned in high school he is now struggling in college. All of Bob's professors expect him to already know this stuff despite that not being the case. Bob makes time to go to tutoring, but all the tutors just keep regurgitating the same information the professor is saying instead of catching him up. Bob considers going to an adult education program to catch up, but is declined admission because he already possess a high school diploma. Bob even makes time to go talk to all his professors during office hours, and they keep telling him to go to tutoring for help; which he has already tried with no success. Bob really wants to get a college degree but nobody will help him with his lack of foundational knowledge. What should Bob do?",
                                  "author": "Ph03n1x_5",
                                  "created": 1636991392,
                                  "upvotes": 1,
                                  "replies": {
                                    "hkqe2fm": {
                                      "link": "/r/college/comments/qu5oka/what_would_you_do_if_you_saw_a_student_struggling/hkqe2fm/",
                                      "text": "If tutoring (tried with multiple tutors, and not just one) aren't helping Bob, he should enroll in some courses to catch him up. If that's expensive in college and he can't do an adult education program, community colleges generally have courses designed for students who don't have the background for university level courses.\n\n\nIf that doesn't work, I would question Bob's preference for getting a degree. If the degree is something that needs related skill sets (ie, engineering or comp sci, that kind of thing) then getting a degree by cheating will not prepare him to work. If he wants an entry level job, there may be other options -- apprenticeships, trades, certifications, boot camps, community college degrees that focus on tangible skills rather than broader content. As a first-gen, I'd remind Bob that those jobs are important and will likely get him a decent salary with less debt, and probably a job that may be better tailored to other strengths he may have. (This is certainly the case with my dad -- his writing skills are extremely poor, but he's fantastic with things like flooring and roofing.)",
                                      "author": "torgoboi",
                                      "created": 1636992279,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}