{
  "sid": "qknlzy",
  "link": "/r/college/comments/qknlzy/habitstoolsresources_for_managing_addadhd_in/",
  "title:": "Habits/Tools/Resources for Managing ADD/ADHD in College?",
  "text": "Basically the title! Would love answers from people who have ADD/ADHD, but if not and you still want to chime in, please do.\n\nI’m diagnosed ADHD (not currently taking meds) and struggling with staying focused and on top of my coursework this semester (plus just started a new job, which has been eating up a lot of my time!). My concentration has gotten so bad in the last few weeks, and while I’ve maintained a 4.0 for the last 3 semesters, I’m actually worried about not passing a couple of my classes this time around. If anyone has a certain habit or resource (even a computer/phone application) that helps them stay on track, please share! Literally anything is welcome.\n\nThanks :)",
  "author": "pigeonzest",
  "created": 1635800208,
  "updated": 1635890847,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hixwjow": {
      "link": "/r/college/comments/qknlzy/habitstoolsresources_for_managing_addadhd_in/hixwjow/",
      "text": "My #1 recommendation is accommodations! They don't cover everything, but sometimes they can smooth over difficulties you may have with coursework. They may even have other resources; my university has academic coaching specifically for students with disabilities. So if you're not connected through them, it could be worth looking into! \n\n\nAs far as staying focused and caught up, everyone is different, so I recommend looking through places like r/ADHD to see what other folks do. Here are some of mine:\n\n\n-task management: at the beginning of every week, I'll make lists of what needs done when, and what's coming up soon. Bigger projects get broken into tiny steps. Then those go on task lists based on priority (what's due soon, what's easy, etc). I'll track those through Google Docs or Trello so I have the satisfaction of crossing off something when it's done, even if it's tiny. Calendars are cool too, but I often forget those, so that's why the lists.\n\n\n-productivity: not a catch-all, but I like Pomodoro, where you work for short spurts then take a break. Also body doubling, where you work with someone else in the room with you. I also like have 2-3 tasks I can bounce between, so if one isn't happening, I can mess with the other, and eventually something gets done. Too many distractions are killer for ADHD, but sometimes you need the variety of multitasking.",
      "author": "torgoboi",
      "created": 1635806460,
      "upvotes": 1,
      "replies": {}
    }
  }
}