{
  "sid": "lu594u",
  "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/",
  "title:": "Is it just me, or has college sucked away your soul and left you feeling like an empty master of crafting bullshit?",
  "text": "I think I'm literally going through a patch where I feel depressed, lonely, and just exhausted.  But school literally just has sucked the life out of me. It's never been so bad before. \n\nBut my high school brother talks to me about his school work, and I feel horrible for it and I hide it. But I don't feel any sympathy. I really try to remember that he's younger than me, has less schooling under his belt. But he's spent the last week freaking out about a 800 word essay that's due at the end of the school year, and I'm just like, really? I write 1000+ word discussion boards weekly and turn in 5-10 page papers that I've bullshitted my way through because I didn't start it soon enough. Never had a problem. Like, this isn't a he problem it's a me problem. I'm obviously being a rude bitch. But I feel like I've completely lost the person I used to be for the education I thought would make my life better. All it's taught me is to find the key points and how to affectively bullshit my way through every assignment. I mean, I guess it's a skill.... \n\n&#x200B;\n\nI don't know. I just feel like college sucks. I feel like I suck. And part of me is just tempted to drop out. But don't because I know I'll hate myself for it later. Anyone else feeling this?",
  "author": "nousernamesleft_1",
  "created": 1614484827,
  "over_18": false,
  "upvotes": 1311,
  "upvote_ratio": 0.98,
  "comments": {
    "grvkz3x": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/grvkz3x/",
      "text": "I'm right there with you. I loved doing research and crafting life-changing essays, taking time to develop a project, making multiple drafts and revising stuff, etc.  \n\nNow I just find the quickest and most bullshit way to get this assignment done so I never had to look at it again. I hate it. These are classes I really want to take and care about but the nature of the pandemic just has me looking at every assignment like a chore to hurry up and complete.   \n\nBefore this I grew with every class and assignment, seeing it as a chance to enhance my life and become a more proficient individual. Now I just see it as bullshitting practice where I just find the quickest and easiest way to bullshit my work.  \n\nAfter my speech today I legit wanted to cry just because I know I'm capable of so much better. Everyone applauded me and had helpful feedback, but the only \"feedback\" i needed was to stop fucking off. \n\nI read the stuff I write, and while it's better than the other students, I know I could do better than the bullshit I thought of 10 minutes before it was due. \n\nBut I hate this situation and my brain isn't clicking. Yeah I'm getting the work done in 'survival mode' but this isn't what I worked my ass off for years and paid to do. \n\nYoure not a lone.",
      "author": "Id_Rather_Be_Dancing",
      "created": 1616460823,
      "upvotes": 1,
      "replies": {}
    },
    "gphlmn7": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gphlmn7/",
      "text": "Yes. I was so disheartened with school for so long. You are probably experiencing burn out. I've experienced it in college and know a few others who have too. I would recommend Cal Newport's podcast \"Deep Questions\" for some advice on this.   \n\n\nNow that I'm almost done with college and thinking about my career, I'm starting to value the credits I have left. Believe it or not, there are a lot of marketable skills you can learn in college. And the most important thing to get from college are skills. I'd say don't drop out and also don't let college coast by. Think about where you want to go after, find out what skills are in. demand, and find out what courses or internships will let you cultivate those skills. Once you're done with college and see that you have plenty of great options from there, you will see that it was worth the time and effort. Being strategic will also help you enjoy learning in the moment.",
      "author": "overwatered88",
      "created": 1614737833,
      "upvotes": 1,
      "replies": {}
    },
    "gpbzalc": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gpbzalc/",
      "text": "Everything sucks right now tbh...\n\nI had a solid 3.5 gpa from my first year in college. ( before rona 2018/2019)\n\nI was doing my part in the honors club and the program at my college, my leadership roles and just overall being involved, and really motivated just to go to campus to pursue my dreams.\n\nThis pandemic however taught me that I just....really have a hard time studying and fully grasping everything online.  There is oh so much offive hours can do, groupme and discord chats for classes are basically dead and its just too much work to keep up.\n\nWhat sucks is that I want to pursue a phD so having a pretty good gpa and some research you have completed...\n\nNow I am scared I have failed at life and my dream just cuz I don't do well with 100% online learning.\n\nI really wish things will get better because I relate to ya on this one",
      "author": "PopCandy420",
      "created": 1614627220,
      "upvotes": 1,
      "replies": {}
    },
    "gp9rlmo": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp9rlmo/",
      "text": "I was in community college where I built basic skills and foundations that would help me substantially in academics. When I went to a really great university, I had access to things like going abroad to learn about cultures, great professors who were interested in the topics, and a great learning environment.  I really enjoyed my academic experience \n\nNow I'm going to grad school for a career and it is 100% without a doubt no kind words to say about it. bullshit. I don't care, I don't see how this helps me in my job, I have no interest in whatever the fuck this is because it has no bearing in actual practice, and I just fucking hate it. I'm crafting shit out of my ass like I wouldn't think possible. If Pablo Picasso could see the worthless garbage that my asshole molds before I dumpster it into the sea for grading he'd lick my anus dry and suck my scrotum for the fine art I produce",
      "author": "PossiblyAsian",
      "created": 1614576622,
      "upvotes": 1,
      "replies": {}
    },
    "gp7ape6": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp7ape6/",
      "text": "I felt this big time, it’s just about passing at this point.",
      "author": "B3yy",
      "created": 1614536617,
      "upvotes": 1,
      "replies": {}
    },
    "gp73izd": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp73izd/",
      "text": "I feel you completely. By the time I graduate I'll have spent half of my college experience online. I was having the time of my life before this, now I just white-knuckle through the week and get nothing done on weekends while I recover. This sucks so much and my only consolation is that it'll be over in two and a half months (which is also goddamn terrifying.)",
      "author": "ParsnipPizza2",
      "created": 1614534367,
      "upvotes": 1,
      "replies": {}
    },
    "gp6x96i": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6x96i/",
      "text": "Haven't cared about any of my essays past freshman year, never had a problem grade-wise so...why bother really. The TAs don't really read them anyways, you just need to include everything on the rubric and not totally screw up the facts",
      "author": null,
      "created": 1614531631,
      "upvotes": 4,
      "replies": {}
    },
    "gp6vxev": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6vxev/",
      "text": "I kind of feel the same. One of my classes this semester has just wrecked my life. The prof is so disorganized and teaches so poorly. I was so excited to take the class, and I still love the subject, but I'm not really LEARNING it so much as desperately guessing and BSing and scraping by by the skin of my teeth. As someone who actually really enjoys learning, it's been a wreck for me. But also it's been especially bad because I had covid at the end of winter semester and since then I've been very fatigued and mentally blurry. I never got my energy back and I spend way too much time just staring at my work like it's a foreign language. Plus I GENERALLY have seasonal depression ANYWAY so it's just a shit storm. I'm pretty mad at myself for not brushing up on the curriculum of my classes during winter break. This summer I'm gonna watch crash course and do khan academy and whatever else lmao to get a headstart on the work. Because the semester is half over and I'm just figuring out the basics.",
      "author": null,
      "created": 1614530978,
      "upvotes": 1,
      "replies": {}
    },
    "gp6u903": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6u903/",
      "text": "I felt this for a while. Most of my classes are just fillers for now because I wasn't exactly sure whay I wanted to do. I had a vague idea so I picked my major that would help, but not a specific discipline or minor to pair with it. I was just bullshitting forum posts by picking a random page of the reading and saying I found it interesting. My papers were mostly hot garbage that I did good enough on to keep up my GPA. I don't even feel like I'm learning anything in most classes because I can't be fucked to pay attention to online classes. Fortunately I took a class on a whim and absolutely love it. Unfortunately it's the only one my school offers on the topic so I'll have to transfer, but at least I have some sort of direction now.",
      "author": "waffleking_",
      "created": 1614530291,
      "upvotes": 1,
      "replies": {
        "hl37l18": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/hl37l18/",
          "text": "My papers are so bad because I just rambling and trying to get the word limits.",
          "author": "nathani3l0g",
          "created": 1637214815,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gp6u1x5": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6u1x5/",
      "text": "What you call bullshit might be that you’ve actually built up quite a bit of skill and now can do things more efficiently and with less preparation before. I mean look at your high school brother; there was a time you probably would have felt like 800 words was a big deal and now you’re writing 5-10 pages like it’s nothing. That is actually a pretty big freaking skill; being able to write quickly and efficiently is important in almost every career. And I would bet that’s not the only thing you’ve gained. It can be really hard to see your own growth though. There is even a term, imposter syndrome, for how a lot of highly educated people feel like they are bullshitting or faking their way through things without actually being qualified for them; in reality they almost always are.\n\nHonestly just ... this year sucked for most people. Even if you weren’t in school. It could easily be more of a 2020-21 issue than a school issue",
      "author": "Thunderplant",
      "created": 1614530223,
      "upvotes": 3,
      "replies": {}
    },
    "gp6sxgj": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6sxgj/",
      "text": "I agree with you bud. I think what helps me is understanding that college is just a motion you go through. The real winners are either already smart or use college as a spring board to open doors for other things, not necessarily become a prodigy. The work is just a formality, and to assist in the process of college being a test of grit, not intelligence.",
      "author": "therealtiqii",
      "created": 1614529822,
      "upvotes": 2,
      "replies": {}
    },
    "gp6palr": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6palr/",
      "text": "You know, I joined r/lawschool not long ago because, after working for 10 years, I decided to get a law degree. If I weren't so confident in my direction, that forum would have made me rethink the whole idea because of all the talk about being burnt out and spiritually wrecked. I then realized a ton of those people had come right out of university. Being put in an already tough educational system where you're constantly evaluated against other students and by your parents and where, by your perception, a disgruntled professor can needlessly put your future in peril due to an absurdly competitive job market - for damn near 20 years - is enough to really mess with a person. I really feel for people who haven't separated from that because it's really hard to see the light at the end. It's also dismaying to get out and realize no one actually knows what they're doing.",
      "author": "expatandy",
      "created": 1614528556,
      "upvotes": 2,
      "replies": {}
    },
    "gp6nar3": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6nar3/",
      "text": "[removed]",
      "author": null,
      "created": 1614527887,
      "upvotes": 1,
      "replies": {}
    },
    "gp6m37p": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6m37p/",
      "text": "Nah man, that's what's work has been for",
      "author": "leumaah",
      "created": 1614527503,
      "upvotes": 1,
      "replies": {
        "gp6md4g": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6md4g/",
          "text": "I feel it. I've been working full time through all of this too. That's a different kind of empty bitch though. Lol.",
          "author": "nousernamesleft_1",
          "created": 1614527597,
          "upvotes": 3,
          "replies": {
            "gp6mtnv": {
              "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6mtnv/",
              "text": "Hahahaha man work + college is sucking my will to live, but honestly at this point school work is just the least of my worries. I just wish I had some free time",
              "author": "leumaah",
              "created": 1614527735,
              "upvotes": 1,
              "replies": {
                "gp6o0ly": {
                  "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6o0ly/",
                  "text": "Lol. Free time?  What's that?? 😂😂 honestly I can relate.",
                  "author": "nousernamesleft_1",
                  "created": 1614528126,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gp6hs7c": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6hs7c/",
      "text": "I completely agree with you. I am in the second semester of my senior year, and I am a shell of the person I used to be. I am depressed every day. I am extremely stressed out all the time. I cry multiple times a day and have since I started college. I have fought through it because I want to create a better life for myself (1st gen) but it has been really hard. Try talking to a therapist through your school. I do that and it helps A LOT. Also,  make time to do things that you enjoy and try to stay on top of your assignments. Create a specific workspace that is for work only. Make sure you are finding ways to spend time with supportive friends. It is very hard with COVID, but I have been hanging out with my coworkers (socially distanced) after work and I just talk through stuff with them, we play guitar, generally shoot the shit, etc. It really helps my mental health to have a space that is completely separate from college. Different town, different people, structured environment. I agree that college is not a healthy place to be, especially as a nontraditional student (I was never able to live in a dorm, I drive an hour to get to school every day and still live with my family) Ultimately, do what is best for you, and take your mental health seriously. Do not listen to the people who are disagreeing with you in the comments. Your feelings are valid and heard.",
      "author": "outdoorgirl16196",
      "created": 1614526051,
      "upvotes": 6,
      "replies": {}
    },
    "gp6fuaa": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6fuaa/",
      "text": " College is worthless for many (most) degree, IMO. The world could be so much better if we just did on the job training. And thinking about the fact I’m going to be 40-50k in debt after I graduate makes me so upset. I feel like my degree is worthless and I’m utterly unprepared for my first professional job.",
      "author": "cupcakescandy",
      "created": 1614525387,
      "upvotes": 3,
      "replies": {}
    },
    "gp6f89b": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6f89b/",
      "text": "I feel like thats the point of official education. To make a cog that'll fit some workplace and bring gain to the economy.\n\nYour best interests are not in their mind.\n\nGet what you can from your education and create your own path.",
      "author": "D_Leshen",
      "created": 1614525152,
      "upvotes": 1,
      "replies": {}
    },
    "gp6f7g7": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6f7g7/",
      "text": "Yes bro. Yes.",
      "author": null,
      "created": 1614525143,
      "upvotes": 1,
      "replies": {}
    },
    "gp6c86l": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6c86l/",
      "text": "Sounds like a little imposter syndrome. A person has trouble seeing themselves as they are. You have undergone a transformation yet still the same.",
      "author": "Altruistic-Place-484",
      "created": 1614523909,
      "upvotes": -6,
      "replies": {}
    },
    "gp62zp2": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp62zp2/",
      "text": "I feel this 100%. I started my freshman year at a acclaimed university and barely made it through one semester before transferring to the campus in my hometown. I couldn't keep any friends because I didn't have a popular major (given what my school was known for) and I didn't party. Was alone 24/7 and I didn't want to switch because I thought the name of the school on my degree was enough to keep me going. I bs'd my way through my assignments and my lack of motivation led me to start skipping class more often than not. The only way I felt somewhat more motivated and like I was actually working towards my degree was when I switched campuses and got to stay at home... now I work part-time while going to school and living at home for free (thanks, mom), not to mention home-cooked meals, but covid has still ruined things. I am just ready to graduate........",
      "author": "kizami-zuki",
      "created": 1614518096,
      "upvotes": 4,
      "replies": {}
    },
    "gp62x01": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp62x01/",
      "text": "So get this, this is likely going to be your entire working career.\n\nUnless you become a doctor or something, most of your work will be spent doing bullshit tasks that have marginal value. Yes it is soul crushing.\n\nI recommend finding something fulfilling outside of work/school to focus on.",
      "author": "Eudaimonics",
      "created": 1614518040,
      "upvotes": -4,
      "replies": {}
    },
    "gp60ww4": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp60ww4/",
      "text": "Think about what those lessons really taught you. Everything in college is meant to make a good citizen out of you. Really use your wits about you lad! Ha ha\nDon't take life too seriously, use your bullshitting powers to get a girl bro\nMake war https://youtu.be/qRQZmaNz69s ⚘\nLight the world on fire ✨",
      "author": "Alternative-Day-4310",
      "created": 1614516433,
      "upvotes": 1,
      "replies": {}
    },
    "gp5wscc": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5wscc/",
      "text": "College honestly destroyed my work ethic and motivation, and frankly I am not the same person because of it. \n\nDay after day after day of spending hours and losing sleep over assignments that ended up graded by computer. I had maybe 2 great professors and the rest was all spent teaching myself every thing at best, and at worst dealing with psychotic ego tripping professors intentionally being hard to work with. \n\nI used to be so excited to learn and got immense satisfaction from a hard days work. Well that got absolutely ruined",
      "author": "Softpretzelsandrose",
      "created": 1614513265,
      "upvotes": 28,
      "replies": {
        "gp6z1cr": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6z1cr/",
          "text": "Yeah I’ve noticed it’s actually rare to get good professors who try their best to engage with the whole class.",
          "author": "icool4u",
          "created": 1614532516,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gp5pwcf": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5pwcf/",
      "text": "Burn out is nothing unusual but personally, high school was a more stressful and repressive experience for me.",
      "author": "Eddie_078",
      "created": 1614508596,
      "upvotes": 1,
      "replies": {}
    },
    "gp5k2o4": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5k2o4/",
      "text": "Man if i haven't felt the same way through out my 4 years in college.",
      "author": "Dhtekzz",
      "created": 1614505005,
      "upvotes": 3,
      "replies": {}
    },
    "gp5j5xq": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5j5xq/",
      "text": "yeah ! covid👎",
      "author": "sexysmartgirl_of",
      "created": 1614504481,
      "upvotes": 1,
      "replies": {}
    },
    "gp5bd84": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5bd84/",
      "text": "I was bullied in highschool, but college years are still definitely much worse",
      "author": "blackshawler",
      "created": 1614500786,
      "upvotes": 4,
      "replies": {}
    },
    "gp5bb7i": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5bb7i/",
      "text": "Bruh...I feel personally attacked lol",
      "author": "swollemolle",
      "created": 1614500765,
      "upvotes": 8,
      "replies": {}
    },
    "gp5bag6": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5bag6/",
      "text": "[deleted]",
      "author": null,
      "created": 1614500757,
      "upvotes": 10,
      "replies": {
        "gp81ypb": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp81ypb/",
          "text": "I dont think this is a lie. I knew going in that college would try to change the way I thought. In a way, I was always an outside of the box kind of person. Different theories and opinions fascinate me. And I love being devils advocate. Which doesn't work in most work or academic settings. They want you to think the way they think. I'm just so tired or fighting it. But also I have to stay true to myself.",
          "author": "nousernamesleft_1",
          "created": 1614545162,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gp58kqv": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp58kqv/",
      "text": "I Agee ! It’s not necessary the workload it’s just the lack of motivation to not do anything because of how online classes operate. Instead of being in a class with a professor and students at your disposal for help and feedback it’s just you and your computer. Especially being at home with all other distractions it can be hard. I feel like because we are all at home we can’t really separate school and home life it’s now jumbled up together and it can get so overwhelming! But just know you are not alone I feel like anyone in college despite their major is feeling the same kind of emotions. Myself included ! If you ever need to vent more or need a study buddy hmu ! We all need to help each other get through another semester!",
      "author": "Kammyyyboo21",
      "created": 1614499537,
      "upvotes": 6,
      "replies": {}
    },
    "gp551io": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp551io/",
      "text": "I felt this way my first semester when I was working towards something I wasn't passionate about and knew I would hate.\n\nEdit: felt the need to add that all my classes are in person rather than zoom because that honestly changes things by a great deal in the fact that I would be failing zoom classes no matter what was driving me",
      "author": "toofeduptocare",
      "created": 1614497989,
      "upvotes": 9,
      "replies": {}
    },
    "gp52dgx": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp52dgx/",
      "text": "I have a huge passion for music, but was told to take a degree in Civil Engineering instead. Going into second year and I'm starting to see it as a \"Just a degree\".\n\nAt first it was the usual \"Have class, do assignments, exam, rinse and repeat\" activity where I can just go along with it and hopefully pass. Eventually it got to a point where I'm starting to decline mentally since I had to juggle between my passion and the course.\n\nIt got worst when for the first time ever, me and my coursemate was enrolled into a C Programming class. It was fucking hard... The lecturer was horrible at pointing out programming mistakes and the students there are at high level of pain to work with. Considering I have two more years, I'm bound to meet these mentally draining subjects and people.\n\nAll I could say for now is I'm losing it. I'm very afraid of graduating with my love for learning gone down to the drain. The only driving force is to not disappoint and waste my parent's effort\n\nI still believe it's worth it, I just hope it stays that way",
      "author": "Yunchansamakun",
      "created": 1614496806,
      "upvotes": 20,
      "replies": {
        "gp6xuaf": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6xuaf/",
          "text": "Ohhh boyy, junior year, i just wanna say the pain just started :)",
          "author": null,
          "created": 1614531921,
          "upvotes": 2,
          "replies": {
            "gp6zrq3": {
              "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6zrq3/",
              "text": "I'm looking forward to have my sanity tested",
              "author": "Yunchansamakun",
              "created": 1614532869,
              "upvotes": 1,
              "replies": {
                "gp70cpf": {
                  "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp70cpf/",
                  "text": "Whatever i said u will get through it. Dw much just enjoy life when u still can",
                  "author": null,
                  "created": 1614533152,
                  "upvotes": 1,
                  "replies": {
                    "gp70mzt": {
                      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp70mzt/",
                      "text": "Much appreciate it! Thanks for the support!",
                      "author": "Yunchansamakun",
                      "created": 1614533280,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gphmsxp": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gphmsxp/",
          "text": "Hello! As someone who followed their passion for psychology instead of the more practical degree, I can tell you the grass is not greener on the other side. I'm sorry you aren't finding your degree fulfilling, that sucks. But I can tell you there's one really valuable positive. \n\nYou have many options. After college you will be able to work pretty much wherever you want and for good pay. I thoroughly regret following my passion and not doing CS. I did psych and it's a degree where you can't get a job with just a bachelor's, unlike engineering. It's easy to switch from engineering to another job later if you want, almost impossible to do the opposite. Maybe after college you can combine engineering with music!\n\nAs for your love of learning. Don't worry, it's not gone just sleeping :)",
          "author": "overwatered88",
          "created": 1614738439,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gp4y1u4": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4y1u4/",
      "text": "College honestly just sucks, and I've grown to accept that especially in the Covid era. I've had half my college career sucked up by online classes. Luckily I have the credits to get out of this hellscape a semester early but I'm feeling similar to you lol so you're not alone!",
      "author": "WannabeCrackhead",
      "created": 1614494914,
      "upvotes": 54,
      "replies": {}
    },
    "gp4xjbr": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4xjbr/",
      "text": "Why is everyone disagreeing or coming at you in these comments??? \n\nI completely wholeheartedly relate with you. Covid has made things a nightmare. People must think you’re upset about the papers & not upset about the issue of college in a pandemic which greatly affects motivation especially if your classes are all virtual.  I wish I could offer help but I’m hoping to just stick it out until things are normal again. \n\nDon’t even get me started on the depression aspect of it all & the difficulty of finding friends\n\nBut like, seriously, people? These comments are telling you to find a better major or appreciate the fact you get to go to college. Sorry, what? When did OP say they weren’t grateful? We are in a motherfuckin pandemic & college is a shitty thing right now for nearly everyone solely because of that.",
      "author": "scorpiopathh",
      "created": 1614494686,
      "upvotes": 290,
      "replies": {
        "gp4xz3o": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4xz3o/",
          "text": "It has nothing to do with papers. I have no problem with school. I actually loved college until recently with covid and personal problems. I typically thrive in academic settings.. I think I'm probably just depressed. Unfortunately. \n\nBut you know what. We will survive. And we'll come out better for it in the end.",
          "author": "nousernamesleft_1",
          "created": 1614494883,
          "upvotes": 94,
          "replies": {
            "gp714ys": {
              "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp714ys/",
              "text": "Dude I feel you whole heartedly. I miss waking up at the Crack of dawn and throwing coffee on , walking in to class, and interacting with the person in charge of my education. I have just enough motivation to do my work at home, but not enough to feel proud of my work. Something about being in a room where education takes place makes me more serious about my education. Locking my self in my room until my homework is done is depressing.",
              "author": "Mikewithkites",
              "created": 1614533495,
              "upvotes": 5,
              "replies": {}
            },
            "gp5pk4p": {
              "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5pk4p/",
              "text": "That's the spirit.",
              "author": "Eddie_078",
              "created": 1614508434,
              "upvotes": 9,
              "replies": {}
            }
          }
        },
        "gp6ys0d": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6ys0d/",
          "text": "Everyone’s disagreeing cause they had a different experience lol",
          "author": "charlesdickinsideme",
          "created": 1614532388,
          "upvotes": 7,
          "replies": {}
        },
        "gp6uxry": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp6uxry/",
          "text": "Prayers up , OP, college is gay as fuck",
          "author": "EggrollPhilosophy",
          "created": 1614530522,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gp4x9gm": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4x9gm/",
      "text": "You don't even want to know what graduate school/medical school/law school has in store for people like you. What you describe is nothing compared to those, in particular grad school lol",
      "author": "WorryVisible",
      "created": 1614494570,
      "upvotes": -25,
      "replies": {
        "gp54niw": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp54niw/",
          "text": "Whether or not something else is harder doesn’t detract from the fact being burnt out is being burnt out.",
          "author": "YinandShane",
          "created": 1614497812,
          "upvotes": 24,
          "replies": {}
        }
      }
    },
    "gp4vfyd": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4vfyd/",
      "text": "I get how you’re feeling, I have thoughts about dropping out, I mean I’m not gonna do it, I don’t want to do it cause honestly I don’t know what the heck else I’d be doing if I didn’t go to college, I’m gonna be honest I have failed a lot in school. I had to retake almost every class, and have to learn new skills like time management. But I think it’s worth it, cause I think everything is leading up to me being the person I want to be, and yeah I’m pretty exhausted, and sometimes I wish things were easier, I wish I didn’t have to work for tuition, I wish I could spend all my time devoted to school because right now that’s all I care about. But tough shit I guess, I gotta keep pushing, and that’s all there really is to it.",
      "author": "Makiaveli01",
      "created": 1614493780,
      "upvotes": 14,
      "replies": {}
    },
    "gp4uq9i": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4uq9i/",
      "text": "I want to tell you it gets better, but it doesn't.",
      "author": "FoxWyrd",
      "created": 1614493477,
      "upvotes": 4,
      "replies": {}
    },
    "gp4qkm4": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4qkm4/",
      "text": "I felt that for a while. I felt like I was losing real skills for well, bullshit ones. I think you need to do something creative, an outlet for yourself. Even if you can't/ don't want to draw, or paint, or journal, try something! Even volunteering. Something to apply yourself in a fun, challenging, evolving way. Have you applied to internships? \n\nAs for sympathy, it was hard for me to connect with my younger cousin freaking out about 500 words while I am trying to get 10 pages done. I think you can still be kind to them and let them know how much you are working on and as they grow what they can expect. Her shocked Pikachu face at my essay always made my day and made her feel like she could do hers. I think that will help reconnect you guys. \n\nSometimes it's the simple things.",
      "author": "emmahex23",
      "created": 1614491759,
      "upvotes": 37,
      "replies": {}
    },
    "gp4pcii": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4pcii/",
      "text": "Inb4 the mods come and remove this post because you have disturbed their echo chamber of sunshine & rainbows. But yeah I feel you. I’ve felt this all 4 years of college.",
      "author": "DropFishCat",
      "created": 1614491263,
      "upvotes": 65,
      "replies": {}
    },
    "gp4kqm0": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4kqm0/",
      "text": " Being in HS is completely different from being in college, but I don't understand why you can't be more sympathetic towards your brother. HS kids don't understand. I guess cause I am in my late 30's, I don't understand the feeling of not wanting to be in college. I was a D student in HS, but I am going to finish my degree Magna cum laude. I went straight in the Army and was deployed twice.  I think you just may need to find a better degree or something else you are interested in. IDK what to tell you but maybe consider another lifestyle.",
      "author": "LikelyWriting",
      "created": 1614489398,
      "upvotes": -8,
      "replies": {
        "gp4llfk": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4llfk/",
          "text": "Ok, let me explain this. I am completely sympathetic normally. That's why I said it's my fault and not his, because I remember high school. Wasn't the greatest experience. I get where he's coming from.. I'm literally just in a weird spot right now where I think I'm burned out so I'm just being a crappy human.. And at this point I'm in too deep with my degree now so now I'm trying to refocus and pull my act together. Sometimes though you just gotta vent. I know this is temporary and I'll look back in ten years from now and be glad I stuck with it.",
          "author": "nousernamesleft_1",
          "created": 1614489751,
          "upvotes": 18,
          "replies": {
            "gp4xde3": {
              "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4xde3/",
              "text": "I've been there before. Losing the ability to truly be sympathetic and just being a shitty friend all around but not understanding what changed. I blame it on the depression. It's hard to feel for others when you don't have control of your mental state and emotions. It'll pass, it always does. We just don't know how long this is going to last. Keep pushing through. This society says you need a degree now to be successful, so whatever, finish the task and get the degree even if you don't feel it's meaningful. Because others will and that'll help you in life. \nSometimes you just have to go through the motions until you start caring again. Good luck bud.",
              "author": "c0rtn0rt",
              "created": 1614494613,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "gp5gupn": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp5gupn/",
          "text": "I think its less about not wanting to be in college and more about the circunstances surrounding it for OP. As a soldier there probably have been some mission sets that were enjoyable or attractive to you yet bad leadership can stop and ruin all of that in it's tracks. Think its more of that happening here, where admins and profs who have been so used to doing the same thing for years fail to adapt to new circumstances, which just results in a worse experience for everyone. The admins and profs that do adapt their classes effectively stand out so much.",
          "author": "_Convair_",
          "created": 1614503285,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gp4kjxz": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4kjxz/",
      "text": "Sounds like either you are a great writer, or your professors are not doing their jobs by grading professionally.\n\nIf it is the formal, then perhaps challenge yourself with more advanced projects. If it is the latter, then I don't know what to tell you...",
      "author": "AcademicDifficulty",
      "created": 1614489321,
      "upvotes": 68,
      "replies": {
        "gp4ktdq": {
          "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4ktdq/",
          "text": "Ive always been considered a good writer. I've never had a problem with it.. Now math on the other hand... 😂🤦‍♀️",
          "author": "nousernamesleft_1",
          "created": 1614489432,
          "upvotes": 40,
          "replies": {
            "gp4ldkt": {
              "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4ldkt/",
              "text": "That's a great ability to have. Perhaps you should figure out what you're interested in/passionate about and focus on those.",
              "author": "AcademicDifficulty",
              "created": 1614489662,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "gp4d9ul": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4d9ul/",
      "text": "It sounds a bit like your taking the opportunity to go to school for granted. I’m not sure if it’s one of two issues from the post - your workload is or if it’s too much for you, if it is drop  your class amount. \n-or you’re just procrastinating and doing it to yourself then hating school for it. \nBut either way I think everyone in college does through this at times. It can be extremely exhausting and burn out it a real thing. It does sound like your burned out so do some research on how to combat burnout.",
      "author": "kosherkanye",
      "created": 1614486525,
      "upvotes": -15,
      "replies": {}
    },
    "gp4cgfq": {
      "link": "/r/college/comments/lu594u/is_it_just_me_or_has_college_sucked_away_your/gp4cgfq/",
      "text": "Yeah same. But honestly I’ll be alright. I just want my degree because it’s going to give me a ton of opportunities",
      "author": null,
      "created": 1614486126,
      "upvotes": 53,
      "replies": {}
    }
  },
  "updated": 1637387212
}