{
  "sid": "r66x8n",
  "link": "/r/college/comments/r66x8n/i_hate_it_here/",
  "title:": "i hate it here",
  "text": "exactly what the title says. i’m a freshman (female) and i just want to go home. i’m secretly praying that the covid cases go up here with this new variant so i can be home next semester, which i know is awful to even think, but i’m so depressed and anxious here all the time. the only good thing here is my friends. i miss my bed, i miss my family, i miss my dog, i miss eating food that i actually like and doesn’t make me feel sick (i have ibs). i really did enjoy being here until about the middle of november. i’m burnt out and have no motivation to do anything. i keep telling myself “only 3 weeks until winter break” but there’s still so much work to do and finals and it’s still 18 days before i go home and i don’t think i can do it. to top it off, i have to move out of my room this week because i cannot stand my roommate and that’s a whole process i need to do with actually finalizing the switch then moving all my stuff out and into another room. i’m just over everything.",
  "author": "catjk11",
  "created": 1638334920,
  "updated": 1638480427,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hmrf044": {
      "link": "/r/college/comments/r66x8n/i_hate_it_here/hmrf044/",
      "text": "I think its totally valid that you feel that way, I'm in college too but I live at home and take classes online, I don't know why your parents sent you off to a 4 year college from the start I thought basically everybody knew that its better to get your associate's  from a close community college while living at home then transfer to a 4 year school. That's what I did and I don't regret it at all. 18 is still really young I dont blame you for being overwhelmed.",
      "author": "Empty_Inspection_966",
      "created": 1638335590,
      "upvotes": 3,
      "replies": {
        "hmsbjro": {
          "link": "/r/college/comments/r66x8n/i_hate_it_here/hmsbjro/",
          "text": "Sorry for the tangent but I have to disagree about that bring the best option. If you have scholarships and feel confident you'll keep them, it's worth going straight to a 4 year college. Also, networking and career opportunities may be better. I interned with a large engineering company after my sophomore year, but they only recruit from a handful of schools. If you know exactly what you want to major in and/or have lots of dual credit/AP credit from high school, it can be better to go straight to the 4 year. As well, my degree program has 6 semesters of sequential classes, so doing the first 2 somewhere else, I would still have to do 3 years at a 4 year university anyway, so that's extra time and money to pay for 5 years instead of 4.\n\nThere are a lot of situations where a 2 yr college might make sense first, but there are advantages to a 4 yr college beyond just the fact that you get a better piece of paper at the end of it.",
          "author": "Thelton26",
          "created": 1638359866,
          "upvotes": 2,
          "replies": {
            "hmsyosl": {
              "link": "/r/college/comments/r66x8n/i_hate_it_here/hmsyosl/",
              "text": "You dont get a better piece of paper at the end of going to a 4 year school from the start. You get the same diploma whether you start off at a 4 year or transfer into it after 2 years of cc. Getting a full ride from the start at a 4 year is an unusual circumstance, most people have to pay at least half of their tuition and getting an associate's at a cc is much cheaper. Plus you don't have to live on campus for a year at a cc. The classes at my community college were the same quality as at my state college.",
              "author": "Empty_Inspection_966",
              "created": 1638371979,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "hmrje28": {
          "link": "/r/college/comments/r66x8n/i_hate_it_here/hmrje28/",
          "text": "[deleted]",
          "author": null,
          "created": 1638338105,
          "upvotes": 1,
          "replies": {
            "hmrjo6p": {
              "link": "/r/college/comments/r66x8n/i_hate_it_here/hmrjo6p/",
              "text": "Why would you rack up debt by going to a 4 year when you could knock out the first 2 basically debt free. It’s the same exact classes.",
              "author": "Spicybooiii",
              "created": 1638338273,
              "upvotes": 3,
              "replies": {
                "hmrlwn6": {
                  "link": "/r/college/comments/r66x8n/i_hate_it_here/hmrlwn6/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1638339690,
                  "upvotes": 1,
                  "replies": {
                    "hmsz745": {
                      "link": "/r/college/comments/r66x8n/i_hate_it_here/hmsz745/",
                      "text": "For the vast majority of people going to a cc first is better, also I guess I just assumed a lot of people did that because of my experience but maybe that's cause I live in a poor state lol",
                      "author": "Empty_Inspection_966",
                      "created": 1638372192,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}