{
  "sid": "rit37x",
  "link": "/r/college/comments/rit37x/advice_on_professor_refusing_to_grade_my_revision/",
  "title:": "Advice on professor refusing to grade my revision he allowed under his discretion?",
  "text": "Alright, so first let me say that I'm a first year student enrolled in online community college. Anyway, I had to take an art class as a humanities requirement and basically, the professor is an a\\*\\*hole (not sure if I can cuss here or not), and there's been several instances where I have to email him back and forth over weird policies or what not that took points off my grade. We have 3 major assignments to complete throughout the course that count for much more points than anything else, and I noticed that for one of the assignments I was graded a 4/60. Apparently I did the assignment incorrectly although his explanations he posts are very vague, I know I worked very hard on that assignment so I felt it'd be best to just try to kiss his a\\*\\* and email him to let him know that I really would like to revise the assignment for a better grade. He let me, but the thing is, **he won't take my revision anymore.** I emailed him on November 1st which was indeed a while ago, however his email that stated he would let me revise my assignment had no details on when it was due or anything like that. I thought like the rest of my classes, he would take the work in before the end of the semester which is when practically all work revisions are due, but when he submitted final grades my revision was not included, resulting in me basically having a 68% in the class. I emailed him about this and apparently I was supposed to do the work within a week of the emailed conversation (which in no way was entailed in the emails or his syllabus), and now the revision that took me half a day and several shots of espresso was a big waste of my time. What bothers me is that I was so proud about getting such a large assignment finished while I'm juggling so many other classes, and now it's worth nothing. I don't know if this is a known thing for non-first years, but I found it really unfair that I put so much work into something that he refuses to accept now because he never told me when I should've turned it in, I emailed him back asking for any possible way that I can get this graded but he won't answer back and it's getting on my nerves. Is there possibly any person higher-up than him that I can contact about this or is there really nothing I can do? I saw somebody post a video about CC'ing a dean of the department to get their attention but I'm really in a time crunch since the semester ends tomorrow and he won't even answer my emails.",
  "author": "angeldad",
  "created": 1639781767,
  "updated": 1639787346,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {}
}