{
  "sid": "qwraq7",
  "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/",
  "title:": "Guilt over not going to class?",
  "text": "This isn’t the first time I haven’t gone, but it’s rare that I don’t go. I spent the night coughing so the reasoning is that I’m not sure it would be good to go, but I still can’t help but feel guilt? Like, I’m paying tuition for this, so it feels like I should go even though I’m sick. Any advice?",
  "author": "kachungamachunga",
  "created": 1637246799,
  "updated": 1637353766,
  "over_18": false,
  "upvotes": 53,
  "upvote_ratio": 0.98,
  "comments": {
    "hl4ml40": {
      "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl4ml40/",
      "text": "My advice is to keep that guilt. Cling to it. The discovery that one can skip classes and not get in trouble has sunk *many* college educations.",
      "author": "Lost_vob",
      "created": 1637248314,
      "upvotes": 57,
      "replies": {
        "hl4oflv": {
          "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl4oflv/",
          "text": "That's perfectly good advice for a student who is in the habit of missing class. But OP said that they rarely miss class and that they missed it this time because they had a cough. In OP's case, they absolutely should NOT be feeling guilty. \n\nThis circumstance is very different than a student who misses class just because they want to sleep in and who does it on a regular basis.",
          "author": "HumanDrinkingTea",
          "created": 1637249088,
          "upvotes": 14,
          "replies": {
            "hl4rwyf": {
              "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl4rwyf/",
              "text": "That's my point, it's an easy habit to get into. One day you're a good student, the next your drinking Vodka and Baja blast out of a taco bell cup and Chain-smoking outside the Student Center all day long.",
              "author": "Lost_vob",
              "created": 1637250502,
              "upvotes": 15,
              "replies": {
                "hl5mp4n": {
                  "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl5mp4n/",
                  "text": "That’s….oddly specific. I decided to email my professor and they said they wouldn’t have let me stay anyways, so I watched the recording of the lecture",
                  "author": "kachungamachunga",
                  "created": 1637262606,
                  "upvotes": 10,
                  "replies": {}
                },
                "hl6nfxk": {
                  "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl6nfxk/",
                  "text": "Or living in a van down by the river",
                  "author": "115machine",
                  "created": 1637277484,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hl5vlz5": {
          "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl5vlz5/",
          "text": "Eh I missed a lot, never hurt me",
          "author": "AttilaThPun",
          "created": 1637266112,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hl5lg2t": {
      "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl5lg2t/",
      "text": "I feel that. I'm currently sitting in class even though I just found out that my dad's wife passed away just a few hours ago. I would've skipped if I didn't feel the guilt of losing money",
      "author": "Kaitlin33101",
      "created": 1637262103,
      "upvotes": 7,
      "replies": {
        "hl70pgq": {
          "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl70pgq/",
          "text": "|Dad’s wife\n\nSorry about your loss and not trying to sound disrespectful, stepmom?",
          "author": "Impressive_Stuff_908",
          "created": 1637283485,
          "upvotes": 1,
          "replies": {
            "hl74wz6": {
              "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl74wz6/",
              "text": "Yeah, but I never met her so she was still a stranger to me. Never felt comfortable calling her my stepmom since we never met",
              "author": "Kaitlin33101",
              "created": 1637285448,
              "upvotes": 3,
              "replies": {
                "hl74ztc": {
                  "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl74ztc/",
                  "text": "Okay, once again, sorry about your loss.",
                  "author": "Impressive_Stuff_908",
                  "created": 1637285484,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl4x43e": {
      "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl4x43e/",
      "text": "I don't understand why so many of these posts have been popping up lately. It's your education do what you want with it but just make sure you hold yourself accountable for whatever consequence could occur.\n\nI skipped class 80% of the time when I went to uni. I graduated with 2 degree and with honors.",
      "author": "The_Start_Line",
      "created": 1637252578,
      "upvotes": 19,
      "replies": {}
    },
    "hl4llgu": {
      "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl4llgu/",
      "text": "There's a pandemic. You should feel guilty if you went, not if you didn't go, lol. \n\nSure, you might not have covid. But it's possible you do. And if you did, it's likely that going would have infected someone else, who would have then gone on to infect someone else and so on and so forth, and it's likely that one of those people in the line of people it eventually spread to would have died. So think of it this way-- by not going you may have saved a life.",
      "author": "HumanDrinkingTea",
      "created": 1637247896,
      "upvotes": 22,
      "replies": {}
    },
    "hl7vg3a": {
      "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl7vg3a/",
      "text": "Depends on the class.  All the physics and chemistry classes were recorded so I hardly ever went to lecture.  \n\nSome profs take attendance or give extra credit points for clicker questions in class - I always went to those because you never know if you will blow an assignment and end up needing the points.\n\nDon't guilt yourself out.  Ya, it's probably better if you go, and if tests are based on unrecorded lectures, you should make every effort to be there.  But if you know the material or the prof is reading the book to you and you are nailing the tests/quizzes/assignments without attending, why sweat it?",
      "author": "BornDriver",
      "created": 1637298095,
      "upvotes": 2,
      "replies": {}
    },
    "hl7jz26": {
      "link": "/r/college/comments/qwraq7/guilt_over_not_going_to_class/hl7jz26/",
      "text": "I stopped going to the physical classes after the ex highschool fucktards that were in my course decided to act like they were still 16 and throw paper at me and have snide remarks when I answered any question. If your lecturer records the lectures and they're available online, just watch those. Don't bother actually going. If they don't record though and you have to be there, well just don't go when you're sick and don't feel guilty about it because you show up every other time.",
      "author": "Wynonna99",
      "created": 1637292340,
      "upvotes": 1,
      "replies": {}
    }
  }
}