{
  "sid": "ps1fw2",
  "link": "/r/college/comments/ps1fw2/does_anyone_else_kinda_miss_online_lectures/",
  "title:": "Does anyone else kinda miss online lectures?",
  "text": "Ive just started my senior year and it all feels kinda too little too late.\n\nMy \"friends\" and I dont really talk, we dont really have a lot in common because we havent exactly spent much time together but only really stick with each other now because we help each other with work\n\nI commute everyday, and the money plus getting home at 7pm just doesnt feel worth it to sit on a packed bus then in a crowded lecture hall not being able to see anything because my glasses are fogged up and bekng able to hear the lecturer because they have a mask on, despite the majority of us being vaccinated.\n\nAnd the lecturers talk like \"isnt it great to have in person lectures again, we fought so hard to get them back for you\" but then the lectures are dogshit. At least at home i could hear them clearly and could relax without being paranoid because some guy behind me is having a coughing fit.\n\nNot to mention, theres nowhere for me to sit around during the hours and hours of downtime in between classes because most of the social buildings are closed.\n\nI know im being selfish here though. And i am genuinely happy for freshmen now that will hopefull get a good college experience. \n\nI had so many hopes for my college experience when i entered my first year, now i just want it to be over because the last year and a half got ruined from covid and its just too late to save it. Im just in the mindset of put me out of my misery and let me just get through this year in the comfort of my own home. and i just wanted to see if any other people in their final year feel the same.",
  "author": "IVOXVXI",
  "created": 1632164747,
  "over_18": false,
  "upvotes": 26,
  "upvote_ratio": 0.93,
  "comments": {
    "hdpohku": {
      "link": "/r/college/comments/ps1fw2/does_anyone_else_kinda_miss_online_lectures/hdpohku/",
      "text": "I miss recorded lecture more than online. My school has nothing prepared it someone gets COVID. They can get accommodations, but that doesn't mean recent lectures if any lectures at all. I also like rewatching them after I understand the material to catch anything that I might have missed or need to go over again.\n\nedit: One of my profs is still doing recorded lectures and it is amazing",
      "author": "noelblossom",
      "created": 1632229354,
      "upvotes": 1,
      "replies": {}
    },
    "hdp5gg9": {
      "link": "/r/college/comments/ps1fw2/does_anyone_else_kinda_miss_online_lectures/hdp5gg9/",
      "text": "Online classes do take away from the social experience, but from here on out they should be an option at the very least. I always hated professors that forced lecture attendance by having some forced lecture participation thing. Online allows for so much more flexibility, and having the option to take it is a huge benefit to a great number of students.",
      "author": "empireof3",
      "created": 1632215876,
      "upvotes": 1,
      "replies": {}
    },
    "hdnqewz": {
      "link": "/r/college/comments/ps1fw2/does_anyone_else_kinda_miss_online_lectures/hdnqewz/",
      "text": "I definitely do. I found it much easier to manage my time when the time taken to get to classes wasn't an issue.",
      "author": "JoeTheRapper",
      "created": 1632183785,
      "upvotes": 2,
      "replies": {}
    },
    "hdnfd5x": {
      "link": "/r/college/comments/ps1fw2/does_anyone_else_kinda_miss_online_lectures/hdnfd5x/",
      "text": "Also a senior- most of my classes could be entirely online and would probably be better quality honestly- I forgot how much I didn't enjoy going to class just to stare blankly at the screen and then leave. At least online I could do other things that were productive while listening to the lecture whereas now I feel like I'm wasting time and money being here",
      "author": "Unfair-Campaign257",
      "created": 1632178554,
      "upvotes": 10,
      "replies": {}
    },
    "hdmm8qd": {
      "link": "/r/college/comments/ps1fw2/does_anyone_else_kinda_miss_online_lectures/hdmm8qd/",
      "text": "I miss the online lectures for the classes that are a waste of my time I have to take. I definitely forgot how much time is wasted in classes like freshman Econ I could’ve spent playing Skyrim and getting the same grade",
      "author": "harry01772",
      "created": 1632166030,
      "upvotes": 8,
      "replies": {}
    }
  },
  "updated": 1634054216
}