{
  "sid": "r4vi99",
  "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/",
  "title:": "Best drink for lightweights",
  "text": "I just turned 21 today!!! I have already told my friends I don't want to go out to a bar and get shit faced but I do want to try some sort of alcoholic drink. I'm really worried about feeling drunk, since I have anxiety and think I might have a panic attack. What are some good drinks for people who are lightweights who just want a little taste of being drunk but not completely blacked out?",
  "author": "maxalot221",
  "created": 1638191404,
  "updated": 1639858654,
  "over_18": false,
  "upvotes": 31,
  "upvote_ratio": 0.97,
  "comments": {
    "hmj09ok": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmj09ok/",
      "text": "Don't go for a mixed drink and make sure to drink plenty of water. Eat food beforehand as well",
      "author": "biggestbaddestnerd",
      "created": 1638191762,
      "upvotes": 24,
      "replies": {
        "hmk48z1": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk48z1/",
          "text": "For whatever reason I kind of feel like you have some initial leeway when it comes to hangovers.\n\nEveryone I know didn't get hangovers for the first few times of drinking, maybe its just because tolerance is extremely low to alcohol so you don't consume as much or something but it is weird that everyone's experience with alcohol that I know is fine the first couple times.\n\nObviously drink water and take it slow but you might not even get a hangover at all, I didn't take my own advice my first few times. Drank almost no water and actually didn't get a hangover. Until one day I did and it was baaad.",
          "author": "Reddituser8018",
          "created": 1638209640,
          "upvotes": 50,
          "replies": {
            "hmk9nlb": {
              "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk9nlb/",
              "text": "the first time I drank I threw up and felt like shit the next morning because I drank a whole bottle of wine and no water.\n\never since then I drink water every time I drink (I drink a shit ton every day anyway) and I have never gotten another hangover",
              "author": "thisisme1202",
              "created": 1638211786,
              "upvotes": 24,
              "replies": {}
            },
            "hmk9p5z": {
              "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk9p5z/",
              "text": "That's fair, I definitely had a similar experience. Drinking and eating does help with pacing too though. It's cheesy, but having a glass of water can slow you down a bit if you're really vibing",
              "author": "biggestbaddestnerd",
              "created": 1638211804,
              "upvotes": 10,
              "replies": {}
            }
          }
        }
      }
    },
    "hmj3lza": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmj3lza/",
      "text": "Angry Orchard hard cider! Yummy and with 2 I feel a fun social tipsy!",
      "author": "bouncyhampster",
      "created": 1638193631,
      "upvotes": 16,
      "replies": {
        "hmmyb61": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmyb61/",
          "text": "this.",
          "author": "bumba17",
          "created": 1638256622,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmjcjg3": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjcjg3/",
      "text": "There are just so many kinds of alcohol, it's hard to provide direction.  \n\nHard Ciders are probably the easiest place to start.  \n\nLight beers, Lagers, Pilsners and maybe Brown Ales are IMO the easiest of the beers to drink.  \nIPAs are urine in a bottle or glass that hipsters try to tell each other taste really good to their \"advanced palate\".  \nBelieve it or not Guinness (an Irish black beer) is easier to drink than you might think.  \n\nI'm going to suggest a couple of cocktails that are pretty easy to drink, while still letting you experience \"hard liquor\".  \n\n* Jack & Coke (Jack Daniels Tennessee Whiskey and cola)  \n* Jameson & Ginger (Jameson Irish Whiskey & Ginger ale)  \n* Vodka-Cran (Vodka & Cranberry juice)  \n* Mojito  (White Rum, mint, simple syrup & soda)  \n\nAll of those are gender-neutral, available at pretty much any bar, and are way easier to drink than a 15 year old Scotch \"neat\".  \n\nNote: A Mojito, if served with real mint leaves (as it should) is a somewhat complex drink, and deserves an above-average tip for the bartender.",
      "author": "VA_Network_Nerd",
      "created": 1638198075,
      "upvotes": 14,
      "replies": {
        "hmkdyqx": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkdyqx/",
          "text": "I’m surprised at the Jack & Coke suggestion. I’d think a Moscow Mule might be easier for a new drink.",
          "author": "vicemagnet",
          "created": 1638213518,
          "upvotes": 15,
          "replies": {
            "hmkx55l": {
              "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkx55l/",
              "text": "Jack and coke or rum and Coke’s are both really good and easy to go down imo",
              "author": "charlesdickinsideme",
              "created": 1638221188,
              "upvotes": 3,
              "replies": {
                "hml3aln": {
                  "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hml3aln/",
                  "text": "I think rum goes down easier than Jack. I’m not casting aspersions upon Jack, but my experience is that it burns more.",
                  "author": "vicemagnet",
                  "created": 1638223683,
                  "upvotes": 6,
                  "replies": {
                    "hml81f7": {
                      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hml81f7/",
                      "text": "Once upon a time, 30-something year old me went to Ireland thinking all I needed to know about whiskey cocktails was \"Jack & Coke\".  \n\nOff and on, I spent almost 12 weeks in the Savoy Hotel in Limerick, Ireland which features a top-notch bar staff who delivered an incredible education in the finer points of Irish Whiskey.  *(When you spend 3-4 hours a day, and a couple hundred euros a day in said bar, the conversation often drifts to alcohol.)*  \n\nRedbreast, Green Spot, Drumshando are all delightful when consumed neat.  \n\nBut Jameson and a splash of Ginger ale is a far sight easier to sip on than a Jack and Coke, IMO.  \n\nAfter years if not decades of being a Jack Daniels drinker, I'm pretty sure I have way more bottles of Irish in my cabinet than Tennessee Whiskey...",
                      "author": "VA_Network_Nerd",
                      "created": 1638225680,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "hmlrkfz": {
                  "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmlrkfz/",
                  "text": "Idk recommend a Cuba Libre over a rum and coke tho cuz the lime will help mask some of the strong alcohol taste",
                  "author": "TheBluRay",
                  "created": 1638234423,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hmk9s4j": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk9s4j/",
          "text": "mojitos are delicious, very sweet",
          "author": "thisisme1202",
          "created": 1638211837,
          "upvotes": 2,
          "replies": {}
        },
        "hmjwt6i": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjwt6i/",
          "text": "Highly recommend Guinness! It’s not for everyone but I can chug it like water. If you’re not a big carbonation fan then Guinness is the beer for you.",
          "author": "e_ndoubleu",
          "created": 1638206664,
          "upvotes": 3,
          "replies": {
            "hmk4rfh": {
              "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk4rfh/",
              "text": "Guinness when I drank was always my favorite beer. Although things like bud lite were the easiest to get down as a new drinker in my opinion even though they don't taste very good, they just don't really have any strong flavors and the taste of alcohol is like non existent. Had to stop drinking though because of health issues that were made worse with alcohol.",
              "author": "Reddituser8018",
              "created": 1638209845,
              "upvotes": 6,
              "replies": {}
            },
            "hmkjn7q": {
              "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkjn7q/",
              "text": "Guinness was my first drink (from a pub) when I was 17, I kinda hated it back then but now it's my go to order lol",
              "author": "smellytrashboy",
              "created": 1638215786,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmj02lj": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmj02lj/",
      "text": "I always find champagne a light, happy drunk.  And it’s appropriately celebratory!\n\nWine/beer is a good intro.",
      "author": "NoFilterNoLimits",
      "created": 1638191649,
      "upvotes": 6,
      "replies": {}
    },
    "hmj1z0o": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmj1z0o/",
      "text": "If you feel obligated to get a non beer/wine drink, do something simple like a rum and coke. You can ask them to water it down a bit (more coke less rum).\n\nWhatever you do stay away from high sugar drinks. If it has a cute name, avoid it. \n\nAll that said, you’re best off having a beer, or a glass of wine. Emphasis on “a”.",
      "author": "The_Nitram",
      "created": 1638192725,
      "upvotes": 4,
      "replies": {}
    },
    "hmjt1e1": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjt1e1/",
      "text": "Drink white claws/truly/etc or ciders. Both low alcohol and aren’t that harsh. Happy cake day! Do eat and stay hydrated",
      "author": "soykenito",
      "created": 1638205135,
      "upvotes": 1,
      "replies": {
        "hmk8b86": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk8b86/",
          "text": "They actually have more alcohol in them than a light beer",
          "author": "uglybutterfly025",
          "created": 1638211254,
          "upvotes": 10,
          "replies": {
            "hmkxgb4": {
              "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkxgb4/",
              "text": "Still not much",
              "author": "taybay462",
              "created": 1638221314,
              "upvotes": 5,
              "replies": {}
            },
            "hmlxwx6": {
              "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmlxwx6/",
              "text": "Most seltzer’s are 5% and light beers are around 3.2-3.4%. OP asked for good drinks that’ll give a lil taste of being drunk, a seltzer or cider would be their best bet bc it’s little higher alcohol % and taste better than majority of your domestic light beers",
              "author": "soykenito",
              "created": 1638237340,
              "upvotes": 2,
              "replies": {
                "hmmoz2f": {
                  "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmoz2f/",
                  "text": "American light beers are normally 4.2%. Bud Light, Miller Lite, Coors Light, Michelob Ultra etc are all 4.2%",
                  "author": "blackwhitetiger",
                  "created": 1638250403,
                  "upvotes": 1,
                  "replies": {
                    "hmmp7dv": {
                      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmp7dv/",
                      "text": "Ah, thank you for correcting me. I was thinking whenever typing out that 3% sounds a little too low but was too lazy to Google lmao",
                      "author": "soykenito",
                      "created": 1638250541,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmjb4sw": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjb4sw/",
      "text": "4loko",
      "author": "GabbaShanking",
      "created": 1638197418,
      "upvotes": 4,
      "replies": {
        "hmjwgf1": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjwgf1/",
          "text": "just in case op, this person is joking",
          "author": "JeeBeesus",
          "created": 1638206521,
          "upvotes": 31,
          "replies": {}
        },
        "hml5gc3": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hml5gc3/",
          "text": "I KOed myself first time a drank a 4loko",
          "author": "ORCA_OF_WALLST",
          "created": 1638224588,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmjhubp": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjhubp/",
      "text": "To add, you will have to try hard to get blackout drunk. You will absolutely not get wasted on just a light drink or two. So please don't be too worried! You're going in knowing you're being responsible, so at most you will likely get tipsy. Tell the bartender as well that it's your 21st, and so prefer lower alcohol drinks. They will be cognizant of it (and might even give you something special since it's your birthday). \n\nI second the recommendation of hard cider, since it tastes the best (imo) while still being alcoholic. I would probably stick to a maximum of two until you can better feel how alcohol affects you, or just one if you don't really want to get that tipsy. Depending on how long you'll be at the bar, you could probably have another one.\n\nHappy birthday, and good luck 🎂",
      "author": "MaddoxJKingsley",
      "created": 1638200461,
      "upvotes": 1,
      "replies": {}
    },
    "hmj4u8j": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmj4u8j/",
      "text": "Moonshine",
      "author": "elkfn2",
      "created": 1638194279,
      "upvotes": -2,
      "replies": {}
    },
    "hmjngg8": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjngg8/",
      "text": "Despite what everyone’s saying. I would get a mixed drink. You can sip it, not chug it. Look up some mixed drinks. They’re delicious. Some only have a shot in them. Don’t get beer, it’s a learning curve to like. Ciders okay",
      "author": "kapbear",
      "created": 1638202848,
      "upvotes": 1,
      "replies": {
        "hmkania": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkania/",
          "text": "I second this! I’m not a huge drinker but when I do drink, I love to have a fruity lil mixed drink with dinner. They taste great, not super strong usually, great to sip on. If it is strong, letting the ice melt helps.\n\nOP I think to help your anxiety, maybe consider going to dinner with friends and getting a drink with your meal. That way you also are not drinking on an empty stomach (in case you don’t know, drinking on an empty stomach is not a good idea as it can make alcohol hit you faster/harder).",
          "author": "xnelsdc",
          "created": 1638212184,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmjnxvz": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjnxvz/",
      "text": "Beer",
      "author": "HateInAWig",
      "created": 1638203049,
      "upvotes": 1,
      "replies": {}
    },
    "hmjkns4": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjkns4/",
      "text": "Just crack a 40, you’ll be fine",
      "author": "iamnotapopstar",
      "created": 1638201668,
      "upvotes": 1,
      "replies": {
        "hmkqbfk": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkqbfk/",
          "text": "Embrace local urchin, drink 40s and yell at pedestrians",
          "author": "PM_ME_UR_GAMECOCKS",
          "created": 1638218487,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmk4csh": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk4csh/",
      "text": "When you do go to a bar, bring a friend who is familiar with bars and you know won’t pressure you into over drinking.\n\nIn terms of drinks (at a bar) I’d ask for a **Moscow Mule**. Just drink that and see how you feel after a while and then grab a beer if you want to keep drinking.",
      "author": "23011447",
      "created": 1638209682,
      "upvotes": 16,
      "replies": {}
    },
    "hmjx0o4": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjx0o4/",
      "text": "Obviously you need a shot of Malort for your 21st",
      "author": "MilwaukeeMan420",
      "created": 1638206749,
      "upvotes": 6,
      "replies": {
        "hmkve73": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkve73/",
          "text": "Yes! It is relatively low alcohol.  Start drinking off with the good old Chicago handshake!",
          "author": "spoung45",
          "created": 1638220495,
          "upvotes": 1,
          "replies": {}
        },
        "hml3w8i": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hml3w8i/",
          "text": "🤢🤢",
          "author": "LaPetitFleuret",
          "created": 1638223933,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmkd2vw": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkd2vw/",
      "text": "Tips: \n1. Be hydrated before you drink any alcohol. You don’t want to be drinking alcohol because you’re thirsty, drink it sparingly for its effects. \n\n2. Order a glass of water with each alcoholic beverage you have. It’s a lot harder to over do it when you also sip water all night. \n\n3. There’s a lag time between when you take a shot or have a drink and when you feel it’s effects. So wait a while between drinks and see how you feel. \n\n4. The first part of your brain to go when you’re inebriated is your ability to self monitor. So you aren’t going to accurately assess how intoxicated you are as the night progresses. Because of this, it’s best to give yourself and your waitress an upper limit. Say three drinks or whatever you choose, for the entire night. Stick to it. \n\n5. Eat. Eat before hand and nibble throughout the night. \n\n6. Only drink with people who aren’t going to push you into getting shwasted. If you don’t know whether or not your company is going to encourage you to over do it, then only have a drink or two and see how they respond. Now you know what to expect from those people in the future. \n\n6. Ask for cocktails or highballs. Only get singles, ask for them to be in a large glass with no ice. It’ll take you longer to finish them so it’s less likely they will go to your head. \n\n7. Remember that you’re drinking to feel a warm, light relaxed feeling. Not like you can’t control your body and words. \n\nI hope you have a fun night and remember it all the next morning. ❤️",
      "author": "tiny_sweaters",
      "created": 1638213163,
      "upvotes": 5,
      "replies": {}
    },
    "hmjzdlz": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjzdlz/",
      "text": "White claws!!",
      "author": "Anything-Still",
      "created": 1638207709,
      "upvotes": 7,
      "replies": {}
    },
    "hmk8df0": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk8df0/",
      "text": "My go to is Michelob ultras. The lightest watery beer that’s easy to drink and two will give you a decent buzz",
      "author": "uglybutterfly025",
      "created": 1638211278,
      "upvotes": 3,
      "replies": {}
    },
    "hmk96jc": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk96jc/",
      "text": "I like to make my friends a tequila sunrise. I think you’ll like it. It’s a mix of Tequila, orange juice and grenadine. It’s delicious and super simple",
      "author": "E-ER-ERI-ERICS",
      "created": 1638211598,
      "upvotes": 3,
      "replies": {}
    },
    "hmkfqqg": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkfqqg/",
      "text": "I'm a sweet-drink person (spat out beer when my dad made me try it lmao) so I just went with a vodka coke for my first drink (about a week and a half after my 21st). YMMV. I also accidentally made a triple but was fine - just lightly tipsy, as expected given that my tolerance was zilch, but better than expected, given that it was a triple. But also it was a tall glass and the rest of the glass was full of coke, which diluted it a bit. Idk. Everyone's body and mind reacts differently to alc.",
      "author": "TigerShark_524",
      "created": 1638214229,
      "upvotes": 3,
      "replies": {}
    },
    "hmkim8g": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkim8g/",
      "text": "Honestly I feel like what you drink matters less than what you eat and drink beforehand/during. I'm also a huge lightweight, but the first time I drank with friends we ate a shit ton of pizza, brownies, chips, etc. We drank red wine and vodka and I got drunk very slowly and was able to notice how I was being affected. The second time we started earlier and didn't eat anything beforehand, I went from sober to black out drunk before I could blink 😂\n\nSo basically, fill your stomach with carb heavy food beforehand and drink slowly, alternating with water. If you're sitting, get up once in a while to check your balance.\n\nLastly, I know we've all heard about the dangers of alcohol our entire lives, but I promise you it isn't as scary as it seems. Even if you're 90 pounds and drinking on an empty stomach, ONE drink is going to get you tipsy at best. Have a great 21st!",
      "author": "iriedashur",
      "created": 1638215374,
      "upvotes": 3,
      "replies": {
        "hmkin7m": {
          "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkin7m/",
          "text": "90 pounds is 100.0 Doge plushies.",
          "author": "useles-converter-bot",
          "created": 1638215385,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hmkq63s": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkq63s/",
      "text": "Vodka Red Bull",
      "author": "PM_ME_UR_GAMECOCKS",
      "created": 1638218428,
      "upvotes": 2,
      "replies": {}
    },
    "hmkt3pr": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkt3pr/",
      "text": "Trust me as something with anxiety, it’s going to make that dissipate, not increase if you’re drunk.",
      "author": "MagicJava",
      "created": 1638219585,
      "upvotes": 2,
      "replies": {}
    },
    "hmley4d": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmley4d/",
      "text": "Do not drink a Long Island Iced Tea!!!🤣",
      "author": "noob2coin",
      "created": 1638228675,
      "upvotes": 2,
      "replies": {}
    },
    "hmk9p3e": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk9p3e/",
      "text": "Four lokos. 2 of them in 20 minutes",
      "author": "juanchorules",
      "created": 1638211803,
      "upvotes": 1,
      "replies": {}
    },
    "hmkcacf": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkcacf/",
      "text": "Everclear straight",
      "author": "carebarry",
      "created": 1638212844,
      "upvotes": 1,
      "replies": {}
    },
    "hmn2uev": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmn2uev/",
      "text": "Everclear",
      "author": "NicelyDone2022",
      "created": 1638260196,
      "upvotes": 1,
      "replies": {}
    },
    "hmjy980": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmjy980/",
      "text": "Good ol fashion domestic beer. If you don’t like the taste then you’ll be drinking it slower. You can drink atleast 4 and not be too drunk. And with everyone you drink you have a good idea of where the wagon is taking you. Whereas mixed drinks can make you hit a wall fast. Just sip some bud light, Miller light, Coors light, etc..",
      "author": "greasypeasy",
      "created": 1638207254,
      "upvotes": 1,
      "replies": {}
    },
    "hmk4ttz": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk4ttz/",
      "text": "Beer, cider, or hard seltzer. Those are the safest and lowest alcohol content. Two or three wont get you blackout drunk. \n\nBeer: lots of variety, great to get from tap, but filling\n\nCider: less variety, great taste, but hit or miss depending on the person\n\nHard seltzer: Lots of variety, low alcohol content, not filling, but can be a bit boring after a while.",
      "author": "spikeknight1",
      "created": 1638209871,
      "upvotes": 1,
      "replies": {}
    },
    "hmk9nqk": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmk9nqk/",
      "text": "Just drink 2 drinks either shots or light beers/seltzers. See how you feel after that and continue drinking if you want. FYI dizzy is too far gone, if the room is spinning, you’ve drunk too much.",
      "author": "Parking_Cranberry935",
      "created": 1638211788,
      "upvotes": 1,
      "replies": {}
    },
    "hmki221": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmki221/",
      "text": "Hard ciders are good like others said. I like Moscow mules (vodka, ginger soda, and lime). Very tangy.",
      "author": "pokemonareugly",
      "created": 1638215150,
      "upvotes": 1,
      "replies": {}
    },
    "hmkj2hz": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkj2hz/",
      "text": "In my country most people start off drinking as teenagers with beer or cider.\n\nIf you don't want to get too drunk, get the 330 ml bottles or cans, not the 500 ml ones, eat food, pace yourself and stay hydrated. \n\nDon't be afraid to say no to shots. If you do take them then try to wait 15-20 minutes before taking another drink.\n\nIf you're happy with your level of drunk don't assume that drinking more will make you feel even better.",
      "author": "smellytrashboy",
      "created": 1638215554,
      "upvotes": 1,
      "replies": {}
    },
    "hmkqs3e": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkqs3e/",
      "text": "As somebody else said, hard ciders are probably the easiest thing start with. If you go out somewhere to drink, most places will have one or more varieties available. \n\nAlso, for your anxiety, I would recommend not going out to a bar or club to drink. Instead, you might want to stay home or at a friend's house, and drink for the first time there. Staying home means you're in a controlled environment and won't have to deal with loud sounds or strange people setting off your anxiety. If you have people that you feel particularly safe around, it may also be good to invite them and have them be with you.",
      "author": "Terwin95",
      "created": 1638218670,
      "upvotes": 1,
      "replies": {}
    },
    "hmktm5x": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmktm5x/",
      "text": "Michelada. \n\nIt's half beer and half tomato cocktail-\nI like Dos XX for the beer and Clamato for the tomato.\n\nYou're only drinking half a beer and it tastes really good! Spices like chili powder and pepper are common additives.\n\nI introduced these to my Dad, he's 57, these are his new go to. I learned about them in California.\n\nHappy Birthday!",
      "author": "WiteChalkLit",
      "created": 1638219784,
      "upvotes": 1,
      "replies": {}
    },
    "hmkzj72": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkzj72/",
      "text": "Seagrams! Taste great and only 3% alc",
      "author": "flying_penguin104",
      "created": 1638222150,
      "upvotes": 1,
      "replies": {}
    },
    "hmkzk8e": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmkzk8e/",
      "text": "Wine!",
      "author": "lazairiaw",
      "created": 1638222161,
      "upvotes": 1,
      "replies": {}
    },
    "hml57bo": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hml57bo/",
      "text": "normal beer",
      "author": "ORCA_OF_WALLST",
      "created": 1638224482,
      "upvotes": 1,
      "replies": {}
    },
    "hmlc5ym": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmlc5ym/",
      "text": "wine coolers",
      "author": "Meow17PC",
      "created": 1638227445,
      "upvotes": 1,
      "replies": {}
    },
    "hmm2eh6": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmm2eh6/",
      "text": "Seagrams escapes",
      "author": "FigBar_",
      "created": 1638239347,
      "upvotes": 1,
      "replies": {}
    },
    "hmmde7e": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmde7e/",
      "text": "Everclear.",
      "author": "ObamaEnjoyer67",
      "created": 1638244326,
      "upvotes": 1,
      "replies": {}
    },
    "hmmmfdj": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmmfdj/",
      "text": "As far as beverages go beer usually has the lowest percentage alcohol by volume so start there if you just want to try it out. Wine and liquor will be much stronger. My advice is just to go slow until you learn how you react to alcohol (start with one and don’t chug it all immediately, also don’t go for shots right out of the gate). The most important thing is to stay safe. Don’t drive drunk and don’t get drunk with people you don’t trust. I’m a big fan of experimenting at home with a friend or two and just trying a few things in a controlled environment at first rather than going out to a bar full of strangers to drink for the first time.",
      "author": "QueenOfEndor21",
      "created": 1638248924,
      "upvotes": 1,
      "replies": {}
    },
    "hmmnupw": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmnupw/",
      "text": "My favorite drink is a mixed drink. It’s a few shots of Malibu (which tastes like coconut), a little sprite, cranberry juice, and a little lemonade. You can add as much or as little as you’d like.",
      "author": "TemporaryBonus1078",
      "created": 1638249737,
      "upvotes": 1,
      "replies": {}
    },
    "hmmp1tr": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmp1tr/",
      "text": "Don't fall in love too hard alcoholism is a bitch and don't do something dumb",
      "author": "cokeboofer69",
      "created": 1638250449,
      "upvotes": 1,
      "replies": {}
    },
    "hmmw8ui": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmw8ui/",
      "text": "Cool, I'm turning 21 in about a month from now but I wouldn't drink because it's not my thing but that's cool that you are around my age",
      "author": "7heSi1ver0wl",
      "created": 1638255126,
      "upvotes": 1,
      "replies": {}
    },
    "hmmxr9v": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmmxr9v/",
      "text": "If you’re taking certain medications be careful about how much you drink. with SSRIs your first drink can feel like 3\n\n\nEdit: based on personal experience w/ zoloft and duloxetine. i drank a couple times while on those meds and completely forgot about the alcohol warning on my meds. i didn’t black out but felt super super tipsy after just having a couple shots and a white claw.",
      "author": "shrewbs",
      "created": 1638256208,
      "upvotes": 1,
      "replies": {}
    },
    "hmn8k8v": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmn8k8v/",
      "text": "Beer",
      "author": "heysuraj",
      "created": 1638265183,
      "upvotes": 1,
      "replies": {}
    },
    "hmneo6a": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmneo6a/",
      "text": "This isn't a recommendation but, I have anxiety as well and actually find that I'm less anxious when I'm drinking and if I do ever feel anxious while drunk my brain is dumb enough to ask my friends for help. (I say dumb enough because when I'm sober asking for help is really hard for me to do.)",
      "author": "A_Dandelion11",
      "created": 1638270451,
      "upvotes": 1,
      "replies": {}
    },
    "hmlia1c": {
      "link": "/r/college/comments/r4vi99/best_drink_for_lightweights/hmlia1c/",
      "text": "Probably ciders/beer/other low percent alcoholic drinks. Don’t shotgun, or do shots.",
      "author": "nwi210",
      "created": 1638230168,
      "upvotes": 0,
      "replies": {}
    }
  }
}