{
  "sid": "qmdkzm",
  "link": "/r/college/comments/qmdkzm/is_it_worth_getting_snapchat/",
  "title:": "Is it worth getting Snapchat?",
  "text": "I've never been much of a social media user and have never had IG, SC, FB etc. I never felt like it's something I'd ever want or need to use so I just don't have any of it. But I've been thinking about getting snap because so many people have it and it's easier to ask for that (vs a phone number which is too formal/implies other things sometimes, or discord because it's embarrassing to admit I have one). I hadn't really thought about it much because nobody's ever asked me for that kind of stuff anyways, so I figured why would I need it if I'd never use it. There have been a couple of times lately though where it's been a bit awkward because someone asked if I was on snap and wanted to add me but I told them I wasn't on it (and still am not).\n\nI don't want those awkward situations to happen again so just in case I've thought about getting it, but idk if it would be worth it considering I've never used it before and I don't really get how it works, or the general culture behind it. Is it worth getting now even though I've never used it?",
  "author": "redcrimson75",
  "created": 1636003207,
  "updated": 1636137449,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hj8ysba": {
      "link": "/r/college/comments/qmdkzm/is_it_worth_getting_snapchat/hj8ysba/",
      "text": "i would recommend not to 😭\n\nlife without social media is much more tranquil and tbh saying \"i dont use social media\" is much better in these situations\n\nalso idk if thats something u had in mind but when someones flirting w u giving ur number instead of snapchat is much more interesting",
      "author": "cocteautwinx",
      "created": 1636003442,
      "upvotes": 2,
      "replies": {
        "hj8ziyr": {
          "link": "/r/college/comments/qmdkzm/is_it_worth_getting_snapchat/hj8ziyr/",
          "text": "True but I'd hate to shut down a potential friendship because I don't have something to use to talk to them outside of face to face interactions (especially if it's someone I don't see in person much), and I don't wanna ask for a number or something like that instead because then that could be awkward.\n\nI don't plan on using IG or stuff like that still but I'm thinking about sc only because it might be useful for talking to people when I have a rather unsocial life \n\nAlso I've never been flirted with but if somehow things ever headed that direction, then yeah I'd use my number because it just makes sense in that context",
          "author": "redcrimson75",
          "created": 1636003980,
          "upvotes": 3,
          "replies": {
            "hj96692": {
              "link": "/r/college/comments/qmdkzm/is_it_worth_getting_snapchat/hj96692/",
              "text": "I only use Snapchat to talk to friends on the chats, twitter for sports/news, and that’s about it. You can use a social media without posting on it every day and letting it consume you.",
              "author": "Jfogs2020",
              "created": 1636009317,
              "upvotes": 2,
              "replies": {
                "hjdb5vo": {
                  "link": "/r/college/comments/qmdkzm/is_it_worth_getting_snapchat/hjdb5vo/",
                  "text": "That's what the plan was anyways, using it just to talk to people on but not post and shit. One of my friends might get it too do idk. I'm still unsure of it solely because idk how people use it so I'm way far behind",
                  "author": "redcrimson75",
                  "created": 1636080547,
                  "upvotes": 1,
                  "replies": {
                    "hjdbm45": {
                      "link": "/r/college/comments/qmdkzm/is_it_worth_getting_snapchat/hjdbm45/",
                      "text": "People either use it to talk to friends or post their whole life story. I don’t do that second one",
                      "author": "Jfogs2020",
                      "created": 1636080768,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}