{
  "sid": "rewl6t",
  "link": "/r/college/comments/rewl6t/got_excited_today/",
  "title:": "Got Excited Today",
  "text": "I got excepted into college for the fall this upcoming year. I’m so so excited and nervous. I’m gonna try to have remote learning bc the program I signed up for is out of town and I don’t drive.\nI still have to take a test to see where my knowledge is at. I don’t know if this means my high school info was already sent to the college as well for proof I graduated.\nIf I’m gonna do classes with remote learning. Does anyone know if I truly have to go on campus and how much extra information I would have to give the school?\nI’m trying to do everything right and get everything done sooner than later. I prefer to be ahead before classes start 😅\nI’m just super psyched that I’m finally getting into college. Even though I may not be some teen and starting in my 20s. I’m determined to learn. To do my best and try to get ahead while I can.\nAny advice from anyone that may have knowledge on remote learning? Even anyone that may have advice or encouraging words? We all shall have each others back for good and rough times.\nI’m planning to keeping this group updated with my journey and I hope you all are willing to be apart of it. Even if it’s just a small piece of life. You all are amazing and don’t give up. No matter if you feel old or have a late start in life.\nNothing is easy, which will make things more special in the long run. Never give up and I hope we all can become fiends/acquaintances in the end of the day 😇",
  "author": "Mistress2021Toises",
  "created": 1639338241,
  "updated": 1639516525,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hoaooal": {
      "link": "/r/college/comments/rewl6t/got_excited_today/hoaooal/",
      "text": "congrats on your acceptance!",
      "author": "awesome_arthistorian",
      "created": 1639343862,
      "upvotes": 2,
      "replies": {
        "hob6z8z": {
          "link": "/r/college/comments/rewl6t/got_excited_today/hob6z8z/",
          "text": "Thank you so so much. I’m so excited and nervous 😅😇",
          "author": "Mistress2021Toises",
          "created": 1639351534,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}