{
  "sid": "q2bipp",
  "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/",
  "title:": "How do you have fun at parties without drinking/smoking/etc?",
  "text": "I went to a frat party with a group of friends last weekend, and I felt super out of place. Almost everyone was drinking/or had drunk a bit, and that seemed to be like the main activity besides listening to music. I had a lot of fun, but I don't drink or smoke because of some childhood shit, but I don't mind being around it especially when its girls my age and stuff like that. But every time I declined an offer to smoke or drink people looked at me weird, even my friends, and I felt like sort of on the outside?? They weren't pressuring me or anything but they seemed to think that there was no point in me coming, or at least they gave off that vibe if that makes sense. So I guess I'm wondering what else to do at parties besides drink (not there's anything wrong with it!! It's just a personal choice on my end) or just how to deal with it without killing the vibe?",
  "author": "bittersweet_teaa",
  "created": 1633488471,
  "updated": 1634083664,
  "over_18": false,
  "upvotes": 70,
  "upvote_ratio": 0.92,
  "comments": {
    "hfka9gk": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfka9gk/",
      "text": "Hmmm. That’s a hard one. I have one suggestion tho! Maybe carry around a red solo cup or something similar but with something non alcoholic in it, might prevent people from asking you if you want a drink.",
      "author": "alexakadeath",
      "created": 1633490963,
      "upvotes": 98,
      "replies": {
        "hfkc209": {
          "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfkc209/",
          "text": "this is solid. but also dont give a fuck, if you are happy with your actions then fuck it",
          "author": "leosmoke420",
          "created": 1633491957,
          "upvotes": 63,
          "replies": {}
        }
      }
    },
    "hfkdrmm": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfkdrmm/",
      "text": "Sounds like you did have fun. Second carrying around a cup to deflect some inquiries but do what is right for you.  Honestly drunk people rarely pay much attention to what others are doing.",
      "author": "Significant-Equal-12",
      "created": 1633492945,
      "upvotes": 50,
      "replies": {
        "hfkpmyb": {
          "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfkpmyb/",
          "text": "This. Some of my craziest, wildest and most fun parties were the ones where I didn’t drink. \n\nIf you have fun and enjoy yourself, most people won’t even notice if you’re not drinking. \n\nAnd hey, get the cup if it makes you feel better, but I’ve never once had people insist once I’ve gone “nah, I’m not drinking tonight” \n\nA couple of times they didn’t even believe I was sober lol. \n\nA thing you will learn if you continue going to parties and not drinking: people always assume everyone else is as drunk as they are, regardless of their level of drunkness. \n\nJust have fun :)",
          "author": "Flumphs_Lair",
          "created": 1633500947,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "hfksqcc": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfksqcc/",
      "text": "Well that’s frats for you, there’s gonna be drinking and smoking and whatnot. If that’s not your scene then just don’t go, parties aren’t really for you. Instead have some fun by yourself or with other friends!",
      "author": "Lifedeather",
      "created": 1633503500,
      "upvotes": 48,
      "replies": {}
    },
    "hfkwrpl": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfkwrpl/",
      "text": "I felt this way when I went to my one and only party in hs. I didn’t drink or smoke back then and felt pretty out of place too. Something I did do though, aside from carry my own red cup of water, was start picking up all the empty cans and bottles once I saw someone drop and break one. People would ask me what I was doing, I’d tell them, if they acted weird I just said it’s better than someone getting cut on broken glass, and from there a conversation of some kind would be started. I met a lot of cool people and got some free recyclables. Just an idea, the people who own/live in the house will probably think you’re pretty cool at least.",
      "author": "Former_Afternoon9662",
      "created": 1633507072,
      "upvotes": 7,
      "replies": {}
    },
    "hflgwb7": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hflgwb7/",
      "text": "Work out before you go to the function and tell everyone you’re off da endorphins",
      "author": "KodakEchelon",
      "created": 1633523142,
      "upvotes": 8,
      "replies": {}
    },
    "hfl4vj6": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfl4vj6/",
      "text": "Most frat parties are gonna be some of the lamest you’ll go to being a sober person. Too loud to connect with anyone new, crowded, beer pong is the only thing to do, etc. \n\nBut I’m surprised your friends look at you weird for turning down drinks and smokes instead of having your back and hyping up the fact that you enjoy yourself without it to strangers who ask. Are they close friends?",
      "author": "Saint_Bo_Dallas",
      "created": 1633514810,
      "upvotes": 19,
      "replies": {}
    },
    "hfke6wp": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfke6wp/",
      "text": "Drink something bitter nasty you will in place.  I command you for not getting influenced but others.  I wish I could go back 20 years and tell\nMy dumb ass to not drink. It was waste of time and money. It was also 3rd class low life style.  Wish I had done it differently.  Stay strong.",
      "author": "xplode145",
      "created": 1633493194,
      "upvotes": 11,
      "replies": {
        "hfksteu": {
          "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfksteu/",
          "text": "We in this together brotha",
          "author": "Lifedeather",
          "created": 1633503572,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hflhqk7": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hflhqk7/",
      "text": "People I knew played drinking games with a pinch-drinker. If anyone gives you shit you can always say you’re DD if you don’t want to talk about the reality. I had a bus driver friend who legally couldn’t drink within like 12 hrs of a shift so there’s always work excuses. Smoking is easy, say you get drug tested randomly for some reason. But that’s just me, I tend to reach for a lie instead of being real, and it works better on people you aren’t friends who know better. \n\nOtherwise dance, watch whatever was on Tv, chat. Having a cup full of water is a nice distraction for drunk busybodies who just MUST comment.",
      "author": "Plantsandanger",
      "created": 1633523647,
      "upvotes": 2,
      "replies": {}
    },
    "hflrk0a": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hflrk0a/",
      "text": "Carry a cup of soda or water.",
      "author": "Logical_Substance_52",
      "created": 1633528643,
      "upvotes": 2,
      "replies": {}
    },
    "hfltam0": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfltam0/",
      "text": "Having sobered a lot of my fraternity's parties it's very possible to enjoy being sober. First off, the empty/non-alcoholic cup is a great idea that I've used before. Second, hit the dance floor. Most parties have one, you don't have to be a great dancer (most people won't notice good or bad by the end of the night) but as long as you're vibing to the music and look like you're enjoying yourself people feed off of that.\n\nAnd if they aren't your scene, that's fine too. A lot of organizations have parties they throw that probably won't be as crowded or consumption-centric.",
      "author": "JohnLeRoy9600",
      "created": 1633529431,
      "upvotes": 2,
      "replies": {}
    },
    "hfmchaf": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfmchaf/",
      "text": "If you still want to go to frat parties, bring your on drinks. Seltzer water, canned juice, whatever. Even play drinking games with them. Turns out you can play any drinking game exactly the same way with just a nonalcoholic drink. If you have something in your hand, people are much less likely to ask you if you want a drink. If you explain to people that you're sober most people will respect it. People that don't aren't worth your time anyways. I have a frat brother that doesn't do any substances any more because of how much he did in college and does exactly these things now. Whenever we're playing drinking games he just brings his own nonalcoholic beverage. If parties really aren't you're seen, try to find a group of friends where partying isn't everything they do. Paries are exhausting. Small social/board game nights are tons of fun and you have a better chance of getting to know people much more intimately.",
      "author": "TheGayWildGoose",
      "created": 1633537488,
      "upvotes": 2,
      "replies": {}
    },
    "hfmh2jv": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfmh2jv/",
      "text": "Just watch drunk people do stupid stuff from a safe distance. It’s hilarious",
      "author": "CriticalZach",
      "created": 1633539375,
      "upvotes": 2,
      "replies": {}
    },
    "hfmpv5o": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfmpv5o/",
      "text": "as other said, carry a solo cup with you. or even like a styrofoam cup w a straw from a gas station cuz that’s common for people to put their alcohol in to hide the fact it’s alcohol. \n\ni’m a big introvert & personally cannot have fun at parties without at least some alcohol, so props to you for being able to make it work.\n\nedit to add if people question it you could say something about how you drank way too much the night before & are taking a break, or something to that effect. i’ve said that before when it was true & nobody gave it a second thought",
      "author": "scorpiopathh",
      "created": 1633542985,
      "upvotes": 2,
      "replies": {}
    },
    "hfn4wtz": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfn4wtz/",
      "text": "If you not drinking and smoking kills the vibe, that party was a shit show to begin with. \n\nQuit worrying about what other people think, fuck em. You do you and it'll contribute to the party.\n\nThere's more culture in asking what you're drinking than actually giving a shit. It's like the typical casual conversation of those places.",
      "author": "Awkward_Mail_2786",
      "created": 1633549425,
      "upvotes": 2,
      "replies": {}
    },
    "hfncj3u": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfncj3u/",
      "text": "If you had fun, that’s all that matters :). \n\nIf you felt out of place for enjoying what you’re doing, maybe that group of people isn’t for you? Which is no problem, as it happens to everyone. I’m sure you’ll find your people soon, if you haven’t already! Best wishes :)!",
      "author": "meme_mac_and_cheese",
      "created": 1633552623,
      "upvotes": 2,
      "replies": {}
    },
    "hfnellj": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfnellj/",
      "text": "This sounds dumb, but I feel like this is asking \"how do I enjoy riding in a car, if I don't like anything about being in a car\" lol\n\nI don't blame you one bit.  I'm the same exact way.  You just have to find other parties.  I hate drinking/smoking because it always devolves the situation.  You can't have deep or interesting conversations as well.  Someone always gets super loud and derails stuff... and hey, that's fun for some people which is great.  If its not fun for you, there's nothing you can do besides find different parties.",
      "author": "throwawayyyyout",
      "created": 1633553508,
      "upvotes": 2,
      "replies": {}
    },
    "hfnjcvd": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfnjcvd/",
      "text": "Say you’re the designated driver if you feel like you’re getting judged",
      "author": "NibPlayz",
      "created": 1633555573,
      "upvotes": 2,
      "replies": {}
    },
    "hflxspq": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hflxspq/",
      "text": "Organize a game night or some shared group activity like hiking",
      "author": "nataliazm",
      "created": 1633531402,
      "upvotes": 1,
      "replies": {}
    },
    "hfoucu9": {
      "link": "/r/college/comments/q2bipp/how_do_you_have_fun_at_parties_without/hfoucu9/",
      "text": "Just milk one beer",
      "author": "ORCA_OF_WALLST",
      "created": 1633578716,
      "upvotes": 1,
      "replies": {}
    }
  }
}