{
  "sid": "r6a7nq",
  "link": "/r/college/comments/r6a7nq/stem_majors_how_the_hell_do_you_guys_do_it/",
  "title:": "Stem majors, how the hell do you guys do it?",
  "text": "I'm already struggling with a three course/11 credit load (two 3 credit math courses, one 5 credit physics course), and I'm not nearly as busy as other stem students/engineers who are doing 4 or more courses plus extracurriculars and part time jobs. Seriously, your time management skills are too op. Tell me your secrets (besides telling me to get off Reddit).",
  "author": "Magical_critic",
  "created": 1638347843,
  "updated": 1638480391,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hms49zf": {
      "link": "/r/college/comments/r6a7nq/stem_majors_how_the_hell_do_you_guys_do_it/hms49zf/",
      "text": "It's easy, just don't have a life. I worked at an EE lab for the last year and every engineer agreed that they had little to no social life in college lmao.",
      "author": "maora34",
      "created": 1638354179,
      "upvotes": 5,
      "replies": {}
    },
    "hmsv7h8": {
      "link": "/r/college/comments/r6a7nq/stem_majors_how_the_hell_do_you_guys_do_it/hmsv7h8/",
      "text": "Make a schedule and keep to it. Include time off for fun. \n\nStudy often and in small amounts. 30 Min every day will do more for you than 6 hours on Sunday.\n\nSleep. Go to bed early and wake up early. Seeing the sun rise and set does wonders for your mental health/abilities.\n\nLearn to love the process of learning. Don't seek grades but congratulate yourself for understanding concepts. You'll have definitive successes everyday.",
      "author": "hdorsettcase",
      "created": 1638370472,
      "upvotes": 3,
      "replies": {}
    },
    "hmu93up": {
      "link": "/r/college/comments/r6a7nq/stem_majors_how_the_hell_do_you_guys_do_it/hmu93up/",
      "text": "- you have to enjoy it. if you don’t enjoy science and math, you’re going to drown. it’s a lot of work that can you really only get through if you have the motivation to do it. \n- stay organized. stick to a schedule, keep all of your assignments and deadlines written down, and take good notes. \n- don’t do it alone. i’m a pretty med major and i don’t know another stem major who does this shit all on your own. form study groups - people who can not only help you understand the material but also will help hold you accountable for staying on top of your shit. \n- sleep. you can’t do this if you don’t sleep enough. instead of cramming 5 hours of studying all on the night before an exam, spread it out. study one chapter a day until the day of your exam, and go to bed earlier. my mom always says, if you’re ever deciding between studying and sleeping, sleep. your notes aren’t going anywhere, and studying is useless if your brain is too tired to retain anything and you won’t even remember it tomorrow.",
      "author": "trinitypisarsky",
      "created": 1638390195,
      "upvotes": 2,
      "replies": {}
    }
  }
}