{
  "sid": "rbzhzc",
  "link": "/r/college/comments/rbzhzc/offered_ta_position_for_class_i_have_a_c_in/",
  "title:": "Offered TA Position for Class I Have A C- In",
  "text": "My professor has offered me a teaching assistant position for next semester. I participate in class but I have earned Cs on all the assignments and examinations. I probably got a D on the final exam, which I took Monday. This course was a GenEd biology class, which was pretty difficult for me, but I was focused on solely passing with a C. I was honest and mentioned this to my professor, but she insisted that I reach out if I am interested. Would it be unprofessional to reach out despite my below-average, but more than mediocre performance in the class? I could use the money",
  "author": "fleursdefer",
  "created": 1638993345,
  "updated": 1639517182,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.87,
  "comments": {
    "hnrfj7t": {
      "link": "/r/college/comments/rbzhzc/offered_ta_position_for_class_i_have_a_c_in/hnrfj7t/",
      "text": "If the professor reached out they likely see your hard work and know you have the drive to do it",
      "author": "GoldRequest",
      "created": 1638994821,
      "upvotes": 11,
      "replies": {}
    },
    "hns3a05": {
      "link": "/r/college/comments/rbzhzc/offered_ta_position_for_class_i_have_a_c_in/hns3a05/",
      "text": "Take advantage of it. Getting a TA position is not easy. I could have a D in that class and still accept it. Poor grades are just stepping stones for you to learn upon,  everyone who made it big likely went through imposter syndrome when they first started out. Likewise having a TA position will greatly help your portfolio once you graduate.",
      "author": "ecstatic-hatter",
      "created": 1639004084,
      "upvotes": 4,
      "replies": {}
    },
    "hnt5603": {
      "link": "/r/college/comments/rbzhzc/offered_ta_position_for_class_i_have_a_c_in/hnt5603/",
      "text": "You're still gonna know more than the Freshmen in class so don't sweat. Like others have said, it'll boost your resume and be a great experience for you.",
      "author": "Baby_Angel_0018",
      "created": 1639021005,
      "upvotes": 1,
      "replies": {}
    }
  }
}