{
  "sid": "q4htvf",
  "link": "/r/college/comments/q4htvf/exhausted_and_unsure_why/",
  "title:": "Exhausted and unsure why",
  "text": "This is my sixth year in university finishing up my bachelors in Business econ and and I definitely am getting senioritis. \n\nSome background: I just got terminated from my job but, I have enough savings to cover my housing, car, insurance, food, and still with a little extra to splurge; for virtually my entire time in school I was working 50+ hours. Currently, I am taking this opportunity to just be a student.    \n\n\nYet, I feel extremely overwhelmed with the course work, I am taking 4 upper division classes and getting more involved with my school.  Which feels extremely odd since, I have had more on my plate before yet never felt this mentally drained. While I am lowkey blaming the change in weather, I am not sure why I feel so overwhelmed.   \n \n\nAnyone else feel this way?",
  "author": "Mr_ADR",
  "created": 1633771204,
  "updated": 1634588885,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hfz2fk7": {
      "link": "/r/college/comments/q4htvf/exhausted_and_unsure_why/hfz2fk7/",
      "text": "Weather changes are real and so are my headaches that come with them. I just got a watch with a barometer on it and holy god. I can explain 75% of my headaches with that thing. \n\nStart eating better! It was a huge step for me that improved my day to day. I'm not sure what will work for you but eliminating processed food and fast food will do wonders. Whole foods are absolutely the best for you. In the end it saves you money too. I somehow ended up being vegetarian and it's stuck for the better part of a decade now. \n\nMake sure you're getting sleep. At least 8 hours. None of this 7 hours is enough bull shit.",
      "author": "Awkward_Mail_2786",
      "created": 1633781780,
      "upvotes": 2,
      "replies": {
        "hg0j9ub": {
          "link": "/r/college/comments/q4htvf/exhausted_and_unsure_why/hg0j9ub/",
          "text": "Yeah I agree since Covid started I do my best to eat at home; I saved so much I was able to pay off all of student debt. \n\nAny recommendations for getting better quality sleep? I notice myself only able to sleep 6 hours of sleep; it’s all my body will allow me to rest.",
          "author": "Mr_ADR",
          "created": 1633807007,
          "upvotes": 1,
          "replies": {
            "hg3jxja": {
              "link": "/r/college/comments/q4htvf/exhausted_and_unsure_why/hg3jxja/",
              "text": "Go to bed at the same time and wake at the same time. Stick to it very strictly. If you end up staying late on the weekend, try to wake at the same time. If you wake up late one day, go to bed at the same time. Rinse and repeat. \n\nAfter a decade being institutionalized by the first shift work force, I'm stuck going to bed around 10 and waking at 6-7. It works for me. \n\nI don't give a shit what anybody says on here but the whole being productive at night is horse shit. Be productive during the day. That's how the world works. Convincing yourself to lose sleep because you seem more productive at night is silly as shit. If that's the case, you need to learn to be productive during the day. Otherwise, it'll catch up to you hard when you have to get a job out of college. Then it'll be a month or two of trying to catch up which will obviously show to your new employer in your performance because you're a zombie. Nothing like a good impression.",
              "author": "Awkward_Mail_2786",
              "created": 1633870463,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hg08499": {
      "link": "/r/college/comments/q4htvf/exhausted_and_unsure_why/hg08499/",
      "text": "Losing a job is a major stressor and is exhausting (regardless of if you put the chance to good use - and good on you for that).\n\nHave aboslutely everything be all new all the time is also a major thing, requiring more sleep, and making you be more tired.\n\nEverything you did before , much of it did not consciously require you to think about consciously (new spatial mapping, new schedule new deadlines, new names, new faces, where the bathroom in, new buttons on your computer) now requires active cognitive load.\n\nSocial things, 5 different sets of instructions (use a pdf, dont use a pdf)\n\nPeopel make fun of college students and babies for sleeping so much, but there are few times when anyone has that much stuff in working memory and such a volume of new information.\n\nAlso burnout is cumulative.\n\nThe constant exhaustion and feeling overwhelmed is the canary in the coal mine of mental health warnings.\n\nTry to do something to deal  - counseling center, mini breaks, a day out hiking.  Easier said than done I know.\n\nAnyway good luck",
      "author": "PersephoneIsNotHome",
      "created": 1633802024,
      "upvotes": 1,
      "replies": {
        "hg0itzo": {
          "link": "/r/college/comments/q4htvf/exhausted_and_unsure_why/hg0itzo/",
          "text": "Honestly yeah, I never thought of it like that. I think burn out was why I felt so apathetic about my previous job; it happens I guess. \nIt’s why I don’t feel guilty about going to edc. I’m treating it as a mental health days.",
          "author": "Mr_ADR",
          "created": 1633806809,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hghpfg6": {
      "link": "/r/college/comments/q4htvf/exhausted_and_unsure_why/hghpfg6/",
      "text": "Also might wanna check vitamin D levels / amount of sunlight. We're hitting that crash point.",
      "author": "adhdeedee",
      "created": 1634137865,
      "upvotes": 1,
      "replies": {}
    }
  }
}