{
  "sid": "qlbwab",
  "link": "/r/college/comments/qlbwab/am_i_boned/",
  "title:": "Am I boned",
  "text": "I want to know in short terms am I fucked. I was in a group home through freshman year high school but had good grades on online school. Came back to town, mostly bad grades and a lot of absences / some trouble for the rest of high school but I don’t think I’ve been suspended or expelled from any high school I went to. No felony’s on my record. I am now in my senior year people around me are applying for colleges, should I even bother or does any of this disqualify me ?",
  "author": "SixdeeNein",
  "created": 1635880779,
  "updated": 1636178307,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hj1smgk": {
      "link": "/r/college/comments/qlbwab/am_i_boned/hj1smgk/",
      "text": "If you want to go to university, apply. Assess your situation properly and figure out what your best options are.",
      "author": "newstudentwhatsthat",
      "created": 1635881275,
      "upvotes": 1,
      "replies": {}
    },
    "hj1v5xe": {
      "link": "/r/college/comments/qlbwab/am_i_boned/hj1v5xe/",
      "text": "Worst case scenario you can transfer from a CC. That’s what I’m doing. I had a 2.2 HS GPA.",
      "author": "ThisIsntRealWakeUp",
      "created": 1635882254,
      "upvotes": 1,
      "replies": {}
    },
    "hj1wvcr": {
      "link": "/r/college/comments/qlbwab/am_i_boned/hj1wvcr/",
      "text": "Hard to determine without knowing your GPA. If you have a very low GPA with poor SAT/ACT scores (assuming you took them), and little to no extracurriculars, a four-year institute may be difficult to get into. \n\nHowever, you can always apply to community college. Many require a minimum GPA of 2.0. This will allow you to start with a clean slate so you can eventually transfer. I recommend community college too because it will ultimately be cheaper than a four-year.",
      "author": "kizeltine",
      "created": 1635882912,
      "upvotes": 1,
      "replies": {}
    },
    "hj2abx9": {
      "link": "/r/college/comments/qlbwab/am_i_boned/hj2abx9/",
      "text": "Its definitely worth a try. If you dont get accepted to a university then go to a community college, they accept just about everyone and if you do well youll have no problem transferring to a 4 year",
      "author": "taybay462",
      "created": 1635888054,
      "upvotes": 1,
      "replies": {}
    },
    "hj2ib7x": {
      "link": "/r/college/comments/qlbwab/am_i_boned/hj2ib7x/",
      "text": "I wouldn't suggest going to college just because of inertia. I'd look for stability first and go a little later.",
      "author": "tomorrowdog",
      "created": 1635891135,
      "upvotes": 1,
      "replies": {}
    },
    "hj39oce": {
      "link": "/r/college/comments/qlbwab/am_i_boned/hj39oce/",
      "text": "Just do Community college and the go to University.",
      "author": "My_Wholesome_Acount",
      "created": 1635902424,
      "upvotes": 1,
      "replies": {}
    }
  }
}