{
  "sid": "qx7cak",
  "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/",
  "title:": "Hey there! I'm a young 16 year old indian having dreams of joining an international college,",
  "text": "I'm an ambitious 16 year old indian having dreams of being in an international college, especially in europe but I have had not much experience in extra-curricular activities nor any said experience in internships or positions with leadership, Can I please get some advice on how can I work on those factors to maximmize my chances of getting in?",
  "author": "slavie19",
  "created": 1637293182,
  "updated": 1637394385,
  "over_18": false,
  "upvotes": 21,
  "upvote_ratio": 0.82,
  "comments": {
    "hl7ncta": {
      "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl7ncta/",
      "text": "Do you play any sports or instruments? Volunteer work? Clubs or prayer groups?",
      "author": "auntiepirate",
      "created": 1637293926,
      "upvotes": 10,
      "replies": {
        "hl7ntgx": {
          "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl7ntgx/",
          "text": "I've sadly never touched a tune. Although for sports, I've changed clubs every year ranging from swimming, tennis, football,etc. Although currently I'm in no club or any volunteer club due to school pressure.",
          "author": "slavie19",
          "created": 1637294149,
          "upvotes": 7,
          "replies": {}
        },
        "hl7o15e": {
          "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl7o15e/",
          "text": "I had the opportunity to do the Duke of edinburg awards but due to my parent's situations I was unable to do it, which puts me at great disadvantage when compared to my classmates.",
          "author": "slavie19",
          "created": 1637294253,
          "upvotes": 2,
          "replies": {}
        },
        "hlaxfwr": {
          "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hlaxfwr/",
          "text": "Actually, focusing on extra-curriculars is more of an American thing- it doesnt really exist in Europe, so no need to worry.",
          "author": "pipistrellebox",
          "created": 1637355141,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hl8mq0h": {
      "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl8mq0h/",
      "text": "if you want to go to europe (i.e. holland, uk) they don’t rlly ask for ec’s. for the uk they ask for a ps but u can still write a rlly good one without internships and leadership my friend got into oxford and another into ucl j by talking about her passion and books/textbook she has read.\n\nif ur open to any country u could check our canada too most don’t ask for anything besides grades",
      "author": "trackxdreams",
      "created": 1637317929,
      "upvotes": 6,
      "replies": {}
    },
    "hl7x3f5": {
      "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl7x3f5/",
      "text": "Hey! Indian currently studying in an American University in Singapore! \n\nCan I ask what you wish to study? Depending on your field, you can choose an extracurricular. In my experience, however, clarity of thought in your SOP matters a lot more than having 10 diff extracurriculars. Of course, having a relevant extracurricular will do wonders for your application. \n\nI suggest seeing if any of the universities on your list of prospective unis would be sending representatives to an education fair that you could attend. Honestly, it was the best way for me to assess my chances and gain confidence that I had a genuine chance. \n\nHigher grades will provide more opportunities for scholarships and financial aid, so definitely don't discard that. \n\nIf you have any further questions please don't hesitate to ask!",
      "author": "cravewing",
      "created": 1637299030,
      "upvotes": 5,
      "replies": {
        "hl81ih5": {
          "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl81ih5/",
          "text": "Thanks a lot for your advice!\nCurrently I'm a science student with the pcmb option ( physics maths bio chemistry), normally people don't choose this option but I chose this option to opt in the career of genetics and biotechnology and I'm thinking of opting for a in university in either America or Europe\n\nI lived in France until 10th grade but recently came back to India to finish my high school, due to the clash of syllabuses I've still got to get hold of my academic grades but I'm still quite unsure of what to do\n\nI've thought of giving the SATS before my last year in high school starts so I don't get many exams on myself\n\nI would love to attend an education fair, it is a really great idea, really, thanks a lot!!",
          "author": "slavie19",
          "created": 1637301655,
          "upvotes": 3,
          "replies": {
            "hl81y6s": {
              "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl81y6s/",
              "text": "Yeah, giving the SAT early is a good idea! Also give your TOEFL/IELTS around your last year. They're valid for two years so you'll need to make sure they're valid when you apply. \n\nYou sound like a very clear kid, so that can be your selling point when you apply. You don't need a ton of extracurriculars, especially since in your field it's tough to get even internships or volunteer opportunities without an educational background. But just show this level of clarity of thought in your statements and you'll be good to apply!",
              "author": "cravewing",
              "created": 1637301943,
              "upvotes": 3,
              "replies": {
                "hl82piz": {
                  "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl82piz/",
                  "text": "Thanks a lot for you advice! It made things a lot clear, I just hope things work out as I'm really a kid who never stays on one thing for long\n\nI also thought about knowing how to speak 4 languages may make up for my extra curricular activités but I still have a lot to learn\n\nI wish you have a very nice day!",
                  "author": "slavie19",
                  "created": 1637302442,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hl83110": {
      "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl83110/",
      "text": "r/IntltoUSA and r/a2c are great subreddits you should check out",
      "author": "No-Shift-6657",
      "created": 1637302650,
      "upvotes": 5,
      "replies": {}
    },
    "hl81ygc": {
      "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl81ygc/",
      "text": "A maritime college, seriously, not trolling. Best you can do with your life. See the world. Make €€€.",
      "author": "NashGuy14",
      "created": 1637301948,
      "upvotes": 2,
      "replies": {}
    },
    "hl87n67": {
      "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl87n67/",
      "text": "Come to Uw Madison. We have lots of Indians here.",
      "author": "elpresidentdeusa",
      "created": 1637305801,
      "upvotes": 1,
      "replies": {}
    },
    "hl885mj": {
      "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hl885mj/",
      "text": "[https://www.thestudentroom.co.uk](https://www.thestudentroom.co.uk) should be helpful for UK colleges",
      "author": "_SilentTiger",
      "created": 1637306169,
      "upvotes": 1,
      "replies": {}
    },
    "hlax2bw": {
      "link": "/r/college/comments/qx7cak/hey_there_im_a_young_16_year_old_indian_having/hlax2bw/",
      "text": "In the Europe, the vast majority of universities do not care about hobbies, extra curriculars etc; that's mainly an American thing. One exception would be something like medicine, where they'll expect, or look more favourably on someone who's done, volunteer work in nursing homes etc.\n\nAround Europe, there's plenty of courses taught entirely in English, and there's no requirement you need to speak the local language- tho obviously it'll help your daily life if you do. \n\nThe process for applying, and university itsself, is completely different over here to the college system in the US so  investigate the university system in each country youre applying to. There's no common \"Europe wide' university system or applications policy- it all varies by country. \n\nThe advice above about visiting education fairs with representatives from foreign unis is excellent. If not, many unis have dedicated pages by country w info on the applicaitons process, including for Indian students. You can contact them directly- they're there to help, and tons of questions won't count against you. In the UK, you can often find info specifically for Indian students (or from other countries) simply by googling X university admissions Indian students (or American, or Canadian etc)- eg https://indiaoffice.blogs.bristol.ac.uk/entry/ If they don't have it, just contact the regular admissions officer, they reply pretty fast.\n\nAs a rough guide, most under grad degrees are 3 years long. Unlike the US system, there's no \"requirements/ general education\". You pick a subject at the application stage, and apply to different unis to study that subject, eg A bio chem degree, or history, or literature, or mech eng etc, then you start studying it on day one. Sometimes you can study two subjects for your degree, three is rare; education is focused on depth, rather than breadth. In most countries, there is a single form for the application process. In the UK you can apply to up to 5 unis, it all goes on one form, and in total the fee for that is about $35; then you're emailed offers back, its pretty easy. Most countries don't require a massive personal essay, like the states, either.\n\nFor fees and living costs, funding comes from you, either loans or family. Some unis will help you a little financially, but it wont be more than a few thousand a year, max, and that's unusual. In most countries, scholarships are unusual, as they have affordable fees. \n\nFees can be very low, or even free, for international students- in France, Italy etc, fees are $1-3k a year. Germany, Norway and a couple of other countries have zero fees for international students- info on cheap countries for uni in Europe; https://www.bachelorsportal.com/articles/2440/8-affordable-eu-countries-for-studying-a-bachelors-degree-abroad-in-2021.html  \n\nAcross Europe, including the UK, during term time you're allowed to work up to 20 hours a week; through the holidays (vacation) youre allowed to work full time- in any job you can find. You'll get healthcare on the same or similar terms as a local.\n\nOne final thing to consider is whether youd like to live in that country afterwards. Studying in a country makes it much easier to find a job there afterwards- the only snag being that many jobs will require an MA. But most MAs in most countries are 1 years long, and similar costs to that country's BA. The UK and Ireland are unusual in having a lot of professional jobs which don't require post grad degrees. Some UK unis offer general financial incentives if you want to do an MA here. If you'd like to stay on in the country after graduation, to work there, some companies have English speaking offices, but most will be in the local language, so you should learn it if that's your intention. But you'd have ample time to pick it up over the 3+ years youre there.\n\n Most countries have a post study visa, which vary in length from 6 months to 3 years, allowing you stay on after graduation to look for a professional job, ie one on a work visa. While on the post study visa, you can still work in any random job, and you'll continue your healthcare as before. If youre interested in doing an MA, they're generally one year, and again, have post study visas. Obviously you can easily do an undergrad degree in one country, then a post grad in another- and apply to jobs in any country in the world. But studying somewhere makes it easier to get a job in that country afterwards, cos you'll have contacts through uni. \n\nSo work out which countries you're interested in for study, then research each by turn. If you're interested in the UK, a UK admissions officer wrote an excellent post explaining the UK's system, though be warned that the fees for UK unis are higher than other countries in Europe. Lowest BA fees are about $16k a year, usually $18/ 19/ 20k. https://old.reddit.com/r/ApplyingToCollege/comments/ilw3fi/3_year_majors_private_bedrooms_social_healthcare/   Still worth checking out some UK unis, even if it's just armchair travel- we have plenty of universities in old castles and palaces, as well as many unis being world class :)\n\nInfo- https://www.campusfrance.org/en for French unis, https://studyinsweden.se/blogs/2019/11/11/best-application-tips-to-study-in-sweden/ for Sweden, and r/germany has a great wiki at the side for info on their unis. For general info on unis across Europe, post on r/askeurope asking about the systems in different countries, especially in relation to your potential degree subject.\n\nBtw, I saw you're studying sciences and maths atm- I listened to a podcast today with an Indian British virologist who's fascinating- https://www.bbc.co.uk/programmes/b01mw2d6 It's a brilliant science series from BBC radio, interviewing different scientists about how they got into their field, what interests them etc. Always enthralling.\n\nGood luck on your applications, hope you enjoy whereever you end up.",
      "author": "pipistrellebox",
      "created": 1637354997,
      "upvotes": 3,
      "replies": {}
    }
  }
}