{
  "sid": "ps6bhf",
  "link": "/r/college/comments/ps6bhf/what_happens_if_you_fail_a_required_class/",
  "title:": "What happens if you fail a required class?",
  "text": "Sorry if this is a dumb question, but I’m an art major and I’m taking an art history class that is required. Tomorrow I have my first test for the class and I’m pretty sure I’m not going to do well. If I fail this class will I have to retake this class to get my degree ? I guess also in general, if you fail a class what happens?",
  "author": "smellynoely",
  "created": 1632179989,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hdnx5mr": {
      "link": "/r/college/comments/ps6bhf/what_happens_if_you_fail_a_required_class/hdnx5mr/",
      "text": "You will have to retake the class. Generally most required classes are prereqs for the next classes so if you retake the class it will delay you a bit",
      "author": "GoldRequest",
      "created": 1632186911,
      "upvotes": 6,
      "replies": {}
    },
    "hdnj6fe": {
      "link": "/r/college/comments/ps6bhf/what_happens_if_you_fail_a_required_class/hdnj6fe/",
      "text": "It’s the first test right? Even if you do poorly you’ll be able to turn things around with later ones. Learning is all about the process, and it has its ups and downs. If you fail a class that’s required you’ll have to take it again. Keep studying tonight and perhaps try to get a good night’s sleep. It’ll help your memory and energy levels.  Perhaps you’ll be pleasantly surprised by your own abilities as you keep working on them.",
      "author": "sephronnine",
      "created": 1632180332,
      "upvotes": 7,
      "replies": {
        "hdnpufc": {
          "link": "/r/college/comments/ps6bhf/what_happens_if_you_fail_a_required_class/hdnpufc/",
          "text": "You’re right. I tend to have an all or nothing attitude sometimes. I am currently studying because of you so thank you",
          "author": "smellynoely",
          "created": 1632183524,
          "upvotes": 5,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050371
}