{
  "sid": "r4lx8u",
  "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/",
  "title:": "My experience as a Head TA for comp sci",
  "text": "As the semester is coming to an end, I literally could not be happier. Submitting grad apps has been kind of hell-ish and at this point I have zero energy to cope with anything else.\n\nThat being said, I just wanted to take a moment to look back on this semester, especially on the experience I had as the head ta for an intro python course. Perhaps some people will find this somewhat interesting?\n\nHonestly, it has been such a rewarding experience overall. I enjoyed working with students and the TAs; I am grateful to have had a wonderful group of TAs (for the most part lol, will elaborate below). I was asked to be a Head TA again next semester and I look forward to it!\n\nNow, here goes:\n\n* Some students literally think I was born yesterday. Like, no joke. They think I have no brain cells—here are some examples:\n   * For the course, we ask all students to save their scripts as a .py file (well, it's a python course lol) and place them in a folder. This one student, for whatever reason, saved his script as a pdf. It won't open either. I eventually managed to open his scripts by renaming the extension name as .py, but he got a zero for invalid submission. A few days after the deadline, I get an email from him. He had sent me his assignment to me personally saying that he didn't know the pdf file didn't open and since he \"did not change any part of his code from his first submission,\" asks if I can regrade his assignment. Well, just out of curiosity, I compared his initial submission and the version he had emailed. He DEFINITELY changed his code and had to report him to the professor. Just, why?\n   * One student emails me this:\n\n&#x200B;\n\n>Hi <my\\_name>, I just wanted to let you know that for whatever reason, my assignment was re-uploaded automatically after the deadline. I don't know how that happened and I am emailing you to make sure I don't get the late submission penalty.\n\n&#x200B;\n\n* How does the assignment....re-upload itself??.... I checked the submission logs and this student did submit late. I was just dead inside.\n* A student who never showed up to the in-person mid-term (they had to write the code on a word doc and upload it on a grading site) emails the professor saying,\n\n>The head TA told me to email you the exam since I had trouble uploading my file.\n\n&#x200B;\n\n* It turns out that this student had taken his sweet time looking up answers online and took his exam in his dorm. Also I never said that, the professor and I were both like wtf. And there's many more........................:)...\n* Other challenges:\n* I like all the TAs as people. But, it just can be a lot of work when the TAs make grading errors......too frequently. Grading is such a sensitive issue for the students and I don't want them to think that the TAs are unreliable. Unfortunately, this has been a problem for the entire semester and I have had to write countless emails saying \"sorry for the incorrect grading\" and fixing the grading errors. It's just a lot.\n* The TAs want to help the students as much as possible. But if a student shows up with absolutely nothing and says \"idk what to do, how do you solve this,\" there is only so much we can do.\n* Illegible hand-writing on written-exams makes me wanna cry lol\n* Some people don't really seem to care about email etiquettes. A TA once got an email that started with:\n\n>Hey, my dear grader, why did you take points off for <whatever they said>?\n\n&#x200B;\n\n* When students try to fight too hard on grading stuff, it can be difficult. They mostly come to me since I am the head TA—I get the frustration of getting points off, but there's really nothing I can do if your code runs into an infinite loop or just simply doesn't run.\n\nRegardless, working as a head TA has been such a rewarding experience. I had a chance to teach students by leading recitations and glad if I was helpful in any way. If anyone has an opportunity to be a TA, you should go for it!!!!",
  "author": "99jlj",
  "created": 1638155481,
  "updated": 1638206431,
  "over_18": false,
  "upvotes": 18,
  "upvote_ratio": 1.0,
  "comments": {
    "hmhnboy": {
      "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/hmhnboy/",
      "text": "Thanks for the inward look, it really was a nice(and funny because my professors complain so much about their other students and their work and uploading and stuff) read \n\nYou clearly care and that’s a special thing to have your locker. Glad your semester is over too you can breathe 🧘",
      "author": "Emanreddit29",
      "created": 1638157842,
      "upvotes": 2,
      "replies": {
        "hmho3zu": {
          "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/hmho3zu/",
          "text": "Haha it's certainly has been a lot of work but I enjoyed it for the most part! Thanks for reading and I hope that all goes well do you too :)",
          "author": "99jlj",
          "created": 1638158204,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmhwxka": {
      "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/hmhwxka/",
      "text": "Welcome to teaching! It is a wild place sometimes! Your stories are not even that bad. Go read /r/Professors for some crazy tales.",
      "author": "kingkayvee",
      "created": 1638162727,
      "upvotes": 2,
      "replies": {}
    },
    "hmi1kej": {
      "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/hmi1kej/",
      "text": "some students don't understand that college online homework submissions have been around for over a decade now, and that they are not the first (probably not even the one millionth) person to have come up with some trick. this reminds me of a post a week or two ago asking whether they can take one college course per semester/quarter for the rest of their lives to avoid having to pay student loans...",
      "author": "wobbletelescope",
      "created": 1638165495,
      "upvotes": 2,
      "replies": {}
    },
    "hmi2kk6": {
      "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/hmi2kk6/",
      "text": "As a comp sci student who goes to the TA’s for help on programs sometimes, how do you suppose I ask for help when I’m just completely lost? I get that saying idk what to do is annoying so how do you suppose asking for help when you’ve tried different things out yourself but still aren’t able to figure out the problem?",
      "author": "jasu4321",
      "created": 1638166146,
      "upvotes": 2,
      "replies": {
        "hmi3u2p": {
          "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/hmi3u2p/",
          "text": "Also, it largely depends on what type of problem you are facing. Implementing your logic is probably the hardest part of writing code, and I usually recommend students to write out pseudocode or some kind of flow chart/lists of action items/ that accounts for 1. What should be the output? 2. What elements are needed to get to that output? 3. Edge case handling—any exceptions or things that you need to account for? Etc etc.",
          "author": "99jlj",
          "created": 1638166973,
          "upvotes": 2,
          "replies": {}
        },
        "hmi3dxz": {
          "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/hmi3dxz/",
          "text": "Because I, too, am a student and definitely had times where I was just completely lost, I know approaching a TA for help is sometimes not so easy. I think the best way to ask a TA for help is to explain where you are at right now. For example, if you are stuck on a homework assignment, don't feel like you need to have some solid blocks of code to ask questions. You can still get some help by saying \"hey so I know the problem is asking me to do X, and I know that I should find a way to do Y, but I keep getting Z and would like to know what I'm missing.\" Writing out a pseudocode or at least explaining an idea of what you WANT to do but have not yet been able to write it out in python/java/C++ (or whatever language u use) is also helpful for the TA to know how they can assist you.\nIn terms of approaching them, going to their office hours is the best way but you can also email them. I usually do end up having to talk to them even if they emailed me, since explaining comp sci stuff over an email is hard haha.",
          "author": "99jlj",
          "created": 1638166678,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmi9m6x": {
      "link": "/r/college/comments/r4lx8u/my_experience_as_a_head_ta_for_comp_sci/hmi9m6x/",
      "text": "As a TA for an intro class.. I wish I had people ask me questions, I even offer regrades but no one even bothers like why am I even here?  Ask me questions for the love of god",
      "author": "TechnoBombs",
      "created": 1638171165,
      "upvotes": 1,
      "replies": {}
    }
  }
}