{
  "sid": "r03lvr",
  "link": "/r/college/comments/r03lvr/how_do_you_stay_motivated_or_find_time_to_do_work/",
  "title:": "How do you stay motivated or find time to do work?",
  "text": " I start classes in January and am trying to do this CS intro course beforehand so I can know a fair bit going in, but I have slacked for 2 weeks now. The course I am taking is luckily at my own pace but lacking motivation and being worn out from working all day then coming home to blow it off is getting really annoying. How do you guys find time to do work or find the energy to do it? I’m not even in college yet but this is worrying me because of those upcoming classes and how I’ll do there.",
  "author": "kazvu",
  "created": 1637637702,
  "updated": 1637689010,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlq76ni": {
      "link": "/r/college/comments/r03lvr/how_do_you_stay_motivated_or_find_time_to_do_work/hlq76ni/",
      "text": "Find the reason you’re doing it— whatever that is— and remember that when everything is difficult and when you want to just give up",
      "author": "gooters14",
      "created": 1637639418,
      "upvotes": 1,
      "replies": {}
    },
    "hlqe9ox": {
      "link": "/r/college/comments/r03lvr/how_do_you_stay_motivated_or_find_time_to_do_work/hlqe9ox/",
      "text": "> The course I am taking is luckily at my own pace\n\nThat's more of a curse then anything. It's a LOT harder to keep up without outside scheduling and prompts.\n\nPersonally, \n\n* Made a 9-5 (ish) schedule so I am in class or studying at least 40 hours a week. Assuming some kinda Coursera class, maybe 9-12 5 days a week for you?\n* Gave myself Sunday off so that's my \"reset\" so if anything isn't caught up Saturday night I have to rush on that\n* If you are stuck in online unscheduled things, schedule a hard time block with labeled alarms. Also pay attention for when you have to be ready for \"class\" and give yourself 5 min to make tea and get set up\n* Use the pressure of other people to help you study! Tell your roommates you are studying x to y time, or go to a library, or stream your screen on Discord.",
      "author": "adhdeedee",
      "created": 1637643249,
      "upvotes": 1,
      "replies": {}
    },
    "hlqx657": {
      "link": "/r/college/comments/r03lvr/how_do_you_stay_motivated_or_find_time_to_do_work/hlqx657/",
      "text": "I’m struggling now since Covid hit, but during my first 2 years when I was getting straight-A’s I found going to the math lab or other prominent study areas helped me stay motivated. If you surround yourself with people who value education you’ll find that shit rubs off on you pretty quick haha",
      "author": "DoodleBobWon",
      "created": 1637656760,
      "upvotes": 1,
      "replies": {}
    }
  }
}