{
  "sid": "r4wl08",
  "link": "/r/college/comments/r4wl08/hi_anime_nut_hoping_to_make_friends_and_maybe/",
  "title:": "Hi, Anime nut hoping to make friends and maybe find a girlfriend, BTW tinder sucks.",
  "text": "Hi, I'm a second year studying for bachelors  applied economics, and I just realized that a lot of my peers have already started to date and found that I'm alone, is this normal or am I just slow?",
  "author": "Exotic_Type3844",
  "created": 1638194814,
  "updated": 1639863011,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hmjauki": {
      "link": "/r/college/comments/r4wl08/hi_anime_nut_hoping_to_make_friends_and_maybe/hmjauki/",
      "text": "This is very normal dude! Let everything work as per your pace",
      "author": "watermelon_loml",
      "created": 1638197284,
      "upvotes": 1,
      "replies": {
        "hmjb5wp": {
          "link": "/r/college/comments/r4wl08/hi_anime_nut_hoping_to_make_friends_and_maybe/hmjb5wp/",
          "text": "Thanks man, it's just, as embarrassing as it is I've never dated anyone, and it's not that I can't talk to girls, it's just that by the time I understand her and like a girl she puts me in 'the zone'",
          "author": "Exotic_Type3844",
          "created": 1638197431,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmjihdt": {
      "link": "/r/college/comments/r4wl08/hi_anime_nut_hoping_to_make_friends_and_maybe/hmjihdt/",
      "text": "Man stop worrying about dating in college\n\n\n\n9.5/10 they will break up with them in a few months and then fall into depression since they can't be self sufficient. Wait till you finish school",
      "author": "elkfn2",
      "created": 1638200740,
      "upvotes": 1,
      "replies": {}
    },
    "hmk5f15": {
      "link": "/r/college/comments/r4wl08/hi_anime_nut_hoping_to_make_friends_and_maybe/hmk5f15/",
      "text": "This is something I have to work on as well, over time I realized a lot of why I want to find someone is to sort of just prove to myself that I'm \"dateable\" or some nonsense. So it probably stems from low self esteem. But in reality a lot of the girls around aren't my type anyway, I'm not really interested in the girls you find yelling on FaceTime in the common area about the guy that ghosted her. \n\nHopefully you realte to that, maybe not. Also yeah tinder is trash. They don't want you to meet people cuz then you wouldn't have a reason to use tinder. They want you to be perpetually swiping to show you ads.",
      "author": null,
      "created": 1638210100,
      "upvotes": 1,
      "replies": {
        "hmk6mh0": {
          "link": "/r/college/comments/r4wl08/hi_anime_nut_hoping_to_make_friends_and_maybe/hmk6mh0/",
          "text": "I do relate, I do and thankyou",
          "author": "Exotic_Type3844",
          "created": 1638210577,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}