{
  "sid": "99trgi",
  "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/",
  "title:": "How to Make Friends in College/Will I make Friends in College?",
  "text": "So the influx of posts started kind of early this year. The most common topic that has ever been on our subreddit surrounds making friends in college. I wrote up this little guide in hopes it will help some of you. If anyone else has suggestions- please leave them down in the comments below. \n\n\n**All posts related to making friends in college will be removed**\n\nInstead- redirect users here or if you have a question post it here. \n\n**Where did the Back to School Megathread go?**\n\nIs it still [here](https://www.reddit.com/r/college/comments/92qjfg/back_to_school_megathread/) but I unstickied it because I think this thread is more important. I will add automod config to try to redirect users to this thread if they make posts about making friends and hope it will help much more with subreddit management\n\n----\n\n**FAQ About Friends in College**\n\n\n**What should I do when I arrive on college to meet people**\n\nOkay so the first week on campus- especially in the dorms- there is a bit of magic in the air. Everyone is nervous and while some people may have friends from highschool or from their childhood- pretty much everyone is looking to make friends. Take advantage of this!!!!\n\n* Be friendly and talk with people on your floor and in your building. Introduce yourself. Say your major, where you're from, what hobbies you have, etc. Its all small-talk but later on when you see them in the hall it will be easier to strike up conversation \n\n* Take Initiative. Instead of just saying hi to people- invite some people out to dinner. Or be that one person that organizes dinner with the entire floor (its not weird. Its college. Just fucking do it). If large groups scare you- find a few friendly faces on your floor and ask if they're up for dinner- or going to that cool, definitely not lame freshman event on campus. Or ask if someone wants to go watch the opening football game with you. Or ask if they just want to explore campus. It may be awkward asking people you don't know- but it will be worth it as the friendships grow stronger. \n\n* Keep your door open. Even if you don't take initiative other people probably will. But if you stay locked up in your room all day then no one will know you're there and you will feel left out. Keep the door open and I promise you there's a good chance you'll just get invited places. Even if you keep your door open don't just stay in your room staring at the wall. Go to the common areas- if you see people socializing just go them. Its not awkward. Its college. Just walk up and say \"Hi I'm chevy- where are you guys from\" or literally anything no one cares. You might meet some cool people, you might not. Might make some friends this way, might not. Still worth a shot. I made some of my friends in college the first week by just randomly talking about anime and CS with strangers- anything can happen. \n\n* Always say yes. If someone asks you to go to some random book event in the campus center SAY YES. When you start saying no and stop saying yes people will stop asking you to go places. You know all those lame sounding events in the dorms? Yeah no one really goes to them because they care about face painting. They go to meet people. Put yourself out there and don't reject opportunities to meet people\n\n**What if I go to a commuter campus, community college, or live off campus?**\n\nNot to worry my friend. Remember there are people in your shoes too and they want to make friends as well. \n\nThe main advice I would give for people in this situation is to try and stay on campus as much as you can. If you are a commuter student- don't just head home after class. Stay on campus! Engage in any club activities and set your study schedule around these activities. Or get a job on campus. Or just study at the library on campus or wherever! Its hard to make friends when you're never at school. \n\nAlso try talking to a lot of people in your classes. Obviously don't disrupt actual class time- but asking people in your classes if they want to study together or even just saying hi can start friendships. Don't be shy! \n\n**Its after the first week of school and I still have no friends. What can I do?** \n\nThere are many things you can do! Here are some suggestions: \n\n* Talk to people in classes. Since class is well underway- you can talk to people in class about current assignments, upcoming assignments, upcoming tests, etc. Its not weird- its college. People are nice! If it is farther in the semester you can ask someone if they want to work on an assignment together or study together. I've never been told no when I asked someone- you typically learn better when you work together anyways!!\n\n* Join a club on campus. Its easier to meet people when you share a common interest- and if you join the hiking club because you like hiking then surely you'll meet people there who also like hiking. Now you have a conversation topic of \"hiking\" you can talk to them about. Yay! If you have no interests you can always just join a club related to your major or career goals and socialize with people there (but if you join the club for your major you can't use the famous 'what's your major' question when first meeting someone). You can also join clubs if you have no knowledge of them and are potentially looking at a new hobby. \nIn any case- clubs typically advertise to (mainly) freshmen at the start of each semester- so if your school has an area where the clubs set up little information booths like my school did- just go and talk to some members and get a vibe for the club. If the people seem cool- just join and hope for the best! \n\n\n* Get a job on campus. I know, it sounds crazy. But a lot of jobs in college are social and I know I personally made a lot of friends through my job. Even the people working in the dishroom at the dining halls in my school typically talk to each other and work shifts with each other frequently- so its a great way to meet coworkers. And there's never a chance you'll run out of things to talk about at your job because worst case scenario just complain about how working sucks and everyone will agree with you! Win-win. \n\n* If you live in a dorm: Talk to people!!! A lot of freshmen take the same classes. If you see someone in a study lounge (or similar) and they are working on an assignment for your class- there's no harm in asking them if they want to study with you! Or if you recognize someone in your building from one of your classes you can literally just be like \"Oh hey aren't you in Accounting 101?\". Then you can progress the conversation into asking them if they want to work on class stuff together- and if they live in the same building it'd be super easy to do so!\n\n\n* Partake in random activities! At my school a lot of people would play pool/ping pong in the dorms and a lot of people would just ask to play or jump in and I got to meet some people that way. Or people play Frisbee outside, or random other games. Its not weird to ask someone if you can play- I promise you. Worst they can say is no- best they can say is yes and you end up with new friends (and have a cool game to play with them too!). \n\n\n* Go to parties/other social events. You don't have to drink/smoke/do anything you don't like. Parties have lots of people and its a very social setting- so obviously the potential to meet people there is possible. Even if you're awkward or introverted- plenty of people like that go to parties too. There are also just random events happening daily on campus- all of them can be good ways to find people to talk to!\n\n**I am a sophomore/junior/senior/ and have no friends can I still make friends?** \n\nOf course. People are looking to make friends no matter what year they are. I made new friends every year I attended college- people do not just stick with who they met freshman year. \n\n**I don't like my friends, what do I do? Am I stuck with them?**\nNo, Silly. You can always get new friends. If you don't like your current friendgroup- make sure you don't spend all your time with them. Try to branch out by meeting new people in classes, joining a club, getting a new job on campus, etc. Eventually when you make new friends- you can leave your old friends behind. There are other tips earlier in the guide- you can always follow those if you relied a bit too much on the dorm magic to make your freshman friends!\n\n**Do all your close friends come from freshman year?**\n\nNo. While its easier for friendships to become stronger if they start freshman year because you have 4 years to develop a strong bond with someone- close friends come from any year. The person I lived with for a few years I met freshman year- but the person I would call my closest friend I met my sophomore year in college. Some of the closest people that I remain in contact with after graduation I only met late Junior year or even senior year of college. You can make close friends any year- you never know who you may end up meeting!\n\n**Am I the only one that feels so lonely?** \n\nNo. \n\nLike I said- it is the most common topic on our sub. Lots of college students struggle with the adjustment. You are not alone. Stay strong and try to follow the tips I outlined in the rest of this little guide to make some friends. If you put in the effort I would find it very difficult to believe that you can't make a single good friend. \n\n\n**Still having trouble making friends?**\n\n\n**RELAX**. Making friends takes time and effort. You cannot expect to make close friends immediately. Continue being yourself and you will find friends eventually. No one likes someone who is miserable because they feel alone. Remain positive and remember that there are other people in your shoes too. There is nothing wrong with feeling lonely in college, I'm sure most people on this sub have experienced it at one point or another. Keep doing you, take a deep breath, and enjoy college! The 4 years fly by quick. \n\n\n**Is there anything I should avoid to increase my potential to make new friends?**\n\n\n*Yes*: \n\n* Avoid staying in your room all day. You cannot make friends if you hide from people \n\n* Avoid not talking to people. You cannot make friends if you are silent. I know I am a very quiet person but if I can force myself to talk to new people you can too. \n\n* Avoid remaining comfortable. Those 2 friends from highschool that came with you to college? Don't spend all your time with them. Branch out. Meet new people. Step out of your comfort zone. \n\n\n* Avoid not showering. If you smell bad people are less likely to talk to you \n\n* Avoid posting on this sub about not making friends. This won't help you make friends. Get off reddit and talk to real people instead. We can be your friends too but it probably won't replace the loneliness you feel in real life. \n\n\n\n\n\nI was by no means a social butterfly in college and felt loneliness plenty of times- especially being the only one at my out of state college from my highschool (ever!!). Stay calm, remain positive, and try to follow the basic advice outlined in this thread. Good luck! ",
  "author": "chevybow",
  "created": 1535078794,
  "over_18": false,
  "upvotes": 833,
  "upvote_ratio": 1.0,
  "comments": {
    "ebelaud": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/ebelaud/",
      "text": "I'm in my 4th year with no friends. I have never had a true friend in my entire life. I thought college was going to be a turning point in my life and I have tried so hard to talk to people and make connections but no one cared. I don't even know what to do anymore.",
      "author": "InternalShoe2",
      "created": 1544328948,
      "upvotes": 1,
      "replies": {}
    },
    "ealufx7": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/ealufx7/",
      "text": "Such a good guide. As for the showering, sometimes the smell can be from dirty clothes. So don't wear tshirts twice, jeans a little more, jackets maybe twice? Also use deodorant. ",
      "author": null,
      "created": 1543362786,
      "upvotes": 1,
      "replies": {}
    },
    "eajvu3y": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/eajvu3y/",
      "text": "Since I commute (40 mins) I never stick around to socialize after class, as a senior I have made a whopping 3 friends that I would talk to on a semi-regular basis (one of which I talk to almost every day) \n\nBut here’s the thing, I LIKE these people, I worked well with them in labs (boy were they a godsend, I hate labs, bio lab, chem lab, physics lab, they all sucked because of useless group members), they’re fun to have casual conversation with, either about our classes, games, shows, occasionally Bitchin about a class or two\n\nSo, don’t make friends for the sake of making friends, find people that are actually dependable and worth being around. ",
      "author": "Triplexxx501",
      "created": 1543294383,
      "upvotes": 1,
      "replies": {}
    },
    "eahdzhh": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/eahdzhh/",
      "text": "Yeah, I’ve done everything on this list to make friends and I still haven’t made a single friend I actually connect with. ",
      "author": "conflictedcolumns",
      "created": 1543204415,
      "upvotes": 4,
      "replies": {}
    },
    "e9w8xha": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e9w8xha/",
      "text": "I'm currently a junior in college, and I'm struggling how to balance having a social life, and my academics. I'm also a commuter. I appreciate the advice!",
      "author": null,
      "created": 1542475509,
      "upvotes": 1,
      "replies": {}
    },
    "e9v04e5": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e9v04e5/",
      "text": "If you goto CC: Stay on campus as much as you can. Try not to hide in the back of the library",
      "author": "nuisanceIV",
      "created": 1542427190,
      "upvotes": 1,
      "replies": {}
    },
    "e9qcx6j": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e9qcx6j/",
      "text": "Would it be weird at this point in the semester to go up to my neighbors and ask to be friends? While I have a pretty active social life with a lot of my school of music friends, I've realized that I don't know anybody in my hall. I'm always hanging out in my room when I'm there, and I missed that period in the beginning of the semester to get to know the guys in my dorm. I have a feeling they'd love to have me, and a lot of them even also smoke weed so we'd know how to hang out, but I'm way too shy around strangers to do anything. I only become outgoing when I get to know people, and it's prevented me from hanging out with anyone in the dorm.",
      "author": null,
      "created": 1542262290,
      "upvotes": 1,
      "replies": {
        "eb14y2g": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/eb14y2g/",
          "text": "Just go approach them and be like \"we should hang out sometime!\" ",
          "author": "gkkiller",
          "created": 1543876591,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e9okoa2": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e9okoa2/",
      "text": "I've really tried talking to people, it's always mindless small talk. I'm not interesting enough I suppose",
      "author": "billciawilson",
      "created": 1542206930,
      "upvotes": 2,
      "replies": {}
    },
    "e90m4pe": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e90m4pe/",
      "text": "How do you make friends that DO go out? Basically, I love to go out - drink, smoke pot, do coke, all that fun stuff. Problem is - none of my friends like to do that. Most of my good friends drink, but don't smoke. Some of my friends I only smoke with, but don't drink with (I never really get invited to drink with them). Barely any of my friends do coke and those that do never invite me. I thought coming to college would make it easy to make friends that like to drink, smoke, etc. Apparently, it's harder than that or maybe it's me. I have friends that do the things I do, but they never invite me... I don't know why and it's really freaking annoying. I've never been invited to a tailgate, I barely go to frat parties, I'm just not getting the college experience I wanted. Not to say I hate my college experience, it's just that I'm not getting what I expected, and it's annoying to see people doing what I want to do because they managed to find their niche.\n\nLet me clear - I don't want to make friends solely on the basis that go out, but I do want to make friends that go out. I love my friends now, but I wish I had friends whose going out habits aligned more with mine. I don't know what I'm doing wrong, but I always end up in this position.\n\nSo, yes, how do I make friends that DO go out? Usually, people ask question on being the only friend in their friend group that doesn't go out. So, what do you do if you are the only friend in the friend group that DOES go out?",
      "author": "pop1238",
      "created": 1541305950,
      "upvotes": 3,
      "replies": {}
    },
    "e8w77a3": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8w77a3/",
      "text": "so i have an extra question. what do i do if joining a club worked too well... kind of. \n\nlike i made friends with a group of people. but not really any of them individually. so i'm a woman, and these are all guys. some have girlfriends. how do i keep up the interaction? w/out inviting just one person to hang out  ? and i cant invite them all to my apt for a party bc it's too damn smol. i dont want to just wait until someone else comes up w something. but where can we all chill.?",
      "author": "LeftJacket",
      "created": 1541130865,
      "upvotes": 2,
      "replies": {}
    },
    "e8vo0mc": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8vo0mc/",
      "text": "It is *so much* easier to make friends in college than in high school. \n\nEveryone is trying to find their footing in general, so the atmosphere is way lighter. Also, the pretentiousness of 'I'm a grown up' is largely dissipated by this point, meaning it's now cool to enjoy childhood hobbies in front of people again. \n\nWatched Pokemon growing up? All of a sudden that's cool again in college.\n\nD&D? Hop right on in.\n\nNobody has anything really to prove anymore. \n",
      "author": null,
      "created": 1541113196,
      "upvotes": 3,
      "replies": {}
    },
    "e8n8sp0": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8n8sp0/",
      "text": "Thanks for this. I'm going to have my college frosh (is that word still used in place of 'freshman') daughter read it. She has social anxiety that used to sometimes leak over into agoraphobia territory but she has worked to get much better without any psych help except for some meds. Of course, she still grapples with it some but has made a handful of acquaintances/friends over last cpl months. She lives at home & commutes the 1/2 hr to college. Even though she has come a long way, there's no way she would be able to stand dorm life. \nThanks again for posting the advice. ☺",
      "author": "humpbackhuman",
      "created": 1540785313,
      "upvotes": 2,
      "replies": {}
    },
    "e8mty0y": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8mty0y/",
      "text": "[deleted]",
      "author": null,
      "created": 1540771426,
      "upvotes": 3,
      "replies": {
        "e8yct5u": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8yct5u/",
          "text": "Take part in any campus events! For example, my college held a free mini fall festival. Student activities included pumpkin carving, getting fall-themed food, etc. Those are great for some small talk with other students! By doing this, they'll keep you busy until student clubs open again.",
          "author": "applejuice4545",
          "created": 1541211459,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e86pjak": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e86pjak/",
      "text": "> Even if you keep your door open don't just stay in your room staring at the wall\n\nAh yes because I want to leave my door open for somebody to steal my belongings. Good idea",
      "author": null,
      "created": 1540142557,
      "upvotes": -1,
      "replies": {
        "e86uz81": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e86uz81/",
          "text": "I'm sure your stuff will get stolen while you're in your room. ",
          "author": "chevybow",
          "created": 1540146951,
          "upvotes": 3,
          "replies": {
            "e89hw92": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e89hw92/",
              "text": "??? You said if you leave the door open don't stay in it staring at a wall. That implies leaving the door open while you go out somewhere else",
              "author": null,
              "created": 1540247648,
              "upvotes": 1,
              "replies": {
                "e89jcff": {
                  "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e89jcff/",
                  "text": "No that implies to be willing to talk to people as they walk by or peek their heads in the room rather than looking like you're too busy or unwilling to talk ",
                  "author": "chevybow",
                  "created": 1540249015,
                  "upvotes": 1,
                  "replies": {
                    "e89jduw": {
                      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e89jduw/",
                      "text": "Idk still don't understand why I'd want anybody in my personal space like that ",
                      "author": null,
                      "created": 1540249053,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e86mwni": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e86mwni/",
      "text": "who want to make friends with me 👀 This  is  from china  and now it's 12:42am  ,i  am  missing sleep .i want  to sleep .",
      "author": "genwenii",
      "created": 1540140197,
      "upvotes": 2,
      "replies": {}
    },
    "e7fy13q": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e7fy13q/",
      "text": "I'll tell you my little story. During my first year in college, I was trying to make friends, but the result was to make a friend in the middle of the year and some dull contacts. It wasn't what I was expecting from my college friendships when I was in high school. In the second year I stopped the effort and I just was myself. I was going out whenever I wanted and only with people I liked and in this way I made a company which consisted of 8 people and it was becoming bigger through the time.",
      "author": "pesimick",
      "created": 1539077482,
      "upvotes": 2,
      "replies": {}
    },
    "e74zaqu": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e74zaqu/",
      "text": "While the first few days of your college can be daunting, it isn’t as difficult as you’d initially presume. In fact, what is college anyway? It’s nothing but an institution where you meet a bunch of new people and study new stuff. Meeting and interacting with these people can seem difficult in the beginning, but remember, deep down, most of them are as insecure as you are. So take the initiative, exchange courtesies, bond over books/ TV shows and you’ll soon end up with more friends than you had ever imagined!",
      "author": "mightythomas",
      "created": 1538632860,
      "upvotes": 2,
      "replies": {}
    },
    "e6jy6nu": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e6jy6nu/",
      "text": "I usually ask for ppl snaps after I talk to em n shit if I like their energy lol ",
      "author": "Redpeg1",
      "created": 1537803895,
      "upvotes": 1,
      "replies": {}
    },
    "e6d37b8": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e6d37b8/",
      "text": "Ok really late to this party and I guess I don’t really fit the demographic (?) for this sub. I’m in the military at a very small base near a college (Coast Guard) and I want to meet people my age not in the military to have some different groups of friends.. also finding dates and what not but I don’t know how to meet college aged people without having classes or what not, any ideas? ",
      "author": "highandout",
      "created": 1537506148,
      "upvotes": 3,
      "replies": {}
    },
    "e69ch5x": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e69ch5x/",
      "text": "For me, it's always been a struggle to make some new friends in school. Now that I have went back to school and transfered from a community college to a university, it makes me feel out of place. I'm 28 years old and i have Asperger's Syndrome and I only been here for 2 years, and i haven't really met anyone I can talk to except for some of my instructors. The other students seem to hang in their own group of friends and seem very unfriendly towards someone outside of the group, which leaves me often staying silent by myself in some corner. Nobody really has approached me (except for some really rude feminists), and I'm not sure what about me people might find intimidating. I have a hard time holding a smile, so it might be that. But then again maybe it's because I don't don't dress like everyone else. \n\nI would try to join a club, but most of the clubs either I'm not interested in or meet at unconvient times(during another class or during/immediately after work.). I'm not sure about how to approach this. ",
      "author": "SilentJay313",
      "created": 1537370387,
      "upvotes": 2,
      "replies": {
        "e70qb4y": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e70qb4y/",
          "text": "Just try and make one friend! I was lucky enough to meet a underclassmen that I knew from high school this year. Meeting him has brought me to a whole new group of friends that actually want to hang. I usually stick to myself but Ive put an effort to be more open to people. Try to make that one friend and it will open the doors to more people who you can be friends with.",
          "author": "Chi-Cam",
          "created": 1538474227,
          "upvotes": 2,
          "replies": {
            "e8b4zs7": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8b4zs7/",
              "text": "I guess I'll have to try that next semester, or wait until I get into my classes for computer science. It just seems like to me that the people I'm running into in my general education classes are the intolerant types that only like people who dress, walk, talk, act the same way and like the same things. ",
              "author": "SilentJay313",
              "created": 1540316602,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "e683bws": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e683bws/",
      "text": "Clubs are awesome!! I had this same problem, and clubs were awesome.",
      "author": "itsmybirthwrite",
      "created": 1537313043,
      "upvotes": 2,
      "replies": {}
    },
    "e682qiw": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e682qiw/",
      "text": "Awesome post with a LOT of advice! What worked best for me was to talk to people that sat around me in class and talking to people in my dorm. I forced myself to be more outgoing! I added people on snapchat which was a good way to initially connect. ",
      "author": "madssilly",
      "created": 1537312465,
      "upvotes": 3,
      "replies": {}
    },
    "e67tlwd": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e67tlwd/",
      "text": "I still don't have any friends after 2 years of being a commuter student....:(\n\n&#x200B;\n\nPlease help",
      "author": "sadandalone2",
      "created": 1537304230,
      "upvotes": 12,
      "replies": {
        "e70qcl4": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e70qcl4/",
          "text": "You either will have to just make friends in your class or start staying longer after class and engage in the school activities. ",
          "author": "Chi-Cam",
          "created": 1538474311,
          "upvotes": 4,
          "replies": {}
        },
        "e6802zb": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e6802zb/",
          "text": "[deleted]",
          "author": null,
          "created": 1537309931,
          "upvotes": 1,
          "replies": {
            "e68k256": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e68k256/",
              "text": "idk what to do...",
              "author": "sadandalone2",
              "created": 1537329937,
              "upvotes": 2,
              "replies": {
                "e8vng5f": {
                  "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8vng5f/",
                  "text": "Tbh since yur a commuter, if your located near a city then you could definately just explore the city. Plus there's different apps like \"meetup\" or even facebook groups that could help atleast find other ppl to hangout with. ",
                  "author": "ButtaPecanPatti",
                  "created": 1541112686,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e67efzu": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e67efzu/",
      "text": "A lot of majors have meetings where faculty and students can mingle. This is a good spot to meet people in the same major as you. You already have the major in common. You might even meet some study buds there.",
      "author": "keurix",
      "created": 1537292288,
      "upvotes": 5,
      "replies": {}
    },
    "e643iv3": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e643iv3/",
      "text": "If you get plugged in on campus, then you will make friends. I just went up to people and introduced myself. Everyone was new, so we were all looking for friends.",
      "author": null,
      "created": 1537154123,
      "upvotes": 3,
      "replies": {}
    },
    "e640aca": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e640aca/",
      "text": "This is the coolest/ most useful thing I have ever seen about making friends at this age. I haven't even applied to medical school yet and I have the same apprehensions that these college kids do! ",
      "author": null,
      "created": 1537150770,
      "upvotes": 1,
      "replies": {}
    },
    "e5rs7lg": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5rs7lg/",
      "text": "Pssshhhh, this all sounds like a load of over-romanticized BS. That’s not how people interact with each other, everybody just looks at their phones 95% of the time.\n\nNot that I care, I’d rather not be friends with morons like that ",
      "author": null,
      "created": 1536647095,
      "upvotes": 3,
      "replies": {
        "e7qck0u": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e7qck0u/",
          "text": "I look at my phone because I get bored of looking around for people to talk to and feel like an awkward loser or just trying not to look weird. I mean It is intimidating but I have made 2 friends(1 ever year)",
          "author": null,
          "created": 1539490500,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e5pfecx": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5pfecx/",
      "text": ">Okay so the first week on campus- especially in the dorms- there is a bit of magic in the air. Everyone is nervous and while some people may have friends from highschool or from their childhood- pretty much everyone is looking to make friends.\n\nThis is absolutely wrong. Most freshmen tend to stick with their high school friends and aren't really interested in anyone outside of their high school social group. Kind of makes it shitty for people like me that came to college alone without a pre-established group, but you can't force anyone to like you. More and more I wish that I had friends come with me to college so I wouldn't be so lonely and miserable all the time. God, I miss high school...",
      "author": "awesomega14",
      "created": 1536551865,
      "upvotes": 29,
      "replies": {
        "e5phdai": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5phdai/",
          "text": "I was the only one from my highschool at my college and met lots of people the first week. Still talk to them to this day- even after graduating.\n\n I promise you that you aren't/weren't the only one that didn't stick with your highschool friends. Its easy to get into the mindest that everyone else already has friends when you're feeling lonely on campus. Try moderating this sub and see the sheer amount of people that post here about being lonely- its astounding. ",
          "author": "chevybow",
          "created": 1536554376,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "e5gnqcd": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5gnqcd/",
      "text": "Yes to all of this. Especially the part about just chatting up random people in the beginning of the year. EVERYBODY wants to make friends and meet new people!\nProximity is everything. I didn’t end up being close friends with most of the people I met in the first couple weeks of college, but a couple of them stuck. And I still ended up being acquaintances with the rest of them, like the girl who randomly asked me what class I was going to as we walked down the dorm hall and we turned out to be going to the same place. Like OP said - there is magic in the air!",
      "author": "magicbumblebee",
      "created": 1536187140,
      "upvotes": 2,
      "replies": {}
    },
    "e5gmqen": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5gmqen/",
      "text": "I've been very social, saying hi the past two days to everyone and actually enjoying myself and  listening to people's stories. The things I hate about frosh week are that you can meet someone you really like and then never see them again, and also that there's so much going on and if your introverted self needs a break it's like you're losing out on the race to make friends during the week. It's so much pressure, it sometimes seems futile because there are so many people and so many names and you won't be friends with most of them, and it's fucking exhausting.\n\n This morning there was an activity to meet your profs and I met an amazing group of people but they're in none of my classes. I met a cute guy at a party and he literally disappeared into the crowd. There are too many people, too many things to do, too much all at once. For some people the trouble isn't talking to people, it's finding the energy to talk to people and then the energy to keep talking to them and maintaining the friendship. It seems like an endless supply of extroverted energy i just dont have.",
      "author": "mspalandas",
      "created": 1536186216,
      "upvotes": 27,
      "replies": {
        "e5ke4aa": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5ke4aa/",
          "text": "Have you tried asking for their number before they leave?",
          "author": "Smokey190",
          "created": 1536340582,
          "upvotes": 15,
          "replies": {}
        }
      }
    },
    "e5e15l6": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5e15l6/",
      "text": "I don't know about other schools, but at my school it's pretty out of the ordinary to go to parties or campus activities alone (unless the activity is academics related or specific to a club). I wish it were more common here, but unfortunately if you show up to a football game or a dorm party alone you're going to get some weird looks, and you're probably going to stay alone unless you run into an acquaintance willing to take you under their wing or someone else who is alone. It's something that's much more easier said than done. Again, I'm not sure how it is at other schools, but over here if you show up to something alone people will pretty much just ignore you unless they know you through some way, and it's considered weird to try and join a group of strangers. I've been to campus activities alone before twice- once, I met someone else who was alone and we stuck together until the end of the event, but we never became more than acquaintances (that's another thing- follow-ups/making effort after the event is a requirement, which isn't mentioned here!). The other time was really awkward and awful. I've also been to tons of campus events with friend(s), and there's rarely more than one or two people alone and like I said they're pretty much ignored. \n\nJust wondering if anyone here also thinks this part was a bit impractical? Or if someone here has managed to make friends by attending a random campus activity alone, I'd love to hear how you did it! Personally, I'd feel super awkward going to something alone when everybody else is socializing with other people so yeah, I'm curious to hear how people overcame that and actually met new people at an event where being alone is not the norm.  ",
      "author": "bananacreampie123",
      "created": 1536085535,
      "upvotes": 4,
      "replies": {}
    },
    "e5dskfe": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5dskfe/",
      "text": "I'm a transfer sophomore starting the year at a new school, and I'm still at a point where my only close friends are my high school friends. When I was at my old school as a freshman, I struggled a lot to make friends, and I only had like a few people who I would hang out with, except it wasn't even that often, and no matter how hard I tried, I was always like a last priority friend for them (the only times we hung out were either when I initiated it or when their other friends weren't free). Now I'm at a new school, and this school is even bigger (and my dorm is pretty far from campus), and I'm terrified that making friends will be even harder. I hung out with people opening weekend (other transfer students I met at a party), but they seem to somehow already be a solid group of friends, and they only invite me if it's something drinking related, which is nice, but they don't seem to want me as an actual part of their group (eating lunch together, group chat, etc.). I also feel really awkward because I'm a sophomore, and the only other kids as eager to meet people as me are freshmen, and all of that just makes me feel super pathetic, which doesn't help my situation at all. Today was the first day of classes, but I only had one class, and I didn't really end up meeting anyone from it. I have 3 classes tomorrow, so I'm hoping things work out better for me, but I honestly doubt it at this point.\n\nRight now, my beacon of hope is joining clubs, but the club fair is at a sports field on Saturday, so I'll probably end up having to show up alone, which I feel insanely awkward about and uncomfortable with since it'll probably be packed (and people are probably gonna make a day out of it).\n\nDoes anyone have any tips or suggestions that could help me? Or even just some personal experiences that could give me a sense of what I should do?",
      "author": "ocsoo",
      "created": 1536077997,
      "upvotes": 2,
      "replies": {}
    },
    "e5do0dp": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5do0dp/",
      "text": "I put up questions/polls on my whiteboard (such as iced tea or coffee, or what’s your favorite animal) \n\nPeople like them, and it helps get to know people as well. ",
      "author": "littlebutcute",
      "created": 1536073970,
      "upvotes": 3,
      "replies": {}
    },
    "e5diwkf": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5diwkf/",
      "text": "Can't we just attend classes and go home after classes are done?",
      "author": "-Sky_Nova_20-",
      "created": 1536069032,
      "upvotes": 14,
      "replies": {
        "e5ifljj": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5ifljj/",
          "text": "That's completely fine if it makes you happy. I have a group of friends outside school and acquaintances at school is all I really feel like I need, so I mostly go home (I'm a commuter) and hang out with them instead. ",
          "author": "kayfishie",
          "created": 1536261292,
          "upvotes": 9,
          "replies": {}
        },
        "e75hpku": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e75hpku/",
          "text": "You can, this thread is for making friends ",
          "author": "shadowwolfsl",
          "created": 1538661932,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e5d0fxz": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5d0fxz/",
      "text": "Does anyone have any more advice for seniors??  In my school you have to apply to join clubs and no ones really looking for a senior. Also people don’t really talk to new people in classes. They pretty much sit with their already established groups of friends, especially now that I’m in classes that are all upperclassmen. Idk I just have no friends and idk what to do.",
      "author": "lozzawozza2",
      "created": 1536037588,
      "upvotes": 14,
      "replies": {
        "e5gz2i6": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5gz2i6/",
          "text": "Does your campus have other events? It seemed like my school usually had something going on. Sometimes they were social events that were specifically geared towards helping students meet each other. Especially this time of year! If you are living off campus, perhaps there are “commuter” events? For example my school gave out free coffee for commuters in a specific spot once a week. If you are athletic at all, perhaps there are intramural sports? Those teams are always looking for extra players!\nI would check out your campus event calendar and pick out a couple things that look interesting.  If you go and it sucks, you leave and you are no worse off. ",
          "author": "magicbumblebee",
          "created": 1536198312,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "e5coonu": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5coonu/",
      "text": "I could use some advice. I have joined a club and all and have some acquintances but I'm so bad at small talk and going up to talking to people is scary for me. How do I evolve things with acquintances and get over my fear",
      "author": null,
      "created": 1536024453,
      "upvotes": 3,
      "replies": {}
    },
    "e59rkgo": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e59rkgo/",
      "text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/concordia] [How to make friends in University: Guide for Concordia Students](https://www.reddit.com/r/Concordia/comments/9cd2ib/how_to_make_friends_in_university_guide_for/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "author": "TotesMessenger",
      "created": 1535903806,
      "upvotes": 1,
      "replies": {}
    },
    "e58xcfp": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e58xcfp/",
      "text": "If i switch dorms next month will everyone still be open to making friends? ",
      "author": "amerikkkanidol_",
      "created": 1535856374,
      "upvotes": 2,
      "replies": {}
    },
    "e589g25": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e589g25/",
      "text": "How is everyone else doing? ",
      "author": null,
      "created": 1535832155,
      "upvotes": 3,
      "replies": {}
    },
    "e5782l7": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5782l7/",
      "text": "I have made a few friends so far, but my issue is that all of them never want to go out. I had this same issue in HS, and it’s very limiting (also, I don’t want to go to certain events alone because I’m an 18 yr old girl who is new to the city; I feel that being with others will make me feel safer)\n\nIn high school, I told myself that I would try to be more social in college. And for the most part, I’ve been socializing (talking to people in class, elevators, dining halls, joining clubs, etc). It’s also nearly impossible to make friends in my dorm because you can get fined for leaving your door open, and the lounges are mostly just used for quiet studying.\n\nMost of the people that I get closer to aren’t the ones that wanna go out. Not even just parties, but football games, concerts, even just free events on campus. I know sometimes we have time conflicts with class and clubs and sometimes the workload gets heavy, but it seems impossible to do something with anyone. It seems like anyone who does anything fun has their set friend group already (I’m a first semester freshman, by the way).\n\nAny advice? I’m just frustrated right now because I can’t seem to make friends who are interested in the same things I am.",
      "author": "carmy00",
      "created": 1535783338,
      "upvotes": 20,
      "replies": {
        "e5e21th": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5e21th/",
          "text": "SAME. Like, I can't even stress how much I relate to this. When I was coming into college, I was super worried about making friends due to my anxiety and shyness. Then, when I actually managed to make friends, it turns out all they want to do is stay in and study. Freshman year it wasn't that bad, but it's become worse because school has gotten harder. I can't tell you how many things I've missed out on because my friends didn't want to go. The best thing you can do is keep these friends, but try and make a couple of new ones. \n\nJoining a new friend group entirely can be difficult, and most likely you'll be on the outskirts if you're joining late (that's happened to me and a couple of other people I know), but you can definitely go for that if you're interested. Or you can just try to make some new friends and forget about having that core group. You could join a few clubs or get a job and try to meet people through those. I go to school near a big city, so I've met a few people through online and now I hang out with them in the city occasionally. I've also explored the city on my own a few times, and become more okay with doing things alone. I never go to campus events alone because it's kind of out of the norm alone and I'd feel wayyyy too self-conscious, but exploring the city/off campus area during the daytime is normal to do alone. Group therapy is also a good option to meet new people and feel better about yourself, and your school probably offers it. The key is making acquaintances nd following up with them so you can become friends. I'm still working on making new friends, but the best thing you can do is try a few different things and understand that it's going to take some time, possibly even a year. Plus there are a lot of people who don't have friends, so at least you have them! Good luck! Also, glad to hear I'm not the only one with this problem. Message me if you ever want to vent about your friends!",
          "author": "bananacreampie123",
          "created": 1536086332,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "e573qq2": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e573qq2/",
      "text": "As someone who has been through both ends of the college tunnel (graduated 3 years ago) I can honestly tell you (whoever this guide is applying to) that even if you don't make anything resembling friends in college you will survive and you will be ok.  I had nothing even resembling an acquaintance throughout college but I can honestly say I'm no worse for the wear...do I get depressed when I think about how lonely I was?  Sure.  But does it affect my day-to-day life?  No.  My life isn't perfect by any means, but I can honestly say that my friends in college (or lack-thereof) have no bearing on my current state in life.  Hell I still hang out with my childhood through high school friends, and I wouldn't have it any other way.\n\nAs long as you have something resembling a good network of friends from some part of your life you will be ok.  Don't let anyone tell you you're less than others due to a lack of friends.  You shouldn't have to make an effort to make friends (at least no one I ever knew did).  Even if you're not so social (like me) as long as you have people from any part of your life you can trust and use as a contact to the outside world you will be ok.  It may be tough, but you'll get through it.  This comment may not get a ton of upvotes but it's still worth considering.  Also, just repeating the phrase \"it's not weird - it's college\" doesn't make it not weird.  In fact if you have to say that it's inherently weird...just sayin'",
      "author": null,
      "created": 1535776204,
      "upvotes": 48,
      "replies": {
        "e5e1fnf": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5e1fnf/",
          "text": "I don't have a lot of friends here, but I honestly don't think I'd have enjoyed college so far without the ones I do have. Having someone to talk to at college is really important. That being said, I agree that you definitely will survive. I know someone who had tons of friends when she graduated college; now she has nearly none. So making friends during college is no guarantee that you'll keep them afterwards. If you're struggling with your social life and you're a junior or senior, just think about how graduating will essentially give you a do-over in the friendship department. Plus, not having many friends after college is a lot more normal and acceptable. ",
          "author": "bananacreampie123",
          "created": 1536085784,
          "upvotes": 14,
          "replies": {}
        },
        "e589ix6": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e589ix6/",
          "text": "I needed to hear this ",
          "author": null,
          "created": 1535832231,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "e55yytr": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e55yytr/",
      "text": "Can I have more tips and tricks on how to make friends or talk to people? I can never bring myself to start a conversation with someone I don't know.",
      "author": "LuigiEatsPopcorn",
      "created": 1535734624,
      "upvotes": 2,
      "replies": {
        "ebij0mf": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/ebij0mf/",
          "text": "People bond over common interests. Comment on people's shirts and outfits, and talk to people after class about whatever you happened to be doing in class that day. If you're into sports at all, ask people wearing sports apparel if they saw the game last night. And if you aren't into sports try to get into them. Really common interest and just knowing a little about what's going on in the NFL, NBA, or MLB is a great talking point.",
          "author": "FirstNamePSU2023",
          "created": 1544470364,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e54wnws": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e54wnws/",
      "text": "[deleted]",
      "author": null,
      "created": 1535685449,
      "upvotes": 3,
      "replies": {
        "e5gz80f": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5gz80f/",
          "text": "Then you should probably check out your campus counseling center :)",
          "author": "magicbumblebee",
          "created": 1536198467,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e54hivx": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e54hivx/",
      "text": "What if you’re going into a opposite gender dominate course? It might make things awkward if I’m the only girl.\n\nAlso what if you have social anxiety and actually can’t talk to anyone? Sorry I’m just really nervous",
      "author": "Squishy_Pixelz",
      "created": 1535670610,
      "upvotes": 3,
      "replies": {
        "e58mdjh": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e58mdjh/",
          "text": "Some of my closest friends in CS were girls. I don't think its really that awkward",
          "author": "chevybow",
          "created": 1535844788,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "e54ck3w": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e54ck3w/",
      "text": "Coming from a Community College and now going to a State University. Wish me luck!",
      "author": "welchie98",
      "created": 1535664552,
      "upvotes": 2,
      "replies": {
        "ebiiq4u": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/ebiiq4u/",
          "text": "Hope it's going well!",
          "author": "FirstNamePSU2023",
          "created": 1544470149,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e5480c1": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5480c1/",
      "text": "Im a senior that is having trouble making friends. I am genuine and participate in conversations and then people are lured away. Im not creepy or anything, but I have some quirks. I noticed other people like me are friends with those people but I can’t see why I can’t do the same.",
      "author": "cryptiiix",
      "created": 1535660048,
      "upvotes": 3,
      "replies": {
        "e587vtw": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e587vtw/",
          "text": "Tbh I'm amazed you're holding out hope of making friends even as a senior (I mean that sincerely, I hope it doesn't come off sarcastically).  I got so jaded by the end of my 1st year/beginning of 2nd year that I just quit trying.  Honestly social comparison will do you nothing but harm.  I know it's not always easy to avoid, considering how modern society (online and irl) both are pushing this \"perfect\" image we're all supposed to have, but let's face it, for a HUGE amount of students of all walks of life, college (yes the oh so vaunted brick and mortar institutions our parents/grandparents drilled the importance of into our heads) just plain SUCKS!  We'd all be much healthier if we admitted that rather than try to fix ourselves constantly and pretend like not living up to the images fed to us means *we're* the problem.  I personally don't think anyone should have to make an effort to make friends.  Do the things you want to in life, and as long as you're comfortable in your own skin, friends will find their way to you...maybe not in college (since big colleges especially seem to be regressing in the social interaction category), but when it counts, it will happen.  I can't think of a single person I know that isn't capable of that, no matter their problems.  So even if you do feel like you have \"quirks\", acting like you're the problem amongst the people around you will get you nowhere.  I hope this helps... ",
          "author": null,
          "created": 1535830673,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e50ekoe": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e50ekoe/",
      "text": "Dorm floors super antisocial and it's been about 2 weeks and I have 0 friends. Should I switch dorms next month or just find other ways to make friends ",
      "author": "amerikkkanidol_",
      "created": 1535506727,
      "upvotes": 8,
      "replies": {}
    },
    "e500m30": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e500m30/",
      "text": "Since this is a post about meeting friends in college, it kind of assumes all college students that are posting here are going to the campus physically one way or another, so I just want to put in my testimony that I'm taking all online classes and that all my college time is at my house. I don't have that much flexibility, but I am a freshman anyway. \n\nI think I will eventually work my way to network with people from home through college in any way possible and hopefully find creative ways to be apart of a club but idk. ",
      "author": "DivineZerinus",
      "created": 1535493457,
      "upvotes": 5,
      "replies": {
        "e50bexr": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e50bexr/",
          "text": "If you're completely online for your schooling and have trouble making friends you should look at a general \"How to make friends\" guide for adults. There are plenty online. \n\n\nI have not once seen a post from an online student regarding making friends on this sub- all the posts I've seen are from people who attend physically- mainly freshmen who live in dorms but also commuter students and CC students who are concerned because they don't spend as much time on campus as people who live on campus. That's why I wrote this guide geared towards them. ",
          "author": "chevybow",
          "created": 1535503743,
          "upvotes": 3,
          "replies": {
            "e50bxv9": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e50bxv9/",
              "text": "I know. I just wanted to share some insight. I didn't click on this post because I needed friends, I was just curious. I appreciate the suggestion though! ",
              "author": "DivineZerinus",
              "created": 1535504250,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "e4zraaj": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4zraaj/",
      "text": "How come nobody ever wants to talk in my classes? 3 Semesters in and everyone just leaves after class so I never get an opportunity. ",
      "author": "anami01",
      "created": 1535485464,
      "upvotes": 11,
      "replies": {
        "e50bjn1": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e50bjn1/",
          "text": "College students are busy so its likely they're going to another class, going to get food, etc. In my school there are also usually students waiting outside when a class period ends so it doesn't really make much sense to wait around for a long while after class. \n\n\nIf you get to class early people usually talk before the professor starts lecturing. Or if you have a lab/discussion section its easier to talk to people there since its less lecture time and more doing work with others time. ",
          "author": "chevybow",
          "created": 1535503870,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "e4zi3t6": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4zi3t6/",
      "text": "I'm definately staying on campus most of the time. Unfortunately I do not have a car (or license lol) yet and I commute to college. Will work on getting a license this month and a car next semester. Thankfully I have some friends from high school who go to the same college and share a class with me!",
      "author": null,
      "created": 1535477753,
      "upvotes": 2,
      "replies": {}
    },
    "e4y8g08": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4y8g08/",
      "text": "I'm on a commuter campus, and there isn't really any clubs that interest me.",
      "author": "SocialNaut",
      "created": 1535419395,
      "upvotes": 5,
      "replies": {
        "e7qc37e": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e7qc37e/",
          "text": "Do you have any labs? or tutorials?",
          "author": null,
          "created": 1539489902,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e4xjtsf": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4xjtsf/",
      "text": "So what are you supposed to say to someone in your class after the first \"Hi\" and \"How are You\" ? I have a hard time talking to people. Send help",
      "author": "anami01",
      "created": 1535396346,
      "upvotes": 12,
      "replies": {
        "e4xzu7o": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4xzu7o/",
          "text": "Ask them if you wanna fuck",
          "author": "Juaniscool45",
          "created": 1535410483,
          "upvotes": 26,
          "replies": {
            "e4zr79e": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4zr79e/",
              "text": "stfu",
              "author": "anami01",
              "created": 1535485391,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "e50i8f7": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e50i8f7/",
          "text": "I just started college and so far the best thing I've found on talking to new people is to try and get to know them and be a little outgoing just to test the waters and see if anyone likes the same things you do or have similar goals in college and life, whatever kinds of questions that can break the ice and get some info on each other. I don't know if its true but for most people I believe people really do want to talk to one another but they don't know what to talk about as just talking about the class over and over gets stale pretty fast. Find people with similar interest or that can appreciate your sense of humour and act natural and you'll do great dude ",
          "author": "RayRay_Tyreese",
          "created": 1535510228,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "e4xb9us": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4xb9us/",
      "text": "Go Greek!! The best decision I made! ",
      "author": "saucegaye",
      "created": 1535388860,
      "upvotes": 3,
      "replies": {}
    },
    "e4u9ne9": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4u9ne9/",
      "text": "\"avoid not showering\"\n\nIf you need that basic of an instruction you're lost beyond hope smh",
      "author": null,
      "created": 1535246965,
      "upvotes": 166,
      "replies": {
        "e575rbn": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e575rbn/",
          "text": "My roommate freshman year was like this. He'd get back to the room after a football game (he was in marching band) basically strip down and crawl into bed and fall asleep. I was in marching band all four years of high school. I know exactly how fucking gross you can get in those uniforms, especially early on in the season. ",
          "author": "fighterpilot248",
          "created": 1535779273,
          "upvotes": 49,
          "replies": {}
        }
      }
    },
    "e4sznxm": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4sznxm/",
      "text": "I hope dorm college is easier to make friends at than community college.\n\nAlso planning on joining a few clubs.",
      "author": "taksark",
      "created": 1535197038,
      "upvotes": 9,
      "replies": {}
    },
    "e4scjnr": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4scjnr/",
      "text": "I'm a sophomore and its my first time on campus. I been really lonely lately and I just want to meet some people. But I'm extremely shy and not as outgoing as others. I get so anxious about talking to people and I feel like its been getting worse. Despite being in situations where I HAVE to be social my shyness holds me back. I also have issues with speaking very softly, stuttering, and not knowing what to say in conversation I just wish I can relax and be myself.",
      "author": "colors32",
      "created": 1535159483,
      "upvotes": 56,
      "replies": {
        "e4vnbpp": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4vnbpp/",
          "text": "Hey- I can't pretend I have experienced everyone's situation personally. But what you wrote sounds similar to me. I am pretty shy and get anxiety a lot- especially when I have to talk to people I don't know that well. I lose track with how many times people tell me to repeat myself because of my voice, or they misheard me- and I used to have problems with stuttering and with having a small lisp. \n\n\n\nWhile highschool was definitely hell for me- one of the greatest things i found about college is that no one really makes fun of you for the way you talk, or the way you look, or how quiet you are (I'll take people asking me to repeat myself because they can't hear me over asking me \"Why are you so quiet\" any day of the week lol). \n\n\nIts a tough barrier to overcome but I think it helped me to just realize that people in college are a lot more accepting. Just try to be yourself and you'll see that once you start talking more and opening up to people more it isn't as scary as it seems. It will take practice but I know you can do it. ",
          "author": "chevybow",
          "created": 1535313728,
          "upvotes": 33,
          "replies": {}
        }
      }
    },
    "e4s9cm7": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4s9cm7/",
      "text": "[deleted]",
      "author": null,
      "created": 1535156116,
      "upvotes": 4,
      "replies": {
        "e4xrf8d": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4xrf8d/",
          "text": "I always shake someone’s hand if we’re being introduced or they’re introducing themselves to me or what have you.\n\nIf shaking hands is weird I think I need to re-evaluate my entire sense of self.",
          "author": "Snazzymf",
          "created": 1535402662,
          "upvotes": 13,
          "replies": {}
        },
        "e55308h": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e55308h/",
          "text": "Typically, a handshake is for more formal situations. This is college. Keep it light and easy. do a high five or fist bump. Studies show that it’s best to make ANY kind of physical contact in THE FIRST 60 SECONds. it may seem hard or crazy, but if you see someone, intro yourself with a gesture, and make ANY physical contact. You’ll be unconscious liked so much more. So much more. ",
          "author": "sensishadow818",
          "created": 1535693264,
          "upvotes": 5,
          "replies": {
            "e558zea": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e558zea/",
              "text": "[deleted]",
              "author": null,
              "created": 1535703836,
              "upvotes": 1,
              "replies": {
                "e55t87l": {
                  "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e55t87l/",
                  "text": "a friendly, maybe little overly enthusiastic hand wave, despite whether you are close or far can work. If you see people about to interact, just pay attention to how they start.  ",
                  "author": "sensishadow818",
                  "created": 1535729771,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "e4w8jys": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4w8jys/",
          "text": "I personally think it’s a little too formal, but I’m having a hard time thinking of something to do with my hands because my arms are hella awkward all the time",
          "author": "LlamaLauncherPlays",
          "created": 1535335948,
          "upvotes": 6,
          "replies": {}
        },
        "e4w09av": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4w09av/",
          "text": "It's weird if you make it weird. That is, it's not just inherently a weird thing unless you try to force it at inopportune moments. ",
          "author": "OGMagicConch",
          "created": 1535326953,
          "upvotes": 3,
          "replies": {}
        },
        "e5e1j34": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5e1j34/",
          "text": "It's pretty normal at my school, but usually I wait to see what the other person does. If they don't extend their hand, then I figure just saying hi is fine. ",
          "author": "bananacreampie123",
          "created": 1536085869,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e4s5c1k": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4s5c1k/",
      "text": "[deleted]",
      "author": null,
      "created": 1535151905,
      "upvotes": 24,
      "replies": {
        "e4s7ko4": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4s7ko4/",
          "text": "I was 17 when I attended my State University. No one cared except for the damn people working the clinic that wouldn't give me cough medicine .-. \n\n\nSeriously though- the most you'd get from people is some light-hearted poking fun around the fact that you're younger than most. It's not a serious thing and won't prevent you from meeting people. ",
          "author": "chevybow",
          "created": 1535154240,
          "upvotes": 24,
          "replies": {
            "e4s7t2v": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4s7t2v/",
              "text": "[deleted]",
              "author": null,
              "created": 1535154483,
              "upvotes": 3,
              "replies": {
                "e4vmy5u": {
                  "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4vmy5u/",
                  "text": "What kind of places are you referring to? I don't recall not being able to go anywhere because of my age, excluding stuff like bars but all the ones in my college town were 21+ anyways so none of the freshmen went to them. ",
                  "author": "chevybow",
                  "created": 1535313369,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "e609i0m": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e609i0m/",
          "text": "Honestly...the only thing I hate about high school students is their immaturity and transferring high school \"rules\" to college. For example taking huge time on what do you wear. My man, nobody gives a single \\*\\*\\*\\*. I came in a pajama because I didn't have anything else to wear in a class with a 60 year old hardcore old school professor. Nobody said anything. I sat in the very back to not drag attention and did all of my classwork as usual. Just be yourself! Do not be a poser. Nobody cares even if you are 15 and attending college. A lot of people will find you interesting and fun if you are mature and friendly. That's my take on it.",
          "author": "timmy_42",
          "created": 1536988309,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e4r5u72": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4r5u72/",
      "text": "I always go with , hey... wanna fight ? ",
      "author": "ineedfootballmoney",
      "created": 1535120667,
      "upvotes": 9,
      "replies": {}
    },
    "e4r5njk": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4r5njk/",
      "text": "Jokes on you I made friends already and there all a bunch of crazy party bros. It’s totally not gonna back fire pfttttttt",
      "author": "sieffy",
      "created": 1535120499,
      "upvotes": 16,
      "replies": {}
    },
    "e4r03th": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4r03th/",
      "text": "Just focus on a few people. You don’t have to be friends with everybody. It’s a lot easier.",
      "author": "lastpieceofpie",
      "created": 1535114736,
      "upvotes": 21,
      "replies": {
        "e4rhu9y": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4rhu9y/",
          "text": "Definitely don't have to be friends with everyone, but don't just talk to the same single person your first days on campus. Friendships don't always work out, people transfer out or drop out, etc. Don't have to make friends with everyone you talk to- but by talking to lots of different people you open up the opportunities for future friendships (since talking to someone the second or third time is much easier than talking to then for the first time) and you meet more personalities and can better tell who you might click with. ",
          "author": "chevybow",
          "created": 1535130828,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "e4qwj21": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qwj21/",
      "text": "I ended up meeting my best friend in college through another guy I met just the night before.\n\nI woke up to go to the dining hall for breakfast and when I was about to go sit down I saw the dude I met the night before and he had somebody sitting with him. So he waved me over and I went to go sit with him which then he introduced me to his friend and just through conversation, we both found out we had the same birthday ( we made each other pull out licenses to prove it) and the rest is history. \n\nI ended up spending the next 4.5 years going through college with him as my roommate and would say those are some of the fondest memories I have.\n\nIn essence, if you're just getting into the college lifestyle then know that everybody wants to make friends. Everybody wants to have the best time possible. So really all you have to do is put on a smile and you'll eventually find a group of people that you click with.\n\nTalk to your classmates near you while your waiting for the professor, check out some clubs & places around campus, keep your door open (if you're living on campus, hall/suite style).\n\nAlso, college is a brand new chapter in your life so everybody that's been involved in your life up until this point may not continue in your story with you and that's okay. As we grow up people naturally drift apart and move on with their lives but luckily there's plenty of people out there to meet and make new memories with",
      "author": "Redhawkk",
      "created": 1535109940,
      "upvotes": 11,
      "replies": {}
    },
    "e4qu4lo": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qu4lo/",
      "text": "I'm glad I woke up to this, I move in day hopefully I can put some of these tips to use ",
      "author": "SmileyDev",
      "created": 1535105661,
      "upvotes": 12,
      "replies": {}
    },
    "e4qooqp": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qooqp/",
      "text": "It's not weird. It's college!\nThanks for this :) ",
      "author": "Aayush_17",
      "created": 1535094326,
      "upvotes": 33,
      "replies": {}
    },
    "e4qomfw": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qomfw/",
      "text": "Honestly, all you need to do is say hey to the people around you. Try to talk the first couple of days and find common ground (degree, classes, year, etc.), and you'll just meet new people. Talking to random people and making friends in college is as easy as you make it.",
      "author": null,
      "created": 1535094204,
      "upvotes": 28,
      "replies": {}
    },
    "e4qkw51": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qkw51/",
      "text": "Thanks I needed this post. made a few acquaintances so far the past few weeks, but no close friends. i think too much about shit and I’m always afraid to take initiative and invite people places because I’m afraid I’ll bother them. Hope i leave this mindset soon",
      "author": null,
      "created": 1535087933,
      "upvotes": 108,
      "replies": {
        "e4qygrr": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qygrr/",
          "text": "\"hey you got plans for lunch?\"\n\nEasy to say, gets the point across, and it's not comprising. If they hesitate, don't jump to conclusions, let them speak the way they feel comfortable and respond accordingly.\n\nOnce you're comfortable asking people to lunch, things will improve from there",
          "author": "jparevalo27",
          "created": 1535112701,
          "upvotes": 38,
          "replies": {
            "e8arc0z": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8arc0z/",
              "text": "I keep getting ignored or people won't make concrete plans :/",
              "author": "redFrisby",
              "created": 1540305369,
              "upvotes": 8,
              "replies": {
                "e8by8tk": {
                  "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8by8tk/",
                  "text": "I read your comment and my mind immediately jumped to conclusions thinking you are just not giving value to other folks so they have basically no reason to commit to your plans. This is coming from [this article in cracked](http://www.cracked.com/blog/6-harsh-truths-that-will-make-you-better-person/).\n\nBut then I also don't want to assume things about your life because I don't know anything about you. So I guess I have two things to suggest:\n\n1 - just keep trying to meet new people. College is great because folks from all kinds of interests are gathered on a single place and there's a chance to meet them if you care to look for them. Once you find people who are also looking for people like you, they'll want to have you around and commit to plans with you.\n\n2 - don't expect people to choose the small details for you. Once someone says yes to going for lunch, start thinking of when and where and communicate that to the person. If they can't then either offer another option or ask for one from them. These sort of meetings really don't happen naturally, not even between already established friends, so it'll be good to get used to it.\n",
                  "author": "jparevalo27",
                  "created": 1540341756,
                  "upvotes": 10,
                  "replies": {}
                }
              }
            }
          }
        },
        "e4ujfuh": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4ujfuh/",
          "text": "Im feeling ya, trying to be less shy and take initiative to get to know people.",
          "author": "dotJPGG",
          "created": 1535258201,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e4qkirc": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qkirc/",
      "text": "I just HAVE to reiterate --- BE YOURSELF! It's as plain as day when someone is trying too hard to fit in. It is perfectly ok to not like everything everyone else does. I enjoy meeting people who can offer me a different perspective on different interests. \n\nBE YOURSELF. (Unless you're a complete jerk. Then change that!)",
      "author": "zzzrecruit",
      "created": 1535087386,
      "upvotes": 142,
      "replies": {
        "e4tj7hb": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4tj7hb/",
          "text": "I don't even know who I am, I just feel like a product of whoever I'm with at the moment",
          "author": "ifcidnjdjcjd",
          "created": 1535219608,
          "upvotes": 90,
          "replies": {
            "e4u4l21": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4u4l21/",
              "text": "Well, use your new college independence and find out who you are/what kind of person you want to be. Go ahead and try new things!\n\nListen, as long as you don't become a gigantic douche or be rude and nasty to people, you're good in my book. You said you're a product of who you're with, that's not being yourself. It sounds like youre trying to fit in. I'm going to assume you're young, so you'll come to find your true self at some point. Just don't let the people you're with convince you to do things you wouldn't normally do.",
              "author": "zzzrecruit",
              "created": 1535241588,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "e9k69nm": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e9k69nm/",
          "text": "Even if you try to be yourself, whatever people you think are now your friends will only toss you aside eventually. ",
          "author": "emester15",
          "created": 1542039842,
          "upvotes": 6,
          "replies": {
            "e9krwkf": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e9krwkf/",
              "text": "Is this speaking from personal experience? My friends have never tossed me aside.\n\nAnd I would say if your so-called \"friends\" tossed you aside so easily then they weren't really your friends. Also, if this DOES happen at any stage in your life, you should be grateful that shitty people removed themselves from your life. My sister just lost a childhood friendship because the girl stole $40 from her. She just got rid of a lying, thieving \"friend\" for $40! Glad she didn't lose anything bigger than that! ",
              "author": "zzzrecruit",
              "created": 1542056478,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "e5imt0l": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e5imt0l/",
          "text": "[removed]",
          "author": null,
          "created": 1536267306,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e4qkbrx": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qkbrx/",
      "text": "I honestly can’t recommend enough how great it is to join a club if you’re looking for friends.\n\nI didn’t make any close friendships during the first week, but by joining a club that sounded fun, I made some great friends with similar interests!",
      "author": "Ojo46",
      "created": 1535087110,
      "upvotes": 282,
      "replies": {
        "e4qqh0n": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qqh0n/",
          "text": "[deleted]",
          "author": null,
          "created": 1535097915,
          "upvotes": 54,
          "replies": {
            "e4qyn34": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qyn34/",
              "text": "You don’t need to have a hobby or a die-hard obsession with any particular subject. Even if you’ve never done anything related to what a club is doing, consider joining it anyway if it sounds interesting to you. Book club? All you need to join is to be able to read. Movie club? You just need to be able to watch a movie. I joined a hobby rocketry club having never even touched a rocket prior to this and the first day they showed us literally every step to building and launching a hobby rocket. Don’t feel like you’re stuck with any of them either. People come and go all the time. ",
              "author": "xthatguy339x",
              "created": 1535112930,
              "upvotes": 45,
              "replies": {}
            },
            "e4qxx2w": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qxx2w/",
              "text": "Most of them aren’t super time consuming if that’s what you’re concerned about. I usually haven’t found them to deter me from my studying too much",
              "author": "Ojo46",
              "created": 1535111957,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "e812k3h": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e812k3h/",
          "text": "I couldn’t agree with this more! Most of my closest friends now are people who I met through an organization in college! ",
          "author": "fjeannn",
          "created": 1539904158,
          "upvotes": 5,
          "replies": {
            "e8wzued": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e8wzued/",
              "text": "Man I've tried this but I still feel like an outsider and I've made no friends from it. This has been my experience with multiple organizations I've tried for a whole variety of reasons. ",
              "author": null,
              "created": 1541171619,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "e4qj922": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qj922/",
      "text": "[deleted]",
      "author": null,
      "created": 1535085608,
      "upvotes": 26,
      "replies": {
        "e4qkktu": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qkktu/",
          "text": "Don't be a creep about it. If she tells you no, DON'T ask again. \n\nAlso, dont try to be her \"friend\" in the hope of getting more. Either be her real friend, or move on. ",
          "author": "zzzrecruit",
          "created": 1535087468,
          "upvotes": 70,
          "replies": {
            "e4qndzt": {
              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qndzt/",
              "text": "I am unsure of what to say.",
              "author": "HHMVP",
              "created": 1535091952,
              "upvotes": 9,
              "replies": {
                "e4qnt7s": {
                  "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qnt7s/",
                  "text": "Is she in any of your classes? If so, sit by her and ask about some notes or the lecture. Say hello regularly. If she gives you a side-eyed fake response, she's not interested. Don't speak to her again. Completely ignore her and she just might come around lol. \n\nIf she's not the bitchy type as mentioned above and is friendly, make a joke about something (class, traffic, the syllabus) but don't make a rude or mean joke about another person. Personally, I almost always respond to a funny guy. \n\nIf you're less direct, \"forget\" your pen and ask her if she has a spare. Make a light self-deprecating joke. Just break the ice a little. ",
                  "author": "zzzrecruit",
                  "created": 1535092700,
                  "upvotes": 47,
                  "replies": {
                    "e4s7c6d": {
                      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4s7c6d/",
                      "text": "I teach calculus in college.  I always enjoy watching these dynamics before and after class and when we are doing group work. Don’t take rejections personally.  He/she may have a SO, may be going through difficult times or may not be interested in dating. \n\nMy best advice: be nice to others. Does not mean that others can take advantage of you. There is a big difference here.  But being nice or a smile to your peers works wonders. And your instructor also, of course. ",
                      "author": "9alby9",
                      "created": 1535153990,
                      "upvotes": 13,
                      "replies": {}
                    },
                    "e4r84tz": {
                      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4r84tz/",
                      "text": "What to say to girls that aren't in my classes? I don't think that I will be attracted to a girl from the classss I'm taking this semester. ",
                      "author": "HHMVP",
                      "created": 1535122678,
                      "upvotes": 6,
                      "replies": {
                        "e4rae8y": {
                          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4rae8y/",
                          "text": "That's tough. What kind of school do you go to? Asking out a random girl that you see in passing might be a bit awkward. Do you know her in any other way? ",
                          "author": "zzzrecruit",
                          "created": 1535124607,
                          "upvotes": 7,
                          "replies": {
                            "e4rbljz": {
                              "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4rbljz/",
                              "text": "[deleted]",
                              "author": null,
                              "created": 1535125606,
                              "upvotes": 3,
                              "replies": {
                                "e4rbvut": {
                                  "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4rbvut/",
                                  "text": "Well, what classes do you take where you think you wont be attracted to the girls in it? ",
                                  "author": "zzzrecruit",
                                  "created": 1535125844,
                                  "upvotes": 3,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "e4st7z7": {
                      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4st7z7/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1535182464,
                      "upvotes": 2,
                      "replies": {
                        "e4u4zmy": {
                          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4u4zmy/",
                          "text": "Some girls like to be chased. Don't EVER chase!  ",
                          "author": "zzzrecruit",
                          "created": 1535242042,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e4sn46y": {
          "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4sn46y/",
          "text": "As a girl who got asked out, just make some nice conversation to see if you flow well together and then be as direct as you can about it\n\nGuy who went for me asked if I wanted to “grab a snack” to get me alone and then went off of that\n\nGood luck!!!",
          "author": "dumbestbitchindennys",
          "created": 1535171847,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "e4qiz7k": {
      "link": "/r/college/comments/99trgi/how_to_make_friends_in_collegewill_i_make_friends/e4qiz7k/",
      "text": "Tl;dr - You're good enough, you're smart enough, and darn it - people will like you!",
      "author": null,
      "created": 1535085237,
      "upvotes": 50,
      "replies": {}
    }
  },
  "updated": 1634057690
}