{
  "sid": "qmcwui",
  "link": "/r/college/comments/qmcwui/finding_myself_without_plans_on_where_to_live/",
  "title:": "Finding myself without plans on where to live next year: Do I get a random roommate(s) or do I live by myself for $200+ more per month than I pay now?",
  "text": "I was all set to get an apartment with a friend next year, but there are circumstances that no longer make that possible. They had to leave college for the semester and don't know when they will be back. \n\nSo I have the dilemma of do I get an apartment by myself for $200 more than I pay now (or possibly double what I pay now), or do I look for a random roommate or roommates? If this was campus housing, I would have no issue with a random roommate since there are CAs/RAs who would get involved if there were issues. But, at an apartment, there's not much to be done if there is conflict other than being adults about it and working through it, which we all know some people still aren't there yet in life. \n\nI'm really torn. I'd hate to even live alone. I'm a person who enjoys to live with at least one other person; I'm pretty sure I'd get lonely if I lived alone. My biggest fear is I would get a roommate I don't vibe with or a roommate who doesn't clean. I'm planning on using a find a roommate website if I go that route. \n\nJust looking for some advice/stories/perspectives. Thanks in advance everyone!",
  "author": "seekthegiant",
  "created": 1636000605,
  "updated": 1636137436,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hj9ftuh": {
      "link": "/r/college/comments/qmcwui/finding_myself_without_plans_on_where_to_live/hj9ftuh/",
      "text": "depends on your financial situation and how willing you are to deal with shitty roommates.\n\n\nim literally applying for a lease right now to live on my own just because i cannot stand my roommates and i’d rather spend more money to avoid having to deal with people",
      "author": "llooozp",
      "created": 1636018047,
      "upvotes": 1,
      "replies": {}
    }
  }
}