{
  "sid": "rc1mmj",
  "link": "/r/college/comments/rc1mmj/are_my_two_wintermester_courses_doable/",
  "title:": "Are my two wintermester courses doable",
  "text": "I'm really just making this post for extra assurance or dread, but I am planning on taking two courses for my upcoming winter minimester which is from Dec. 27th- Jan. 14. The two classes I'll be taking is an entry level speech course and entry level political science course everyone has to take. I only need these two classes to officially graduate in May so I figured I should knock them out now rather than pay for another semester just for 6 hours. however, I've been hearing how \"intensive\" wintermester courses are and basically needing to devote 8 hours to just ONE class. The classes I'm pretty sure will be online too, but I'm wondering if anyone with past experience has any words of wisdom since I'm taking the classes regardless.",
  "author": "IoGza",
  "created": 1638999398,
  "updated": 1639517206,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hns9gpb": {
      "link": "/r/college/comments/rc1mmj/are_my_two_wintermester_courses_doable/hns9gpb/",
      "text": "I'm not sure if this helps you, but I took two online summer courses to graduate faster.\n\nBio 2\nSpeech class \nFor my major.\n\nI cheesed both of them because the Bio 2 Professor have exams questions straight from the homework word for word. I noticed it after rereading my homework and remember that a majority of it was word for word.\n\nMy speech class was easy because the prof is really nice about speeches.\n\nI would say if they offer in the summer then that be nice, but if you know their intensive then do the easier one.The reason I say that is because of burnout. Especially after fall semester I need time to reset. \n\nGood luck.",
      "author": "Notsuressquit",
      "created": 1639006751,
      "upvotes": 1,
      "replies": {
        "hnszsr5": {
          "link": "/r/college/comments/rc1mmj/are_my_two_wintermester_courses_doable/hnszsr5/",
          "text": "thanks that helps a lot. I've heard the speech professor I'm taking is really easy so I'll probably be able to get through it all",
          "author": "IoGza",
          "created": 1639018498,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}