{
  "sid": "qejjqy",
  "link": "/r/college/comments/qejjqy/engineer_majors/",
  "title:": "Engineer majors!",
  "text": "Hello everyone, I’m going to community college to take my basics and then transfer to a university. The other day I was with my advisor and she told me I could either take General Chemistry 1&2 or take Chemistry 1409 that is only for engineers because the university I want to transfer would take the credit. But I haven’t had chemistry in at least 8 years so I don’t remember much of it. What would you guys recommend me to do?",
  "author": "Agreeable_Comb_5224",
  "created": 1635044370,
  "updated": 1635184564,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.78,
  "comments": {
    "hhuk5uu": {
      "link": "/r/college/comments/qejjqy/engineer_majors/hhuk5uu/",
      "text": "I did something similar to that but with physics. I probably shouldn't have, but it was an easy, low-math class and didnt end up costing me too much time. The class I took was a high school level physics class at a community college and a prereq for phys 1 for engineers, but I probably would have been fine just jumping into phys 1 for engineers.\n\nNow chemistry. Chemistry is painful no matter which one you take. I'd recommend against prolonging the pain by planning to take it twice. Taking the general one is unlikely to make the engineering one easier, no matter what your counselor might say.\n\nWhen I went back to school for engineering, I had been out of high school (and thus hs chem) for over 10 years,  but what I did to make up for it was spend a little time on youtube for each concept and go to the teacher with any other questions i had. A good number of my office hrs questions early on were like this: \"I was last in a [subject] class 10 years ago, so I think I must just be forgetting something here, but how does that equation turn into this?\"\n\nYou really probably don't need the qualifier, but that didn't stop my stupid mouth from blurting it out way too frequently.",
      "author": "MrFancyBlueJeans",
      "created": 1635073158,
      "upvotes": 3,
      "replies": {}
    },
    "hhtph42": {
      "link": "/r/college/comments/qejjqy/engineer_majors/hhtph42/",
      "text": "Unless you’re really passionate about Chemistry I’d say take whichever is gonna cost less time.",
      "author": "XopowoqoX",
      "created": 1635049110,
      "upvotes": 2,
      "replies": {
        "hhtps9c": {
          "link": "/r/college/comments/qejjqy/engineer_majors/hhtps9c/",
          "text": "I was thinking that too. Chemistry for engineers are 4 hours long for 2 days. But general chemistry has 2 lectures that are 1 hour and 30 minutes long, but you also need to do one laboratory, and for some reason they are schedule one or two hours after the lecture and they are 2 hours and 30 minutes long. So either way are 4 hours, but the difference with general chemistry is that I need to spend 2 hours in school doing nothing because there’s no point in me leaving and then coming back to take the laboratory.",
          "author": "Agreeable_Comb_5224",
          "created": 1635049297,
          "upvotes": 1,
          "replies": {
            "hhtqb15": {
              "link": "/r/college/comments/qejjqy/engineer_majors/hhtqb15/",
              "text": "Based on this I’d say take Chem for engineers. Yeah it’s longer in the short term but it’s one less class you’ll have to take in total (assuming chemistry 1&2 are two separate classes) and it sounds like it’ll be more convenient for your schedule. Also there’s always the possibility it may not take the full 4 hours, most of my labs have 3 hours allotted to them but we usually finish in half that time.",
              "author": "XopowoqoX",
              "created": 1635049616,
              "upvotes": 2,
              "replies": {
                "hhtyeuc": {
                  "link": "/r/college/comments/qejjqy/engineer_majors/hhtyeuc/",
                  "text": "Cheating on us? 🤫",
                  "author": "ElitemanBox",
                  "created": 1635055062,
                  "upvotes": 1,
                  "replies": {
                    "hhtzrqu": {
                      "link": "/r/college/comments/qejjqy/engineer_majors/hhtzrqu/",
                      "text": "Who are you, my mother?",
                      "author": "XopowoqoX",
                      "created": 1635056082,
                      "upvotes": 1,
                      "replies": {
                        "hhtzvsx": {
                          "link": "/r/college/comments/qejjqy/engineer_majors/hhtzvsx/",
                          "text": "I wish",
                          "author": "ElitemanBox",
                          "created": 1635056169,
                          "upvotes": 1,
                          "replies": {
                            "hhu09yy": {
                              "link": "/r/college/comments/qejjqy/engineer_majors/hhu09yy/",
                              "text": "🤥",
                              "author": "XopowoqoX",
                              "created": 1635056470,
                              "upvotes": 1,
                              "replies": {
                                "hhu0bpp": {
                                  "link": "/r/college/comments/qejjqy/engineer_majors/hhu0bpp/",
                                  "text": "I was gonna say something than I realized what sub we are in lol. But I love you hydro don’t forget it",
                                  "author": "ElitemanBox",
                                  "created": 1635056507,
                                  "upvotes": 1,
                                  "replies": {
                                    "hhu4bsx": {
                                      "link": "/r/college/comments/qejjqy/engineer_majors/hhu4bsx/",
                                      "text": "You don’t even KNOW me bro",
                                      "author": "XopowoqoX",
                                      "created": 1635059673,
                                      "upvotes": 1,
                                      "replies": {
                                        "hhu4geh": {
                                          "link": "/r/college/comments/qejjqy/engineer_majors/hhu4geh/",
                                          "text": "How would I? You don’t even know yourself.",
                                          "author": "ElitemanBox",
                                          "created": 1635059778,
                                          "upvotes": 1,
                                          "replies": {
                                            "hhu533a": {
                                              "link": "/r/college/comments/qejjqy/engineer_majors/hhu533a/",
                                              "text": "I don’t need to know myself and you know it",
                                              "author": "XopowoqoX",
                                              "created": 1635060302,
                                              "upvotes": 1,
                                              "replies": {
                                                "hhu54bc": {
                                                  "link": "/r/college/comments/qejjqy/engineer_majors/hhu54bc/",
                                                  "text": "I don’t think you are willing to",
                                                  "author": "ElitemanBox",
                                                  "created": 1635060330,
                                                  "upvotes": 1,
                                                  "replies": {
                                                    "hhu58k7": {
                                                      "link": "/r/college/comments/qejjqy/engineer_majors/hhu58k7/",
                                                      "text": "I don’t think you know what I’m willing to do",
                                                      "author": "XopowoqoX",
                                                      "created": 1635060429,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "hhu5glo": {
                                                          "link": "/r/college/comments/qejjqy/engineer_majors/hhu5glo/",
                                                          "text": "Physically I know what you are capable and what you’ve done...But you don’t want to seek internally what you are",
                                                          "author": "ElitemanBox",
                                                          "created": 1635060615,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hhtzl7w": {
      "link": "/r/college/comments/qejjqy/engineer_majors/hhtzl7w/",
      "text": "Take the one that requires less classes. Unless you're doing material science there's not other classes where it comes up. Save some time cuz there's a lot more classes you're gonna need.",
      "author": "NinjaLorian",
      "created": 1635055943,
      "upvotes": 1,
      "replies": {}
    }
  }
}