{
  "sid": "qkrbsv",
  "link": "/r/college/comments/qkrbsv/grading_on_a_curve/",
  "title:": "Grading on a Curve",
  "text": "Hi everyone!\nThe Professor said he will curve our 3 midterm grades, but I didn’t have experience with curve. Can someone explain to me how it is going to work?\n\nFor reference, we have three midterms, 55 points each.\n\nTIA!",
  "author": "Katlevv",
  "created": 1635810874,
  "updated": 1635890804,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hiys75x": {
      "link": "/r/college/comments/qkrbsv/grading_on_a_curve/hiys75x/",
      "text": "Let’s say the highest possible score is 100. The exam is taken and the scores come back with the highest score being 91/100. This 91, the highest test score, becomes the 100. And what about the 9 point difference? It is a gift from the academic Gods. Everyone is rewarded the points difference. For ex. Remember the 91 now = 100. Every one is given 9 points (100–91). So a curve can be a game changer. If you scored a 51, and 60 is the passing mark, ..happy days. U just passed. If you're in class with a whiz kid and he scores 99…. There isn't much of a curve to be had, just 1 point.",
      "author": "nohac14",
      "created": 1635820728,
      "upvotes": 1,
      "replies": {
        "hiyuzpm": {
          "link": "/r/college/comments/qkrbsv/grading_on_a_curve/hiyuzpm/",
          "text": "thank you so much for responding! yes, so for 2 midterms there were already students who got 55/55. this means there isn’t going to be a curve?\n\ni was thinking maybe he would curve the cumulative score of midterms but i didn’t know if it’s possible with the curve or no.",
          "author": "Katlevv",
          "created": 1635822096,
          "upvotes": 1,
          "replies": {
            "hiyvosq": {
              "link": "/r/college/comments/qkrbsv/grading_on_a_curve/hiyvosq/",
              "text": "From my experience, this technically meant that there would be no curving since the professor’s expected outcome was true. If it didn’t go the way they planned then they would curve it. However, this may be different with yours depending on how many students got perfect scores and what most students actually got on the exam. My theory is that he will add up those midterms and curve the grades after the addition.",
              "author": "nohac14",
              "created": 1635822439,
              "upvotes": 1,
              "replies": {
                "hiyw2sw": {
                  "link": "/r/college/comments/qkrbsv/grading_on_a_curve/hiyw2sw/",
                  "text": "based on my current grades, i would have 157/165 and there will be students with 165/165 so i am not sure if the curve will hurt me or no.\n\nsorry for bothering you) it’s just when i asked to prof he said idk what i am going to do yet and it just got me confused.",
                  "author": "Katlevv",
                  "created": 1635822633,
                  "upvotes": 1,
                  "replies": {
                    "hiywha6": {
                      "link": "/r/college/comments/qkrbsv/grading_on_a_curve/hiywha6/",
                      "text": "Well if that’ll be your grade then u don’t have too much to worry abt. The curve usually helps students who don’t do so well without making the smart kids feel like they’ve been cheated. The curve won’t hurt u if u end up with relatively good grades. No worries! I’m happy to help.",
                      "author": "nohac14",
                      "created": 1635822837,
                      "upvotes": 2,
                      "replies": {
                        "hiywvnc": {
                          "link": "/r/college/comments/qkrbsv/grading_on_a_curve/hiywvnc/",
                          "text": "thanks for the explanation!",
                          "author": "Katlevv",
                          "created": 1635823045,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}