{
  "sid": "q2pa8z",
  "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/",
  "title:": "Is my University of Phoenix degree worthless?",
  "text": "I'm getting my degree in English at the University of Phoenix. After I receive my bachelor's, I plan on working for a master's degree in Library Science.\n\nHowever, recently I've heard that the University of Phoenix is pretty much a scam, and nobody takes it seriously. I'm now worried that I've spent thousands of dollars on nothing, and they won't even consider me for a master's program. Is all this true? And if so, is there anyway I can fix this without going into another severe bout of debt?",
  "author": "SadieSellsSeashells",
  "created": 1633541494,
  "updated": 1639852140,
  "over_18": false,
  "upvotes": 24,
  "upvote_ratio": 0.96,
  "comments": {
    "hfn28cr": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfn28cr/",
      "text": "Yes. For-profit degrees are generally useless in the eyes of almost everyone.",
      "author": "HowlSpice",
      "created": 1633548303,
      "upvotes": 64,
      "replies": {}
    },
    "hfmn6w1": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfmn6w1/",
      "text": "You should still be able to get into a decent master program, especially if you have strong GRE scores, but yeah, any for-profit degree like UoP is going to be worth less than a degree from a reputable institution. You just want to be sure to demonstrate your potential for graduate study in your field.",
      "author": "PhDapper",
      "created": 1633541878,
      "upvotes": 35,
      "replies": {
        "hfmnau5": {
          "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfmnau5/",
          "text": "That's relieving to hear! Thank you!",
          "author": "SadieSellsSeashells",
          "created": 1633541924,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "hfnitmm": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnitmm/",
      "text": "If you go to LinkedIn, search for people that have attended University of Phoenix and see if they have advanced to grad schools other than UoP. This will help you determine whether UoP alums actually made their degree work for them or not. \n\nThere’s also other factors that could help you get into grad school. It’s not all about the name of the undergrad institution that you attended. For example:\n\nGREs, LORs, SOPs, and relevant experiences, \n\ncan help you get in to grad programs. \n\n\nNote: Some grad programs only care if you have completed a bachelors degree. They don’t care where. \n\nWork with what you have. I’m sure your degree at UoP will open opportunities for you compared to not having a degree at all. \n\nTry not to stress. You’ve already began your studies at UoP. If you’re almost done; just finish strong. If you’re only a freshmen and want to transfer to another school, then look into how…that’s if you really want out of UoP. \n\n\nBest of luck!",
      "author": "Oniko_2009",
      "created": 1633555338,
      "upvotes": 19,
      "replies": {}
    },
    "hfmntwc": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfmntwc/",
      "text": "I applied for a grad program with an undergrad in an unrelated field- and an unremarkable GPA-  was accepted on the strength of an interview with the chair of the program and two letters of recommendation.",
      "author": "whatistheformat",
      "created": 1633542141,
      "upvotes": 4,
      "replies": {}
    },
    "hfnyfbj": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnyfbj/",
      "text": "Look into TESU, Excelsior, and WGU and https://www.degreeforum.net",
      "author": "DREAMINGOF_WAFFLES",
      "created": 1633562612,
      "upvotes": 2,
      "replies": {}
    },
    "hfoeo3h": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfoeo3h/",
      "text": "Very",
      "author": "TragicalKingdom",
      "created": 1633570363,
      "upvotes": 1,
      "replies": {}
    },
    "hfn0q6x": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfn0q6x/",
      "text": "If you're worried about the value of your degree and not being in debt, don't get a masters in library science",
      "author": "Atraidis",
      "created": 1633547682,
      "upvotes": -9,
      "replies": {
        "hfn1uo9": {
          "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfn1uo9/",
          "text": "Actually, over 80% of degree holders have stated that the degree to them was worth it. Jobs in libraries are projected to grow 5% in the next decade, and where I live, the average salary for a librarian is around $63,000 per year. \n\nThere's always gonna be a need for libraries. They're one of the few free resources available, and they're evolving at a rapid rate to keep up with tech. My local library has a whole catalog of online books and have a dedicated computer section with modern day computers and video games. \n\nPlus it's one of the few jobs I really have an interest in and can see myself doing without being totally miserable.",
          "author": "SadieSellsSeashells",
          "created": 1633548146,
          "upvotes": 17,
          "replies": {
            "hfnpv0j": {
              "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnpv0j/",
              "text": "As an academic librarian, here's some unsolicited advice.  Have you ever actually worked/volunteered in a library? I HIGHLY encourage you to do that before commiting to grad school. Especially if you have to take on loans for grad school. Many people go straight through the MLIS without any experience and then they enter an oversaturated job market and have trouble finding a job.  I don't think the place of your undergrad matters so much. Just make sure the MLIS program is ALA accredited.  I also encourage you to scroll through r/librarians to see previous posts.  The salary you posted is probably the median salary and nowhere near the starting salary. I've been a librarian for 8 years and I'm still a long way from that salary.",
              "author": "bungchiwow",
              "created": 1633558514,
              "upvotes": 11,
              "replies": {
                "hfnravm": {
                  "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnravm/",
                  "text": "I've actually volunteered in my schools library during high school, and helped out at the public library during the summer. That's where I finally decided that's what I wanted to become. \n\nI plan on getting it at the University of Alabama, which is an ALA credited school and has an online program. \n\nAnd you're right. That is the median salary. The starting salary is closer to $40,000. There are some well paying library jobs near me which have a starting pay of around $55,000 but that could just be because I live near DC and they require a master's + years of experience.",
                  "author": "SadieSellsSeashells",
                  "created": 1633559159,
                  "upvotes": 2,
                  "replies": {
                    "hfnuszb": {
                      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnuszb/",
                      "text": "A masters degree and years of experience to be a librarian making 55k? What a joke.",
                      "author": "YouBoreMeHard",
                      "created": 1633560844,
                      "upvotes": -6,
                      "replies": {
                        "hfnv9u7": {
                          "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnv9u7/",
                          "text": "Please stop. Being a librarian is a dream to me. I would love to dedicate my life to helping kids and adults find a love for reading. I know it's not the best paying, but it's something I really enjoy. I can't be stuck in a high paying job that I'm miserable in. I don't think my mental health could take it.",
                          "author": "SadieSellsSeashells",
                          "created": 1633561055,
                          "upvotes": 12,
                          "replies": {
                            "hfnvl61": {
                              "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnvl61/",
                              "text": "I'm not looking down on librarians. I'm looking down on the fact that there are such ridiculous requirements. I've seen federal jobs that have more lenient requirements.",
                              "author": "YouBoreMeHard",
                              "created": 1633561208,
                              "upvotes": -6,
                              "replies": {
                                "hfnx14a": {
                                  "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnx14a/",
                                  "text": "I mean, a lot of work goes into it. It's not just checking out and shelving books. Research knowledge is critical. You need to know what would be best for each person, and how you can find that information. It's especially important with the world wide web. Limitless information at your fingertips, but not all information is equal or even factual. You also have to learn how to catalog and organize to make the most out of a collection.\n\nThere's also the business aspect. Why is it so hard to believe that you need a degree to run most businesses but not a library? \n\nNot to even mention everything else that goes into the degree, such as the history of it. There's a lot that goes on that the general public don't even realize.",
                                  "author": "SadieSellsSeashells",
                                  "created": 1633561927,
                                  "upvotes": 5,
                                  "replies": {
                                    "hfo6g77": {
                                      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfo6g77/",
                                      "text": "I think theyre saying that librarians should be paid more, not that they dont deserve the salary they do get",
                                      "author": "taybay462",
                                      "created": 1633566516,
                                      "upvotes": 6,
                                      "replies": {
                                        "hfo6ovh": {
                                          "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfo6ovh/",
                                          "text": "I can definitely agree with that. Though saying it's the wrong career path because it doesn't pay a lot just sort of rubs me the wrong way.",
                                          "author": "SadieSellsSeashells",
                                          "created": 1633566631,
                                          "upvotes": 0,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "hfnuvlx": {
                      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfnuvlx/",
                      "text": "A masters degree and years of experience to be a librarian making 55k? What a joke.",
                      "author": "YouBoreMeHard",
                      "created": 1633560865,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hfqvuuk": {
              "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfqvuuk/",
              "text": "Only $63k when you have a masters?? Seems like its not that worth it, you could easily make that money without a degree at all.",
              "author": "cabbage-soup",
              "created": 1633624633,
              "upvotes": 2,
              "replies": {
                "hfqw86v": {
                  "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfqw86v/",
                  "text": "Money isn't a big concern for me. Obviously it's important, but I'm willing to live on that pay if it's for something I truly love. Like I said earlier, I can't be stuck in a job I hate.",
                  "author": "SadieSellsSeashells",
                  "created": 1633624781,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hfp90dh": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfp90dh/",
      "text": "I've heard that UoP is not even accredited. I wouldn't want to get a degree from them, honestly. No one would take me seriously",
      "author": "WilieFern",
      "created": 1633588657,
      "upvotes": -2,
      "replies": {
        "hfpakbo": {
          "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfpakbo/",
          "text": "It's definitely accredited, I was just worried that I wouldn't be able to get into a master's program with it. Though thanks to the other commenters, I'm hoping that I won't have to worry too much about that.",
          "author": "SadieSellsSeashells",
          "created": 1633590002,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hfqu7zo": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hfqu7zo/",
      "text": "Yes.",
      "author": "ericgol7",
      "created": 1633623982,
      "upvotes": -1,
      "replies": {}
    },
    "hn3h99q": {
      "link": "/r/college/comments/q2pa8z/is_my_university_of_phoenix_degree_worthless/hn3h99q/",
      "text": "Naw, in addition to your agree, after graduating you can look forward to receiving affiliate marketing emails. Which other university offers that? Super value degree, they definitely care about students.  They charge $15k per year, then proliferate their profits by selling their student email lists to major vendors. Its pretty wild.",
      "author": "cryptodraw",
      "created": 1638555438,
      "upvotes": 1,
      "replies": {}
    }
  }
}