{
  "sid": "ptcqmq",
  "link": "/r/college/comments/ptcqmq/what_do_i_say_when_contacting_counseling_services/",
  "title:": "What do I say when contacting Counseling Services on Campus?",
  "text": "I've been in college for for a few years now and have wanted to take advantage of the counseling services for a while now but I've always been a little hesitant for reasons. Lately I've been really wanting to so I plan on emailing them. My problem right now is that I'm not sure how to email them. I really don't know what to say to them. Should I just ask to set up an appointment and save talking about everything there or should I just explain a little bit about why I want to meet.\n\nI've never met with anyone for therapy or counseling services which is why I think I put it off for so long and am nervous.",
  "author": "Burnt_Bread5",
  "created": 1632332430,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hdwm1uf": {
      "link": "/r/college/comments/ptcqmq/what_do_i_say_when_contacting_counseling_services/hdwm1uf/",
      "text": "(Prof here)  \nYep - you don't have to tell them anything in the email - just say I'd like to set up an appointment.   No need to explain.",
      "author": "emarcomd",
      "created": 1632356688,
      "upvotes": 2,
      "replies": {
        "hdz8buv": {
          "link": "/r/college/comments/ptcqmq/what_do_i_say_when_contacting_counseling_services/hdz8buv/",
          "text": "Thanks for the help, I just sent an email to them.",
          "author": "Burnt_Bread5",
          "created": 1632413060,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdw37cp": {
      "link": "/r/college/comments/ptcqmq/what_do_i_say_when_contacting_counseling_services/hdw37cp/",
      "text": "Just ask to set up an appointment. It's probably safe to say they assume everyone seeking counseling has a reason to, you don't have to tell the person scheduling appointments why you're seeking counseling. You'll go over why you're seeking counseling during your first session (intake) and what you're looking to get out of it. \n\nThe sooner you get your intake scheduled, the better. The demand for mental health resources right now is pretty high due, and only going to get higher as the semester continues, so it's important to get your foot in the door now.",
      "author": "FamishedHippopotamus",
      "created": 1632346725,
      "upvotes": 2,
      "replies": {
        "hdz8jad": {
          "link": "/r/college/comments/ptcqmq/what_do_i_say_when_contacting_counseling_services/hdz8jad/",
          "text": "Thanks for the help and explanation, like I said in the post I've never gone to counseling before so this really helped me get out of my head about it. I just sent them an email to schedule an appointment.",
          "author": "Burnt_Bread5",
          "created": 1632413147,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hdvn8tf": {
      "link": "/r/college/comments/ptcqmq/what_do_i_say_when_contacting_counseling_services/hdvn8tf/",
      "text": "It's like jumping in a cold pool, the longer you think about it the worse it gets. It doesn't matter how you jump in but you should just jump in. I would suggest being honest and open, exactly like you wrote here. 'hello, I have been thinking about this for a while but not sure how to approach it. I feel like I need to talk to someone so please could you help guide me through how this whole process works.'\n\nBest of luck friend.",
      "author": "WannabeHuman8",
      "created": 1632337188,
      "upvotes": 5,
      "replies": {
        "hdz8n2x": {
          "link": "/r/college/comments/ptcqmq/what_do_i_say_when_contacting_counseling_services/hdz8n2x/",
          "text": "Thanks, I really needed to hear this, I just sent an email to schedule an appointment with them.",
          "author": "Burnt_Bread5",
          "created": 1632413192,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050474
}