{
  "sid": "r12hy8",
  "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/",
  "title:": "How will I make life long friends if I want to study abroad for two years?",
  "text": "Straight answer: I want to study abroad my sophomore and junior year. I want to experience what it’s like at a bigger college, a different state, and a whole different country.\n\nI just don’t know what I’ll be missing out if I leave the college I’m at right now. There’s a solid group of friends I really like here. \n\nBut if I leave, that’s two years of nothing. I’ll be a senior when I come back, and I feel like it won’t be the same. To me it’ll feel like a new environment, like transferring to a new school. I’m not even sure if I will be living in the dorms which is where student life is.\n\nI just don’t know. I’ve just know people have made life long friends from college, and I’m just cutting that off if I leave.\n\n*I’m sure people make friends after college, but the people I know now are amazing\n\nJust feels like a stab in the heart right now..\n\n\n\n\n.",
  "author": "walrusdog32",
  "created": 1637751059,
  "updated": 1638207349,
  "over_18": false,
  "upvotes": 8,
  "upvote_ratio": 1.0,
  "comments": {
    "hlw5k1q": {
      "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlw5k1q/",
      "text": "There is no [Grab lifelong friends here] box. There is no guarantee you will associate with the people you've met a month after college, even if you don't study abroad.",
      "author": "New_Demon24-7",
      "created": 1637756565,
      "upvotes": 17,
      "replies": {
        "hlwe6cf": {
          "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlwe6cf/",
          "text": "I agree with this 100%. I'm 32 and had friends for the first 20 years of my life that I grew up with. At some point, they've gone their own ways as much as I have. I see them every so many years but it's hard. I miss them a lot, but we can't control everything in life. I still keep tabs with some of them.\n\nLife long friends are your spouse. That's the one you get. If you find a good one, they are all you'll ever need.",
          "author": "Awkward_Mail_2786",
          "created": 1637761560,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hlvys2f": {
      "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlvys2f/",
      "text": "Not everyone may be meant to stay in your life forever. Even the ones you truly care for. Nobody can predict what would happen if you stay or go. Weigh your options and do what's best for you. Personally I would say take your opportunities , keep in touch and if it's meant to happen they'll still be around.",
      "author": "_MisterMcstuffin_",
      "created": 1637751661,
      "upvotes": 3,
      "replies": {}
    },
    "hlw1aip": {
      "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlw1aip/",
      "text": "If they're really lifelong friends, they will be around whether you stay or go. If it's two years, I'm assuming there is some type of break in between for you to visit. College should be used as a time to explore the world in my opinion, figure out where you fit and if it's back home at the end of the two years, then you learned something new about yourself. You're going to leave and make even more friends so, to be honest, it's a win-win situation. You get to either have your original friends when you're back or you will have relationships all over the world or you'll have a combination of both. As someone who invested time and money into extensive traveling throughout my college career, you will never regret it and I highly recommend putting yourself in new environments, even if your best friends aren't right next to you.",
      "author": "College_stdnt06",
      "created": 1637753567,
      "upvotes": 2,
      "replies": {}
    },
    "hlw1ptw": {
      "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlw1ptw/",
      "text": "Sad news is, you're probably not wrong. I took a couple gap years and most of the friends that I thought I was super close with freshman year barely kept in touch and I haven't seen hardly any of them since. But also, the new friends I found who were in my major and we literally spent 10+ hours a day together for 2 years, also just kind of drifted out of my life. We get together maybe once every 6 months, and several of them work together, but you move on from that phase of life and sometimes realize just how different you were, or how little you have in common, once the pressure cooker that is college quits giving you common ground. The one I would have kept in touch with closest ended up with a job halfway across the country. The rest of them only live an hour away, but getting married, buying houses, career shifts, etc really just make it hard to keep up with people. There's a reason that all the groups of friends in sitcoms are like late 20s working professionals. You're more settled as a person, you aren't forced into proximity with anybody or anything, and you're probably going to stick around in one place or area a lot longer than 4 or 5 years.\n\nTL;DR It will probably happen whether or not you do the study abroad",
      "author": "Thelton26",
      "created": 1637753876,
      "upvotes": 2,
      "replies": {}
    },
    "hlxck4l": {
      "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlxck4l/",
      "text": "You’ll meet friends abroad and a good friend will remain in contact even while you’re gone, even if it’s a text or fb message from a different time zone. Not everybody meets their lifelong, or even long term, friend in college. It’s no promise that it’d even happen.",
      "author": "BamSlamThankYouSir",
      "created": 1637775951,
      "upvotes": 2,
      "replies": {}
    },
    "hlwcv03": {
      "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlwcv03/",
      "text": "I left my home country at 19 and lived in 3 different countries since, and one of my best friends from childhood lived in a different country and we would only meet over the summer. Sometimes I don’t see my friends for more than a year. This did not change the fact that we talk every single day, and when I do go home we hang out like we were never apart. I have 7 extremely close friends, but I also meet up with other people I used to hang out with. I have made amazing friends in my new countries too and we keep in touch. I only lost one good friend due to the distance. You can always communicate thanks to social media, and sometimes you don’t even need that of your friendship is strong enough. So in my experience the distance will not destroy real friendships. I do miss them and I do wish we could hang out every day, but I can just text them and call them. And when I visit it feels like I never left",
      "author": "Dry-Razzmatazz8352",
      "created": 1637760869,
      "upvotes": 1,
      "replies": {}
    },
    "hlxj1dy": {
      "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlxj1dy/",
      "text": "Do you all have some sort of group chat where you can stay in touch with each other?",
      "author": "iamsojellyofu",
      "created": 1637778486,
      "upvotes": 1,
      "replies": {}
    },
    "hlzoan3": {
      "link": "/r/college/comments/r12hy8/how_will_i_make_life_long_friends_if_i_want_to/hlzoan3/",
      "text": "From undergrad (I graduated 4 years in May 2022) I talk to 4-5 people from college. Max. I found out last year 2020 how I was lied to openly over several things. So I have been cleaning out my contact list and social media accounts the last year. How bad I was lied to was pretty openly gas lit behavior.\n\nBut when you are abroad you will be in your own world. Then when you come home it’s new. One of the 4 remaining, just screamed at me over I text too much after she I guess is home from isreal grad school. So idk what’s really going on.",
      "author": "enoughstreet",
      "created": 1637811185,
      "upvotes": 1,
      "replies": {}
    }
  }
}