{
  "sid": "r0us28",
  "link": "/r/college/comments/r0us28/newbie_just_looking_for_supportadvice_on_what_i/",
  "title:": "Newbie just looking for support/advice on what I should do going forward…",
  "text": "Hey im new here don’t really know if this is even the right subreddit to post this but I’m gonna take a shot at it.\n\nAll my life (21m) i’ve dreaded school, high school in particular. not because of gossip or bullies but because of the stress and (honestly, trauma) from the school work, 5,6 classes and ridiculous deadlines. \n\nin my last two years of high school i had my classes trimmed down to only three classes and it was MUCH more comfortable but things were still pretty terrible due to the sheer amount of work i had to do in the class so it didn’t really change all that drastically as i’d hoped. \n\ni am someone who gets overwhelmed easily and especially if i’m told to do something that i don’t necessarily enjoy doing just for the sake of getting a piece of paper that has my name on it so my parents can go and brag about me to people about how i graduated from x school all the meanwhile, i’m feeling miserable and worthless. \n\ni have a passion for music as i myself am a music artist, been in the industry for about 7 + years, self-releasing. i went to a music college in 2019-2020 it was good, (the school’s staff weren’t the best) and overall i enjoyed it because it was something i’m (obviously) passionate about. it was a private school which was very expensive so i unfortunately cannot sign up to another private school due to financial reasons.\n\nI don’t beat myself up for not having a job, money, or never had a girlfriend. i just focus on myself and try to improve going forward. \n\nSchool has never been something that interests me and i carry that anxiety around with me :( \n\nTLDR: I don’t want to put myself through the emotional/mental stress of a traditional college but can’t/don’t want to pay for a private college. what would you recommend i do going into 2022?",
  "author": "Decent-Pizza-5977",
  "created": 1637723191,
  "updated": 1638207404,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hman8ac": {
      "link": "/r/college/comments/r0us28/newbie_just_looking_for_supportadvice_on_what_i/hman8ac/",
      "text": "As many people say, college isn’t for everyone, and if you get easily overwhelmed with people telling you to do things just so you get a piece of paper, well, that’s what college is lol But you don’t have to go through all that jazz if you don’t really want to.\n\nSince you said you enjoyed your time studying music, I would totally tell you to go pursue that. Try looking for scholarships, maybe CC and then transferring to a 4 year? \n\nGood luck!",
      "author": "MMSK_",
      "created": 1638034479,
      "upvotes": 1,
      "replies": {}
    }
  }
}