{
  "sid": "qbitmr",
  "link": "/r/college/comments/qbitmr/what_do_i_do/",
  "title:": "What do I do",
  "text": "What should I do\n\nI’m on my first semester of college, I’m not where I want to be. I got accepted into my favorite school for the Spring semester and am still going there, but for the fall semester I decided to enroll at another school to transfer credits in the spring. However, I really hate it here, like really really hate it, and feel like I’d be better off just working until I start in the spring at the school I’m much more interested in. If I decide to do this, What do I say to the schools?",
  "author": "TimothyR8",
  "created": 1634671512,
  "updated": 1634750273,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hha0uxf": {
      "link": "/r/college/comments/qbitmr/what_do_i_do/hha0uxf/",
      "text": "Nothing. As far as I’m aware schools don’t generally ask why you’re withdrawing. If they do, just be upfront and say it’s because you’re transferring schools. Nothin wrong with saying that as it’s ultimately your money being invested into the school you want to go to:",
      "author": "kizeltine",
      "created": 1634675598,
      "upvotes": 1,
      "replies": {
        "hha0y33": {
          "link": "/r/college/comments/qbitmr/what_do_i_do/hha0y33/",
          "text": "Do I tell the school I’m transferring too about this half semester spent elsewhere?",
          "author": "TimothyR8",
          "created": 1634675634,
          "upvotes": 1,
          "replies": {
            "hha1h1d": {
              "link": "/r/college/comments/qbitmr/what_do_i_do/hha1h1d/",
              "text": "That depends.\n\nIf you decide to drop the classes now and don’t finish out then semester, then no because it’s not relevant. \n\nOnly tell the school you are transferring to about the college you are currently enrolled at if you do decide to finish out the semester and receive the credits. That is assuming you’d want the credits to transfer over.",
              "author": "kizeltine",
              "created": 1634675846,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}