{
  "sid": "pqyvek",
  "link": "/r/college/comments/pqyvek/should_i_go_to_classes_for_a_major_that_im/",
  "title:": "Should I go to classes for a major that I’m planning on switching from?",
  "text": "I’m currently a nursing major, but I’ve decided it’s not for me. I’m planning on switching to a degree in biology, but I haven’t dropped my nursing classes yet. I have to meet with the head of the bio department on Monday evening, but I have 2 nursing classes scheduled before that. Do I just let my professors know that I’m planning on changing majors and won’t be attending class that day? I talked to my advisor, and she said to wait to drop my classes until after I’ve spoken with the head of the bio department and to go to my classes on Monday just in case I want to stay in nursing. At this point, my mind is made up about switching. Maybe someone else has been through something similar and can give me some advice?",
  "author": "NashvillePreds9",
  "created": 1632015579,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hdeu1of": {
      "link": "/r/college/comments/pqyvek/should_i_go_to_classes_for_a_major_that_im/hdeu1of/",
      "text": "Don’t drop your classes until you have in writing that you have been enrolled in the new program and have expressed instructions to do so. It still sounds very tentative and anything could happen!",
      "author": "renebeca",
      "created": 1632017569,
      "upvotes": 2,
      "replies": {
        "hdeuk19": {
          "link": "/r/college/comments/pqyvek/should_i_go_to_classes_for_a_major_that_im/hdeuk19/",
          "text": "I’m definitely not dropping classes until after I meet with the head of the bio department. I guess it’s just to talk about what specific major I’m going into. I made up my mind earlier this week, and I was so disengaged in the nursing classes I had. I’m just so ready to be done with them 😂",
          "author": "NashvillePreds9",
          "created": 1632017791,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054184
}