{
  "sid": "qxs8n5",
  "link": "/r/college/comments/qxs8n5/cant_get_the_class_i_want_and_registration_is/",
  "title:": "Can’t get the class I want and registration is right now",
  "text": "Long story short I’m in college scheduling classes for next semester and the one Spanish class I wanna take it says there’s an error and I don’t meet the requirements for the class ?? ( when I’m taking the prereq already, however there is a chance I can’t even take it bc of another prereq) anyways I emailed advising but they might not respond till Monday and idk if all the classes spots will fill up so what should I do??\nA. Make a new schedule without the Spanish class\nB. Keep my initial schedule as is and hope I get the Spanish class\nThe thing is, If I don’t end up getting this Spanish class, I have to change my whole schedule then for times sake so",
  "author": "kashmiri-chai",
  "created": 1637364139,
  "updated": 1637689549,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hlbknjz": {
      "link": "/r/college/comments/qxs8n5/cant_get_the_class_i_want_and_registration_is/hlbknjz/",
      "text": "Even if the class is full, you might still be able to email the professor and they can send an email to the department to hold your spot until the office re-opens, and they can lift the registration block...",
      "author": "physics_masochist",
      "created": 1637364670,
      "upvotes": 2,
      "replies": {
        "hlbl08v": {
          "link": "/r/college/comments/qxs8n5/cant_get_the_class_i_want_and_registration_is/hlbl08v/",
          "text": "It’s not a class is full problem it’s that it says while registering that I don’t meet the reqs for that class and  honestly Idk if I do or don’t but I’m saying hypothetically, let’s assume I don’t get the class, I won’t find out until Monday but I don’t want all the other class spots to fill bc If I don’t get the class I’m gonna change my whole schedule instead",
          "author": "kashmiri-chai",
          "created": 1637364818,
          "upvotes": 2,
          "replies": {
            "hld7p6x": {
              "link": "/r/college/comments/qxs8n5/cant_get_the_class_i_want_and_registration_is/hld7p6x/",
              "text": "Look at your college catalog. It will list each course and its prerequisites. You can check out the prerequisites there and then you’ll know for sure whether this is an error or whether you should hurry up and change your whole schedule.",
              "author": "SilverRiot",
              "created": 1637398436,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hlbm53p": {
      "link": "/r/college/comments/qxs8n5/cant_get_the_class_i_want_and_registration_is/hlbm53p/",
      "text": "Is the other prereq listed? Maybe there's an error if not.",
      "author": "KW01328",
      "created": 1637365311,
      "upvotes": 1,
      "replies": {}
    }
  }
}