{
  "sid": "quscv0",
  "link": "/r/college/comments/quscv0/not_sure_how_i_am_supposed_to_make_this_position/",
  "title:": "Not sure how I am supposed to make this position paper, any help",
  "text": " Hey everyone! So I have a module with the title \"Philosophy and Crucial Issues in Asian Communities\". One of the requirements is to do research on 3 asian countries which I already finished doing. (Namely Philippines, Thailand, and Vietnam). The research includes the impact of politics, religion, culture etc. on education. The second requirement is to make a position paper on Asian education. However, on my position paper I am required to put the results of my research on the 3 countries. I already picked out a position which is \"The positive effect of video games on education.\" However, I am not sure how I am supposed to show my previous research in my position paper. How can I go about including things about politics, religion, economics, etc. in my position paper? Even if I changed my position, I would find it hard to include those different topics in my paper. Am I going about this the wrong way? Any help would be much appreciated! Thanks again!",
  "author": "destructile",
  "created": 1637015612,
  "updated": 1637181485,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkvne8l": {
      "link": "/r/college/comments/quscv0/not_sure_how_i_am_supposed_to_make_this_position/hkvne8l/",
      "text": ">  However, on my position paper I am required to put the results of my research on the 3 countries\n\nCite your sources then? \n\nOkay, so you already wrote this once right. Just with less focus on video game = good for school. \n\nGet your previous essay notes and citation manager. \n\nGo through all your paraphrased notes about what paper has what; Bob supports your point, Steve argues against it but Jason and Mary prove Steve's argument is false based on data. Prepare to justify yourself. \n\nGo through all the points; \n\nHow does politics effect video games in education, what are the laws there? Look at China's limits, grants for educational games, marketing, interactivity and gameification.\n\nHow does religion play in and how does that effect the politics and economics as well. Do the religions like games, does for example Japan find Okami offensive, are religions taught and shared via games? \n\nEconomics is going to be the easiest, games industry makes money, school e-sports, sponsorships, Microsoft giving free licences out for Minecraft educational edition. This would probably be the easiest focus. \n\nAlso look at other points, class rankings, sleep, self care, mental wellbeing, whatever.\n\nOnce you have all the paraphrased citations and x says y but x is wrong as per a b c you have 75% of your essay done. Shuffle it into the correct order to be readable and start writing the rest. \n\nHave a [long post](https://ms-demeanor.tumblr.com/post/667607294885986304/the-next-piece-that-im-reading-is-another-work-of) on a break down of a literature review. I don't think you need to go this hard, but it might help. \n\nAlso you school might have writing help place.",
      "author": "adhdeedee",
      "created": 1637084824,
      "upvotes": 1,
      "replies": {
        "hkwzgb8": {
          "link": "/r/college/comments/quscv0/not_sure_how_i_am_supposed_to_make_this_position/hkwzgb8/",
          "text": "thanks for the help!",
          "author": "destructile",
          "created": 1637103880,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}