{
  "sid": "qmwokx",
  "link": "/r/college/comments/qmwokx/parents_wont_let_me_go_to_college_without_an/",
  "title:": "parents wont let me go to college without an athletic scholarship",
  "text": "hi, im currently a senior (17) my parents wont pay for any of my college they said. i dont have enough money saved either. I want to go to a nearby college in my area which is about 15k-25k. I want to become  a vet. However i run cross country and im not the greatest. But they expect me to get a running scholarship at some school in which i wouldnt want to go to. And i dont enjoy running enough to run at a college and not even like the college. They said you either get a scholarship or you cant go to college. what do i do?????",
  "author": "squigglyrave",
  "created": 1636065501,
  "updated": 1636137224,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hjch5zn": {
      "link": "/r/college/comments/qmwokx/parents_wont_let_me_go_to_college_without_an/hjch5zn/",
      "text": "Look into other scholarships. They're hard to find, the good ones, but ask the department of your chosen major. I just found out about a really great scholarship in my department in uni and it would have taken some re*SEARCH* to find on my own. Also, look into the scholarships you would be awarded solely because of your academics. Build a case for your parents, and ask them if not getting a degree (which is required for most min-wage or close jobs now,) is worth it over a sports scholarship.\n\nEDIT: If your parents won't help you with college, there's always the option of taking out loans yourself and filing as an independent. However, because of the predatory nature of loans, it would be best to push your parents. Also, be aware of everything around becoming a vet. It takes a lot of school, and can be harder than medical school to get into because there are very few vet schools.",
      "author": "ShesAlex",
      "created": 1636067189,
      "upvotes": 9,
      "replies": {}
    },
    "hjcjok9": {
      "link": "/r/college/comments/qmwokx/parents_wont_let_me_go_to_college_without_an/hjcjok9/",
      "text": "If they're refusing to help you financially to pay for college then your best option might be to do two years of community college first then finish the rest yourself. You'll save a lot of money to get your prereqs out the way.",
      "author": "Sermos5",
      "created": 1636068256,
      "upvotes": 6,
      "replies": {}
    },
    "hjd6js7": {
      "link": "/r/college/comments/qmwokx/parents_wont_let_me_go_to_college_without_an/hjd6js7/",
      "text": "Your parents can’t force you to attend or refuse to attend college. If you go to college in the U.S., you can complete the FAFSA and/or get loans. It sounds like your parents are uninformed about paying for college.  https://studentaid.gov/h/apply-for-aid/fafsa",
      "author": "Fleur498",
      "created": 1636078362,
      "upvotes": 3,
      "replies": {}
    },
    "hjewko8": {
      "link": "/r/college/comments/qmwokx/parents_wont_let_me_go_to_college_without_an/hjewko8/",
      "text": "check out colleges that change lives, ctcl.org. they have lots of financial aid",
      "author": "vekhna",
      "created": 1636119696,
      "upvotes": 1,
      "replies": {}
    },
    "hjeemnl": {
      "link": "/r/college/comments/qmwokx/parents_wont_let_me_go_to_college_without_an/hjeemnl/",
      "text": "Use Grants, Loans, and a Job ... like the other 95% of the population.",
      "author": "WCCobra",
      "created": 1636109575,
      "upvotes": 0,
      "replies": {}
    }
  }
}