{
  "sid": "r5no0m",
  "link": "/r/college/comments/r5no0m/is_it_just_me_or_is_it_rude_to_be_loud_in_common/",
  "title:": "Is it just me or is it rude to be loud in common areas where you see others working?",
  "text": "I go to community and we have a small cafe area. At least 3 people are doing work, not including me who is also working. There is a group of people just like....unnecessarily being loud (laughing, yelling, etc.). Idk man. Thank god ear buds were invented.",
  "author": "Mushy-froug",
  "created": 1638280149,
  "updated": 1638480506,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.56,
  "comments": {
    "hmntypc": {
      "link": "/r/college/comments/r5no0m/is_it_just_me_or_is_it_rude_to_be_loud_in_common/hmntypc/",
      "text": "A cafe is a place for people to socialize as well. It ain’t a library",
      "author": "whatitdowhatitbee",
      "created": 1638280174,
      "upvotes": 19,
      "replies": {
        "hmnw2zk": {
          "link": "/r/college/comments/r5no0m/is_it_just_me_or_is_it_rude_to_be_loud_in_common/hmnw2zk/",
          "text": "Yeah thats fair. I think it just heavily threw me off as everyone is usually quiet in this cafe and most go to the dining hall for socializing like that since it is a bigger area with more seats and this area is more commonly used for those who need internet but arent near the library",
          "author": "Mushy-froug",
          "created": 1638281230,
          "upvotes": 4,
          "replies": {}
        },
        "hmnwk7p": {
          "link": "/r/college/comments/r5no0m/is_it_just_me_or_is_it_rude_to_be_loud_in_common/hmnwk7p/",
          "text": "I also wouldnt have minded if they had a quiet convo but if I can hear you being loud over heavy rock music cranked up in my earbuds you arent just having a normal volume convo.",
          "author": "Mushy-froug",
          "created": 1638281464,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hmnv087": {
      "link": "/r/college/comments/r5no0m/is_it_just_me_or_is_it_rude_to_be_loud_in_common/hmnv087/",
      "text": "I think it depends. During peak hours, you can't expect people to be quiet in something like a cafe. That being said, if you come in off-peak hours and it's quiet, it would be rude to be super loud. In general, the conversation you're having should be kept at your table. However, if you really want a quiet space, go somewhere like an academic building or a library where.",
      "author": "quantum_complexities",
      "created": 1638280700,
      "upvotes": 6,
      "replies": {
        "hmnvmlc": {
          "link": "/r/college/comments/r5no0m/is_it_just_me_or_is_it_rude_to_be_loud_in_common/hmnvmlc/",
          "text": "fair enough lol. It is like 9am, typically this area is quiet unless someone has to take a class online (which I understand as this area is promoted for the internet use for people to work or eat). I probably should've just gone to the library but Im so used to it being quiet here since it is where me and a lot of other do work in the morning",
          "author": "Mushy-froug",
          "created": 1638281007,
          "upvotes": 2,
          "replies": {
            "hmnvvt2": {
              "link": "/r/college/comments/r5no0m/is_it_just_me_or_is_it_rude_to_be_loud_in_common/hmnvvt2/",
              "text": "It was like....6 people with 4 sitting and two surrounding them. Idk it was odd for this area for sure but it is fair they dont want to be in the cold. My college has a big eating hall which is where Im used to people going for convos or if they have a big group since tables only range from 3-4 seats here",
              "author": "Mushy-froug",
              "created": 1638281133,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    }
  }
}