{
  "sid": "rgbxj5",
  "link": "/r/college/comments/rgbxj5/thinking_about_taking_a_tech_elective_related_to/",
  "title:": "Thinking about taking a tech elective related to my \"focus\" of power/energy systems, but I'm having second thoughts",
  "text": "Disclaimer: I’m an Electrical Engineering major.\n\nSo there is a course called Renewable Distributed Generation and Storage. Here is the course description for the course:  \"This course  introduces a specific type of electric power system, the microgrid.   With ongoing deregulation of the electrical utility industry and  emergence of more renewable smaller generation sources advancement into  the electrical power industry will be met by microgrids.  The components  of a microgrid allow for modular production, distribution and storage  of electricity.  Topics will include a historical global perspective of  electrical systems, individual enabling technologies that comprise a  microgrid will be presented.  The class involves a design of a microgrid  that incorporates and considers economic, environmental, sustainable,  manufacturable, ethical, health and safety, social and political  constraints.\" This is one of the only EE tech electives offered in the Spring that is focused on power and it also fits at a good time in my schedule. It also seems interesting based on what the course description states.\n\nHowever, I'm having second thoughts about taking the course cause of the professor. I think these reviews say it all:\n\n* \"Avoid this class at all costs. It is unorganized, and the things he  requires you to do...... Unclear about what he wants. Gives a \"rubric\"  and offers a regrade but does not even give feedback so we do not even  know where we lost our points. Honestly way too much work for an \"online  class\". If you're off by 0.01, you're not getting the A.\"\n* \"He may make funny jokes once in a while but that does not mean he is  a good teacher. Impossible to get in contact with him. He doesn't care  if he is late to class and never answers your questions straight  forward. Classes are always unorganized. He's a little self centered.  Probably from students simping for him. Bad face for EE.\"\n* \"He is a funny guy, but that's all. People like him as a person, and  everyone outside the EE major think he's great. But EE students know  he's pretty lazy, never responds to emails, and super unorganized in the  courses he teaches. His labs were basically, \"I  want this circuit\", and expected us to do everything in terms of design.\"\n\nI couldn't find much reviews related to the course, so I took some recent reviews that are closely related to the course. I know grading shouldn't be the main focus and all, but I also am having doubts about things like having to teach myself most of the course and just how disorganized it is. I had a different professor for Senior Design who is almost similar and the whole course just felt like a mess and grading was kinda arbitrary.\n\nI was hoping to get some insight on whether it'll be worth doing or not.",
  "author": "ranych",
  "created": 1639501337,
  "updated": 1639516009,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hojr0mg": {
      "link": "/r/college/comments/rgbxj5/thinking_about_taking_a_tech_elective_related_to/hojr0mg/",
      "text": "Do you tend to be the kind of student who doesn't like professors? Do you have a victim complex? In my experience, even professors who have bad ratings online often are okay (not necessarily great, but okay) and people who complain online are looking for a reason for a poor grade, had a bad interaction with the professor, didn't get their dry or foreign sense of humor, etc. If you have someone you trust who has taken a class from him, ask them, otherwise I'd say go for it. Sounds like you're pretty far in the major, if you already have a decent GPA and/or a job, getting a slightly lower due to professor won't be a big deal.",
      "author": "Thelton26",
      "created": 1639510004,
      "upvotes": 1,
      "replies": {
        "hojw5rk": {
          "link": "/r/college/comments/rgbxj5/thinking_about_taking_a_tech_elective_related_to/hojw5rk/",
          "text": "I mean…not really? I have taken a course with this professor before for a required class and I would say the reviews are fairly accurate. The professor is not necessarily bad, but the class was pretty disorganized and it felt like I had to teach most of the course rendering lectures to be kinda useless.\n\nThe material does sound interesting, but I’d rather learn it on my own if it’s going to be more busywork (not just assignments, but having to learn most of the material myself).",
          "author": "ranych",
          "created": 1639512009,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}