{
  "sid": "kpatjz",
  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/",
  "title:": "Does anyone else feel like their university never has its shit together?",
  "text": "After 3 semesters of school and active student government participation, i have completely given up on my university. The administration and leadership either does not understand or does not attempt to improve student quality of life. Few advisors are helpful and every system on campus is a disorganized mess. The list of examples is endless, and it does not even begin to mention the recent scandals involving my school. Does anyone else feel like this towards their university? Some of my friends who go to other colleges seem to feel the same way, so i was wondering if this feeling was universal",
  "author": "Iceyhott1",
  "created": 1609638128,
  "over_18": false,
  "upvotes": 1395,
  "upvote_ratio": 0.99,
  "comments": {
    "gi71q0q": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi71q0q/",
      "text": "Don't worry, my university has the football team covered by spending $70,000.00 per week on hotels and whatnot so their season was not interrupted while my TA in physical chemistry didn't even have the ability to write things down for recitation. You ever wanted to learn about inner product spaces and solving the Schrodinger equation over a microphone? Greatest paid podcast ever.",
      "author": null,
      "created": 1609865646,
      "upvotes": 1,
      "replies": {}
    },
    "gi3uiwh": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi3uiwh/",
      "text": "My school didn’t cancel finals when the city was literally burning down. Thankfully, most professors did. But you would think the school would step in.",
      "author": "WinkyInky",
      "created": 1609793637,
      "upvotes": 1,
      "replies": {}
    },
    "ghznfmx": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghznfmx/",
      "text": "Most large state colleges are or at least seem ridiculously unorganized. The cost of organization is roughly $50,000 - $60,000 a year per student.",
      "author": "KDO-Double-G",
      "created": 1609705449,
      "upvotes": 1,
      "replies": {}
    },
    "ghzl6ul": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzl6ul/",
      "text": "All the time, even before this pandemic business",
      "author": null,
      "created": 1609704436,
      "upvotes": 1,
      "replies": {}
    },
    "ghzbe7f": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzbe7f/",
      "text": "My university has got its shit-related-to-taking-our-money together.",
      "author": null,
      "created": 1609699914,
      "upvotes": 3,
      "replies": {}
    },
    "ghz776n": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghz776n/",
      "text": "My university still insist on the online classes even though they aren't comprehensive at all, the Lecturers read the notes and no elaboration",
      "author": "Brianouma",
      "created": 1609697994,
      "upvotes": 1,
      "replies": {}
    },
    "ghz7342": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghz7342/",
      "text": "Yes. I curse the day I decided to attend the California State University System at Long Beach. It’s a cheap degree for a reason. I will forever share my awful experience there in hopes of saving other students.",
      "author": "RomanLion29",
      "created": 1609697942,
      "upvotes": 1,
      "replies": {}
    },
    "ghz5lly": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghz5lly/",
      "text": "Yes. I was in debate club. We wouldn't know any information until literally the morning of the debate. We looked like unprofessional assholes. I quit the club and made sure to not have any more courses witg that prof.",
      "author": null,
      "created": 1609697243,
      "upvotes": 2,
      "replies": {}
    },
    "ghywhrq": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghywhrq/",
      "text": "I do! My university was completely reckless this year. The online classes provided were not worth the in-person price. I found this podcast that is validating in this whole situation about college during covid. \n\n&#x200B;\n\n[Youtube video](https://www.youtube.com/watch?v=uyLf36vB-JU)\n\n[Podcast](https://anchor.fm/earthlydonnie/episodes/College-During-a-Pandemic-eoc1j2)",
      "author": "tropicalcasper1",
      "created": 1609693252,
      "upvotes": 1,
      "replies": {}
    },
    "ghyr1wp": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyr1wp/",
      "text": "I wished my school cared about their students. I guess the good thing abt my school is that it’s pretty clean",
      "author": "victoriachiang",
      "created": 1609690896,
      "upvotes": 1,
      "replies": {}
    },
    "ghyq1yy": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyq1yy/",
      "text": "I'm studying in one of the most popular universities in the country. It has a great rank among all the universities in my nation and is state-run. And it totally sucks. I don't know how they are going to train us to become what they claim.",
      "author": "anonforever19",
      "created": 1609690453,
      "upvotes": 1,
      "replies": {}
    },
    "ghyo424": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyo424/",
      "text": "I have a professor who is a tenant. Grades are due tomorrow and she hasn’t even post our final’s grades yet...",
      "author": null,
      "created": 1609689564,
      "upvotes": 1,
      "replies": {}
    },
    "ghyksjj": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyksjj/",
      "text": "Yep. All the time. The systems are the most illogical and convoluted things I've ever seen. Also, my University couldn't even keep me and my sister's financial aid stuff straight! We were getting notices about each other's stuff lol!",
      "author": "Littlebitt95",
      "created": 1609687944,
      "upvotes": 1,
      "replies": {}
    },
    "ghykdt7": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghykdt7/",
      "text": "I think this issue plagues higher education in general. Most of the high ranking universities tend to focus on their grad programs and research meaning that they don't care as much about the undergrad programs.\n\n&#x200B;\n\nThere is also an issue with higher education where the lack  of professors of practice leads to inadequate or out of date degree programs. For example, knowing SQL or another database query language is essential in many tech, engineering, business, research and consulting jobs however many stem majors don't learn a database query language.\n\n&#x200B;\n\nAlso there are still some schools which fail to teach python to their stem / business / econ students. Python is one of the most in demand skills today and many students aren't learning it in college. There are lots of jobs in finance that require knowledge of python and universities still don't teach python to their undergrad finance students. There are even some computer science programs which never touch python or java. Sure you know a C language however most CS majors should also know another language such as python, java or rust.\n\nThere are some universities which do really well at valuing their undergrad programs such as Ferris State University (MI) and Drexel University (PA) however this isn't the norm for most universities. It is often true that community colleges and universities who don't do research / don't have grad programs are better at teaching the lower level courses and they tend to demonstrate an interest in the student quality of life. This being said - they are often looked down upon as they tend to teach courses in a way similar to high-school where as the more prestigious universities taught in such a way where you have to teach yourself most of the material.\n\nI think this is where many people get fed up. They ask why they are going to said prestigious university and paying tuition only to self teach the material in a lot of their classes. I think it's a fair question to ask and it points to how out dated our higher education system is.",
      "author": "SecureDropTheWhistle",
      "created": 1609687761,
      "upvotes": 1,
      "replies": {}
    },
    "ghyite8": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyite8/",
      "text": "I'm fortunate to have attended and worked at a number of schools that were run quite well. I've been in my current job for about a dozen years, in a role that's helped me get to know undergrads, graduate students, faculty, academic leadership, admin/financial leadership, and countless staff.\n\nHigher ed's problems are more structural than folks here realize -- only in rare cases are they \"selfish\". Two structural problems come to mind.\n\nFirst is that we've asked schools to provide _everything_, to create this parallel society that educates, feeds, entertains, employs, provides medical care, polices, etc. thousands of young people. Most of this is a modern creation and not inherent to the concept of a university, particularly to its governance model (more of which next). U.S. schools could revert to what they had been prior to WWII and what many European universities remain: a place where you're educated and everything else is left up to you to figure out.\n\nSecond is that university governance is built to oversee its educational mission even though it's now asked to govern what amounts to a small city. Except for roles with regulations tied to it (like the fiduciary responsibilities of a university treasurer), nearly every senior role is filled by a faculty member. But try to think of a faculty member who makes you say \"Their background is perfect for Dean of Housing\" or \"I bet that professor of mechanical engineering would love spending 200 days a year on the road asking rich people for money,\" in the case of a school president. The paradox is, these people come from faculty because they're the only people faculty (the most powerful non-financial constituency in a university) trust. In order for many school leaders to have broad support, they must be unprepared for their jobs.\n\nMy advice would be highly specific to each school, but in general my recommendation is for students to be sure to be a well-organized constituency that keeps in close contact with faculty leadership and, if the role exists, with the ex officio student members of the board of trustees. That starts by familiarizing yourself with the names and topics in faculty meeting and board meeting minutes.\n\nExamples of minutes: https://trustees.iu.edu/meetings-minutes/minutes.html\nhttps://www.skidmore.edu/dof-vpaa/meetings/faculty/index.php",
      "author": "dcgrey",
      "created": 1609686954,
      "upvotes": 1,
      "replies": {
        "ghyrws6": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyrws6/",
          "text": "Tbf a large majority of school’s problems come from the opposite of what you describe, academics *aren’t* given enough power in academia. Instead bureaucrats and business people replace the power professor’s should be wielding. That’s how you get a trend towards adjunct faculty instead of TT faculty, “investments” in a corrupt cycle of administrators making six-figure salaries, and useless amenities that only act as a cost sink.",
          "author": "catfeinee",
          "created": 1609691286,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ghyhsyd": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyhsyd/",
      "text": "Another good idea is stop going to expensive colleges",
      "author": "Purua-",
      "created": 1609686457,
      "upvotes": 0,
      "replies": {}
    },
    "ghygvox": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghygvox/",
      "text": "What you might consider is that students are only part of the institution for a brief period of time and rarely get much of a view of the larger issues facing the institution.\n\nCouple this with the fact that students rarely have any context for how large institutions work and you should recognize that your attitude is likely based more on ignorance than actual dysfunction.",
      "author": "ViskerRatio",
      "created": 1609685956,
      "upvotes": 1,
      "replies": {}
    },
    "ghydmu7": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghydmu7/",
      "text": "Yes, my college is the shittiest place on Earth.",
      "author": "AnKrieg",
      "created": 1609684256,
      "upvotes": 1,
      "replies": {}
    },
    "ghydkng": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghydkng/",
      "text": "I have felt like this since I first stepped foot on campus. But I realized campus professionals were full of a lot of people who got their job because of nepotism/ connections and not merit. Then when they got in the role they became butt kisses who were afraid to go against bad decisions so they could move up the food chain. Seeing this culture made me realize absolutely nothing would change. Everyone is just trying to keep their job. They don't give a damn about the students in a way that would cost the university something they're not willing to give.",
      "author": "mloclamX",
      "created": 1609684227,
      "upvotes": 6,
      "replies": {
        "ghysbi4": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghysbi4/",
          "text": "Administrators are becoming the death of universities. :/",
          "author": "catfeinee",
          "created": 1609691463,
          "upvotes": 3,
          "replies": {}
        },
        "ghymhw0": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghymhw0/",
          "text": "It sounds like you just described the oil industry lol",
          "author": "SecureDropTheWhistle",
          "created": 1609688801,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "ghycrrj": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghycrrj/",
      "text": "My school is a mess. One professor turned in half a semester worth of grades on the deadline. Another didnt give feedback on any work for the second half of the semester. They advertise classes they dont offer. They basically assign youtube courses.",
      "author": "KarmaInFlow",
      "created": 1609683873,
      "upvotes": 3,
      "replies": {}
    },
    "ghya4ch": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghya4ch/",
      "text": "Sadly this is normal for how universities operate at this point.",
      "author": "myalwaysthrowaway",
      "created": 1609682628,
      "upvotes": 3,
      "replies": {}
    },
    "ghy9j29": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghy9j29/",
      "text": "Most school's worldwide in a nutshell.",
      "author": "Nashville1245",
      "created": 1609682330,
      "upvotes": 1,
      "replies": {}
    },
    "ghy8xpj": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghy8xpj/",
      "text": "You are not alone, I'll throw Eastern Michigan University under the bus too",
      "author": "blackpeoplearewhite",
      "created": 1609682046,
      "upvotes": 1,
      "replies": {}
    },
    "ghy6bye": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghy6bye/",
      "text": "I've gone to three different schools since this whole thing started. \n\nThe community college I went to and got my first AA degree was a mess, but it's hard to really criticize them when my last semester was literally went everything got shut down. However, I was able to give them feedback and I feel like they used it. However the so called \"graduation\" was a slap to the face. They didn't even read my name off, they just patted the faculty on the back. \n\nI transferred to a University to work on a bachelor's degree. GOOD GRIEF they can't figure out squat. I think for the entire semester I only got to talk to two different employees on the phone. There was an issue with my transcripts (there was multiple repeat codes, and the program I was going into only allowed two repeated classes) and it took MONTHS to get it fixed. I had two professors who made an effort to help their students, and another two who didn't understand that not all students were locked up in quarantine and had to work. Amazingly the only thing they did figure out was how to take the money from my pell grants. \n\n\nI decided to transfer temporarily to a local college to work on a second degree and wait to work on my bachelor's at the university when they figure things out (they have a year). This school is amazing. I have access to an academic advisor Monday - Saturday. And my program specific advisor always responds back to me within 24 hours. I had an issue with my fiancial aid (there was a hold placed on it that shouldn't have been) and they resolved it within 48 hours of me contacting an enrollment advisor. Absolutely phenomenal. If the university I'm going for my bachelor's didn't have the accreditation that it does I would transfer there completely.",
      "author": "Break_Away_1776",
      "created": 1609680662,
      "upvotes": 2,
      "replies": {}
    },
    "ghxti7l": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghxti7l/",
      "text": "Oh absolutely",
      "author": "izzypy71c",
      "created": 1609673893,
      "upvotes": 1,
      "replies": {}
    },
    "ghxq435": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghxq435/",
      "text": "My school decided to do early morning in-person exams while se technically can't stay at our dorms. Colleges are messy.",
      "author": "dumb_blonde_engineer",
      "created": 1609672039,
      "upvotes": 2,
      "replies": {}
    },
    "ghxgoxa": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghxgoxa/",
      "text": "My university really care imo, maybe bc it's free and doesn't care about money like other universities, idk.",
      "author": "LoriYagami_1",
      "created": 1609666991,
      "upvotes": 1,
      "replies": {}
    },
    "ghxfxhn": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghxfxhn/",
      "text": "It’s with every organization on this planet.",
      "author": "blazingdodo",
      "created": 1609666627,
      "upvotes": 2,
      "replies": {}
    },
    "ghx3phv": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghx3phv/",
      "text": "I have a professor who constantly repeats questions on exams to meet the question criteria and have seen multiple questions not make sense due to his lack of effort. \n\nExample: We had a question about saying \"From this map below what river runs through the Mississippi?\". The map shown was nothing but rivers and trade routes going through india.\n\nStrangest exam I've ever taken.",
      "author": "Memeraak",
      "created": 1609660510,
      "upvotes": 1,
      "replies": {}
    },
    "ghwywzu": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwywzu/",
      "text": "When I call my college the ladies act like I just killed their dad lol. They're always hella mad at everyone.",
      "author": null,
      "created": 1609658273,
      "upvotes": 3,
      "replies": {
        "gkp8rn5": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gkp8rn5/",
          "text": "Yes so true",
          "author": "taysway1989",
          "created": 1611577913,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghwvqbv": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwvqbv/",
      "text": "At some point you realize that’s it’s a job to pay the bills.\n\nI think it’s normal to have high expectations as a student. By the end you will likely be disappointed, even if just a little, regardless about your experience of university.",
      "author": "WickedProblems",
      "created": 1609656848,
      "upvotes": 1,
      "replies": {}
    },
    "ghwva0z": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwva0z/",
      "text": "I don't feel like my uni never has its shit together. I KNOW it never has its shit together.",
      "author": "LazyNomad63",
      "created": 1609656574,
      "upvotes": 3,
      "replies": {}
    },
    "ghwuznx": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwuznx/",
      "text": "I feel like my school just doesn't coordinate between things. The Housing office clearly doesn't talk to the accomidations office, the dining is run by a contractor that clearly doesn't care, academics obviously doesn't bother to push for reasonable schedules for students, or maybe they can't? Our campus certainly doesn't integrate with the local town aside from aesthetics.",
      "author": "Turtledonuts",
      "created": 1609656388,
      "upvotes": 5,
      "replies": {}
    },
    "ghwuli0": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwuli0/",
      "text": "It’s only been one semester but I’m at a pretty big state school and I feel like they care, I’ve already had some pretty passionate professors and my advisor has been extremely helpful so far. Especially considering all the covid stuff",
      "author": "BylvieBalvez",
      "created": 1609656200,
      "upvotes": 2,
      "replies": {}
    },
    "ghwshwz": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwshwz/",
      "text": ">active student government participation\n\nBelieving in student government, heh. That was your first mistake.\n\nStudent Gov, Exec Boards or Councils, Student Trustee positions...it’s all bullshit. It’s literally fairy dust. All of the big problems with a school center around money. Schools, like any institution, are *businesses,* arguably first and foremost.\n\nYou *really* think they’re going to give you even the slightest modicum of control of the coin purse? You really think they’re going to hand over the keys to the castle? What got me to leave my SG was when some knucklehead started going off about defunding our security team. First of all: great idea, Einstein, let’s just have all of the countless homeless only kept at bay by blue lights and midnight patrols creep on after 6 PM after we slash the budget. But moreover: nowhere in our constitution does it give us control over determining our university’s funding for the security.\n\nI’m sure there’s an element to it that some faculty want to see rising minds and figures at a university grow and improve themselves and others. But this good intention is dashed away by the very structure of 90% of student governments. And I say 90% because I know some Class of 2022 Student Senator is going to harp on my point by virtue of his school getting a fuckin’ compost bin or something.\n\nI’m not saying there’s no point to becoming “involved” at your school or making a mark, but when push comes to shove, unless you know a guy who knows a guy on the Board or unless you have the backing of literally 2/3 of the student body, your idea or plan will be superseded by someone with much higher authority and a far more self-interested goals.\n\nMy advice: advocate for change at the higher level, but acknowledge you’re limited by the situation of university life. Look out for #1; and if you want to look outside your own bubble, tend your own garden. Start a club, join a frat or sorority, a sports team (university sponsored or club). Don’t stay stuck in the clouds.",
      "author": "DoorHingeDeliveries",
      "created": 1609655245,
      "upvotes": 2,
      "replies": {}
    },
    "ghwp0ai": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwp0ai/",
      "text": "I went to UNM, which is a state school with a law program and a medical program (both top 50, but the bottom 9f the top) everything was like a well-oiled machine.\n\nNow I go to school you've never heard of, and wtf are you doing!? The weirdest part is the lecturers are quality, the profs are phds and experts in their fields, and advising was great but EVERYONE ELSE, no clue. \n\nThe weirdest part was unm generated a bill the moment I registered for classes. Makes sense right? You want money right? I signed up for guaranteed tuition, no surprises right? Nope, current school send it to be about 1-2 weeks before the semester starts. Don't you want your money early? \n\nDon't get me started on literally everything else. And the weirdest part is everyone is so damn helpful. Like, the scholarship office finished my finaid form because finaid but a freeze of some kind on it marking it incomplete. And my \"notmyadvisor\" greenlighted me for classes after advising me. Then a professor that advises for my department but is not my advisors advised me 2x before telling me he wasnt my advisor. Well guess what, now he's my advisor... because I don't know. No idea. Alsi this other guy, I dunno what he's supposed to do. He worked in the student ID office. He's the one that finished my transfer application in the first place because it was held up by some meningitis bullshit. THE STUDENT ID OFFICE. I walk by all the time, his entire real job is taking pictures and printing ID. Not even in the same building as admissions \n\nAnyways. How can I be mad? The application did go through, my finaid did get finished, I did get advised, greenlighted and registered. Now I've got a form to take graduate classes supposed to give to a dean... its in my notmyadvisorbutiguessmyadvisors desk... he said he'd get it done and his track record is immaculate.",
      "author": "bitetheboxer",
      "created": 1609653778,
      "upvotes": 3,
      "replies": {}
    },
    "ghwmkso": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwmkso/",
      "text": "One thing that has been the saving grace of the university that I graduated from is the heavy amount of decentralization it has. Some schools and department chairs made some really stupid decisions for their programs, but the rest of us were largely insulated from those decisions.\n\nWith a good department chair who is willing to go bat for his/her students, and the power to make things happen, the program can stay healthy for much longer even if the rest of the university isn't doing quite so hot, at least until the university starts concentrating that power at the top.",
      "author": "darkapplepolisher",
      "created": 1609652810,
      "upvotes": 1,
      "replies": {}
    },
    "ghwlc3d": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwlc3d/",
      "text": "I go to a small public university. It's one of the cheapest options in my state, and is considered the best school in-state for post-graduate employment. It's very well-respected, and I'm glad it was an option for me. They have great programs for students and the professors are very accessible and helpful (for the most part). The drawback is that it's a stem school, so you're not gonna have a very diverse campus life or options for your major. But I think schools that focus on a specific field are probably the best option since they are better able to meet the needs of students.",
      "author": "the_vigster",
      "created": 1609652220,
      "upvotes": 8,
      "replies": {
        "ghwn4jz": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwn4jz/",
          "text": "I'm in the same spot small-medium size public university, WWU. I applied and was accepted to Univ. of Wa and turned them down after the corporate atmosphere was revealed. I absolutely made the right decision. It's a dorky, adorable, extremely left-wing university and I couldn't be happier. My friend at UW has been fighting financial aid since June, and has found herself without aid, and 15k in debt after being mistakenly charged out of state tuition. Three cheers for small public schools",
          "author": "ItsReallyVega",
          "created": 1609653023,
          "upvotes": 3,
          "replies": {
            "ghwoos5": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwoos5/",
              "text": "Ugh, big universities seem like a bureaucratic nightmare, and spend way too much money on non-academic crap. The only thing they offer consistently is a fun campus atmosphere, but not without charging an arm and a leg. The kids at my school are generally quiet and nerdy, but they're nice people and know how to have fun. Plus we were able to stay partially open this past semester because of rigorous testing and students being sensible. Btw Washington is so beautiful, I want to visit so badly.",
              "author": "the_vigster",
              "created": 1609653642,
              "upvotes": 2,
              "replies": {
                "ghwpwzo": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwpwzo/",
                  "text": "They absolutely are! Not worth it, at least to me. If you ever visit, I hope WA treats you well. I'm very happy to live here. I'm in bham, our trails are gorgeous! So are the ice caves in the winter. You gotta visit the Seattle aquarium and the museum of pop culture. As much as I like bham, I'm a Seattle kid at heart, there's a lot to do there.",
                  "author": "ItsReallyVega",
                  "created": 1609654158,
                  "upvotes": 2,
                  "replies": {
                    "ghwscg6": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwscg6/",
                      "text": "That sounds sick! Ice caves?! Forests, mountains and rain were enough to draw me in! I have to check those out one day. Yep, Seattle seems to have a lot of interesting things to see. I also love jimi hendrix and 90s alt rock, so would definitely check out all the legendary venues you guys have. Thanks for giving me the insider info, I will keep it in mind when I get around to visiting.",
                      "author": "the_vigster",
                      "created": 1609655178,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ghwl9i5": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwl9i5/",
      "text": "I'm somewhat satisfied with mine for what our tuition is. There are some times I have been upset about something but I'm not expecting them to just never have any issues.\n\nMy one big annoyance is inconsistent/unclear communication which could be better from all areas of the university (this was pre-COVID too). Dining halls would change menus spontaneously or keep up outdated ones. Department has classes filling up and they give a vague response on if they will make additional sections.\n\nBut overall most of the university works fine and operates professionally. It's easy to notice the 2% of the time they mess something up but you have to remember that you don't notice the 98% of time time they don't mess up. A lot of the stuff you do each day as a student is held together by university employees and I guarantee you would be a lot worse off if most of those people actually didn't care about their work.",
      "author": "br1039",
      "created": 1609652184,
      "upvotes": 8,
      "replies": {}
    },
    "ghwjkgb": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwjkgb/",
      "text": "I transferred because my last school was such a mess. I couldn’t deal with it anymore, so I left. My current school isn’t too terribly much better, but I don’t live in a dorm with black mold and asbestos, so that’s something!",
      "author": "meaganannmorrison",
      "created": 1609651339,
      "upvotes": 25,
      "replies": {
        "ghwufz3": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwufz3/",
          "text": "ay same! Down to the fucking rooms. I had the 'luxury, apartment style' dorms facilitated by an 'accessory corporation', aka, I had a room big enough for a bed and a desk and shared an unfinished kitchen + bathroom with 4 other guys. We got scolded just for changing a light-bulb once, the rules they tried making adults follow but still charge full $800 rent was insane. \n\nI mean unfinished. Bare brick and concrete. And my roommates were fucking sucky. At times I literally jumped out the window (first floor) rather than deal with em.\n\nLike OP I was also trying to be involved with student gov and holy shit... Fucking awful. \n\nNow I'm a commuter. I live at home. It sucks in many aspects, but uh, much better in others.",
          "author": "_donotforget_",
          "created": 1609656131,
          "upvotes": 7,
          "replies": {
            "gi00mdi": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi00mdi/",
              "text": "I live off campus now and commute from my apartment, and I’m with you not knowing if it’s actually better",
              "author": "meaganannmorrison",
              "created": 1609711412,
              "upvotes": 3,
              "replies": {
                "gi027dp": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi027dp/",
                  "text": "Wish apartments were more available and affordable :/ gotta love zoning boards run by those who own all the housing stock lmao",
                  "author": "_donotforget_",
                  "created": 1609712146,
                  "upvotes": 1,
                  "replies": {
                    "gi0koz7": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi0koz7/",
                      "text": "Right :(",
                      "author": "meaganannmorrison",
                      "created": 1609720896,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ghx3k08": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghx3k08/",
          "text": "santa cruz?",
          "author": "thr0wingthetrashaway",
          "created": 1609660430,
          "upvotes": 1,
          "replies": {
            "gi00g3b": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi00g3b/",
              "text": "I used to attend University of Mary Washington in Virginia for reference lol",
              "author": "meaganannmorrison",
              "created": 1609711331,
              "upvotes": 1,
              "replies": {
                "gi17nl3": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi17nl3/",
                  "text": "lol damn. i didn’t know the asbestos and black mold thing happens at multiple colleges.",
                  "author": "thr0wingthetrashaway",
                  "created": 1609732763,
                  "upvotes": 3,
                  "replies": {
                    "gi1jwc4": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi1jwc4/",
                      "text": "Yup. The dorms were built in the 30’s and 40’s, so it’s a problem for a majority of them on campus",
                      "author": "meaganannmorrison",
                      "created": 1609740289,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ghwj91k": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwj91k/",
      "text": "I studied/have a Master’s Degree in Higher Education and I can echo a lot of things said here- colleges/universities are run like businesses. It’s a huge issue. However, there are many individuals working within the institutions that care about students’ experience on campus/wellbeing/life and really dedicate a great deal of time and energy into maintaining those values while working within a system that puts profit over humans. \n\nIt is pretty much a universal thing, and I know it sucks to feel like your only value is how much you contribute monetarily. I hope that you are able to find those individuals that are willing and excited to advocate for you and your peers within the shitty system that is higher education.",
      "author": "jami3866",
      "created": 1609651126,
      "upvotes": 10,
      "replies": {}
    },
    "ghwinyo": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwinyo/",
      "text": "Woot woot fuck that shit hole, I just transferred and am starting this spring in a new school. If you're reading this Hawkinson, you and your shitty adminstration lost you at least two students. Take your \"coal miner grit\" and shove it up your ass.",
      "author": "AtheaOfAltea",
      "created": 1609650725,
      "upvotes": 6,
      "replies": {}
    },
    "ghwhegp": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwhegp/",
      "text": "I've attended three universities. How do they keep getting students if they don't care about them, you ask?\n\nNEW BUILDING! GUYS, HAVE YOU SEEN THAT COOL NEW BUILDING WITH THE PIZZA PLACE IN IT?? ONE WHOLE WALL IS WINDOWS!\n\nYOU'RE FUCKING WELCOME!",
      "author": "FurretsOotersMinks",
      "created": 1609649878,
      "upvotes": 157,
      "replies": {
        "ghwo0j7": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwo0j7/",
          "text": "UCF is building a lazy river. Go Knights!",
          "author": "karenaviva",
          "created": 1609653375,
          "upvotes": 34,
          "replies": {
            "ghy6vkd": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghy6vkd/",
              "text": "I'm a fellow knight in COBA. The only reason I'm sticking around to finish my bachelor's is because of the accreditation. Screw UCF, I'm going to Valencia to work on a second degree untill UCF can figure out how to have in-person classes.",
              "author": "Break_Away_1776",
              "created": 1609680966,
              "upvotes": 6,
              "replies": {
                "ghyovha": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyovha/",
                  "text": "My son graduated from UCF (in law school now) and could have gone elsewhere, but we love UCF. I'm in CA now, working at a University here, but love UCF even more for sticking to remote-only (as our entire university system is remote-only). What I find excessive is the \"leisure pool\" and \"lazy river.\" It's incredibly anti-intellectual to build these as recruiting tools. They don't have to. It's a fabulous institution.",
                  "author": "karenaviva",
                  "created": 1609689916,
                  "upvotes": 5,
                  "replies": {
                    "ghzc0s7": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzc0s7/",
                      "text": "I wouldn't mind the remote access, but I feel like there's no support for students and being able to contact someone for an issue is practically impossible. I've heard a lot of good things about them (it's the main reason I transferred there besides the fact you can't beat the tuition prices for a university) but I wish they would give SOME support to their students even if it's in the form of tutoring.",
                      "author": "Break_Away_1776",
                      "created": 1609700203,
                      "upvotes": 7,
                      "replies": {
                        "ghzxnhp": {
                          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzxnhp/",
                          "text": "I know the Dean of Students. Her name is Adrienne Frame. Super-cool lady. She would be happy to hear your concerns. I would be shocked if there wasn't any tutoring, though. I'd Google it first before concluding there is nothing.",
                          "author": "karenaviva",
                          "created": 1609710043,
                          "upvotes": 1,
                          "replies": {
                            "gi0t3mq": {
                              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi0t3mq/",
                              "text": "Thank you, I might look into that. =)",
                              "author": "Break_Away_1776",
                              "created": 1609725199,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "ghz5p8b": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghz5p8b/",
              "text": "That will help SO MUCH with remote learning",
              "author": null,
              "created": 1609697292,
              "upvotes": 1,
              "replies": {
                "ghzvp02": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzvp02/",
                  "text": "Lol. True dat.",
                  "author": "karenaviva",
                  "created": 1609709140,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ghyfaau": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyfaau/",
          "text": "Yep.  I can tell you that they don’t do it by greater pay for faculty-",
          "author": "PaigeOrion",
          "created": 1609685014,
          "upvotes": 8,
          "replies": {
            "ghz5s9o": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghz5s9o/",
              "text": "*pay* faculty? Lolololol **laughs in SEMO**",
              "author": null,
              "created": 1609697332,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ghwhbmj": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwhbmj/",
      "text": "My college hasn’t even gotten back to us yet about if we’re living on campus or not, and the semester begins in two weeks. Try beating that",
      "author": "Xystem4",
      "created": 1609649826,
      "upvotes": 291,
      "replies": {
        "ghwiqqr": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwiqqr/",
          "text": "RIP. Good luck homie.",
          "author": "Ironman870",
          "created": 1609650777,
          "upvotes": 60,
          "replies": {}
        },
        "ghxpoeu": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghxpoeu/",
          "text": "I got an email saying not come onto campus until the 25th of Jan, there's still some indecision in the UK about schools reopening. And I have an exam this Tuesday. No lecturers are responding because they aren't in office until tomorrow",
          "author": "Coopdon101",
          "created": 1609671807,
          "upvotes": 33,
          "replies": {}
        },
        "ghynzpv": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghynzpv/",
          "text": "My group didn't have classes for a full month  because my Uni couldn't prepare the schedule on time",
          "author": "Ideal_Striking",
          "created": 1609689509,
          "upvotes": 9,
          "replies": {}
        },
        "ghyq7j3": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyq7j3/",
          "text": "As soon as I read this I knew where you were talking about. I was dreading my away semester this spring given that I couldn’t get an internship but the more I hear about admin’s indecision the more relieved I am that I don’t have to deal with that. I’m sorry dude!",
          "author": "cas47",
          "created": 1609690519,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ghwgo2s": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwgo2s/",
      "text": "I think it’s all colleges. It’s probably just on a spectrum of who’s doing better while still being a mess. In the long run I think it’s just hard to run a system that should be giving something that every person deserves but having to charge too much to make sure they can keep their doors open. Plus so many schools have been open for so long they’ve probably been digging holes for themselves for years.",
      "author": "LilFiz99",
      "created": 1609649392,
      "upvotes": 4,
      "replies": {}
    },
    "ghwf3n4": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwf3n4/",
      "text": "Not really but I’m just here for my degree",
      "author": "KING_COVID",
      "created": 1609648386,
      "upvotes": 2,
      "replies": {}
    },
    "ghwds0d": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwds0d/",
      "text": "I'm not looking forward to this spring semester. I just want to stay back home until the end of the pandemic.",
      "author": "REVIGOR",
      "created": 1609647562,
      "upvotes": 16,
      "replies": {}
    },
    "ghwd9tq": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwd9tq/",
      "text": "I go to a small private university, so they have more incentive to try and please their students and are more receptive to feedback. They do screw up some things, but I think that's inevitable in any institution.",
      "author": "Paesana",
      "created": 1609647250,
      "upvotes": 60,
      "replies": {
        "ghx0ep1": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghx0ep1/",
          "text": "I go to a small public liberal arts college and I feel the same way. My school actually cares about its students and it shows.",
          "author": "rainydayinmay9",
          "created": 1609658956,
          "upvotes": 17,
          "replies": {
            "ghzkpok": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzkpok/",
              "text": "I go to a relatively small school too, and they’re trying insanely hard to protect students. It’s awesome",
              "author": "carpe__natem",
              "created": 1609704210,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ghw8f5y": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghw8f5y/",
      "text": "I don't feel like that but, I feel like my University doesn't give a shit about its students which is probably true.",
      "author": "weediamonds",
      "created": 1609644265,
      "upvotes": 147,
      "replies": {
        "ghy1vlo": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghy1vlo/",
          "text": "College is a business. As long as their bottom-line looks good then they don’t care about you. And non-profit is just a fancy word for ‘tax-break’",
          "author": null,
          "created": 1609678268,
          "upvotes": 39,
          "replies": {
            "ghzosbu": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzosbu/",
              "text": "Bottom line?",
              "author": "theBlueProgrammer",
              "created": 1609706066,
              "upvotes": 3,
              "replies": {
                "ghzsu9c": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzsu9c/",
                  "text": "Bottom-line refers a company’s profits or losses. So if the bottom line looks good then that means the company is making a profit",
                  "author": null,
                  "created": 1609707869,
                  "upvotes": 2,
                  "replies": {
                    "gi01yc7": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/gi01yc7/",
                      "text": "Huh, interesting.",
                      "author": "theBlueProgrammer",
                      "created": 1609712027,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ghzjkfy": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzjkfy/",
              "text": "r/boneappleteeth",
              "author": "BrackWackley",
              "created": 1609703684,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ghw7h0l": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghw7h0l/",
      "text": "Colleges as institutions, at least big colleges, are all about profit and don’t care about the actual education of students. They funnel money into research for potential profit and sports for views and merch which lead to profit. They charge students extra for parking and housing. Do little to actually increase the quality of education and life of students. I’d argue smaller universities probably educate students better and actually want kids to learn. Big universities are simply a money scheme and don’t care about students.",
      "author": "Ironman870",
      "created": 1609643706,
      "upvotes": 356,
      "replies": {
        "ghweax0": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghweax0/",
          "text": "Smaller universities are usually private and cost more money to attend. I don’t see how that’s any different",
          "author": "kaystrrrr",
          "created": 1609647889,
          "upvotes": 107,
          "replies": {
            "ghwete6": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwete6/",
              "text": "My community college was a public school and is a lot smaller than the university in my town which I currently attend, and I can definitely say the quality of education was so much better than the one I'm getting rn at my CSU. The professors at my CC cared so much more about us actually learning than at my university. From what I hear from my friends who go to private universities, you actually don't deal with a lot of administrative issues and do end up getting a decent education, though it costs a lot of money. I complain to them about having to call a million numbers, send thousands of emails, pay tons of fees to get something small processed, and they don't understand why the university doesn't take care of all of that for us. That's one of the benefits of going to a private college.",
              "author": "pumpkin-jesus",
              "created": 1609648208,
              "upvotes": 70,
              "replies": {
                "ghwgey8": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwgey8/",
                  "text": "Can confirm by experience the part about “you don’t actually deal with a lot of administrative issues and do end up getting a decent education, though it costs a lot of money.” \n\nMy private college is not “known” or “good” for my major. It is not going to give me a Name Brand degree. It is *only barely* more expensive than my city’s major public university, after calculating parking fees (I don’t have them), activity fees (mine are cheap and optional), and other fees like “Department Fees” (only sometimes I have these). It is a *somewhat* closer drive to my home, but has way easier traffic (not all the way into the city) and easier parking. My program director is given a lot of responsibility (in reverse perspective, I will say she is admittedly overwhelmed), so she is directly coordinating my entire education almost completely one-on-one. My own graduating class is less than ten, and my program is less than 50. I’ve gotten an extremely customized and targeted education, with the amazing personal touches of having your professors care about your well-being in times of crisis. \n\nThat was a lot of info, but in general, my advice would be to look at the logistics of your own life first, determine under which circumstances you can succeed in, and search institutions accordingly. Make it about you first, so you guarantee yourself success, and consider the logistics in correlation. Bam",
                  "author": "hotbird1212",
                  "created": 1609649224,
                  "upvotes": 19,
                  "replies": {}
                },
                "ghwg5mo": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwg5mo/",
                  "text": "I understand your point, but I’m not willing to go 200 thousand dollars into debt just so I can feel like my professors “care” about me.\n\nIt’s only natural that a school with 1,000 people has a more personal feel than a school with 30,000 people. But, since the school wants a lot of money, they’re gonna charge those 1,000 people an arm and a leg to attend. \n\nI go to a public school with 30 thousand people and I’ve had a great experience and had some wonderful professors. You have bad and good professors at every school.",
                  "author": "kaystrrrr",
                  "created": 1609649057,
                  "upvotes": 37,
                  "replies": {
                    "ghwnbub": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwnbub/",
                      "text": "Yeah, college is expensive and unfortunately at a certain point you need to spend money to get the quality. Luckily I live in CA so my first two years of CC was free, and since my uni is in my hometown I only pay about $8000/year, which I have in savings after saving my whole life. So I'm going to graduate with no debt, but I'll leave my university knowing about as much as I did after earning my AA degrees. At this point, I'm basically just paying to be able to put \"BA\" on my resume and not paying to actually learn or be taught anything new. College is a scam, but most people know this",
                      "author": "pumpkin-jesus",
                      "created": 1609653100,
                      "upvotes": 14,
                      "replies": {
                        "ghzq9r7": {
                          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzq9r7/",
                          "text": ">I'll leave my university knowing about as much as I did after earning my AA degrees. At this point, I'm basically just paying to be able to put \"BA\" on my resume and not paying to actually learn or be taught anything new.\n\nMay I ask what is your major? As a PoliSci major, my experience was quite different. A key difference (between CC and a research university) is that the professors are active and highly trained in academic research. I don't think research methods was even offered as a course at my CC.\n\nratemyprofessor also helped when signing up for classes. If you're still in college, that's something you should consider relying on. The reviews can tell you about the professor's attitude, assignments, etc.",
                          "author": "AnCom9",
                          "created": 1609706731,
                          "upvotes": 2,
                          "replies": {
                            "ghzs5f0": {
                              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzs5f0/",
                              "text": "Yo, also Polysci my dude! I get better professors as I move through college, but unfortunately as a transfer student, I don't have the best priority when picking classes since I don't have as long of a history at the school. So, for example, if I need to take POLS 1, and there are two sections, the section with the good professor is already closed/wait-listed by my enrollment date and only the section with the subpar professor is open. So I get into the course I need, but I don't get the professor I wanted. I am looking forward to taking my methods class this semester; my friend showed me the program we are going to use and it seems cool, and that will be a good thing to add to my resume once I learn it. But so far, all of my UE political science classes have not taught me much new material unless I go out of my way to do extra research.",
                              "author": "pumpkin-jesus",
                              "created": 1609707562,
                              "upvotes": 2,
                              "replies": {
                                "ghztjb2": {
                                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghztjb2/",
                                  "text": ">Yo, also Polysci my dude!\n\nSweet!\n\n>I am looking forward to taking my methods class this semester; my friend showed me the program we are going to use and it seems cool\n\nI'm guessing SPSS? If you want to get a head start on it, you can either play around with it at the library or you can (for free) download [PSPP](https://en.wikipedia.org/wiki/PSPP)\n\n>that will be a good thing to add to my resume once I learn it.\n\nWhat are your career and post-graduation goals?",
                                  "author": "AnCom9",
                                  "created": 1609708177,
                                  "upvotes": 1,
                                  "replies": {
                                    "ghzuvef": {
                                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzuvef/",
                                      "text": "I just want a job that pays me a living wage and provides some basic healthcare benefits. I'll probably work for the State of CA and hopefully make enough money to only need 1 roommate to help pay rent. I'm thinking about graduate school but I don't know if I'm ready to commit to another 2 years of school",
                                      "author": "pumpkin-jesus",
                                      "created": 1609708766,
                                      "upvotes": 1,
                                      "replies": {
                                        "ghzyu3t": {
                                          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzyu3t/",
                                          "text": ">I just want a job that pays me a living wage and provides some basic healthcare benefits.\n\nIf you really want a strong resume, it's best to figure out a specific career goal. That way you can tailor your resume (and especially internship experience) towards it.\n\nIf you go on job boards and look at job requirements, something to notice is that companies don't tend to ask for just any experience and skills. What they usually seek is 1 or more yrs of **relevant** experience and skills.\n\nFor example, the [Environmental Specialist II position](https://www.google.com/search?ie=UTF-8&client=ms-android-tmus-us-revc&source=android-browser&q=state+of+California+job+openings#fpstate=tldetail&htidocid=2SPs6iatidr5LcxEAAAAAA%3D%3D&htiq=state of California job openings&htivrt=jobs) requires:\n\n\"One year of professional experience in environmental regulation, analysis, or environmental research performing duties and responsibilities equivalent to the Environmental Specialist (Level I) class in Sacramento County service.\"\n\nSo if you build up your internship experience to that level, it can put you in advantage over someone who has 2 months experience in a police department, 1 month experience in customer service, 3 months in a finance department, etc.\n\n>I'll probably work for the State of CA and hopefully make enough money to only need 1 roommate to help pay rent. I'm thinking about graduate school but I don't know if I'm ready to commit to another 2 years of school\n\nSince you're interested in State government, you might want to consider getting an [MPA degree.](https://www.csustan.edu/mpa)",
                                          "author": "AnCom9",
                                          "created": 1609710585,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        },
                        "ghwr8xp": {
                          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwr8xp/",
                          "text": "I’m glad your situation turned out so great for you. However, other people aren’t as lucky",
                          "author": "kaystrrrr",
                          "created": 1609654710,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "ghwqwvf": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwqwvf/",
                      "text": "This",
                      "author": "ionlyhave4",
                      "created": 1609654565,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                },
                "ghwn814": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwn814/",
                  "text": "I work at a CSU and I can appreciate your point. In my previous jobs I taught at a big R1 university as well as at a good Community College -- and I liked teaching at the CC a LOT more. I think a CC education gets you a big bang for the buck.",
                  "author": "karenaviva",
                  "created": 1609653059,
                  "upvotes": 3,
                  "replies": {
                    "ghwnpzo": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwnpzo/",
                      "text": "I feel at CC I was surrounded by people who considered themselves adults and were there to learn, not to party. Unfortunately it makes me forget that so many students at CSUs are right out of high school and aren't actually interested in studying. I can understand why professors are hesitant to treat their students seriously when they deal with students like that.",
                      "author": "pumpkin-jesus",
                      "created": 1609653262,
                      "upvotes": 6,
                      "replies": {
                        "ghz96me": {
                          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghz96me/",
                          "text": "Except the faces of college students everywhere but especially in the CSU are changing —it’s not just High school students in classes, you now have veterans and 30 year olds who’ve gone back to school to finish their degrees. The level of policing by professors and condescension is ridiculous. Professor’s “professionalism” is nothing short of insulting. The CSU system is a multilayered bureaucracy that buries the student and gets in the way of students actually achieving success—that’s what happens when a large portion of their  budgets go to pay administrative salaries and pensions! They hire adjuncts who are overwhelmed and underpaid and for the student it translates into a very subpar education. Those reading this if you can avoid it, have good grades apply to a private school they have several scholarships to help you, do your research they exist the quality you get will last a lifetime.",
                          "author": "RomanLion29",
                          "created": 1609698895,
                          "upvotes": 2,
                          "replies": {
                            "ghzd1fe": {
                              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzd1fe/",
                              "text": "I wish I could upvote this a million times. Yes, the level to which professors are condescending creates a somewhat hostile learning environment, and they are incredibly unprofessional. I've had tenured professors show up to class, in sweats/stained shirts, late and complain that \"they didn't want to be there\" and that \"they hate coming to class\" and they \"just want to go home.\" It's incredibly frustrating; if I did that at my job, I'd get written up or possibly fired. If I, as a student, said that to the professor, I'd get called ungrateful and lazy. As an upper division student with 2 AA degrees in my major, they talk to me like a child. I have a good job in my field and my boss will talk to me with much more respect than they will. I'm not learning anything that I wasn't already taught at CC, unless I do my own research. It is very frustrating that the highest paid state employees in CA are the NCAA coaches. I know a couple of great people in my school's administrative staff who really care about the students, but they don't have the power to actually do anything to help the students. Very frustrating.",
                              "author": "pumpkin-jesus",
                              "created": 1609700668,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "ghwuwu5": {
                          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwuwu5/",
                          "text": "That's exactly why I preferred teaching at a CC!",
                          "author": "karenaviva",
                          "created": 1609656352,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ghxk6d2": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghxk6d2/",
                  "text": "The main upside to private colleges is they offer a ton of scholarships through the school. My school costs 70k to attend a year but after they apply in school scholarships so far it’s been free and I’ve only had to take out a 3,000 loan",
                  "author": "ingloriousbiz",
                  "created": 1609668872,
                  "upvotes": 5,
                  "replies": {}
                },
                "ghx20xs": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghx20xs/",
                  "text": "Same experience here: community college had the best profs, who truly cared about my success, and focused, individualized attention. Quality of education was so much better than a large school. And it cost 1/10 the price lol",
                  "author": "mrbriguy11",
                  "created": 1609659699,
                  "upvotes": 2,
                  "replies": {}
                },
                "ghxk025": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghxk025/",
                  "text": "I go to a private college. I don’t feel as tho there is admin issue. Admin go out of their way to help us and often times there is more help than there is students. That being said, it is more expensive. I would not say my prior year experience at CC was better tho. Education was I’d say similar to high school, maybe a tad more challenging. At my private university it’s much more challenging and there is a completely different learning style. It went from basically busy work (online smart books and flash cards over memorization and discussion boards) and we rarely had a real decent lecture to serious lectures. Only 2-3 grades for an entire class. CC I went to had a lot of grades and busy work so you could half ass most of it and pull an A.",
                  "author": "ingloriousbiz",
                  "created": 1609668781,
                  "upvotes": 2,
                  "replies": {}
                },
                "ghz7b88": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghz7b88/",
                  "text": "Except if you go to an HBCU. My freshman year at Howard they left us without hot water for two weeks, without water in half the dorms period for two more weeks after that, and their designated counseling and student health centers were so ‘understaffed’ that students who applied for counseling in September were told to wait for the following semester. But HU, You Know!",
                  "author": "undercovernoob",
                  "created": 1609698045,
                  "upvotes": 2,
                  "replies": {
                    "ghzbnxi": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzbnxi/",
                      "text": "Wow, that's terrible. Going to CC and my hometown university, I am able to live at home and I completely forgot that many people have to deal with administrative issues when it comes to housing/food. That's crazy. Hopefully the quality of education is at least good? My university contracts with private rental companies for most of its student housing so it doesn't have to facilitate those types of issues, which means that if you have issues you report it to the rental agency itself (and they respond quick since that's their only job.) I can relate to the counseling issue though; I haven't met with a counselor at my university at all yet, and I've been there for a year. You have to call the office every day and/or show up in person every day to annoy them enough to do something.",
                      "author": "pumpkin-jesus",
                      "created": 1609700039,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ghwevhe": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwevhe/",
              "text": "That’s a valid point. I wasn’t arguing for certain school size would make a difference just a possibility and ending off with for sure that bigger schools don’t care. I go to a bigger school. My only other experience was taking a class at a community college which arguably taught me better and cared more that I learned the material.",
              "author": "Ironman870",
              "created": 1609648244,
              "upvotes": 4,
              "replies": {}
            },
            "ghwqoxl": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwqoxl/",
              "text": "Private universities usually have more money that state schools because of investors or alumni. And oftentimes, because they’re much smaller, they aren’t such a bureaucratic mess. \n\nI went to a small Catholic college in state and all it took was simply asking financial aid for extra money when I had an outstanding balance. No extra questions nothing. \n\nWhen I transferred to a huge state school, it took all semester to deal with an outstanding balance and it was solved the day before they were going to kick me out, because when I asked one question, I’d get a billion more.",
              "author": "CapriciousSalmon",
              "created": 1609654476,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "ghwff53": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwff53/",
          "text": "Small private colleges are *waaaay* more of a money scheme, if not *the* money scheme. They are significantly more expensive, often have limited research, and indulge in hiring adjunct faculty while padding a bloated administration’s wallets. Oftentimes they produce diplomas, not world class research, nor patents, nor properly accredited individuals. \n\nLarger flagship land-grant universities generally cater to a more diverse, multinational, and merit-based crowd, which provides significantly more economic mobility to 1stgen/low income students. Look no further than Michigan, California, Wisconsin, Minnesota, or Illinois. They also have the dual purpose of producing research and being academic/industrial kingpins of specialized industries, which allows them to produce something and bring in funds to provide more knowledge. Meanwhile private schools only offer obtuse student fees and tuition. Of course, these are generalizations, there are plenty of good private schools and *plenty* of bad flagships, but as a general rule it holds true.\n\n\nEdit: your experiences with bad teaching aren’t uncommon, specifically because in many cases it is world class *researchers* teaching them. This is an advantage at the higher levels, but not always at the lower ones. This is actually good, since unlike small schools the admin isn’t hiring adjunct faculty in favor of TT professors. My experience with community colleges has been poor because they often do not have the course selection, nor the same rigor of education, that is needed in my field. As a STEM field everything builds on itself, and if you find yourself weak in the fundamentals you will not do well in advanced classes.",
          "author": "catfeinee",
          "created": 1609648588,
          "upvotes": 14,
          "replies": {
            "ghzrgla": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzrgla/",
              "text": ">Small private colleges are waaaay more of a money scheme, if not the money scheme.\n\nSome of them are even openly forprofit.\n\nThe big private universities, such as Harvard, are at least nonprofit on paper.",
              "author": "AnCom9",
              "created": 1609707254,
              "upvotes": 2,
              "replies": {}
            },
            "ghwnpwp": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwnpwp/",
              "text": ">often have limited research, and indulge in hiring adjunct faculty while padding a bloated administration’s wallets.\n\nThis is a claim many people make about public universities. \\*administrators' wallets.",
              "author": "karenaviva",
              "created": 1609653261,
              "upvotes": 4,
              "replies": {
                "ghyfzoy": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyfzoy/",
                  "text": "I mean, it happens everywhere— but it’s *waaaay* more pronounced at private schools because they generally don’t have strong research programs. While it definitely happens at larger schools they still need tons of research professors, so it can be less of a problem at the higher levels. *administration’s wallet",
                  "author": "catfeinee",
                  "created": 1609685464,
                  "upvotes": 0,
                  "replies": {
                    "ghyoc4l": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghyoc4l/",
                      "text": "But that's just it: there were GOBS of public schools without a (strong/any) research agenda. So I'm going to have to suggest that, if you haven't attended or worked at a \"Regional Comprehensive,\" you might not be aware of how similar their budget situations are. But they lack the prestige + donors.",
                      "author": "karenaviva",
                      "created": 1609689670,
                      "upvotes": 0,
                      "replies": {
                        "ghypvow": {
                          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghypvow/",
                          "text": "Did you read what I said? “Flagship, land grant universities” and of course there are outliers, I made that very clear. It’s the first line of the second paragraph in my comment above, where I begin to talk about public schools.\n\n\nAlso, it’s not like all private schools have prestige, in fact, most don’t, and outside of your state/region you’ll be challenged to find someone who knows that “St. [insertgenericname]” exists as a school. Meanwhile people will recognize the flagships like Chicago, Madison, Twin Cities, Berkeley, LA, Ann Arbor, etc. and often know of the significant contributions they make to various fields.",
                          "author": "catfeinee",
                          "created": 1609690375,
                          "upvotes": 0,
                          "replies": {
                            "ghysaoy": {
                              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghysaoy/",
                              "text": "Lol. Ok. Thanks for 'splaining. You can be right.",
                              "author": "karenaviva",
                              "created": 1609691453,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "ghwfpvx": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwfpvx/",
              "text": "Chill bro. I’m not an expert just speaking to my personal experience. Never claimed to be “the guy who knows it all” just giving my take. Never said private schools weren’t a scam for the money. All colleges, at the end of the day, are about the money.",
              "author": "Ironman870",
              "created": 1609648776,
              "upvotes": 0,
              "replies": {
                "ghwg51r": {
                  "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwg51r/",
                  "text": "“I’m not an expert, it’s only from personal experience”\n\n—> proceeds to make claims about the nature of college, as if they are fact.\n\n\nIf you want to gripe about anything, don’t gripe about college, gripe about bloated bureaucracy within *all* of our institutions.",
                  "author": "catfeinee",
                  "created": 1609649047,
                  "upvotes": 5,
                  "replies": {
                    "ghwgxcl": {
                      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwgxcl/",
                      "text": "Thank you for educating me. How dare I make comments that are true and supported by your earlier argument. Also thank you for your edit on the earlier comment telling me I’m stupid and don’t know the basics.",
                      "author": "Ironman870",
                      "created": 1609649562,
                      "upvotes": -2,
                      "replies": {
                        "ghwh6o3": {
                          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwh6o3/",
                          "text": "You think your opinion is supported by my earlier argument..? Yikes. \n\nWhat part of me saying “they provide valuable academic research” and are “industrial kingpins” do you not understand? Lmfao. Whatever dude. \n\nIf you think my research involving catalysis of propagrylamines is in any way, shape or form, profitable, by all means, tell me how. Sure, it may be useful to people studying adjacent phenomena, and may help industries outside of my university develop, but it’s not something that directly financially benefits the university or myself.\n\nSome fields in school are primarily tuition-cashgrabs and don’t provide much intrinsic value— these are commonly the majors frat-boys, athletes, etc. gravitate to, so they have to spend less time on academics. That’s fine, but it is not representative of a university curricula as a whole.",
                          "author": "catfeinee",
                          "created": 1609649733,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ghwnbjt": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwnbjt/",
          "text": "I work in admission for a smaller public university (so can’t speak for larger schools) and can confirm that hands-on, experiential, high quality learning is a huge priority. It’s really fun to see students discover our school and how much we value the educational piece, getting a private school-like experience while they pay less. There are other schools out there like this as well! At the end of the day, universities are still a business, but they should all provide a high quality product that is your education. That’s why there are so many options out there!",
          "author": "dmackem",
          "created": 1609653097,
          "upvotes": 5,
          "replies": {}
        },
        "ghwnurd": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwnurd/",
          "text": "I highly disagree with this. I found bigger universities teach students way better than smaller ones.",
          "author": null,
          "created": 1609653314,
          "upvotes": 3,
          "replies": {}
        },
        "ghwsaz5": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwsaz5/",
          "text": "Go to a large state school and it’s supposed to be a “good” school but it’s honestly such a shithole and I can’t believe how some professors got their job. Nothing like random pop quizzes during a pandemic so you have to constantly check your email and be stressed out, outdated recycled lectures bc they’re too lazy to make new ones, grading is all done last second so you never know your actual grade, and half of my professors rarely respond to emails.",
          "author": "moonkie888",
          "created": 1609655160,
          "upvotes": 1,
          "replies": {
            "ghzb6h1": {
              "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghzb6h1/",
              "text": "My experience exactly.",
              "author": "RomanLion29",
              "created": 1609699814,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ghwmp71": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwmp71/",
          "text": "I go to a smaller state school. I get alot of personal attention very easily. I learn alot from\nthis personal attention.",
          "author": "maxweiss_",
          "created": 1609652860,
          "upvotes": 1,
          "replies": {}
        },
        "ghwqfpn": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghwqfpn/",
          "text": "are you referring to the student athletes, Ironman?",
          "author": "CapriciousSalmon",
          "created": 1609654374,
          "upvotes": 1,
          "replies": {}
        },
        "ghym222": {
          "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghym222/",
          "text": "I agreed w you up until the part about small colleges. They are even worse with this type of phenomena and you go into worse debt for them.",
          "author": "TheColorOfYou",
          "created": 1609688567,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ghvy6fc": {
      "link": "/r/college/comments/kpatjz/does_anyone_else_feel_like_their_university_never/ghvy6fc/",
      "text": "My college is absolute shit when it comes to handling covid. Its horrible. If u want to look into it search up @covid.campus on Instagram\n\nSo, yeah my college is not great or effective at all when it comes to caring about its students and that's just one example",
      "author": "shethanthegod",
      "created": 1609638368,
      "upvotes": 32,
      "replies": {}
    }
  },
  "updated": 1634050495
}