{
  "sid": "qofu96",
  "link": "/r/college/comments/qofu96/confused_on_whether_i_cheatedplagiarized_can_i/",
  "title:": "Confused on whether I cheated/plagiarized, can I get your thoughts and insight?",
  "text": "Something has been bothering for me for quite some time now. For my major, I took a humanities class back in undergrad where we had to write two midterm papers and two finals papers. We could pick from a list of questions what we wanted to write about for each. Around the midterm, I remember talking to some friends about the papers. Turns out, some of us were planning to answer the same questions. One of them had shared a good detail/information for answering one of the questions. When I went finally wrote my midterm papers, I thought about what my friend said and included the information into my midterm papers. I don't actually know what he wrote in his midterms exactly but I definitely know that we both included the information he shared.\n\nAfter doing some thinking, I'm wondering whether or not I cheated/plagiarized? \n\nThe moment still bothers me and makes me feel like I shouldn't have earned my degree because of it. I wrote my finals papers on my own without talking to anyone this time (i think out of fear I apprehended my own academic integrity). This type of incident never happened again but I think about it quite often.\n\nWhat do you guys think?",
  "author": "whatsreallygoodbruh",
  "created": 1636254461,
  "updated": 1636655812,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjmwy7o": {
      "link": "/r/college/comments/qofu96/confused_on_whether_i_cheatedplagiarized_can_i/hjmwy7o/",
      "text": "I don’t think 90% of the things we write, say or think are original thoughts. Someone has probably already said, thought or wrote it. There’s always bound to be similarities with these types of things. Your professor thought nothing of it so I’d just leave it alone. Don’t lose sleep over it￼, there’s people out here faking it their entire way through college and not losing a single ounce of sleep. You successfully graduated for a reason.",
      "author": "danielr088",
      "created": 1636257408,
      "upvotes": 3,
      "replies": {}
    }
  }
}