{
  "sid": "r5n4pn",
  "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/",
  "title:": "Is it possible to get an A still?",
  "text": "In this one class I got, you get to pick your own grade and explain why you deserve it. I haven’t been to class for reasons (for a month) but like I still do all the assignments on time online. I explained to her my situation and she was like “I understand”. Attendance was never stated to be mandatory in the syllabus too but the class does have discussions\n\nY’all think I can get an A? Or is that pushing it",
  "author": "Layzay374",
  "created": 1638278367,
  "updated": 1638480388,
  "over_18": false,
  "upvotes": 95,
  "upvote_ratio": 0.96,
  "comments": {
    "hmo8727": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmo8727/",
      "text": "Always give yourself an A. If you overshoot they'll adjust it, if you undershoot you get screwed.",
      "author": "LordofDsnuts",
      "created": 1638286682,
      "upvotes": 210,
      "replies": {}
    },
    "hmohe6u": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmohe6u/",
      "text": "You’re probably looking at a B if you did everything well. Not showing up is going to weigh on the outcome, even if attendance isn’t for a grade. Of course, making a case for an A is what you should do, but to be realistic, it seems more realistic not to expect an A.\n\nGood luck!",
      "author": "PhDapper",
      "created": 1638290366,
      "upvotes": 28,
      "replies": {}
    },
    "hmnrk0d": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmnrk0d/",
      "text": "I would go for an ‘A’ but have a good reason to back it up. Something like “I feel I did excellent even though I missed all of those classes. If anything it was harder because I had to also catch up on what I missed etc.” You know what I mean, something like that",
      "author": "Detozi",
      "created": 1638278907,
      "upvotes": 83,
      "replies": {
        "hmoggo7": {
          "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmoggo7/",
          "text": "Independent learning! Teaches both the class material and the wider skills necessary to learn *anything*.",
          "author": "themathymaestro",
          "created": 1638290002,
          "upvotes": 32,
          "replies": {}
        }
      }
    },
    "hmnx6mt": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmnx6mt/",
      "text": "If you get to pick your own grade, pick an A.\n\nWhat is so hard about this?",
      "author": "GenXtreme1976",
      "created": 1638281767,
      "upvotes": 55,
      "replies": {
        "hmo3fdn": {
          "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmo3fdn/",
          "text": "She is letting them give arguments and willing to entertain them. Not truly picking your own grade but still exceedingly generous.",
          "author": "darniforgotmypwd",
          "created": 1638284646,
          "upvotes": 32,
          "replies": {}
        },
        "hmnxdup": {
          "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmnxdup/",
          "text": "She was saying how some never showed up to class and never did an assignment but still asked for an A. Obviously denied. It’s not a free A",
          "author": "Layzay374",
          "created": 1638281866,
          "upvotes": 19,
          "replies": {
            "hmpkin5": {
              "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmpkin5/",
              "text": "well, you did your assignments and put in the effort, just put an A. If you’re an underclassmen, you need these early A’s.",
              "author": "aerowtf",
              "created": 1638305845,
              "upvotes": 26,
              "replies": {}
            },
            "hmnxqi4": {
              "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmnxqi4/",
              "text": "Then you don't really get to pick your grade.",
              "author": "GenXtreme1976",
              "created": 1638282032,
              "upvotes": 7,
              "replies": {}
            },
            "hmpg5ax": {
              "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmpg5ax/",
              "text": "[removed]",
              "author": null,
              "created": 1638304095,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmpxmsb": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmpxmsb/",
      "text": "Do you actually deserve an A, or do you want one? Also Don’t undershoot yourself because they won’t give you a higher grade. I would write out your explanation, be genuine, and try to read it critically  like you were a professor with a student with your performance. Because she said she understood, write reasons your work was A worthy, not A worthy given circumstance. You’ve already explained yourself to her, so focus on performance. \n\nI’ve done something similar- I had a physics class once that was very very easy for me, so I often missed class when I had other work. I explained to my professor that I actively meet the learning goals expected of me in my performance, but on a life balance aspect I did not feel it was necessary to go beyond those expectations. I explained it wasn’t a lack of respect I had for his class, but more that I was accomplishing the learning goals with less work because the material was not new to me. He was very understanding that I didn’t need his teaching and appreciated that I still displayed the proper effort despite not attending lectures.",
      "author": "NoRecommendation4777",
      "created": 1638311156,
      "upvotes": 8,
      "replies": {}
    },
    "hmq7gt6": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmq7gt6/",
      "text": "Doing the assignments and turning them in on time is the bare minimum and your professor probably knows this. Explain how your assignments went above and beyond to better justify why you deserve an A. Explain to your professor how you put A-level effort into every assignment rather than just saying you turned in all your assignments.",
      "author": "vieforme0303",
      "created": 1638315364,
      "upvotes": 5,
      "replies": {}
    },
    "hmqor6r": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmqor6r/",
      "text": "I think you know exactly what you deserve and what to say. The situation is being treated like imposter syndrome. Saying you deserve an A is awesome! You should not say any other grade because why would you?",
      "author": "KingZucchini",
      "created": 1638323136,
      "upvotes": 3,
      "replies": {}
    },
    "hmr3kcr": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmr3kcr/",
      "text": "You can say you want an A and see what she says. Personally I think you deserve a B because you haven't been to class in a month and have been missing the discussions.  See what she says",
      "author": "Harajuku_Aj",
      "created": 1638329832,
      "upvotes": 3,
      "replies": {}
    },
    "hmoee4v": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmoee4v/",
      "text": "The point of any class or course is to learn something new. Prove to her you know the material. Bring a fun visual presentation, and make sure you cover the objectives that you were meant to learn. If you can teach the subject back to her,  you do deserve an A.",
      "author": "bradylaliaspie",
      "created": 1638289190,
      "upvotes": 5,
      "replies": {}
    },
    "hmqm81k": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmqm81k/",
      "text": "You did the work. You’ve learned the material. Give yourself an A",
      "author": "Bosschopper",
      "created": 1638321981,
      "upvotes": 0,
      "replies": {}
    },
    "hmpfcjd": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmpfcjd/",
      "text": "[removed]",
      "author": null,
      "created": 1638303778,
      "upvotes": 1,
      "replies": {}
    },
    "hmry7af": {
      "link": "/r/college/comments/r5n4pn/is_it_possible_to_get_an_a_still/hmry7af/",
      "text": "I‘d say go with an A! Confidence is always good when it comes to these kinds of things. \nI mean if you did all the assignments and attendance was never stated to be mandatory I don‘t see a reason why you shouldn‘t deserve an A.",
      "author": "FlyingLettuce27",
      "created": 1638348887,
      "upvotes": 1,
      "replies": {}
    }
  }
}