{
  "sid": "q2puny",
  "link": "/r/college/comments/q2puny/where_should_i_go/",
  "title:": "where should i go?!",
  "text": "hello,\n\nI am trying to find a school to get my bachelors. I have already completed my associates at another school. I am looking for the cheapest online accredited school. I would prefer something that I can take 2 classes at a time and be considered full time. I would also like a school that is accelerated. So if i can get my bachelors in less than a year, that would be great. Is there anything out there like this? I have tried Devry and they take almost all of my credits. They want 40K!!!! I think that is too much... I would get done with my bachelors in a little over a year which is so appealing to me. I have 3.0 and looking to go into business hr or management.. something like that. If anyone could help me i would really appreciate it!!!",
  "author": "amaher4915",
  "created": 1633543239,
  "updated": 1634083719,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfmr6q8": {
      "link": "/r/college/comments/q2puny/where_should_i_go/hfmr6q8/",
      "text": "[deleted]",
      "author": null,
      "created": 1633543566,
      "upvotes": 3,
      "replies": {
        "hfq64g2": {
          "link": "/r/college/comments/q2puny/where_should_i_go/hfq64g2/",
          "text": "thank you! :)",
          "author": "amaher4915",
          "created": 1633613552,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfmz96o": {
      "link": "/r/college/comments/q2puny/where_should_i_go/hfmz96o/",
      "text": "I transferred form an in-person school to SNHU online and they are accredited and consider 2 classes per term (8 week terms) full time. There is a new term every 2 weeks so you can get your degree pretty fast. It’s accredited and personally I pay about 1,000 something a class which i was better than 40k a year haha. I’d say check out r/SNHU if you want to know more but overall i’m satisfied and am only a few terms away from getting my degree and graduating on time!",
      "author": "the_obsessives",
      "created": 1633547071,
      "upvotes": 2,
      "replies": {
        "hfq63un": {
          "link": "/r/college/comments/q2puny/where_should_i_go/hfq63un/",
          "text": "Thank you so much :)",
          "author": "amaher4915",
          "created": 1633613544,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}