{
  "sid": "qlvkb7",
  "link": "/r/college/comments/qlvkb7/combined_program_advice/",
  "title:": "Combined Program advice",
  "text": "I am currently 16 and already enrolled in college classes (I am graduating high school this year). My major of choosing will probably be a double major of Bio and Chem. I am projected to finish up core classes by the fall semester of when I am 19, I was thinking to do a combined program to get a chem masters, as that is something I really want along with a PHD in some form of Biomed or something similar, am I doing something that is crazy and way too ambitious?",
  "author": "sputnik8125",
  "created": 1635949372,
  "updated": 1636137500,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hj6mqrj": {
      "link": "/r/college/comments/qlvkb7/combined_program_advice/hj6mqrj/",
      "text": "Go for it! Ambition is a great thing to have. People spend so much of their lives thinking that they can't do greatly ambitious things. But really, go to school, work hard, involve yourself in extracurricular research/leadership/service, and keep your eyes on your goals. That's how you reach your goals. Learn from your mistakes and the times that you feel like a failure. And then keep going. \n\nFind mentors at school--professors, graduate students, other undergrads. *Especially* professors. Those connections can get you places you couldn't have imagined.\n\nThis only applies, though, if you are really passionate about the subject. You need to have an inner drive that gives you a reason to do all the work it will take to get to a PhD in your desired field, especially if you want to be at the cutting-edge of research. \n\nAnd maybe you haven't quite figured out what drives you, or what specific parts of biomedical research interest you the most. I found my passion through what I learned in my undergrad (as a biology major/chemistry minor) and through undergraduate research. So keep moving forward, try different labs if the one you're involved in doesn't interest you, and you'll find it. \n\nAnd if your passion pops up in an unexpected field, or you feel inclined to change the direction of your education, consider it. It's okay to change your mind. (Just better earlier than later). \n\nSorry this is so long haha. Good luck with everything!",
      "author": "hiwa_petra",
      "created": 1635965605,
      "upvotes": 1,
      "replies": {
        "hj6mz08": {
          "link": "/r/college/comments/qlvkb7/combined_program_advice/hj6mz08/",
          "text": "Honestly it helps a lot I’ve been having really bad doubts, Bc I’m so young I genuinely don’t feel like I belong in a good amount of my classes and it makes me uncomfortable and wonder if I’m really doing the *right* thing even if there will never be a right thing to do",
          "author": "sputnik8125",
          "created": 1635965691,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}