{
  "sid": "raz4om",
  "link": "/r/college/comments/raz4om/i_blossomed_late_and_never_reaped_the_full/",
  "title:": "I blossomed late and never reaped the full experience of college, I can't handle graduating from this stage of my live having never experienced it, what are my options?",
  "text": "It wasn't until a few months into my current senior year I began to really be confident and get out of my comfort zone. I started meeting people, going out more, etc and it was a blast. What kills me is I missed out on 3 years of this, especially the first two years. I was a commuter transfer student that lived at home and was fixated on saving money and getting a good job (because that's all that matters /s).\n\nI started to realize I completely threw away these valuable years of being carefree, finding myself and homing in relationships. I'm 6 months away from leaving college and I have no valuable experiences, no friend groups, etc. As much as I love my parents, I've regretfully told them I don't want to attend commencement, I literally have achieved nothing meaningful throughout these years that I can talk about to my future SO, friends, coworkers, etc.\n\nI'm not exaggerating when I say I can't mentally handle leaving this stage of my life \"empty handed,\" is there anything I can just do to get it out of my system and make up for lost time? For what it's worth, I don't believe things can get better from here and there's no point trying to convince me, I'll be 23 the time I graduate and start working. Even my boss at my internship straight up told me life is downhill after college, I mean I don't disagree -- everyone starts getting married/engaged, people are less available, more responsibilities, no partying, much more difficult to meet girls/guys, etc.\n\nI just regret being so brick-headed at 18 not realizing this and learning to just let loose and have fun. In the here and now, I've done better and made better use of taking advantage of opportunities to go out and have fun, but every time I do, I just realize inside that I should've been doing this since I was a freshman, then get bummed out.",
  "author": "Exitthrowaway838282",
  "created": 1638883400,
  "updated": 1639517331,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 0.91,
  "comments": {
    "hnlaptm": {
      "link": "/r/college/comments/raz4om/i_blossomed_late_and_never_reaped_the_full/hnlaptm/",
      "text": ">Even my boss at my internship straight up told me life is downhill after college,\n\nYour boss is a fucking idiot. \n\nTake it from a guy in his thirties that blossomed in his thirties. You do realize your so called college experience can be had outside of college? Meet new people, party at bars, good job and can afford cool stuff, try new hobbies, travel, living solo. You're literally just starting your adult life. The whole college experience is a fraction of what life is like after college. But with your attitude of course it's gonna be shitty.\n\nFix your attitude and stop listening to morons.",
      "author": "ShadowIG",
      "created": 1638884090,
      "upvotes": 26,
      "replies": {
        "hnloknd": {
          "link": "/r/college/comments/raz4om/i_blossomed_late_and_never_reaped_the_full/hnloknd/",
          "text": "Right? I know people who didn’t really start being happy and living their lives until after college. Life doesn’t end at 23 lol",
          "author": "havesomeyellowdrink",
          "created": 1638890541,
          "upvotes": 13,
          "replies": {}
        },
        "hnlyub3": {
          "link": "/r/college/comments/raz4om/i_blossomed_late_and_never_reaped_the_full/hnlyub3/",
          "text": "this 100%. how sad would it be to peak when one's at the start of their life? you're overreacting bro, contrary to this sub college won't be the capstone of ur entire life. keep that proactive attitude going after u graduate",
          "author": "muskl1ng",
          "created": 1638895075,
          "upvotes": 6,
          "replies": {}
        },
        "hnn5e4u": {
          "link": "/r/college/comments/raz4om/i_blossomed_late_and_never_reaped_the_full/hnn5e4u/",
          "text": "Thanks for your response, this is probably the same attitude I had at 18 which hindered alot of my experiences and opportunities. That being said, any advice just stepping into this new stage of my life and making the most out of it?",
          "author": "Exitthrowaway838282",
          "created": 1638913345,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnm5raw": {
      "link": "/r/college/comments/raz4om/i_blossomed_late_and_never_reaped_the_full/hnm5raw/",
      "text": "Prof here. Your boss is an idiot. Life gets better after 40.  Be PROUD OF YOURSELF, as it sounds you've done great so far!! Trust me - mid-50's - when I say you have not missed something irreplaceable.",
      "author": "because_life_happens",
      "created": 1638898155,
      "upvotes": 7,
      "replies": {}
    },
    "hnnfkzi": {
      "link": "/r/college/comments/raz4om/i_blossomed_late_and_never_reaped_the_full/hnnfkzi/",
      "text": "College can be great for some and pretty painful for others.  For some it's the full experience and for others it's simply a means to an end with all the academic stress to boot.  You're still so young and could shift your attitude to \"this is just the beginning\" if you just stop ruminating about the past and start looking towards your future.  For a lot of people, the most enjoyable free-spirited years of their life are most definitely after college. There are tons of people in their later 20's who would totally disagree with their reduced ability to socialize, party, and enjoy their free time in general. Try to find a job that pays well enough to live without too much financial stress and has reasonable hours, but live simply so that you can put away savings to do things you really want on your time off, like travel or whatever hobbies you enjoy.  Happiness starts to creep in when you start living in the present instead of lamenting about the past or worrying about the future.   You'll likely make new friends at work and there are tons of hobbies out there that young professionals build a social life from.  Try out some hobbies you've considered even if they sound kind of  lame.  You'd be surprised how fun some things can be if you're doing them with other people.",
      "author": "Wyddershins867",
      "created": 1638917820,
      "upvotes": 1,
      "replies": {}
    }
  }
}