{
  "sid": "dtzu2k",
  "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/",
  "title:": "How do you get close to new people at college?",
  "text": "I started college in September, so I've only known people there for like 2 months. Which isn't much and I didn't think I was supposed to make close friends after such a short time. But it seems like everyone's getting into close friendships with each other. I feel left out. I really like them and I would love to be their friends, but I don't know how. It doesn't seem like I can invite them anywhere. I mean.. Why would they want to meet me? We aren't close enough to invite them out for a coffee or a drink. At first I was like okay this will change and I'll get used to this feeling. Well I'm not getting used to it, it's getting worse. I'm constantly worried that they're together somewhere, having fun, and leaving me out. I knew this shit is getting serious when I saw two of them together in an Instagram story and got close to a panic attack. Any ideas? How did you manage to make new friends?",
  "author": null,
  "created": 1573324749,
  "over_18": false,
  "upvotes": 646,
  "upvote_ratio": 0.99,
  "comments": {
    "f7coelz": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f7coelz/",
      "text": "Just put yourself out there and introduce yourself early on. Get to know each other (even if it seems like shitty icebreakers) and it usually develops from there. Ask if they want to do stuff once you find common interests",
      "author": "jackdskis",
      "created": 1573596592,
      "upvotes": 2,
      "replies": {}
    },
    "f74pido": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f74pido/",
      "text": "I didn't meet any close friends until the ending if my first year. Now I have one friend that I can talk to. I didn't really do anything other than getting put into a group project where we were forced to work together. We started finding one thing in common and that is about a guy in our group that wouldn't do anything. I'm shy so it is hard to make friends for me. This semester I am sitting at a table with a group of people and we are all friendly with each other. You just gotta put yourself out there more. Talk to them and ask them to do something with you. You have to start somewhere. I just get into groups with people and we start to talk and I start to know them more as the semester goes on. They may bit be my friend by the end of the year, but at least I tried (somewhat).",
      "author": "Mzspyte",
      "created": 1573406052,
      "upvotes": 2,
      "replies": {}
    },
    "f749rh3": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f749rh3/",
      "text": "FOMO is an actual medical diagnosis now. What you said about Instagram made me need to tell you. Ask for help with an assignment or offer help. But into a conversation nicely and say, “I couldn’t help but to hear...” and go from there offer your number get their number and text them. No one is intentionally leaving you out. I tend to think the world is plotting against me too. But if you know deep down inside that you are a nice and fun person to be around and you’re only jealous because you feel left out, make more of an effort. It seems so natural, people making friends and all, but it takes effort. Be critical with your choice of friends too. College can be very eye opening keep your morals and only hang out with people that will keep you on track to graduate. There is probably a counselor on campus that you can talk to about FOMO who will help you with some more friend making techniques. No one intentionally leaves out the quiet person, they are just engaged with the people who make an effort. Make an effort, you got this!",
      "author": "sha_melle",
      "created": 1573399624,
      "upvotes": 2,
      "replies": {}
    },
    "f740veq": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f740veq/",
      "text": "You’re not alone. I was completely lonely my freshman year, and I’ve been jealous of everyone for seemingly finding friend groups so quickly. As I met others, I learned that others went through this as well. So many people understand what you’re going through.\n\nI highly recommend clubs and school jobs. Those are the two places where I was able to click well with people. I didn’t rly find classes to be effective because a lot of people have the mentality of just being present and then going home. But there may be smaller classes / group project-oriented classes where you have a higher chance of making friends.\n\nStart off by just being present. Attend club meetings, sign up for a job, be there for classes. Be nice and friendly with people, make yourself known as a welcoming person. Ask people to study together, or ask people if they’re interested in hanging out over the weekend. Chances are, there will be someone who wants to get to know you more who will be willing to make time for you.\n\nDon’t get discouraged by rejections. I’ve asked someone to hang out with me for an entire term and it never worked out - she always had an excuse. People like that aren’t worth your time, don’t fret about them. Stick with the people who make sure to make time for you. Likewise, make time for people you care about.\n\nIt’s okay if you don’t have friends until later in college. People make friends at different paces. You will be okay - there is nothing wrong with you.",
      "author": null,
      "created": 1573396865,
      "upvotes": 5,
      "replies": {}
    },
    "f73ymny": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f73ymny/",
      "text": "Get close to yourself.\n\nDo what you enjoy, be passionate about it, find others of the same mind.",
      "author": null,
      "created": 1573396375,
      "upvotes": 3,
      "replies": {}
    },
    "f73s4xv": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f73s4xv/",
      "text": "Join clubs. Find the nearest bulletin board and join something on there that takes you out of the confront zone. Getting out of your comfort zone will help you attract new friends who want to be your friend. Also, friendship takes some time, it will happen.",
      "author": "3rdtimeischarmy",
      "created": 1573394485,
      "upvotes": 2,
      "replies": {}
    },
    "f731g37": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f731g37/",
      "text": "Holy shit relatable as fuck",
      "author": "strangelyfactual",
      "created": 1573386269,
      "upvotes": 2,
      "replies": {}
    },
    "f72twvb": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72twvb/",
      "text": "Find common areas of interest\neg, i met some of my current friends because our common area of interest was anime, movies, etc. I meant my few other friends because they too enjoyed coding like me , and were gamers etc",
      "author": "ShreerajShivale",
      "created": 1573379409,
      "upvotes": 2,
      "replies": {}
    },
    "f72t19r": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72t19r/",
      "text": "Hey you'll be fine and you'll fine some real close friends. trust on this that i have one close friend and I love her sooo much (we met late senior year of high school), but I made one really great friend after asking if i could sit down on the same small bench (really stupid how tiny it was) and notice he also watches donut media. After that and second year of being in college were still great friends. So from my experince you will fine some great friends and don't worry too much. Coming from a only child; you'll have friends to hangout with and to talk to daily.",
      "author": "Poseidonsn",
      "created": 1573378007,
      "upvotes": 2,
      "replies": {}
    },
    "f72r4gk": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72r4gk/",
      "text": "By sitting next them..",
      "author": "RedFlutterMao",
      "created": 1573375058,
      "upvotes": 2,
      "replies": {}
    },
    "f72nljz": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72nljz/",
      "text": "I feel the exact same way. It's really jarring to go from th comfort of home and my familiar group of friends to this new city where I know nobody and it seems like it's going to stay that way too. Good luck buddy, I hope you figure out something soon",
      "author": "alcoholicparmesan",
      "created": 1573370394,
      "upvotes": 2,
      "replies": {}
    },
    "f72n4jc": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72n4jc/",
      "text": "I always find that it’s easiest to wait until the next semester and see if anyone from your previous semester shows up in that semesters classes. Then it’s like oh hey!!! Fancy seeing you here, wanna exchange numbers for class???",
      "author": "talkalottabby",
      "created": 1573369734,
      "upvotes": 2,
      "replies": {}
    },
    "f72mijp": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72mijp/",
      "text": "You're not Malaysian by any chance are you?",
      "author": "__Corvus__",
      "created": 1573368921,
      "upvotes": 2,
      "replies": {
        "f75s72x": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f75s72x/",
          "text": "Nah",
          "author": null,
          "created": 1573418551,
          "upvotes": 2,
          "replies": {
            "f76j31b": {
              "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f76j31b/",
              "text": "Ahh okay. Bc September intake for Australian Matriculation begun in September in my college and I was like hmm, could we be going to the same one? 😂",
              "author": "__Corvus__",
              "created": 1573428622,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "f72ikb6": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72ikb6/",
      "text": "If you have people that you want to hang out with more but aren’t quite sure how, my go-to plan was always: \nTypically a Friday night. Any night where no one has class/work the next morning. A solid “hey, wanna grab some food and go over ____ tonight?” (Typically people I had classes/upcoming shared activities). Agree on someone’s dorm/apartment/chill area to head back to after food (or with food if you prefer takeout). This is the point that created bonding for me. After like half an hour of munching and half assed discussion, we’d usually end up shooting the shit til like 1 or 2 am then boom, friendship. It sounds easy writing it down, but before college, I never saw myself asking people to hang out and stuff just because. You gotta push yourself out of your comfort zone. Once you leave it, you’ll find that it just gets bigger.",
      "author": "goldenjuicebox",
      "created": 1573364372,
      "upvotes": 2,
      "replies": {}
    },
    "f72ghlu": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72ghlu/",
      "text": "By walking up to/near them.",
      "author": "kjay38",
      "created": 1573362234,
      "upvotes": 2,
      "replies": {}
    },
    "f72gc5f": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72gc5f/",
      "text": "Literally met my closest friends in college by asking one of them whether they wanted to hang out, then he introduced me to the rest of his friends and now we're all friends.\n\nIt was out of the blue. He told me he lived in the same apartments as he did so I just walked over to his room and asked him if he was going this event later, and he said he was, so we said we would hang out. \n\nCollege is about getting out of your comfort zone and doing shit knowing that it won't matter what you think people thought of you down the line. Just take chances bro",
      "author": "Crapcicle6190",
      "created": 1573362086,
      "upvotes": 2,
      "replies": {}
    },
    "f72b600": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72b600/",
      "text": "I can second clubs, especially ones that involve the outdoors, or trips off campus. Really great way to bond and meet lots of different people, much lower commitment, and feels more organic than 1:1 coffees to me.",
      "author": "gropethegoat",
      "created": 1573357598,
      "upvotes": 1,
      "replies": {}
    },
    "f729h6o": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f729h6o/",
      "text": "Hey... you guys want to grab a coffee?\n\nHey... you guys want to grab some lunch?\n\nHey... you guys want to grab a beer?\n\nHey... you guys have any plans this weekend, I need a break from studying and all this damn work \\*haha\\*... \n\nIn other words, be friendly and just ask, worse that can happen is they say no and you stay home, if you don't ask you're staying home anyway. So, odds are better if you ask. \n\nAlso if they say they're already busy, (which happens when friendships are already setup) just tell them to hit you up when they're free because you soooo need to get out before the weather gets ugly or some bullshit like that lol  \n\n\nAlso, maybe join a club, it's automatic similar interests and new people to befriend.",
      "author": "Vickywog",
      "created": 1573356341,
      "upvotes": 6,
      "replies": {}
    },
    "f724r2m": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f724r2m/",
      "text": "Do extra curricular activities. Everything that looks cool. Take light coarse loads for a while and go do what sounds fun and you’ll meet likeminded people organically and probably figure out what you actually want to do with your life and switch majors in time to do it.",
      "author": "KeeganSnow",
      "created": 1573353539,
      "upvotes": 2,
      "replies": {}
    },
    "f724k3b": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f724k3b/",
      "text": "I try not to",
      "author": "JazzlikeSpinach3",
      "created": 1573353450,
      "upvotes": 1,
      "replies": {}
    },
    "f7224z2": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f7224z2/",
      "text": "I know that i was really lucky regarding this thing. I met some people through my introductury days, and im still with them constantly. We have \"added\" a couple people the last year. Just listen to some conversations and see if they talk about one of your interests like gaming etc. Thats how a girl i now consider one of my best friends joined my group.",
      "author": "Baconic_explosion",
      "created": 1573352308,
      "upvotes": 3,
      "replies": {}
    },
    "f71xsm8": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71xsm8/",
      "text": "I find that most of the friends I make at uni are people I sit next to in class. In fact, most of the time you will be forced to get to know people in class via things like group projects and those times when you know that the paper is due tomorrow even though you didn't start yet and you ask someone how much they've done so you feel better about yourself when they say they also have done shit all.\n\nSorry if that was too specific.\n\nAlso, I'd like to point out how hard it is to make new friends in college now since everyone in their time between classes is either on their phone, studying, or studying on their phone.",
      "author": "_Frustr8d",
      "created": 1573350191,
      "upvotes": 5,
      "replies": {}
    },
    "f71sgny": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71sgny/",
      "text": "In the same exact boat. It’s my birthday and I’m so lonely",
      "author": "aceanime",
      "created": 1573347131,
      "upvotes": 18,
      "replies": {
        "f71sinp": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71sinp/",
          "text": "I'm so sorry. Happy birthday though!",
          "author": null,
          "created": 1573347166,
          "upvotes": 13,
          "replies": {
            "f71skvo": {
              "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71skvo/",
              "text": "Thank you!! Hopefully these replies will be helpful to me too",
              "author": "aceanime",
              "created": 1573347208,
              "upvotes": 5,
              "replies": {
                "f72f8ze": {
                  "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72f8ze/",
                  "text": "Hey buddy. Dont worry. Sometimes the best birthdays are spent with some self reflection and alone time.",
                  "author": "AJuicyGrapeCutInHaf",
                  "created": 1573361056,
                  "upvotes": 3,
                  "replies": {
                    "f72fq85": {
                      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72fq85/",
                      "text": "Yeah that’s true. Hopefully I can find happiness soon and people to share joy with. Thank you",
                      "author": "aceanime",
                      "created": 1573361497,
                      "upvotes": 3,
                      "replies": {
                        "f72gjc5": {
                          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72gjc5/",
                          "text": "Nah man you wont find lasting happiness with other people.  Thats one thing depression taught me. It comes from within brother.",
                          "author": "AJuicyGrapeCutInHaf",
                          "created": 1573362281,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f72qomz": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72qomz/",
          "text": "While it's nice to spend birthdays with people, it's far from necessary. Just make sure you're doing the things you enjoy and make the best of it. Happy birthday!",
          "author": "Mister_Ghillie",
          "created": 1573374440,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f71qivj": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71qivj/",
      "text": "Took me 3 years to make my true friends. I did this by: 1) club sports 2) living with a few friends in an academic frat 3) realizing that I have a different definition of friendship than most people. I consider myself friends with people after I’m close and comfortable...but many people need less to feel secure in the friendship",
      "author": "scrabbleGOD",
      "created": 1573345910,
      "upvotes": 5,
      "replies": {}
    },
    "f71or39": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71or39/",
      "text": "Let me tell you my story from yesterday, I am in the exact same situation as you are, 2 months in collage, but I do have some friends and some kind of close, so about the story, a group of people were talking about modding Skyrim, Fallout and they were generally talking about games, I listened to all of their conversation and eventually they split up, I was shy so I didn't confront all 3 of them. After they split up I went to one of the guys and said, Hey! Umm I heard you guys were talking about modding skyrim and all that, are you a modder? He instantly started smiling gave his name, we sat together talked for hours and he introduced me to his group. So I would say find a group of people that you are interested in and try to find one of the members alone and just say a thing. Strike up a conservation, it won't hurt.",
      "author": "Raventhous",
      "created": 1573344743,
      "upvotes": 6,
      "replies": {}
    },
    "f71my6j": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71my6j/",
      "text": "I had the same problem freshman year. Honestly about half of the groups you see were friend groups before college (most people go to a nearby university so people from the same high school are bound to stick together in college). You just have to be patient, hit it off with someone from class or a club, and in ny experience, people are more receptive to invitations than you think. I asked my lab partner if he wanted to grab a bite at a local restaurant before working on an assignment. stuff like that. \n\nI made most of my friends late in my freshman year, all through one person I knew from class. You'll get there, just be patient and learn to enjoy doing stuff by yourself for the time being.",
      "author": "plotdavis",
      "created": 1573343986,
      "upvotes": 23,
      "replies": {
        "f75hfh9": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f75hfh9/",
          "text": "I needed this. I'm in my first year, met some people, but they all formed groups without me. After 6 weeks I had to start from scratch (friendwise), and just sat next to a guy in my lecture. That was 2 weeks ago, and now I sit every time next to him, and theres another guy too. We seem to get along really good, and I think I'll ask them if they want to grab lunch with me.\n\nI've always had a hard time making friends, and right now I feel extremely lonely and hopeless. I really hope to make friends, but I don't want to rush anything either. (Did this before, and it doesn't work). So maybe I should give myself more time and good things will happen much later...",
          "author": "macpad095",
          "created": 1573415148,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "f71mat3": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71mat3/",
      "text": "Join school clubs. Attend events. Be the kind of person you want to be friends with",
      "author": "cinnamonrain",
      "created": 1573343716,
      "upvotes": 3,
      "replies": {}
    },
    "f71jpdx": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71jpdx/",
      "text": "You’ll more than likely meet shit tons of people by just simply being in group projects and presentations with them, I’ve met quite few just by that alone during the past 3 1/2 years.",
      "author": "TheAstroPickle",
      "created": 1573342678,
      "upvotes": 2,
      "replies": {}
    },
    "f71914u": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71914u/",
      "text": "Best way to start out is in your classes. Literally anybody in your class would be happy to form a group chat for the class. Go up to people, say you're making a group chat and ask if they want to be added. You talk more and more in the group chat, you follow each other on insta, then eventually you just say lets hang out. \n\nWhen you see two people you know on instagram that are hanging out, you know how it happened? one of them said \"Lets hang out\". How do you expect to hang out with anyone if you don't ask them.",
      "author": "KindaNotSmart",
      "created": 1573337773,
      "upvotes": 45,
      "replies": {
        "f71veh8": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71veh8/",
          "text": "This is such great advice, I’m absolutely using this tbh",
          "author": "bienvenidos-a-chilis",
          "created": 1573348978,
          "upvotes": 5,
          "replies": {}
        },
        "f72tn7x": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72tn7x/",
          "text": "Ok so there are several people I have my eye on in school. I just see them walking around sometimes and this one girl I often saw at the start of the year and she smiled and me and I smiled back but we never really talked, just smiled.  \nAnd then there is this other person (I don't know their gender) and I keep seeing them walking around on campus and yesterday we were in the same work group and both sat alone but... It would have been weird for me to randomly sit right next to them. Right? Everyone usually spreads out in the classroom, like one person on the far left corner the next in the far right corner, so it would have been weird right?  \nSorry if this sounds like too much overthinking, I have awful social anxiety. But I really want friends haha.",
          "author": "ThatsTits_Janis",
          "created": 1573378983,
          "upvotes": 2,
          "replies": {
            "f749tt5": {
              "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f749tt5/",
              "text": "[deleted]",
              "author": null,
              "created": 1573399650,
              "upvotes": 1,
              "replies": {
                "f75h5m6": {
                  "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f75h5m6/",
                  "text": "Yeah I kind of hope I'll walk into her again and then somehow grow the nuts to start a conversation. She seems like such a sweet girl and ugh I just want to talk to her and get to know her but I get so nervous all the time.\nBut those are great tips you have! I never know what to talk about because honestly most friends I have walked up to ME and I have no idea how to start conversations without asking things that might be too personal or creepy.\n\nAnd for the other person, I thought it might be weird because there are about 50 seats and usually only ten or so people, everyone very much spread out across the classroom, so if I just sit right next to this stranger, wouldn't that be kind of creepy?\nI might need to think up excuses though. I'm great at finding excuses for not doing schoolwork, so I guess I can try this. And thanks for the tips!",
                  "author": "ThatsTits_Janis",
                  "created": 1573415053,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "f74ax6j": {
              "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f74ax6j/",
              "text": "Sit right next to the friendliest looking person and talk about assignments. Getting over social anxiety can happen if you gage the person in a positive light. See if they are making eye contact with you, how’s their body language? Turn it into a little science experiment and always compliment something. People love compliments.",
              "author": "sha_melle",
              "created": 1573399956,
              "upvotes": 1,
              "replies": {
                "f75gi2n": {
                  "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f75gi2n/",
                  "text": "But itsn't it... weird to do that? Like what if they think I'm being creepily clingy? Because usually everyone spreads out over the classroom except when they're already friends. I don't want them to think I'm a creepy loner who's like 'You're my new BFFFF now, can't escape me'.\nAs for the people that I'd like to be friends with: One had really possitive body language but I haven't seen her in a while. But about three times we saw eachother and she very sweetly smiled at me and I smiled back and (ugh my heart, I like sweet people so much) I didn't have the guts to say something because what if I was creepy? And when people are that sweet I get all nervous because they seem so cool!\n... I'm a mess.",
                  "author": "ThatsTits_Janis",
                  "created": 1573414835,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "f715ka8": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f715ka8/",
      "text": "The people in friends with are because I became friends with one person in one class. It just happened. Sometimes you just gotta let things happen",
      "author": "sasteeves",
      "created": 1573336446,
      "upvotes": 6,
      "replies": {}
    },
    "f714aad": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f714aad/",
      "text": "Make friends with people in your classes, do hw/study together. All of my closest friends are either from clubs or from my hardest classes",
      "author": "emory102",
      "created": 1573336030,
      "upvotes": 18,
      "replies": {}
    },
    "f70vlz7": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f70vlz7/",
      "text": "Start with study dates at coffee shops!",
      "author": null,
      "created": 1573333081,
      "upvotes": 3,
      "replies": {}
    },
    "f70hwse": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f70hwse/",
      "text": "Do you have classes with them? You could ask them to study with you next time you have an exam. That's an easy way to start hanging out with people without actually asking to hang out if that makes sense. Also, college is a lot different in high school and stuff. Most people want to make new friends. Sure they might have their group of close friends but people don't solely stick with one group. Give it some time too. Don't stress if you don't make friends this semester/quarter. I didn't make any good friends my first semester but then started meeting a bunch of people second semester that I connected with a lot more!",
      "author": null,
      "created": 1573328598,
      "upvotes": 51,
      "replies": {}
    },
    "f70h7iv": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f70h7iv/",
      "text": "The friends I made in freshman year were people I hung out with a lot because we met during welcome week or we lived near each other. Finally I made true friends in sophomore year and I feel like it’s that way for many students so don’t get discouraged.",
      "author": "nintendollparts",
      "created": 1573328382,
      "upvotes": 209,
      "replies": {
        "f74b929": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f74b929/",
          "text": "I made one friend who's stuck around from first year, all the others were second year tbf... Don't be discouraged!",
          "author": "Imperial_Squid",
          "created": 1573400128,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f70a941": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f70a941/",
      "text": "Clubs would be great to meet people with the same interest as you and you at least have easy conversation starters. Getting an on-campus job also let’s you meet faculty and other students working with you.\n\nIf you dorm it might be easier to meet people in your building while studying or just passing by. Meet people in your classes and study groups, and you could ask to grab food after or during breaks.",
      "author": "itzpizzatime",
      "created": 1573326213,
      "upvotes": 57,
      "replies": {
        "f72pbpr": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72pbpr/",
          "text": "Seconding this!!! Clubs and jobs are fantastic ways to meet people with stuff in common",
          "author": "etymologynerd",
          "created": 1573372819,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f709rt2": {
      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f709rt2/",
      "text": "literally just ask them to go out for brunch or something!! don’t panic it’ll be fine i’m sure they want to be your friend too!! you won’t know until you try!",
      "author": "nextuponwillitdrift",
      "created": 1573326015,
      "upvotes": 282,
      "replies": {
        "f717rrp": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f717rrp/",
          "text": "Doesn’t that make it sound like a date?",
          "author": "Jakeremix",
          "created": 1573337318,
          "upvotes": 81,
          "replies": {
            "f718ttg": {
              "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f718ttg/",
              "text": "Nooo, it’s a friend date.",
              "author": "DerpyArtist",
              "created": 1573337668,
              "upvotes": 97,
              "replies": {
                "f71d9mz": {
                  "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71d9mz/",
                  "text": "Just say \"no homo\" and it's not a date",
                  "author": "enigmaballs",
                  "created": 1573339537,
                  "upvotes": 99,
                  "replies": {
                    "f71ektw": {
                      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71ektw/",
                      "text": "Scientists hate this one trick!",
                      "author": "luisandhisrap",
                      "created": 1573340385,
                      "upvotes": 59,
                      "replies": {
                        "f71wc9o": {
                          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71wc9o/",
                          "text": "Scientists HATE him",
                          "author": "FactoryResetButton",
                          "created": 1573349504,
                          "upvotes": 16,
                          "replies": {
                            "f72nbyi": {
                              "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72nbyi/",
                              "text": "Doctors love him",
                              "author": "fieiofofodos",
                              "created": 1573370015,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "f71x1mb": {
                      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71x1mb/",
                      "text": "But what if I am homo and I want to take a new friend who happens to be male to lunch.\n\nI'm actually fucked.",
                      "author": "_Frustr8d",
                      "created": 1573349846,
                      "upvotes": 16,
                      "replies": {
                        "f72n2ax": {
                          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72n2ax/",
                          "text": "only if you let him",
                          "author": "talkalottabby",
                          "created": 1573369649,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    },
                    "f73vlm8": {
                      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f73vlm8/",
                      "text": "Say ‘yes homo’ and suddenly you’re out of the closet.",
                      "author": "EffervescentFlower",
                      "created": 1573395565,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "f72thrz": {
                      "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f72thrz/",
                      "text": "But what if you are homo but want a friend date?",
                      "author": "ThatsTits_Janis",
                      "created": 1573378735,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f71ib0w": {
              "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71ib0w/",
              "text": "Nope. Just ask after class if they want to get something to eat. People go get food one on one without it being a date all of the time and no one is going to assume you are dating just cause they see 2 people at the same table at a restaurant. I’ve asked people that and no one ever responded that they aren’t gay or something like that to make me think that I was asking them out.",
              "author": "RolfIsSonOfShepnard",
              "created": 1573342099,
              "upvotes": 29,
              "replies": {
                "f71m32t": {
                  "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71m32t/",
                  "text": "Eh, from my experience (guy), you're just assumed to be straight -- so I ask a guy, no eyebrows are raised, but asking a girl a lotta people assume date.",
                  "author": "TrekkiMonstr",
                  "created": 1573343629,
                  "upvotes": 22,
                  "replies": {}
                }
              }
            },
            "f71xl6r": {
              "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71xl6r/",
              "text": "Happy cake day",
              "author": "Sissithic",
              "created": 1573350095,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "f71t3g2": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f71t3g2/",
          "text": "If not this ask them for homework help, tutoring, or just a study group lol",
          "author": "GaijinKindred",
          "created": 1573347553,
          "upvotes": 7,
          "replies": {}
        },
        "f728gtg": {
          "link": "/r/college/comments/dtzu2k/how_do_you_get_close_to_new_people_at_college/f728gtg/",
          "text": "I was about to say this is terrible advice but then I remembered college and you get absolutely smashed at brunch in college and keep drinking until 3am.",
          "author": "BrendanIsThrew",
          "created": 1573355649,
          "upvotes": -1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054183
}