{
  "sid": "qhwk9t",
  "link": "/r/college/comments/qhwk9t/college_thoughts/",
  "title:": "College thoughts",
  "text": "I am a sophomore in college.  I have always struggled with time management and asking for and getting help.  I also struggle with getting organized.  I also have an addiction to my phone.  I thought this year was going to be different.  I thought I was going to turn everything in on time and get good grades and make my parents proud.  But no, I am failing all of my classes.  I have so many missing assignments.  I should have told my parents the truth about my grades at the beginning of the semester, but I did not.  I feel so overwhelmed and sad.  I just told my dad about it and I am trying to figure out what to do, but as I am looking at everything, I am just getting really overwhelmed.  if anyone has any words of advice or tips or anything like that, my DM's are open.",
  "author": "Otter_Lover02",
  "created": 1635455017,
  "updated": 1636184368,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hig8atj": {
      "link": "/r/college/comments/qhwk9t/college_thoughts/hig8atj/",
      "text": "The one thing that I have done since the start of college is make a schedule. At the beginning of the week on a notepad I write down the name of all my classes and underneath each class I write the assignments due for the week and the due date next to it. When I finish an assignment I cross it out and by the end of the week all of my assignments are crossed out. Rinse and repeat. It helps to have something concrete to look at with what you need to do and the satisfaction from tearing out the finished page in the notepad and throwing it away is pretty great. I also make sure to finish everything before the weekend so I can reset for the next week. Hope this helps.",
      "author": "Syntax_Error3141",
      "created": 1635466571,
      "upvotes": 3,
      "replies": {}
    },
    "higj7wj": {
      "link": "/r/college/comments/qhwk9t/college_thoughts/higj7wj/",
      "text": "[removed]",
      "author": null,
      "created": 1635471596,
      "upvotes": 1,
      "replies": {}
    },
    "higv9tn": {
      "link": "/r/college/comments/qhwk9t/college_thoughts/higv9tn/",
      "text": "I kind of had this problem freshman and sophomore year. I bought this planner app for my computer that syncs with an app on my phone for a one time payment under $5 for the premium version. It’s called PowerPlanner. It gives me notifications when things are due, allows me to put in other tasks/events, and let’s me put in my grades to keep track of how I’m doing. It’s been great. It also has a schedule section which shows when my classes are, and more importantly when I’m free, so I can half plan out when I’m going to do assignments. I’m still on my phone a decent amount, but have learned when I really need to do work to put it on do not disturb, so I don’t get side tracked when I get a notification.",
      "author": "desba3347",
      "created": 1635477242,
      "upvotes": 1,
      "replies": {}
    },
    "hihhtii": {
      "link": "/r/college/comments/qhwk9t/college_thoughts/hihhtii/",
      "text": "I feel you on this one. It's a working progress. I agree with the other peeps in the comments about keeping a list. Another thing I would recommend is the pomodoro technique. You try a task for 25 minutes and then take a 5 minute break afterward. This helps you ease into starting an assignment, and if you can't focus, just walk away and work on something else. Most times for me, I get into the zone anyways and continue. So I'm kinda tricking myself. The most difficult task is starting.\n\nIf you have trouble focusing, I would experiment with different environments. Personally, I can't focus in my bedroom sometimes, so I move to my living room. Sometimes I go to my college's library to motivate me since I see where other people are studying too. Maybe find a study group. Stay safe of course and do these things within your comfort level due to covid.\n\nFor my phone issue, I also run into that from time to time. Try placing it in another room or the far other side of it. Each time you want to reach for it, you have to make an effort to get up and it makes you rethink if you really need to get it. If you don't trust yourself, give it to a friend or family for safekeeping till you finish your task.\n\nI'm happy to help with any other advice, but I wish you the best and am really rooting for you. College can be tough at times.",
      "author": "CuriousPaulina",
      "created": 1635491985,
      "upvotes": 1,
      "replies": {}
    },
    "hijvyxi": {
      "link": "/r/college/comments/qhwk9t/college_thoughts/hijvyxi/",
      "text": "What helps me is using an app called Google tasks, which I use to jot down all of my assignments that are due. Even though my grades are still kinda low, at least I know when to complete my assignments.",
      "author": "aanuma",
      "created": 1635535914,
      "upvotes": 1,
      "replies": {}
    }
  }
}