{
  "sid": "qq0gxp",
  "link": "/r/college/comments/qq0gxp/im_failing_two_mandatory_courses/",
  "title:": "I'm failing two mandatory courses",
  "text": "Technically 3 courses but that's because our assignments are barely graded and they are like 3 points so I'm just waiting till my stuffs graded there. \n\nI'm failing Math with a 45 and Spanish with a 52. In math it's literally my exams, it's killing me I'm horrible at them but everything else I'm doing great at. \n\nI'm stressed as we have just a month left and I've been studying like crazy, I did multiple techniques and I was getting better then my grade got worse.",
  "author": "Ardie_BlackWood",
  "created": 1636452142,
  "updated": 1636655275,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjxpvnw": {
      "link": "/r/college/comments/qq0gxp/im_failing_two_mandatory_courses/hjxpvnw/",
      "text": "What Spanish are you taking? You could ask you classmates for help. I’m sure there are a lot of people in your campus who would be willing to help you with Spanish.",
      "author": "Caboverde-Evora",
      "created": 1636466695,
      "upvotes": 1,
      "replies": {
        "hjxs94f": {
          "link": "/r/college/comments/qq0gxp/im_failing_two_mandatory_courses/hjxs94f/",
          "text": "Novice Spanish/105. It's a online only class so I'm unsure whose in it besides me as it's a teach yourself type of deal.",
          "author": "Ardie_BlackWood",
          "created": 1636467831,
          "upvotes": 1,
          "replies": {
            "hk3tj5x": {
              "link": "/r/college/comments/qq0gxp/im_failing_two_mandatory_courses/hk3tj5x/",
              "text": "Asynchronous class? Those are fine when the class is easy but annoying when the class is harder",
              "author": "Caboverde-Evora",
              "created": 1636572304,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk5kaus": {
      "link": "/r/college/comments/qq0gxp/im_failing_two_mandatory_courses/hk5kaus/",
      "text": "math and foreign language require you focus on the big picture not the details. Its obvious you are not doing the former. It takes a certain number of hours of study before you can see the big picture and you have not reached that many hours yet (not even close). My advice, if you can afford to without the silly probation or satisfactory academic progress appeal, withdraw the entire quarter and retake it the following quarter so that you can reach those number of hours.",
      "author": "Cylinder126",
      "created": 1636598551,
      "upvotes": 1,
      "replies": {}
    }
  }
}