{
  "sid": "qrioq5",
  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/",
  "title:": "What do you think is the biggest misconception about college?",
  "text": "To me it would be attendance. I thought in college professors would not care if you showed up or not. But I’m aware it depends on the school.",
  "author": "walrusdog32",
  "created": 1636627837,
  "updated": 1639850736,
  "over_18": false,
  "upvotes": 116,
  "upvote_ratio": 0.99,
  "comments": {
    "hk7zbqk": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7zbqk/",
      "text": "No one tells you how lonely college can be",
      "author": "BakedPotat063",
      "created": 1636649721,
      "upvotes": 1,
      "replies": {
        "hk7zyzd": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7zyzd/",
          "text": "TRUE - it's so easy to isolate yourself in your room.\nAnd I'm getting tired of scheduling to meet people like I'm going on dates every day.",
          "author": "Angry-Annie",
          "created": 1636649975,
          "upvotes": 1,
          "replies": {
            "hk848e8": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk848e8/",
              "text": "That’s exactly what it feels like😂",
              "author": "BakedPotat063",
              "created": 1636651671,
              "upvotes": 1,
              "replies": {}
            },
            "hk8kvx5": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8kvx5/",
              "text": "This actually kickstarted my depression freshmen year. This year it gave me night terrors. I’m telling you, invest in a TV. The school provides free cable. I just leave it it on it feels like somebody’s there.",
              "author": "CapriciousSalmon",
              "created": 1636658274,
              "upvotes": 43,
              "replies": {
                "hkaqigk": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaqigk/",
                  "text": "Thanks for sharing 💜 you’ll make it!",
                  "author": "Stonkatron69",
                  "created": 1636693572,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk8c0g1": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8c0g1/",
          "text": "Yeah my parents always told me “oh you’ll make plenty of friends, I met most of my best friends in college”\n\nI’ve made a decent number of friends, but it’s so difficult to meet with people because everyone has totally different schedules (and college is just a lot of work in general)\n\nYou also go from spending 7ish hours each day surrounded by peers in small classrooms to maybe 2-3 hours a day in giant lecture halls\n\nIt feels both harder to socialize and harder to maintain friendships than in high school. It’s totally doable, it just seems to require a lot more actual effort",
          "author": "SkunkStriped",
          "created": 1636654714,
          "upvotes": 1,
          "replies": {
            "hk8hqks": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8hqks/",
              "text": "I'm significantly closer to my high school friends then any of my college friends. With a few exceptions, I'd be surprised if I talked to any of them after I graduated.",
              "author": "RealLameUserName",
              "created": 1636656998,
              "upvotes": 159,
              "replies": {
                "hk8qg7b": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8qg7b/",
                  "text": "I feel like being in residence really helps. I met most of my friends in Rez and the friendships I’ve made in college are much stronger than the ones I had in high school.",
                  "author": "SirTimbleton",
                  "created": 1636660563,
                  "upvotes": 39,
                  "replies": {}
                }
              }
            },
            "hk8gvt0": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8gvt0/",
              "text": "What you need is a shared, enjoyable activity. Intramural sports, fraternity, club, etc. \n\nMaking actual friends with random people you meet in classes is incredibly difficult.",
              "author": "Uhfolks",
              "created": 1636656655,
              "upvotes": 203,
              "replies": {
                "hk9qodn": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9qodn/",
                  "text": "I thought maybe there was something wrong with me but I am hoping this is the reason. In addition to this, I feel like a lot of people here seem to be happy with the circle they’re already in. As a newly transferred student, almost no one seems to be interested in befriending me besides other transfer students. \n\nAlso being an off-campus student just is just a cherry on top of the whole thing.\n\nSorry for the small vent but if anyone is going through this, I hope you know you’re not alone.",
                  "author": "Oh_please_help_me",
                  "created": 1636676419,
                  "upvotes": 38,
                  "replies": {
                    "hka9xru": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka9xru/",
                      "text": "See if your college has a transfer student discord. Many of them do.",
                      "author": "deprimada",
                      "created": 1636685372,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "hkc02ug": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkc02ug/",
                      "text": "So, a few points in no particular order:\n\n* Transfer students are great for making friends with. They don't come with a \"pre-set\" friend group, so they're often very open to meet new people.\n* Being on off-campus student only affects you as much as you let it. If you're going to classes, then going right back home.... yeah, you're not going to make any friends. You should still be doing things on campus like study groups, playing intramural sports, joining clubs, etc.\n* People \"happy in the circle they're in\" can still be sources of new friends. Even if they don't have the desire to make new friends, you could still find out about things from them- Party tonight at X's house, Y is looking for 2 players on their intramural soccer team, Z still needs a lab partner.",
                      "author": "Uhfolks",
                      "created": 1636725793,
                      "upvotes": 1,
                      "replies": {
                        "hkcattt": {
                          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkcattt/",
                          "text": "I agree with the some of the points you make, but I feel like these are really easier said than done for a student. I’m working while attending class full time and the fact that I’m older than most of my peers really factors in how much opportunities I have and what others think of me. I had a few experiences where some “friends” felt a bit awkward to meet up and greet because I was 3 years older. I know I haven’t mentioned this on the earlier post but I definitely feel like it’s a contributing factor.\n\nBut this weekend I made time to go to my first hackathon so I’m a bit excited about that!",
                          "author": "Oh_please_help_me",
                          "created": 1636730618,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "hk8ksy5": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8ksy5/",
              "text": "There’s also the fact you know once you leave that class you’ll never see those kids again, except maybe in passing. The only exception is if you room with one of them or you’re in the same major. \n\nI might be friendly with certain people at school but I don’t have friend friends. The only person I regularly hang out with we went to high school together.",
              "author": "CapriciousSalmon",
              "created": 1636658240,
              "upvotes": 50,
              "replies": {}
            },
            "hka9jcl": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka9jcl/",
              "text": "I think that’s cause our parents grew up in a time where the only entertainment besides TV was social. So there’d be social events widely participated in and only the truly awkward or avoidant personalities would be left out\n\nBut now everyone can (and does) spend more time doing online things than those social events, with the exceptions of things like parties. So friend groups are much smaller and tighter knit, and thereby harder to penetrate. \n\nSo even average people struggle to find social opportunities, when they were once abundant",
              "author": "DeepSpaceOG",
              "created": 1636685194,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "hk8t1rc": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8t1rc/",
          "text": "Man for real. My second semester at UTA was lonely as hell. I had people that I would study with from time to time, but when the day ended it was just me by myself in my dorm. My room mate only stayed in the dorm 3 times the entire semester so I never saw him either. Only thing that kept me sane was being able to play Xbox with my buddies from back home. It is also kind of my fault too though as I'm not a very social person",
          "author": "Pepe_The_Abuser",
          "created": 1636661629,
          "upvotes": 35,
          "replies": {}
        },
        "hk8rsim": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8rsim/",
          "text": "It's possibly lonelier than before. In 2010, most people weren't connected as much as they are now-24/7. I started school then and made friends super quickly. Can totally see how it would be much harder now.",
          "author": "chronosxci",
          "created": 1636661110,
          "upvotes": 30,
          "replies": {}
        },
        "hk8gm2m": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8gm2m/",
          "text": "I know Reddit tends to be anti Greek life but give it a try",
          "author": "Yurrrrrppp",
          "created": 1636656550,
          "upvotes": 41,
          "replies": {
            "hk9c8vm": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9c8vm/",
              "text": "Currently in a sorority and it was great for me, especially as a transfer student at my college! I don't think I would have met as many people (that I am now friends with) if I didn't! Joining Greek life was a good decision for me!",
              "author": "beachylawgirl22",
              "created": 1636669603,
              "upvotes": 8,
              "replies": {}
            },
            "hka9rjg": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka9rjg/",
              "text": "Join a club or sports team instead. Or go to the frat parties. But joining up in Greek Life just makes you their bitch as a freshman. They’ll milk you for money and rides",
              "author": "DeepSpaceOG",
              "created": 1636685294,
              "upvotes": 4,
              "replies": {
                "hkasyl2": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkasyl2/",
                  "text": "And then you turn around and do it to the new class and then they do it to the class after that. It’s worth it when you have a sober person to get you there and back.",
                  "author": "Yurrrrrppp",
                  "created": 1636695003,
                  "upvotes": 3,
                  "replies": {
                    "hkd1n50": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkd1n50/",
                      "text": "lowkey think it depends on the frat and the level of willingness someone has to deal with whatever the frat throws at them. \n\n\ni know a couple guys that have gone thru pledging and they all think it was worth it in the end. \n\n\nKnowing some of what each of those dudes went through though, and knowing that whatever information I have isn’t even the worst of it… Im pretty sure I would not find the same value that they did",
                      "author": "llooozp",
                      "created": 1636741508,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hk8i29x": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8i29x/",
              "text": "Try joining a professional frat(or sorority). I was very afraid to join a fraternity because of all the negative stigma such as hazing and shit. Plus, I grew up Christian and was always surrounded with racist, fascist asswipes so I never wanted to encounter those people in my life.\n\nTurns out fraternity was great. It is very diverse and I had a lot of fun and met some cool people. Nobody pressured to me drink nor smoke. If you find the right one, it can be a very good experience",
              "author": "owlwaves",
              "created": 1636657131,
              "upvotes": 34,
              "replies": {
                "hk8jloy": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8jloy/",
                  "text": "I can’t say this from experience since I’m not in a frat. But I think there’s an important distinction to be made between professional and social frats\n\nWhen people complain about frats on here, I really think most of their complaints mainly apply to social frats",
                  "author": "SkunkStriped",
                  "created": 1636657751,
                  "upvotes": 34,
                  "replies": {
                    "hk8nb6g": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8nb6g/",
                      "text": "There are some valid points made about social frats but to me they do not outweigh the benefits. Other than my degree the people I met and the social skills I gained in Greek life were the most important thing I’ve taken from college. It builds soft skills",
                      "author": "Yurrrrrppp",
                      "created": 1636659273,
                      "upvotes": 15,
                      "replies": {}
                    },
                    "hk979p6": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk979p6/",
                      "text": "Meh Imo social frats are fine (might be biased though), they took me to travel, free parties/alc, learned a lot of social skills and leadership skills. Overall it helped me break out of my shell. When I graduated they had a big network of alums that help you find jobs. But frats are not everybody’s cup of tea, make sure you dont join one that does stupid shit…",
                      "author": "Kpopboi",
                      "created": 1636667483,
                      "upvotes": 11,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hkauehx": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkauehx/",
              "text": "Definitely agree with this. Joined a sorority in my third year and I’ve already made so many friends. I also commute and so making friends on campus was increasingly more difficult. Now I feel like I always have people to be around and talk to\n\nEdit: I should also add that there’s been no hazing whatsoever and most campuses are pretty strict with it.. I can’t even hold the door open for initiated members because it counts as hazing.",
              "author": "cabbage-soup",
              "created": 1636695882,
              "upvotes": 3,
              "replies": {}
            },
            "hkcdvab": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkcdvab/",
              "text": "no ❤️",
              "author": "ssfwls",
              "created": 1636731878,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "hkakad7": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkakad7/",
          "text": "This one",
          "author": "Morbidstudent",
          "created": 1636690317,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hk805qz": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk805qz/",
      "text": "\"College is going to be the best time of your life\"",
      "author": "styrene13",
      "created": 1636650048,
      "upvotes": 1,
      "replies": {
        "hk84j37": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk84j37/",
          "text": "My friend said \" it'll be the golden period in life\".. by that he ment partying",
          "author": "thatandthis1",
          "created": 1636651789,
          "upvotes": 1,
          "replies": {
            "hk9ywlh": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9ywlh/",
              "text": "Well to the majority of college students that’s what they care about lol",
              "author": "charlesdickinsideme",
              "created": 1636680282,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hk8a46u": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8a46u/",
          "text": "If this is the best time of my life I feel like everything else would be rather low and that is depressing to think about. \n\nInstead I like to see it as an experience that I won’t repeat with individual elements that I can look fondly back on. Like I won’t miss they stress, but I will perhaps be nostalgic for some particular courses, some events, and spending hours just hanging out in the dining hall with mutual friends.",
          "author": "Katherington",
          "created": 1636653955,
          "upvotes": 1,
          "replies": {}
        },
        "hk85z4f": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk85z4f/",
          "text": "College has definitely been the hardest thing I've ever done, but I can definitely see myself looking back on this shit and missing it to some extent. I graduate next spring so maybe my perspective is a bit different though.",
          "author": "WashiBurr",
          "created": 1636652358,
          "upvotes": 1,
          "replies": {
            "hk8p3q2": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8p3q2/",
              "text": "[deleted]",
              "author": null,
              "created": 1636660012,
              "upvotes": 10,
              "replies": {
                "hka670b": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka670b/",
                  "text": "Ooh, interesting take. This might be why I quite like college compared to my k-12. K-12 I had a lot of bad problems - bullying from both teachers and kids, trouble making friends (largely due to school switching, but still), focus issues (unrecognized adhd), the Great Recession, parental loss.\n\nCollege I’ve mostly had “good problems.” Things like hard classes, figuring out how to balance work and school, etc. COVID and it’s effects have been the only serious “bad problem” of college for me.",
                  "author": "Snow_Wonder",
                  "created": 1636683667,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk8cebr": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8cebr/",
          "text": "I honestly think kindergarten was the best time of my life. I peaked at age 5, it’s all been downhill since lol",
          "author": "SkunkStriped",
          "created": 1636654868,
          "upvotes": 288,
          "replies": {
            "hk8fj0q": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8fj0q/",
              "text": "I'm glad I'm not the only one who feels like this!",
              "author": "HelloIAmMcSpitterson",
              "created": 1636656116,
              "upvotes": 28,
              "replies": {}
            },
            "hk8uo4o": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8uo4o/",
              "text": "Actually though, I had like no social anxiety until I got beaten down over the years :(",
              "author": "TrekkiMonstr",
              "created": 1636662295,
              "upvotes": 15,
              "replies": {}
            },
            "hk92ym4": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk92ym4/",
              "text": "Everyday I wake up yearning for the day I can take a mid-day nap again..",
              "author": "Capt_Am",
              "created": 1636665701,
              "upvotes": 8,
              "replies": {}
            },
            "hk9rw5q": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9rw5q/",
              "text": "I peaked at 4. 5 year old me was ahead of the curve anxiety wise having severe anxiety attacks almost every day.",
              "author": "Katherington",
              "created": 1636676993,
              "upvotes": 4,
              "replies": {}
            },
            "hk9q3im": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9q3im/",
              "text": "I wrote a poem 2 years ago and one of the lines is \"We peaked at 5\" 😂😂",
              "author": "Lazy-Child-013",
              "created": 1636676142,
              "upvotes": 2,
              "replies": {}
            },
            "hkbks13": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkbks13/",
              "text": "I agree. I miss being 3-7. Everything especially went downhill from age 15 and I absolutely hate being 18.",
              "author": "Jman_777",
              "created": 1636716866,
              "upvotes": 1,
              "replies": {}
            },
            "hon0y1i": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hon0y1i/",
              "text": "Nah I was bullied in kindergarten lol...bad times.",
              "author": "bigdickro",
              "created": 1639573281,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hk8wnud": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8wnud/",
          "text": "I struggled with this especially since my college experience has been rather awful. One night my beautiful girlfriend (2020 graduate) was consoling me during a time when this was bothering me deeply and I told her how many people had told me things like the quote above and “These are going to be the best four years of your life.” She simply told me:\n\n **”Only if you’ll let them be.”**\n\nIt rocked me completely and it’s brought me so much peace. Safe to say I’ve been a great deal happier now that I’ve let go of all my expectations that so many people made me believe would certainly become true.",
          "author": "jesuscrikey",
          "created": 1636663119,
          "upvotes": 11,
          "replies": {}
        },
        "hk8xgsk": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8xgsk/",
          "text": "College was fun but I've heard late 20s are it. The hype of the 20s and being able to afford things.",
          "author": "cloroxwipeisforhands",
          "created": 1636663451,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hk6t7v8": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk6t7v8/",
      "text": "I thought college was easy, only to find out it should be included in one of the a thousand ways to die.",
      "author": "custompprs",
      "created": 1636628246,
      "upvotes": 65,
      "replies": {
        "hk8up6w": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8up6w/",
          "text": "I'm the opposite. I thought college was going to be way harder (tbf, I am only a sophmore taking gen-eds still).",
          "author": "wizard680",
          "created": 1636662308,
          "upvotes": 39,
          "replies": {
            "hk9y9kh": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9y9kh/",
              "text": "Yep, I’m graduating next month and that’s what I always tell people, it’s really not that hard. I’ve never been generally smart (cs and bs in high school) and was scared to death of college assuming it would be impossible for me. Fast forward 4 years and I’ve barely studied. Just did my homework, went to class, and minimally tried outside of class and I’m about to graduate with like a 3.7 or something. Obviously some degrees are harder then others (mines cyber security, no idea how easy/hard it is compared to others), but it really wasn’t that bad (except for you calculus, f u).",
              "author": "ThousandFootOcarina",
              "created": 1636679980,
              "upvotes": 12,
              "replies": {
                "hka169w": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka169w/",
                  "text": "I just breezed through high school with no care. I even fail some classes in high school but didnt care. I had like a...21 on the SAT? I forgot lol. Now I'm a sophomore with mostly As in all my classes (if it wasnt for french & summer classes, it would be straight A's).\n\nI do study a lot though. It makes me feel like I'm not wasting my time (like I'm doing now, browsing reddit on my phone and having twitter currently open on laptop...)",
                  "author": "wizard680",
                  "created": 1636681358,
                  "upvotes": 8,
                  "replies": {
                    "hkeivc7": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkeivc7/",
                      "text": "Think you meant the ACT not the SAT lol. The ACT is scored on a scale of 1 to 36 with the average being about a 21. The SAT is scored from 400 to 1600, and scores increment by 10, so a 21 is impossible for multiple reasons.",
                      "author": "UnseenTardigrade",
                      "created": 1636765246,
                      "upvotes": 3,
                      "replies": {
                        "hkeix0j": {
                          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkeix0j/",
                          "text": "I did. I forgot which one was which",
                          "author": "wizard680",
                          "created": 1636765269,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "hkay7si": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkay7si/",
                      "text": "It depends on your major really. A music education major for instance might be taking double your course load for the same amount of credits. People struggle differently. You might just have picked a manageable major (and it seems like you have good habits as a students as well!)\n\n(Source: me, I’m taking 11 classes for 16 credits and I have my non-music major friends are taking 5-6 for 15-16 credits)",
                      "author": "LCHolland82700",
                      "created": 1636698375,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk6xw8g": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk6xw8g/",
      "text": "People don't go to school in pajamas. A lot of people dress up.",
      "author": "Twentynineyearold29",
      "created": 1636631749,
      "upvotes": 129,
      "replies": {
        "hk75g5z": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk75g5z/",
          "text": "was super sad about this one tbh",
          "author": "EdelwoodOil",
          "created": 1636636393,
          "upvotes": 56,
          "replies": {
            "hk8l6uw": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8l6uw/",
              "text": "I did it freshmen year, wearing PJs everyday but this was mostly because my mental health was shit. The only time I wear PJs now is when I have an off day or when I don’t have class.",
              "author": "CapriciousSalmon",
              "created": 1636658397,
              "upvotes": 61,
              "replies": {
                "hk98yis": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk98yis/",
                  "text": "Currently a freshman with shit mental health. What did you do to make yours better?",
                  "author": "polite_demon",
                  "created": 1636668197,
                  "upvotes": 11,
                  "replies": {
                    "hk9dcr3": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9dcr3/",
                      "text": "Honestly, I admitted I wasn’t in the best state of mind and transferred schools. In the short term I really recommend a TV. I didn’t get one until senior year since I always had my phone, but this year I started getting night terrors, to the point of waking up in the middle of the night kicking and screaming and thinking I wasn’t real. So I got a TV and it made a lot of difference since it feels like someone’s there. Plus I get to watch the Chucky show :)",
                      "author": "CapriciousSalmon",
                      "created": 1636670092,
                      "upvotes": 13,
                      "replies": {}
                    },
                    "hka447o": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka447o/",
                      "text": "Heres a few easy things that noticably improved my mental health.\n\n1. Take a shower every day.\n\n2. Keep your living space clean and at least somewhat decorated\n\n3. Begin the day by listing 3 positive experiences you had the day before\n\n4. Go outside and walk as much as you can\n\n5. Take 5 to 10 minutes to do nothing. I literally mean nothing. Clear your mind of all thought and sit in a comfortable area. \n\n\nThese are all things that I've noticed make me function as a human being better. Good luck!",
                      "author": "Usedbyusernames",
                      "created": 1636682720,
                      "upvotes": 8,
                      "replies": {
                        "hkc9e76": {
                          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkc9e76/",
                          "text": "These are really helpful tips, thank you!",
                          "author": "polite_demon",
                          "created": 1636730006,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "hk9qbek": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9qbek/",
                      "text": "Does your tuition include counseling?? I suggest making the most of that if it does. Otherwise I make myself dress up.",
                      "author": "Lazy-Child-013",
                      "created": 1636676247,
                      "upvotes": 4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hk7rrtr": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7rrtr/",
          "text": "I see a mixture of this. Some people (such as myself) dress to the nines experimenting with different styles because they enjoy doing so. Most people dress rather casually, but in a way that feels intentional. Another group dresses for comfort. Pajama pants are rarer, with sweatpants and joggers being more common. I myself haven't gone to class in pajamas, but I have gone to the student center and hung out in the dorm common room in a flannel nightgowns.\n\nETA: a frequently referenced joke is that we look like the \"gays going to brunch\" meme. Oftentimes when getting dinner with a group none of us look like we are going to the same event.",
          "author": "Katherington",
          "created": 1636646701,
          "upvotes": 35,
          "replies": {
            "hk7yab0": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7yab0/",
              "text": "what lol I go with a hoodie and pants lol",
              "author": "mans123373u2",
              "created": 1636649314,
              "upvotes": 1,
              "replies": {}
            },
            "hk8079v": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8079v/",
              "text": "Yea a lot people dress casually but will still try to look ok. Like they’ll make sure their at least matching. Black hoodies black joggers and black slides.",
              "author": "trey_abs",
              "created": 1636650066,
              "upvotes": 1,
              "replies": {
                "hk84igx": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk84igx/",
                  "text": "Honestly black hoodie and black joggers bugs me slightly as the blacks are often slightly different tones. And if they don’t match I almost feel like you should swap one piece out for something in a different color. But I’m likely just eccentric",
                  "author": "Katherington",
                  "created": 1636651782,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk7wcl7": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7wcl7/",
          "text": "I go to a business school and it’s very common for kids to show up in full garb for a presentation. I went to an extra curricular that was university wide, not just the business school and I showed up in the usual business attire. Everyone else was in hoodies and comfy clothes and I felt really out of place lol.",
          "author": "Butthole_seizure",
          "created": 1636648554,
          "upvotes": 1,
          "replies": {
            "hk8l9xk": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8l9xk/",
              "text": "My ex roommate was in the business school and it was a rule she had to come to class in business casual, so that meant high heels, full makeup etc.",
              "author": "CapriciousSalmon",
              "created": 1636658431,
              "upvotes": 15,
              "replies": {}
            }
          }
        },
        "hk7u09n": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7u09n/",
          "text": "Literally went to class in pajamas today lol",
          "author": "DcCash8",
          "created": 1636647620,
          "upvotes": 1,
          "replies": {}
        },
        "hk7nulx": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7nulx/",
          "text": "What? Youve never seen someone in pajamas?",
          "author": "taybay462",
          "created": 1636645018,
          "upvotes": 5,
          "replies": {}
        },
        "hk8k4zt": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8k4zt/",
          "text": "In my experience, this depends on the school and student culture.\n\nI went to undergrad at a smaller liberal arts school in the southeast that had mostly students from New England and the culture was VERY preppy. Lots of Vineyard Vines and Lily Pulitzer. Then I went to grad school at a larger state university in the northeast and most students attended lectures in sweat pants, t shirts, and leggings. \n\nBut at both schools, no one really cared what anyone else wore, even if it wasn’t the “norm,” so wear whatever you feel comfortable and confident in.",
          "author": "aattanasio2014",
          "created": 1636657969,
          "upvotes": 23,
          "replies": {}
        },
        "hk8l3zv": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8l3zv/",
          "text": "I’m a dress up person since I like to wear all black or shop at H&M and hot topic. For me it’s because A) I went to a high school where you had to wear uniforms and B) My family usually makes fun of me for the way I dress. At college I might get stares but nobody will dare say I look ridiculous or silly. In fact some people have complimented me on how I dress.",
          "author": "CapriciousSalmon",
          "created": 1636658365,
          "upvotes": 11,
          "replies": {}
        },
        "hk8p7vh": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8p7vh/",
          "text": "Me sitting in my car getting ready to go teach a lab in my moose pajamas right now...",
          "author": "BooBooKityFuk",
          "created": 1636660058,
          "upvotes": 9,
          "replies": {}
        },
        "hk8xv7n": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8xv7n/",
          "text": "You must be a freshman, by my senior year people were in sweats and t shirts in a 18 person class.",
          "author": "cloroxwipeisforhands",
          "created": 1636663616,
          "upvotes": 7,
          "replies": {}
        },
        "hk92uam": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk92uam/",
          "text": "I’m someone who puts a lot of effort in my appearance. I’m usually the only person in my class to wear a real outfit and/or makeup. Most people at my university just wear frat/sorority shirts and yoga pants or sweats.",
          "author": "AshleyJoy03",
          "created": 1636665651,
          "upvotes": 7,
          "replies": {}
        },
        "hk8uj17": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8uj17/",
          "text": "People at my school goes out in pajamas until at least noon. But going to class, people either wear super casual clothes or dress up like they are going out.",
          "author": "wizard680",
          "created": 1636662237,
          "upvotes": 4,
          "replies": {}
        },
        "hk8q5zq": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8q5zq/",
          "text": "I used to for my morning classes",
          "author": "peepeepoopaccount",
          "created": 1636660446,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hk6t3ql": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk6t3ql/",
      "text": "My college is pretty hard about attendance. 75% is min requirement and students have even been barred from appearing in exams who were on 50ish mark",
      "author": "dopaminedeficiantbuh",
      "created": 1636628153,
      "upvotes": 30,
      "replies": {
        "hk83wux": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk83wux/",
          "text": "In the college I go to 85% is the minimum attendance required.",
          "author": "bigdickro",
          "created": 1636651546,
          "upvotes": 1,
          "replies": {
            "hk8gzip": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8gzip/",
              "text": "wtf",
              "author": "GimmeSomeBreadHomie",
              "created": 1636656696,
              "upvotes": 17,
              "replies": {}
            },
            "hk8igwo": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8igwo/",
              "text": "If that was the case for my school, I would have miserably failed my covid sophomore year.",
              "author": "owlwaves",
              "created": 1636657297,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "hk8msqc": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8msqc/",
          "text": "For mine, most were pretty clear that we are adults and should be able to choose to go to class or not. If we think we know the material then there would be no problem with doing the tests and no reason to go to class. \n\nImo that’s best. People are paying to learn. Let them decide if they actually want to or not. Most should be mature enough to know and those who aren’t will learn.",
          "author": "LPKKiller",
          "created": 1636659060,
          "upvotes": 12,
          "replies": {}
        },
        "hk8lcrj": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8lcrj/",
          "text": "For me this was the only time I didn’t have to attend class since the professor didn’t take attendance.",
          "author": "CapriciousSalmon",
          "created": 1636658465,
          "upvotes": 1,
          "replies": {}
        },
        "hlvqrte": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hlvqrte/",
          "text": "I'm so fucked, 25% attendance but I submitted all assignments on time and now it seems like I've been barred from taking exams. Fk me.",
          "author": "polmeeee",
          "created": 1637744985,
          "upvotes": 1,
          "replies": {
            "hlvs8pj": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hlvs8pj/",
              "text": "I wasnt ever in 25% line but I had pretty shitty first year attendance wise and was almost even barred from taking my electrical. Try talking to your prof. She was the one who convinced the department director for me.",
              "author": null,
              "created": 1637746255,
              "upvotes": 1,
              "replies": {
                "hlvy5dn": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hlvy5dn/",
                  "text": "Thanks. I'm gonna do that tomorrow. My email and call to my school administration went unanswered today. For what's it worth it's only this module that I got 25%.",
                  "author": "polmeeee",
                  "created": 1637751156,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk7j7ee": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7j7ee/",
      "text": "I quickly learned that my teachers can’t always be trusted to know what’s best for me. Even when you have a good, long-term relationship with a professor/advisor, you know yourself better than anyone.",
      "author": "honeypumpkinseed",
      "created": 1636642981,
      "upvotes": 8,
      "replies": {
        "hkamd8x": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkamd8x/",
          "text": "They're just adults trying to figure out their own life too. I most definitely would say advisors are often hit or miss, but often more the later if you rely on them too much in deciding your academic plan. \n\nWhen you consider that you only meet them for like 15 minutes and they figure out what classes to take there's a high chance they will make a mistake not knowing the full picture and like you said it's best to figure it out yourself, but take their advice into consideration.",
          "author": "HugeRichard11",
          "created": 1636691354,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hk7i9oe": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7i9oe/",
      "text": "Partying.  \n\n&#x200B;\n\nDont get me wrong, its fun and I've done my fair share of it in my 4 years.  Joined greek life, went out 3-4 times a week in my first 2 years, had my one night stands and blackouts.  \n\nI wanna say that for the most part, social media accounts like barstoolu, imschmacked and totalfratmove greatly exaggerate how crazy things get and how wild these parties are.  It does happen, but not nearly as often as you think, and when it does happen you kinda just see right through it.  \n\nI've seen the \"crazy shit\" that you see on these accounts, and most of it is completely idiotic, forced behavior for clout that no one would be partaking in if there werent cameras being shoved in their face.  \n\nAnnoying freshman girls screaming the lyrics to UCLA in your ear, drinking lukewarm natty lights and $10 bottles of vodka, and developing a mild nicotine addiction is not something that is amazing and exciting for all four years. \n\nI honestly dont know what I would've done with myself if i went to a top party school.  I love going to a city school where theres plenty of things to do besides get blackout drunk on a Wednesday night.  My brother goes to a party school and based on what he tells me hes up to, hes in for a rude awakening post-college.",
      "author": "Nostizxamus",
      "created": 1636642555,
      "upvotes": 36,
      "replies": {
        "hk848k4": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk848k4/",
          "text": "I go to a tiny school in a rural/suburb area. There’s literally nothing to do here except “party” and get drunk lmao",
          "author": "Fubb1",
          "created": 1636651672,
          "upvotes": 1,
          "replies": {
            "hk9ntav": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9ntav/",
              "text": "is your college in Minnesota by any chance? this sounds exactly like my college 💀",
              "author": "InconsistentToaster",
              "created": 1636675016,
              "upvotes": 2,
              "replies": {
                "hk9oe1r": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9oe1r/",
                  "text": "No I go to school in Maine, so almost the right M state haha. Do you go to macalaster?",
                  "author": "Fubb1",
                  "created": 1636675307,
                  "upvotes": 3,
                  "replies": {
                    "hka7t54": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka7t54/",
                      "text": "Macalaster is in the Twin Cities. I imagine there is plenty more to do than drink in the Twin Cities.",
                      "author": "DueYogurt9",
                      "created": 1636684405,
                      "upvotes": 2,
                      "replies": {}
                    },
                    "hkaaea6": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaaea6/",
                      "text": "Ah I see, I’m in a more rural area of MN",
                      "author": "InconsistentToaster",
                      "created": 1636685586,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "hk9z5ew": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9z5ew/",
                  "text": "I mean there are hundreds of colleges like that across the country homie",
                  "author": "charlesdickinsideme",
                  "created": 1636680397,
                  "upvotes": 1,
                  "replies": {
                    "hkaah4e": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaah4e/",
                      "text": "Yee just figured I’d ask",
                      "author": "InconsistentToaster",
                      "created": 1636685622,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hk7rx4g": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7rx4g/",
          "text": "there's been way less partying at my school than i thought. in fact some of it has been pretty lame. so far ive only been to one great party and the rest were just eh",
          "author": "OswaldNovember",
          "created": 1636646762,
          "upvotes": 1,
          "replies": {}
        },
        "hk89yfe": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk89yfe/",
          "text": "Ur sch seemed to be lively as shit, what sch is it ? Bruh u guy r getting ons, that's unheard of in many schools irl. Dam",
          "author": "Klutzy_Atmosphere848",
          "created": 1636653893,
          "upvotes": 1,
          "replies": {}
        },
        "hk8i6gf": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8i6gf/",
          "text": "I go to a party school and kinda dislike it. Its in a more rural area so there's nothing to do besides party. I think that might be why I haven't made many friends in college. I usually drive to NYC on the weekends and hang out with my high school friends.",
          "author": "PastramiReubens",
          "created": 1636657179,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hk7owl9": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7owl9/",
      "text": "The biggest misconception? That it'll actually prepare you for a job. That's what internships and trade school are for. College helps you *get* a job, but won't necessarily prepare you for it.\n\nAttendance would probably be the second biggest misconception. I've noticed that in most courses, the higher the course rank, the less profs care about your attendance. It becomes even less important with more and more profs posting their slides online.",
      "author": "enriqueg9031",
      "created": 1636645474,
      "upvotes": 27,
      "replies": {
        "hkek6uq": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkek6uq/",
          "text": "Attendance might be more important than you realize, even if it isn’t graded. Obviously if it’s a class of like 200 or more people and everything is posted online then it’s not important. But in smaller classes having your professor at least know who you are can be useful for a few reasons. First of all, they’re going to be a lot more willing to help you out in office hours if you’re someone who attends class and actively participates than they’ll care much about someone who never attends. It depends on the professor, but you also might be more likely to get an extension on an assignment if you really need it and the professor actually knows you because you go to class. You also want professors to be familiar with you if you’re seeking letters of recommendation or research opportunities or anything like that.",
          "author": "UnseenTardigrade",
          "created": 1636765896,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hk7rpqj": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7rpqj/",
      "text": "My professors make attendance part of our grade :/",
      "author": "edgar_torres55",
      "created": 1636646676,
      "upvotes": 4,
      "replies": {
        "hka9c7o": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka9c7o/",
          "text": "I have a professor this semester who does this and I do NOT understand it. I am a 27 year old woman working and going to college. I’m not a child needing to be monitored to make sure I get to school on time. 🙄",
          "author": "mnbell2013",
          "created": 1636685105,
          "upvotes": 35,
          "replies": {
            "hkasgew": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkasgew/",
              "text": "yeah it’s honestly weird. the only class i have that grades attendance is a language class because the you have to be there participating to receive a grade. but like otherwise? it should be totally your prerogative.",
              "author": "bienvenidos-a-chilis",
              "created": 1636694702,
              "upvotes": 7,
              "replies": {}
            },
            "hkanjg9": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkanjg9/",
              "text": "Fr, and even apart from that. Its not like its free for us, we are literally paying them, i feel like we should be able to take a break whenever needed",
              "author": "edgar_torres55",
              "created": 1636691961,
              "upvotes": 11,
              "replies": {}
            },
            "hkb2i3u": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb2i3u/",
              "text": "It seems like it’s better in upper level classes. I’m much happier being able to watch the recordings on my own time.",
              "author": "big-b20000",
              "created": 1636701510,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hk9llv9": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9llv9/",
          "text": "Most of my teachers do this. If I have more than two unexcused absences then its a letter grade off of my final grade for each day I miss.",
          "author": "F1nRay",
          "created": 1636673809,
          "upvotes": 33,
          "replies": {}
        },
        "hk9ep4v": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9ep4v/",
          "text": "I had a few who did",
          "author": "TheMcWhopper",
          "created": 1636670671,
          "upvotes": 7,
          "replies": {}
        },
        "hk9rmhv": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9rmhv/",
          "text": "Easy points in my opinion. I hate when classes just have quizzes and exams for grades",
          "author": "Calamity_Carrot",
          "created": 1636676867,
          "upvotes": 15,
          "replies": {
            "hkah36f": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkah36f/",
              "text": "some classes I don’t learn anything so my times better spent at office hours than in class",
              "author": "BadMost9088",
              "created": 1636688771,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hk83ggl": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk83ggl/",
      "text": "That I will get to make friends in college, it has passed almost 1.5 years, I have just been in the school 3 times (I joined in summer 2020)",
      "author": "sss3bastiannn",
      "created": 1636651366,
      "upvotes": 1,
      "replies": {
        "hk8imle": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8imle/",
          "text": "Honestly, yeah. I've made almost no friends in college. Its kinda hard, especially if you're not very extroverted.\n\nI've probably become closer to all my high school friends because of college, even though we're all attending different schools miles apart.",
          "author": "PastramiReubens",
          "created": 1636657360,
          "upvotes": 33,
          "replies": {}
        }
      }
    },
    "hk84m11": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk84m11/",
      "text": "A lot of media depicts college as a place where you meet up with people and do things for a majority of your days. \n\nTrue reality is while you do meet with people from time to time, there will always be many activities or studying sessions or assignments you just have to do yourself all alone. Most media like tv shows or movies often skip those parts because they're boring, so people often think they need to be hanging out with people to get things done or feel like they're progressing.",
      "author": "HugeRichard11",
      "created": 1636651821,
      "upvotes": 1,
      "replies": {
        "hk8ovv1": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8ovv1/",
          "text": "I wonder if this is why the lofi hip hop girl became such a meme, because we all relate to her. Just sitting down, working alone, with some earbuds in. That's been most of my college experience so far tbh",
          "author": "VividOperation48",
          "created": 1636659921,
          "upvotes": 89,
          "replies": {}
        },
        "hk8jvys": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8jvys/",
          "text": "Just wondering, why is your profile pic the costco logo?",
          "author": "adimaria",
          "created": 1636657867,
          "upvotes": 61,
          "replies": {
            "hk8m12g": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8m12g/",
              "text": "I like Costco. There’s no real deeper meaning",
              "author": "HugeRichard11",
              "created": 1636658742,
              "upvotes": 156,
              "replies": {
                "hk8un2b": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8un2b/",
                  "text": "Hey Costco is pretty dope",
                  "author": "tacothetacotaco",
                  "created": 1636662283,
                  "upvotes": 25,
                  "replies": {}
                }
              }
            }
          }
        },
        "hkb2f1d": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb2f1d/",
          "text": "I feel like it also depends on if you have a good study group and friends in your major. I will either plan to meet up with friends in my classes or hang out in my major’s lounge and work with whoever happens to be there that I know almost every day. Yes there is a little bit alone but the majority of my time is spent working or hanging out with people.",
          "author": "big-b20000",
          "created": 1636701445,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk7n8lc": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7n8lc/",
      "text": "It's the right option for you and any degree is a good choice.",
      "author": "darniforgotmypwd",
      "created": 1636644756,
      "upvotes": 14,
      "replies": {}
    },
    "hk83411": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk83411/",
      "text": "How wild it is with parties and what not. I think it’s school dependent and I go out every weekend but the amount of “raging parties” I’ve been to in the past 2.5 years is maybe 1 or two and even then it was mainly people just on their phone lol",
      "author": "fredjohnny23",
      "created": 1636651229,
      "upvotes": 1,
      "replies": {}
    },
    "hk7u0qu": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7u0qu/",
      "text": "That if you’re a woman and Hispanic you’re going to automatically get so many scholarships that you won’t have to pay for school and college debt isn’t that big of a deal.",
      "author": "Aqua7KH",
      "created": 1636647625,
      "upvotes": 1,
      "replies": {
        "hk8fbh4": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8fbh4/",
          "text": "I’m a man but I second this",
          "author": "mmoran690",
          "created": 1636656032,
          "upvotes": 6,
          "replies": {}
        },
        "hk9ng8r": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9ng8r/",
          "text": "White people act like its so easy to get race based scholarships. They're always shocked when they hear how hard I tried to get ANY for my experience of being POC and turned up with absolutely nothing. I got one check of $300 for years of effort.",
          "author": "Zap_Apple",
          "created": 1636674822,
          "upvotes": 8,
          "replies": {
            "hkep01y": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkep01y/",
              "text": "And then when you can’t get any scholarships they say it’s your fault bc you haven’t tried hard enough",
              "author": "Aqua7KH",
              "created": 1636768285,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hk94cal": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk94cal/",
          "text": "im asian and ive qualified for hispanic scholarships lol",
          "author": "Powerful-Asian13",
          "created": 1636666274,
          "upvotes": 3,
          "replies": {
            "hk9h30t": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9h30t/",
              "text": "How?",
              "author": "NoDryHands",
              "created": 1636671724,
              "upvotes": 2,
              "replies": {
                "hk9v7lj": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9v7lj/",
                  "text": "He believed in himself",
                  "author": "Absolute_Authority",
                  "created": 1636678541,
                  "upvotes": 9,
                  "replies": {}
                },
                "hkar5vq": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkar5vq/",
                  "text": "I don’t even know and I didn’t apply for them anyway",
                  "author": "Powerful-Asian13",
                  "created": 1636693951,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk7x8jz": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7x8jz/",
      "text": "If you don’t have experience or work a job while in college, you’re at a disadvantage to those that do. Working through college gives you more resume material to work with, promotions to leverage, and just general experience in the working world.",
      "author": "Butthole_seizure",
      "created": 1636648901,
      "upvotes": 1,
      "replies": {}
    },
    "hk7zhs2": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk7zhs2/",
      "text": "Thinking that college is for everyone",
      "author": "Necessary-Bite6614",
      "created": 1636649787,
      "upvotes": 1,
      "replies": {
        "hkp6wmt": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp6wmt/",
          "text": "Ofc it's not. I never really understood this stigma, since I came from a community that doesn't put much emphasis on education (It is just expected to have an hs diploma or GED), a high school that is open minded to trade school or community college for a trade or training. College is for those whose careers require it (nursing or engineering, for example) or would benefit (compsci, not required but could be beneficial) from it. NOT FOR STUDYING GENDER STUDIES OR AFRICAN-AMERICAN STUDIES AT $1200 A CREDIT! Did you flunk out?",
          "author": "Papaadumbass",
          "created": 1636965848,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk86lem": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk86lem/",
      "text": "I thought it would be a great fun but now I feel school was better.",
      "author": "Priyanshi_Rawat",
      "created": 1636652593,
      "upvotes": 1,
      "replies": {}
    },
    "hk87bfu": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk87bfu/",
      "text": "I’m a junior and have yet to be invited to a party",
      "author": "taysway1989",
      "created": 1636652872,
      "upvotes": 1,
      "replies": {
        "hkrlve7": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkrlve7/",
          "text": "you need to just go. I'm a freshmen at a very small school, and I've been to about 4-5 parties, none of which I was formally invited to. I either went by myself or with some other people(who weren't even friends), and tried to have a good time. unless its a frat that isn't open invite, anything is fair game",
          "author": "Jumpy-Ad6630",
          "created": 1637009629,
          "upvotes": 1,
          "replies": {
            "hksqm3d": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hksqm3d/",
              "text": "I don’t even hear about them",
              "author": "taysway1989",
              "created": 1637026872,
              "upvotes": 1,
              "replies": {
                "hkv58hm": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkv58hm/",
                  "text": "Bro just walk around on Friday and Saturday nights and go wherever people are walking. And if nothing else works, just ask someone in one of your classes if anything is happening that day. If you’re expecting someone to come up to you without invitation and invite you personally to a party, you’ll be waiting for a long  time",
                  "author": "Jumpy-Ad6630",
                  "created": 1637077654,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk87f9a": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk87f9a/",
      "text": "that it’s fun, a great place to meet people, and affordable if you graduated at the top of your class in high school. lieeessss. college is stress, micromanaging every minute of the day, and having an unhealthy relationship with food and sleep.",
      "author": "TheMadly1",
      "created": 1636652912,
      "upvotes": 1,
      "replies": {
        "hk9q3gr": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9q3gr/",
          "text": "right? honestly the fact that so many people find college so difficult and that so many people are mentally and physically fucked up as a result is scary.",
          "author": "ningenshikkakuu",
          "created": 1636676141,
          "upvotes": 14,
          "replies": {}
        },
        "hkekt3a": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkekt3a/",
          "text": "About the affordable thing, that actually can be true. I did well in high school and scored very well on the ACT, and because of that I got offered a great scholarship to a pretty decent public university.",
          "author": "UnseenTardigrade",
          "created": 1636766205,
          "upvotes": 1,
          "replies": {
            "hkeqw2b": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkeqw2b/",
              "text": "i graduated with a 4.599 GPA and after loans, i still have a remaining balance. Also went in state.",
              "author": "TheMadly1",
              "created": 1636769209,
              "upvotes": 1,
              "replies": {
                "hkfojjp": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkfojjp/",
                  "text": "Different schools give different levels of merit scholarships. I got pretty lucky with mine. It covers all my current expenses. The year after I got offered it, they reduced the value for new students significantly. If I had graduated high school just a year later, I’d be receiving tens of thousands of dollars less over the course of 4 years. \n\nIt’s unfortunate you weren’t able to get a better scholarship. Just out of curiosity, what was your ACT or SAT score? Obviously you don’t need to tell me if you don’t want to, I’d understand.",
                  "author": "UnseenTardigrade",
                  "created": 1636789631,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk87gen": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk87gen/",
      "text": "That it's easy to make friends in college\n\nAfter the first couple of days/weeks, most people will have formed their own cliques. After that it becomes very difficult to become close to people. Even during that time, people will be cliquey.",
      "author": "RadiantHC",
      "created": 1636652924,
      "upvotes": 1,
      "replies": {
        "hk9j5n5": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9j5n5/",
          "text": "It's sad, I've actually never felt closer to the friends from my hometown than I do now ;(",
          "author": "baeCITY89",
          "created": 1636672657,
          "upvotes": 10,
          "replies": {}
        }
      }
    },
    "hk89m7k": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk89m7k/",
      "text": "For me I'd say that going to college means inherently living on campus. I mean its an option if you don't have nearby housing. But \"college life\" isn't necessarily living in a dorm.",
      "author": "PurpletoasterIII",
      "created": 1636653760,
      "upvotes": 1,
      "replies": {}
    },
    "hk8a6lr": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8a6lr/",
      "text": "That people would grow up ig",
      "author": "DrakeIsMyDada",
      "created": 1636653982,
      "upvotes": 1,
      "replies": {}
    },
    "hk8bjpz": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8bjpz/",
      "text": "You’ll graduate in 2-4 years. \n\nSome people either can’t afford it, decide to change their major, have personal issues, etc. Life just happens.",
      "author": "FMG_99",
      "created": 1636654529,
      "upvotes": 1,
      "replies": {
        "hk8q2d3": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8q2d3/",
          "text": "I’m currently in my third year of community college and about to graduate after 5 semesters instead of 4, and transfer next fall as a 21 year old junior. Many people actually consider my getting through fast. I know people at my college who took 3 1/2-4 years to transfer and they did very well in school because they took their time.",
          "author": "peepeepoopaccount",
          "created": 1636660405,
          "upvotes": 101,
          "replies": {
            "hka4j7x": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka4j7x/",
              "text": "This is me. Finally graduating this spring",
              "author": "lolosunshineco",
              "created": 1636682910,
              "upvotes": 13,
              "replies": {}
            },
            "hkahcxp": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkahcxp/",
              "text": "Yeah I’m in a similar situation, 3 years a community college and I’m in the middle of 3 years at Uni. 6 years to finish an electrical engineering degree, but I’ve heard it’s not common to finish that degree in 4 years anyway.",
              "author": "way_pats",
              "created": 1636688897,
              "upvotes": 8,
              "replies": {
                "hkaq7pf": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaq7pf/",
                  "text": "Way to go!",
                  "author": "Jellobeatshollaatme",
                  "created": 1636693402,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hk8lhoz": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8lhoz/",
          "text": "Tbh this is more true. To me, 5 years is the new average. For me I had to transfer schools after a year and then I switched majors so it’s gonna take me 4 1/2 years to get my bachelors.",
          "author": "CapriciousSalmon",
          "created": 1636658520,
          "upvotes": 77,
          "replies": {}
        },
        "hk980ff": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk980ff/",
          "text": "Man, I started taking classes and realized that the college I'm at doesn't have 10% of the classes I need to get into the program I want at the college I want to transfer to. So now I have to transfer to another college, take 3 classes(2 semesters because one is a prerequisite -\\_-) and then finally hope I retained some of the other info I learned before I transfer to my main college.",
          "author": "1astr3qu3s7",
          "created": 1636667795,
          "upvotes": 13,
          "replies": {}
        },
        "hk9dxac": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9dxac/",
          "text": "Did it in 2. God bless AP I wouldn’t have been able to afford to graduate without shoving myself down a deep hole of loans lol",
          "author": "YaBoiSebbyG",
          "created": 1636670342,
          "upvotes": 9,
          "replies": {
            "hk9gtyj": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9gtyj/",
              "text": "I did it in 3 but now I'm in grad school lol",
              "author": "wolfy321",
              "created": 1636671612,
              "upvotes": 4,
              "replies": {
                "hk9minw": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9minw/",
                  "text": "Yeah I’m working on getting to grad school right now lol life‘s crazy I didn’t think I would be here at this point right now",
                  "author": "YaBoiSebbyG",
                  "created": 1636674238,
                  "upvotes": 4,
                  "replies": {
                    "hk9opkb": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9opkb/",
                      "text": "Wishing you all the best in your application process. It's a weird time lol",
                      "author": "wolfy321",
                      "created": 1636675466,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hk93y3e": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk93y3e/",
          "text": ">Life just happens\n\nI like that",
          "author": "callmebymyname21",
          "created": 1636666107,
          "upvotes": 13,
          "replies": {}
        },
        "hk9ckty": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9ckty/",
          "text": "THIS. This is part of the soap box that I go on! It's definitely possible for people to graduate in 2-4 years, but for the vast majority of college students, you're spending more than that time in school for one reason or another!",
          "author": "beachylawgirl22",
          "created": 1636669750,
          "upvotes": 3,
          "replies": {}
        },
        "hkawtmv": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkawtmv/",
          "text": "Yeah. I was suppose to finish back 2018, but life happened and now I won’t be graduating until Spring 2023.",
          "author": "DumbHuman53",
          "created": 1636697422,
          "upvotes": 1,
          "replies": {}
        },
        "hkb0mix": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb0mix/",
          "text": "I thought I’d graduate on time too. COVID really screwed me over with my grades, as well as my grandmother passing in the middle of my second year semester. I had to drop multiple courses because it was just too much to keep up with. I’m in my “third year” and haven’t even taken a 3rd year level course. I have a feeling it is going to take me an extra year to graduate, and this makes me feel better about taking longer to do it! I thought everyone usually graduated on time.",
          "author": "steamynoodlebap",
          "created": 1636700084,
          "upvotes": 1,
          "replies": {}
        },
        "hkb8eot": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb8eot/",
          "text": "This!",
          "author": "awakenedblossom",
          "created": 1636706301,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk8j9f1": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8j9f1/",
      "text": "I'm in computer science, and one thing I've noticed is that no one seems to have any idea what they're doing. I've been bullshitting my way through University, and even the people I know who have good grades just scrape by. \n\nMy social life is also different from the pop culture ideal. I've not been to a single party, but despite that my social life has been pretty great. I invited 12 of my friends to my house a few weeks ago and it was a great time. Hell, my parents were home the whole time, which I don't think you'll see in any college movie.",
      "author": "Frostybros",
      "created": 1636657611,
      "upvotes": 169,
      "replies": {
        "hk92378": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk92378/",
          "text": "Computer Science is arguably the field most affected by imposter syndrome.\n\n99% of us have it.",
          "author": "psilvs",
          "created": 1636665341,
          "upvotes": 78,
          "replies": {
            "hk9vspa": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9vspa/",
              "text": "From my time in music, everyone feels that way as well.",
              "author": "EmployingBeef2",
              "created": 1636678816,
              "upvotes": 11,
              "replies": {
                "hkaxhco": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaxhco/",
                  "text": "Honestly, I agree. I’m in a college with an amazing music program and completely filled with music majors, and boy do I constantly suffer from imposter syndrome.\n\nI also have many friends whom I know go to practice rooms and end up crying because they feel they don’t deserve to be in the school. It’s a different experience to be judged on. Not necessarily to a higher or lower degree than other majors, it’s just different.",
                  "author": "LCHolland82700",
                  "created": 1636697862,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "hkaca29": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaca29/",
              "text": "And if you're a woman, that's turned up a notch lol.",
              "author": "DrakeIsMyDada",
              "created": 1636686486,
              "upvotes": 10,
              "replies": {}
            },
            "hor4t0d": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hor4t0d/",
              "text": "Even Jeff Bezos probably feels like an imposter when AWS keeps going down.",
              "author": "WaddleD",
              "created": 1639638629,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hkbddkh": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkbddkh/",
          "text": "Had a test this week on a topic no one in class knows bc we didn't learn it. We made the teacher aware of it and he said he thought we were taught this the year before. His only response to the class not knowing what the heck is going in on was \"well, you're expected to know this\". I didn't fail the test but had a pretty low grade :/",
          "author": "jellyfish_bloom",
          "created": 1636710747,
          "upvotes": 3,
          "replies": {}
        },
        "hkawviy": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkawviy/",
          "text": ">no one seems to have any idea what they're doing. I've been bullshitting my way through University, and even the people I know who have good grades just scrape by. \n\n\nThis is so true 😂",
          "author": "Proof_Victory",
          "created": 1636697457,
          "upvotes": 2,
          "replies": {}
        },
        "hkc1746": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkc1746/",
          "text": "Changing my computer science degree to become a teacher, was all A's in both electrical engineering and computer science when i did two semesters each but feel like I didn't know much.\n\nI would turn in assignments that I was stressing over so hard, thinking I'm going to get a C and I get 100%. My final for my database class with AWS, I got 100% and I legit thought it was gonna be a LOW B at best.\n\nIt's weird.",
          "author": "Alphabet_Beans",
          "created": 1636726329,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk8nxa4": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8nxa4/",
      "text": "Always thought college was a place full of real mature people. Currently a sophomore and the second week of dorming someone shat on the sink….",
      "author": "Akashi2002",
      "created": 1636659524,
      "upvotes": 84,
      "replies": {
        "hk9qvm5": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9qvm5/",
          "text": "Our shower head is broken and my neighbors have 5+ loud guests every night... Sometimes they don't even stay in the room I've heard them running through the halls at 2am.",
          "author": "Lazy-Child-013",
          "created": 1636676512,
          "upvotes": 19,
          "replies": {
            "hk9s4ew": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9s4ew/",
              "text": "On the shower head, could you put in a work order?",
              "author": "og_usrnme",
              "created": 1636677103,
              "upvotes": 3,
              "replies": {
                "hkaa73j": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaa73j/",
                  "text": "I think someone already has (it's a community bathroom) but apparently it'll take a while.",
                  "author": "Lazy-Child-013",
                  "created": 1636685490,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hka6dqa": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka6dqa/",
          "text": "I feel for this one. I was tired of how immature most people were at my high school and thought college would be the escape from that. Turned out that most people in college were even worse.",
          "author": "GUlysses",
          "created": 1636683754,
          "upvotes": 9,
          "replies": {}
        },
        "hkajfn8": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkajfn8/",
          "text": "Honestly. I thought I was going to be rooming with adults, but someone recently obliterated a toilet a lot of us share with their Hershey squirts or vomit, so gross.",
          "author": "KathleenGVeltkamp",
          "created": 1636689889,
          "upvotes": 3,
          "replies": {
            "hkaxx57": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaxx57/",
              "text": "At least no one puked on your elevator doors",
              "author": "LCHolland82700",
              "created": 1636698168,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hkaxux1": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaxux1/",
          "text": "RA here with a bunch of freshman residents. Someone stole our bathtub’s faucet thing right out of the wall. We are also having troubles with people racing up and down the halls at 2am (completely freaking sober, might I add. Well, probably). We also have a resident who likes to spread shit on the walls. And also a resident who likes to expose himself to people passing by his window.\n\nAdults are no more mature than children most of the time. We just have more financial obligations and responsibilities typically.",
          "author": "LCHolland82700",
          "created": 1636698125,
          "upvotes": 1,
          "replies": {}
        },
        "hkb7d7k": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb7d7k/",
          "text": "This is the big one for me. I’m sorry but most of my peers give zero fucks about school at all, and my roommate and her friends act like 12 year olds most of the time, drawing dicks and swastikas, up playing  video games all night and SCREAMING at each other. Like I’ve not even seen wild parties or a lot of gross shit, they just act much more childish than I expected.",
          "author": "Puar96",
          "created": 1636705411,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk900rp": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk900rp/",
      "text": "That mid terms arent SOLELY in the middle of the semesters but are SPRINKLED THROUGHOUT THE ENTIRE SEMESTER.",
      "author": "ventblockfox",
      "created": 1636664503,
      "upvotes": 64,
      "replies": {
        "hk9mykk": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9mykk/",
          "text": "Once midterms start, it doesn't end until finals.",
          "author": "PoofyScissors",
          "created": 1636674483,
          "upvotes": 25,
          "replies": {
            "hk9nnzf": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9nnzf/",
              "text": "Yeah im on my last two mid terms until finals next week and the week directly coming back from our thanksgiving break.",
              "author": "ventblockfox",
              "created": 1636674939,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hk8kv5v": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8kv5v/",
      "text": "That Id be able to learn stuff in depth. I’m living deadline to deadline and only realistically have time to learn test material.",
      "author": "notanamateur",
      "created": 1636658266,
      "upvotes": 51,
      "replies": {
        "hkaxw0m": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaxw0m/",
          "text": "This :')",
          "author": "Proof_Victory",
          "created": 1636698146,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk8c8uv": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8c8uv/",
      "text": "How horrible it is to work and go to school and the united states demands you do both.",
      "author": "DrearyCake24",
      "created": 1636654808,
      "upvotes": 94,
      "replies": {
        "hk8ffht": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8ffht/",
          "text": "I was really shocked to find out kids work less now than in decades past. I guess we perceive it as more of a public problem now, burnout. \n\nStill, I frequently see people drowning. And I feel privileged to have the opportunity to do a group assignment by myself. I even try to at least get some feedback from every partner so I can put their name on it.  Even though I'm a good student, I really just don't want to be like those vindictive, vain partners that seem to lead every failed group.  So spitefully, I go for being the opposite of them. Lol.",
          "author": "Sniffalisp",
          "created": 1636656077,
          "upvotes": 24,
          "replies": {
            "hk8v5vj": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8v5vj/",
              "text": "I believe the reason people work less now is that the stress/benefit weighs more on the stress side than decades before. People are making the less money for the price of goods. So naturally, some people don't like the opportunity costs and choose to not work.",
              "author": "wizard680",
              "created": 1636662501,
              "upvotes": 11,
              "replies": {}
            },
            "hk95x2s": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk95x2s/",
              "text": ">I was really shocked to find out kids work less now than in decades past.\n\nBecause it has been increasingly more and more difficult to just put yourself through school by working yourself, so why put yourself through all the stress of working, still going into debt, and doing school, when you can just take out more loans to focus on school and deal with the debt issue when you can actually make more than minimum wage?",
              "author": "Comrade_Corgo",
              "created": 1636666928,
              "upvotes": 7,
              "replies": {}
            }
          }
        }
      }
    },
    "hk8skg6": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8skg6/",
      "text": "That academic advisors would help you narrow down a career passion or just help you take the right classes. They might as well not exist at my school.",
      "author": "a-tad-dude-guy",
      "created": 1636661428,
      "upvotes": 32,
      "replies": {}
    },
    "hk8gv5p": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8gv5p/",
      "text": "Just because I live with someone, doesnt mean they have to be in my company all the time.",
      "author": "Marsrule",
      "created": 1636656648,
      "upvotes": 18,
      "replies": {}
    },
    "hk8kpdq": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8kpdq/",
      "text": "I thought I would make friends. Everyone told me how easy it was to make friends in college. I haven't made a single one so far. And I also have no friends from high school so I'm just...alone.",
      "author": "tacothetacotaco",
      "created": 1636658201,
      "upvotes": 45,
      "replies": {
        "hk8uzki": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8uzki/",
          "text": "I'm in the same boat and it really sucks. Especially seeing some of my other high school friends making new friends and joining new friend groups while I'm just here, scared that they're gonna forget me and move on. Also these past 3 months have probably been the worst months of my entire life.",
          "author": "Dankiie",
          "created": 1636662428,
          "upvotes": 13,
          "replies": {}
        },
        "hkabz48": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkabz48/",
          "text": "Do you have online friends? That really helps. I mean, it still sucks obviously but you'll feel less alone.",
          "author": "DrakeIsMyDada",
          "created": 1636686343,
          "upvotes": 3,
          "replies": {
            "hkagmuz": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkagmuz/",
              "text": "Yeah, I have some online friends and acquaintances and they're the only ones keeping me together at this point, and keeping me from being completely isolated. I've known most of them since high school and they're great. One of them that I've known for 5+ years actually happens to go to my college and we're trying to find the right time to meet in person so that's something.",
              "author": "tacothetacotaco",
              "created": 1636688555,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hkac71g": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkac71g/",
          "text": "I feel this way, I see other people alone but I just assume they want to be. And all the friends I make in class are just for class",
          "author": "fyrefreezer01",
          "created": 1636686446,
          "upvotes": 3,
          "replies": {
            "hkah0mr": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkah0mr/",
              "text": "Yeah, I assume the same thing and I feel like other people assume it about me as well. I've never had a class friend that I spoke to after the class ended or hung out with outside of doing class work. I'm going to start trying to make org friends; I feel like I might have better luck with that.",
              "author": "tacothetacotaco",
              "created": 1636688736,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "hkagtso": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkagtso/",
          "text": "this is lowkey what im afraid of... that i'll get to college and just not have friends and it'll be the same as highschool",
          "author": "tiredextras",
          "created": 1636688648,
          "upvotes": 2,
          "replies": {}
        },
        "hkamdp1": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkamdp1/",
          "text": "Yeah same, I moved far for college (basically across the country) with nobody else from my high school, and I am terrible at keeping in contact with people so I don’t really have any friends that I talk to regularly other than a few of by brothers friends that thankfully kept trying to include me in hang outs",
          "author": "cathy1914",
          "created": 1636691360,
          "upvotes": 2,
          "replies": {}
        },
        "hkayil9": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkayil9/",
          "text": "I’m sure you’re told this a lot, but have you tried going to events and getting involved with clubs on campus? That’s really where you’ll make your friends if you had no luck in the res halls. \n\nIt’s important to connect with people with whom you share mutual interests because that’s one of the easiest ways to form bonds.",
          "author": "LCHolland82700",
          "created": 1636698585,
          "upvotes": 1,
          "replies": {
            "hkijops": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkijops/",
              "text": "Yeah, I've tried clubs but it seems like most people there are already friends or come with their friends. They'll say hi to you and make small talk but it never goes beyond that. I'm going to try some different clubs next semester to see if I can find people I actually click with.",
              "author": "tacothetacotaco",
              "created": 1636844951,
              "upvotes": 1,
              "replies": {
                "hkj5hnv": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkj5hnv/",
                  "text": "Sometimes you have to take the initiative to schedule times to hang out at first.",
                  "author": "LCHolland82700",
                  "created": 1636854594,
                  "upvotes": 1,
                  "replies": {}
                },
                "hkj5m9f": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkj5m9f/",
                  "text": "OH! And try asking them about themselves and what they like to do. That’s the easiest way to make people like you that I’ve found, by getting them to talk about themselves",
                  "author": "LCHolland82700",
                  "created": 1636854651,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk8vut8": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8vut8/",
      "text": "That you must be extremely sleep deprived and overworked to get the “true college experience.” In my opinion, this does not have to be the case and it is actually a super harmful mentality that many students take on once in college.",
      "author": "kubrickfanclub_",
      "created": 1636662788,
      "upvotes": 14,
      "replies": {}
    },
    "hk99tns": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk99tns/",
      "text": "That it would be fun. I’m the most miserable I’ve ever been in my life.",
      "author": "melancholy-corgi",
      "created": 1636668567,
      "upvotes": 14,
      "replies": {}
    },
    "hk8l8nf": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8l8nf/",
      "text": "College is a big waste of time and money. Degrees aren't required to be successful in life. In fact, I feel like shredding my degree because that's how far it got me.",
      "author": "ladykat9876",
      "created": 1636658417,
      "upvotes": 12,
      "replies": {
        "hkp5hkv": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp5hkv/",
          "text": ">College is a big waste of time and money\n\nI wouldn't think so if you were an accounting, electrical engineering, nursing, education, medicine, etc or any other major that is required by regulation. Not to mention, there are many benefits to going to college. I would recommended it if your ideal career requires it and you can do it without debt.\n\n>Degrees aren't required to be successful in life.\n\nOf course not, you only need them if you want a career that requires it for the job or the licensure to get said job.  Fortunately, many people are realizing this. Hopefully, those whose careers require it/ will benefit from it will come. I think less people should be going to college (uni) in general. I never really came from a high school that emphasized college as the end-all-be-all and was open-minded to going to learn dental hygiene or HVAC repair at the local community college or trade school, or the military. Because of my HS, I never really understood the supposed stigma, everyone I know respects their local tradesmen and education isn't really emphasized here where I live.\n\nJust my $0.02",
          "author": "Papaadumbass",
          "created": 1636964662,
          "upvotes": 2,
          "replies": {}
        },
        "hkbx8da": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkbx8da/",
          "text": "What was your major?",
          "author": "morchorchorman",
          "created": 1636724398,
          "upvotes": 1,
          "replies": {
            "hkbydjz": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkbydjz/",
              "text": "Ungrad in Business with an emphasis in Management and I work in finance. By the way, you don't need a degree to take the licensing exams.",
              "author": "ladykat9876",
              "created": 1636724965,
              "upvotes": 1,
              "replies": {
                "hkc69u3": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkc69u3/",
                  "text": "Now that I didn’t know, but how would I study for the material to get the licenses? Also, what licenses should I be shooting for?",
                  "author": "morchorchorman",
                  "created": 1636728649,
                  "upvotes": 1,
                  "replies": {
                    "hkcailu": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkcailu/",
                      "text": "The test I took were the SIE, Series 7, and Series 66. The study material can be purchased through companies that specialize in helping people pass these tests.",
                      "author": "ladykat9876",
                      "created": 1636730487,
                      "upvotes": 1,
                      "replies": {
                        "hkcaowy": {
                          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkcaowy/",
                          "text": "Would you happen to know these companies off the top of your head? If not no big deal I have enough information to find out, but I must say I’m very interested.",
                          "author": "morchorchorman",
                          "created": 1636730560,
                          "upvotes": 1,
                          "replies": {
                            "hkcbebp": {
                              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkcbebp/",
                              "text": "Pass Perfect is the one that helped me the most. I also attended Maggie Shine in person classes. It wasn't very help with the Series 7...",
                              "author": "ladykat9876",
                              "created": 1636730858,
                              "upvotes": 1,
                              "replies": {
                                "hkcbi8s": {
                                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkcbi8s/",
                                  "text": "Thank you so much, I’ll take a look into these.",
                                  "author": "morchorchorman",
                                  "created": 1636730904,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk8fcfs": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8fcfs/",
      "text": "That most of campus life revolves around frats.\n\nCounter to Pitch Perfect, there’s hardly any singing involved for non-music majors.",
      "author": "famous_shaymus",
      "created": 1636656043,
      "upvotes": 9,
      "replies": {}
    },
    "hk8cgju": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8cgju/",
      "text": "That you'll do insane amounts of partying. Most semesters, I barely have enough time to sleep let alone do any of that.",
      "author": "ralo229",
      "created": 1636654892,
      "upvotes": 21,
      "replies": {}
    },
    "hk8n83k": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8n83k/",
      "text": "It gets depressing, burnout is easy it really sucks",
      "author": "imarabianaff",
      "created": 1636659237,
      "upvotes": 5,
      "replies": {}
    },
    "hk98x27": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk98x27/",
      "text": "How hard it is to make friends. Especially if you’re a commuter like me.",
      "author": "rebel_child12",
      "created": 1636668180,
      "upvotes": 7,
      "replies": {}
    },
    "hk8dm1u": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8dm1u/",
      "text": "I think the biggest misconception is that college is just for a piece of paper to make more money and that you don't actually learn anything important. I think higher education has a higher purpose and is precious and fragile and people must be dead inside not to feel it.",
      "author": "Sniffalisp",
      "created": 1636655351,
      "upvotes": 23,
      "replies": {
        "hkp62f5": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp62f5/",
          "text": "Ikr. It can be eye-opening to the people who are interested. The bad thing is how expensive it has gotten. Because of how expensive it can be, I understand people wanting a high ROI (something that electrical engineers, accountants, and nurses can most definitely expect, but not for art history majors...)\n\nI went to a community college and it was quite eye-opening when I went. I met many people of diverse backgrounds and had many philosophical conversations with my classmates and professors. Overall, it was a fun experience.\n\nJust my opinion.",
          "author": "Papaadumbass",
          "created": 1636965141,
          "upvotes": 1,
          "replies": {}
        },
        "hkp62yn": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp62yn/",
          "text": "Ikr. It can be eye-opening to the people who are interested. The bad thing is how expensive it has gotten. Because of how expensive it can be, I understand people wanting a high ROI (something that electrical engineers, accountants, and nurses can most definitely expect, but not for art history majors...)\n\nI went to a community college and it was quite eye-opening when I went. I met many people of diverse backgrounds and had many philosophical conversations with my classmates and professors. Overall, it was a fun experience.\n\nJust my opinion.",
          "author": "Papaadumbass",
          "created": 1636965155,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk8pa6l": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8pa6l/",
      "text": "My perspective is skewed maybe since I attend community college and not university \n\nBut my counselors at the beginning of my college experience would say some bs about needing to study 2 hours for every hours of class or something. But that was not true at all. Especially with some of my online classes I kinda just submit stuff and get A’s, and spend maybe an hour or two a week for readings and lectures at home. \n\nSome of my math and science classes that could be true but it depends on how well you do in the subject.",
      "author": "peepeepoopaccount",
      "created": 1636660084,
      "upvotes": 5,
      "replies": {}
    },
    "hk8uj1j": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8uj1j/",
      "text": "That it’s *inherently* expensive. I went to community college and then an (in-state) public school for 6 years total, and I have minimal loans. I know so many people who went out-of-state and/or to private schools, who then bitch about their insane loans.\n\nI’m not saying that specific programs can’t justify these loans, but the benefits *usually* don’t outweigh the costs. After college, 99% of people don’t notice or care where you were to school unless it’s Ivy league.",
      "author": "tookawhile",
      "created": 1636662237,
      "upvotes": 5,
      "replies": {
        "hk90kl8": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk90kl8/",
          "text": "I’d say that even after your first or second job, most people don’t care if you went to Ivy League, either. I know people who went to Yale and University of Penn, and they don’t even put their school on their resume anymore.",
          "author": "NeedsMoreJava",
          "created": 1636664729,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "hk8y59n": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8y59n/",
      "text": "In todays world, you acutally might come out ahead money and debt wise if you skip college.  Why get a 4 year degree just to end up working back at Walmart, that doesn't require a 4 year degree?",
      "author": "soup_2_nuts",
      "created": 1636663732,
      "upvotes": 5,
      "replies": {
        "hkp6fmo": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp6fmo/",
          "text": ">Why get a 4 year degree just to end up working back at Walmart, that doesn't require a 4 year degree?\n\nUnless you're shooting for medicine, engineering, accounting, education, or any major that is required by regulation and you can go debt free, I agree.\n\n>working back at Walmart\n\nOr don't work at Walmart. EVER. Just go become a tradesman or join the military. At least you can start earning 20 bucks an hour as a first year hvac tech instead of minimum wage at Walmart.",
          "author": "Papaadumbass",
          "created": 1636965441,
          "upvotes": 1,
          "replies": {
            "hkpqa3v": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkpqa3v/",
              "text": "As shitty as Walmart is, if they pay for your BA degree that you need to get in to med school, or your accounting degree, I'd suck it up and work for them\n Besides if no one eifked for Walmart, where would 80% of the Karen's go?",
              "author": "soup_2_nuts",
              "created": 1636980949,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hk9wcq2": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9wcq2/",
      "text": "I thought people wouldn’t care or judge you. I actually thought since I went to a top school that people would be smart and want to learn. Same old rich slackers who just need a C and a degree cause daddy already has a job for them.",
      "author": "cuppa_tea_4_me",
      "created": 1636679077,
      "upvotes": 6,
      "replies": {}
    },
    "hka9ngv": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka9ngv/",
      "text": "The fact that I’m punished for staying home while sick *in 2021* is such bullshit.",
      "author": "deprimada",
      "created": 1636685243,
      "upvotes": 6,
      "replies": {}
    },
    "hk8egu6": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8egu6/",
      "text": "OMG, the attendance thing I really hated. Apparently, a lot more colleges require attendance now to prevent kids from missing class and getting bad scores thus giving the school a bad rep",
      "author": "kashmiri-chai",
      "created": 1636655692,
      "upvotes": 4,
      "replies": {
        "hk94245": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk94245/",
          "text": "doesnt make sense for them to require it when youre the one paying for it",
          "author": "Powerful-Asian13",
          "created": 1636666153,
          "upvotes": 2,
          "replies": {
            "hk95jgw": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk95jgw/",
              "text": "I mean yes but there’s also the argument that for some classes, as long as the prof posts the material and work you can still get an A as long as you keep up without going to class all the time. I never go to my 8 am but the prof has everything posted so as long as I get it in on time it’s all good",
              "author": "kashmiri-chai",
              "created": 1636666776,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hk8zkev": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8zkev/",
      "text": "That it’s the best years of your life, and that college is this sort of adult playground where you can party and have fun, really finding yourself as a person, making memories that will last forever.\n\nGranted, I went to a community college for freshman and sophomore year, so most people would just go to class and then go home, and junior and senior year while being at a four year university happened during COVID and were completely remote and at home, so my college experience wasn’t exactly the norm.\n\nHonorable mention being, of course, that a college degree is the key to a good job and success in life, though I think people are starting to understand how much of a scam that conception is.",
      "author": "NeedsMoreJava",
      "created": 1636664314,
      "upvotes": 5,
      "replies": {}
    },
    "hk9neh4": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9neh4/",
      "text": "my profs absolutely give a shit about attendance",
      "author": "Dinkelodeon",
      "created": 1636674794,
      "upvotes": 3,
      "replies": {}
    },
    "hk8upn8": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8upn8/",
      "text": "I think it’s a big misconception that everyone will have the same workload. Your average psych/business major will not be putting in the same hours that a STEM/premed might- so you really shouldn’t expect to have to same schedule for free time.",
      "author": "catfeinee",
      "created": 1636662313,
      "upvotes": 11,
      "replies": {
        "hk97rhn": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk97rhn/",
          "text": "tbh i don’t think anyone thinks that lol…it seems fairly obvious that anything STEM is going to be harsher than the humanities.",
          "author": "yellowflowerpots",
          "created": 1636667692,
          "upvotes": 6,
          "replies": {
            "hk99ha5": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk99ha5/",
              "text": "Eh- I’ve met enough people who don’t understand how different it is. Generally they’re either criticizing a friend for not having enough time for them, or they are in STEM and aren’t prepared- so it hits them like a bus.",
              "author": "oofpdakeke",
              "created": 1636668421,
              "upvotes": 4,
              "replies": {
                "hkcg5e8": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkcg5e8/",
                  "text": "I feel this. I’m a senior nursing student and my roommate is in legal studies. I have a full course load with clinicals an hour and a half away and she just does not understand the demands of my schedule. She takes it extremely personally that I have work to do, clinicals to be at, or that sometimes I just want to sleep",
                  "author": "strangebadgerbabe",
                  "created": 1636732810,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hk8eas3": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8eas3/",
      "text": "That everyone gets laid, it’s completely wrong. I personally get laid a lot, but that’s only because I’m well known through my college for my big cock, others aren’t so lucky.",
      "author": "THE_A-R-F",
      "created": 1636655624,
      "upvotes": 15,
      "replies": {
        "hk8lofi": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8lofi/",
          "text": "I thought this was gonna happen this semester but my college won’t let anybody who isn’t a resident stay in the dorms. It sucks but me and my boyfriend are confident they’ll lift this restriction next semester.",
          "author": "CapriciousSalmon",
          "created": 1636658597,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hk98hqi": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk98hqi/",
      "text": "That it’s worth it.",
      "author": "_solom0n",
      "created": 1636667999,
      "upvotes": 3,
      "replies": {}
    },
    "hk9gqgo": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9gqgo/",
      "text": "That you can get a job afterwards",
      "author": "wolfy321",
      "created": 1636671569,
      "upvotes": 3,
      "replies": {}
    },
    "hk9mg0p": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9mg0p/",
      "text": "I'm about to go on my soap box for a second: the biggest misconception for me is that the only \"valid\" college education is a 4 year degree that is done in EXACTLY 4 years. This just makes me mad because it's just very elitist thinking to me. Not everyone can finish their degree in 4 years. Not everyone want to go to college right away, if at all. We shouldn't be demonizing other post-high school paths just because college is the norm. This just gets me very upset as someone who didn't have the ideal college experience (I'm only just graduating in December after 5.5 years of college). No one who didn't that \"cookie cutter\" college experience should have to justify the decisions they made. I've said this once and I'll say it again: there is no \"right\" way to do college or to do life. Whatever makes the most sense for you, do (as long as it doesn't hurt you or anyone else).",
      "author": "beachylawgirl22",
      "created": 1636674203,
      "upvotes": 3,
      "replies": {
        "hk9r911": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9r911/",
          "text": "It's gonna take me 6 years to finish mine, so I feel ya",
          "author": "Jetfuelmeetsteelbeam",
          "created": 1636676690,
          "upvotes": 2,
          "replies": {
            "hk9rks3": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9rks3/",
              "text": "It's just exhausting to keep explaining to people why I haven't finished my degree yet. I shouldn't have to. There shouldn't be a specific timeline for it.",
              "author": "beachylawgirl22",
              "created": 1636676844,
              "upvotes": 2,
              "replies": {
                "hk9vydg": {
                  "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9vydg/",
                  "text": "Yeah I'm not gonna kill myself to cram courses and then forget it right after. I'd actually like to learn what I'm taking, and for me at least, that takes more time and individual focus for classes, not take 5 simultaneously",
                  "author": "Jetfuelmeetsteelbeam",
                  "created": 1636678889,
                  "upvotes": 2,
                  "replies": {
                    "hk9x85y": {
                      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9x85y/",
                      "text": "That's totally valid. For me, I wanted to give myself time to figure out what I was passionate about (since I was dumb at 17 and picked the wrong field going into college). I transferred and changed majors multiple times, so it delayed me a lot, but I have no regrets! And actually now I'm set on a career path that I love!",
                      "author": "beachylawgirl22",
                      "created": 1636679493,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hk9uvm8": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9uvm8/",
      "text": "That it’s easy to make friends. If you don’t make any friends/friends groups your first year, it’ll be very hard to make friends your third year. I’m a boy junior and when I try to make friends with girls they think I’m flirting or want something with them. No, I don’t. I just want to make friends…",
      "author": "FewAerie7505",
      "created": 1636678386,
      "upvotes": 3,
      "replies": {}
    },
    "hk8zit3": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8zit3/",
      "text": "I thought I’d have more free time but I actually have way less free time",
      "author": "bambiartistic",
      "created": 1636664296,
      "upvotes": 2,
      "replies": {}
    },
    "hk9iqf6": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9iqf6/",
      "text": "That professors will actualy help you do things. I'm from the Philippines and most of my professors just bullshit majority of our tasks. Unnecessary activities here and there. Plus, our grading system sucks. Exam covers 60% of the grade. Fail the exam and you are most likely to fail.",
      "author": "Awkward_Affect_7793",
      "created": 1636672462,
      "upvotes": 2,
      "replies": {}
    },
    "hk9qn1f": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9qn1f/",
      "text": "Your freshman class will be filled with 18 - 19 year olds. \n\nPeople there can easily be in their 30s.  \n\nI am matched with a 30 year old roommate ( I live in a campus apartment). \nShe is great. BTW.",
      "author": "K-Lyn-Nova",
      "created": 1636676402,
      "upvotes": 2,
      "replies": {}
    },
    "hka6wm4": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka6wm4/",
      "text": "That once you graduate you won't be able to find a job that pays you enough to pay back your loans.",
      "author": "EternityNotes",
      "created": 1636683989,
      "upvotes": 2,
      "replies": {}
    },
    "hka84jr": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka84jr/",
      "text": "\"College will be hard, professors aren't forgiving and you having to get a dorm/apartment.\n\nFirst off partially untrue, because it really depends on your major and which teacher you pick. The majority of the teachers I've gotten were layedback. At the moment I did forget to take a test and next day asked my professor to open it back up and he trusted me and was thinking about saying no but it was because of my good attendance he gave me a chance.\n\nWant to know which teacher you pick is a good choice? Go to (rate my professor) there's a possibility the other students before you has taken them and gave them a review.\n\nBut that doesn't mean to take advantage of it of course since its your responsibility to do it by given deadline.\n\nBig advice I got from my dad is to not get a dorm or apartment. It will be a big mistake and would be better to get a house and also start investing your money. If you have the choice in staying with your parent or guardian will be even better since it isnt nessasery in moving if your go to college is close to where you live especially.",
      "author": "Doodle-Biter",
      "created": 1636684549,
      "upvotes": 2,
      "replies": {}
    },
    "hka8evz": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka8evz/",
      "text": "You either have no assignments or every assignment and a bunch of tests.",
      "author": "taconight81",
      "created": 1636684682,
      "upvotes": 2,
      "replies": {}
    },
    "hkdijwz": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkdijwz/",
      "text": "That it’s the prime years of your life \n\nbut it’s quite literally the most stressful and draining years of your life lmao.",
      "author": "rinkinky",
      "created": 1636748697,
      "upvotes": 2,
      "replies": {}
    },
    "hkdo1xh": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkdo1xh/",
      "text": "i'd say there are 2 big misconceptions\n\n1. You need a degree to be successful. Maybe this was true in the 90's, but in today's world one can make 6 figures with just a high school diploma\n2. All Degrees are useful. Many people major in studies that end up leaving them in debt, with no actual career options.",
      "author": "Pinglewingle",
      "created": 1636751048,
      "upvotes": 2,
      "replies": {
        "hkp7odp": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp7odp/",
          "text": ">You need a degree to be successful. Maybe this was true in the 90's\n\nIt was most definitely true in the 80's and below. I just don't get this stigma since I come from a community that doesn't put emphasis on education (Just have a GED or HS diploma to work and only go to college if its a career that requires it (i.e. nursing)) and an open-minded high school that also mentions trade school, community college, and the military\n\n.\n\n>All Degrees are useful. Many people major in studies that end up leaving them in debt, with no actual career options.\n\nPeople who majored in gender studies, Philosophy, English, etc. are most definitely suffering. Engineers, doctors, CS majors, nurses, teachers, etc. are a different story since those majors actually lead to jobs. Overall, if your ideal career requires/ would benefit from a degree AND it is affordable, then go. If not, DON'T FUCKING GO!",
          "author": "Papaadumbass",
          "created": 1636966514,
          "upvotes": 1,
          "replies": {}
        },
        "hkp7pkr": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp7pkr/",
          "text": ">You need a degree to be successful. Maybe this was true in the 90's\n\nIt was most definitely true in the 80's and below. I just don't get this stigma since I come from a community that doesn't put emphasis on education (Just have a GED or HS diploma to work and only go to college if its a career that requires it (i.e. nursing)) and an open-minded high school that also mentions trade school, community college, and the military\n\n.\n\n>All Degrees are useful. Many people major in studies that end up leaving them in debt, with no actual career options.\n\nPeople who majored in gender studies, Philosophy, English, etc. are most definitely suffering. Engineers, doctors, CS majors, nurses, teachers, etc. are a different story since those majors actually lead to jobs. Overall, if your ideal career requires/ would benefit from a degree AND it is affordable, then go. If not, DON'T FUCKING GO!",
          "author": "Papaadumbass",
          "created": 1636966542,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hk8va6p": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8va6p/",
      "text": "I'm not having sex every day.",
      "author": "Savekennedy",
      "created": 1636662550,
      "upvotes": 4,
      "replies": {}
    },
    "hk8o7yz": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8o7yz/",
      "text": "[deleted]",
      "author": null,
      "created": 1636659645,
      "upvotes": 2,
      "replies": {
        "hk8to3n": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8to3n/",
          "text": "Damn how badly were you bullied. I am so sorry that happened to you",
          "author": "Competitive-Ninja449",
          "created": 1636661884,
          "upvotes": 1,
          "replies": {
            "hk99h5d": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk99h5d/",
              "text": "I'm overstating it forget this stupid comment.",
              "author": "Throwaway-helpplspls",
              "created": 1636668419,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk8yphg": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk8yphg/",
      "text": "That dating is easy and plentiful. I went to a school with less then 15,000 students, but nearly 50% commuted and over 60% were in the LGBT+ community. Its a problem as a straight white guy. Spent many a nights doing my own thing.",
      "author": "wikipuff",
      "created": 1636663958,
      "upvotes": 1,
      "replies": {
        "hkaw2di": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaw2di/",
          "text": "60% where the fuck do you go",
          "author": "USS_Leonidas",
          "created": 1636696919,
          "upvotes": 1,
          "replies": {
            "hkawvrg": {
              "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkawvrg/",
              "text": "Hofstra university.  Btw, I'm not making this number up. This is an actual number put out on an official Hofstra thing.",
              "author": "wikipuff",
              "created": 1636697461,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hk9ff3p": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9ff3p/",
      "text": "Yeah I agree I wasn’t expecting so many profs to grade attendance or otherwise penalize you for not being there",
      "author": "airbear13",
      "created": 1636670986,
      "upvotes": 1,
      "replies": {}
    },
    "hk9ggad": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9ggad/",
      "text": "It \"guarantees\" a nice position in the work field. Literally my biggest fear right now is wasting all this time and money because I'm not even sure if finding a job will be easy. The fact that I'm worried about this at all is a problem in itself.",
      "author": "Kittymelody33",
      "created": 1636671444,
      "upvotes": 1,
      "replies": {}
    },
    "hk9nwb0": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9nwb0/",
      "text": "A misconception I had was that I had to believe in everything I wrote. In my second year I had a professor that would give bad grades to those that didn’t regurgitate everything she had written in her book about this subject she was an expert about. Basically there are a lot of narcissistic professors. Learn which classes you want to actually put 100% effort and those where you just need to restate what the professor believes.",
      "author": "Blue_Stana",
      "created": 1636675058,
      "upvotes": 1,
      "replies": {}
    },
    "hk9o52s": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9o52s/",
      "text": "That everybody just wants to party. If you're going to a community college that isn't the vibe at all lol",
      "author": "ThoughtCenter87",
      "created": 1636675183,
      "upvotes": 1,
      "replies": {}
    },
    "hk9otye": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9otye/",
      "text": "That college leads to a “amazing life”",
      "author": "erockson62",
      "created": 1636675526,
      "upvotes": 1,
      "replies": {}
    },
    "hk9ppf0": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9ppf0/",
      "text": "The food isn't actually better than high school food.... I haven't eaten this little in YEARS.",
      "author": "Lazy-Child-013",
      "created": 1636675961,
      "upvotes": 1,
      "replies": {}
    },
    "hk9vdd7": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9vdd7/",
      "text": "There’s a time you should complete college.",
      "author": "Norzilia_M",
      "created": 1636678616,
      "upvotes": 1,
      "replies": {}
    },
    "hk9zr87": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hk9zr87/",
      "text": "That everyone needs it.",
      "author": "PhatKiwi",
      "created": 1636680686,
      "upvotes": 1,
      "replies": {}
    },
    "hka5q2x": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka5q2x/",
      "text": "You will get a high paying job once you finish",
      "author": "Big_DexM",
      "created": 1636683456,
      "upvotes": 1,
      "replies": {
        "hkp72e6": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp72e6/",
          "text": "Nursing? Yeah you could expect that. Homosexual rights studies? Not really.",
          "author": "Papaadumbass",
          "created": 1636965983,
          "upvotes": 2,
          "replies": {}
        },
        "hkp71ul": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkp71ul/",
          "text": "Nursing? Yeah you could expect that. Homosexual rights studies? Not really.",
          "author": "Papaadumbass",
          "created": 1636965971,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hka62hz": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka62hz/",
      "text": "That u can take friday evenings off and still pass:)",
      "author": "samk488",
      "created": 1636683609,
      "upvotes": 1,
      "replies": {}
    },
    "hka8qrp": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka8qrp/",
      "text": "The whole “it’s the best time of your life/you’ll have so much fun/I wish I could go back to those days” thing",
      "author": "Illegally_Blonde24",
      "created": 1636684832,
      "upvotes": 1,
      "replies": {}
    },
    "hka91nj": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hka91nj/",
      "text": "I grew up in a Christian homeschool environment and the perception was that in college everybody is hooking up. There’s definitely some of that but most of the people I know are in committed relationships.",
      "author": "Angrysliceofpizza",
      "created": 1636684971,
      "upvotes": 1,
      "replies": {}
    },
    "hkaaunm": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaaunm/",
      "text": "“C’s get degrees”",
      "author": "Elibui",
      "created": 1636685804,
      "upvotes": 1,
      "replies": {}
    },
    "hkaavwy": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaavwy/",
      "text": "That is college in itself is a business, you are just a number in the system to collect money from and no one gives a fuck about you or your education. Professors teach from a PowerPoint, you take 2 years of highschool level classes to just take your majors courses and all for a piece of paper that says your worthy to join the work force",
      "author": "chaoticzane",
      "created": 1636685822,
      "upvotes": 1,
      "replies": {}
    },
    "hkab75q": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkab75q/",
      "text": "I’ve seen a lot of comments that people were surprised by profs caring about attendance, but I’m the opposite. Coming out of high school where attendance is mandatory and tracked every hour, I was surprised that I can just skip class whenever I want. Even the profs who take attendance don’t actually care or know if I come to class beyond marking a point in the grade book.",
      "author": "Playful_manatee",
      "created": 1636685971,
      "upvotes": 1,
      "replies": {}
    },
    "hkabu4r": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkabu4r/",
      "text": "that going to college guarantees you a job. that all degrees are created equal (only a handful of degrees are actually in demand)",
      "author": "kh7190",
      "created": 1636686280,
      "upvotes": 1,
      "replies": {}
    },
    "hkae3ix": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkae3ix/",
      "text": "That getting through college meant you were secured for a career for life.",
      "author": "Asuna_Kikyo",
      "created": 1636687347,
      "upvotes": 1,
      "replies": {}
    },
    "hkaftmb": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaftmb/",
      "text": "That you will have many friends and go on many dates. While this could be true for some people, most people need to work for it. It just does not happen naturally unless if you are extremely lucky.",
      "author": "iamsojellyofu",
      "created": 1636688174,
      "upvotes": 1,
      "replies": {}
    },
    "hkahppn": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkahppn/",
      "text": "I thought I would have the typical college experience but I work 30 hours a week so I go to class, study, eat, work, and sleep. I have no socks life.",
      "author": "bottleoftrash",
      "created": 1636689068,
      "upvotes": 1,
      "replies": {}
    },
    "hkajpei": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkajpei/",
      "text": "all the crazy college parties that dont exist",
      "author": "Lopsided_Pollution83",
      "created": 1636690021,
      "upvotes": 1,
      "replies": {}
    },
    "hkak4w3": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkak4w3/",
      "text": "The idea that your income afterward will magically be higher than it would’ve been. You’re definitely opening up more opportunities. It’s still up to you though to turn those opportunities into money, and I’ve seen plenty of people I graduated with unable to do that",
      "author": "adklibisz",
      "created": 1636690240,
      "upvotes": 1,
      "replies": {
        "hkakh8u": {
          "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkakh8u/",
          "text": "This also goes hand in hand with the misconception that the only value college provides is a higher income. There are many intangible benefits of having gone to college. For example, I had many life experiences and explored many interests, all which never would’ve happened if I worked full-time immediately at 18 years old.",
          "author": "adklibisz",
          "created": 1636690412,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkama0w": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkama0w/",
      "text": "That partying is a big thing. They basically don't exist at my uni, and my major specifically is made up of loners who don't even talk to each other",
      "author": "SuiDyed",
      "created": 1636691308,
      "upvotes": 1,
      "replies": {}
    },
    "hkappgi": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkappgi/",
      "text": "That you need to graduate by 22. I say take your time and go to school when you’re mature enough to commit yourself.",
      "author": "moonrette",
      "created": 1636693121,
      "upvotes": 1,
      "replies": {}
    },
    "hkasp2i": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkasp2i/",
      "text": "“The college experience”",
      "author": "ElBarro69",
      "created": 1636694846,
      "upvotes": 1,
      "replies": {}
    },
    "hkaxep1": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkaxep1/",
      "text": "I feel that it is you don’t realize how lonely you will be",
      "author": "aideng34",
      "created": 1636697813,
      "upvotes": 1,
      "replies": {}
    },
    "hkb19xr": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb19xr/",
      "text": "The workload believe it or not. It takes more than the average person not in college would think. I'm in computer eng and do 6 courses, 3 labs and 2 seminars. You have to go to class just off the fact every 2nd person fails out and I somehow have a 3.8 gpa. Working tirelessly nearly 7 days a week and trying to fit the gym, cleaning, cooking and other responsibilities in. I'd say the only good thing is I do get 6-7 hours of sleep a night. But the price I pay is I can only meet up with a chick or guy friends once every other week at most, along with reddit being the only social media I have and still use. Also GPA very much matters, I've talked to employers who I've worked for during internships. Don't have people who clearly havent worked in a professional field tell you otherwise. Especially for work straight outta school, good luck if you don't have a 3.5+gpa",
      "author": "menglish025",
      "created": 1636700572,
      "upvotes": 1,
      "replies": {}
    },
    "hkb46rc": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb46rc/",
      "text": "that community college is easy. my bio prof claims his class’ difficult is on par with yale’s. at first i was skeptical but now the class is kicking my ass so i believe him.",
      "author": "m48_apocalypse",
      "created": 1636702835,
      "upvotes": 1,
      "replies": {}
    },
    "hkb4e51": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb4e51/",
      "text": "That it's most effective way to learn and demonstrate competency.",
      "author": "mavavilj",
      "created": 1636702999,
      "upvotes": 1,
      "replies": {}
    },
    "hkb66m1": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb66m1/",
      "text": "I had always understood college to be the place where I would finally be able to network with people in my field of interest. I went to a small rural high school and was interested in architecture and urbanism and I knew literally nobody else with the same interest. I started at a large university studying urban planning, then transferred out to a small rural university to study historic architecture preservation. Two very different worlds, but I had a similar result socially. In both cases, I have barely communicated with anyone else in my area of study outside academic classwork and almost my whole social life revolves around the marching band and symphony which I consider my side hobbies. There's only one singular other historic preservation guy I talk to on a regular basis, because we go antiquing together.",
      "author": "zaxophone_bswv",
      "created": 1636704420,
      "upvotes": 1,
      "replies": {}
    },
    "hkb8kmo": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkb8kmo/",
      "text": "That it is gonna be very difficult. Honestly, high school was so much harder for me 1000X. I have 3.8 GPA but don’t know how haha",
      "author": "Equivalent-Tap-1285",
      "created": 1636706449,
      "upvotes": 1,
      "replies": {}
    },
    "hkbcgc0": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkbcgc0/",
      "text": "people told me that attendance is not so neccessary in college but our professors don't let us take finals unless we've attended above 75% of their classes.. and if we miss a class we have to write a mail explaining why we did",
      "author": "touyapologist",
      "created": 1636709923,
      "upvotes": 1,
      "replies": {}
    },
    "hkbegee": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkbegee/",
      "text": "That you'll get a happy go lucky job straight out of the gate. Nearly impossible to get the dream job you want unless you know someone.",
      "author": "MrEpicVisionz",
      "created": 1636711709,
      "upvotes": 1,
      "replies": {}
    },
    "hkc1kv5": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkc1kv5/",
      "text": "For me personally it's learning off of Google. \n\nI had assignments where they ask me to define a term and then list how that term is used in real world scenarios. \nExample: for project management, what is benchmarking, why is it important, and make a list of important benchmarks and why.\n\nBenchmark is mentioned ONCE in our text book as a sentence in a paragraph.\n\nI had other assignments that's a \"Google scavenger hunt\" where they're just asking us to Google all of the info. Like why am I paying college to learn off Google, dummies.com or Microsoft labs.",
      "author": "Alphabet_Beans",
      "created": 1636726509,
      "upvotes": 1,
      "replies": {}
    },
    "hkczwbz": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkczwbz/",
      "text": "Honestly attendance also can depend on the class some teacher car some dgaf.",
      "author": "b_dave",
      "created": 1636740789,
      "upvotes": 1,
      "replies": {}
    },
    "hkdixby": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkdixby/",
      "text": "My high school teachers always told me I would only ever use MLA format when writing papers in college\n\nthen college came, and I was told to write a paper in my government class in APA format and I was like\n\nexcuse me- what",
      "author": "rinkinky",
      "created": 1636748855,
      "upvotes": 1,
      "replies": {}
    },
    "hkz1ykn": {
      "link": "/r/college/comments/qrioq5/what_do_you_think_is_the_biggest_misconception/hkz1ykn/",
      "text": "I always thought that someone had to be intelligent to do well in college. In fact it’s effort and preparation. Don’t get me wrong, it helps to have a good memory, but when someone puts in the work, more time than not they will succeed.",
      "author": "Far_Drink_8879",
      "created": 1637145941,
      "upvotes": 1,
      "replies": {}
    }
  }
}