{
  "sid": "rds5vz",
  "link": "/r/college/comments/rds5vz/activities_to_do_when_you_take_one_semester_off/",
  "title:": "Activities to do when you take one semester off for mental health reasons?",
  "text": "My mental state is a wreck right now and I’m on the verge of failing almost all my classes. I definitely still want to pursue college, but I don’t think I can continue on for a while when I’m constantly stressed and anxious. I consider taking one semester off. \n\nI don’t have a part-time job right now and I get the feeling I might be really bored if I took one semester off. I really want a variety of activities to do to preoccupy me.",
  "author": "bboombayah",
  "created": 1639199041,
  "updated": 1639516662,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "ho3admi": {
      "link": "/r/college/comments/rds5vz/activities_to_do_when_you_take_one_semester_off/ho3admi/",
      "text": "Read books or work on fitness.",
      "author": "BlueOcean7987",
      "created": 1639203685,
      "upvotes": 3,
      "replies": {}
    },
    "ho5nkdz": {
      "link": "/r/college/comments/rds5vz/activities_to_do_when_you_take_one_semester_off/ho5nkdz/",
      "text": "You need to focus on yourself and what makes you happy during your semester off. Do whatever improves your mental health. Maybe use your extra time to meal prep healthy food, workout (even if that means just going for a walk around the block a few times per week), enrol in therapy if you can, and make time for hobbies you enjoy. Maybe even start a new hobby like learning ukulele or taking an art class",
      "author": "Plaintivex",
      "created": 1639251471,
      "upvotes": 2,
      "replies": {}
    },
    "ho5w5w8": {
      "link": "/r/college/comments/rds5vz/activities_to_do_when_you_take_one_semester_off/ho5w5w8/",
      "text": "Make sure your can take a semester off based on your school’s policies. If you’re failing most classes, you may not be in good academic standing which may impact your options.",
      "author": "peakfreak18",
      "created": 1639255282,
      "upvotes": 2,
      "replies": {}
    }
  }
}