{
  "sid": "q6f290",
  "link": "/r/college/comments/q6f290/why_is_college_so_hard/",
  "title:": "Why is college so hard?",
  "text": "I don't know about you guys and gals but I have become extremely burnout with school. It feels like too much stress and pressure. I have tried so many things to get motivated but none of them work. Does anyone have any tips?",
  "author": "Independent-Swim-960",
  "created": 1634016617,
  "updated": 1634581600,
  "over_18": false,
  "upvotes": 15,
  "upvote_ratio": 1.0,
  "comments": {
    "hgbrfcy": {
      "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgbrfcy/",
      "text": "Sorry I don’t have a tip but yeah, I’m also really exhausted honestly . I just want it to end",
      "author": "PuzzleheadedMail",
      "created": 1634020581,
      "upvotes": 4,
      "replies": {}
    },
    "hgbsde4": {
      "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgbsde4/",
      "text": "It’s as hard as you make it. If you aim to get Straight A’s, sure college is going to be hell. But if you don’t mind getting B’s or C’s, your experience will be a lot easier and more tolerable. So long as you pass everything, you’ll still get your degree. Unless you plan on going to grad school, your grades don’t matter that much.",
      "author": "IzzyValentiiina",
      "created": 1634021339,
      "upvotes": 8,
      "replies": {}
    },
    "hgcbaxi": {
      "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgcbaxi/",
      "text": "Drop out and get a job. \n\nShitty jobs are so much harder than college in my opinion. Some good ole hard labor will spark your motivation!",
      "author": "Awkward_Mail_2786",
      "created": 1634037690,
      "upvotes": -2,
      "replies": {
        "hgdvog4": {
          "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgdvog4/",
          "text": "i don't know why this is getting downvoted. this actually helped me during my gap year. im making straight As now with a renewed passion for my future career.",
          "author": "Puzzleheaded_Elk_866",
          "created": 1634063630,
          "upvotes": 3,
          "replies": {
            "hge0vh2": {
              "link": "/r/college/comments/q6f290/why_is_college_so_hard/hge0vh2/",
              "text": "It's just reddit, it's how it works. If you're not posting what everyone wants to see, you get the downvotes. \n\nLucky thing is, they aren't worth anything at all. It's an arbitrary number that doesn't exist anywhere outside this website. In fact, it only affects your life if you allow it to!",
              "author": "Awkward_Mail_2786",
              "created": 1634065738,
              "upvotes": 8,
              "replies": {
                "hgeku5n": {
                  "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgeku5n/",
                  "text": "In case you or anyone else is interested, I actually wrote a CSS stylesheet for the classic desktop site that hides karma, upvotes, scores, etc so you can truly imagine they don’t exist. I find Reddit is actually much more pleasant to browse and less visually cluttered without points everywhere. Hit me up if you’re interested",
                  "author": "SkunkStriped",
                  "created": 1634073873,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "hgfrsah": {
          "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgfrsah/",
          "text": "Deadass, a few months in Fast Food will make anyone come running for college.",
          "author": "FoxWyrd",
          "created": 1634093473,
          "upvotes": 2,
          "replies": {
            "hgh15p9": {
              "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgh15p9/",
              "text": "No kidding. Hell, any job will do it. I worked woodwork and it brought me here. \n\nAmerican culture is hell bent on putting your head down and finishing college. I feel like people feel ashamed to think about taking a year off.",
              "author": "Awkward_Mail_2786",
              "created": 1634126243,
              "upvotes": 1,
              "replies": {
                "hgh195l": {
                  "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgh195l/",
                  "text": "I worked in Food Service for a few years before going back to college.\n\n&#x200B;\n\nI wanted to get my degree to move up.\n\n&#x200B;\n\nI graduated with my BS in December 2019.\n\n&#x200B;\n\nI'm not impressed.",
                  "author": "FoxWyrd",
                  "created": 1634126305,
                  "upvotes": 1,
                  "replies": {
                    "hgh3syi": {
                      "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgh3syi/",
                      "text": "Hasn't improved eh?\n\nI'm a little worried about that kind of outcome too. I'm finishing up a Bachelors in Mechanical Engineering. \n\nMy experience with all my jobs is that the people make it the absolute worst. I'm really hoping that most the people who I dealt with (none of which ever had degrees) won't be in the professional careers I get into after I graduate. \n\nI think the worst part about it was working the shop floor and all the management seeing us as a liquid resource. I heard it from everybody that shop guys just 'come and go'. They didn't do anything to ever improve the retention or anything, they just continued treating them like shit and turning them over. \n\nI have a friend who works at a wood shop and it sounds like a completely solid gig. Nothing like my experiences. He's making excellent money, great benefits and the company treats him right. I had ZERO benefits, worked under the worse management I've ever seen and just generally hated every single one of them dumb dick bastards. Since I was younger than most people in woodworking, that meant that I didn't know anything about anything. I couldn't have a fucking original idea without somebody breaking it down, reorganizing it slightly to pass it as their own. I got tired of motherfuckers telling me how smart I was in the same sentence telling me exactly how to do everything. \n\nI would still be a woodworker if I had found a job like his.",
                      "author": "Awkward_Mail_2786",
                      "created": 1634127852,
                      "upvotes": 1,
                      "replies": {
                        "hgh57s3": {
                          "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgh57s3/",
                          "text": "I made more money before I graduated than I do with a master's degree.\n\n&#x200B;\n\nI waited tables and bartended through college and went to college to help move into Management.\n\n&#x200B;\n\nMy town's restaurants largely shut down and those who lost their jobs went to the surviving restaurants--I was not so lucky.\n\n&#x200B;\n\nFinally did move into Management--at a Fast Food place (not the Fine Dining atmosphere I was working at before)--and now I'm just done.  The customers are worse than they've ever been, keeping staff is next to impossible, my bosses won't up the wages despite us running skeleton crews.\n\n&#x200B;\n\nI hate it and it's why I'm heading to Law School in the Fall and never setting foot in a restaurant again in any professional capacity.",
                          "author": "FoxWyrd",
                          "created": 1634128644,
                          "upvotes": 1,
                          "replies": {
                            "hgie9p2": {
                              "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgie9p2/",
                              "text": "I'm confused here. You're telling me you've got an MBA and you're working as Fast Food Management? \n\nIs that typical?",
                              "author": "Awkward_Mail_2786",
                              "created": 1634147812,
                              "upvotes": 1,
                              "replies": {
                                "hgis2i5": {
                                  "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgis2i5/",
                                  "text": "Nope.\n\nIt is when Life shits on you.",
                                  "author": "FoxWyrd",
                                  "created": 1634153385,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hgeh28q": {
      "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgeh28q/",
      "text": "My understanding is high school used to be harder. College, I've found to be super light on structure compared to HS, and even 3 years in, adjusting to that has been a huge struggle. I've been told (by people my parents age) that there was less of a jump in the past because high school started to slowly take away that structure",
      "author": "BecomingCass",
      "created": 1634072307,
      "upvotes": 1,
      "replies": {}
    },
    "hgbwfqj": {
      "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgbwfqj/",
      "text": "Man I feel you, thing is ive always been okay with mediocre grades but even getting cs is hard lol. If i didnt ive in dorms and didnt enjoy the college life i would drop out...",
      "author": "MimiHades",
      "created": 1634024842,
      "upvotes": 0,
      "replies": {}
    },
    "hgc6w9z": {
      "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgc6w9z/",
      "text": "I haven't started college yet but I'm fully prepared grind grades as much as possible, and for stress it can result in ,so I can get a scholarship later on. \n\n\nIf you can afford not getting A's on everything I think you should be fine.",
      "author": "KonoDioDa10",
      "created": 1634034441,
      "upvotes": 0,
      "replies": {}
    },
    "hgcq32j": {
      "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgcq32j/",
      "text": "Studying college is like choosing to play hard-core in a game",
      "author": "Neonhelix101",
      "created": 1634046147,
      "upvotes": 0,
      "replies": {
        "hgd1t7r": {
          "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgd1t7r/",
          "text": "[deleted]",
          "author": null,
          "created": 1634051371,
          "upvotes": 1,
          "replies": {
            "hgd4p9c": {
              "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgd4p9c/",
              "text": "Exactly",
              "author": "Neonhelix101",
              "created": 1634052548,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hgdwdu3": {
          "link": "/r/college/comments/q6f290/why_is_college_so_hard/hgdwdu3/",
          "text": "I don’t disagree, but what exactly are your reasons for feeling this way?",
          "author": "ThickumDickums",
          "created": 1634063914,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}