{
  "sid": "rfnkr6",
  "link": "/r/college/comments/rfnkr6/do_i_follow_my_dreams_or_settle/",
  "title:": "Do I follow my dreams or settle",
  "text": "Hello, all! I’m completely stuck right now between settling for a respiratory therapy track (which I’m already set up to take some pre-requisites for beginning in January) or taking out a loan and getting my masters in English. I’d be aiming to be an English professor. Here’s some of my thoughts. \nThe RT track will take me a year and a half, while the English major may take me 4 years (I already have an associates degree so maybe less? I’m not sure). \nRT will be less money and less student loan(s) because the program is quick. \nInterest-wise, I’m very into English. I love writing and poetry, and I enjoy reading classic works. As far as RT, I’m not particularly interested in it but I know a hospital job will be rewarding in other ways. \nIf there’s anyone who’s done these tracks/majors or had a similar situation I’d love to hear how you came out, and what decisions you made. Thanks :)",
  "author": "stargrazing1",
  "created": 1639423021,
  "updated": 1639516104,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hof68iv": {
      "link": "/r/college/comments/rfnkr6/do_i_follow_my_dreams_or_settle/hof68iv/",
      "text": "I would go the respiratory therapist route. You said you would plan to become a professor, but nowhere did you say you like teaching. I'm glad you're realistic about where an English degree will probably get you. And in response to the other comment, many adjunct or community college professors don't have benefits, so they get paid $40/he but have no insurance, retirement plan, or help with employment taxes, etc, so that salary is probably lower than it seems.\n\nEnglish names a great hobby, you could even write and analyze and become a columnist on the side. You can't practice medicine if any sort except personal training on the side.",
      "author": "Thelton26",
      "created": 1639426396,
      "upvotes": 3,
      "replies": {
        "hoigd9m": {
          "link": "/r/college/comments/rfnkr6/do_i_follow_my_dreams_or_settle/hoigd9m/",
          "text": "I like the reality of this response, thank you! While teaching others would be interesting, I don’t think I’d enjoy the homework of teaching honestly.",
          "author": "stargrazing1",
          "created": 1639491025,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoeyipw": {
      "link": "/r/college/comments/rfnkr6/do_i_follow_my_dreams_or_settle/hoeyipw/",
      "text": "Get the masters; I have some instructors at the community college that make over 40 dollars an hour, which is really good where I live. In the end, you'll be happier and make more money following your passion.",
      "author": "Whipitrash",
      "created": 1639423305,
      "upvotes": 2,
      "replies": {}
    },
    "hof1d7y": {
      "link": "/r/college/comments/rfnkr6/do_i_follow_my_dreams_or_settle/hof1d7y/",
      "text": "I'm not in English, but am in grad school for humanities stuff. The thing I'd advise before you make your choice is to look at what academic research and jobs look like in your discipline, look at the state of academic jobs, then look at what doors would be open for you with that English degree if academia doesn't work out. I think it's fair to follow your aspirations, but you should do so with your eyes open to the fact that academic jobs, *especially* in humanities, are extremely competitive.\n\n\nOtherwise, I'd say if you do English, take out as few loans as possible. You can do your gen eds at a community college or you can go to a cheaper state school. And the advice I got, which I think holds water, is to ***never*** pay for your grad school in humanities. Any program worth going to will fund its students, and you don't want that extra debt hanging over you, particularly in a field without high job security.\n\n\n\nWith all that being said, it depends on how strongly you feel about your career option. I went to grad school for my subject because I cannot imagine working in another field unless I have to, but there were folks in my undergrad that, while they *enjoyed* the subject, are happier not doing it as their job. That should be the question for you, whether you feel you'd be satisfied with a RT job and English as a hobby.",
      "author": "torgoboi",
      "created": 1639424447,
      "upvotes": 2,
      "replies": {
        "hoig7as": {
          "link": "/r/college/comments/rfnkr6/do_i_follow_my_dreams_or_settle/hoig7as/",
          "text": "Yeah I think enjoying the subject and wanting it as a job are definitely two things I have to separate in my headspace, thanks so much!",
          "author": "stargrazing1",
          "created": 1639490946,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hofiu32": {
      "link": "/r/college/comments/rfnkr6/do_i_follow_my_dreams_or_settle/hofiu32/",
      "text": "If I were in were your shoes I’d go the respiratory route. Reason being is jobs are way easy to come by and I could relocate a lot more places. \nI think you could funnel your money into writing on the side.\nTeaching comes with a lot of responsibilities and nuances. Politics at schools and grading papers, and finally always being expected to respond to emails promptly, would ruin it for me.\n\nMake your passions your side hustle. If luck and hard work align you could turn your side hustle into your career.",
      "author": "yonosetr3s",
      "created": 1639431628,
      "upvotes": 2,
      "replies": {
        "hoig1xs": {
          "link": "/r/college/comments/rfnkr6/do_i_follow_my_dreams_or_settle/hoig1xs/",
          "text": "I love that last part, thank you so much for this. Very helpful",
          "author": "stargrazing1",
          "created": 1639490875,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}