{
  "sid": "rbesm1",
  "link": "/r/college/comments/rbesm1/whats_a_nice_way_to_confront_my_prof_for_not/",
  "title:": "What’s a nice way to confront my Prof for not being present?",
  "text": "Long story short, I have this one Professor that often cancels class and office hours sessions right before they happen. I also only had one grade put in from September.\n\n(As a commuter student that lives more than 2 hours away from campus, it kinda sucks to come to campus just for class to be cancelled). \n\nI’d just really like for them to reply to their emails. In person, they told me that they were busy but that they would try to reply to their emails as soon as possible. And it just doesn’t happen. How can I nicely talk to them about this?",
  "author": "creashawn64",
  "created": 1638926241,
  "updated": 1639517280,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hnnyq6g": {
      "link": "/r/college/comments/rbesm1/whats_a_nice_way_to_confront_my_prof_for_not/hnnyq6g/",
      "text": "This is not normal. I would contact their Department Chair or Dean with your concerns. You are not really in a position to fix whatever the Prof is dealing with or doing.",
      "author": "zifmer",
      "created": 1638926963,
      "upvotes": 4,
      "replies": {
        "hnodr4g": {
          "link": "/r/college/comments/rbesm1/whats_a_nice_way_to_confront_my_prof_for_not/hnodr4g/",
          "text": "I thought about going to the Dean, but I’d like to try to nicely talk about this with them first.",
          "author": "creashawn64",
          "created": 1638934593,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hnnz220": {
      "link": "/r/college/comments/rbesm1/whats_a_nice_way_to_confront_my_prof_for_not/hnnz220/",
      "text": "On top of other comments, remember to have empathy. Your profs are people just like you. Theyre getting underpaid, deal with bullshit like you do, and have unexpected events happen all the time. Consider asking the prof to make appointments by zoom or other video chatting service more available. Maybe even lessons too.",
      "author": "AHumbleLibertarian",
      "created": 1638927128,
      "upvotes": 5,
      "replies": {}
    },
    "hnny2v4": {
      "link": "/r/college/comments/rbesm1/whats_a_nice_way_to_confront_my_prof_for_not/hnny2v4/",
      "text": "If you pay for a service and don’t get it, you should get a damn refund! Literally no other business can get away with the shit that universities get away with. Could you imagine booking a driving lesson, the instructor doesn’t show up, but the fucker still charges you?\n\nIt makes me so mad.",
      "author": "TextualConduct",
      "created": 1638926637,
      "upvotes": 2,
      "replies": {
        "hno92ar": {
          "link": "/r/college/comments/rbesm1/whats_a_nice_way_to_confront_my_prof_for_not/hno92ar/",
          "text": "In my undergrad my professors used to say all the time you are not my customer. My student loans determine that was a lie.",
          "author": "BlueOcean7987",
          "created": 1638932168,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}