{
  "sid": "qnoy3s",
  "link": "/r/college/comments/qnoy3s/asking_for_a_reference/",
  "title:": "Asking for a reference?",
  "text": "So I saw this on campus job that I really want and it said to put two references. \n\nThis job post was posted yesterday and the applications are due Sunday \nI sent email to two professors and one prof emailed back quickly and one prof is not responding, and now that it is weekend, I dont think any professor would respond. \n\nShould I try to just submit the application with one reference, or just keep try to find a reference during the weekend?",
  "author": "TeachingLongjumping5",
  "created": 1636159570,
  "updated": 1636655892,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjhrdtl": {
      "link": "/r/college/comments/qnoy3s/asking_for_a_reference/hjhrdtl/",
      "text": "Does the reference have to be a professor? Since it’s for a job, you could put down your previous employer, or somewhere you worked where you know they’ll say nice things about you.",
      "author": "laniebug235",
      "created": 1636160440,
      "upvotes": 3,
      "replies": {
        "hjkp1ai": {
          "link": "/r/college/comments/qnoy3s/asking_for_a_reference/hjkp1ai/",
          "text": "It does not have to be a professor, but I thought they will be easier to contact. Thanks for your advice.",
          "author": "TeachingLongjumping5",
          "created": 1636220296,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjiq1jt": {
      "link": "/r/college/comments/qnoy3s/asking_for_a_reference/hjiq1jt/",
      "text": "Since it’s just a reference you don’t technically have to ask permission first in this scenario. You also don’t have to ask a professor, you can ask a previous employer as someone else said, if you ever did and volunteering you can put the person in charge of you there as well.",
      "author": "ilikecacti2",
      "created": 1636179335,
      "upvotes": 2,
      "replies": {
        "hjkp2oh": {
          "link": "/r/college/comments/qnoy3s/asking_for_a_reference/hjkp2oh/",
          "text": "I did not know that. Thanks for your advice.",
          "author": "TeachingLongjumping5",
          "created": 1636220312,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}