{
  "sid": "rbgs1z",
  "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/",
  "title:": "Transferring to a lower ranked school?",
  "text": "I'm currently a sophomore at UCSB. I enrolled back in 2019, spent about half a year there before COVID. Honestly, my life at UCSB was quite miserable. The environment just felt wrong to me. I don't wanna go into all the details, but I'm distressed and miserable there. I ended up having depression and anxiety there and had to see the therapist every week. I couldn't concentrate on anything and sometimes had to take sleeping pills. I felt relieved when I went back home after everything moved online. \n\nNow I'm back, and that anxiety and depression come back. During COVID, I constantly tried to convince myself that everything would be better, the school isn't that bad, I just didn't try hard enough in adapting, and I only need one more shot to fall in love with the school. But none of that happened, so I tried to transfer. I grew up in Hong Kong and I always love city life. I applied for several schools in NY and Boston and got accepted to Fordham Lincoln Center with 20k scholarship. I've lived in NYC for a couple of months before and I definitely love it there. But what keeps me from taking the offer is the ranking. Fordham is somewhere around 60th and UCSB is a top 30. I'm worried that prestige would hurt my chance of getting a job. I wanna study finance or Econ, and I plan to stay in the east coast after graduating. Even though I know that Fordham has good job placement in the Wall Street, the ranking still bothers me. Money would not be an issue. I pay out of state tuition at UCSB, that's 44k, and at Fordham I would be playing 35k. Living costs would be higher in NYC but my family can afford that. So what do you guys think? Should I transfer to a lower ranked school for happiness?",
  "author": "Lam-Wang",
  "created": 1638932079,
  "updated": 1639517265,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hnogpy6": {
      "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnogpy6/",
      "text": "You would have access to a lot of finance internships/jobs in NYC which may be more valuable to your career than a ranking.",
      "author": "slipperglass",
      "created": 1638936203,
      "upvotes": 8,
      "replies": {
        "hnpp94t": {
          "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnpp94t/",
          "text": "Makes sense!",
          "author": "Lam-Wang",
          "created": 1638969291,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnosdm0": {
      "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnosdm0/",
      "text": "Transfer if you know they have your major and you plan to be on the East Coast. Prestige is nothing if you are unhappy and anxious.  Do get help for your emotional well-being. It may follow you without proper support. Best wishes.",
      "author": "JJohnston372",
      "created": 1638943522,
      "upvotes": 5,
      "replies": {
        "hnpp64z": {
          "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnpp64z/",
          "text": "Thank you! I've been seeing a therapist on regular basis and it's helpful!",
          "author": "Lam-Wang",
          "created": 1638969244,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnowhkv": {
      "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnowhkv/",
      "text": "You shouldn’t trust everything related to USNews. I think in terms of reputability Fordham and UCSB are about the same (at least for business).\n\nPlus, UCSB’s rankings haven’t been consistent over the years which is also important. They were like #37-40 only 5 years ago. That means their reputability isn’t established compared to other universities who have had similarly higher ranks for 20+ years.",
      "author": "LostWindSpirit",
      "created": 1638946677,
      "upvotes": 3,
      "replies": {
        "hnpp0c5": {
          "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnpp0c5/",
          "text": "Right on",
          "author": "Lam-Wang",
          "created": 1638969156,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hnq2nbv": {
      "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnq2nbv/",
      "text": "To my understanding, (and I don’t know what you’re studying, maybe your degree is in something different than mine), employers in the U.S. really don’t care where you went to school, unless it was somewhere like Harvard or Yale. Your references, your experience, and your assets (like being bilingual) are much more attractive to employers.\nA graduate with a high GPA, extensive relevant work/internship experience, extra certifications, and top notch references from a no-name private university or state school is so much more valuable than a graduate with average qualities that attended a “high ranking university” according to niche ranking system. At least where I’m from. (Rural Midwest) As long as your university was accredited, you didn’t opt for a pass/fail Covid grade, and you do your best in your program, you’re pretty much golden in a lot of the U.S. Plus you’re doing all of this as an international student, which is even more impressive.",
      "author": "Direct_Preference737",
      "created": 1638975784,
      "upvotes": 2,
      "replies": {
        "hnq31o1": {
          "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnq31o1/",
          "text": "I would recommend reaching out to people who have the job/career path you want and ask them what they thought was necessary for them to get there. I would guess that most of them relied more on their knowledge and experience than the name of the school on their degree :)",
          "author": "Direct_Preference737",
          "created": 1638975955,
          "upvotes": 1,
          "replies": {
            "hnqcoq2": {
              "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnqcoq2/",
              "text": "This is SO helpful! Thank you!",
              "author": "Lam-Wang",
              "created": 1638979934,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hnp44ui": {
      "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnp44ui/",
      "text": "rankings are just a number! prisoners stumped Harvard kids in a debate! school ranking doesn't define your worth, you define worth",
      "author": null,
      "created": 1638953125,
      "upvotes": 2,
      "replies": {
        "hnpozk6": {
          "link": "/r/college/comments/rbgs1z/transferring_to_a_lower_ranked_school/hnpozk6/",
          "text": "Really appreciate your advice! For months I've been trying to convince myself that ranking doesn't matter that much, and your words are illuminating!",
          "author": "Lam-Wang",
          "created": 1638969143,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}