{
  "sid": "pt9q3q",
  "link": "/r/college/comments/pt9q3q/accidentally_plagiarized_when_making_an_essay/",
  "title:": "accidentally plagiarized when making an essay, even though i linked my work cited entries?",
  "text": "just got my essay back from the teacher after she reviewed it, and i guess about a paragraph ended up being a similar paraphrase from a psychologist i was using (i didn't know the limits). now i don't know what to do because my topic is about intuition and i needed to learn input about it from professionals, and i was putting down the info i could make sense of (i didn't copy-paste once even!) and she gives me a note on the paper that says something like: \"blah blah this was from blank psychologist and now i don't trust you. i will probably give you a zero.\" so what do i do? i feel like shit now and that my writing is garbage even though i worked my ass off on that essay and tried citing with quotes and MLA links at the bottom of the essay. shit like this makes me wonder why i'm in college and not in a casket.",
  "author": "pokemyiris",
  "created": 1632323907,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.88,
  "comments": {
    "hduqua3": {
      "link": "/r/college/comments/pt9q3q/accidentally_plagiarized_when_making_an_essay/hduqua3/",
      "text": "Rewrite it with a full quotation in either MLA or APA format & credit the psychologist she's speaking of.\n\nYou may not have realized that your paraphrase was already paraphrased before, so fix it with the proper citation to the original source.",
      "author": "BarIntelligent9156",
      "created": 1632324066,
      "upvotes": 4,
      "replies": {
        "hdv07ts": {
          "link": "/r/college/comments/pt9q3q/accidentally_plagiarized_when_making_an_essay/hdv07ts/",
          "text": "i also have another question: is my teacher gonna hold a grudge on me for this? it was a genuine mistake but i feel like some english teachers are strict af",
          "author": "pokemyiris",
          "created": 1632327881,
          "upvotes": 2,
          "replies": {
            "hdv0hb9": {
              "link": "/r/college/comments/pt9q3q/accidentally_plagiarized_when_making_an_essay/hdv0hb9/",
              "text": "That's entirely up to your teacher, I don't know the answer to that I'm sorry.\n\nEach teacher is different, but attempting to fix your mistake will look better in the long run than leaving it as-is",
              "author": "BarIntelligent9156",
              "created": 1632327988,
              "upvotes": 5,
              "replies": {
                "hdv1cwa": {
                  "link": "/r/college/comments/pt9q3q/accidentally_plagiarized_when_making_an_essay/hdv1cwa/",
                  "text": "true, you're right. she only read one page up to the point of my unquoted paraphrase and said she gave up. i have no idea if this means that next time she reads my revised essay, she'll think it's utter shit or something lol. i also don't want to have to restart my essay over a silly mistake. this college class is incredibly frustrating sometimes :/",
                  "author": "pokemyiris",
                  "created": 1632328344,
                  "upvotes": 1,
                  "replies": {
                    "hdv1ubz": {
                      "link": "/r/college/comments/pt9q3q/accidentally_plagiarized_when_making_an_essay/hdv1ubz/",
                      "text": "Just resubmit it and ask for an honest (professional) criticism of it. \n\nIf she's being rude or spiteful in her grading, contact your program director.",
                      "author": "BarIntelligent9156",
                      "created": 1632328541,
                      "upvotes": 5,
                      "replies": {
                        "hdv39iv": {
                          "link": "/r/college/comments/pt9q3q/accidentally_plagiarized_when_making_an_essay/hdv39iv/",
                          "text": "thanks for the help, i'll have to see what happens i guess. apart of college is stressing like fuck over something out of your control, am i right lol",
                          "author": "pokemyiris",
                          "created": 1632329112,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hdusnc3": {
          "link": "/r/college/comments/pt9q3q/accidentally_plagiarized_when_making_an_essay/hdusnc3/",
          "text": "oh okay, thanks for the comment",
          "author": "pokemyiris",
          "created": 1632324809,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054887
}