{
  "sid": "rfh1o2",
  "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/",
  "title:": "My final that was scheduled today never happened and I don't know what to do.",
  "text": "I've been studying for this final hardcore for the past 3 and 1/2 days and probably only got 5 hours of sleep. This final was scheduled at 8 a.m. which is about an hour and a half earlier than our usual time that we take quizzes. This class is virtual by the way.\n\n8 a.m. comes and no final. After 10 minutes I email my professor and get no response. 35 minutes later I email them again and get no response.\n\nIt's now been an hour and a half since the scheduled time on the schedule day and I don't know what to do.\nI tried looking for the teaching assistant but he doesn't have an email listed to contact him. \n\nWas just wondering if anyone else had this happen to them and what they did because I really really need to take this final.\n\nUpdate: it was because of technical issues and he sent out an email saying he was sincerely sorry and that the exam will be open all day but the 2-hour test time is still there. I took the test and got a 76 on it which I was extremely happy about. He sent a message to me saying he was sincerely sorry for the inconvenience and stress he caused everybody and he will be adding bonus points on top of that.",
  "author": "SaltyD-Dog",
  "created": 1639405999,
  "updated": 1639515961,
  "over_18": false,
  "upvotes": 837,
  "upvote_ratio": 1.0,
  "comments": {
    "hodty7z": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hodty7z/",
      "text": "This happened to me once, but with a research paper we had to hand in regular updates to talk about with him in sessions... the teacher died the day I wrote an email about having another session.\r  \nMy best advice is to contact the office, in case something happened, and any of the other student you may have contact with.",
      "author": "valenme96",
      "created": 1639406884,
      "upvotes": 642,
      "replies": {
        "hodv4uk": {
          "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hodv4uk/",
          "text": "Alright thanks. I hate the class but hoping that's not what happened.",
          "author": "SaltyD-Dog",
          "created": 1639407411,
          "upvotes": 229,
          "replies": {
            "hodvxif": {
              "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hodvxif/",
              "text": "Yea, in all likelihood there is some sort of emergency. As I'm sure you've already done, make sure you got the date and time for the exam correct. Otherwise, send an email to the relevant office and try not to stress too much about it -- not posting a scheduled exam is an extenuating circumstance which should not reflect on the students grades.\n\nGood luck, and I'd love an update for what ended up happening to satiate my curiosity :)",
              "author": "bummy_mans",
              "created": 1639407765,
              "upvotes": 120,
              "replies": {
                "hoe3jx3": {
                  "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hoe3jx3/",
                  "text": "Just a technical issue on his part took it going to 76% which I am very happy with",
                  "author": "SaltyD-Dog",
                  "created": 1639411002,
                  "upvotes": 107,
                  "replies": {
                    "hof3srp": {
                      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hof3srp/",
                      "text": "Nice job! Glad everything turned out ok.",
                      "author": "bummy_mans",
                      "created": 1639425415,
                      "upvotes": 16,
                      "replies": {}
                    }
                  }
                },
                "hog6po8": {
                  "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hog6po8/",
                  "text": "I had a professor once who didn't open a dropbox for an assignment on Blackboard by the time it was due. It was an online class so all of us students just posted on the message boards and chatted with each other about the situation. We all emailed the professor about there not being a dropbox and then, the next day, several of us called the department office and got no info. Days go by, still no communication from our professor and no dropbox. Then, a week goes by and suddenly the professor pops up out of the blue and just says \"Sorry, I was busy with work and forgot to open the dropbox.\" WTF, is this not your job?! She was a lousy excuse for a professor, tbh. I did not leave her a very good review. How do you forget to open the dropbox and then not check your work email for over a WEEK?  \n\n\nHad I been that professor, I would have been very apologetic and probably would have just cancelled that assignment, honestly.",
                  "author": "jovialpineapple",
                  "created": 1639442355,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hodzc8s": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hodzc8s/",
      "text": "Any updates? I hope everything is okay!!",
      "author": "always_rocking",
      "created": 1639409247,
      "upvotes": 130,
      "replies": {
        "hoe3g21": {
          "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hoe3g21/",
          "text": "Yep turns out there was just a technical issue on his part so he allowed access to the quiz all day. I just took it and got a 76% which I am very very happy with.",
          "author": "SaltyD-Dog",
          "created": 1639410958,
          "upvotes": 373,
          "replies": {
            "hoecrct": {
              "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hoecrct/",
              "text": "Good job man!!",
              "author": "1jay_y",
              "created": 1639414665,
              "upvotes": 54,
              "replies": {}
            }
          }
        }
      }
    },
    "hoeayqu": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hoeayqu/",
      "text": "Email the chair of the dept\n\nFirst make very sure you didn’t miss where or how to access the exam in emails or announcements.\n\nWas anyone else in the class able to take the exam ?",
      "author": "PersephoneIsNotHome",
      "created": 1639413968,
      "upvotes": 31,
      "replies": {}
    },
    "hofcd9x": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hofcd9x/",
      "text": "We had this with my professor for our mid-term last semester. He had a stroke that morning.   He ended up dying from it. They’re probably going to waive the exam, but you may be able to press the dean to take the test still?",
      "author": "wolferdoodle",
      "created": 1639428989,
      "upvotes": 6,
      "replies": {
        "hofuouq": {
          "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hofuouq/",
          "text": "Don't worry got it all solved thankfully it wasn't because of a serious issue.",
          "author": "SaltyD-Dog",
          "created": 1639436586,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hoewtnh": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hoewtnh/",
      "text": "We had a prof forget about the final and after another prof noticed (probably because we were playing trashcan basketball somewhat noisily) - the professor was already on a plane to Poland.\n\nThe head of the department took care of it so quickly we didn't even consider complaining to a dean or such.\n\nI imagine your head of department would do the same, but you could always go to the academic Dean or Dean of students if need be.\n\nBTW, we all wound up with a higher grade than we expected.",
      "author": "paulfromatlanta",
      "created": 1639422616,
      "upvotes": 17,
      "replies": {}
    },
    "hofgigm": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hofgigm/",
      "text": ">I've been studying for this final hardcore for the past 3 and 1/2 days and probably only got 5 hours of sleep\n\nJust want to point out this is a horrible practice. Your brain needs sleep to actually memorize all those information.",
      "author": "AcademicDifficulty",
      "created": 1639430675,
      "upvotes": 6,
      "replies": {
        "hofum7q": {
          "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hofum7q/",
          "text": "True but I had to remember like 60 written questions and my memory Works weird so I put all 60 Questions into song and kept on singing until I remembered it. I probably looked insane on the lockdown browser singing.",
          "author": "SaltyD-Dog",
          "created": 1639436555,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hoexvxx": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hoexvxx/",
      "text": "Yes, but our final was on ProctorU. Maybe it's in a different location?",
      "author": "Away_Peak_5054",
      "created": 1639423047,
      "upvotes": 3,
      "replies": {}
    },
    "hog160s": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hog160s/",
      "text": "Lol he should round everyone’s scores up a letter grade",
      "author": "CriticalTulsa",
      "created": 1639439397,
      "upvotes": 2,
      "replies": {}
    },
    "hog86ec": {
      "link": "/r/college/comments/rfh1o2/my_final_that_was_scheduled_today_never_happened/hog86ec/",
      "text": "I feel the stress in your post before the update but glad it worked out mate",
      "author": "stolensharingan",
      "created": 1639443029,
      "upvotes": 2,
      "replies": {}
    }
  }
}