{
  "sid": "q1ufeq",
  "link": "/r/college/comments/q1ufeq/can_i_finish_college_early_without_having_done_ap/",
  "title:": "Can I finish college early without having done AP courses?",
  "text": "Hello.\nI'm from a third world country and me and my family are immigrating to Canada in 2022. I intend to join a college there obviously and I need to know if I can finish college early. Since, in my country, we don't have AP courses, I couldn't take them in high school. So, is there a way I can finish college early in Canada without AP courses? Any advice/response would be much appreciated.",
  "author": "Acrobatic_Koala8454",
  "created": 1633433259,
  "updated": 1634084128,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfgue0r": {
      "link": "/r/college/comments/q1ufeq/can_i_finish_college_early_without_having_done_ap/hfgue0r/",
      "text": "i know in the us they have stuff like clep testing which is getting college credits if you take a test and get over a certain percent. not sure about canada but i’d look for something like that if you’re able to. usually it comes with a small fee tho so be aware of that and make sure it’s able to be transferred over to your college (disclaimer i’m from the us just assuming they have similar stuff there)",
      "author": "BraxtonDupre",
      "created": 1633433936,
      "upvotes": 3,
      "replies": {
        "hfh1hr9": {
          "link": "/r/college/comments/q1ufeq/can_i_finish_college_early_without_having_done_ap/hfh1hr9/",
          "text": "Thanks. Much appreciated.",
          "author": "Acrobatic_Koala8454",
          "created": 1633438179,
          "upvotes": 1,
          "replies": {}
        },
        "hfip3w8": {
          "link": "/r/college/comments/q1ufeq/can_i_finish_college_early_without_having_done_ap/hfip3w8/",
          "text": "I've never seen that system used in Canada.",
          "author": "ResidentNo11",
          "created": 1633463862,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfipj9f": {
      "link": "/r/college/comments/q1ufeq/can_i_finish_college_early_without_having_done_ap/hfipj9f/",
      "text": "The only way to finish university (we don't call it college here - that's a different level of institution) early in Canada is IB or AP credits, which you'd be unlikely to get enough of to cut a full year, given that they can't always be used for prerequisites, or taking full course loads every summer plus heavy course loads some regular terms. It's not worth it to lose work experience and other opportunities for. There's no race you win by being early.",
      "author": "ResidentNo11",
      "created": 1633464041,
      "upvotes": 1,
      "replies": {}
    }
  }
}