{
  "sid": "qnja47",
  "link": "/r/college/comments/qnja47/changing_major/",
  "title:": "Changing Major?",
  "text": " Hello everyone. I have a question. I am struggling to figure out which major in college I should be in. I really enjoy writing, particularly writing my own stories as well as writing about music and film. I recently changed my major to Digital Film and Television Production (the first major I had was Journalism). There are many things I like about the Digital Film major; however, I have really bad social anxiety, so it is making it slightly dreadful at the same time. I also have found that I enjoy creating stories more than the technical aspects of film. I am not sure if I am just super anxious, or if I actually would prefer to be in a creative writing major. My teachers really enjoy my writing and think I have a strong and visual writing style, so I know it would not be a complete shot in the dark to do. I am just really unsure and talking with my advisor isn't helping too much (no offense at all to them of course). Does anyone have any advice or ideas to help me?",
  "author": "KatHasRabies",
  "created": 1636142346,
  "updated": 1636655895,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjgk83b": {
      "link": "/r/college/comments/qnja47/changing_major/hjgk83b/",
      "text": "Why not find out who the profs are for the main courses for creative writing and email them and ask to speak to their TAs about experiences majoring in it? The TAs for a course are usually people who took that course in undergrad (or are still undergrads) so they should be a good source of information on what it's like.",
      "author": "not_impressive",
      "created": 1636142933,
      "upvotes": 1,
      "replies": {
        "hjgm00y": {
          "link": "/r/college/comments/qnja47/changing_major/hjgm00y/",
          "text": "That's a wonderful idea!! Thank you!",
          "author": "KatHasRabies",
          "created": 1636143601,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hjgl00v": {
      "link": "/r/college/comments/qnja47/changing_major/hjgl00v/",
      "text": "Do you know what you want to do after college? Unless you want to pursue a job or hobby that a Digital Film and Television Production major can help you obtain, I do not think you need to put yourself through the stress. \n\n  \nI do not know what majors your college offers, but based on what you like it sounds like creative writing would be good for you!",
      "author": "IwriteIread",
      "created": 1636143228,
      "upvotes": 1,
      "replies": {
        "hjglu32": {
          "link": "/r/college/comments/qnja47/changing_major/hjglu32/",
          "text": "Hello! I think I would honestly like to write. I know I can write as a hobby if I can't make it into a career. I do like the idea of being a writer a lot, but I also love the idea of writing for music or film in general. I'm just not sure what career path that would involve or what major I would need to do. Same for the creative writing aspect as well. I am a lost lamb lol",
          "author": "KatHasRabies",
          "created": 1636143538,
          "upvotes": 1,
          "replies": {
            "hjgpsn4": {
              "link": "/r/college/comments/qnja47/changing_major/hjgpsn4/",
              "text": "Hi! I would be wary of is getting a college degree just to be able to do something as a hobby. College is a lot of money and time.\n\nI would suggest that you do some research into what jobs each of those majors could get you. Or alternatively, you could look up jobs you're interested in and see which majors work for those jobs.",
              "author": "IwriteIread",
              "created": 1636145017,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hjhfhua": {
      "link": "/r/college/comments/qnja47/changing_major/hjhfhua/",
      "text": "While doing things like that for a hobby is one thing, it may be useful to do research to see what jobs could be done with this degree. One that I know of is proofreading for publication companies. While you won't be writing, you can help other people write and guide them in their process. Plus they make bank with around $2000 for a piece of literature.",
      "author": "Confused-Frog75",
      "created": 1636155215,
      "upvotes": 1,
      "replies": {
        "hji22rd": {
          "link": "/r/college/comments/qnja47/changing_major/hji22rd/",
          "text": "Which major are you referring to? (Sorry, I'm a little dumb.) Regardless, this is also a good idea. Thank you!",
          "author": "KatHasRabies",
          "created": 1636165419,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}