{
  "sid": "qu3e88",
  "link": "/r/college/comments/qu3e88/guests_in_dorm_room/",
  "title:": "Guests in dorm room?",
  "text": "So I am going into college fall of 2022. ( I am a senior in high school right now) I am going into a community college that has “housing” instead of dorms. Basically this means that I get my own room but have to share the kitchen, laundry room, and bathroom with three other people. I just need some advice on guests in my dorm room. Can I have guests that aren’t going to said college or not? My boyfriend and I and also my cousin were talking about like sleepovers. My boyfriend is going to the same college as me but he won’t be living there. Any answers or advice would be helpful :).",
  "author": "TopSignificant6534",
  "created": 1636935477,
  "updated": 1637181580,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hknp7kx": {
      "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hknp7kx/",
      "text": "Depends on the college. Just from my experience, the one room classic Dorm styles don't, the more apartment style generally do. But there is no way for Reddit to know, this is entirely your schools call.",
      "author": "Lost_vob",
      "created": 1636935652,
      "upvotes": 5,
      "replies": {
        "hknpi1b": {
          "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hknpi1b/",
          "text": "Yeah I get that, I’ve had many mixed reply’s and it’s stressing me out for no reason at all, I’ve tried searching it up and it gave no answers",
          "author": "TopSignificant6534",
          "created": 1636935779,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hknrijo": {
      "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hknrijo/",
      "text": "Typically yes, you can have guests. It will be listed on your housing agreement. Some schools they have to sign in when they come/leave. Other schools don’t require this. If you are going to have guests over often make sure you and roommates talk about it first and layout the ground rules for the year.",
      "author": "rynpickles",
      "created": 1636936694,
      "upvotes": 3,
      "replies": {
        "hknrrbv": {
          "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hknrrbv/",
          "text": "The thing is I don’t have a roommate, we get our own rooms. I also will be in like a housing situation it’s weird I was just trying to get advice from students who have experience.",
          "author": "TopSignificant6534",
          "created": 1636936808,
          "upvotes": 0,
          "replies": {
            "hknszqc": {
              "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hknszqc/",
              "text": "so it’s a suite? You all have separate bedrooms but share a bathroom, kitchen and living room?",
              "author": "rynpickles",
              "created": 1636937387,
              "upvotes": 2,
              "replies": {
                "hkntmm6": {
                  "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hkntmm6/",
                  "text": "Yes.",
                  "author": "TopSignificant6534",
                  "created": 1636937687,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hknsjvh": {
      "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hknsjvh/",
      "text": "It'll vary by school and even dorm, but at my alma mater, guests were allowed with permission from roommates for a maximum of 3 days at a time.",
      "author": "mrbmi513",
      "created": 1636937178,
      "upvotes": 2,
      "replies": {
        "hkntnk2": {
          "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hkntnk2/",
          "text": "Hope that’s the case!!",
          "author": "TopSignificant6534",
          "created": 1636937699,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkot8lj": {
      "link": "/r/college/comments/qu3e88/guests_in_dorm_room/hkot8lj/",
      "text": "at my schools guests are allowed in dorms as long as they are signed in and out when they arrive/leave, the only thing for u is to see your schools policy and let your suite mates know that you would have company that way you guys can make an agreement",
      "author": "Wise_Personality8592",
      "created": 1636955705,
      "upvotes": 1,
      "replies": {}
    }
  }
}