{
  "sid": "q2at5y",
  "link": "/r/college/comments/q2at5y/instructor_input_welcome_am_i_being_a_nuisance_to/",
  "title:": "[ Instructor Input Welcome ] Am I being a nuisance to my professor by emailing?",
  "text": "I will try to make this brief. I just turned 25 and I have been in college since 19. I am still working on my Bachelor's. I had to take several semesters off / drop them because of mental health. This past summer I was diagnosed with ADHD and have gotten medication for the first time in my life. College has been my only school setting as I was religiously homeschooled. I am very anxious and shy and typically do not contact professors, but this semester I'm trying really hard to reform my entire way of learning and communicating.\n\nThe first day I emailed all my professors explaining my situation and at the time I was in the midst of accommodation considerations so explained that I wasn't asking for any unfair advantages, just wanted to be proactive and establish a line of communication. I let them know up front how new this is for me and what I struggle with. For my professor for 2 courses, I send him probably 2-3 emails a week. These are usually lengthy because I don't want to double email so I combine questions for both courses and label my emails as such. I always rewrite and stay on point to make the length as short as possible. I'd say probably like 2 paragraphs per topic and then an ending statement for overall questions. Sometimes it's about lecture interests, sometimes it's about course logistics. I always try to look at the syllabus before I become redundant and look idiotic. \n\nI mentioned once before I felt like a bother to which he said no, but my email tonight included more about my exam anxiety and feeling like a failure before we've even done exams. I realize the error of my studying ways and will 100% improve my habits for the rest of the semester, but I wanted to know if I were to not do too well (say C or even D if I really am that dumb) would I still be able to attain my goals if I improved right now.\n\nI just need to know if because he's aware of my disability he feels the need to coddle an annoyingly communicative student. I do sometimes include a joke or two in my email, and I also always make sure to say he doesn't have to respond right away. I refer to him professionally and end my emails cordially even if I am less formal in the body. I know he has a life and family and try to make it so it shows I respect him, value his input, and recognize that my emails are text heavy. I recognize him as a respectable and fun instructor and not as a buddy or my personal google and try to make sure my emails reflect that. I just feel like he feels pressured to engage with me because he always sends emails back within 24 hours and they're always very thorough in response.\n\nI would really love any thoughts from instructors or TAs or just anyone.",
  "author": "JustFuckinTossMe",
  "created": 1633485832,
  "updated": 1634083754,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {}
}