{
  "sid": "r5qyjw",
  "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/",
  "title:": "I'm graduating with my associates of arts degree in May. What can I do with it? I'm aware it's basically useless so be kind lol",
  "text": "Just like the title basically. I've been trying for years to get my associates. Not because I don't make good grades but because I had two kids back to back and I've been obviously distracted and it's taken me way longer than it should have. I should have gotten it literally 6 years ago. But I also went to university twice to try to obtain a bachelors and then dropped out and went back to community College to finish the associates I'm almost finished with. My credits are all over the place but I need 4 more classes to have an associates of the arts degree so I'm just finishing that next semester so I'll graduate in may. \n\nSo I guess my main question is what, if anything, can I do with it? I've heard it's basically useless and like a step above a high school diploma and maybe looks good on a resume. I have two kids. I'm 26. I really don't want to be in school for two or more years to get a bachelors but it looks like that's probably going to be my best bet if I really want a good job. But if there is ANY kind of work I can get with a AA degree please let me know. I could even work part time and still work towards a bachelors if I have to. \n\nPlease be kind and not too harsh. I already know an AA means practically nothing but for me it's an accomplishment because I've had people tell me I'd never finish and I'm almost there. I'm so close.\n\nAlso, if I do go for a bachelors, what are some good solid programs to major/minor in? My strong subjects are English, Literature, and Writing. I also have an interest in Criminal Justice and Psychology.. Thanks!\n\nAlso I'm aware I'm older and should have already had a career by now. But life got in the way. I'm really trying.",
  "author": "ladylavenderrrr",
  "created": 1638289471,
  "updated": 1638480483,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmonzf9": {
      "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmonzf9/",
      "text": ">I'm aware I'm older and should have already had a career by now. But life got in the way. I'm really trying.\n\nFirst off, let's be clear. You're on your own timeline. I dropped out for the third time at 26, and I'll graduate with my Masters at 31 in Spring 2022. Anyone that tells you anything else can go fuck themselves.\n\nAs for the \"what can I do with it\"? Shows ambition. Two kids and full time school? That's the kind of employee I want. Many places take that as a first step to entry level \"work a day\" jobs. The kinds of jobs where you won't get ahead, but it will put food on the table under a roof.\n\nIf you want to continue your education can certainly do so. Universities are far more forgiving of older students. What kind of work do you ultimately want to do?",
      "author": "SamSeebourne",
      "created": 1638292927,
      "upvotes": 3,
      "replies": {
        "hmp0rtp": {
          "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmp0rtp/",
          "text": "The thing is, I'm not really sure what work I want to do. It's annoying.",
          "author": "ladylavenderrrr",
          "created": 1638297952,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmqe2q8": {
      "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmqe2q8/",
      "text": "I think you're looking at this wrong.\n\nA degree is not a job. A degree is an indication that you learned something in some field.\n\nIf you are concerned with \"a good job,\" I'd work backwards: \n\n* what is a \"good job\" to you?\n\n* what careers are you interested in?\n\n* what are the requirements to enter that job?\n\nAnswer these questions. For most careers that are high-paying (going to guess that this is what you mean by \"good job\"), you will either need a content-specific 4-year degree or more, or just a 4-year degree in general.\n\n> Also, if I do go for a bachelors, what are some good solid programs to major/minor in?\n\nThere is really no such thing. You can major in Computer Science and hate it, learning nothing and not being able to pass technical interviews for job placement. You can also major in English, work hard, network, and find an amazing job in publishing. It's all about what you *want* to do and expect out of the experience.",
      "author": "kingkayvee",
      "created": 1638318323,
      "upvotes": 2,
      "replies": {
        "hmqmsqz": {
          "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmqmsqz/",
          "text": "Ugh. This all sucks.",
          "author": "ladylavenderrrr",
          "created": 1638322243,
          "upvotes": 0,
          "replies": {
            "hmqnf9h": {
              "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmqnf9h/",
              "text": "Well, that's not a good attitude to have... :)",
              "author": "kingkayvee",
              "created": 1638322527,
              "upvotes": 1,
              "replies": {
                "hmr3ww3": {
                  "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmr3ww3/",
                  "text": "Honestly I just wanna own my own thrift store. How do I do that?",
                  "author": "ladylavenderrrr",
                  "created": 1638329995,
                  "upvotes": 1,
                  "replies": {
                    "hmr4ktt": {
                      "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmr4ktt/",
                      "text": "Have a business plan and speak to business advisors and a bank for a loan. You don't need college to start a business. \n\nGood luck!! It won't be easy, but if it's what you're interested in, I'm sure there are some resources available online that discuss it.",
                      "author": "kingkayvee",
                      "created": 1638330307,
                      "upvotes": 1,
                      "replies": {
                        "hmr6job": {
                          "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmr6job/",
                          "text": "I have student debt I need to pay off first before I think of taking out any more loans. But okay! Yes it is what I'm interested in. I used to have an online thrift store but I stopped cuz I was too busy with other things. But I did well!",
                          "author": "ladylavenderrrr",
                          "created": 1638331255,
                          "upvotes": 1,
                          "replies": {
                            "hmr7ozp": {
                              "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmr7ozp/",
                              "text": "Definitely include that in your business plan. Start small - maybe you can go back to online, build your brand, and then go from there.\n\nYou may benefit from subreddits such as /r/StartBusiness , etc (I randomly just found that one, no idea if it's any good). They'd be able to provide more valuable info than academic subreddits :)",
                              "author": "kingkayvee",
                              "created": 1638331813,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hmr3umg": {
                  "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmr3umg/",
                  "text": "I'm really trying dude.",
                  "author": "ladylavenderrrr",
                  "created": 1638329965,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmp4anm": {
      "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmp4anm/",
      "text": "Influencer?",
      "author": "GenXtreme1976",
      "created": 1638299355,
      "upvotes": 1,
      "replies": {
        "hmpfuh6": {
          "link": "/r/college/comments/r5qyjw/im_graduating_with_my_associates_of_arts_degree/hmpfuh6/",
          "text": "Can you tell me more about what that means?",
          "author": "ladylavenderrrr",
          "created": 1638303976,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}