{
  "sid": "rehdqp",
  "link": "/r/college/comments/rehdqp/can_i_take_classes_for_the_major_i_plan_to_change/",
  "title:": "can i take classes for the major i plan to change to before the change is made official?",
  "text": "i plan to change my major from animal science with a wildlife focus to wildlife biology. some of the classes i take now already overlap with classes i will need to take for my new major. now, i can take a math and biology class for that major and unenroll from the classes for the other major in order to be back on track for that major by next spring. \non my schools website it says:\n“The change in major within an academic unit begins with the academic advisor. Next, approval must be secured from the department head to which the transfer is being made. Final approval must be secured from the College Dean where the student is enrolled and the College Dean where the student is transferring. Changes must be recorded on the proper form, and the entire form must be deposited in the Registrar’s Office for final processing and distribution. Students who wish to change their majors must make the changes two weeks prior to preregistration.”\n\npreregistration for classes for the spring semester obviously ended a while ago, but i still want to start these classes asap so i dont waste time. my advisor is also still able to change my classes at this time, and there are openings for my courses. i also wouldnt be able to meet with the dean until classes start in the spring anyway. i want to take these classes so entering next school year, i’ll be newly declared and taking the right courses. do you think i should ask my advisor to enroll me in the math and biology class and then withdraw from the class for my old major when classes start and everything is approved? i plan to call the school and my advisor monday to ask about the process since we are told to wait until the spring to change majors anyway. i do not see why the deans would deny my change of major. im a freshman and unsure what path to take.",
  "author": "pinkfleurs",
  "created": 1639284666,
  "updated": 1639516578,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hob0gzp": {
      "link": "/r/college/comments/rehdqp/can_i_take_classes_for_the_major_i_plan_to_change/hob0gzp/",
      "text": "The only time this would be a problem is if you're trying to enroll in courses or sections that are restricted to certain majors. In those cases - for example, if you want to register for a course that's only open to students in your new major - you'd likely have to go through your new department to get an override approved. But that depends on how these things work at your university, which your advisor will know.",
      "author": "puzzlealbatross",
      "created": 1639348726,
      "upvotes": 1,
      "replies": {}
    }
  }
}