{
  "sid": "r32esq",
  "link": "/r/college/comments/r32esq/grad_school_admissions_with_multiple_colleges/",
  "title:": "Grad school admissions with multiple colleges?",
  "text": "Does anyone know anything about grad school admissions with multiple undergrad institutions?\n\nI dropped out about 5 years ago with an abysmal (\\~1.7 GPA) as a math major halfway through sophomore year (so 1.5 years done) but am now looking into going back in preparation for grad school to fulfill that dream of being a Math PhD.\n\nI've taken time off and fixed my mental health and am doing pretty well (gotten a good job, saved up a lot, gotten engaged etc.) and ready to give this another shot!\n\nI was wondering, if I go back to school to what extent would they care about my old grades after I have the bachelor's from a new college (also in Math)? What if I retake old failed courses?\n\nAm 24 now and in the US by the way.",
  "author": "Sokodler",
  "created": 1637978085,
  "updated": 1638206887,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hm8emtw": {
      "link": "/r/college/comments/r32esq/grad_school_admissions_with_multiple_colleges/hm8emtw/",
      "text": "As someone in her second year of an English PhD program right now, who got a 1.4 GPA her first year of undergrad (so worse than yours!), it’s certainly possible. I also got accepted to three different PhD programs — all with funding — and then two Masters programs as well.\n\nHowever, with that being said, I never got below a 4.0 following my freshman year, I took 18 credits every semester, I repeated/deleted a few classes, and I took summer classes twice — all to fix what I messed up. I ended up graduating with like a 3.7 GPA by the end of undergrad.\n\nGPA isn’t everything, and if you have a strong upward trend from here on out in your grades, you’re not doomed yet. Good test scores and/or letters of recommendation can also help tons. My letters of rec, along with my writing sample and statement of purpose, are likely what helped me overcome my first year of college GPA; although, I’m not sure how important the writing sample is for math programs.\n\nBack then, most professors told me that it’s wise to apply to PhD programs with a minimum of a 3.5. Anything above that is icing on the cake, but anything below that will be difficult to overlook. So, make that your goal; it’s definitely possible.\n\nYou’ve got this!! Don’t let anyone here tell you that you can’t!!! :)",
      "author": "classycapricorn",
      "created": 1637983903,
      "upvotes": 3,
      "replies": {}
    },
    "hm83pq5": {
      "link": "/r/college/comments/r32esq/grad_school_admissions_with_multiple_colleges/hm83pq5/",
      "text": "That old GPA is basically going to be forever tacked onto your overall GPA. Grade forgiveness is a thing where it’s not counted in GPA calculations, but policies vary by college and regardless, ALL grad programs ask for ALL transcripts so they will see it.\n\nThey may have some concerns, as 5 years is long but not too long ago. If you can’t get it forgiven, and if it’s forever stuck in your grade calculations, the honest truth is that it is very unlikely you’ll get into a competitive, useful PhD program. Especially math, those are really competitive.\n\nRetaking old courses would also only cancel them out if you retook it at the same college. The only real chance is if you’re given full grade forgiveness, but a PhD admissions committee will still raise eyebrows for a 1.7 for 1 1/2 years.",
      "author": "maora34",
      "created": 1637978295,
      "upvotes": 1,
      "replies": {}
    },
    "hm890rj": {
      "link": "/r/college/comments/r32esq/grad_school_admissions_with_multiple_colleges/hm890rj/",
      "text": "Have you thought about being an actuary? That’s a respectable field for a math lover. Phd is worth a shot but your past grades might not make that possible.",
      "author": "BlueOcean7987",
      "created": 1637980976,
      "upvotes": 0,
      "replies": {}
    }
  }
}