{
  "sid": "q3mvw1",
  "link": "/r/college/comments/q3mvw1/im_not_sure_if_ill_get_into_one_of_my_dream/",
  "title:": "I'm not sure if I'll get into one of my dream schools or not.",
  "text": "I am applying to three schools, with full sail university as the ultimate backup plan behind those, since they pretty much accept everybody. My dream schools are NYU (Contemporary production and songwriting major), Berklee (Songwriting major). My first backup plan is Purchase college (Studio composition major). \n\nI have a 97.16 accumulative gpa, and I'm seventh in my class of 191. I currently have 25 credits, and I should be earning about 7 more in my senior year. But I'm worried this is not enough. And even if I create great pieces for the required materials and a great essay, I'm just worried I have no chance. Am I in over my head here? Am I dumb for thinking I could get into a school like NYU or Berklee?\n\nI was fairly confident, not to the point of being sure I would get in or anything, but confident until this guy I know just flat out told me that I wasn't going to get into NYU or Berklee. Now I just feel really foolish. \n\nDo you think I have a good chance of getting in, assuming that I'm good at songwriting? Thanks ahead of time for any comments.",
  "author": "lemonheadedloser",
  "created": 1633654559,
  "updated": 1634083569,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfyxrc6": {
      "link": "/r/college/comments/q3mvw1/im_not_sure_if_ill_get_into_one_of_my_dream/hfyxrc6/",
      "text": "Believe in your music.  Some dick told you you can’t get in?  What does he know?  I doubt he’d have a tenth of the chance you have of getting in.  Or, we could give him the benefit of the doubt: maybe he was trying to prepare you for disappointment in case you don’t get in or something, who knows. At any rate, you had the same chance before his remark as you do now. 😂 \n\nYou only have the application fee to lose if you don’t get in those places. And, just applying will make you a better musician, since it will motivate you to practice your craft so you can put your best foot forward in your portfolio and/or auditions.  Getting out of your comfort zone does so so much to help you grow as an artist… I’d tell you to apply even if you knew you wouldn’t get in, just for the experience!  If nothing else, think of it as practice in presenting yourself and your music.  Good luck, I know some Berklee alums and it seems like an amazing school. :D",
      "author": "civis_romanus",
      "created": 1633778561,
      "upvotes": 1,
      "replies": {}
    }
  }
}