{
  "sid": "q7tdxu",
  "link": "/r/college/comments/q7tdxu/what_happens_if_a_professor_dies_in_the_middle_of/",
  "title:": "What happens if a professor dies in the middle of the semester?",
  "text": "So I had this professor last semester for a drawing class. She was a sweet little old lady, and she was in good health and spirits when I last talked to her in May.\n\nWe received a campus-wide email today saying that she passed away today. Some of my classmates in another course were in her drawing class this semester (like actively taking her) and now they're kind of in a weird limbo state where Blackboard says \"Multiple Instructors\" but nothing more. It didn't say that before according to them, and as far as I know there hasn't been anything said about how the class will proceed...\n\nHas anyone ever experienced anything like this before? What happened in your class as a result? I'm gonna keep up with my classmates obviously, but I was just curious as to what different things could happen.",
  "author": "WouldntMemeOfIt",
  "created": 1634190028,
  "updated": 1634588388,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hgle918": {
      "link": "/r/college/comments/q7tdxu/what_happens_if_a_professor_dies_in_the_middle_of/hgle918/",
      "text": "It generally takes a bit for the department to find someone else to take over. The less common the course is, the harder it is to cover. For example, it's a lot easier to find someone to take over a college algebra than an advanced calculus course. \n\nDepending on how unexpected it is, they may be able to just pick up and continue or they may end up having to replan parts of the course. \n\nIf I were in the course, for my own benefit I'd probably just try to keep following the plan the instructor had been following while I waited to see what would happen. Worst-case scenario, I end up a little ahead.",
      "author": "jessamina",
      "created": 1634206029,
      "upvotes": 3,
      "replies": {}
    },
    "hgle0x4": {
      "link": "/r/college/comments/q7tdxu/what_happens_if_a_professor_dies_in_the_middle_of/hgle0x4/",
      "text": "Either other faculty take over the class or they hire an adjunct to do it.",
      "author": "PersephoneIsNotHome",
      "created": 1634205841,
      "upvotes": 2,
      "replies": {}
    },
    "hgu07ky": {
      "link": "/r/college/comments/q7tdxu/what_happens_if_a_professor_dies_in_the_middle_of/hgu07ky/",
      "text": "2 cases I dealt with\n\nprofessor had a heart attack and died in the cafeteria (I had him for 2 classes the year before and was hurt)\n\nthe other was a Econ professor who kept missing class, I was sitting in the chairs office when she would call off work. women (whatever the reason) contract wasn't renewed the next year. Sadly, the department made a big deal about her hiring as since we were a good pre med college she was economics with science (I forget the title).\n\nBoth the other professors took over mandatory until they found someone. I think to finish the semester. and the grades were weird.\n\nI know in the Econ case (yes from yikyak days) the 300 med Econ class kids were begging for As and let them go. And the 100 level kids hated the different expectations in content and exams.\n\nthe other Econ crap show was planned, professor went to fill in the blank Fortune 500 for a better job, and by the time I was told (mid way) new professor was called. it was a favor but still.",
      "author": "enoughstreet",
      "created": 1634365780,
      "upvotes": 1,
      "replies": {}
    }
  }
}