{
  "sid": "ri6xcl",
  "link": "/r/college/comments/ri6xcl/pretty_sure_im_going_to_fail_have_so_much_dread/",
  "title:": "Pretty sure I'm going to fail, have so much dread",
  "text": "I've failed basically everything I've ever touched in this class. I don't think I passed a single assignment. Apparently the final grades will be curved, but I don't know how much. He told one student a 50/100 on the midterm exam wasn't even failing, even though the average was an 83. I got a 42 on that exam. I don't expect to get a better grade on the final (already taken it).\n\nIssues:  \n\n\n\\-Found the course ridiculously challenging, admittedly  \n\n\n\\-Unresolved anxiety/attention issues  \n\n\n\\-General burnout  \n\n\n\\-Full course load\n\nThe latter 3 contributed to me not putting in sufficient time into doing the course work. The first maybe could've been resolved had I made friends, attended office hours, etc. but I after the first few weeks I was too ashamed to really talk to anybody so I just kept telling myself next week would be better.\n\nCan I talk to the professor at all? Is there any recourse for this? There were 3 assignments I didn't turn anything in for, but he has in the syllabus that there are no makeup homeworks or anything. And the solutions are already posted.\n\nIf I fail, how do I dust off my shoulders and move on? I have been such a shit student for the past couple semesters, I hate the feeling. I wanna have a more positive self view. My course load will be lighter next semester so I feel okay going forward. I'm spiraling about what this means for my grad school and career prospects. I am so anxious over this",
  "author": "need_college_advice",
  "created": 1639708618,
  "updated": 1639787562,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hoxi5n5": {
      "link": "/r/college/comments/ri6xcl/pretty_sure_im_going_to_fail_have_so_much_dread/hoxi5n5/",
      "text": "Sometimes the most painful lessons are the ones we learn the most from.  \n\n> but I after the first few weeks I was too ashamed to really talk to anybody so I just kept telling myself next week would be better.  \n\nLearn from that experience. It was an expensive lesson - don't waste it.  \n\n\n> Can I talk to the professor at all?  \n\nSure.  \n\n> Is there any recourse for this?  \n\nOnly if the professor offers some.  \n\n> There were 3 assignments I didn't turn anything in for, but he has in the syllabus that there are no makeup homeworks or anything.  \n\nAsking a Professor to ignore their own formally declared policies rarely ever turns out well.  \n\n> If I fail, how do I dust off my shoulders and move on?  \n\nStart by reflecting on what went wrong, and how you should have handed each of those issues better.  \nDon't ignore this step, and don't short-cut this process of self-reflection.",
      "author": "VA_Network_Nerd",
      "created": 1639756215,
      "upvotes": 1,
      "replies": {}
    },
    "hoxjkv2": {
      "link": "/r/college/comments/ri6xcl/pretty_sure_im_going_to_fail_have_so_much_dread/hoxjkv2/",
      "text": "I don’t foresee any professor being inclined to help you when you’ve had missing assignments and now upset about your grade. Unfortunately, I would just accept that this is the consequence and figure out what you can do better next semester. I found establishing times each week where I go to the library  (same times, same days to build routine), to be most beneficial. This helped w the attention/ anxiety stuff as well for me, bc I’m not home w a bunch of distractions and I know exactly when I’ll be working on things (avoiding the whole “I’ll get up early to do this” or “ I’ll stay up this day to do this” and it getting pushed back more and more). The best way to ease your anxiety, is to just do the stuff you need to do and release its hold on your brain- though I can understand how anxiety can be debilitating a lot of times. Good luck to you!",
      "author": "Hot_tamami",
      "created": 1639756761,
      "upvotes": 1,
      "replies": {}
    }
  }
}