{
  "sid": "rgrpe8",
  "link": "/r/college/comments/rgrpe8/questions_about_an_undergraduate_english_major/",
  "title:": "Questions about an undergraduate English major",
  "text": "I read well and can write fast. I do read a little slowly because of my autism but I can still clearly understand and read what is presented with almost no issue. I love analyzing things. I’m especially good with nonfiction essays and analytical writing. It’s also easy for me to plan a paper given a premise days before I write it. Here’s the one concern I have: I can’t write fiction well. My autism makes it hard to write storylines creatively. I’m better with the technical and formatting side and forming opinions and arguments than being creative. Do you think a bachelors in English may be possible for me?",
  "author": "PM_ME_JOTARO_KUJO",
  "created": 1639546639,
  "updated": 1639787929,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hom2t6d": {
      "link": "/r/college/comments/rgrpe8/questions_about_an_undergraduate_english_major/hom2t6d/",
      "text": "If you’re passionate I can’t see why not\n\nIf you’re concerned about your autism affecting you, they’re will be plenty of support and special considerations just depending on where you go (maybe have a look at what support places have before applying)",
      "author": "Benster981",
      "created": 1639547886,
      "upvotes": 1,
      "replies": {}
    },
    "hop4em4": {
      "link": "/r/college/comments/rgrpe8/questions_about_an_undergraduate_english_major/hop4em4/",
      "text": "I’m not in the U.S (Canada) but I am an undergrad in English Lit. I would recommend looking at the mandatory courses required for an English major at the universities you’re interested in. In my case, most of the courses that I’ve taken have revolved around exactly what you’re saying you’re good at: analysis, forming arguments, etc. The only fiction assignments I’ve gotten were either in elective creative writing courses, or could be substituted with an essay. I definitely think it’s possible for you, so long as you’re passionate (which it seems you are). Hope this helps!",
      "author": "Jayersi",
      "created": 1639604092,
      "upvotes": 1,
      "replies": {}
    },
    "hop52ov": {
      "link": "/r/college/comments/rgrpe8/questions_about_an_undergraduate_english_major/hop52ov/",
      "text": "Yes, it is. Look into professional writing/technical writing programs. Mine is a lot of writing just like you describe. I had to take one lit course and one creative writing course for my degree. I also had to take one design course. The rest are nonfiction writing. I really enjoy scientific and medical writing, so that’s what I tailor all my class to, but there’s a lot of different angles to take my degree.",
      "author": "oblue1023",
      "created": 1639604356,
      "upvotes": 1,
      "replies": {}
    }
  }
}