{
  "sid": "rfuw10",
  "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/",
  "title:": "I'm about to fail my first class",
  "text": "I've always been an honors student, graduated high school with a 4.2, ACT of 27, got a full-ride scholarship at a local community college, and have had a 4.0 ever since... Until this semester. I'm a computer science major and Serverside programming with PHP just completely kicked my ass. As it stands I have an 80%, but once the final project and my missing assignments get put in, it will easily drop me to a D (In this class anything below a 70 fails).\n\nGranted, this won't drop my GPA terribly and I can retake it. But as someone who has always excelled in school, this is really hard to come to terms with. Any advice or uplifting words will help a bunch :)",
  "author": "theauthorofmylife",
  "created": 1639442923,
  "updated": 1639850813,
  "over_18": false,
  "upvotes": 64,
  "upvote_ratio": 0.94,
  "comments": {
    "hogd8en": {
      "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hogd8en/",
      "text": "Take the L, learn from it, and move on. Your life isn’t always going to be filled with perfection. Especially in academics when it won’t matter once you graduate unless you’re pursuing grad school, PhD, med school, etc. nobody will care if you failed a class the same way nobody will care if you passed every single class with an A. Especially as a cs major I’d assume you’re planning to be an swe.. cs is one of the majors where gpa matters the LEAST. Not the words you wanted to hear but words I think you should hear.",
      "author": "kdrdr3amz",
      "created": 1639445347,
      "upvotes": 45,
      "replies": {
        "hogdpsz": {
          "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hogdpsz/",
          "text": "No, I actually love this kind of encouragement. Telling myself it won't matter in a couple of years is how I kept myself sane during high school. I've just always been a perfectionist so during the situation I'll hate myself but I'll be over it in a little bit, especially since I don't think this will hurt my GPA much. I think my main anxieties come from my dad and disappointing him, but that's a whole other story haha",
          "author": "theauthorofmylife",
          "created": 1639445568,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "hoga1j5": {
      "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hoga1j5/",
      "text": "hey! i actually made a very similar post here awhile ago. The best words of comfort i can give is that it does get better! it really does suck and is very eye opening experience especially if you’ve had amazing grades beforehand. \n\nI would see if your college allows “grade replacement” - you retake the class and your new, second grade is the one that impacts your GPA. At my college though, the failing grade is still shown on my transcript. \n\nJust remember you are so much more than your grades. They do not define your life or worth, and this is not the end of the world. See what happened with this class and why your marks weren’t satisfactory to you, and try to change it for future classes! best of luck to you, you got this :)",
      "author": "geniesz",
      "created": 1639443882,
      "upvotes": 14,
      "replies": {
        "hogbiom": {
          "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hogbiom/",
          "text": "Thank you so much! I had actually talked to my counselor a while back about how retaking classes worked and she said you could only retake a class if you got an F, but nothing about if it actually replaces the grade. I'll definitely be talking to her about it soon.\n\nWhat did it do to your GPA? That's my main worry. I tried putting it into a cumulative calculator and it said that even if I get an F instead of a D, I'd have a 3.0 for the semester and it would bring my cumulative down to a 3.7. Does that sound right? I'm really nervous the calculation is off because if my cumulative gets below a 3.3 I lose my scholarship.",
          "author": "theauthorofmylife",
          "created": 1639444564,
          "upvotes": 4,
          "replies": {
            "hogeh9j": {
              "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hogeh9j/",
              "text": "of course! from what ive experienced i don’t think that one grade will take your gpa down below a 3.3! it all depends on the amount of credits it is, and if the grade calculator says that I would say you should be fine. Is it a random calculator or your colleges one? if it’s your colleges gpa calculator (like made by the university) you’ll be okay! if it’s a random calculator I would take it with a little grain of salt because colleges always have weird extra things in place (in my experience). I would ask your counselor and they should be able to give you the most accurate estimate of your new GPA!",
              "author": "geniesz",
              "created": 1639445917,
              "upvotes": 3,
              "replies": {
                "hogf3u0": {
                  "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hogf3u0/",
                  "text": "My college doesn't have its own GPA calculator, unfortunately, but the course is only 3 credits and I have well over 50 cumulatively at this point. From what I've seen my college's grades are pretty straightforward, so I'm hoping that calculation was at least semi-accurate. I did try contacting my counselor earlier today but as per usual, she didn't answer lol",
                  "author": "theauthorofmylife",
                  "created": 1639446205,
                  "upvotes": 2,
                  "replies": {
                    "hogosei": {
                      "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hogosei/",
                      "text": "omg, classic counselor behavior lmaooo :,))) but you’ll be fine!! and so will your GPA!",
                      "author": "geniesz",
                      "created": 1639450555,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hohk0l3": {
      "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hohk0l3/",
      "text": "Tbh? It happens. And it happened to me recently after being a 4.0 student since forever. I think it's such a good thing because you realize how minor grades are and that all that matters is you worked your hardest. All we can do is work our hardest! So if you did that and failed.. well, you couldn't do better and that is a-okay. I have a friend that constantly reminds me it's okay not to be a robot and I wholeheartedly agree with that. A 4.0 literally means PERFECT (not just good) grades. 9/10 times that means other areas of your life are being sacrificed hard. If you are a good friend or you enjoy your hobbies/projects or you're a club officer or you spend a lot of time with family or you volunteer a lot or you have literally any other obligation? You are doing well in MULTIPLE areas of life. In the end I realized that's so much more important to me personally than just a damn 4.0. I'd rather live fully, you know?\n\nBesides, grades used to mean how well you understood the material in the class. It isn't \"I'm smart/I'm dumb\", it should be \"Ah, I didn't understand that material well enough. Next time I should understand it better.\" Works way better when you think of in terms of what you learned. If you got a bad grade, it means you haven't mastered the material. If anything it should be considered a measure what you need to focus on and not what you suck at.",
      "author": "CallMeMae",
      "created": 1639468494,
      "upvotes": 3,
      "replies": {}
    },
    "hohg08g": {
      "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hohg08g/",
      "text": "[removed]",
      "author": null,
      "created": 1639465515,
      "upvotes": 1,
      "replies": {}
    },
    "hoinrts": {
      "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hoinrts/",
      "text": "Don’t sweat it too much and use it as a learning opportunity. I failed two classes at community college, still was able to transfer to the 4-year school I wanted to go to. Got to my 4-year, failed two more classes (2 D’s in the other classes for a semester gpa of 0.5) and ended up on academic probation.\n\n Academic probation was my last wake up call, made all A’s since I had the meeting with my advisor and dean that basically told me it was my last chance. Was able to squeeze out a C+ GPA and graduate with my bachelors. \n\nTook the GRE and went to grad school, just graduated this month with a 4.0 in my masters program. \n\nA few failing grades don’t define you, if anything they can help show your resilience and perseverance. Two traits that employers and grad school acceptance committees LOVE to see. Now you have the option of proving you have those traits by accepting your F or D, learning from it, and getting your academic journey back on track. \n\nIf anything, doing poorly in this class has shown you a weakness that you can work on and improve. For me, i had poor study habits and hated asking for extra help. I started using office hours to have the prof go over material I was struggling with and put the hours into studying that I needed to. It was still tough, but I did it and you can too.",
      "author": "Jdublin",
      "created": 1639494520,
      "upvotes": 1,
      "replies": {}
    },
    "hojsabv": {
      "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hojsabv/",
      "text": "High school is a joke, your grades there meant nothing.",
      "author": "Cletus-Van-Damm",
      "created": 1639510500,
      "upvotes": 1,
      "replies": {
        "hoknypo": {
          "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hoknypo/",
          "text": "Yikes, the 27 college credits I had by the time I graduated high school, 2 honors distinctions and awards, full ride scholarship, and honors college distinctions lead me to disagree. Sorry",
          "author": "theauthorofmylife",
          "created": 1639523422,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hokqftg": {
      "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hokqftg/",
      "text": "I actually think it is good to fail to put things in perspective. College calculus kicked my ass. I made the mistake of getting too far behind and was unable to catch up. When I retook the class, I learned a new way to study and truly understand the material. Also, as someone who excelled, it gave me some needed humility. I needed to experience that failure to take my learning to the next level.",
      "author": "baileybird",
      "created": 1639524512,
      "upvotes": 3,
      "replies": {
        "hokqqj7": {
          "link": "/r/college/comments/rfuw10/im_about_to_fail_my_first_class/hokqqj7/",
          "text": "I was actually thinking the same thing. I didn't understand much of anything from this class, but PHP would be very helpful when I start my career, so maybe it would be best to have to retake. I just hate the thought of a failing grade being on my record, ya know?",
          "author": "theauthorofmylife",
          "created": 1639524646,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}