{
  "sid": "gnfv1w",
  "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/",
  "title:": "Tips on how to raise your GPA as an average student",
  "text": "I technically made the dean's list this semester with a GPA of 3.55. I know for some it may not too high, but as someone who made a post at the end of last semester how to increase my pithy GPA of 2.98, it has been a good reminder that grades are not an accurate reflection of your self-worth.\n\nThis sub has helped me in the past, so I decided to make a post giving some personal suggestions and reflecting on some of the study habits that I adopted this semester.\n\n&#x200B;\n\n1. ***Make a planner or calendar*** with all the due dates from the syllabus. Update this as changes arise. I also make a breakdown of grades for each course.\n2. ***Grind to score well in your first midterm or major assignments.*** They cover the basic topics in the course that later material builds on. My personal opinion is that it sets the expectations for both how you and the professor believe you are going to perform in the course. Furthermore, they are usually comparatively easier & therefore important for courses in which you can only drop 5-8% points to score an A.\n3. Be that kid that ***speaks up in class***. Clearing up doubts as they arise is very important. You will not remember to look it up later. This will help the professor remember who you are (hint: professors like students that are interested in what they teach!)\n4. ***Do the readings when they are assigned.***\n5. ***Review what you do after each class***. Summarise by writing down notes or typing out the important points that you have learned in class (each time) using your own notes, lecture slides, book, handouts, and readings.\n6. ***Go to*** ***office hours,*** and not just before the exams. Office hours are for you to make use of. Ask your silly questions (if you still too shy to ask in a lecture setting) or ask for clarification on what the assignments are. Very important as soon as you feel like you are struggling. t is as simple as saying, that you feel like you are struggling or not doing well you had hoped.\n7. ***Exploit the rubric***. For a majority of the assignments professors layout word-to-word an outline of what they expect from you in the rubric. Follow it!!\n\nI am not going to lie it is a lot of hard work (especially with the fun new challenge of COVID-19 this semester) but just remember most college courses (at least at the undergraduate level) are designed so that the average student can succeed.",
  "author": "QuickObject",
  "created": 1589996198,
  "over_18": false,
  "upvotes": 1391,
  "upvote_ratio": 0.98,
  "comments": {
    "frccho3": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frccho3/",
      "text": "You made Deans List with a 3.55? At my university a 3.6 is required.",
      "author": "YungKai23",
      "created": 1590069486,
      "upvotes": 1,
      "replies": {
        "frcmsh8": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frcmsh8/",
          "text": "it differs from university to university. it is 3.5 at mine.",
          "author": "QuickObject",
          "created": 1590074918,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "frbmak2": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frbmak2/",
      "text": "Probably going to get lost in the comments but thank you.",
      "author": "antant26",
      "created": 1590047382,
      "upvotes": 2,
      "replies": {}
    },
    "frbbs1b": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frbbs1b/",
      "text": "My problem comes from not having a set line between beginning of the semester BS like syllabuses and when the real assignments start coming, any advice for combating that?",
      "author": "ThurstyBoi",
      "created": 1590037875,
      "upvotes": 3,
      "replies": {}
    },
    "frba1px": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frba1px/",
      "text": "I agree with all of this! went from a 2.9 to a 3.7. It takes hard work and dedication but it’s possible :)",
      "author": null,
      "created": 1590036562,
      "upvotes": 3,
      "replies": {}
    },
    "frb7xen": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb7xen/",
      "text": "GO TO TUTORING THE SECOND YOU GET CONFUSED! I tanked my GPA because I stuck out through a chem class that I had no idea what was happening. Get as much help as you can as early as you can.",
      "author": "pandaluver1234",
      "created": 1590035004,
      "upvotes": 3,
      "replies": {}
    },
    "frb6lb8": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb6lb8/",
      "text": "This is really great advice. I teach undergrad students and when students are on the bubble at the end of the semester, I always ask myself \"Did they ever come to office hours? Did they participate? Did they submit their assignments on time?\"\n\nAlso, I always post rubrics for my assignments. I put a lot of thought into how I structure my assignments and what I want students to learn from them. The rubric is essentially a cheat sheet for students that tells them what to pay attention to, which skills are important, etc. I can tell which students look at them and make sure they check the boxes. Those students always do well... because they followed the rubric. Even if a student falls somewhat short, they get more points for trying then students who don't follow the rubric at all.",
      "author": "radicalcartograph",
      "created": 1590034057,
      "upvotes": 5,
      "replies": {}
    },
    "frb5gwb": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb5gwb/",
      "text": "Some really good tips here. After failing out of college few years back, I had a GPA of 1.92 (by getting mostly  C's& F's) and before going  back to school  this semester.  I found this reddit group and used some these tips like the one you offer here.  And  I made my first A's in years. \n\nI alsoreally recommend is doing the extra credit no matter what. Even if you can't complete it but if you can do some of it and turn it in. It helps. I had an 86 in Accounting and did a few extra credits assignments that the professor offered and it got me to 91. \n\nSo I went from a 1.92 to a 2.25, just taking two classes this semester. If I stay on track, I should be at a 3.4 by graduation.  \n\nOn that note, know yourself and how many classes you can handle.  If you are working like me it might be better to take less classes. Although, there are some people like my sister that can handle a full time schedule while working, but I just  can't. So just know yourself. \n\nSome college homework sites like Cengage will offer guided learning (with the homework program you paid for)  and some universities offer virtual tutors to check essays or discussions. USE ALL OF THEM. It really will help.\n\nKnowing when to quit. This helps when you are studying for long periods of time and if you aren't learning anymore and if you're tired, it's not going to help your grades much if you are tired. I used the Pomodoro Method  (I played games during my break) and was able to study for longer stretches of time. I personally recommend Forest app. But it still helps knowing when to say that you are done for the day.   \n\nAll  the other tips on this comment section are pretty good good too. Especially, the one about working hard at the beginning of the semester. \n\nWhile I wish I had used these tips sooner, it's better late than never. \n\nCongrats to anyone who graduated and everyone else hope you have a good next semester!",
      "author": null,
      "created": 1590033213,
      "upvotes": 4,
      "replies": {}
    },
    "frb5acj": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb5acj/",
      "text": "I’m currently in Maymester class so this motivated me to get ahead in class because I wanna get it over with",
      "author": "MysticKnight2110",
      "created": 1590033097,
      "upvotes": 2,
      "replies": {}
    },
    "frb0vbr": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb0vbr/",
      "text": "So common sense.",
      "author": "crystalliite",
      "created": 1590030276,
      "upvotes": 0,
      "replies": {
        "frb18ou": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb18ou/",
          "text": "as the saying goes common sense is not that common and for someone with terrible study habits these are these tips were literally game changing",
          "author": "QuickObject",
          "created": 1590030506,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "frawvhl": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frawvhl/",
      "text": "As a sophomore I had a 2.4 and I just graduated with a 3.22. I just stopped skipping classes. Cliche advise but it worked. Good luck 👍",
      "author": "JAdoubleWHY",
      "created": 1590027911,
      "upvotes": 3,
      "replies": {}
    },
    "fravc3f": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fravc3f/",
      "text": "I dropped out of college with a .8 gpa 1 yr in. Came back and graduated this may with 4.0 on the final semester and pulled my cumulative to a 3.2 with a computer science degree. \n\nBiggest change was showing up to class no matter what. I additionally made sure to stay healthy as possible so i couldnt get sick.\n\nEvery time ive contemplated skipping just 1 day and shown up anyway, the teacher happened to give a pop quiz or drop really important test pointers etc. Every single time so far. I can only imagine what ive missed that 1st time where i would skip a lot and stopped caring etc.",
      "author": "Bmood1",
      "created": 1590027008,
      "upvotes": 5,
      "replies": {}
    },
    "frasce9": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frasce9/",
      "text": "Trying to figure out the work load you can actually handle helps too. I was taking 4-5 classes each semester and getting a B/C average with some As here and there. I slowed down and this past semester I only took three classes and got straight As.\n\nI hate that college has become such a race. You don’t HAVE to finish in 4 years.\n\n(I know this isn’t an option for everyone due to scholarships/financial aid)",
      "author": "peachyypeachh",
      "created": 1590025305,
      "upvotes": 3,
      "replies": {
        "frb2bjv": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb2bjv/",
          "text": "yeah i wish i had taken lesser units my first semester would have really helped make the transition to college so much smoother",
          "author": "QuickObject",
          "created": 1590031182,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fraqlcx": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fraqlcx/",
      "text": "Here's the biggest tip I can offer: make sure you get all of the free/easy points -- we design our syllabus around them.\nLet me explain:\n\nThere are generally two competing concerns when evaluating students. Should we be grading for mastery of content? or should we be grading for effort and improvement? Ultimately, both matter, so on any syllabus there are assignments that are meant to gauge mastery and assignments meant to reward effort. Mastery assignments will often be labs, exams, or major essays. Because we want to prepare students for the real world, these are going to graded by a high standard that tells students what the real benchmark for excellence is; i.e. the grading will be hard. \n\nBut we also want students to be rewarded for their hard work and determination, and we realize that not everyone comes from the same high schools with the same degree of preparedness. For this reason, there are parts of the syllabus designed to reward effort. These are usually attendance, participation, small quizzes, and low-stakes assignments. These are all graded easily.\n\nTogether, these assignments let professors have it both ways. We can grade you harshly on certain assignments to show you what is essential for mastery of content, but we can also reward you for effort and still allow you to finish with a decent grade because of the easier assignments. \n\nWhy am I telling you this? -- to prevent you from making the same mistake as many students who assume that the small, easy assignments are not worth doing. They lose the free participation/low-stakes assignment points, thinking that they will simply do very well on the larger, mastery based assignments. And then they are shocked when they get their grades back on the major assignments and see that the standard for grading these assignments is high, that they couldn't get an 'A,' and that now their final grade is going to be a 'B,' or even a 'C' because they skipped the easy work.\n\ntl;dr  Get all of the easy points on the syllabus. They are designed to mitigate the tougher grading on major assignments.",
      "author": null,
      "created": 1590024322,
      "upvotes": 8,
      "replies": {}
    },
    "fraqbrg": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fraqbrg/",
      "text": "If your professor posts slides the night before lecture, read through them that night! It helps me retain information and find portions of the lecture where I really need to pay careful attention to the professor’s explanation. Even a very brief skim will help in this regard, but the more in depth the better!\n\nEdit: still helps with online classes, albeit a little less because you can always rewind",
      "author": null,
      "created": 1590024176,
      "upvotes": 3,
      "replies": {}
    },
    "frapz18": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frapz18/",
      "text": "Office hours are the most under-utilised resource undergrads are provided. Both with their TAs and their lecturers. It's essentially 1 hr of private tutoring. For a TA that is typically *at least* $60/h, for a lecturer anywhere from $120-400/h (my rough estimate) privately. And students get it for free, each week, and they know their teaching team is reasonably competent. I usually spend my office hours checking emails or working on my PhD because no one ever shows.",
      "author": "PsychPhDBrah",
      "created": 1590023977,
      "upvotes": 3,
      "replies": {}
    },
    "fral0xp": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fral0xp/",
      "text": "This is a great post! I'm a president list student and I definitely recommend actively participating. The professors will remember your name and they will bump your grade up at the end of the semester if you're very close to another grade letter. I needed 3 letters of recommendation for a foreign exchange (which got cancelled 🙄) and it was really easy! Just sent my 3 favorite professors an email with information about me/the program and they were happy to write one :)",
      "author": null,
      "created": 1590021221,
      "upvotes": 2,
      "replies": {}
    },
    "frafoaa": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frafoaa/",
      "text": "I have a 2.9 GPA right now I'd kill to get a 3.2 lol. My GPA got screwed by a teacher determined to give everyone the lowest passing grade. Still hate him",
      "author": "Cascades2Seattle",
      "created": 1590018238,
      "upvotes": 3,
      "replies": {
        "frb23t7": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb23t7/",
          "text": "try looking up professors on ratemyprofessor before picking classes for the next semester or ask upperclassmen friends for recommendations",
          "author": "QuickObject",
          "created": 1590031047,
          "upvotes": 2,
          "replies": {
            "frb3sdk": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb3sdk/",
              "text": "I looked him up and he had good reviews, he was just a bad teacher for me I guess but I had someone else in the class get the same grade so not sure what happened",
              "author": "Cascades2Seattle",
              "created": 1590032120,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "frad3lh": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frad3lh/",
      "text": "I did AP and IB in high school so I quickly learned all of these tips and by the time I started college, it was already normal to me. \n\nI just finished my second semester of college with a 4.0. This is exactly how it’s done. To add on, don’t be afraid to ask for help! Professors are there to help you out and they definitely will if you reach out early enough. Even ask fellow classmates for help. I’m majoring in something I’ve had background knowledge on so I’m always helping out my classmates as much as I can so they can succeed too. \n\nGood luck throughout your future endeavors OP! And congrats on bringing that GPA up!",
      "author": "microfsxpilot",
      "created": 1590016742,
      "upvotes": 8,
      "replies": {}
    },
    "fracusg": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fracusg/",
      "text": "A 3.55 is a good gpa, depending on what you’re going into. I have that and I’m in finance. This year coming up i plan on 4.0ing both semesters to bring my gpa up to a 3.7. Judging from what I’ve heard and experience, don’t skip class, make sure you know your professor knows who you are, and study hard for exams. I speak quite a bit in class, and there has not been one semester in which at least one class hasn’t been curved for me individually. If they know who you are, you get rounded, etc.",
      "author": "ltggtl",
      "created": 1590016594,
      "upvotes": 7,
      "replies": {}
    },
    "frac3el": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frac3el/",
      "text": "As said in #2, do as well as possible on your first graded test, project, essay. etc. \n\nThis is to form a solid foundation for your GRADE in the class. If you do well initially, you have a SAFETY net of sorts for future assignments/exams.",
      "author": null,
      "created": 1590016129,
      "upvotes": 7,
      "replies": {}
    },
    "fra81bd": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra81bd/",
      "text": "If your professors like you, they’ll want to give you an “A.” Be that student who participates and becomes a bit closer to the professor than the rest of your peers.",
      "author": "WhiteKoala__",
      "created": 1590012929,
      "upvotes": 3,
      "replies": {}
    },
    "fra713x": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra713x/",
      "text": "Additionally, complete the assignments that are worth \\~1%, those numbers add up",
      "author": null,
      "created": 1590012009,
      "upvotes": 6,
      "replies": {}
    },
    "fra5im1": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra5im1/",
      "text": "Office Hours are the biggest way to help your grades imo. I suggest trying to get as much of your hw/assignment done before the office hours before the due date. That way you can get help on the assignment before it’s due. Professors will also recognize you for putting in the effort and that will help you when it comes time for a grade bump at the end of the year or a job recommendation.",
      "author": "CountDeGucci",
      "created": 1590009254,
      "upvotes": 4,
      "replies": {}
    },
    "fra30qx": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra30qx/",
      "text": "Thanks to failing a class in the fall, rn I'm at a 2.48 CGPA. Thankfully, this is just the ending of my first semester, so I'll keep these things in mind come the fall!",
      "author": "AtheaOfAltea",
      "created": 1590007885,
      "upvotes": 5,
      "replies": {}
    },
    "fra2hln": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra2hln/",
      "text": "Sometimes just giving a lot of effort is not enough for an A.",
      "author": null,
      "created": 1590007630,
      "upvotes": -4,
      "replies": {}
    },
    "fra21ph": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra21ph/",
      "text": "My GpA is no where near yours but I’ve literally brought my GPA up from 0.0 to 2.8. \nIf you’re not good at keeping a physical planner use the app I studiez pro! I swear by it.",
      "author": "historyjc",
      "created": 1590007417,
      "upvotes": 15,
      "replies": {
        "fraehno": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fraehno/",
          "text": "I have a question, if you don’t mind, and I hope it doesn’t come across as offensive. How did you get a 0.0 GPA?",
          "author": "Slothfulness69",
          "created": 1590017562,
          "upvotes": 7,
          "replies": {
            "fral33i": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fral33i/",
              "text": "Not offensive I get it. My first semester I took 5 weekend classes and I was working 2 jobs + regularly babysitting. My brother got married and I skipped a couple times and I got so far behind I just gave up.",
              "author": "historyjc",
              "created": 1590021254,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "fral2hb": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fral2hb/",
          "text": "My Study Life is also a good schedule app.",
          "author": "Evster13",
          "created": 1590021244,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fra1cly": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra1cly/",
      "text": "One thing that saved me was i stopped waiting until the week before to start grinding for a test. If you can start grinding two weeks out its a shit load less stress",
      "author": "Xboxben",
      "created": 1590007089,
      "upvotes": 9,
      "replies": {
        "frb1zn1": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb1zn1/",
          "text": "yeah, this is something I want to work more on for next semester. my time management skills still need a lot of work😅",
          "author": "QuickObject",
          "created": 1590030974,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fr9yq5s": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9yq5s/",
      "text": "Another huge tip is to get a head start on the course material. For instance, if you know you have a few difficult classes next semester (especially useful for STEM), summer/winter break is a fantastic time to reach out to the professor and get the textbook name and chapters that will be covered; then start reading ahead and solving problems. This not only puts a lasting impression of you as a student on your soon to be professor, but can actually make challenging classes feel really easy!",
      "author": "pw91_",
      "created": 1590005827,
      "upvotes": 6,
      "replies": {}
    },
    "fr9yfaj": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9yfaj/",
      "text": "also if extra credit is offered do it no matter what.",
      "author": "daddycakes101",
      "created": 1590005686,
      "upvotes": 11,
      "replies": {
        "frb1srj": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb1srj/",
          "text": "every % counts!!",
          "author": "QuickObject",
          "created": 1590030855,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fr9x9b4": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9x9b4/",
      "text": "Generally exams are weighted more, so develop smarter study habits for exams and of course, do all the homework and practice necessary. \n\nI wrote a short article on how to ace exams by going over the three simple fundamentals: practice, memorize, visualize. It helped me go from a B- to an A in one of the most difficult courses offered at my school. \n\n\nhttps://medium.com/@younjoo8/growth-mindset-7899afdea4d0\n[how to ace exams](https://medium.com/@younjoo8/growth-mindset-7899afdea4d0)",
      "author": "chewilee",
      "created": 1590005148,
      "upvotes": 9,
      "replies": {}
    },
    "fr9udhp": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9udhp/",
      "text": "Agreed. My boyfriend talks to the professors before/during/after class, goes to office hours, and makes study guides for everything. He gets straight As every semester. Study guides don’t help me much because it all blurs together and I get anxious trying to talk to professors so I usually end up with a C and a couple Bs with an A in a class I liked.",
      "author": null,
      "created": 1590003822,
      "upvotes": 26,
      "replies": {
        "fr9xql7": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9xql7/",
          "text": "Alright I’ve never heard anyone summarize my experience I literally thought I was the only one with anxiety about speaking to professors",
          "author": "sammi_cries_alot",
          "created": 1590005368,
          "upvotes": 15,
          "replies": {
            "fradz98": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fradz98/",
              "text": "I know this may not help, but they are just people. They have been where you are. Most had bad instructors that they don't want to be. They obviously enjoy their subject area so use that for common ground.",
              "author": "dantheman_woot",
              "created": 1590017270,
              "upvotes": 8,
              "replies": {
                "frax252": {
                  "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frax252/",
                  "text": "Yep. As long as you show up with a modicum of preparation/care, they often appreciate you for being “so ahead of things” even though it was very little effort",
                  "author": "ChildishJack",
                  "created": 1590028019,
                  "upvotes": 6,
                  "replies": {}
                }
              }
            }
          }
        },
        "fraqchn": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fraqchn/",
          "text": "Sounds like your boyfriend is just able to emotionally regulate more effectively than you. You can clearly match his grade performance (you say you are able to achieve an A). If you manage your anxiety you'll likely find your well-being and grades improve.",
          "author": "PsychPhDBrah",
          "created": 1590024187,
          "upvotes": 5,
          "replies": {}
        },
        "frb1o4d": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb1o4d/",
          "text": "this was basically me & this is the first semester in which i did not get any Cs !!",
          "author": "QuickObject",
          "created": 1590030773,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "fr9ubm8": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9ubm8/",
      "text": "I read the material covered by the proffesor BEFORE class. \n\nThat way when they go over it I can mostly take notes on test info, and I'm able to ask questions about the material while it's fresh on my mind. \n\nMade a MAJOR difference in my grades.",
      "author": "kelsybobelsy",
      "created": 1590003798,
      "upvotes": 35,
      "replies": {}
    },
    "fr9u0ph": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9u0ph/",
      "text": "Thank you for this! I’m finishing CC with a gpa similar to your beginning gpa and want to bring it up as high as I possibly can.\n\nI’m a little anxious and insecure but pumped to get the next semester rolling to make myself work and prove myself wrong!",
      "author": "burntchknnugget",
      "created": 1590003657,
      "upvotes": 12,
      "replies": {
        "frachdf": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frachdf/",
          "text": "I believe in you! You sound like you’re aware of the hard work ahead and are ready to take it on. Best of luck!",
          "author": "toobored4you",
          "created": 1590016366,
          "upvotes": 4,
          "replies": {}
        },
        "frb1q5t": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb1q5t/",
          "text": "Good Luck! You got this💪",
          "author": "QuickObject",
          "created": 1590030809,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fr9ssuu": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9ssuu/",
      "text": "To tack on to this \n1. Make sure you understand the notes that you take and not just copy word for word\n2. Make sure you get a good nights rest and eat well. It’s important to take care of your body\n3. Take advantage of the programs your school offers and or make appointments for tutoring.\n\nMy GPA was a 1.9 after my first year in community college and I raised it to a 3.4. It was not easy and it took me 3 years to correct my grades. I am now transferring to a CSU this fall. I’ll end this by saying that if you’re struggling right now it is alright to take less classes or even a semester off.",
      "author": "Stormfl1ght",
      "created": 1590003090,
      "upvotes": 44,
      "replies": {
        "fral4bg": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fral4bg/",
          "text": "It is amazing how prioritizing quality sleep and nutrition helped me.  As it also made me keep on my study schedule.",
          "author": "kananaskisaddict",
          "created": 1590021273,
          "upvotes": 13,
          "replies": {}
        },
        "frb1is2": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb1is2/",
          "text": "yeah these are all great. always put yourself first. your health is in the end more important than your education.",
          "author": "QuickObject",
          "created": 1590030682,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fr9s6sn": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9s6sn/",
      "text": "Out of curiosity, what does being on things such as the deans list do for you?",
      "author": "Moon8983",
      "created": 1590002811,
      "upvotes": 8,
      "replies": {
        "fr9t5px": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9t5px/",
          "text": "Here’s 3 that I can immediately think of: \n\n- Looks good on your resume\n- makes it more likely you’ll graduate with honors \n- helps your application to law school or other post graduate endeavors. \n\nPeople on the deans list at my school also get invited to special events with employers.",
          "author": "toobored4you",
          "created": 1590003253,
          "upvotes": 18,
          "replies": {
            "frbsjvk": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frbsjvk/",
              "text": "Also trying to get more scholarship opportunities",
              "author": "AkwardlyAlive",
              "created": 1590053705,
              "upvotes": 4,
              "replies": {}
            },
            "fra849g": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra849g/",
              "text": "* Looks good on your resume\n\nIn the real world, no one gives a shit. You can have honors, straight 4.0, magna cum whatever, and I will tell you that unless you come from a reputable and prestigious school it won't matter and NO ONE will care. Yes, they will tell you what you want to hear and pat you on the back for being a good boy/gal.\n\nDon't believe me? Ask those with graduate degrees and honors that are still unemployed. College is great for the experience and learning, but skills, applicable knowledge and experience will still squash stupid accolades.\n\nUnless they are looking for a quota or affirmative hire, then don't expect much in terms of what \"looks good on a resume\".",
              "author": "Optimal_Impression",
              "created": 1590012985,
              "upvotes": -10,
              "replies": {
                "frac2nn": {
                  "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frac2nn/",
                  "text": "I am sorry you feel that way about higher education. I have not had this experience.",
                  "author": "toobored4you",
                  "created": 1590016115,
                  "upvotes": 10,
                  "replies": {
                    "frcmfzz": {
                      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frcmfzz/",
                      "text": "This is not how I feel. It's the reality. Higher education is good, but it's not the answer. If you want to follow and work the traditional route, good luck with that as things will take an ugly turn in the upcoming stages of the economy where many will be dealing with increased competition and increased unemployment.\n\nRemember, it's not about what you know. It's about what you can do for an employer and who you know. You can prop up your resume all day, but at the end of the day don't be surprised if you get passed on.",
                      "author": "Optimal_Impression",
                      "created": 1590074745,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fr9t2kw": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9t2kw/",
          "text": "You can put it on your resume.",
          "author": null,
          "created": 1590003214,
          "upvotes": 5,
          "replies": {
            "fr9thxo": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9thxo/",
              "text": "What about if it's at a community college, would people that view your resume still care about it",
              "author": "Moon8983",
              "created": 1590003412,
              "upvotes": 4,
              "replies": {
                "fr9u4ct": {
                  "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9u4ct/",
                  "text": "Yes. Having good grade at a community college is better than having bad grades at a community college. The dean's list shows that you have performed well academicaly.",
                  "author": null,
                  "created": 1590003704,
                  "upvotes": 12,
                  "replies": {
                    "frac7jw": {
                      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frac7jw/",
                      "text": "It also looks better than having bad grades at a good school. It shows you have work ethic and will make the most of your situation. Employers want to see that.",
                      "author": "toobored4you",
                      "created": 1590016202,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "fr9uluy": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9uluy/",
          "text": "Honestly, for me the affirmation of my hard work feels amazing.",
          "author": "kelsybobelsy",
          "created": 1590003932,
          "upvotes": 6,
          "replies": {}
        },
        "fraex1h": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fraex1h/",
          "text": "I put the certificate on my fridge, along with perfect tests lol. \n\nBut also if you have no relevant work experience (like me), then you really have to play up your academic achievements when applying for jobs or internships.",
          "author": "Slothfulness69",
          "created": 1590017807,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "fr9qzyy": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9qzyy/",
      "text": "Also, if you have time in your schedule I recommend taking any classes that you’re confident you would be able to do well in— elective “easy A” classes have been a big help for me in boosting my GPA!",
      "author": "bellabennett",
      "created": 1590002263,
      "upvotes": 17,
      "replies": {}
    },
    "fr9qqcw": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9qqcw/",
      "text": "I dropped out of college the first time with no intention of coming back so I never actually dropped 3 of my classes which basically ruined my GPA. When I decided to go back years later at a community college I had to get it up to a 3.0 so I could transfer to University. Took 3 semesters of getting straight As. Was pretty tough but I did it and now I'm transferring to University in the fall!",
      "author": "conker1264",
      "created": 1590002134,
      "upvotes": 68,
      "replies": {
        "fra338v": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra338v/",
          "text": "Ayyy, congrats! That's excellent!",
          "author": "AtheaOfAltea",
          "created": 1590007918,
          "upvotes": 20,
          "replies": {}
        },
        "fraq4j4": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fraq4j4/",
          "text": "No one will question your resilience, fuck me that is a lot of work.",
          "author": "PsychPhDBrah",
          "created": 1590024062,
          "upvotes": 11,
          "replies": {}
        },
        "frb1d35": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb1d35/",
          "text": "Congratulations! That’s an amazing accomplishment.",
          "author": "QuickObject",
          "created": 1590030582,
          "upvotes": 5,
          "replies": {}
        },
        "frk5lzm": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frk5lzm/",
          "text": "Oh gosh I went through this exact same thing. I was terrified of my advsior at the time and it took me about a year to get up the guts and make an appointment to go back to college. It's taken a LOT of grinding to get my 1.2 GPA at the beginning of last fall to the solid 2.5 it is now. I cried happy tears this morning when I logged into mycampus and saw the good grades I got from grinding. SO worth it. I've got a year left of college (graduating next summer and getting my graphic design certificate next spring, woo!). It was extremely hard to push myself from a 1.2 and over the next year I want to get my GPA up even higher.  \n\nI'm excited for you to be transferring to university in the fall! You did a lot of work and you definitely deserve it after that pitfall.",
          "author": "lejinnster",
          "created": 1590249987,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fr9nits": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9nits/",
      "text": "Not what pithy means but ok",
      "author": "thorppeed",
      "created": 1590000576,
      "upvotes": -5,
      "replies": {}
    },
    "fr9maz2": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9maz2/",
      "text": "On No. 3 Speak up in class. Engage in discussion. Ask questions if things aren't clear. If the instructor thinks you are trying to learn and understand, or just that you are contributing he might be a little more lenient on grading.\n\n7 yeah If you have a rubric, for heavens sake use it. It lays out what you need. It's a literal checklist that I've seen people just ignore.",
      "author": "dantheman_woot",
      "created": 1589999992,
      "upvotes": 68,
      "replies": {}
    },
    "fr9m42v": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9m42v/",
      "text": "I highly recommend grinding at the beginning of the quarter/semester. Sets you up well for the rest of the quarter and frees up study time at the end of the quarter for classes that are more difficult.",
      "author": "kfredabear",
      "created": 1589999902,
      "upvotes": 278,
      "replies": {
        "fra4s02": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra4s02/",
          "text": "Absolutely agree with this. Doing well early on saves on so much stress later on in the semester/during finals",
          "author": "Extremesanta",
          "created": 1590008697,
          "upvotes": 55,
          "replies": {}
        },
        "fradv7r": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fradv7r/",
          "text": "Agreed. I usually head into finals with all A’s, and I definitely still have to study and work hard, but it’s not the panic that my other classmates have who are in danger of failing. I once got a 0 on a final because I messed up the date and missed it, and still got a B in the class, which I can deal with. Its way better to have breathing room during the stressful part of the course instead of during the easy beginning assignments.",
          "author": "Slothfulness69",
          "created": 1590017205,
          "upvotes": 44,
          "replies": {}
        },
        "frakn96": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frakn96/",
          "text": "Put hard work into the easy part of the class, that makes the hard parts easier. It's ironic but true.",
          "author": "shadowcentaur",
          "created": 1590021011,
          "upvotes": 21,
          "replies": {}
        },
        "frb5ux3": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frb5ux3/",
          "text": "Also, if there's a small presentation or assignment that you can choose to do early or late in the semester, always do it early. \n\nFor example, some of my biology classes had one student per class presenting a \"plant of the week\", or had 5 options for a field trip and you had to go on at least one of them. Doing it in the first couple weeks means you never have to think about it again.",
          "author": null,
          "created": 1590033466,
          "upvotes": 9,
          "replies": {}
        },
        "frbdpyx": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frbdpyx/",
          "text": "Good strategy, *but* to the people who *don't have a routine* or have *never* grinded early in the semester - **be careful**, you might burn yourself out early (it has happened to me before).",
          "author": "deaadondo",
          "created": 1590039450,
          "upvotes": 6,
          "replies": {}
        },
        "frck8oe": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frck8oe/",
          "text": "Yup, only reason COVID didn’t destroy my GPA is cause I put in 100 percent before spring break.",
          "author": "NaturesPositive",
          "created": 1590073637,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "fr9m2jx": {
      "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fr9m2jx/",
      "text": "I just graduated from college last weekend, and I agree with all of this, especially engaging with your professors. They are there to help you, and most of the time, they care about students and want them to succeed, so use them! Ask questions, go to office hours, etc.",
      "author": "Kouglove",
      "created": 1589999882,
      "upvotes": 223,
      "replies": {
        "fra886z": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra886z/",
          "text": "Also with human nature it’s impossible to avoid bias, even a positive bias.",
          "author": "MyLike4thAccount",
          "created": 1590013058,
          "upvotes": 38,
          "replies": {
            "fra8alp": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/fra8alp/",
              "text": "For sure",
              "author": "Kouglove",
              "created": 1590013101,
              "upvotes": 8,
              "replies": {}
            }
          }
        },
        "frabb4g": {
          "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frabb4g/",
          "text": "As a prof. I had some students who were on the cusp of that elusive next letter grade or misunderstood an assignment. Guess who gets leniency or an email asking them to clarifiy or redo an assignment? \n\nIt is always the students who show up to class, ask questions, turn their work in on time, etc.",
          "author": "KouNurasaka",
          "created": 1590015622,
          "upvotes": 30,
          "replies": {
            "frabnt8": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frabnt8/",
              "text": "Yeah I think forming good relationships with your professors is super important",
              "author": "Kouglove",
              "created": 1590015853,
              "upvotes": 16,
              "replies": {}
            },
            "frakdqa": {
              "link": "/r/college/comments/gnfv1w/tips_on_how_to_raise_your_gpa_as_an_average/frakdqa/",
              "text": "Yuuuuuup. We have instructor's discretion and we spend it on students who demonstrate that they care and try.",
              "author": "shadowcentaur",
              "created": 1590020865,
              "upvotes": 13,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634051972
}