{
  "sid": "r464xi",
  "link": "/r/college/comments/r464xi/last_2_exams_hold_my_gpa_in_its_shackles/",
  "title:": "Last 2 exams hold my GPA in its shackles.",
  "text": "Currently I'm looking to have 2Bs, 1C, 1D and a F (possibly two Fs) by the end of the semester. I did my best, and I'm studying my ass off for these last few exams. I'm unsure how badly screwed I am GPA wise and I'm hoping I can scrape by with grades like. \n\nMy final 2 exams will honestly determine whether or not I fail Math or pass with a near B. The stress is honestly unbearable, I can barely eat and I have started to get sick just from the thought of not passing them. Does anyone have any advice?",
  "author": "Ardie_BlackWood",
  "created": 1638111609,
  "updated": 1638206803,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmeopbv": {
      "link": "/r/college/comments/r464xi/last_2_exams_hold_my_gpa_in_its_shackles/hmeopbv/",
      "text": "Does your school have any tutors or supplemental assistance programs? That’s what I did when it came time to take Statistics.",
      "author": "ADN2021",
      "created": 1638112619,
      "upvotes": 1,
      "replies": {
        "hmeoxiu": {
          "link": "/r/college/comments/r464xi/last_2_exams_hold_my_gpa_in_its_shackles/hmeoxiu/",
          "text": "We have tutors but all besides Friday in person from what I know at another campus, they are during my math class which sucks and end before I leave it. And my class is a mix of calculus and statistics.",
          "author": "Ardie_BlackWood",
          "created": 1638112730,
          "upvotes": 1,
          "replies": {
            "hmf6ukl": {
              "link": "/r/college/comments/r464xi/last_2_exams_hold_my_gpa_in_its_shackles/hmf6ukl/",
              "text": "Honestly, I would choose to stay after class with the tutors if there was a tutoring session after lecture, and that’s whether I was doing horrible or passing with flying colors for any math class. Have you spoke to your instructors about your performance in their class? Maybe they can point you in the right direction.",
              "author": "ADN2021",
              "created": 1638120476,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmgacvu": {
      "link": "/r/college/comments/r464xi/last_2_exams_hold_my_gpa_in_its_shackles/hmgacvu/",
      "text": "Okay. No reason to be very stressed since most of the damage is already done. If you are a new student or if previous semesters went much better, the damage can be repaired with effort and time. You might want to retake the D and F courses at a community college over the summer and transfer them in. It will be both cheaper and keep you on track to graduate on time.\n\nStudy all the available course material and go beyond that. I would be studying practice exams you can find online from similar courses at different universities too. Being able to consistently get test scores in the high 90s requires you to go beyond the practice work and really understand what you are doing (why it works and why this way) beyond just plugging in numbers.",
      "author": "darniforgotmypwd",
      "created": 1638136239,
      "upvotes": 1,
      "replies": {}
    }
  }
}