{
  "sid": "rgfqbx",
  "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/",
  "title:": "Need help getting out of a BAD college slump. Any advice?",
  "text": "currently in my second year and finishing up my fall semester in like two days. Im currently on academic probation for flunking second semester of freshman year. Starting from like the last few weeks of my senior year of high school I had gotten really lazy and tired with school. I graduated during the pandemic so I finished the last two months of senior year at home. \n\nThis upcoming spring semester will be my first time having in person classes since that March of 2020 when Covid hit the U.S. I thought it was just a case of “senioritis” and that I was just excited to be done with high school and couldnt be bothered to do whatever joke assignments they gave out (Especially since I already got into a school and has a good GPA that could take the hit of one C.) Upon entering freshman year online it was a bit rocky but I passed all my classes with B’s and C’s. There were periods where I had to really push myself to get work done.\n\nI was a Mech E major at the time but spring 2021 I got a huge wave of this same lack of motivation and it got so bad that I stopped caring about everything, I totally flunked and ended up on academic probation. I also realized this major was not for me and changed my major to Information Systems.\n\nI am now in my fall semester of sophomore year and taking my Info Systems gateway courses. Flunked one of my classes, might get a C for two of them (one of which requires me to get a B in order to pass) and one A. I also had this same lack of motivation and focus and had to really push myself to do work. I do enjoy this major and want to continue but I feel so crappy and don’t know how to break out of this. If I end up on academic probation one more time I will be expelled. I really dont know whats wrong with me.",
  "author": "BigEwrldwide",
  "created": 1639511658,
  "updated": 1639865169,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hokbw09": {
      "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokbw09/",
      "text": "I think you’ve pretty much flunked out at this point. This isn’t a college slump, it’s a life slump. You need to take some time and sort out your priorities.",
      "author": "peakfreak18",
      "created": 1639518330,
      "upvotes": 9,
      "replies": {
        "hokiv6f": {
          "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokiv6f/",
          "text": "well, I guess you may be right on re-evaluating my priorities. I only missed passing one of my classes by one exam which I didnt do well in and it earned me a C rather than the B I needed. I just feel disheartened because I tried putting much more effort into this semester but still couldnt push myself to passing all my classes.",
          "author": "BigEwrldwide",
          "created": 1639521230,
          "upvotes": 3,
          "replies": {
            "homzy16": {
              "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/homzy16/",
              "text": "Fear of failure is a pretty powerful motivator. It’s why people keep showing up to jobs they don’t like. If that didn’t motivate you this semester, either you didn’t really want it or you didn’t think you’d face consequences.",
              "author": "peakfreak18",
              "created": 1639572706,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hokoin9": {
      "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokoin9/",
      "text": "I would suggest going to your school’s counseling center. Maybe talking to a counselor can help you find out why you’re unmotivated and how to take steps to be motivated in your classes. You could attempt to take a semester off to take a breather and find your drive again. I understand where you’re coming from with the motivation part but sometimes you have to be the one to push yourself even when you aren’t motivated. Life doesn’t wait for motivation or clear skies. Sometimes you gotta go out in the storm to get things done. Maybe next semester get a study buddy (a reliable one) or change up where you do your homework/studying. If possible, try to finish this last semester strong and try to shoot for success next semester. Not alone in you’re situation though!  Good luck, hope everything works out!",
      "author": "RubberNuggets1",
      "created": 1639523664,
      "upvotes": 6,
      "replies": {
        "hokug4h": {
          "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokug4h/",
          "text": "thank you I'll definitley try it out. I don't know many people on campus since I've been fully online since 2020, so hopefully I will meet people when I go back in person.",
          "author": "BigEwrldwide",
          "created": 1639526313,
          "upvotes": 4,
          "replies": {
            "holdxyv": {
              "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/holdxyv/",
              "text": "You got this regardless! Keep trying and maybe in person classes might be better for your motivation",
              "author": "RubberNuggets1",
              "created": 1639535208,
              "upvotes": 1,
              "replies": {
                "holfko9": {
                  "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/holfko9/",
                  "text": "Thank you for your encouragement, and yes I do think being in person would be better for me because online school has been a bust so far.🤦🏾‍♂️",
                  "author": "BigEwrldwide",
                  "created": 1639535940,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hold5ty": {
      "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hold5ty/",
      "text": "to make you feel better, there are tons of other college students who are in the same boat as you. you aren't the only one who is failing or on academic probation. you aren't the only one who is lost or have lack of motivation. i am also in my second year of college, currently failing this fall semester due to me having a bad case of covid four weeks before the semester ended. i ended up losing motivation and couldn't finish my assignments on time for the final deadline. seasonal depression kicked in not too long ago too so that didn't help.\n\nwords of encouragement? don't take this too hard on yourself. if you need to take time off college, then go for it. there is nothing wrong with taking a few months or even a year off. just have a job and make money on the side for you. if you want to continue college, then i would advise talking to a school counselor for some advice. i know what it feels like to have lack of motivation especially during times like these.\n\ni don't know if you've been virtual or online, but i've been virtual for two years now. it sucks so much. there is no motivation what so ever. i recently started bringing my homework to do in cafe's though and that has helped a lot. getting fresh air helps too. sometimes, we all just need a short break from life. wishing you good luck and motivation for your future classes! we can do this :)\n\np.s. mental health and covid sucks :(",
      "author": "xolovevl",
      "created": 1639534856,
      "upvotes": 3,
      "replies": {
        "holg9oa": {
          "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/holg9oa/",
          "text": "yes I have been online for two years too and it does suck so bad😭. Im glad you beat covid though🙏🏾 I got sick too for the first two weeks of november and ended up submitting a huge paper late. It sucks so much.",
          "author": "BigEwrldwide",
          "created": 1639536247,
          "upvotes": 2,
          "replies": {}
        },
        "hom3i97": {
          "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hom3i97/",
          "text": "[removed]",
          "author": null,
          "created": 1639548318,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hom1juf": {
      "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hom1juf/",
      "text": "As others have stated in the comments it might be depression. There's something called dysthymia(i believe its now called persistent depressive disorder) and it's a mild form of depression but lack of motivation is a symptom. Now I know nothing about your situation or your mental health but I would try to see a therapist.",
      "author": "MojoClassy",
      "created": 1639547129,
      "upvotes": 2,
      "replies": {}
    },
    "hoklu7h": {
      "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hoklu7h/",
      "text": "the solution is to do your shit even when you don’t want to like an adult",
      "author": "bigzim420",
      "created": 1639522495,
      "upvotes": -1,
      "replies": {
        "hokp3ka": {
          "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokp3ka/",
          "text": "that is a lot easier said than done and is pretty dismissive of OP’s valid problems.\n\nI had the exact same issue, I kept failing courses, couldn’t do anything, I would procrastinate so much and I know now that I was avoiding everything and everyone due to my mental health issues. The first thing i would recommend is speaking with a mental health professional (if possible). I ended up having a family emergency and took a couple years off and went back to school at 23 and now am finishing my first semester with a 4.0 gpa. I was way too immature and my priorities were way out of whack. I am now mature enough to take school seriously and i’m in a program I actually care about. \n\nYou are not dumb. There is nothing wrong with you. You’re having a tough time and that is okay. I’m sorry I don’t have any sort of solution for you but I do think it’s important you speak with a mental health professional.",
          "author": "freshestvegetable",
          "created": 1639523919,
          "upvotes": 6,
          "replies": {
            "hokv7co": {
              "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokv7co/",
              "text": "Yea Im going to try and get some help, I currently dont have any diagnosed issues but who knows. Although I will give the person who replied above you the fact that I do need to just do it sometimes, procrastination does kill me sometimes, thank you for your input though I do relate alot to your response I appreciate at least knowing Im not the only one. Sometimes I really does feel like that.",
              "author": "BigEwrldwide",
              "created": 1639526654,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "hokpgwo": {
          "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokpgwo/",
          "text": "If he’s having genuine mental health issues, it really isn’t that simple.",
          "author": "insidetheborderline",
          "created": 1639524082,
          "upvotes": 2,
          "replies": {
            "hokpmw5": {
              "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokpmw5/",
              "text": "i know it sucks but the world doesn’t stop for you when your having mental health issues, no job gives a fuck so why should your job training (school)",
              "author": "bigzim420",
              "created": 1639524156,
              "upvotes": -5,
              "replies": {
                "hokq0ow": {
                  "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hokq0ow/",
                  "text": "Depending on how severe the issue is, it can quite literally be disabling. Depression, bipolar, schizophrenia, etc. are common reasons why people are unable to work and collect disability. Although with OP’s case, he could probably get some help and be successful as not everyone who is mentally unwell is disabled.",
                  "author": "insidetheborderline",
                  "created": 1639524325,
                  "upvotes": 2,
                  "replies": {
                    "hol1lcs": {
                      "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hol1lcs/",
                      "text": "> Depending on how severe the issue is, it can quite literally be disabling\n\nYep. Literally was on disability for a year when my mental health got bad.\n\n Honestly one of the best things I've done, got tested and properly medicated, could afford meds, started enough savings to afford work clothes (admittedly, that was help of family but) and after a few years of working to get settled and stable, went back to school.",
                      "author": "adhdeedee",
                      "created": 1639529587,
                      "upvotes": 1,
                      "replies": {
                        "hol2lwi": {
                          "link": "/r/college/comments/rgfqbx/need_help_getting_out_of_a_bad_college_slump_any/hol2lwi/",
                          "text": "I’m glad it worked out for you. I’m considering taking a semester off to manage my bipolar disorder better, but it’s complicated.",
                          "author": "insidetheborderline",
                          "created": 1639530059,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}