{
  "sid": "q3mqig",
  "link": "/r/college/comments/q3mqig/thinking_about_going_back_to_college_advice_and/",
  "title:": "Thinking about going back to college? Advice and how to find a new career, approach about possibly going back, etc.",
  "text": "Obviously depends with other things I might want to do, but I'm 23 and not doing anything outside working at my part-time grocery job that I have been employed in for two-three years.\n   \nIn May of 2020, I graduated with a journalism degree with not only haven't found the job, but really the motivation to pursue it and have just been stuck. \n  \nIt's hard to explain and it's a combination of maybe my fault for maybe not being more assertive on getting in the best position to what I studied or whatever, but I just don't feel 100% confident and motivated for my degree.\n   \nI still will try as best I can even if I go back to school, but after a talk with my mother about my future, I feel going back to school is a good option where I can give myself another shot at something.\n   \nIt looks like many people do it, but just want to know if there is anything that I can know of and prepare for. At this point, I just want a career that can be stable for my future self and family where I can be fine with what I do and can still enjoy my life outside of work.\n    \nI already think of taking a degree on my dad's profession in respiratory therapy which I know could possibly only take two years and feel it can be a good compromise.\n   \nI just don't like science and in freshman year of college, I actually originally took PT, but changed after my first semester. Still, I'm willing to study Science if I come with better mental focus on my studies and it does seem a bit less Science focused on than Nursing and PT.\n   \nSorry if this is long, but just hoping some relate and give me some advice that I can use.",
  "author": "Freedfromdesire800",
  "created": 1633654014,
  "updated": 1634083570,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}