{
  "sid": "qc9z55",
  "link": "/r/college/comments/qc9z55/writing_paper_tips/",
  "title:": "Writing paper tips",
  "text": "So I'm an older student and this is my first semester of college. Writing papers has definitely been the biggest hurdle for me so far (although I've gotten really good grades on them all so far). For my English midterm I have a 4 page paper on the heros journey.. someone from literature or a movie. I know 4 pages isn't even a lot to some people but it's the longest one I've written so far and I feel like I'm a decent writer but get a HUGE mental block over it. I also feel like I struggle with not sounding repetitive.\n\nAnyway... What are your best tips for writing a paper? It can be anything!",
  "author": "Bug120",
  "created": 1634761207,
  "updated": 1634849293,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hheqlpl": {
      "link": "/r/college/comments/qc9z55/writing_paper_tips/hheqlpl/",
      "text": "Guidelines… Purdue Owl.\n\nPlanning &/or getting unstuck… most school’s have a free writer’s workshop ask your professor or the student resources office.",
      "author": "jplonreddit",
      "created": 1634762879,
      "upvotes": 1,
      "replies": {}
    },
    "hhersdc": {
      "link": "/r/college/comments/qc9z55/writing_paper_tips/hhersdc/",
      "text": "i believe that starting the paper, actually putting the first few sentences down, is the hardest part of the entire writing process\n\ni’m not sure how much time you have to write your paper but if time allows, here are 2 methods i find super helpful:\n\n1. create an outline! don’t worry about writing it with perfect grammar or format. here you can put down different bullet points and some additional evidence/details that support that bullet point beneath it. this really helps to narrow down what you can write about, what information you’re more confident to discuss, which points are weaker/stronger than others, etc\n\n2. office hours and tutoring hours! i’m hoping that your professor has scheduled office hours or is available to schedule a meeting with you. since they’re the individual reviewing and grading your final\npaper, they’ll provide suggestions and ideas that’ll aid you to write a paper they expect to be submitted. i’m not sure which college you attend but, if your school provides free tutoring, i’d definitely take advantage of that. the tutors will sit down with you for about an hour and help you to start and continue your paper",
      "author": "Hannuhs",
      "created": 1634763345,
      "upvotes": 1,
      "replies": {}
    }
  }
}