{
  "sid": "qw2wbg",
  "link": "/r/college/comments/qw2wbg/im_registering_for_next_semesters_classes_i_was/",
  "title:": "I'm registering for next semester's classes. I was overwhelmed this year and I'm supposed to take more.",
  "text": "I'm entirely online due to distance. I signed up for 12 credits, 5 classes for the fall. 16 weeks, this is week 12.\n\nSpring registration opened up today, and I put in my new schedule - 13 credits, 4 classes. According to the pathway for my major I'm supposed to take an elective this semester too, but I think I'm going to take one in the summer instead because 5 classes at once is too much for me.\n\nThe problem is, all of my math classes are asynchronous, they don't have any with Zoom, but math is where I most need a teacher. There are simply no options for that, except attending on campus in person, which is impossible for me.\n\nI live two hours away by car, don't have a driver's license yet, and both my parents work full time. I might be able to take public transportation, but I'd still have to get to a bus station and there's not one in my town. I can't take an Uber or Lyft by myself because I'm a minor. I have no idea how I'm going to teach myself trigonometry and calculus.",
  "author": "Sam-B-L",
  "created": 1637166193,
  "updated": 1637401109,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hl05y78": {
      "link": "/r/college/comments/qw2wbg/im_registering_for_next_semesters_classes_i_was/hl05y78/",
      "text": "Honestly, unless you have a situation with financial aid that requires more classes, taking what you can handle is always better. Better to take a summer class or even graduate late than to get burned out, fail out, or not learn the material that you’ll need in later classes (or your career). See if your college has online tutoring for math also.",
      "author": "begrudgingly_zen",
      "created": 1637166681,
      "upvotes": 3,
      "replies": {}
    },
    "hl0zn1k": {
      "link": "/r/college/comments/qw2wbg/im_registering_for_next_semesters_classes_i_was/hl0zn1k/",
      "text": "Definitely don’t take more classes than you can handle, but look into going to weekly office hours or emailing your professors the first week and saying can I set up regular appointments where I can go over the material with you on the condition that I have reviewed the material before the meeting? \nAlso online tutoring through either your university or see if a local tutor is an option",
      "author": "Seergaze_Cas",
      "created": 1637178314,
      "upvotes": 1,
      "replies": {}
    },
    "hl1q52c": {
      "link": "/r/college/comments/qw2wbg/im_registering_for_next_semesters_classes_i_was/hl1q52c/",
      "text": "Maybe take a gap year.  You can already see this isn't going to turn out well.",
      "author": "GenXtreme1976",
      "created": 1637189159,
      "upvotes": 1,
      "replies": {}
    }
  }
}