{
  "sid": "r4q8l9",
  "link": "/r/college/comments/r4q8l9/is_it_normal_for_a_prof_to_make_an_announcement/",
  "title:": "Is it normal for a prof to make an announcement saying they will not allow a specific disability accommodation?",
  "text": "Professor was willing to give everyone a one time, 24 hour extension on any assignment as per the syllabus. Most of us saved that extension for finals week. It’s one week until finals and now there’s an announcement from the professor saying there will be no 24 hour extensions under any circumstances—not even for disability. My schools disability policy is that professor and student have to discuss first—and then go to disability services for a reasonable accommodation. Accommodation can be made only after disability approves. They mentioned they’ve been behind on grading and most of the TA’s are busy in their personal life right now. I just feel like 24 hours can make a huge difference for students but I’m not really understanding why 24 hours is such a big deal for a prof and their TA’s when they have almost 2 weeks to grade? This prof has been inconsistent with disability accommodations in the past too. Anyone else had a similar experience? Did you say anything?",
  "author": "battyeyed",
  "created": 1638170308,
  "updated": 1639861007,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hmj31e5": {
      "link": "/r/college/comments/r4q8l9/is_it_normal_for_a_prof_to_make_an_announcement/hmj31e5/",
      "text": "That is an issue. I get only allowing extensions in case of accommodations, but by law they must have to give accommodations. Please report it to the Disability Services even if you don’t have accommodations yourself.",
      "author": "Katherington",
      "created": 1638193320,
      "upvotes": 3,
      "replies": {
        "hmj831i": {
          "link": "/r/college/comments/r4q8l9/is_it_normal_for_a_prof_to_make_an_announcement/hmj831i/",
          "text": "That’s what I’m thinking. I do have accommodations. This prof has been inconsistent with them before (lying about the reason they couldn’t initially provide them).",
          "author": "battyeyed",
          "created": 1638195938,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmium0y": {
      "link": "/r/college/comments/r4q8l9/is_it_normal_for_a_prof_to_make_an_announcement/hmium0y/",
      "text": "I do not see any problem with the professor stating they are unwilling to provide students with 24-hour extensions during finals. Being behind on grading or the TAs being overwhelmed has nothing to do with the disability services or accommodations process.",
      "author": "WCCobra",
      "created": 1638188208,
      "upvotes": 2,
      "replies": {
        "hmj7vok": {
          "link": "/r/college/comments/r4q8l9/is_it_normal_for_a_prof_to_make_an_announcement/hmj7vok/",
          "text": "It’s a bit unreasonable though to tell people to not even try going to disability about it though. My schools accommodations on extensions are that it has to be reasonable—usually with a 2 or 3 day extension. Sometimes it can’t happen because of group work which would be impossible in some cases, which would be unreasonable.",
          "author": "battyeyed",
          "created": 1638195835,
          "upvotes": 2,
          "replies": {
            "hmlm1os": {
              "link": "/r/college/comments/r4q8l9/is_it_normal_for_a_prof_to_make_an_announcement/hmlm1os/",
              "text": "[deleted]",
              "author": null,
              "created": 1638231892,
              "upvotes": 1,
              "replies": {
                "hmlz49c": {
                  "link": "/r/college/comments/r4q8l9/is_it_normal_for_a_prof_to_make_an_announcement/hmlz49c/",
                  "text": "It isn’t an exam, it’s a written project. There were four pieces to it. We had all term to use a 24 hour extension and most of us saved it for the last piece during finals. I have an appointment with disability on Wednesday.",
                  "author": "battyeyed",
                  "created": 1638237886,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}