{
  "sid": "r57kl0",
  "link": "/r/college/comments/r57kl0/finalist_for_a_scholarship_have_to_interview_any/",
  "title:": "Finalist for a scholarship- have to interview, any tips?!?! Borderline panicking!",
  "text": "Alright y'all, I am beyond excited for being selected as a finalist for this scholarship opportunity. If I win this it will cover my student loans and finish my degree at my CC. I'm not the kind of person where things happen like this for me- this is huge. My problem lies in the fact that I sound so much clearer in my writing than when I speak. I am a nervous person, I ramble and never manage to make it to the point. \n\nI was told I have 15 minutes to do a zoom interview with the donor and I really don't want to fudge this up. This is the biggest chance I've been given in life and that's not an exaggeration.so I'm naturally terrified of tanking this opportunity. Any advice would be appreciated!!",
  "author": "Soggy-Butterscotch29",
  "created": 1638225222,
  "updated": 1638480577,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmlixwc": {
      "link": "/r/college/comments/r57kl0/finalist_for_a_scholarship_have_to_interview_any/hmlixwc/",
      "text": "If your public speaking skills are weak, I suggest the following:\n\n1. Prepare ahead of time a 60-90 second introduction that covers the basics in response to the instruction to \"tell me a little bit about yourself\": who you are, what you're studying, why you want a career in a certain field, what kind of jobs you envision yourself looking for, and why this scholarship is a good opportunity for you.  By preparing this ahead of time, you'll be less likely to ramble.  Don't make it any longer than 60-90 seconds, because you don't want to take up half the interview just telling who you are.\n2. When the interviewer asks you a question, *pause for 2-3 seconds before answering*.  Yes, a 2-3 second pause will feel like an absolute *eternity*, but it's not.  Use those 2-3 seconds to consider the question and plan what you want to say.  That will help you avoid rambling or giving the appearance that you haven't thought about the topic before.\n3. Above all, remember that *brevity is your friend*.  Your interview is only 15 minutes long, but the interviewer might have multiple questions to ask.  If you launch into a 10 minute answer to a single question, the interviewer won't be able to get through his list of questions, and that might leave him with a feeling of incompleteness or dissatisfaction.  So unless the question appears to be extremely complex and important, try to limit your response to 3-5 sentences, and observe the interviewer while you answer.  After 5 sentences, it should be clear whether the interviewer has heard enough or still wants to hear more.  If the interviewer wants to hear more, then continue.  If not, conclude your answer and wait for the next question.\n4. Prepare at least one question to ask the interviewer.  A lot of these interviews end with \"do you have any questions for me?\"  If you just say no and then go silent, it sometimes comes off as you being disinterested or unprepared.  So be prepared to ask the interviewer something, *anything*, as long as it's logically relevant to whatever you've been discussing.\n5. Try to remember to *look into the camera*, not at your computer monitor, during the interview.  If you look directly into the camera, it will appear to the interviewer that you are making eye contact like you would when talking to someone in person, and this helps to overcome some of the impersonal, artificial feelings associated with video chats.  This is harder to do than most people expect; naturally you're going to want to stare at the screen so that you can see your conversation partner.  But, try to spend at least some time looking into the camera and not at the screen.\n6. No matter how well or poorly you think things have gone, don't forget to end on a positive note by thanking the interviewer for his time.\n\nGood luck!  Hope it works out well for you.",
      "author": "ChemMJW",
      "created": 1638230467,
      "upvotes": 1,
      "replies": {
        "hmnxo8o": {
          "link": "/r/college/comments/r57kl0/finalist_for_a_scholarship_have_to_interview_any/hmnxo8o/",
          "text": "Thank you so much, I genuinely appreciate your response! I plan to spend the day preparing for the interview, again thank you.",
          "author": "Soggy-Butterscotch29",
          "created": 1638282003,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}