{
  "sid": "rdetl3",
  "link": "/r/college/comments/rdetl3/failed_a_class_hoping_i_dont_loose_the_only/",
  "title:": "Failed a class. Hoping I don’t loose the only scholarships I have and heading home tonight to have a Christmas break.",
  "text": "I failed chem 2, partly due to burnout. I took 3 semesters in a row with no breaks, and my burn got so bad for 2 weeks I didn’t do anything but leave my dorm for class and come back to sleep. I feel so pissed and ashamed because my dad is a prof at the same school. How do I tell him I failed chem and not get grilled over my one time to be happy and stop thinking about school. On top of that everybody is depending on me to being happy news, and be my cheery self but damn this college shit is tough. I feel like a little boy even though I’ve been through so much to grow and get myself this far.",
  "author": "deinstag413",
  "created": 1639160161,
  "updated": 1639516693,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "ho143eh": {
      "link": "/r/college/comments/rdetl3/failed_a_class_hoping_i_dont_loose_the_only/ho143eh/",
      "text": "I’m some what of a same boat as you. If feels like you have a chip on your shoulder and you can’t afford mistakes in this moment. For one, take a moment to acknowledge the achievements you’ve done. You’ve made it all the way to college , in a major that requires chem classes (which I know can be difficult), and have been busting your ass for weeks. That’s something most can’t do. 👏🏽👏🏽👏🏽 second , it is unfortunate that you failed a class , and can be very discouraging, but hopefully your parent with accept that you tried your hardest and give you some tough love. Hope this helps at least a little❤️",
      "author": "JacisPlatnium",
      "created": 1639167860,
      "upvotes": 1,
      "replies": {}
    },
    "ho207az": {
      "link": "/r/college/comments/rdetl3/failed_a_class_hoping_i_dont_loose_the_only/ho207az/",
      "text": "Bruh don’t worry I went on academic probation and housing probation my first semester. I lost my scholarship and my parents were extremely mad. I would honestly tell them what you wrote here about being burnt out and ashamed. I would also tell them that you have a plan to do better next semester. (Quick side note: check with your university some offer grade replacements for previous classes. You also might be able to get an unsatisfactory instead of an F if you are concerned about your GPA) Most of my friends even the super smart ones had an extremely bad semester at some point. Stuff like this happens and you learn from it. It took me a while to figure it out. You made it to your 3rd semester a lot of kids drop out after one or two. Honestly I feel like everyone has failed a class at some point it just happens. In a couple years you will look back on this moment and be like I was worried about nothing. It will work out in the end.",
      "author": "Kohldsmoke",
      "created": 1639181082,
      "upvotes": 1,
      "replies": {}
    }
  }
}