{
  "sid": "r4i44f",
  "link": "/r/college/comments/r4i44f/i_failed_calc_2/",
  "title:": "I Failed Calc 2",
  "text": "Hi everyone this is my first time failing a course. I'll admit it I overbooked myself this semester taking a bunch of CS classes, chemistry, and calc 2.  No matter what I tried I always ended up failing the quizzes. The exams are a whole other ordeal. I missed the opportunity to withdraw because at the time I was preparing for my second exam and I thought I could boost my grade up. It turned out to be so wrong. There isn't any way I'll be able to raise my grade to passing at this point let alone a D. I plan on retaking Calc 2 in the summer, so I can focus all my time on it.  I was wondering if anyone had any words of wisdom? I've been really beating myself up here for letting myself slip so much in math. I'm  planning on just giving up on the course at this point. There's no way I can raise my grade. On the bright side most of my other classes are fine.  Is there any point to continue trying in calc 2 knowing that I'll fail no matter what? Thanks!",
  "author": "ItsxAniii",
  "created": 1638143997,
  "updated": 1638206754,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.81,
  "comments": {
    "hmh2jld": {
      "link": "/r/college/comments/r4i44f/i_failed_calc_2/hmh2jld/",
      "text": ">Is there any point to continue trying in calc 2 knowing that I'll fail no matter what?\n\nYeah, the more you apply yourself now and understand the material then you'll have a good understanding in the summer when you retake it and it'll be easier. You'll be ahead of everyone else since you've already taken the class and know what to expect on homework, quizzes and exams.\n\nI'm also a CS major and failed two math classes myself, and I also made the mistake of taking two math classes at the same time while undertaking 5 more classes and a full time job. Took an L on them and took them the next semester and breezed through them.",
      "author": "ShadowIG",
      "created": 1638148336,
      "upvotes": 3,
      "replies": {}
    },
    "hmh2qxr": {
      "link": "/r/college/comments/r4i44f/i_failed_calc_2/hmh2qxr/",
      "text": "You need calc 2 to be a CS major. Don't stop taking it until you pass",
      "author": "elkfn2",
      "created": 1638148429,
      "upvotes": 3,
      "replies": {}
    },
    "hmhf02c": {
      "link": "/r/college/comments/r4i44f/i_failed_calc_2/hmhf02c/",
      "text": "ALOT of people fail calculus 2, dont feel bad. It's a weeder course, its purposely made as a difficult hurdle to thin the herd. \n\nForgive yourself, and take it again. This time don't underestimate Calculus 2 and take EASY courses adjacent with it (Regardless of if you know the material it will still be a challenge).",
      "author": "New_Demon24-7",
      "created": 1638154002,
      "upvotes": 3,
      "replies": {}
    },
    "hmh4lf7": {
      "link": "/r/college/comments/r4i44f/i_failed_calc_2/hmh4lf7/",
      "text": "Just take the calc 2 final exam that way you will know what the test will look like when you retake it",
      "author": "GoldRequest",
      "created": 1638149274,
      "upvotes": 2,
      "replies": {}
    }
  }
}