{
  "sid": "qfh3dj",
  "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/",
  "title:": "Should I withdraw from a class I will get a D in?",
  "text": "Preface: I am in community college, so the cost is bad but not impossible to make up. \n\nSo I am doing poorly in several classes for several reasons, (I had very little motivation to move forward with school until maybe a week ago and not a lot of free time) and today is the last day to withdraw without academic penalty. I won't get a refund, but I won't get a failure either. I did a quick calculation of two of my classes and with more effort and realistic good grades I can easily score a D. Is that even worth it? Should I drop one or both of these classes anyway and try again next semester or should I try and stick it through for a D? (I don't think my GPA will fare well with D's, but I also don't know how much they will hurt). I would talk to my academic advisor about this but they have been unavailable for the past several days and so I need to make this decision without them.",
  "author": "papaboynosmurf",
  "created": 1635169557,
  "updated": 1636175237,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 1.0,
  "comments": {
    "hhzibub": {
      "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hhzibub/",
      "text": "IMO, look up what your school requires passing. I know for many of my community college classes you need at least a C to get the credit, which if unobtainable means that this withdraw day would be the best.",
      "author": "Mushy-froug",
      "created": 1635170410,
      "upvotes": 5,
      "replies": {
        "hhzifam": {
          "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hhzifam/",
          "text": "I hadn’t considered that, I will try to find that information",
          "author": "papaboynosmurf",
          "created": 1635170454,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhztafd": {
      "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hhztafd/",
      "text": "yes, W is better than D",
      "author": "ghostmode342",
      "created": 1635175280,
      "upvotes": 2,
      "replies": {
        "hi13ghc": {
          "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi13ghc/",
          "text": "Does a W affect your gpa?",
          "author": "JadeCaldera",
          "created": 1635194017,
          "upvotes": 1,
          "replies": {
            "hi28fx9": {
              "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi28fx9/",
              "text": "If you end up failing it generally does, but I think it doesn't if you pass, though it probably won't count towards any requirements (gen eds, degree requirements)",
              "author": "ogorangeduck",
              "created": 1635212231,
              "upvotes": 2,
              "replies": {
                "hi28jsl": {
                  "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi28jsl/",
                  "text": "Thank goodness. I dropped a class at a C because I hated it.",
                  "author": "JadeCaldera",
                  "created": 1635212278,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhzne2k": {
      "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hhzne2k/",
      "text": "Usually they will let you retake courses you get a D in and replace them for the new grade. For me personally when I was failing a course I just withdrew and retook it the next semester.",
      "author": "kdrdr3amz",
      "created": 1635172732,
      "upvotes": 1,
      "replies": {
        "hhznqbc": {
          "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hhznqbc/",
          "text": "So it seems like I’ll end up redoing it either way, so it’s really if I want to withdraw and redo or do as well as I can and redo if it isn’t satisfactory",
          "author": "papaboynosmurf",
          "created": 1635172876,
          "upvotes": 1,
          "replies": {
            "hhzv9qo": {
              "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hhzv9qo/",
              "text": "And tbh since you’re in CC it’s even more chill. I had 3 Ws when I transferred and it didn’t impact my admissions I would say. Just make sure it’s not a repeated W on the same course. If you do have that you’ll need to explain yourself in your essays. So don’t sweat it.",
              "author": "kdrdr3amz",
              "created": 1635176119,
              "upvotes": 1,
              "replies": {
                "hhzvxjc": {
                  "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hhzvxjc/",
                  "text": "Okay. I think I’ll try and do what I can and then retake them later. Thanks for the advice!",
                  "author": "papaboynosmurf",
                  "created": 1635176393,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhzjzde": {
      "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hhzjzde/",
      "text": "Look at a GPA calculator to how it may affect your GPA.\n\nYou should really try to stick it out, but if loss of money and delayed graduation is not an issue, then by all means drop and retake them. D’s get degrees too. \n\nAn alternative option could be to stick the course out anyways, and if you don’t feel satisfied afterward you can always retake the class another semester. This way you still give yourself the opportunity to decide whether you want to graduate on time or not.",
      "author": "kizeltine",
      "created": 1635171177,
      "upvotes": 1,
      "replies": {}
    },
    "hi00y42": {
      "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi00y42/",
      "text": "Depends on professor. Some may be willing to give you a happy ending(meaning if you can demonstrate on the final exam, that you learned the material or another professor put it as your “level of give a damn is high”.  , then they’d be willing to up that D to a C, and that’s the end of the story (a.k.a leave me alone says professor).",
      "author": "jameskishtok",
      "created": 1635178443,
      "upvotes": 1,
      "replies": {
        "hi014ov": {
          "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi014ov/",
          "text": "Interesting. One of them I don’t think will but the other is pretty generous. I think my current plan is just to stick it through and if I can’t get the grades high enough I will retake them. Either way I would have to do might as well try",
          "author": "papaboynosmurf",
          "created": 1635178517,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi05w08": {
      "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi05w08/",
      "text": "It would count as WF (withdrawal fail) but would not impact your GPA. So if you wanted to go to grad school and they saw your transcript it might say just W (just that you withdrew) or WF because you were failing at the time of withdrawal. It usually doesn’t matter especially if you retake it with a better grade. It’s likely you’d have to retake the class again anyways because you need a C for it to count, so I would withdraw as to not effect your GPA and because you’ll need to take the class again.",
      "author": "milk1tea",
      "created": 1635180475,
      "upvotes": 1,
      "replies": {
        "hi062ys": {
          "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi062ys/",
          "text": "Taking it again and fixing my grade if I don’t drop it should still iron out my gpa right?",
          "author": "papaboynosmurf",
          "created": 1635180555,
          "upvotes": 1,
          "replies": {
            "hi06mi4": {
              "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi06mi4/",
              "text": "Yes it would fix your GPA but not your cumulative GPA. (Example: med schools take into account a cumulative GPA so they count for every class taken even if you retook the class). If you aren’t going into a field that does that then you’re fine",
              "author": "milk1tea",
              "created": 1635180774,
              "upvotes": 1,
              "replies": {
                "hi06tay": {
                  "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi06tay/",
                  "text": "Yeah I’m not doing a medical field for sure. I appreciate the information you’ve given me some good advice and something to think about",
                  "author": "papaboynosmurf",
                  "created": 1635180850,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hi2do7b": {
      "link": "/r/college/comments/qfh3dj/should_i_withdraw_from_a_class_i_will_get_a_d_in/hi2do7b/",
      "text": "It really depends on your situation. Are you looking to go to grad school? I personally am not so I can't say that I'd choose to withdraw. I got a D+ in an elective course, which is considered passing at my CC for elective courses. Now if you're going to get a D in a core class, I doubt there's really anywhere out there that will offer credit for a D in a core class. Usually it has to be at least a C-. I still have a 3.66 GPA which isn't that bad, all things considered. I just really didn't want to have to take another class to fill it or waste the money I spent on the course, so I stuck with the grade.\n\n2 classes at a D is pretty rough, but again, I suppose it depends on your situation. Past *maybe* your first job, GPA isn't going to matter. If those will be passing grades for you and you aren't looking to transfer into a competitive major or go to grad school, then you could get by with 2 Ds.",
      "author": "para_lyzed",
      "created": 1635214682,
      "upvotes": 1,
      "replies": {}
    }
  }
}