{
  "sid": "r58sa3",
  "link": "/r/college/comments/r58sa3/i_think_i_might_be_failing_all_my_classes_and_its/",
  "title:": "I think I might be failing all my classes and it's killing me.",
  "text": "Here's the context: I'm a 3rd year transfer going to ab out of state university. This is my first year going to a university because I spent 2 years at community college prior. I have just realized that the semester ends in about two weeks and I still have falling grades in all of my classes. (12 credits, only failling 4 classes but ones already finished) I have struggled with my mental health for over a decade and was taking medications and in therapy, but yet I never seemed to have any motivation to get anything done. It's not necessarily a problem of learning but turning stuff in on time. Now I'm afraid I'm going to fuck up my life due to this, as I'm heavily relying on financial aid to pay for school. My parents have been helping me financially for once in their life and they always talk about how proud they are but they have no idea how bad I'm doing. I also haven't really attended classes in over a month. Most of what I do is work and contemplate my life. Has anyone been in this same situation? Should I qctually consider taking a break or simply take less classes? I've taken 18 credits before and gotten all A's, so I feel like I should be able to do this but my motivation has completely disappeared.",
  "author": "quhe521",
  "created": 1638228670,
  "updated": 1638480489,
  "over_18": false,
  "upvotes": 28,
  "upvote_ratio": 1.0,
  "comments": {
    "hmlipw9": {
      "link": "/r/college/comments/r58sa3/i_think_i_might_be_failing_all_my_classes_and_its/hmlipw9/",
      "text": "I cant diagnose nothing, but that sounds like some serious mental blockage. Try talking to your major's office admin and explain the difficulties you had this semester. The very least they'll do is talk to you about strategies other people had. Take the classes over next semester.\n\nI'm not saying Ive failed any classes, well... Actually, yeah. That's exactly what I'm saying. Anyways, taking a class over will usually overwrite your previous grade. Definitely do not withdraw RN. Go to class to try and learn the subject material regardless of grades. Next semester, you'll have a background and can do much better.",
      "author": "AHumbleLibertarian",
      "created": 1638230368,
      "upvotes": 15,
      "replies": {
        "hmmiun1": {
          "link": "/r/college/comments/r58sa3/i_think_i_might_be_failing_all_my_classes_and_its/hmmiun1/",
          "text": "That's a good point. Hopefully everything works out.",
          "author": "quhe521",
          "created": 1638246978,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "hmlkz8z": {
      "link": "/r/college/comments/r58sa3/i_think_i_might_be_failing_all_my_classes_and_its/hmlkz8z/",
      "text": "The transition to university was rough for me. I bailed on 2 classes and started over the next term. I now have a PhD.  Stick with it but create some strategies in your new ecosystem to succeed. Talk with your peers, faculty and other support staff.",
      "author": "phaNIMAnon",
      "created": 1638231402,
      "upvotes": 8,
      "replies": {
        "hmmitrv": {
          "link": "/r/college/comments/r58sa3/i_think_i_might_be_failing_all_my_classes_and_its/hmmitrv/",
          "text": "This is actually uplifting. Thanks!",
          "author": "quhe521",
          "created": 1638246964,
          "upvotes": 3,
          "replies": {
            "hmmp57o": {
              "link": "/r/college/comments/r58sa3/i_think_i_might_be_failing_all_my_classes_and_its/hmmp57o/",
              "text": "Awesome. I thought I was done that first quarter. So many new things and the pace was so fast compared to before. I found the study centers on campus, found out who were good tutors there and just did my hw there for a while. Then I found friends to study with in my major. Over time I got on my own feet but always chose to work with others after that.",
              "author": "phaNIMAnon",
              "created": 1638250505,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hmn2gfo": {
      "link": "/r/college/comments/r58sa3/i_think_i_might_be_failing_all_my_classes_and_its/hmn2gfo/",
      "text": "Yeah, I’m also a third year. I’m currently taking 4 classes, 12 credits, one is online. I’m not working (even though my parents are understandably pressuring me to), but I’m also struggling with MH issues and just can’t find any motivation. Serious procrastination on my part, on everything. I’m on antidepressants and my parents are begging me to go to therapy, but I know it won’t help and I don’t want to waste anymore of their money. I know most people would tell me that MH is an excuse and that I’m just lazy, but the mental blockage is real and I’m dealing with a pretty deliberating addiction and emotional problems. Plus the guilt and shame. \n\nI guess the best thing to is try to come up with a redemption plan, or just an alternative plan, THEN bite the bullet and tell your parents ASAP. Don’t go to your parents without a plan, any plan. And maybe try to email your professors or administration and explain your situation. \n\nI empathize with your situation. Good luck",
      "author": "Person9183736",
      "created": 1638259877,
      "upvotes": 2,
      "replies": {}
    }
  }
}