{
  "sid": "qgkwgp",
  "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/",
  "title:": "Should I do my English assignment or go to sleep",
  "text": "i am sooooo exhausted and i really want to go to sleep but it's only 9pm and I have an English assignment due at midnight. I'm already kinda behind in the class and I know that if I don't do it then I'll be really mad at myself.\n\nI've been sitting here for an hour trying to get myself to start the assignment but my eyes keep getting all droopy and I'm just like mjmsgfkjsfughhh\n\n(also, i started taking adderall for my adhd recently and it gets me really wired during the day and i usually can't fall asleep at night. i started losing a lot of weight while taking it so i stopped taking it for a few days but yesterday i took it for the first time again and i didn't go to sleep until 6am this morning. I had to get up this morning at 7:30 and I've been up since).\n\nI'm sooo tired (since I'm running on like -266 hours of sleep) and i know I'm just making excuses but i really don't know if i should just stay up and try to finish it and just bear with being tired tomorrow too or if i should go to sleep now and feel refreshed in the morning and attempt to turn it in late.\n\npls help i don't know what to do\n\nthank u, luv u, mwah",
  "author": "EmotionalINFP",
  "created": 1635296599,
  "updated": 1635302349,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hi6ynh3": {
      "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi6ynh3/",
      "text": "Give yourself permission to do an imperfect assignment. Don’t try to make it perfect, just hand something in so you don’t get a zero",
      "author": "OwnUniversity153",
      "created": 1635298568,
      "upvotes": 1,
      "replies": {
        "hi70jt0": {
          "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi70jt0/",
          "text": "Yes I agree with this! The one lesson I learned in college is half-assing an assignment is better than not submitting anything",
          "author": "opheliasarene",
          "created": 1635299413,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi6wxjn": {
      "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi6wxjn/",
      "text": "Just do it and get a large coffee tomorrow. If I were in your situation I wouldn’t even be able to fall asleep anyways with the knowledge I’m willingly blowing off my English assignment and hurting my future",
      "author": "harry01772",
      "created": 1635297787,
      "upvotes": 1,
      "replies": {}
    },
    "hi6z1pq": {
      "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi6z1pq/",
      "text": "What’s the assignment?",
      "author": "OwnUniversity153",
      "created": 1635298746,
      "upvotes": 1,
      "replies": {
        "hi72cps": {
          "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi72cps/",
          "text": "it's just an essay outline (but i've never been great at essays)",
          "author": "EmotionalINFP",
          "created": 1635300233,
          "upvotes": 1,
          "replies": {
            "hi7349r": {
              "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi7349r/",
              "text": "Oh man, an outline? Just bang out something and send it in. Outlines are usually changed around anyway. Set a timer for 30 minutes, and really work for 30 minutes on it. See where you are in half an hour. You’ll feel a lot better.",
              "author": "OwnUniversity153",
              "created": 1635300589,
              "upvotes": 1,
              "replies": {
                "hi75dlv": {
                  "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi75dlv/",
                  "text": "Yeah, I know it's easy, I just don't know where to start, and just reading the instructions is overwhelming for me and I don't know why\n\n(P.S. I know I sound so dramatic and I'm sorry)",
                  "author": "EmotionalINFP",
                  "created": 1635301615,
                  "upvotes": 1,
                  "replies": {
                    "hi76ayo": {
                      "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi76ayo/",
                      "text": "No, you’re fine. Starting (and worrying about starting) is always the hardest part. I usually start with the supporting paragraphs, the middle parts. Then do the intro and the closing after I can look at what I wrote. \n\nA good way to get going is writing a fake first sentence or two. Something like “All right you mother fuckers, get ready for an AMAZING outline about [___] !!!” Then just start word vomiting whatever you can think of. \n\nI will often open up google docs with my phone, and just start dictating what I want to say. Just talk about it, and worry about the rest later. \n\nIt’s an outline so you can put “here in the second paragraph I will include statistics I will look up that support my argument” and stuff like that. You don’t need to have completed your research to rough something out, often the rough draft will direct your research.\n\nWhen I get overwhelmed, I break it into TINY bites. \nStep one: turn on PC\nStep Two: navigate to schools website\nStep three: open specific class section\nStep four: just read the assignment\nStep five: copy past assignment into word doc\nStep six: break apart all the parts of the assignment\nStep seven: write out the first part of the broken apart assignment\n\nThen by the time you’ve even started writing, you’ve completed SIX STEPS! You’re on a ROLE!!",
                      "author": "OwnUniversity153",
                      "created": 1635302047,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hi745gp": {
      "link": "/r/college/comments/qgkwgp/should_i_do_my_english_assignment_or_go_to_sleep/hi745gp/",
      "text": "Maybe just do a little bit, then go to sleep. :)",
      "author": "2Browneyes2",
      "created": 1635301065,
      "upvotes": 1,
      "replies": {}
    }
  }
}