{
  "sid": "qa9jxm",
  "link": "/r/college/comments/qa9jxm/is_it_too_late_to_transfer_is_it_even_a_good_idea/",
  "title:": "Is it too late to transfer? Is it even a good idea?",
  "text": "Hello!\n\nSo a little background - I attended CU Boulder for a year and studied media production and this was all in the 2019-2020 year. After deciding it wasn’t for me, I was asked to decide in the moment what interests me. I said game design, and that’s what we ended up going with so I left my home state behind and went to another to study game design. After starting classes, I met with my advisor who told me regardless of my transfer credits I had to stay for 4 years (5 years of college total) which I thought was dumb and I clarified multiple times and he was certain that was correct. After that year, I’ve changed majors to game sound design to specialize in something that’s a little less draining (I truly hate game design and the process it’s just not for me) and my new advisor told me that staying here for 4 years was complete bullshit and that whoever told me that was wrong. So imagine my frustration being told that I was gonna be here for 4 years anyway so I might as well change to another major, and then hearing that it was not true and if I stayed in game design I might be able to graduate on time. How I’m here, doing 4/5 classes that I can’t stand, wondering why I’m even bothering at this point. This degree won’t even land me a job I want but it feels like being a second year (should be third) it’s too late to change. What I’ve found is that animals truly light my brain up and that’s something I want to be around but my school offers tech only majors so my question is, what’s the smart decision here? Not asking for anyone to make decisions for me, I just would like to hear what you guys would do in my situation or hear some advice from anyone with an outside perspective.",
  "author": "muppysneezed",
  "created": 1634510656,
  "updated": 1636178790,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.75,
  "comments": {
    "hh1j9dv": {
      "link": "/r/college/comments/qa9jxm/is_it_too_late_to_transfer_is_it_even_a_good_idea/hh1j9dv/",
      "text": "You hate game design. This will be your career and what you will pursue after college. I'd change majors- or see if you can either make it a minor or double major, if you prefer. If you get financial aid or scholarships you need to speak with them right away (and get it in writing if possible) what your options are, if aid will cover longer etc.  Year 2 out of 4 is really early on. You probably have some courses that could be used towards another degree requirement?\n\nTalk to career counseling if you can and try  to figure out what you're truly passionate about. If you can afford to, maybe you should try to take a class or two in things you may be interested in  if you don't know, so that you can really have a good idea.\n\nDon't be hard on yourself. Think of it as an experience to learn who you are and what you want to be. You didn't \"waste\" a year in it, you learned that you don't want to do this for life. This isn't uncommon.",
      "author": "lightbluejellyfish",
      "created": 1634511221,
      "upvotes": 1,
      "replies": {
        "hhwjg6o": {
          "link": "/r/college/comments/qa9jxm/is_it_too_late_to_transfer_is_it_even_a_good_idea/hhwjg6o/",
          "text": "Thank you a lot for the kind words. It's good to hear that it's not uncommon, I've just been surrounded by only people that have known exactly what they want to do since they were young and it's scary just now figuring it out this late into college. Set up an appointment with career counseling later this week, I really appreciate the help <3",
          "author": "muppysneezed",
          "created": 1635106548,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh263p8": {
      "link": "/r/college/comments/qa9jxm/is_it_too_late_to_transfer_is_it_even_a_good_idea/hh263p8/",
      "text": "I would transfer. I would go to a school that offers both a track for working with animals and a tech/film field. That way if you change your mind again, you don’t need to transfer schools. Keep your options open.",
      "author": "milk1tea",
      "created": 1634522473,
      "upvotes": 1,
      "replies": {
        "hhwjabs": {
          "link": "/r/college/comments/qa9jxm/is_it_too_late_to_transfer_is_it_even_a_good_idea/hhwjabs/",
          "text": "I def will consider it. Brought it up to my family and going to meet with a career counselor later this week, thank you very much for your help \\^\\^",
          "author": "muppysneezed",
          "created": 1635106482,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}