{
  "sid": "q3d6ls",
  "link": "/r/college/comments/q3d6ls/would_it_be_badnot_smart_to_do_a_summer_job_that/",
  "title:": "Would it be bad/not smart to do a summer job that isn’t related to my major?",
  "text": "I’m a sophomore majoring in communication sciences and disorders. My freshman year I was elementary ed, but after spending last summer working in a daycare I decided it wasn’t a good fit for me anymore. I know it’s only October, but I have been thinking about summer jobs, and I’m kind of at a loss for what to do this summer. My college is around 4 hours from home so my school can’t really connect me with anything. I tried to find some stuff online but most of them have to do with kids. I babysat all through high school and I was extremely exhausted and stressed doing the daycare job last summer and I really just want a break from working with kids. The only other option I can find is to be some sort of front desk/administrator person which isn’t the worst option but I can’t find anything available right now but I could also just be getting way too ahead of myself because again it’s only October. But on campus during the school year I work for my schools custodial service, and while looking online I found a position posted for a summer janitor job for the school district I went to during K-12. So basically it’s a job really close to my house that I am experience in and super comfortable doing, but it gives me no future career relevant experience. Is that bad? Should I wait until spring and look for a front desk job? Help",
  "author": "lmj1129",
  "created": 1633625176,
  "updated": 1634083603,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfr79no": {
      "link": "/r/college/comments/q3d6ls/would_it_be_badnot_smart_to_do_a_summer_job_that/hfr79no/",
      "text": "I worked at Walmart for 2 summers during college stocking groceries. It was close to home and paid decently (more than I could find elsewhere at the time), and stocking groceries certainly didn’t relate specifically to any career that I planned. \n\nIf you need to make money, take the job that works for you. Any job experience (as long as it’s legal) is good to fill space on a resume until you can work your way into something more relevant long-term.",
      "author": "apatheticpolliwog",
      "created": 1633629281,
      "upvotes": 1,
      "replies": {}
    },
    "hfr984q": {
      "link": "/r/college/comments/q3d6ls/would_it_be_badnot_smart_to_do_a_summer_job_that/hfr984q/",
      "text": "Now is a great time to start looking for summer research internships away from home. You seem tied to the idea of going home for the summer, and if you want a relevant summer job, you need to be willing to go somewhere else. Ask your professors and advisor about summer research internships, they’ll help you figure out how to look.",
      "author": "AceyAceyAcey",
      "created": 1633630082,
      "upvotes": 1,
      "replies": {}
    }
  }
}