{
  "sid": "rf3ssq",
  "link": "/r/college/comments/rf3ssq/working_full_time_and_going_to_school_full_time/",
  "title:": "Working full time and going to school full time question",
  "text": "Does anyone here know if this is a decent or acceptable gpa? So I just finished my fall semester with a 2.55 GPA, however I am returning back after taking off for almost 10 years and in addition to that I am also currently working full time while averaging about 50 hrs per week, so with all that does anyone think that my gpa is decent? I ask because back in HS I had a 3.5 GPA so I don’t like seeing my gpa that low and it’s making me upset and frustrated at myself.",
  "author": "Deadsilence27",
  "created": 1639359424,
  "updated": 1639516188,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hoc63ib": {
      "link": "/r/college/comments/rf3ssq/working_full_time_and_going_to_school_full_time/hoc63ib/",
      "text": "A 2.55 GPA is low and you must know that or you wouldn't be here. \n\nI am in the same boat as you but my GPA isn't suffering. Decide what you want your GPA to be and work towards that goal. If you need to take less, do so. If you are happy with how you are doing, continue. However, it is possible to do everything you are doing and more while still maintaining a average or above average GPA. Seeking validation on Reddit won't mean anything when your future resume is compared to others. There is no box to explain your personal situation in the real world.",
      "author": "HollyAnn92154",
      "created": 1639367577,
      "upvotes": 2,
      "replies": {}
    },
    "hobowbr": {
      "link": "/r/college/comments/rf3ssq/working_full_time_and_going_to_school_full_time/hobowbr/",
      "text": "You should take one class at a time. Working 50 hours whipe going to school full time will tank your GPA",
      "author": "elkfn2",
      "created": 1639359663,
      "upvotes": 2,
      "replies": {}
    },
    "hobtlii": {
      "link": "/r/college/comments/rf3ssq/working_full_time_and_going_to_school_full_time/hobtlii/",
      "text": "school is not designed for full time working!! you have to accept that grade or work even harder which I do not recommend!! 😭",
      "author": null,
      "created": 1639361823,
      "upvotes": 1,
      "replies": {}
    }
  }
}