{
  "sid": "rf9san",
  "link": "/r/college/comments/rf9san/question_about_a_due_date/",
  "title:": "Question about a due date",
  "text": "So i had an assignment and it was due on Sunday night. I had a lot of other work from other classes and I generally just procrastinated this assignment because I dislike this class very much. Anyway I got home from work around 9 on Sunday and finished it at about 1:30 in the morning. Blackboard still let me submit it but my professor said anything posted after Sunday would get no credit. Should I email her and if I do, what should that email be like? I know I’m absolutely in the wrong but I need this assignment to count for my grade.\n\nSorry for the long question and I appreciate any advice.",
  "author": "Big-Today254",
  "created": 1639379120,
  "updated": 1639516170,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hodafzn": {
      "link": "/r/college/comments/rf9san/question_about_a_due_date/hodafzn/",
      "text": "Do not email your professor about this.  She knows (or will know) you turned it in late. Emailing her will only come across as asking for special treatment, which is one of the worst things you can do to a professor.  You have already admitted you are \"absolutely in the wrong.\"  Your dislike of the class and resulting procrastination are your problem, not hers.\n\n>I need this assignment to count for my grade.\n\nIf it was so damn important, then why did you not get it done on time?  You never said you were too busy, only that you procrastinated.  Play stupid games, win stupid prizes.",
      "author": "baseball_dad",
      "created": 1639396092,
      "upvotes": 6,
      "replies": {
        "hodcuee": {
          "link": "/r/college/comments/rf9san/question_about_a_due_date/hodcuee/",
          "text": "You’re right. Thanks for telling me what i need to hear",
          "author": "Big-Today254",
          "created": 1639397781,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hodxopp": {
      "link": "/r/college/comments/rf9san/question_about_a_due_date/hodxopp/",
      "text": "[removed]",
      "author": null,
      "created": 1639408540,
      "upvotes": 1,
      "replies": {}
    }
  }
}