{
  "sid": "qvcb20",
  "link": "/r/college/comments/qvcb20/paying_for_college/",
  "title:": "Paying for college",
  "text": "With a kid just a couple years away from college the thought of how to pay for it has been on my mind.\n\nOur high school sent out information on joining a webinar hosted by Beyond Academy CA.  I didn't get a chance to listen to the entire webinar but the part I did listen to certainly made it sound like hiring then to help with strategies to pay for college was pretty convincing.\n\nHas anyone ever used them or a service similar to them?\n\nhttps://beyondacademyca.org",
  "author": "CrazyTownVA",
  "created": 1637081808,
  "updated": 1637181395,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hkvhw7i": {
      "link": "/r/college/comments/qvcb20/paying_for_college/hkvhw7i/",
      "text": "My dad hired a company like that when my sister went to school and he had me go as well. It was complete BS. I gave him the list of colleges I wanted to apply to and he said I had no chance of getting in. I got accepted to all of them and waitlisted at one of them. \n\nfor my sister he said the colleges she was applying to weren’t good enough for her merit and weren’t impressive- also a lie. (she had a job offer waiting for her at one of the main mayo clinic campuses when she graduated) \n\nThe best thing you can do for your child is to look at the scholarships the schools they are interested give out to students, look at the best federal & private loans, and look at private scholarships/grants for their major. These companies often prey on people not having experience & capitalize off the stress funding education gives parents.",
      "author": "rynpickles",
      "created": 1637082683,
      "upvotes": 8,
      "replies": {
        "hkvigzv": {
          "link": "/r/college/comments/qvcb20/paying_for_college/hkvigzv/",
          "text": "Great feedback. Thank you.",
          "author": "CrazyTownVA",
          "created": 1637082913,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hkvoxh2": {
      "link": "/r/college/comments/qvcb20/paying_for_college/hkvoxh2/",
      "text": "You are thinking about costs.... so you are going to spend money on people telling you how to spend money?\n\nMost of these are scams. Most of this information can be found in a campuses financial aid office for free or by dedicating time to a google search.",
      "author": "PKtrader999",
      "created": 1637085395,
      "upvotes": 5,
      "replies": {
        "hkvr499": {
          "link": "/r/college/comments/qvcb20/paying_for_college/hkvr499/",
          "text": "Right.. The only thing that makes be think otherwise is that is was sent out by our high school...",
          "author": "CrazyTownVA",
          "created": 1637086238,
          "upvotes": 3,
          "replies": {
            "hkvskb1": {
              "link": "/r/college/comments/qvcb20/paying_for_college/hkvskb1/",
              "text": "High schools can be scammed just like you or can be getting a kickback from the company. I wouldnt recommend this. Have your children apply for every local scholarship you find, your highschool will do a few every year. Have them research what careers they want and match a program to that. You dont need to send your kid to an ivy league school if their chosen career has a great program at your local university. Make sure the programs are accredited!",
              "author": "Cerenya",
              "created": 1637086801,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hkvi7rn": {
      "link": "/r/college/comments/qvcb20/paying_for_college/hkvi7rn/",
      "text": "Don’t pay people to pay less it doesn’t make sense. Often times they cut the price but still make it unaffordable for a student without parental aid. Scholarships and grants, instead of getting a job make applying for these your job. i remember spending days behind a computer and my email was flooded but I also got a good gpa 3.5 and a 1350 on my sat it gave me a 72k automatic scholarship to my dream school that made my tuition 8k instead of 23k a semester. I go to Saint Mary’s university a private college. Then I got a Hispanic scholar grant for 1,500 a semester. A Coca-Cola one for 2,500 and various business related grant over the years. Finally fafsa helped so my tuition is only 1300k on average (I live off campus) (I sell my old books and it helps me pay of my new text books)I’m a junior now I work 25-30 hrs I pay about 4-5k for school a year. It’s doable if you really want it. Just know it will make it impossible to have to much of a Greek life or go out to parties to much (because most of those scholarship and grants have a gpa requirement attached to them so you have to study hard) I’m just school and work and then I have Sunday to myself. While it’s stress full I’m looking forward to graduating without any debt I strongly suggest to not take any loans.",
      "author": "Couldnt-think-of-you",
      "created": 1637082812,
      "upvotes": 2,
      "replies": {}
    },
    "hkvxbfe": {
      "link": "/r/college/comments/qvcb20/paying_for_college/hkvxbfe/",
      "text": "I skimmed your post history and I *think* I saw that she might be interested, or considering Computer Science.  \n\nYou might investigate CyberCorps and the NSA Stokes Scholarship programs.",
      "author": "VA_Network_Nerd",
      "created": 1637088655,
      "upvotes": 1,
      "replies": {}
    }
  }
}