{
  "sid": "q5gsup",
  "link": "/r/college/comments/q5gsup/normalize_hating_first_year_of_college/",
  "title:": "normalize hating first year of college",
  "text": "why does everyone make it seem like your first year of uni is so amazing ??? tbh i’m not really digging the college hype n all like i’m really disappointed by the fact that so many people around me is having so much fun but i just cant feel the same “fun” that they’re feeling. idek why. i’m so frustrated. the first few weeks were great, but then i’m starting to not enjoy it more and more and i’m honestly not sure whether transferring is worth it considering how hard i worked my ass off during HS to get to the uni that i’m attending now. \n\ni don’t know if i’m depressed, but i just want everything to stop. i wish so many people saw the downsides to the college journey because it’s honestly so overhyped.",
  "author": "substratecomplex",
  "created": 1633900047,
  "updated": 1634083012,
  "over_18": false,
  "upvotes": 11,
  "upvote_ratio": 0.72,
  "comments": {
    "hg5p1k3": {
      "link": "/r/college/comments/q5gsup/normalize_hating_first_year_of_college/hg5p1k3/",
      "text": "College as a whole is overrated and I say this as a junior. If HR didn’t require a bachelors, I would’ve bounced after sophomore year",
      "author": "evasiveshag",
      "created": 1633904284,
      "upvotes": 12,
      "replies": {}
    },
    "hg5py2q": {
      "link": "/r/college/comments/q5gsup/normalize_hating_first_year_of_college/hg5py2q/",
      "text": "IMO, what you are feeling is very logical and common.\n\nSociety puts so much pressure on kids to do everything they can to get into a good college. If a person spends their whole life preparing for something, it’ll be hard to live up to the hype because let’s face it, nothing is perfect. \n\nThe first year is especially hard because it looks like everyone is having fun. Most people haven’t really established a solid friend group — even if it seems it. And if they have, it probably doesn’t replace the tight friendships you’ve built over the past 12 years (if you’ve gone to elem, middle and high school in the same area). \n\nBut, you will work through this. It’s temporary. And you’ll be stronger for it.",
      "author": "inflewants",
      "created": 1633904690,
      "upvotes": 11,
      "replies": {}
    },
    "hg5wfp8": {
      "link": "/r/college/comments/q5gsup/normalize_hating_first_year_of_college/hg5wfp8/",
      "text": "FELT on a spirtual level at times tbh. Its fun and all at times but sometimes I feel so alone. I'm never one to easily get homesick and generally am pretty outgoing, but these past few weeks all I've wanted to do is go home.",
      "author": "CirqueDeSol",
      "created": 1633907580,
      "upvotes": 4,
      "replies": {}
    },
    "hg5ww8z": {
      "link": "/r/college/comments/q5gsup/normalize_hating_first_year_of_college/hg5ww8z/",
      "text": "I also hated my first year of college (I hated the first semester more than the second semester, but still hated both)!!!!! For me, it was a stressful time as I felt I needed to decide what I would do with my life after I graduated, as I was not 100% sure what major/ job, etc that I would do. I also had a lot of pressure from my parents to decide as they wanted me to go to med school, while I was more interested in chemistry. It did not help that I commuted since I was not away from my parents to think on my own about what I would do with my life/ get to make more friends/ join clubs. I chose to commute to save money though, and now that I have almost graduated I think it was worth it to not stay on campus. Overall I think I have had a decent experience, I felt like it got better after the first year. For me, though college, in general, has been more stressful than high school since now I have to worry about keeping grades up for scholarships and grad school. But yeah I will agree college is overhyped, I have become more disillusioned with the education system as time went on in college.",
      "author": "YAMCOMMANDER",
      "created": 1633907790,
      "upvotes": 5,
      "replies": {}
    },
    "hg5txoa": {
      "link": "/r/college/comments/q5gsup/normalize_hating_first_year_of_college/hg5txoa/",
      "text": "There were definitely parts I hated, but I also really liked being out from under my parents’ overbearing thumbs. It was worth the broken heart, the bullying, and more, just to get away from my folks and start my healing process.",
      "author": "AceyAceyAcey",
      "created": 1633906461,
      "upvotes": 2,
      "replies": {}
    }
  }
}