{
  "sid": "rgmjl9",
  "link": "/r/college/comments/rgmjl9/question_about_my_final_grade/",
  "title:": "Question about my final grade",
  "text": "So my professor posted an announcement saying that for our final grade of the class, he is removing the lowest score on a homework assignment for each student. In this case the homework is out of 20 percent. By him doing this will the final grade get fixed and go up? since he is removing the lowest score I got on an assignment which should take away from the final grade before the removal of the lowest score on a homework? This is in Canvas btw. If so will it go up by 20 percent or half or what. It probably will go up though but not sure\n\nI have a 58 percent now as my total grade for the class because of me getting a low score on my final exam and I was wondering if you think the fact that he is dropping the lowest homework score will bump my grade up to a 60? The lowest homework score I got is out of 20 percent like all the other homeworks.",
  "author": "pablohax",
  "created": 1639530668,
  "updated": 1639787974,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hol4pch": {
      "link": "/r/college/comments/rgmjl9/question_about_my_final_grade/hol4pch/",
      "text": "It could be two ways. Either he just makes that assignment a perfect, or he literally removes the assignment from the calculation",
      "author": "SqueezyYeet",
      "created": 1639531017,
      "upvotes": 2,
      "replies": {
        "homa930": {
          "link": "/r/college/comments/rgmjl9/question_about_my_final_grade/homa930/",
          "text": "You think since he removes the lowest score for a homework of mine, my grade gets bumped up bc of that? It’s worth 20 points",
          "author": "pablohax",
          "created": 1639552961,
          "upvotes": 2,
          "replies": {
            "hoo8vgr": {
              "link": "/r/college/comments/rgmjl9/question_about_my_final_grade/hoo8vgr/",
              "text": "It could be either way. I just got my grades back and it’s really up to the prof",
              "author": "SqueezyYeet",
              "created": 1639591937,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}