{
  "sid": "qmu11f",
  "link": "/r/college/comments/qmu11f/is_it_okay_to_ask_my_professor_this/",
  "title:": "Is it okay to ask my professor this?",
  "text": "Would it be alright if I asked my professor to look over my outline about a week before my essay is due? It's worth half of my grade and I'm not sure if I'd come off as irresponsible/bothersome. \n\nThanks.",
  "author": "unfoldingbliss",
  "created": 1636058385,
  "updated": 1636137338,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hjc0pa8": {
      "link": "/r/college/comments/qmu11f/is_it_okay_to_ask_my_professor_this/hjc0pa8/",
      "text": "You can certainly ask, it's a reasonable request, more so than asking the prof to read a rough draft. For various reasons, they may or may not do it. (I  would say yes to a request like this.) If you put it in terms of wanting to be sure you understand the assignment and whether you are on the right track, that should help. That's a lot of course grade for one essay!",
      "author": "ProfessorUnrat",
      "created": 1636060417,
      "upvotes": 7,
      "replies": {}
    },
    "hjdfjw3": {
      "link": "/r/college/comments/qmu11f/is_it_okay_to_ask_my_professor_this/hjdfjw3/",
      "text": "Definitely a reasonable request. Most my professors have been more than happy to check over my work before submission. Shows you care.",
      "author": "NoetheWolford",
      "created": 1636082766,
      "upvotes": 3,
      "replies": {}
    },
    "hjd2y2d": {
      "link": "/r/college/comments/qmu11f/is_it_okay_to_ask_my_professor_this/hjd2y2d/",
      "text": "Lol, I remember asking my TA to approve a paper topic a day before it was due. She gave me feed back on the thesis and how to focus it better. Knowing it was done in a day didn’t change grading, but getting feedback definitely helped the final product.\n\nI would make sure the outline is well done so you don’t waste his time but definitely worth it. A week is a lot of time and the outline is half the battle for me.",
      "author": "The-Brose",
      "created": 1636076693,
      "upvotes": 2,
      "replies": {}
    },
    "hjeshwt": {
      "link": "/r/college/comments/qmu11f/is_it_okay_to_ask_my_professor_this/hjeshwt/",
      "text": "You can but you will be considered a butt licker",
      "author": "yetiman3511",
      "created": 1636117783,
      "upvotes": 0,
      "replies": {}
    }
  }
}