{
  "sid": "qscutd",
  "link": "/r/college/comments/qscutd/how_has_college_prepared_you_or_helped_you_get_a/",
  "title:": "How has college prepared you or helped you get a good career.",
  "text": "Not currently in college, but will be trying to go after I get out of the military.\n\nFew years left of the military life but am feeling some anxiety about leaving and following my dream of earning a degree. My biggest question to my college folk, \n\nHow is college helping you get that amazing job? (Are they offering set up internships for gaining experience in your field, how are you setting yourself up to get that well paying job)?\n\nIt's probably silly but I'm so nervous about going to college and then not getting a better job. Would love to hear some input from anyone that is prior military also.",
  "author": "Specific_Bandicoot33",
  "created": 1636728816,
  "updated": 1637389050,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hkcj9rz": {
      "link": "/r/college/comments/qscutd/how_has_college_prepared_you_or_helped_you_get_a/hkcj9rz/",
      "text": "It gave me a piece of paper that apparently indicated I am capable of showing up somewhere for 4 years.\n\nGot me a job as a software engineer I guess? \n\nI'm not military but my father was and I went to school on the GI Bill if that means anything to you. The good news is if you're military the government will pay for it, so even if you don't end up with a job at the end of it, at least you won't be in debt.",
      "author": "Dchaney2017",
      "created": 1636734082,
      "upvotes": 3,
      "replies": {
        "hkd1fxg": {
          "link": "/r/college/comments/qscutd/how_has_college_prepared_you_or_helped_you_get_a/hkd1fxg/",
          "text": "This is why I went military straight from HS. I was so scared of the debt when I wasn't sure of what to study. I now have the interest to study electrical/electronics engineering (or something in that field where I can work on and repair) my current job made me fascinated by electronics and how they work together to do one job :) \n\nThanks for your insight!",
          "author": "Specific_Bandicoot33",
          "created": 1636741426,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkcxu3k": {
      "link": "/r/college/comments/qscutd/how_has_college_prepared_you_or_helped_you_get_a/hkcxu3k/",
      "text": "Beyond the general knowledge they provide, as well as the certification the degree represents, many departments have research opportunities or internship resources. These are not just given, you will have to seek them out and even compete for them, but they are there.",
      "author": "Jumpy-Elderberry-738",
      "created": 1636739944,
      "upvotes": 1,
      "replies": {
        "hkd0ugl": {
          "link": "/r/college/comments/qscutd/how_has_college_prepared_you_or_helped_you_get_a/hkd0ugl/",
          "text": "Wonderful, thanks! I've been thinking a lot about my future education and there is so much that I don't know especially what programs would be offered. \n\nLol I sometimes feel ot was a mistake going military straight from HS but at the same time I have an idea of what I want to study now.",
          "author": "Specific_Bandicoot33",
          "created": 1636741179,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hke3rei": {
      "link": "/r/college/comments/qscutd/how_has_college_prepared_you_or_helped_you_get_a/hke3rei/",
      "text": "I've had a lot of jobs that I've loved and paid well, but lots of people who graduated with me and with the same degree fell on their face right after college. It's all about how you use what you learn, being willing to apply to a lot of jobs (and move), and learning how to do career stuff like writing a killer resume, doing interviews, and filling in resume gaps.",
      "author": "zifmer",
      "created": 1636758035,
      "upvotes": 1,
      "replies": {}
    }
  }
}