{
  "sid": "q1vnni",
  "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/",
  "title:": "How do i get rid of highschool kid mentality and grow to be a mature responsible person?",
  "text": "Insecurity\n\nIm 20 this year and i just enrolled to college last march 2021, for some reason, the 8 month lockdown that istay inside alone with no socializing or communication had made me forgotten all of my communication skills and I don’t even know what to say to people when i saw them. Im not shy, but when i get back to college doing online class, its hard making friends since everyone contact through Whatsapp and online messaging isnt really my best suit, it always ended blatantly. I dont mind not havin frens but i want to change myself to be socialsble\n\nChildish mindset/procrastination \n\nI can’t take the class lessons im learning serious at all, yapping and sighing whenever i got into group workor essay writing. All of the stuff im learning takes too much to digest and i end up googling or review the material after class/near exam. No just that, i procrastinate stuff til last minute and rushed myself to complete the work with messy efforts and poor understanding (2/10 work graded) fueling stress and despair which led to me often felt exhausted or tired due to my habit of browsing internet non stop especially now that i lack friends which caused me to do this (finding enjoyment “short term pleasures “to fill the void inside) \n\nIm getting weaker and tired everyday , i cant go on like this with my poor performance and mindset if i want to survivein college. Please tellme some basic self disciplinary so i can pick myself a step up",
  "author": "chadwick69toed",
  "created": 1633438023,
  "updated": 1634083691,
  "over_18": false,
  "upvotes": 447,
  "upvote_ratio": 0.97,
  "comments": {
    "hfh5lf8": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfh5lf8/",
      "text": "See if your school has mental health resources. Even if you don’t feel completely depressed or anxious to extreme levels, it sounds like you’re headed that way. Plus therapists can help you address quite a few of these major concerns and is often offered for free by the school (you actually pay into it every semester). Ours is called “Counseling and Psychological Services” so see if you have access to something similar",
      "author": "hellyabruther",
      "created": 1633440235,
      "upvotes": 162,
      "replies": {}
    },
    "hfh1jpj": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfh1jpj/",
      "text": "Theres couple of things i failed to mention.\n\nMy\nEnglish usage is deteriorating and you might see it from my post. I have no motivation to improve it and my classes used English as medium of communication including assignments \n\nSo far having friends is the least of my problems, i can settle that later ig\n\nI dont want to fell into rock bottom, but its slippery slope for me right now and im sliding on a melting butter. Fuck being doomy gloomy",
      "author": "chadwick69toed",
      "created": 1633438207,
      "upvotes": 81,
      "replies": {
        "hfi1nfe": {
          "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfi1nfe/",
          "text": "1. Well first, go for walk outside. Free serotonin and it's good for you. \n2. Recognize there is a person within you who has the capacity to deal with this.\n3. Build a schedule if you haven't already.  Start planning on tackling your assignments a week ahead\n4. Joining clubs is an easy way to make friends. Similar interests and tons of cool people are in university. Don't be afraid to put yourself out there, if the end goal is being good friends with people then the awkwardness is worth it.\n5. For the love of God find a therapist because college is hard and doing it without friends is lonely as fuck. \n6. Develop a consistent work and sleep schedule. \n\nI have ADHD so I know all about procrastination. I find an effective way to overcome it by is forcing yourself to think ahead and actively choose excellence over distraction.",
          "author": "Tutti-Frutti-Booty",
          "created": 1633454013,
          "upvotes": 65,
          "replies": {}
        },
        "hfj5oxy": {
          "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfj5oxy/",
          "text": "As someone with ADD, I second finding a therapist. Having someone to support you and keep you accountable as you work to develop a schedule and learn how to cope with life as an adult is *crucial*. I specifically have a *2nd* person as a life coach because I need that level of support and accountability, and luckily have the financial resources available to me. You have to be willing to *work* to make these things happen, but having them will go a long way to making life bearable.\n\nWith regards to English usage: find something you like to read. My English ability has been strong ever since I was a kid because I’ve always been a voracious reader. If you don’t like reading there are also audiobooks — find a genre you like and listen/read as much as you can. If you learn to love reading there will never come a time where you cannot sufficiently write. \n\nHaving friends is important — they help maintain your mental health and can keep you accountable, so don’t disregard it, even though you may have other things you prioritize — maybe you aren’t going to seek them out, but it’s important to remain open to potential relationships.",
          "author": "taichi22",
          "created": 1633471018,
          "upvotes": 6,
          "replies": {}
        },
        "hfjsvin": {
          "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfjsvin/",
          "text": "I relate to the English deterioration thing a lot as I did all of my High School online and didn't talk directly to people very much/don't have many friends. The way I alleviated the deterioration was by listening to other intelligent people with great vocabularies, talking to myself out loud a lot, speaking out loud about random things and the current things you are doing. I've also heard, reading books, something I'm beginning to do, helps with word usage and increases your vocabulary.\n\nAs for the lonely thing, I don't really feel lonely because I prefer to be alone, but it starts add up after multiple years. I'm getting a job soonish when I get my driver's license and enrolling into CC next year though so that will hopefully be an outlet for social activity.\n\nBut trust me, you are definitely not in the worst position and have loads of potential, you just need some confidence to make the change that you want. Lots of other great advice in this thread as well.",
          "author": "4Weird",
          "created": 1633482036,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfhhqoc": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfhhqoc/",
      "text": "You should probably set a time everyday to do some work. Study, review your classes, watch videos on the topics, etc. Find a way to study effectively where you can recall the information. Maybe get in the habit of exercising or eating better. This might help you improve your physical and mental health. I find as soon as I start picking up better habits, I stopped procrastinating.",
      "author": "kyeelee",
      "created": 1633445823,
      "upvotes": 21,
      "replies": {}
    },
    "hfhopta": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfhopta/",
      "text": "Definitely look into your school's mental health services and get a therapist to help. Admitting there is something wrong is only the first step in getting better at anything. It seems like, to me, there's some sort of underlying depression or anxiety that is really upending you. \n\nTry to make to do lists, and maybe make a work space or get an office, if possible. Having a place to get yourself in the mindset of working will radically help you. When working, turn off your phone and put it away out of your sight and reach, preferably in another room. If you like music, get into physical copies of music or a radio.",
      "author": "hhbrother01",
      "created": 1633448762,
      "upvotes": 16,
      "replies": {}
    },
    "hfi6rk0": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfi6rk0/",
      "text": "[*Switch: How to Change When Change is Hard* by Chip and Dan Heath](https://www.amazon.com/Switch-Change-Things-When-Hard/dp/0385528752) \n\nIt's a very helpful book. This is what I personally got from it: \n\n1. Direct the rider. \nThis is your rational and conscious brain.  Identify what's working or has worked before. Schedule and plan your most important tasks. Keep your eye on how good graduation day will feel. \n\n2. Motivate the elephant. \nThis is your emotional self and subconscious desires.  Use any energy or good moods to meet your goal. Break goals down into smaller tasks.  Find like-minded people that encourage you. \n\n3. Shape the path. \nSet up your environment for success (I study at campus all day instead of going home between classes).  Build good habits (one at a time).  Depend on others when necessary (I sometimes slack on my chores).  \n\nThe book doesn't mentioning limiting screen time. In today's culture, it's really hard not to assume that electronics are related to a motivational issue.   Check out how they cause emotional disregulation through changes in dopamine use.\n\nI would also recommend reading about social anxiety and exposure therapy, which you can do DIY.  \n\nEdit: oh BTW I want you to see that most students struggle at least from a national scope if not qt your school. I think like 40 percent of kids drop out, remember, and a bunch more don't even go to college--not because they have better options but because they know they can't struggle through it. Most of us didn't learn great habits as a kid. You are not lazy or anything.",
      "author": "Sniffalisp",
      "created": 1633456179,
      "upvotes": 10,
      "replies": {}
    },
    "hfibspz": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfibspz/",
      "text": "1. Treat school like a job. Set yourself a schedule where you leave your place before your first class and return after your last class. Spend the time in between classes going over the material you just covered in class or are about to cover and do all the work. The best places for this are study halls or libraries for actually doing the work and outside on or near green stuff if you want to socialize but strike a balance. Your evenings are for you because all work and no play... but go to bed early. \n\n2. Get a reddit account without 69 in it.\n\nStep two was a joke. The point of doing this is people tend to work well with schedules. If you work at following them you end up doing the things you're scheduled to be doing after a bit. It's like your sleep schedule. If you go to bed by 11 enough nights in a row you'll find yourself waking up at 7 and being tired after 10. It just ends up working out that way. Also the really important part I didn't stress enough was that you stay outside of your room/apartment because that is where the things and people who will distract you are.",
      "author": "LandoSyztem",
      "created": 1633458242,
      "upvotes": 6,
      "replies": {}
    },
    "hfive8a": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfive8a/",
      "text": "Goddamn. You sound almost exactly like me.",
      "author": "manpersonbee",
      "created": 1633466498,
      "upvotes": 3,
      "replies": {}
    },
    "hfhvwjq": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfhvwjq/",
      "text": "It sounds relatable dude.\n\nHere is the thing. Try to find what you really want to do? is it music, arts, or whatever it might be? Take some risks and try new things. You are young so stop worrying too much and try to enjoy every moment you have.\n\n&#x200B;\n\n* Best way to learn English is through movies and books\n* To get over your depression I would suggest you to start working out. Believe me it will help you a lot. It clears your mind.\n* To stop your procrastination find your why? \n* And finally, about the communication skills, you just have to go and talk that's the only way. You just have to start taking small steps and you will soon be a good speaker.\n\nAnd finally, about the communication skills, you have to go and talk that's the only way. You just have to start taking small steps and you will soon be a good speaker.eones' highlight real which is depressing. Try to consume positive content Bruhh.\n\nGood luck.",
      "author": "Musashi-13",
      "created": 1633451680,
      "upvotes": 6,
      "replies": {}
    },
    "hfj7pcg": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfj7pcg/",
      "text": "Pick up a hobby, go to the gym and find a job. The busier you are the more time you will spend on studies. Helped me a lot",
      "author": "sorneto",
      "created": 1633471932,
      "upvotes": 2,
      "replies": {}
    },
    "hfk5bzb": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfk5bzb/",
      "text": "I feel your pain as a college freshman with the mentality of a 12 year old.\n\nI'm also super lonely because most of my high school friends either didn't go to college, took a gap year, or attended a different college/campus. I'm okay with it, since I'm very introverted in nature and in no rush to lose my virginity.\n\nCollege was when I stopped getting away with procrastination. When I realized my bad grades were because I didn't study good enough, I felt guilty about my time management skills. It was an awful feeling that made me cry.",
      "author": "JuliaTheInsaneKid",
      "created": 1633488430,
      "upvotes": 2,
      "replies": {}
    },
    "hfhphyt": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfhphyt/",
      "text": "watch Jordan Peterson",
      "author": "Key_Calligrapher6298",
      "created": 1633449080,
      "upvotes": -14,
      "replies": {
        "hfhv3sh": {
          "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfhv3sh/",
          "text": "no don't",
          "author": "kakusei_zero",
          "created": 1633451357,
          "upvotes": 7,
          "replies": {
            "hfi9lg1": {
              "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfi9lg1/",
              "text": "I oppose him politically and philosophically, but agree with his rather uncontroversial advice in 12 Rules.  Advocacy dragging along the disease model and identity politics have led us to view normal adaptation as fixed traits and arbitrary suffering.  It's very out-dated.  \n\nIf any given college student who is struggling developed each habit suggested in 12 Rules of Life one by one, they would certainly be a little healthier. Some of th3 rules are among the most evidenced determinants of functioning.",
              "author": "Sniffalisp",
              "created": 1633457393,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "hfi1m07": {
          "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfi1m07/",
          "text": "I second this. He inspired me to go on my all beef diet and I’ve never felt better. My body is deteriorating, but I feel mentally sharp",
          "author": "bill697",
          "created": 1633453997,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hfiwuy7": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfiwuy7/",
      "text": "getting a retail job has helped my social skills a lot.  Working makes me responsible because I need to work to have money, and I make sure to prioritize my assignments before that.  So like, part time work.  Getting outside and away from the screen also helps me out.  Maybe you can find some online friends to call while you all do homework?  Having someone to hold you accountable helps.",
      "author": "ninjacowboywizard",
      "created": 1633467123,
      "upvotes": 1,
      "replies": {}
    },
    "hfjjjft": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfjjjft/",
      "text": "Sorry for the wall of text I’m on mobile. I was just like you friend, I had toxic friends that weren’t truly considered my friends, and I was failing all my classes even though I was fully capable of doing them, I just was depressed and procrastinating. Luckily this happened my last year of high school while I was taking early college classes, and so far I haven’t fucked up my current actual college classes. My advice is this: being sociable is a skill, and just like any skill, you can learn it. Work hard at it if you truly want to have more friends. An unfortunate thing about learning to be sociable is that it is guaranteed you will embarrass yourself at some point, but there is not a single person on this earth who hasn’t had an awkward social interaction. I’m doing that right now, and I’ve already embarrassed myself so much, but it’s worth it because I’ve actually started to make friends. My advice for procrastination is just that you have to see what works for you. For me, I give myself rewards, wether that be ten minutes of scrolling through my phone, candy, whatever. Train yourself like you’re a dog if you have to is what I’m saying. But the bottom line is, school isn’t for everyone, and if you truly need to do something else, figure it out sooner than later",
      "author": "Nikibede",
      "created": 1633477577,
      "upvotes": 1,
      "replies": {}
    },
    "hfjjmtx": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfjjmtx/",
      "text": "I really recommend using a schedule and probably you can share a google calendar with friends. It makes it an incentive to finish it together and you get updated on homework you may have missed. Keeping a routine can also help a lot.",
      "author": "tatonoot",
      "created": 1633477622,
      "upvotes": 1,
      "replies": {}
    },
    "hfjm5qk": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfjm5qk/",
      "text": "I bet you found the sentiment expressed many times already, that adults don't have shit figured out, you don't get a box with all the answers when you turn 18 and that all the seriousness and knowledge you perceived of grown ups was a thin facade. We're all kids trying to figire this shit out. Don't take yourself seriously.",
      "author": "940387",
      "created": 1633478845,
      "upvotes": 1,
      "replies": {}
    },
    "hfjnl4h": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfjnl4h/",
      "text": "Find a healthy way to de-stress. Falling into the party-student lifestyle has pitfalls. I suggest going to the gym, walking, photography etc.",
      "author": "BattedSphere",
      "created": 1633479525,
      "upvotes": 1,
      "replies": {}
    },
    "hfk13br": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfk13br/",
      "text": "In addition to what as already been said, you need to look at who you surround yourself with. Is it people that haven’t matured?",
      "author": "maybehun",
      "created": 1633486348,
      "upvotes": 1,
      "replies": {}
    },
    "hfk71se": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfk71se/",
      "text": "About 10% of females and 30% of males don’t even have all of their brain development done until they are 25. \n\nWater, sleep, nutrition, and routines are what you need. The routine and structure that were external for you up until now have to be internalized…you must become the source of your routine. This is normal, don’t give up. It’s supposed to be hard. You’re doing fine.",
      "author": "ServingTheMaster",
      "created": 1633489306,
      "upvotes": 1,
      "replies": {}
    },
    "hfkrqif": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfkrqif/",
      "text": "That’s the neat part, you don’t!",
      "author": "Lifedeather",
      "created": 1633502665,
      "upvotes": 1,
      "replies": {}
    },
    "hflidi4": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hflidi4/",
      "text": "Sounds like you need some help with executive functioning skills! Assuming there is no underlying cause (ADHD, depression, etc), these should improve as your brain continues to develop. In the mean time, try looking into academic support offered by your school. There are likely offices that can help you with building and practicing better habits to improve your EF skills. If you think there may be an underlying cause, definitely consider therapy or psychiatric care, neurodevelopmental conditions such as ADHD can go undiagnosed for a lot longer than people realize, and treatment makes a HUGE difference!\nAlso remember this: Your prefrontal cortex is not fully developed until ~25 years at the earliest! People with ADHD or other conditions can take even longer than their neurotypical peers. Try not to be so hard on yourself. You are already showing great maturity and metacognition skills by recognizing that you are struggling!\nHere are some quick recommendations for helping to improve your experience in classes until you are able to build up your skills from an ADHD person who struggles with lots of the same things you are struggling with\n1. Focus on your demeanor during class. It sounds silly, but sitting up straight and facing forward and trying to appear attentive can help a lot. If nothing else, it shows the teacher you are trying. \n2. Experiment with organizational systems. Agendas don’t work for everyone. There are all sorts of ways to organize your tasks that can make more sense to you than the ones that were shoved down your throat growing up.\n3. Get active! Physical activity is awesome for mental health! Especially when it’s outside! Studies show that “green time” does wonders for ADHD, anxiety, depression etc. \n4. If you know you are about to need your executive functioning skills, flip your head up side down for a minute. Sounds stupid, but stimulating the vestibular system (balance system in your inner ear) can help to temporarily improve executive functioning!\n5. Try involving your senses! I keep lemon drops in my backpack for this reason. By using your senses to ground yourself in the present, you can focus a little better  \nI’ve got a million more suggestions I can share with you if you want, but that should be plenty to get you started.",
      "author": "kelpgb",
      "created": 1633524019,
      "upvotes": 1,
      "replies": {
        "hflkqdu": {
          "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hflkqdu/",
          "text": "Also, for procrastination, try doing something to snap yourself out of what you are doing. For example, yell out loud at yourself to stop what you are doing or stand up and do a few jumping jacks. Basically, just try to interrupt your current activity. Then, just start your work. Set a timer for a short time. Five minutes is plenty. Work for five minutes as hard as you can, then give yourself permission to stop if you want. It will be easier to work for those five minutes if you know that it ends after five minutes. Likely, once you’ve started, you will be able to keep going for longer than you expect. Remember, procrastination tends to be about the transition more than about the actual activity. If you can find a way to make that transition less painful, you will be able to get through it easier.",
          "author": "kelpgb",
          "created": 1633525291,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hfnc091": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfnc091/",
      "text": "Take a gap year. \n\nNothing will teach you how valuable and expensive a course is more than a full time job and bills. \n\nA 3 credit hour class here is 1800 bucks. When I was making 50k a year, that'd take me roughly 3-4 months to save up.\n\nTake a year to work at like 25k and come back with a new refreshed view on how failing courses is like burning money.",
      "author": "Awkward_Mail_2786",
      "created": 1633552399,
      "upvotes": 1,
      "replies": {}
    },
    "hfi16ky": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfi16ky/",
      "text": "Man up.",
      "author": "orangeblackteal",
      "created": 1633453819,
      "upvotes": -12,
      "replies": {
        "hfi1t1a": {
          "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfi1t1a/",
          "text": "You should be a therapist, this is good shit",
          "author": "bill697",
          "created": 1633454076,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "hfi8hqv": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfi8hqv/",
      "text": "Live on your own where you have to pay your own rent and shit out of money you earned.\n\nSeriously, I know 24 year olds who still act 13, low and behold they live with their parents rent free.",
      "author": "conker1264",
      "created": 1633456918,
      "upvotes": -2,
      "replies": {}
    },
    "hfiecnc": {
      "link": "/r/college/comments/q1vnni/how_do_i_get_rid_of_highschool_kid_mentality_and/hfiecnc/",
      "text": "do esteemable actions.",
      "author": "ObjectiveAnalysis643",
      "created": 1633459293,
      "upvotes": 0,
      "replies": {}
    }
  }
}