{
  "sid": "lf1sn1",
  "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/",
  "title:": "Does anybody actually understand what they are doing in college or do they just do work to pass?",
  "text": "I’ve have to take classes online because of my work schedule but it’s hard trying to teach myself these topics. It’s doable but difficult. For example, I’m an Accounting Major taking Business Stat and I understood the first 5 chapters but now I’m on chapter 7 and find myself using Chegg to complete my homework and quizzes. I do want to understand what I’m doing but it’s hard sometimes and find myself just completing the work to get a passing grade.",
  "author": "Friendly-Offer",
  "created": 1612750930,
  "over_18": false,
  "upvotes": 754,
  "upvote_ratio": 0.99,
  "comments": {
    "gmn0ovq": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmn0ovq/",
      "text": "I cant be the only one who just cheats on all his online classes",
      "author": "bald_butte",
      "created": 1612827726,
      "upvotes": 1,
      "replies": {}
    },
    "gmmfjqj": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmmfjqj/",
      "text": "Honestly I just want my credits. I already do what I go to college for in my free time. that being said it's not the teacher or the institutions responsibility to make you learn. If you aren't learning get online and figure it out. Most of us spend our free time scrolling through IG, reddit, and twitter. If you manage your time correctly you could learn, run a business, and set time aside to enjoy doing nothing.",
      "author": "Kirkthewebsurfer",
      "created": 1612817745,
      "upvotes": 2,
      "replies": {}
    },
    "gmltx9n": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmltx9n/",
      "text": "Think of what you're doing as learning a language. If you were living in mexico, you'd be picking up spanish because it's all around you. Some things come easier, some harder, and some words you'll just never use because nobody around you talks about things that require those words. But you'll absorb what you need to. And you'll have the framework to figure out what you need when something new and confusing presents itself. \n\nSo instead of Mexico, you're living in your chosen field of study. You're learning the language of that field, and you'll pick up what you need. This gets easier to see the further on you go as patterns emerge and consistent themes arise. \n\nYou're more capable and intelligent than you realize. Your brain is astoundingly good at capturing things you don't think it is.",
      "author": "scubasam27",
      "created": 1612808064,
      "upvotes": 1,
      "replies": {}
    },
    "gmlo7bj": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlo7bj/",
      "text": "I more or less am just doing the work to pass and in doing so I get enough of an understanding to do well enough. I tend to forget most of the technicalities of what I learn after I'm finished a course, but fundamentals stick well enough.",
      "author": "Epicsauce1234",
      "created": 1612805528,
      "upvotes": 1,
      "replies": {}
    },
    "gmlo2x2": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlo2x2/",
      "text": "I'm so guilty of that. In get to the next class and have to re-teach myself concepts that I forgot from previous classes. Chegg is great and dangerous at the same time. I'm trying really hard to understand o chem I because I have to take o chem II next semester. Doing the pomodoro technique has helped me along with using outside resources (because my prof is literally the worst). Accounting is wayyy beyond me, but doing practice problems could help. I don't know if there is an equivalent book to \"O Chem as a Second Language\" but you should try to find one. It breaks it down soooo much better than my prof or book.",
      "author": "haunt_mess",
      "created": 1612805475,
      "upvotes": 1,
      "replies": {}
    },
    "gmlmkx9": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlmkx9/",
      "text": "I just do the work to pass to be honest. I don’t care what I study as long as it’s easy, not stressful, not a lot of math or science, and doesn’t take a lot of time out of my day.",
      "author": null,
      "created": 1612804814,
      "upvotes": 1,
      "replies": {}
    },
    "gmlhrjm": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlhrjm/",
      "text": "I’m a CS major and have been programming since middle school. So I memorize all sorts of oddly specific details about JavaScript and C++ then go home and continue to build my react-based electron app. Or start up unity and continue my game project.\n\nBasically I’ve learned math and stuff from generals but have yet to actually learn anything in my actual CS classes.",
      "author": "Tuckertcs",
      "created": 1612802666,
      "upvotes": 1,
      "replies": {}
    },
    "gmlccdi": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlccdi/",
      "text": "Was just thinking about this yesterday. I can do the work and for the most part get it all done in a timely manner, but retaining the information isn't so easy.",
      "author": "Gamecool_10",
      "created": 1612800169,
      "upvotes": 1,
      "replies": {}
    },
    "gmlafvv": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlafvv/",
      "text": "Sometimes i really do, sometimes im just really good at essay writing",
      "author": "astonaidan",
      "created": 1612799281,
      "upvotes": 1,
      "replies": {}
    },
    "gmla8q8": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmla8q8/",
      "text": "In the last quarter of my teaching degree and every single class I’ve taken in the last 3 years has been: “All students deserve an education”, just add in teaching math, reading, writing, science, etc. The point of every. single. class. is exactly the same.",
      "author": "ArmadilloExternal479",
      "created": 1612799189,
      "upvotes": 2,
      "replies": {}
    },
    "gml9n5p": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml9n5p/",
      "text": "I complete the work to get the grade because it’s all useless information that I could’ve gotten away with not knowing. \n\nGetting a degree just proves you CAN do the work, then you go out and learn the real stuff in the field.",
      "author": "ethancknight",
      "created": 1612798906,
      "upvotes": 1,
      "replies": {
        "gmmgb53": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmmgb53/",
          "text": ">u CAN do the work, then you go out and learn the real stuff in the field.\n\nThis is what 90% of this sub reddit doesn't understand. Just get the piece of paper and keep the GPA atleast a 2.9. you'll actually learn the job if you start doing it.",
          "author": "Kirkthewebsurfer",
          "created": 1612818084,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gml578n": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml578n/",
      "text": "For me it’s dependent on the courses I take. Some more so than others...sometimes it has to do with my professor and their teaching style.",
      "author": null,
      "created": 1612796782,
      "upvotes": 1,
      "replies": {}
    },
    "gml4o8m": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml4o8m/",
      "text": "It's tough to balance learning the material and getting an A with zoom university these days. Sounds like you're dealing with some imposter syndrome to me though. I would venture to guess that you know more than you think.",
      "author": "Jayburr001",
      "created": 1612796517,
      "upvotes": 1,
      "replies": {}
    },
    "gml2p0i": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml2p0i/",
      "text": "Yes.",
      "author": "tyttuutface",
      "created": 1612795528,
      "upvotes": 2,
      "replies": {}
    },
    "gml15js": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml15js/",
      "text": "i teach myself by watching youtube videos on the topic. When it comes to quizzes and hw, i just cheat bc you will never see me reading a textbook with confusing ass words.",
      "author": "basicange",
      "created": 1612794718,
      "upvotes": 1,
      "replies": {}
    },
    "gmkzbsi": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkzbsi/",
      "text": "My classes are only 5 weeks (they use to be 10, which is what it still should be, but my statistics teacher told us they changed it so they could keep up with competition - I mean who gives a fuck about the education WE are PAYING for right?) We get SO MUCH information crammed into 5 weeks that I can hardly keep up! I'm basically working to get it done. I'm almost two weeks behind and EVERYTHING is due this Friday. Even the paper that I have only done an outline on when the rough draft and self evaluation was due this week and last. Now I have to do both plus finish final draft by Friday while also doing a shitton of homework for both classes. \n\nIt's bullshit. We deserve better than this.",
      "author": "Randilion8",
      "created": 1612793711,
      "upvotes": 1,
      "replies": {
        "gml1bkp": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml1bkp/",
          "text": "Mine are 8 weeks long and it's tough. I can't imagine 5 weeks. I'm having to read 100+ pages of a textbook every week per class and then have a writing assignment due on Wednesdays. I'm not reading all that so I basically just look up the answers online and I'm making straight A's.",
          "author": "Sola_Fide_",
          "created": 1612794809,
          "upvotes": 1,
          "replies": {
            "gmmu08w": {
              "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmmu08w/",
              "text": "Yep. 4.0 GPA right here for the first time in my life.. but I haven't really learned anything. And that GPA may go down because of my statistics class. She grades weird. And I have a rough draft, self eval, and final paper due in four days. I'm up from 6 am to around 1-2 am sometimes later every single day and I'm still struggling. I also work and take care of my kids so that plays a part.",
              "author": "Randilion8",
              "created": 1612824396,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gmkwyak": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkwyak/",
      "text": "Too burned out to care rn. Running on fumes and just trying to get things done.",
      "author": "KungP0wchicken",
      "created": 1612792336,
      "upvotes": 4,
      "replies": {}
    },
    "gmko8a1": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmko8a1/",
      "text": "[deleted]",
      "author": null,
      "created": 1612786301,
      "upvotes": 7,
      "replies": {
        "gml79bw": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml79bw/",
          "text": "I would really love to be in group me with students from other colleges^^. Makes studying more interesting",
          "author": "Amytof",
          "created": 1612797779,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gmkmcq4": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkmcq4/",
      "text": "Is this an actual question? In which case, yes, I do. Here’s the trick: find your niche in your field (or at least your subfield within your field) and go to office hours with a professor who teaches that. \n\nThat will give you guidance even if you don’t fully understand the path you are in now.\n\n(As in “actual” question, I meant a facetious question or a legitimate question)",
      "author": "al_the_time",
      "created": 1612784718,
      "upvotes": 1,
      "replies": {}
    },
    "gmkif3x": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkif3x/",
      "text": "I feel like if campus was open I would know/understand more. The online zoom classes or online and no lecture sucks.",
      "author": "Fatcat-Kappa",
      "created": 1612781067,
      "upvotes": 2,
      "replies": {}
    },
    "gmkfit4": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkfit4/",
      "text": "My college courses are online and I'm not actually learning anything, all I'm doing is work on and submit assignments before 11:59pm.",
      "author": "FifiiMensah",
      "created": 1612778166,
      "upvotes": 87,
      "replies": {
        "gmkoxoj": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkoxoj/",
          "text": "i felt that!",
          "author": "tchxx",
          "created": 1612786862,
          "upvotes": 15,
          "replies": {}
        },
        "gmku0mu": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmku0mu/",
          "text": "same. 2 quizzes due soon at 11:59pm, I try to do them an hour before submission",
          "author": "Oro-Lavanda",
          "created": 1612790509,
          "upvotes": 12,
          "replies": {
            "gml6skm": {
              "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml6skm/",
              "text": "i failed my very first quiz of the class </3 kinda discouraging",
              "author": "tchxx",
              "created": 1612797557,
              "upvotes": 3,
              "replies": {
                "gmlgwnp": {
                  "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlgwnp/",
                  "text": "don't give up. you will do better next quiz :)",
                  "author": "Oro-Lavanda",
                  "created": 1612802277,
                  "upvotes": 1,
                  "replies": {}
                },
                "gmolczg": {
                  "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmolczg/",
                  "text": "That's ok. It's not the end of the world. You'll be fine",
                  "author": "hasrocks1",
                  "created": 1612864494,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gmlgpiu": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlgpiu/",
          "text": "This. My motivation to study is zero as well. Every day is a constant battle against myself",
          "author": "unholymanserpent",
          "created": 1612802186,
          "upvotes": 3,
          "replies": {}
        },
        "gml1ys2": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml1ys2/",
          "text": "Same, but I'm only on my second semester so I guess it doesn't matter as much since the more important stuff comes later",
          "author": "SlateCrimson",
          "created": 1612795153,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gmkesdw": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkesdw/",
      "text": "Yeah. In general education courses (anthropology, biology, stuff like this) I don't mind that because I won't really need them anyway, but in CS courses (I am a CS student) I get nervous when I don't understand certain topics and instead of memorizing, I try to understand them.",
      "author": "UniqueueGlobalist",
      "created": 1612777428,
      "upvotes": 2,
      "replies": {}
    },
    "gmkenut": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkenut/",
      "text": "It's all BS, but there's no way around it.",
      "author": "REVIGOR",
      "created": 1612777300,
      "upvotes": 4,
      "replies": {}
    },
    "gmk1wgc": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmk1wgc/",
      "text": "Well to be fair you don’t need to understand everything in all your classes to pass. I take that as a feature rather than a glitch in the education system. However, for courses related to your career, real understanding will often help you in the future and save you tons of pain and suffering. \n\nYou might not get there in time to pass that test you need but still, get away with as much learning as you can, in spite of having to take shortcuts to pass (passing should still be your priority above learning everything)",
      "author": "_OriamRiniDadelos_",
      "created": 1612765509,
      "upvotes": 3,
      "replies": {}
    },
    "gmjzi82": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjzi82/",
      "text": "My major is easy for me and I am already familiar with half of the info, but honestly I just do the work in most of my classes w/o really learning or retaining much. Maybe if I didn't work/have other responsibilities, I would try to actually understand the material, but I just don't really have the capacity to do that right now",
      "author": "pumpkin-jesus",
      "created": 1612763645,
      "upvotes": 4,
      "replies": {}
    },
    "gmjykg5": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjykg5/",
      "text": "Yessir",
      "author": "Spritez128",
      "created": 1612762942,
      "upvotes": 1,
      "replies": {}
    },
    "gmjy9wi": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjy9wi/",
      "text": "In most of my major courses I genuinely want to understand the material. I get this really uncomfy feeling if I do something without understanding it, for example, just plugging and chugging into equations without understanding why it works. It's like an anxiety thing I guess. It also helps a lot for exams.\n\n\nIt's for this reason that I have never used Chegg and don't really plan on it. If I get the answer from online, the least I could do is try to reconstruct the solution based on the answer, sort of experiment to find the solution.\n\n\nThe only class I didn't do this in was in a major-required class whose concepts future class won't build off of, taught by a teacher who gave absurd extra credit and 95% of the class an A if you had half a brain, and was just in general a poorly taught and very confusing class with fairly unintuitive concepts (particularly since our teacher was awful). But in any other circumstance I really do try to understand what's going on. I start panicking if I don't and it's not good for my mental.",
      "author": "StoicallyGay",
      "created": 1612762729,
      "upvotes": 37,
      "replies": {
        "gmkwpe6": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkwpe6/",
          "text": "Computer science teachers are hit or miss",
          "author": null,
          "created": 1612792191,
          "upvotes": 7,
          "replies": {
            "gml0niq": {
              "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml0niq/",
              "text": "Mine is a 'miss'.",
              "author": "lixermanredditman",
              "created": 1612794449,
              "upvotes": 7,
              "replies": {
                "gmlbpfe": {
                  "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlbpfe/",
                  "text": "Always.",
                  "author": "mgs108tlou",
                  "created": 1612799871,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "gmlmdko": {
              "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlmdko/",
              "text": "Not wrong. I had two great computer science teachers, they were knowledgeable, extremely fair, taught well, and had extremely helpful homeworks that both made you apply what you learned, as well as learn more.\n\n\nMy other CS teachers were, to put it lightly, complete dogshit. Like the type where you even wonder why this person is teaching because they're clearly putting 10% of the effort or they are just terrible professors.",
              "author": "StoicallyGay",
              "created": 1612804726,
              "upvotes": 4,
              "replies": {}
            },
            "gml3xkh": {
              "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml3xkh/",
              "text": "Felt that",
              "author": "ChocoMustachy",
              "created": 1612796150,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gmjx2tn": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjx2tn/",
      "text": "I understand but I agree with another commentator on here. It might be best to go to office hours or see if your school offers tutoring",
      "author": "Panthera_leo22",
      "created": 1612761864,
      "upvotes": 4,
      "replies": {}
    },
    "gmjvfhq": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjvfhq/",
      "text": "Ask help from your classmates. Humans are smart at figuring things out on their own but when humans work together it's when the real learning and problem solving happens.",
      "author": "Romano16",
      "created": 1612760722,
      "upvotes": 13,
      "replies": {}
    },
    "gmjtae8": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjtae8/",
      "text": "I feel you. I’m the sane way. I hate school so I’m just trying to get out ASAP",
      "author": "HateInAWig",
      "created": 1612759317,
      "upvotes": 27,
      "replies": {}
    },
    "gmjrx1z": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjrx1z/",
      "text": "For my Chemistry and Math courses I find it fairly easy to understand the material because I'm genuinely interested in the subjects and I chose professors that I knew would give clear explanations of the material, but in my Physics course I'm basically surviving off of a bare-bones understanding of the material. Hang in there.",
      "author": "Noltu",
      "created": 1612758452,
      "upvotes": 3,
      "replies": {
        "gmjuqrr": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjuqrr/",
          "text": "Most physics professors (at R1 universities) suck at teaching, it's a shame.",
          "author": "twentyoneastronauts",
          "created": 1612760262,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gmjpqd5": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjpqd5/",
      "text": "It’s more that I’ll forget the majority of what I learn, but you have to at least understand it to complete it in the first place",
      "author": "BackgroundProgress08",
      "created": 1612757116,
      "upvotes": 265,
      "replies": {
        "gmkwwol": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkwwol/",
          "text": "A good analogy is a lawyer. They have to memorize so many cases that that there's no way they'll remember every detail about the case. But, they know the gist and know where to find the info.\n\nCollege is a glorified training day to get enough information to understand your field's reference material.\n\nYmmv based on your field obviously",
          "author": "BohemianJack",
          "created": 1612792311,
          "upvotes": 73,
          "replies": {
            "gmkzy0q": {
              "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkzy0q/",
              "text": ">They have to memorize so many cases\n\nNot really though.",
              "author": "bl1y",
              "created": 1612794056,
              "upvotes": 12,
              "replies": {
                "gml52gu": {
                  "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml52gu/",
                  "text": "Considering there's an entire industry dedicated to making case brief books for law school...",
                  "author": "zacker150",
                  "created": 1612796715,
                  "upvotes": 8,
                  "replies": {
                    "gml5jmr": {
                      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml5jmr/",
                      "text": "Not for memorizing cases. Law school exams are typically issue-spotters, not regurgitating the facts of a case.",
                      "author": "bl1y",
                      "created": 1612796952,
                      "upvotes": 3,
                      "replies": {
                        "gml6zh2": {
                          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml6zh2/",
                          "text": "Right, but you need to memorize the cases in order to spot and analyze the issues. \n\n\"The issue is X. The Relevant law is Bob v Eve which held XYZ and Sue v. Jane. which held ABC. Plaintiff will argue X, while defendant will argue Y. The court should follow Bob v Eve because [substantive comparison of the fact pattern to the one in Bob v Eve and Sue v. Jane]\"",
                          "author": "zacker150",
                          "created": 1612797649,
                          "upvotes": 4,
                          "replies": {
                            "gml821j": {
                              "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml821j/",
                              "text": "I don't recall ever having to do anything like that, aside from a handful of truly benchmark cases. It's much more about knowing the rules themselves than the cases.\n\nBut, I've only passed two bar exams, so what do I know?",
                              "author": "bl1y",
                              "created": 1612798157,
                              "upvotes": 0,
                              "replies": {
                                "gmlcoo5": {
                                  "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmlcoo5/",
                                  "text": "You get the point of what he was saying, why are you correcting an example my dude?",
                                  "author": "mttlln",
                                  "created": 1612800331,
                                  "upvotes": 5,
                                  "replies": {
                                    "gmms1z4": {
                                      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmms1z4/",
                                      "text": "Well he is a lawyer isn't he? It's his job to be pedantic ;)",
                                      "author": "Ken_Mcnutt",
                                      "created": 1612823460,
                                      "upvotes": 4,
                                      "replies": {
                                        "gmnbmia": {
                                          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmnbmia/",
                                          "text": "Good point",
                                          "author": "mttlln",
                                          "created": 1612833396,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gmjph6w": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjph6w/",
      "text": "Yes I understand. I don’t think it’s good at all you’re using chegg. You should be going to office hours.",
      "author": null,
      "created": 1612756963,
      "upvotes": 31,
      "replies": {}
    },
    "gmjo1x8": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjo1x8/",
      "text": "i try to understand the concepts i am learning because more often than not it will make solving problems easier",
      "author": "youretookind",
      "created": 1612756136,
      "upvotes": 69,
      "replies": {
        "gml4ttq": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gml4ttq/",
          "text": "That's what I'm trying to in BIOLOGY. Especially since I failed it the first time due to not studying and taking my time with the concepts.",
          "author": "DitzyWhooves",
          "created": 1612796596,
          "upvotes": 8,
          "replies": {}
        },
        "gmm703l": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmm703l/",
          "text": "It's a must with any math, logic related course.",
          "author": "Blorb_and_Blob",
          "created": 1612813880,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gmjkfli": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjkfli/",
      "text": "Yes, you should understand what you’re doing in class. If you don’t understand it, it’s your responsibility to use whatever resources are available to you (such as office hours, peer study groups, tutoring if your college offers it, etc) to try to.",
      "author": "Drozengkeep",
      "created": 1612754105,
      "upvotes": 22,
      "replies": {
        "gmk1h7m": {
          "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmk1h7m/",
          "text": "Well they clearly are trying. “Try” seems to me like a pretty worthless word in academic matters. Unless the person is genuinely not trying which is not about being stupid as much as about not having the time, circumstances or planning to drop a class.",
          "author": "_OriamRiniDadelos_",
          "created": 1612765167,
          "upvotes": 11,
          "replies": {
            "gmkijm7": {
              "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmkijm7/",
              "text": "I had a lot of classmates who truly didn’t try & would do poorly on exams then wonder why. Most of them had the time but they just couldn’t bring themselves to sit down and actually study hard",
              "author": "YungSchola24",
              "created": 1612781190,
              "upvotes": 6,
              "replies": {
                "gmnpjvf": {
                  "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmnpjvf/",
                  "text": "I’d say that they didn’t know how. “They just could bring themselves” just sounds to me like you and your friends didn’t know the actual reason for their troubles rather than them being actually “lazy” or mentally incapable of doing studying",
                  "author": "_OriamRiniDadelos_",
                  "created": 1612840642,
                  "upvotes": 1,
                  "replies": {
                    "gmnqpno": {
                      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmnqpno/",
                      "text": "The classmates I’m referring to are some of my friends lol. Even though textbooks can be boring, I like to sit down and actually read the chapters we have that week. Some people like to skim or just read the key notes that the teachers upload. I feel like a lot of them struggle with staying off their phone while studying too. I don’t know what they do every second of every day but I know some of them don’t study as much or as hard as they could. I agree that a lot of people don’t know how to study properly",
                      "author": "YungSchola24",
                      "created": 1612841279,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "gmnr0yz": {
                      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmnr0yz/",
                      "text": "And you’re right, they definitely aren’t lazy. I just think it’s hard for them to get interested. Especially when the chapter is all about cell mitosis lol",
                      "author": "YungSchola24",
                      "created": 1612841449,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gmjgzel": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjgzel/",
      "text": "The latter",
      "author": "Space_-Cowboy",
      "created": 1612752287,
      "upvotes": 2,
      "replies": {}
    },
    "gmjgy3e": {
      "link": "/r/college/comments/lf1sn1/does_anybody_actually_understand_what_they_are/gmjgy3e/",
      "text": "i feel the exact same way bruh",
      "author": "Timely_Assist_2260",
      "created": 1612752266,
      "upvotes": 46,
      "replies": {}
    }
  },
  "updated": 1634054902
}