{
  "sid": "qhxw8j",
  "link": "/r/college/comments/qhxw8j/moving_out_what_to_tell_roommate/",
  "title:": "Moving Out, What to tell Roommate",
  "text": "Background: I am an 18-year-old male that just moved halfway across the country to go to college and am currently living in a two-person dorm room on campus.\n\nHow do I tell my roommate I am moving into a single-person dorm room. There is nothing wrong with him as a person, and for the most part, he is a pretty good roommate; He cleans up after himself and has been respectful of everything I have asked, we even have a lot of common interests, but there are three main reasons I am moving to my own room.\n\nOne, We have very different schedules. Day-to-day life is usually awkward because the time that I would like to spend working on homework or other things I need to focus on, is the time that he would like to watch a show or play his guitar, and when I would like to relax and play video games or watch something is usually the time he would like to go to bed. We also wake up at very different times due to the fact that I stay up significantly later than him most days of the week.\n\nTwo, We are not really friends. This is hard because when we both want to relax at the same time, we usually want to be doing different things that are hard to do at the same time in the same space. This also presents a trust issue for me. I don't feel like I can ever leave anything out that I consider valuable. I also don't feel comfortable talking about private information, like money, my true feelings/secrets, or my grades, when we are both in the room even if I am on the phone with someone else like my parents.\n\nThree, I have a hard time sharing, especially with someone to who I do not fully trust. I grew up an only child until I was ten years old, and my younger sibling is female, so sharing things, especially a room, has been out of the question for me my entire life and switching to having to share everything has been really difficult for me.\n\n(Cost is not an issue with switching rooms, it will actually end up being about the same cost where I am staying right now compared to where I will be staying.)",
  "author": "nickc0007",
  "created": 1635459011,
  "updated": 1635779907,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hifutg6": {
      "link": "/r/college/comments/qhxw8j/moving_out_what_to_tell_roommate/hifutg6/",
      "text": "honestly, a little white lie isnt bad. be like “hey i requested to be in a single a while ago before we even became roommates and they are now moving me in. it was nice being your roommate, though!” he probably wont care much tbh im sure he’ll be happy to get a room to himself (at least for some time)",
      "author": "thomasshclby",
      "created": 1635460313,
      "upvotes": 5,
      "replies": {}
    },
    "hiim67n": {
      "link": "/r/college/comments/qhxw8j/moving_out_what_to_tell_roommate/hiim67n/",
      "text": "If you’re not friends then I don’t see why it matters if it’s a little awkward. You can just hit them with a “I got the opportunity to move into a single, it’s been nice rooming with you though.” Be polite about it and don’t go into too much detail. You don’t owe them an explanation, but it’s nice to be courteous and give them a heads up.",
      "author": "bentheman02",
      "created": 1635517864,
      "upvotes": 1,
      "replies": {}
    }
  }
}