{
  "sid": "r1xjbw",
  "link": "/r/college/comments/r1xjbw/professor_hasnt_input_any_grades_semester_ends_in/",
  "title:": "Professor hasn’t input any grades.. semester ends in 2 weeks.",
  "text": "Am wondering what to do about this one Professor who has yet to give any feedback on my papers whatsoever\n\nYou would think that since our only assignments are to write/thoroughly respond to questions, that there would be some sort of return on all the effort put in on our part. Nope. \n\nIs there anyone I could contact to potentially give this Professor a “nudge” in the right direction? Or should I take the gamble and wait it out? Haven’t had this happen before is all\n\nThanks.",
  "author": "sleepystonez",
  "created": 1637849891,
  "updated": 1638206982,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hm1csja": {
      "link": "/r/college/comments/r1xjbw/professor_hasnt_input_any_grades_semester_ends_in/hm1csja/",
      "text": "Couple of thoughts from a guy who spent 5 years teaching in higher education:\n\n1. Have you already talked to the professor?\n2. Have you specifically stated your concern with the professor on this matter?\n3. Do you have receipts? i.e. emails, their syllabus stating that only the papers are what you're graded on, screenshots of conversations, etc.\n4. If you have talked to the professor and they've still not reported it out, email them again and specifically *ask* for your grades.  Sometimes there's a disconnect between the their gradebook and how it's presented to you on the medium.  I ran into that a few times and had to just explain to the student how their grade was calculated. Sometimes, they were right due to errors on the platform. Due to Ferpa they probably won't email you your grades. If they do, as the kids say, \"They done messed up a-a-ron\". Be open to solutions\n5. If you have talked to the professor and they're just behind (because I'm not going to assume they're being lazy \\[not a shot at anyone, I just don't assume that after a colleague of mine lost his mother and was behind on 4 classes\\]) you can send an email to the department head cc the professor.  Heed these words: ***DO NOT EXCLUDE THE PROFESSOR ON THAT EMAIL.*** Be professional (i.e. no accusations, no character attacks), stick to your concerns (I'm concerned about my grade because I've received little feedback and I would like to know where I stand), stick to the syllabus.  That is a loosely legally binding document, so if this prof states \"I return papers within x weeks\" gently remind both of them of that statement.\n\nThings not to do:\n\n1. Come with an entitled attitude.  \"You stated this and you didn't deliver therefore we gotcha\".   Remember- life happens.  It helps that you assume that in the email.  \"I know life is busy and especially the winter semester is busy but I do want to take time to express my concern over the lack of reporting for our grades.\"\n2. Jump the chain of command.  Many people are unaware of this but Dean's and Department heads rarely, if ever, know about what's going on in a class. They, by default, always refer back to the teacher.  My Dean and I were on a first name basis by the end of tenure (not due to complaints from students but because of our shared cigar interests) and he would call me if there was a problem and basically ask me to handle it in-house and let him know if he needed to step in.  So those students who thought they were getting away with something by excluding me did nothing but piss me off by not coming to me first.\n\n&#x200B;\n\nFor the love of all things academia and scientific, please, please, put on your \"killing them with kindness\" face.  You have to be open to solutions, but you have to play the corporate game.  Everything needs to be documented.  If things slide sideways for you and you have receipts you'll be golden.\n\nGood luck.",
      "author": "MachineFlimsy5261",
      "created": 1637850777,
      "upvotes": 8,
      "replies": {}
    },
    "hmjhsyg": {
      "link": "/r/college/comments/r1xjbw/professor_hasnt_input_any_grades_semester_ends_in/hmjhsyg/",
      "text": "Thank you so much, this helps a lot. I just emailed her she relied quickly saying she said she will “get them back” to me within the next week… but by then there will only be one more week left lol. She also said she doesn’t use Blackboard (the place where are grades are supposed to be), which stinks but makes sense as to why there’s nothing there. Hopefully she follows through with it and I’ll get these papers back soon! Thanks again :)",
      "author": "sleepystonez",
      "created": 1638200444,
      "upvotes": 1,
      "replies": {}
    }
  }
}