{
  "sid": "qglimi",
  "link": "/r/college/comments/qglimi/is_this_website_legit/",
  "title:": "is this website legit :')",
  "text": "guys i just did my end-of-trimester exam (EOTE) today for one of my courses and i'm freakin out \\~ ! So i went on this website to predict my overall course grade because i don't know how I went on the EOTE (i was feeling confident and not confident at the same time during it). The website is saying the below... But it's too good to be true that all i need to pass my course is 37-ish marks on my EOTE ??considering i failed the first assessment item (luckily i passed the second one which is worth 40%). basically i need 50% overall to pass and left side says 50.10%. I would like to plz confirm with u guys if this is true or maybe someone can teach me how to do it by hand jk?? haha but i am sure i got more than 37 marks but just preparing for if i do get 37. thxxx :')\n\nhttps://preview.redd.it/m6nlzps5dwv71.png?width=1696&format=png&auto=webp&s=65cc11194e9fda9aeeeac1121dc88b017fab4c51",
  "author": "dbzonepiecenaruto",
  "created": 1635298666,
  "updated": 1636175282,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hi74rbo": {
      "link": "/r/college/comments/qglimi/is_this_website_legit/hi74rbo/",
      "text": "If its correct that youre current grade is 50.1% then yeah it seems right. Im not sure where youre getting the 37 mark number. But if you only need a 50% to pass then yeah you dont need to get many points, only half",
      "author": "taybay462",
      "created": 1635301336,
      "upvotes": 1,
      "replies": {
        "hi8ankn": {
          "link": "/r/college/comments/qglimi/is_this_website_legit/hi8ankn/",
          "text": "i just plugged in a random number in that box to see whether it will give at least a 50% for the overall course and then i narrowed it down to 37 marks which according to the website, will mean just passing the course but anyways thank-you !! it's coz if i remove that row, my current grade will be 58.83% and then it will say i need 36.75% in the final assessment which in my case is the EOTE.",
          "author": "dbzonepiecenaruto",
          "created": 1635330012,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}