{
  "sid": "q1a9as",
  "link": "/r/college/comments/q1a9as/transfer_decision/",
  "title:": "Transfer Decision",
  "text": "Hi, I find myself stuck right now. I am at a large state school about 3 hours from home. I am a sophomore, but spent my whole freshman year doing virtual school from home. I actually really enjoyed doing school from home, some of my closest high school friends were also home, and I had a blast. This being my first time on campus, things have been shaky. I have my routine down, but I just feel in the middle, I don’t love this school, but I also don’t hate it. The thought of transferring has ran through my head quite often during my time here. Many people said they were very surprised of my decision to come here, and I would agree. I would say I made the decision to go here in an attempt to be in an environment I am uncomfortable in, a large school that is somewhat far from home, in order to promote growth for myself. While this experience has grown me and I have learned some great lessons, it has taken a hit on my happiness and mental health. The size isn't as big of a factor as I thought, but I often find myself missing my family and friends and just wish I was closer to home. I do have a car on campus and can go home any weekend I choose, but it would just be nice to be able to drive home, then drive back if there is some sort of event going on at school later that day/night. There is a small Jesuit University about 30 minutes from my house that I am looking at. I was initially looking at it because of its close distance to home and because I would have the opportunity to live with some of my closest friends (the ones I mentioned earlier who I stayed home with), but it slipped my mind that the University is merging with another University in Fall of 2022. This merge would also include the programs being transferred over to the University I am looking at, and among these programs is a DPT undergrad/grad program, which is my desired career path. The school I am at now has a great kinesiology program, but I would have to go elsewhere for grad/PT school. However, at this new university I would be able to earn my DPT without having to apply somewhere else for grad school. I am just really stuck right now, I know I am going against the recommended advice: give it at least a year before transferring and don't go where your high school friends are. While staying a full year here would make sense, I often think to myself: can I really do another semester here? I would greatly appreciate any advice or opinions regarding my situation and I thank you for reading this long spiel.",
  "author": "rpark2",
  "created": 1633368459,
  "updated": 1634084232,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hfdrpjr": {
      "link": "/r/college/comments/q1a9as/transfer_decision/hfdrpjr/",
      "text": "mental health is SO important. If you truly are unhappy and think you would benefit being closer to home, then I advise you to do it. Transferring is extremely common so don’t think it make you look bad. Also you’re the one paying to go to school..don’t pay thousands of dollars to be unhappy!! \n\nI’m currently in a similar position except i’m a first year student. I don’t really like the school I chose and i’m sick of hearing “give it a chance” when I have been here for 8 weeks now. It hasn’t gotten better and i go home every weekend. i’m starting to think there no point in wasting time here when i would be happier closer to home. but ALAS it is up to you and where you want to spend your time and money!!",
      "author": "i_lovemymom03",
      "created": 1633372220,
      "upvotes": 1,
      "replies": {
        "hfe05l6": {
          "link": "/r/college/comments/q1a9as/transfer_decision/hfe05l6/",
          "text": "Thanks so much for the response! I wish you luck in your situation too!",
          "author": "rpark2",
          "created": 1633375338,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}