{
  "sid": "r4uqp9",
  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/",
  "title:": "University Housing Needs to be Affordable to Student Workers",
  "text": "It’s insanely cruel that students who work on campus, typically for minimum wage, would be forced to take out loans to live on that very same campus. \n\nFor example, I was paid about $13/hr at my previous campus job. Due to campus policies, I wasn’t allowed to work for more than 20 hours/wk and often worked much less due to how much competition there was from other student workers. But let’s say ideally I worked for 20 hours that week on campus. This would give me $1,040/mo. Most financial experts would agree you shouldn’t be spending more than 30% of monthly income on rent. That means my monthly fee for housing should be no more than $312. \n\nHowever, that was not the reality. The reality was that I was paying $1000/mo with my installment plan. Colleges need to do better. Half of my friends are either living in their cars or sleeping on my couch in my overpriced dorm. We all work on campus, but have to take extra work just to get by.\n\nUniversities need to do better. They can’t expect their students to succeed, especially the ones that work for them, if they’re struggling to find a roof to sleep under. Either pay us MORE or LOWER the cost of housing. Housing is a human right and these institutions can do plenty to support their students effectively.",
  "author": "SensitiveAries",
  "created": 1638188732,
  "updated": 1639865939,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 0.89,
  "comments": {
    "hmj3d7t": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmj3d7t/",
      "text": "The dorms exist to make them money.  If you want cheaper housing look into renting a room off campus or getting a job off campus. No one is forcing you to work on campus.",
      "author": "1976Raven",
      "created": 1638193501,
      "upvotes": 5,
      "replies": {
        "hmj6dm5": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmj6dm5/",
          "text": ">No one is forcing you to work on campus.\n\nHello, work/study? I sort of agree with you, but even living and working off-campus is completely unsustainable. Housing prices are way too high and minimum wage is way too low. We need to at least double minimum wage and pass legislation to stop the rising housing prices if your suggestion is to be helpful in the least",
          "author": "TicTacKnickKnack",
          "created": 1638195076,
          "upvotes": -1,
          "replies": {
            "hmj9ska": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmj9ska/",
              "text": "None of that stuff will happen. There's absolutely no reason that any legislator would ever go for that. You're telling me that you want to give unskilled people more money AND reduce how much money people can make from real estate? People making money from real estate are paying more taxes than a minimum wage worker. That is more valuable to the government. \n\nPeople who work minimum wage are an integral part of society, as much as the PHD people. Without people working shitty minimum wage jobs, there would be a lot of stuff that wouldn't get done in this country. Paying them more isn't the answer. If you want more money, become more skilled or work harder.\n\nHere's how tax breaks for large companies work. The government often will give incentives and huge tax breaks for large companies moving into a certain locality. Typically, state government will provide these breaks because they know that the return on investment *particularly* from the taxes paid by workers will still net a profit. Bringing Amazon warehouses into a state on FREE land and no taxes for years still nets the state government a profit because of the employees that business hires. \n\nThere are tons of businesses looking to move into states with low income requirements. They literally contact state government asking what the enforced minimum wage is if they'd move into the state. Some walk away when the baseline is 15 an hour. The government can't just turn all of these down, because they are money makers for taxes. If state governments start asking for a higher minimum wage, there just won't be any job creation in that state. It's a fine line that's not as easy as just paying people more. \n\nLegislation can't stop rising housing prices. The country works on a free market. Any dumb dick can put up a 2 bedroom 1 bath for $1 million and nobody can do anything about it. If housing goes up and people keep paying it, it will continue to go up. It can only go up so far before nobody can pay for it.",
              "author": "Awkward_Mail_2786",
              "created": 1638196781,
              "upvotes": 1,
              "replies": {
                "hml52o1": {
                  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hml52o1/",
                  "text": "I resent your idea that minimum wage workers are unskilled. They absolutely are. That’s why you have to be trained in minimum wage jobs. \n\nDo you know how to make a caramel Frappuccino? Can you do it in under 5 minutes while a customer yells at you? My friend does this for minimum wage on our campus Starbucks. \n\nDo you know how to perform maintenance on an entire building’s wifi?  My friend does this for minimum wage for the dorms. \n\nDo you know how to upkeep an arboretum? Can you identify when when dozens of species of flowers should be in bloom? Do you know how to reset the temperature of a greenhouse? My friend does this for minimum wage on our campus. \n\nCan you input data from Canvas into a deaf-blind reading program? Can you help students with physical and mental disabilities navigate a computer or test scantron? This is what I do for minimum wage on our campus.\n\nWe are skilled. We are underpaid. We do work extra jobs outside of campus, but some of us cannot because we can’t afford cars and the public transportation in our city is unreliable (at best). If you feel that minimum wage workers are so integral to society, it follows we should pay them as such. You can’t pay lip service to our “brave essential workers” then badmouth their skills and pay them next to nothing.",
                  "author": "SensitiveAries",
                  "created": 1638224430,
                  "upvotes": 3,
                  "replies": {
                    "hmnh3qf": {
                      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmnh3qf/",
                      "text": "Bleh. \n\nThe thing is, they probably won't stay there. I suppose I wasn't thorough enough to include that they are great starter jobs. I mean, I worked a few when I first started. \n\nPeople in their 40's working minimum wage because they haven't done anything don't deserve more pay. Minimum wage workers ARE integral but paying them more isn't what we need to do. You can't just pay the low end and expect nothing to change, that's ridiculous. \n\nAs much as it hurts a lot of people's feelings and stuff, we need unskilled people doing minimum wage work. Nobody is making them do it, and it's a decent opportunity to build skills.\n\nAll of your friends should search for better jobs. If it was all about money, they'd go find somewhere that would pay more. Those jobs might be easy and comfortable. That's probably why they pay so low.",
                      "author": null,
                      "created": 1638272354,
                      "upvotes": 1,
                      "replies": {}
                    },
                    "hmlgfqn": {
                      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlgfqn/",
                      "text": "I think the terms skilled and unskilled labor can run people the wrong way. But a quick Google search defined skilled labor as someone who is highly trained or educated with skills that are mentally or physically complex. I would argue that unfortunately, not many student jobs on a college campus are very skilled, because if they required long training periods, the school would hire someone from the outside because they can't afford to train people every 4 months on something that takes 6 months to learn.\n\nSo do you have skills, yes. Are they highly technical or complex, requiring extended periods of training or formal education, no. My current location is going to have a massive wave of retirement in the next 2-5 years and everyone is in a panic because that is really not enough time to replace a new generation of engineers and machine operators. We don't have enough electricians or mechanics to do maintenance, and to get someone through an apprenticeship means they're basically dependent for several years.\n\nEach of the positions you mentioned has the potential to become a fully skilled profession, as a franchise owner, an it b professional, or an educator/education administrator. But a few months on the job does not make you a skilled laborer, nor does several years on an easily replaceable task.",
                      "author": "Thelton26",
                      "created": 1638229339,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hmlcaxj": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlcaxj/",
              "text": ">We need to at least double minimum wage\n\nIt's really easy to find work right now as a student. It will be really hard if you doubled the minimum wage. In a lot of areas that would bring it close to what many majors make after graduation. College enrollment would drop, more people would be entering the unskilled labor workforce, and businesses would operate with less employees.\n\n>pass legislation to stop the rising housing prices\n\nWhat would this legislation look like? How would it keep rentals available after everyone stopped investing/building because the returns were sub-par? Is not being able to find housing preferable to being able to reliably find housing that is priced for it's market? Property sales prices would not be affected, so if those continue to increase then there will be a lot fewer people renting them out at the mandated bargain basement prices because that rental income would no longer provide a margin over the mortgage and property taxes.",
              "author": "darniforgotmypwd",
              "created": 1638227506,
              "upvotes": -2,
              "replies": {}
            }
          }
        },
        "hml9iiy": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hml9iiy/",
          "text": "The problem is accommodation. I work two jobs, one on campus and the other for a family friend’s restaurant. I’m extremely lucky because they know me personally and accommodate my class schedule. This is not the case for the majority of students. Most jobs do not accommodate your class schedule and will fire you in favor of someone who doesn’t have a class during their peak business hours. \n\nHousing off-campus is far more expensive than student housing. For reference, the average rent in my city for a studio apartment is $1,710 according to Zillow.",
          "author": "SensitiveAries",
          "created": 1638226303,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmjb6zy": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmjb6zy/",
      "text": "But it's not even a full time job...?",
      "author": "Lower_Roll679",
      "created": 1638197445,
      "upvotes": 3,
      "replies": {
        "hml8z8s": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hml8z8s/",
          "text": "I can’t work full-time because I’m a full-time student.",
          "author": "SensitiveAries",
          "created": 1638226079,
          "upvotes": 6,
          "replies": {
            "hmmbkak": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmbkak/",
              "text": "Right, that's why you take out loans to pay your living expenses. Lol\n\n\n(Although a lot of people do work full time in school 🤷‍♀️)",
              "author": "Lower_Roll679",
              "created": 1638243470,
              "upvotes": 0,
              "replies": {
                "hmme4ya": {
                  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmme4ya/",
                  "text": "The school doesnt allow you to work full time as a full time student. That was mentioned in the post. Also mentioned was OP not wanting to take out loans with high interest rates to pay for housing. \n\nI'm not going to completely trash talk you, but do better. Like, you clearly didnt read the post and then threw your opinion out there like you knew better than OP. Kinda, or rather very, condescending.",
                  "author": "AHumbleLibertarian",
                  "created": 1638244679,
                  "upvotes": 5,
                  "replies": {
                    "hmmlhvc": {
                      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmlhvc/",
                      "text": "You're being really arrogant while also being blatantly wrong. The post doesn't say that they aren't allowed to have a full time job, only that their campus job hours are limited by policy (which is true at virtually every college that offers student jobs). Yeah, it sucks to take out loans for housing, but it is ridiculous to expect housing handed to you on a platter just because you work part time.",
                      "author": "Lower_Roll679",
                      "created": 1638248410,
                      "upvotes": -1,
                      "replies": {
                        "hmmoun4": {
                          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmoun4/",
                          "text": "You're suggesting OP to quit their on campus job to work full time? What if they dont have a car or other transportation? Also, its ridiculous to expect someone to be given housing? An actual need to be able to survive? Nah fam, thats delusional. Everyine deserves to have some sort of shelter gaurenteed to them. Along with food and water.",
                          "author": "AHumbleLibertarian",
                          "created": 1638250328,
                          "upvotes": 5,
                          "replies": {
                            "hmnvwg2": {
                              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmnvwg2/",
                              "text": "They are literally guaranteed housing, food, and water bro",
                              "author": "Lower_Roll679",
                              "created": 1638281143,
                              "upvotes": 1,
                              "replies": {
                                "hmoggy3": {
                                  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmoggy3/",
                                  "text": "The existence of homelessness in the US disproves this. The existence of starvation in the US disproves this. The existence of water crisis, such as in Flint, disproves this. You arent gaurenteed nothing in this world and thats a damm shame.",
                                  "author": "AHumbleLibertarian",
                                  "created": 1638290005,
                                  "upvotes": 1,
                                  "replies": {
                                    "hmogs7g": {
                                      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmogs7g/",
                                      "text": "By the college, dude...",
                                      "author": "Lower_Roll679",
                                      "created": 1638290129,
                                      "upvotes": 1,
                                      "replies": {
                                        "hmohq8g": {
                                          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmohq8g/",
                                          "text": "My college doesnt gaurentee living space? They have a program to help, but you need to meet a shitload of criteria. My college doesnt hand out food? But you are right, there are drinking fountains around my college. So 1 for 3 IG.",
                                          "author": "AHumbleLibertarian",
                                          "created": 1638290496,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmjl3s8": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmjl3s8/",
      "text": "Housing around universities is always pricey. (supply/demand+ generous loans)\n\nI would think about getting an off campus apartment, commuting to classes, and working an outside part time job. It'd solve a lot of your problems and only add one that's manageable, a commute. Better hours & probably better rents. Or just get an off campus job, youd have to look into the rents and market.\n\nHousing and employment on campus are going to be competitive, especially if you lower rents and raise wages for student workers. Housing markets are very responsive to those things because it takes such a long time to build and open up new housing, there'd be a big uptick in demand and it'd be the same exact supply of houses for awhile.",
      "author": "RevolutionaryLeave77",
      "created": 1638201857,
      "upvotes": 1,
      "replies": {
        "hmmpiow": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmpiow/",
          "text": "If you count bills, commute costs , and buying your own food, an off campus apartment will usually  cost the same as a dorm if not more",
          "author": "elkfn2",
          "created": 1638250730,
          "upvotes": 3,
          "replies": {
            "hmmwym6": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmwym6/",
              "text": "At my school, the price of on-campus resident meal plans is so artificially elevated that you can expect to pay two or three times as much for them as you would buying your own groceries.",
              "author": "OrdinaryEra",
              "created": 1638255637,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hmj83aq": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmj83aq/",
      "text": "Oh boy. \n\nColleges will never do this nor should they. It is not a right to be able to attend college. It's a product that is available and you pay it to go there. \n\nColleges aren't responsible to raise minimum wage or make housing more affordable, nor should they. They are there to make money. Reducing the cost of housing would result in them losing money. Paying students more, to do non-skilled work, will cost them more money for no reason. \n\nI understand that it's expensive and so much so that it's unaffordable to a lot of people. The people living on your couch and out of their cars have made a poor financial choice to go to college if that's how they have to do it. It's nobody else's fault that they chose to go broke to sleep in their car. Why should to college pay for that? I'm sure financial experts won't suggest taking out LOADS in loans just to attend college. \n\nDon't get confused about colleges. They aren't High Schools or public services. They are companies built to provide a profit. They don't owe their customers anything. You signed up for the high priced dorm rooms. Next thing you know, Bentley cars will be offering $0 down and 0% financing for 36 months EVERYONE IS PREAPPROVED!!!!!! It doesn't work for car manufacturers and it won't work for education providers. \n\nMost of these financial posts generally don't hold water. Doubling minimum wage so people can afford campus housing is a ridiculous notion that the company providing the service should be responsible for making sure the people can afford their service. Somebody else posted that you're not forced to work and live on campus. There's no argument against this whatsoever. He's right. If they don't pay enough on campus, go work elsewhere. If campus housing is too expensive, move off campus. There will always be somebody telling you \"it's still not enough\" and complain about how the world is. From my own personal experience over many years, it's 100% possible to get a job without an education and afford housing. Granted, don't live in a brand new sparkly dorm that's 3 seconds from campus. Find a 1 bedroom or studio apartment and pay half campus prices. Find a $15 an hour job driving a fork lift or working in a factory. \n\nI feel like it's very easy to get confused as a young adult how this is all supposed to work. Going into college and spending more money than you've ever earned in your entire life is confusing. Just seeing thousands of dollars rack up when you've never even held a grand in cash is nerve racking. \n\nI just think you're asking for the wrong thing from the wrong people. This country is a wonderful place to live. You can be as prosperous as you please. If you want things, there is a very simple formula to getting them. The college won't reduce their prices simply because they've got the demand for it and people will continue to pay it knowing it's a great return on investment. \n\nThe solution to your problem will be what YOU can do for you. Asking a giant business that's funded federally to reduce things so it's easier on your bank account is a stretch. If you want more affordable housing and better pay, move off campus and get a better job. You're not forced to be in that dorm or job, so don't waste time working it if it's not meeting your needs. Keep this up until you become old and you'll end up making a lot of money. Everyone who has ever worked an industry will all agree that leaving a job for another is the best way to make more money. Your situation is no different.",
      "author": "Awkward_Mail_2786",
      "created": 1638195941,
      "upvotes": 2,
      "replies": {
        "hmjkaqc": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmjkaqc/",
          "text": "Colleges are not for profit businesses. I don't really have an opinion for or against OP's point but this whole argument you made makes zero sense. The vast majority are non profits",
          "author": "RevolutionaryLeave77",
          "created": 1638201516,
          "upvotes": 1,
          "replies": {
            "hmjz3p6": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmjz3p6/",
              "text": "Yeah, you're right about the profit status. \n\nThe point still stands whether they are for profit or not for profit. They still have to make money on their services in order to stay a viable business. \n\nIf that all makes zero sense to you, cool!",
              "author": null,
              "created": 1638207599,
              "upvotes": -5,
              "replies": {
                "hmjzicc": {
                  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmjzicc/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1638207761,
                  "upvotes": 4,
                  "replies": {
                    "hmkhwam": {
                      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmkhwam/",
                      "text": "They are businesses regardless if they are for profit or not for profit.",
                      "author": null,
                      "created": 1638215086,
                      "upvotes": -4,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hmmed1b": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmed1b/",
          "text": "You display a concerning lack of empathy and a startling lack of awareness, especially for someone who apparently has \"personal experience over many years\". \n\nA $15/hr job isn't enough to qualify for a 1 bed or studio apartment in many parts of the US, even if you work full time, and those fork lift/factory jobs aren't paying $15/hr in places where housing is cheaper. These aren't problems you can bootstrap your way out of. You sound incredibly sanctimonious and out of touch when you suggest that people are struggling because they \"chose\" to or when you tell struggling people that prosperity is \"a very simple formula\" made possible only by this country's supposed greatness. If this country is so wonderful, then why is college, one of the best ways to better your life, so absurdly expensive? Fuckin' bootlicker.",
          "author": "VagrantDrummer",
          "created": 1638244787,
          "upvotes": 3,
          "replies": {
            "hmnht6a": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmnht6a/",
              "text": "It's ironic that I had my own 1 bedroom apartment on 15 dollars in hour in Cincinnati, Ohio while paying a car payment and insurance. I lived IN the city.\n\nHow can you not see why college is so expensive?\n\nEvery class room I go into is decked out with more than one projector. Everything within it is only a few years old. They are constantly renovating and building new things. College professors get paid really well because.... they worked really hard to get where they are. Other administration within the college gets paid really well too. There's professional landscaping kept up at all times with sidewalks always being clear. Hell, my campus doesn't have any sidewalks that are uneven in the slightest.\n\nThis wonderful country also has ways to borrow money to still go through college. They aren't keeping people from doing that. I suppose you'll turn around it say it's somebody else's fault that students are in debt too eh? We aren't victims of college. Nobody is making you go at all. If it's too expensive, work and save up. I don't know how you're doing it, but it's how I'm doing it. \n\nI don't understand why people think college should be cheaper or free. That doesn't make any sense whatsoever. They NEED to make money to keep it as wonderful as it is.\n\nHow many jobs have you had? How long have you worked a job?\n\nI decided to creep your post history and one of the last posts was about where \"poor queers\" should live and said that LA, NY and San Francisco are out of the question because 800-900 is too much there. Are you serious?! Those are like the most expensive places in the United States to live. I hope you realize that there are cities in this country that rent is literally half that.",
              "author": null,
              "created": 1638272882,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hml7ptb": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hml7ptb/",
          "text": "The thing is, housing in my city even in dangerous, crime ridden parts are even MORE expensive than campus dorms. \n\nI do have a job outside of campus working at a family friend’s restaurant. I’m extremely lucky because they respect my class schedule because they know me. This is not the case for the majority of students. Working off campus can be next to impossible because companies not associated with the school will accommodate your schedule. \n\nI disagree with your belief that because colleges are for-profit, they shouldn’t be doing everything in their ability to help students. Especially those of us who come from backgrounds with poverty. Institutions of education shouldn’t be for-profit in the first place. Students are not products, they are people. And people have a right to housing, even when they are in college.\n\nI also disagree that homelessness is also always an individual failure. Homelessness is endemic and not everyone living on the streets simply made a few bad decisions. Many people are victims of systemic issues. My city in particular has been going through a housing crisis, even before the pandemic. \n\nMy friend sleeping on my couch, in particular, lost his job at a bar when it closed down during lockdowns. He got a campus job, but it wasn’t enough when his landlord raised the rent on him at the end of his lease after our state cancelled the freeze on rents. Being so close to finals in his graduating semester, he couldn’t afford to just drop out and try again another time. The emergency housing units on my campus are full. There are empty units in the dorms. But the university shouldn’t help a student WORKING on campus live there because he can’t afford it while units sit empty? He is a victim of systemic issues affecting houselessness and he’s not alone. \n\nMy step-father works as an maintenance man for an apartment building and he and my mother live in a unit they offered for free. This is a thing that exists outside of academia, so why exactly can an institution bringing in millions of dollars every day not provide housing for the students that not only pay them tuition, but also work for them? That is not ethical. That is not right.",
          "author": "SensitiveAries",
          "created": 1638225546,
          "upvotes": 1,
          "replies": {
            "hmnh7yx": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmnh7yx/",
              "text": "Who are you going to give it to and who are you going to deny it?",
              "author": null,
              "created": 1638272443,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmju110": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmju110/",
      "text": "How do you think they pay student workers? With your tuition and fees. If you raise the colleges minimum wage, your fees for \"student services\" or \"facilities and maintenance\" will go up. Also, how the heck are you paying $1,000 per month? I went to two schools and neither dorm was even half that expensive. Once I was married, we had a 2 bedroom apartment to ourselves for $820, and this is at least a MCOL city that has been on every \"fastest growing home prices\" list for the last 2-5 years.",
      "author": "Thelton26",
      "created": 1638205533,
      "upvotes": 1,
      "replies": {
        "hmjz0wz": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmjz0wz/",
          "text": "I'm in a MCOL city and $820 is cheaper than the rent for even the shittiest of the shitty studio apartments",
          "author": "Lower_Roll679",
          "created": 1638207567,
          "upvotes": 5,
          "replies": {}
        },
        "hml8r4x": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hml8r4x/",
          "text": "You seem older than me and also seem to be in a different state. That likely explains the cost discrepancies. Sadly, our tuition increased by 16% this past year, so you can imagine how much it’s increased since you graduated.",
          "author": "SensitiveAries",
          "created": 1638225985,
          "upvotes": 4,
          "replies": {
            "hml9r0g": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hml9r0g/",
              "text": "Ouch, I sound like a grouchy old man online... I graduated in April 2020. But there are a lot of differences between areas of the country, so I could be totally skewed. However, I would imagine that if you were willing to find an apartment with roommates (maybe even lots of them), you could get a place for much cheaper than that. I had a couple friends who lived in 6 person apartments, and most people I knew were in at least 4 person apartments. Shared rooms, sometimes only 1 bathroom, but that's what college is about, right? Scrimping and saving and delayed gratification.",
              "author": "Thelton26",
              "created": 1638226403,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmlxj68": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlxj68/",
      "text": "I just attended a virtual city planning meeting this evening hosted by my cities planning and developmental corporation (I have a digital copy of the flyer as well). \n\nThey discussed a legislation in place that wants to turn my college town into a non-student friendly city with their “walk to work” vision since so many people are working and not living in my city. There’s also talks about a bridge to remedy the civic traffic. We already have one one campus that isn’t used as often and isn’t wheel chair accessible so for them to be willing to make the same mistake twice shows their ignorance. I personally don’t even think their “vision” is sustainable. Just like their argument of a city full of college students isn’t sustainable. We’re here for 9 months out of the year and their “vision” that promotes gentrification only gives remedy to the 3 months of the year when we’re not here!\n\nThey’re first-year students sleeping in common areas one of the residential buildings on my campus. My university and my city planners need to do better. I want to bring awareness to this obvious gentrification that is happening but I don’t know how!",
      "author": "Background-Spare-588",
      "created": 1638237163,
      "upvotes": 8,
      "replies": {
        "hmlyipo": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlyipo/",
          "text": "Me neither. I live in a large city but the west part of the city is known for it being a place for students, but in the past couple of years (exacerbated by the pandemic) a lot of gentrifiers have moved in and housing costs have shot WAY up because they like our student bars, clubs, and other amenities. Not to mention, Zillow has bought up nearly everything in sight in my area of the city and reselling it for like 3-5x it’s original price.",
          "author": "SensitiveAries",
          "created": 1638237614,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hmmdmrx": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmdmrx/",
      "text": "Everyone talking about dorms needing to make money and supply and demand... Its housing. Thats an inelastic demand. Capitalizing on that is cruel.",
      "author": "AHumbleLibertarian",
      "created": 1638244437,
      "upvotes": 5,
      "replies": {}
    },
    "hmo9seg": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmo9seg/",
      "text": "yup. USC RAs are going on strike right now for this very reason.",
      "author": "ferrisbueller3005",
      "created": 1638287332,
      "upvotes": 2,
      "replies": {}
    },
    "hmlaq6f": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlaq6f/",
      "text": ">Most financial experts would agree you shouldn’t be spending more than 30% of monthly income on rent. That means my monthly fee for housing should be no more than $312.\n\nMost financial experts also assume you are saving money for retirement and have other expenses that many students don't have.\n\n>However, that was not the reality. The reality was that I was paying $1000/mo with my installment plan.\n\nAnd? In combination with this, federal aid, state aid, scholarships, tax credits, and federal loans, you should be in a position to graduate with a very manageable amount of debt if you are at an in-state university. It's an investment for you and you seem unwilling to entertain the financial aspect of that.\n\n>Housing is a human right and these institutions can do plenty to support their students effectively.\n\nHousing is a necessity. Free housing at a specific place chosen by you is not.\n\n>Half of my friends are either living in their cars or sleeping on my couch in my overpriced dorm.\n\nI am extremely skeptical. What university are you at where half of students are doing this? Or even 10% of students?",
      "author": "darniforgotmypwd",
      "created": 1638226823,
      "upvotes": 2,
      "replies": {
        "hmld4uw": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmld4uw/",
          "text": "Most apartments off-campus want to be sure you’re making 3x the amount of rent anyway, so my statement still stands. Students still have bills to pay outside of housing as well, such as tuition, fees, car notes, cell phone plans, etc. Housing is not my only bill.\n\nI understand that my education is an investment into myself. My investment was my tuition, not the roof over my head. \n\nI never advocated for free housing. I advocated for housing that is proportionate to what the university is willing to pay its student employees, which isn’t much. I offered two solutions, neither of which are free housing, to pay us more or reduce the price of student housing. \n\nI never said that half the student population is homeless. I said half of my friends are. But this is not an uncommon problem and I understand if anecdotal evidence isn’t enough for you. Here are some articles: [1](https://amp.usatoday.com/amp/3747117002) / [2](https://www.nytimes.com/2020/02/20/education/learning/college-homeless-students.html) / [3](https://www.bestcolleges.com/resources/homeless-student-guide/)\n\nedit: formatting",
          "author": "SensitiveAries",
          "created": 1638227872,
          "upvotes": 2,
          "replies": {
            "hmlfw45": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlfw45/",
              "text": ">Most apartments off-campus want to be sure you’re making 3x the amount of rent anyway, so my statement still stands.\n\nYou are allowed to include student loans, financial aid, and parental support in that too. Parents or other people with income can also co-sign. You are also working half-time anyway so it isn't necessarily reasonable to expect you will be making 3x what rent is.\n\n>Students still have bills to pay outside of housing as well, such as tuition, fees, car notes, cell phone plans, etc. Housing is not my only bill.\n\nI didn't say it was your only bill. But student bills look a bit different. Sometimes food is paid by parents or financial aid. You probably aren't contributing anything to a retirement account. Most students don't have a car loan. Generally speaking a lot of students can do 50% income towards rent without issue. I'll give in and admit that this usually requires a parent to guarantee the lease though.\n\n>I never said that half the student population is homeless. I said half of my friends are. But this is not an uncommon problem and I understand if anecdotal evidence isn’t enough for you. Here are some articles: 1 / 2 / 3\n\nI don't like to use anecdotal evidence but I do agree with you that student homelessness is a problem. The NCHE estimates that [13% of students](https://nche.ed.gov/higher-education/) at a four-year might lack housing security. But most of these students would qualify for university, state, or federal programs that directly or indirectly help with housing security.\n\n>I never advocated for free housing. I advocated for housing that is proportionate to what the university is willing to pay its student employees, which isn’t much. I offered two solutions, neither of which are free housing, to pay us more or reduce the price of student housing.\n\nHow about a third option? You are implying this is about the general student population but it isn't. For housing insecurity we are talking about the bottom 10-15% of the student population by income. Providing more solid financial welfare to these specific students would reduce student housing insecurity a lot more than giving every student a rent reduction. There would be a lot of financial waste (in terms of impact) because students who are financially secure would also be getting the rent reductions. You have more to spread around if you target the aid to the severe cases.",
              "author": "darniforgotmypwd",
              "created": 1638229097,
              "upvotes": 1,
              "replies": {
                "hmlhzkk": {
                  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlhzkk/",
                  "text": "Unfortunately, we don’t all come from homes where parents can or are willing to cosign for you. My parents both have bad credit, so it’s not an option for me. I assume it’s not for many others as well. \n\nTake a look at the listings for housing in a big city like New York or Los Angeles (I live in cities like those). Most require you made 3x the rent, so yes a cosigner is necessary. You’re right that it’s possible for some students, though but not all of us. \n\nI like your solution. Even if they only reduced the rent for student workers, I’d be happy with that. They do it for RAs already so I feel like it’s not too big of an ask for my university where the president makes hundreds of thousands of dollars for a holiday bonus.",
                  "author": "SensitiveAries",
                  "created": 1638230036,
                  "upvotes": 1,
                  "replies": {
                    "hmlqgij": {
                      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlqgij/",
                      "text": ">Take a look at the listings for housing in a big city like New York or Los Angeles (I live in cities like those).\n\nIt's up to the student to decide where to live though. Someone who is not financially secure should not be moving to study in those cities to begin with unless they are getting a superb financial aid package. There is no reason any of these students should consider paying NY/SF rent prices or anything remotely comparable to that.\n\n>I like your solution. Even if they only reduced the rent for student workers, I’d be happy with that. They do it for RAs already so I feel like it’s not too big of an ask for my university where the president makes hundreds of thousands of dollars for a holiday bonus.\n\nThanks. And yes being an RA is another point. They could prioritize low-income students for that too.\n\nDivided between each student, whatever your president makes probably wouldn't cover much. Admin salary has come up on this subreddit before. The ability to raise funding is part of the justification to why they would be paid that much. They may be getting a $300k bonus but it may be due to being able to bring in a much larger amount to fund university programs. It's a net benefit and not something that the university is losing budget money on. Canning a good president with connections would probably cost the university much more than the $300k they would save. That being said, our president always donated his bonus back to the university.",
                      "author": "darniforgotmypwd",
                      "created": 1638233921,
                      "upvotes": 2,
                      "replies": {
                        "hmlx7wx": {
                          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmlx7wx/",
                          "text": "I grew up here lmao, it would’ve cost more to move far away and I can’t abandon my family. They need me.",
                          "author": "SensitiveAries",
                          "created": 1638237021,
                          "upvotes": 0,
                          "replies": {
                            "hmm3pwd": {
                              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmm3pwd/",
                              "text": "How would it have cost more to move to a much cheaper city? You aren't living with them so what exactly are you saving?",
                              "author": "darniforgotmypwd",
                              "created": 1638239922,
                              "upvotes": 0,
                              "replies": {
                                "hmm97mh": {
                                  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmm97mh/",
                                  "text": "Moving is expensive? At 17, I didn’t have the money to move far away from home and support myself. Look where it’s gotten some of friends who came from far away. \n\nAnd no, I didn’t want to abandon my family. My mother and grandfather have health issues and I didn’t want to be far away from them and possibly not have a way to get back. However, I don’t live with them because my grandparents had to move in with us due to health concerns. \n\nBut this is just my story and it’s kind of irrelevant. Universities should be looking out for their students, especially those that work for them, irregardless of their backgrounds. It’s unconscionable not to.",
                                  "author": "SensitiveAries",
                                  "created": 1638242397,
                                  "upvotes": 0,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hmmkhpf": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmkhpf/",
      "text": "Well my only gripe is that I feel that you believe things should be a particular way based upon your expectations and now that reality doesn't align with said expectations, it would be more convenient if life bent around you, rather than you adapt. I say this because I joined the military in order to attend school and avoid this situation you're in. I could have done a myriad of other things to achieve the same result (work in the fire department, police, McDonald's, real estate. Etc.). Point being, as someone previously mentioned, you feel as though you should have an all expenses paid ride through life (which admittedly would be nice) but that isn't how things are. Fundamentally you're left with the choice of whether or not you're going to adapt or be in the same position tomorrow. Truth is, congress isn't going to come save you tomorrow, nor are these institutions. You're going to have to get a nice firm grip on the boot straps and do what you know you should do (i.e. be reasonable and live within your means). You don't HAVE to live in those dorms, you don't HAVE to be a full-time student, etc. I'd argue going to school slower and having a more sustainable income is a larger priority. Outside of emotional comforts nobody here can help you. It's ultimately up to you to make the adjustments from the push-back that life is giving you right now and these moments build character.",
      "author": "Sunbro888",
      "created": 1638247855,
      "upvotes": 1,
      "replies": {}
    },
    "hmljso7": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmljso7/",
      "text": "My on campus job paid for my apartment room. Depends on the area. Dorms would never be that cheap though",
      "author": "saved-by_grace",
      "created": 1638230855,
      "upvotes": 1,
      "replies": {}
    },
    "hmm6ob3": {
      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmm6ob3/",
      "text": "Sounds like you should go to a cheaper school",
      "author": "fuckflyingpigs",
      "created": 1638241250,
      "upvotes": -1,
      "replies": {
        "hmm9dpy": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmm9dpy/",
          "text": "Sounds like schools should take care of their student workers.",
          "author": "SensitiveAries",
          "created": 1638242473,
          "upvotes": 2,
          "replies": {
            "hmnzlgx": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmnzlgx/",
              "text": "School isn't a right and you do not have a human right to live at at school, a privilege most of the world doesn't even get to consider. I don't have this problem because I go to a cheaper school that is in my budget. I'm still getting a great education, there's no \"deserving\" to live in a specific place or go to a specific school. Either you can afford it by working or taking out loans or you can't. Blame the government for inflating school prices by guaranteeing loans.",
              "author": "fuckflyingpigs",
              "created": 1638282919,
              "upvotes": 0,
              "replies": {}
            }
          }
        },
        "hmmed6u": {
          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmmed6u/",
          "text": "Yeah... So this week on opinions that were definitely not needed.",
          "author": "AHumbleLibertarian",
          "created": 1638244789,
          "upvotes": 1,
          "replies": {
            "hmnzx1t": {
              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmnzx1t/",
              "text": "Any want to elaborate? Living at expensive on-campus housing isn't a human right.",
              "author": "fuckflyingpigs",
              "created": 1638283067,
              "upvotes": 1,
              "replies": {
                "hmohamw": {
                  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmohamw/",
                  "text": "Living in shelter is a human right. Where that shelter is should line up with one's current life situation. We could give every homeless person in the US a house in Texas, but what good would that do if their job is in Minneapolis. \n\nAlso, how are you gonna bash someone for living on campus. The whole point is so they can focus on school. You know what the number 1 way to better your life in America is? Education. And you're trying to make that as difficult as possible? People just cant have shit, can they? How about instead of blaming poor people for being poor, we acknowledge the problem of overly expensive living costs and work to resolve them.",
                  "author": "AHumbleLibertarian",
                  "created": 1638290326,
                  "upvotes": 1,
                  "replies": {
                    "hmoj1w4": {
                      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmoj1w4/",
                      "text": "Not everyone can live in an expensive part of the country. The reason student housing is expensive is because there is lots of demand and not as much supply. Just because I want to study at an expensive school doesn't mean I *deserve* to live there for whatever I want to pay/deem affordable. In addition, schools are charging more because the government guarantees that they will be paid. They need to stop doing that if school will ever stop increasing in price.\n\nI study at a cheaper school because I realized I don't make enough money to afford a pricy one. I can't even afford to live on-campus. It's cheaper for me to live on campus so that's what I'm doing. You or me don't deserve on-campus just because I want it. \n\nIf OP was complaining that nowhere in the US was affordable, that would be different. Higher education comes with higher costs, not everyone will be able to study at university and that is a fact no matter how you feel. I'm not making it as difficult I'm explaining how the world works. We can't all live in LA or NYC for cheap. That just doesn't make sense. You have to adapt your living situation with your fiscal situation. That's not new that's how the world has worked since the beginning of time. \n\nDo you have any suggestions on a way to solve this problem without just saying \"make it free\"? Someone has to pay for it. Especially with rising property taxes and higher housing demand than ever.",
                      "author": "fuckflyingpigs",
                      "created": 1638291006,
                      "upvotes": 1,
                      "replies": {
                        "hmpdcgv": {
                          "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmpdcgv/",
                          "text": "So you then understand the struggle. You were put in a hard spot as well and youre just gonna accept it? While your school mismanages hundreds of thousands of dollars, you get the short end of the stick and need to pay X amount just for a basic need?\n\nWe need to strive for better, there's absolutely no reason we cant be making more housing. Sure, it'll cost some dough, but there are massive government programs for this sort of thing. I mean, whats the point in me paying taxes if you arent even getting housing?",
                          "author": "AHumbleLibertarian",
                          "created": 1638302974,
                          "upvotes": 1,
                          "replies": {
                            "hmpunf8": {
                              "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmpunf8/",
                              "text": "The school mismanaging hundreds of thousands of dollars is different. I agree, they should be closely audit and critically judged whether they are spending money appropriately. That is a separate issue however. \n\nWho told you that you paying taxes would guarantee you housing? That has never been an aspect of taxation. Housing programs  are social programs that exist to assist low-income taxpayers who would otherwise be homeless. College students who will have high earning potential after school are not those taxpayers that housing programs are intended for. \n\n\nMore housing is a good option to consider, OP should recommend that to their school maybe. Most school dorms/housing programs are packed every semester. However that doesn't mean OP deserves to live in a dorm for less than it costs the school to pay. \n\nI have yet to hear why students deserve cheaper housing than the market dictates. Especially when college students usually have higher earning potential after school, they should be able to afford being stringent with their money the first few years you aren't reliant on your parents. \n\nI'm able to make it work just fine. I live on campus, work part-time during school and still enjoy my life.I have to watch my spending closely. Why is it wrong to expect other students to do the same? I don't believe you deserve anything when you move out on your own.",
                              "author": "fuckflyingpigs",
                              "created": 1638309924,
                              "upvotes": 1,
                              "replies": {
                                "hmquy8u": {
                                  "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmquy8u/",
                                  "text": "If I'm paying taxes, I want thise taxes to maintain the bare minimum, if not more, to maintain survival. Whats the point of bombing brown kids if children in the US face food insecurity, housing insecurity, and lack of clean drinking water. You, need to realize that getting the short end of the stick isnt life. Being shit on by institution after institution isnt life. \n\nI have yet to hear a reason other than \"the market dictates.\" The market dictates that hundreds of thousands rationed insulin, hundreds of people died. The market dictated that prisons should be for profit. Its probably high time that the market shut the hell up.",
                                  "author": "AHumbleLibertarian",
                                  "created": 1638325900,
                                  "upvotes": 1,
                                  "replies": {
                                    "hmsfqpz": {
                                      "link": "/r/college/comments/r4uqp9/university_housing_needs_to_be_affordable_to/hmsfqpz/",
                                      "text": "Proposing taxes pay for housing for everyone in the US is a bold statement that would completely change life in the US. Just because you want that doesn't mean that has ever been the way it is or that it should be. You're not getting shit on by institution after institution because they don't want to lose money providing housing to student who *choose* to study there and temporarily earn less money. That's incredibly selfish.\n\nWho would own these houses or apartments the government funds? Who would construct them? Do you think the government would be a good landlord given how government provided housing is now? Would the US just be paying private landlords? If you critically investigate your argument I think you'll find it unrealistic. \n\n\"The market dictates\" is a way to explain how life is. Before the stock market and modern life became the way it is, no one gave you a house for free and no one provided your bare necessities. You don't have a right to other people's assets. Government has the right to protect it's citizen's interests and that's not losing money by providing college students free housing when they'll earn so much more after graduating. \n\nWhat exactly gives you so much faith in the government to solve problems given the performance they've displayed the last 20 years? That's just giving more power to politicians that they'll use for themselves.",
                                      "author": "fuckflyingpigs",
                                      "created": 1638362637,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}