{
  "sid": "rgdiml",
  "link": "/r/college/comments/rgdiml/i_have_a_partial_exam_tomorrow_should_i_still_try/",
  "title:": "I have a partial exam tomorrow, should i still try to study even if its open book?",
  "text": "this will be my first open book linear algebra partial. \nlately i haven studied due to my period and working on other projects, so should i still try to study or get a full night of sleep?\ni dont work well if im not rested and i also have been in the few people who worked in seminaries and has all the notes so should i worry?\nthis wont affect my grade but it might help to ease off the final exam.\n\nmaybe im feeling guilty for not studying but i just feel all over the place...what would you sugges i do?",
  "author": "lilithhhhh12",
  "created": 1639505659,
  "updated": 1639515978,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hojhfiv": {
      "link": "/r/college/comments/rgdiml/i_have_a_partial_exam_tomorrow_should_i_still_try/hojhfiv/",
      "text": "I would make sure to get enough sleep but be sure to organize your materials and review them. With open note you can spend a lot of time scrambling through them so knowing where ideas are located and a basic concepts helps save time",
      "author": "catlover12321",
      "created": 1639506242,
      "upvotes": 3,
      "replies": {
        "hojhws6": {
          "link": "/r/college/comments/rgdiml/i_have_a_partial_exam_tomorrow_should_i_still_try/hojhws6/",
          "text": "yes i did that in class to and i also made a full page with formulas, i was thinking of reviewing some exercises and go to sleep early.\nthank you for your answer 🥰",
          "author": "lilithhhhh12",
          "created": 1639506431,
          "upvotes": 1,
          "replies": {
            "hojiahb": {
              "link": "/r/college/comments/rgdiml/i_have_a_partial_exam_tomorrow_should_i_still_try/hojiahb/",
              "text": "Good! Make sure to mark special situations and little notes to keep the process sharp in your brain if that makes sense, like the tricky stuff",
              "author": "catlover12321",
              "created": 1639506580,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hojnz2z": {
      "link": "/r/college/comments/rgdiml/i_have_a_partial_exam_tomorrow_should_i_still_try/hojnz2z/",
      "text": "Don't let that open note part fool you! Do a really good review so you're familiar where to look for answers and to know basic things.  You shouldn't be using up valuable time looking up basic things! Save it for the harder stuff.",
      "author": "Defrost_ThenStir",
      "created": 1639508812,
      "upvotes": 1,
      "replies": {}
    }
  }
}