{
  "sid": "rb2hb5",
  "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/",
  "title:": "change my view - because the bachelor's degree is becoming less useful than work experience to highlight a person's resume, we can push off many core requirements in exchange for earlier experience in our respective fields",
  "text": "and if the school pushes you to take core after four years of nothing but major-oriented things, just drop out. you already have the experience to take you farther than a theater 101 class ever will. power to the people once more",
  "author": null,
  "created": 1638893422,
  "updated": 1639517377,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.6,
  "comments": {
    "hnlwsnc": {
      "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnlwsnc/",
      "text": "So are you advocating stopping at a basic associates or not go at all?",
      "author": "RoundBridge4",
      "created": 1638894166,
      "upvotes": 3,
      "replies": {
        "hnlx935": {
          "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnlx935/",
          "text": "I'm advocating that you should go, because college life provides connections and nuanced things not easily attainable if you don't go. and that, when you go, say fuck you to cores, grind out fun classes and major-oriented classes only, get the internship / make the connections, and after four / five years, if they tell you that you need to stay to finish core, just drop out and provide your work experience onward. \n\nlikewise works for the degrees that are now focusing more on work experience (mostly stem)",
          "author": null,
          "created": 1638894370,
          "upvotes": 1,
          "replies": {
            "hnmmr3u": {
              "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmmr3u/",
              "text": "While I agree core classes can be pretty trivial dropping out just so you don't have to do cores is pretty bad advice.  Having a degree is more of a HR check.  Experience may beat it but you still want to have a degree on your resume.",
              "author": "Mr_noluc",
              "created": 1638905455,
              "upvotes": 3,
              "replies": {
                "hnmoxu8": {
                  "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmoxu8/",
                  "text": "for what? as many have seen before, we are legit trending towards \"not about degree, but work experience + connections\" - we have seen many people with degrees ending up with no jobs, and people with no degrees with jobs. it's a broken system and, given the state of capitalism in the US, nothing will change",
                  "author": null,
                  "created": 1638906429,
                  "upvotes": 1,
                  "replies": {
                    "hnmq1s5": {
                      "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmq1s5/",
                      "text": "It depends on what your degree or skill is in. If you look at unemployment people with degrees have less unemployment than those without degrees. That's just a fact. I don't know what you mean nothing will change? Things are constantly  changing. You sound like you're burnt out. I get the feeling of college seeming to be a large hurdle to jump through. Capitalism isn't perfect but you definitely can't tell me a better system. I'm not here to say degrees are be all end all but they definitely hold value when determining candidates for work.",
                      "author": "Mr_noluc",
                      "created": 1638906927,
                      "upvotes": 1,
                      "replies": {
                        "hnmstbt": {
                          "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmstbt/",
                          "text": "the thing about stats is that they take in averages as the scenario. gaining a lot of work experience + connections would not work with your stat, because the average grad doesn't have that. the average is a balanced education. work experience has little to do with balanced education. yes, things are constantly changing, on the cusp of 0% change and 1% change. I can't think of a better system, but that doesn't mean the current one is working fairly. don't you think people with degrees should be guaranteed work over those without? if not, then my premise holds. if so, then this system of ours can be improved.",
                          "author": null,
                          "created": 1638908149,
                          "upvotes": 1,
                          "replies": {
                            "hnmtzmj": {
                              "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmtzmj/",
                              "text": "Stats also take into account standard deviations so they are very accurate. It's not my stat its the BLS stats. The ones that calculate unemployment. Your claims are all based on how you feel. No one should be guaranteed work..that's called entitlement. If someone chooses to get a degree with the word studies in it chances are they are less marketable than say an engineer.  We absolutely can improve and we should always be improving. Instead of being so pessimistic why not come up with how we can be better? Capitalism needs innovation not complaints about it being broken.",
                              "author": "Mr_noluc",
                              "created": 1638908622,
                              "upvotes": 3,
                              "replies": {
                                "hnmumb8": {
                                  "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmumb8/",
                                  "text": "you think entitlement is being guaranteed a job after four years, as the US markets? This marketing is ingrained in millions of households with no dreams of doing better besides beating their kids into earning high grades so they can go to college and be \"guaranteed\" a job. How about we start there, by telling people that you won't get a job if you go to college? That college isn't a direct pathway to a job? That you're better off doing trade and then earning 6 - figures in r/antiwork esque fashion? obviously I'm exaggerating, but calling four years an \"entitlement\" after a century of intense marketing it falsely and nobody being held responsible. and then calling the grads suffering under unemployment because they didn't know the game \"entitled\" it's too much\n\ncomplaints about something being broken are very valid, because those in power already know how to fix it",
                                  "author": null,
                                  "created": 1638908878,
                                  "upvotes": 1,
                                  "replies": {
                                    "hnmw34z": {
                                      "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmw34z/",
                                      "text": "It's not black and white. There is a lot more to it than just degree =job. You're so fixated on this must happen or else. If you get a degree your chance of getting  a job goes up. Like I said earlier what is your degree in? Not all degrees are equal.  Held responsible for what? Are people not able to think for themselves?  Are you so brain washed that you need to point the finger at university and say you sold me this studies degree? What happened to critical  thinking? What is the plan to fix things? I haven't heard it. It's all about bringing value and learning skills that are marketable. What are you unhappy about? Is it degrees, jobs, or marketing?",
                                      "author": "Mr_noluc",
                                      "created": 1638909505,
                                      "upvotes": 2,
                                      "replies": {
                                        "hnmwzvx": {
                                          "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmwzvx/",
                                          "text": "I don't understand the Redditor mentality of attacking after being provided an answer.\n\nI don't understand why I need to be the one to conjure a 100% infallible solution.\n\nYou call me brainwashed, yeah? Because I can't critical think? Because facts > feelings yeah?\n\n\nYou're right. I'm dumb as shit. I can't count. It's my fault. And that's in part why I'm suicidal. because I'm worthless.\n\nBut, that doesn't mean that there aren't people out there with the solutions who choose to pursue money instead, in government. A million unique minds have tackled the matter, I'm sure one has a solution that works that is on the internet, but won't be pursued because of cash.\n\nYes, I believe that \"thinking for yourself\" is a skill needed, but people (like me) cannot do that. People (like me) who are very stupid and retarded and deserving of death need the US to spoon-feed them information, or they won't get.\n\nI have been spoonfed and beaten into believing college was the answer. It is not. I have fallen for the trap. It is my fault.\n\nBut, I want to prevent others from falling into the same trap as me, in part because I care, as stupid as I may be.",
                                          "author": null,
                                          "created": 1638909893,
                                          "upvotes": 0,
                                          "replies": {
                                            "hnmxvmh": {
                                              "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmxvmh/",
                                              "text": "You're not stupid. I can tell you're not in a good place right now. I really think you should reach out to your school counselors. If you are having trouble at home then please tell someone. Physical abuse should not be tolerated. Contact the police if you have to. College can help raise your social mobility. Maybe you just aren't happy with what you're studying.  Don't let these hard times consume you. Reach out for help. Your mind is clouded right now and you definitely don't need to make any bad choices. This too shall pass. Hang in there.",
                                              "author": "Mr_noluc",
                                              "created": 1638910272,
                                              "upvotes": 2,
                                              "replies": {}
                                            },
                                            "hnmx0xj": {
                                              "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnmx0xj/",
                                              "text": "Suicide Hotline Numbers If you or anyone you know are struggling, please, PLEASE reach out for help. You are worthy, you are loved and you will always be able to find assistance.\n\nArgentina: +5402234930430\n\nAustralia: 131114\n\nAustria: 017133374\n\nBelgium: 106\n\nBosnia & Herzegovina: 080 05 03 05\n\nBotswana: 3911270\n\nBrazil: 212339191\n\nBulgaria: 0035 9249 17 223\n\nCanada: 5147234000 (Montreal); 18662773553 (outside Montreal)\n\nCroatia: 014833888\n\nDenmark: +4570201201\n\nEgypt: 7621602\n\nFinland: 010 195 202\n\nFrance: 0145394000\n\nGermany: 08001810771\n\nHong Kong: +852 2382 0000\n\nHungary: 116123\n\nIceland: 1717\n\nIndia: 8888817666\n\nIreland: +4408457909090\n\nItaly: 800860022\n\nJapan: +810352869090\n\nMexico: 5255102550\n\nNew Zealand: 0508828865\n\nThe Netherlands: 113\n\nNorway: +4781533300\n\nPhilippines: 028969191\n\nPoland: 5270000\n\nRussia: 0078202577577\n\nSpain: 914590050\n\nSouth Africa: 0514445691\n\nSweden: 46317112400\n\nSwitzerland: 143\n\nUnited Kingdom: 08006895652\n\nUSA: 18002738255\n\nYou are not alone. Please reach out.\n*****\nI am a bot, and this action was performed automatically.",
                                              "author": "eazeaze",
                                              "created": 1638909905,
                                              "upvotes": 1,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "hnnojiz": {
                  "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnnojiz/",
                  "text": "The “Hr check” is my motivation as a Non-Traditional student.",
                  "author": "RoundBridge4",
                  "created": 1638921983,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnnma2z": {
      "link": "/r/college/comments/rb2hb5/change_my_view_because_the_bachelors_degree_is/hnnma2z/",
      "text": "Trying to reset the conversation...\n\nI understand your view, but I disagree. Too much specialization leaves us without knowledge of the wider world. That mandatory history class could alter how you think everything that came before, allow you to better understand the situation you find yourself in. That mandatory Political Science class could make you a more engaged voter. That mandatory Economics class could make you a more informed and perhaps profitable citizen. That mandatory Music Appreciation class could allow you to appreciate the technique of music and even understand bits of it. It would be nice if High School taught things like they do in college, therefore negating the need for Gen-Eds, but they don't and unless the school system is radically altered, they will not.\n\nIf you look at college purely as a path to a job (an argument which only could exist in some STEM and Social Science fields), then perhaps your argument is solid (although I would counter by arguing people with interdisciplinary knowledge usually end up being the trendsetters in a field); however, college is more than a gateway for a job, it is a time to explore the more esoteric and yet imminently relevant interests: it is a place to learn.",
      "author": "DrAlawyn",
      "created": 1638920923,
      "upvotes": 3,
      "replies": {}
    }
  }
}