{
  "sid": "qpw0bd",
  "link": "/r/college/comments/qpw0bd/fafsa_and_your_assets/",
  "title:": "FAFSA and your assets",
  "text": "How can your assets affect your financial aids? I heard people said that 20% amount of your assets will count to your tuition and reduce the amount of financial aids you receive. For example, if you report $40k as your total assets, you will be responsible for $8000 tuition for that year, financial aid will pay the rest. Is it right?",
  "author": "Wise-Value-8415",
  "created": 1636433046,
  "updated": 1636655328,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hjxuk61": {
      "link": "/r/college/comments/qpw0bd/fafsa_and_your_assets/hjxuk61/",
      "text": "20% of student assets will be added to the EFC. You are correct if you are talking about the student.\n\nParent assets have about 1/4 the impact. If a student puts savings inside a 529 plan, that is considered a parent asset even if it's in the name of the student.\n\nEither student or parent can move their money to non-reportable assets. For example, you can move the savings to one of the several retirement plans where you can withdrawl the contributions penalty free. This is a good option if you aren't going to touch most of the money through college.",
      "author": "darniforgotmypwd",
      "created": 1636468878,
      "upvotes": 1,
      "replies": {
        "hjxwbl3": {
          "link": "/r/college/comments/qpw0bd/fafsa_and_your_assets/hjxwbl3/",
          "text": "Is Roth IRA counted as an asset?",
          "author": "Wise-Value-8415",
          "created": 1636469655,
          "upvotes": 1,
          "replies": {
            "hjxzb2a": {
              "link": "/r/college/comments/qpw0bd/fafsa_and_your_assets/hjxzb2a/",
              "text": "Nope! You and your parents can have money in those without it being reportable to FAFSA.\n\nKeep in mind the maximum contribution is $6k per year so you just can't dump $50k in it tomorrow. You can take out the contributions (not any earnings, though, if you invest) without penalties after the account is 5 years old *and* you don't have to follow this 5 year rule if the withdrawl is for a home purchase or educational expenses.\n\nYou can't contribute to a Roth IRA if you have... I think it's about >$90k/yr in income? If you or your parents have high income, a Traditional IRA is very similar but has no maximum income limit.\n\nIf you are choosing where to put a lot of money, read through the rules on all the different retirement accounts. Chances are you can park money in one or two of them and then take it out after college if you need it. Or better yet, just keep it in there for early retirement savings. With a 401k you can contribute a lot more, $19.5k per year, but there is a 10% penalty if you take out contributions early.",
              "author": "darniforgotmypwd",
              "created": 1636470949,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hjyihg1": {
      "link": "/r/college/comments/qpw0bd/fafsa_and_your_assets/hjyihg1/",
      "text": "Thabk you very much!",
      "author": "Wise-Value-8415",
      "created": 1636478704,
      "upvotes": 1,
      "replies": {}
    }
  }
}