{
  "sid": "9gndbu",
  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/",
  "title:": "I feel like colleges are scamming students with low-effort teaching. What can we do about it?",
  "text": "This subject, I’m sure, gets us all teeming with anger. \n\nAnd the sad part is: almost all university students have been there.\n\nWhen you are at University you are paying hundreds of dollars for a credit hour. I am a resident of the state my university is in, so I pay $212 for a credit hour; when I have to take a typical three credit class I am paying $636 for a class; times five for a fifteen credit semester and that comes out to $3,180. For an out of state student that means you are going to pay $10,608 for a semester and $2,151 for one credit-hour class. \n\nWhen you have a terrible teacher that’s some bullshit. \n\nSo that’s why I am asking: where is the accountability for teachers? I know there are teacher reviews at the end of the semester but what use is that when you have already paid for the semester and have learned nothing? Why do teachers with bad reps amongst the student body continue to teach? \n\nStudents, why are we just letting this happen? \n\nAnd what can we do to stop it?\n\nI want to call out my university, The University of Florida, out on some bullshit. Why are these teachers who put no effort into their classes allowed to teach? \n\nI want to do something but I don’t know what you should do to effectively end this! \n\n(Like I said, I know there are lecturer reviews at the end of the semester but I don’t think these are really being acted upon. There are teachers with bad reps at my school amongst the student body.)\n\nHow can I make sure I am not being taken advantage of (more than usual lol) by my university?",
  "author": "BrooklynWc",
  "created": 1537211923,
  "over_18": false,
  "upvotes": 632,
  "upvote_ratio": 0.96,
  "comments": {
    "e6b3r14": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e6b3r14/",
      "text": "My school always emphasizes the importance of those \"end of the year\" reviews yet the same awful professors return to teach next year. It doesn't make sense considering most of these professors have terrible reviews on ratemyprofessor and low passing rates for almost ALL their classes. Yet my school continues to hire them for back-to-back quarters. Colleges never listen to students unless it severely hurts the school's reputation.",
      "author": null,
      "created": 1537435975,
      "upvotes": 2,
      "replies": {}
    },
    "e6a2d2n": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e6a2d2n/",
      "text": "Professors’ teaching ability is rarely a major factor in their evaluations and they aren’t really encouraged to try new things; all despite the fact that the lecture hall format in education has been compared to bloodletting in medicine. ",
      "author": "Rgrockr",
      "created": 1537390927,
      "upvotes": 2,
      "replies": {}
    },
    "e68br9t": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e68br9t/",
      "text": "I definitely feel the same way. I go to USC. That's about $30k a semester. And yesterday my professor decided to show us a documentary I can watch for free on Amazon Prime. Why am I paying hundreds a day just to watch something I can watch at home?\n\nAnd don't get me started on the topics of the class. I think I've learned more about the subject matter from watching the news and reading reddit than going to class.",
      "author": "meliwazhere",
      "created": 1537321264,
      "upvotes": 3,
      "replies": {}
    },
    "e67yxza": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e67yxza/",
      "text": "Do you really pay thousands of dollars for an education or do you pay for a degree?\n\nPlenty of institutions (Berkeley, Stanford, MIT, GeorgiaTech) have put their courses online for free. You can watch them on YouTube, EdX, Udacity and even download the course materials from their site. \n\nIf you wanted an education, there's plenty of material freely available for you online.\n\n\nBut you don't want to do that, because you don't get a degree. \n\nHence, you are paying for a degree, not the education.\n\nI delineate between education and degrees. I only went to get a piece of paper. I spendt most of the time getting a 4.0 in CS by reading books or lectures. ",
      "author": null,
      "created": 1537308853,
      "upvotes": 2,
      "replies": {
        "e6actyq": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e6actyq/",
          "text": "man i don't use this term often but this is some real bootlicking shit",
          "author": "LSDawson",
          "created": 1537400584,
          "upvotes": 1,
          "replies": {
            "e6aewqc": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e6aewqc/",
              "text": "You sound like an poltically active Che Guevara follower filled with teen angst",
              "author": null,
              "created": 1537402631,
              "upvotes": 1,
              "replies": {
                "e6aezcu": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e6aezcu/",
                  "text": "swing and a miss",
                  "author": "LSDawson",
                  "created": 1537402705,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e67onv4": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e67onv4/",
      "text": "I was reading your post and thinking \"that sounds like my school.\" We attend the same university lol.\n\nEdit: and I'm in the J-school too",
      "author": null,
      "created": 1537300321,
      "upvotes": 3,
      "replies": {
        "e67otlx": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e67otlx/",
          "text": "Hahahaha its great, UF! ",
          "author": "BrooklynWc",
          "created": 1537300446,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e66zy1l": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66zy1l/",
      "text": "I feel your pain.  At my school we have a set of Gen Ed courses you're supposed to take to graduate and 2 classes are language courses of whichever you want to take that are available. My time slot only allowed French and my god it is a ride. Firstly like every college scam we have to buy a book but with an online code that we could do hmwk online but here's the thing when we do it online it never matches up with the lesson on what we are learning. As well for some reason the prof has stated that shes not allowed to speak English and only does so but very quietly when the door is open so the \"department chair\" doesnt hear her speak so she speaks 96% of the class in French and attempts to use hand signals/gestures and points and expects us to understand it. \n\nMy issue is just the fact that this is our first time taking this language and speaking only in French to English speakers about how certain phrases or words or meanings in French is just absurd so we basically have to self teach; so the prof is essentially useless bc at home we have the online hmwk and in class we're just trying to figure out what's she saying, if pay thousands for tuition and get an online code to do hmwk and the teacher doesnt give us anything in return then what's the point of the prof anyways? I've been looking at the syllabus constantly to see if I can poke holes but idk if it's worth the time fighting for this nonsense, more so since I'll most likely have the same prof next semester bc to graduate you need 2 language course to graduate so I'm stuck in this hell. \n\nMore so I took japanese as well early on (had to drop for family reasons) and we needed no online code and the teacher spoke to us in English and Japanese but explained everything nicely and was right infront of the Language office so taking this class I assumed it would have some similar steps but I'm just as shocked on how bad it truly is. As well for the online hmwk you get 3 chances to do it properly and after that it would be input as wrong; so you're basically trying to teach yourself, trying to understand teacher, trying to understand text book (when you order it online it doesnt even come binded. Just sheets. Wtf.) And hope to pass. I fucking hate this class. ",
      "author": "Cluelesswolfkin",
      "created": 1537280126,
      "upvotes": 2,
      "replies": {}
    },
    "e66y5ru": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66y5ru/",
      "text": "Had two seperate teachers at college that were hired to teach a computer program (respectively) without any knowledge of how to use the programs.  One was always late and his motto wad 'learn along with me while I read exactally what is written in the text. The other frequently got flustered and gave direction of the class over to a student, never returned work, randomly gave out grades, and the one time she finally returned work it was very obviously it was pulled out of the garbage with stains and old food matter stuck to them.\n\nTalking with the teacher, had no results. Talking with the student success facilitators, had no results. Talking wih the dean of the department, had no results. Talking with the dean of the school, had no results. Everything was empty promises and delay tatics even with 30-40 fellow students with the same complaints.\n\nThey didn't care because they already had our money and had no intention of providing proper teaching. One class I managed to get through by doing the text at home, the other I 'passed' with the teachers made up marks and to this day I still have no clue how to use that program *at all*. Every time I open it and try to follow the text I am reminded of the constant struggle I had butting heads wih the teacher and deans I get so stressed out, angry, frustrated, cant do a dang thing and shortly rage quit.\n\nThis was the largest and most well known college in our city.",
      "author": null,
      "created": 1537278437,
      "upvotes": 3,
      "replies": {
        "e67wtd7": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e67wtd7/",
          "text": "The above situation happens in my spouse's department at times.  His field has really exciting new developments in technology and some of the faculty want to get in on it.  They ask to teach these technology-oriented courses but aren't quite qualified.  I don't know if the department is naive or overly hopeful when it permits them to.  My spouse gets the students later, for more advanced level classes, and has to bring students up to speed because having a professor without foundational knowledge hampered their learning.",
          "author": "FeatofClay",
          "created": 1537306945,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e66pizh": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66pizh/",
      "text": "A professor tanked my score because she didn't like me, verbally abused me in particular (started because of my ethnicity but then because I called her out on her bs), didn't attend classes half the time and been doing this for 2 years without any action taken from higher ups (and I did complain to them). She's been busted blackout drunk in the proffesor's hub. Even then they just transferred her to a different building. ",
      "author": "Dr_Vegetable",
      "created": 1537267335,
      "upvotes": 1,
      "replies": {
        "e66qg5j": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66qg5j/",
          "text": "Dear God you’d think that would do it. It’s absolutely crazy the standards they have for students when their teachers are the worst",
          "author": "BrooklynWc",
          "created": 1537268995,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e66lk1o": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66lk1o/",
      "text": ">where is the accountability for teachers? \n\nIt depends on the school and whether or not they're willing to take the plunge to fire a teacher when they know they might not be able to fill the spot later. Or the teacher may have enough prestige in their field that they don't want to let them go because that would mean losing publications for their school.\n\n>I know there are teacher reviews at the end of the semester but what use is that when you have already paid for the semester and have learned nothing? Why do teachers with bad reps amongst the student body continue to teach?\n\nAs mentioned above, finding someone expert enough in a particular field  is not always easy to do, especially since that would mean that they likely have a doctorate and would be expecting high compensation. The school may have settled for someone who is cheaper to employ and can't go over budget. Or they fear not being able to fill the position in time. Or the teacher contributes something else meaningful to the school (research, leadership, etc.)\n\n>Students, why are we just letting this happen? And what can we do to stop it?\n\nProbably nothing other than continuing to fill out teacher reviews. You can try bringing it to the attention of your dean but your mileage with this strategy may vary. Costs and budget and keeping positions filled trumps all, because students will continue to pay the exorbitant costs of college because it is still more profitable to go to college in the long run than it is to not take that path (for the average person anyway).",
      "author": "peregrin5",
      "created": 1537258481,
      "upvotes": 2,
      "replies": {}
    },
    "e66j9mg": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66j9mg/",
      "text": "It is exactly like that and all you can do is to drop out, learn a trade, and live a happy debt free life. Are you brave enough to do it?",
      "author": "redditlover91",
      "created": 1537253692,
      "upvotes": 1,
      "replies": {}
    },
    "e66h14z": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66h14z/",
      "text": "The word is “teeming.”",
      "author": "MrsGaillard",
      "created": 1537249754,
      "upvotes": 2,
      "replies": {
        "e66q0g5": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66q0g5/",
          "text": "Came here to say this. Journalism major. ",
          "author": "bigspring",
          "created": 1537268234,
          "upvotes": 2,
          "replies": {
            "e66zhwi": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66zhwi/",
              "text": "College professor here. And I have a hard time giving credence to students who don't proofread, who use social media slang, and who make vague complaints with no factual basis. OP offers no specifics. \n\nQuit bitching. ",
              "author": "MrsGaillard",
              "created": 1537279709,
              "upvotes": 2,
              "replies": {
                "e6acn3o": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e6acn3o/",
                  "text": "so his experience is invalid because he spelled a word wrong on reddit?",
                  "author": "LSDawson",
                  "created": 1537400395,
                  "upvotes": 1,
                  "replies": {
                    "e6d3ele": {
                      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e6d3ele/",
                      "text": "Yup. ",
                      "author": "MrsGaillard",
                      "created": 1537506442,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e66fncb": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66fncb/",
      "text": "One of mine forgot to show up on the first fucking day. Shit like that never happened in community college.",
      "author": "urlbluntstomyirlface",
      "created": 1537247628,
      "upvotes": 3,
      "replies": {}
    },
    "e66elfi": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66elfi/",
      "text": "I'm actually having a bigger issue with TAs than professors. It's already bad enough when I know my professors in my school's engineering department are more likely there for research (even though my school is better known for music), there is no excuse to get a 30 on a quiz because I didn't explicitly write a part of an answer that wasn't asked for, and the TAs not knowing that what they're looking for is in the work. My professor reviewed it and bumped my grade to an 80 (perfectly fine by me, and a lot higher than I expected).\n\nBut yes, mediocre faculty is definitely not worth hundreds of thousands of dollars. ",
      "author": "Wheatley36",
      "created": 1537246112,
      "upvotes": 4,
      "replies": {
        "e66eo4i": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66eo4i/",
          "text": "Nor should it be tolerated because you go to a research oriented university or any university. You’re paying for your education not their research department ",
          "author": "BrooklynWc",
          "created": 1537246216,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e66d7gb": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66d7gb/",
      "text": "They are not calling them \"teachers\" for a reason. Teachers are for high school students, not grown ups. Ok, sorry, that's maybe a bit harsh. But, there are two sides to every story. I felt damn lucky to be able to go to university. I still did go outside once and a while and swear my face off talking about certain professors. So I get it, I just have forgotten most of that stuff now as it's no longer relavent to my life.",
      "author": "a20xt6",
      "created": 1537244285,
      "upvotes": -1,
      "replies": {}
    },
    "e66byih": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66byih/",
      "text": "[deleted]",
      "author": null,
      "created": 1537242769,
      "upvotes": 0,
      "replies": {
        "e66c13i": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66c13i/",
          "text": "I’m at a state university that’s ranked one of the top ten public universities in the US (They are really proud of that lol). I *should* have good teachers ",
          "author": "BrooklynWc",
          "created": 1537242853,
          "upvotes": 3,
          "replies": {
            "e66cdun": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66cdun/",
              "text": "Weird because I’m also in one ranked one in the top ten and my professors are great. :D",
              "author": null,
              "created": 1537243268,
              "upvotes": 2,
              "replies": {
                "e66ii16": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66ii16/",
                  "text": "Depends on the college at UF. Some have really good professors and others don't. I've heard complaints that the humanities department doesn't get a lot of focus whereas STEM gets all the attention.",
                  "author": "thesushipanda",
                  "created": 1537252256,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "e66iau4": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66iau4/",
          "text": "UF is ranked #35 in the nation and #8 in public universities lol\n\nIdk why you think it's a community college",
          "author": "thesushipanda",
          "created": 1537251903,
          "upvotes": 1,
          "replies": {}
        },
        "e67wzeq": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e67wzeq/",
          "text": "Actually... our local community college has some pretty food faculty!  It really does vary and it's unfortunate students can't get better information about this before they enroll.\n\n",
          "author": "FeatofClay",
          "created": 1537307091,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e66br9j": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66br9j/",
      "text": "The worst is paying $1K for a class then having to pay another ~$500 just for that one class’ text books, etc..",
      "author": "spacedust94",
      "created": 1537242541,
      "upvotes": 4,
      "replies": {
        "e66bxoj": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66bxoj/",
          "text": "Lol there’s this thing in Gainesville because of the pass rate in some of our classes called Studyedge essentially it’s a third party class/study material that teaches the course material better than the university so many people pay for it on top of the class they are taking so they receive the college credit and they have to go to both lectures. It’s absolutely ridiculous but very popular here. To clarify so you can just pass the class and stay on critical tracking ",
          "author": "BrooklynWc",
          "created": 1537242743,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e66aroq": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66aroq/",
      "text": "It’s so frustrating and it’s just a universally known thing within my college. Everyone feels so wronged. And I had to vent here because I was talking with two of my classmates and we were complaining about how the class has been teaching us nothing and the teacher puts no effort in. I told them I looked up how much we were paying for this class and asked them if they thought it was worth it and they said no. BUT they weren’t angry, they didn’t feel wronged more they were just mildly annoyed. and I knew it was because they were just happy the class was easy enough to pass because a lot of what college has become for some people is a check mark to get an entry-level position.  They are apathetic to how they got there and they don’t care what price they have to pay. All I could think of was students who are supporting themselves through college or people who go back to college later to learn and the slap in the face it must be to be faced with this kind of shit.",
      "author": "BrooklynWc",
      "created": 1537241443,
      "upvotes": 3,
      "replies": {}
    },
    "e66ajas": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66ajas/",
      "text": "There really is not much you can do. When universities hire new professors, they arent looking to see how good of a teacher they are, they are looking to see how well they know the subject, and how well they can translate that knowledge into research and real-world application. I know you are really mad at one specific professor but you have to realize that the school is taking steps. I go to UF and know that between this year and last, UF has hired over 500 new faculty members, and has received additional funding from the state to do so. Every person, at some point or another has had a bad professor, its an unavoidable issue. Do you honestly think that you wouldnt have run into a similar problem at any other university? I get that UF prioritizes the three main professional branches of the university (engineering, business, agriculture/bio) but its still ultimately up to the J-school to bring in new talent.",
      "author": "Prada_Marfa",
      "created": 1537241196,
      "upvotes": 3,
      "replies": {}
    },
    "e667oi5": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e667oi5/",
      "text": ">Why do teachers with bad reps amongst the student body continue to teach? \n\nBecause students continue to take the class. If the student body really hates  them, students will find an alternative if possible. If a professor doesn't have enough students, their class is cancelled, they make no money. If that becomes a pattern, they're going to have an issue. Granted, sometimes... that professor is the \"one\" you're \"required\" to take and that sucks. \n\nI think the most powerful thing would be students refusing to take their class. It's also possible, other students like them or they're an \"easy a\" so some students still want their class even if it's boring if it means it won't hurt their GPA. \n\nIt's not too late to drop classes, so why havn't you yet if you hate them?",
      "author": "peacockpartypants",
      "created": 1537238450,
      "upvotes": 3,
      "replies": {
        "e66bn6s": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66bn6s/",
          "text": "the thing is it is a required course on my critical tracking and the only class left out of all of the lecture options available. I tried to take a class with a good professor but I was stuck in this class cause his was overbooked for students and had a long wait list. I couldn’t not take the class cause then I wouldn’t graduate on time next semester and I couldn’t choose another professor because all the other options I could switch into were filled to the brim. ",
          "author": "BrooklynWc",
          "created": 1537242414,
          "upvotes": 3,
          "replies": {
            "e66ibq0": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66ibq0/",
              "text": "It sounds like you waited until last minute to pick a class, if it was the only class left out of your available options?",
              "author": "peacockpartypants",
              "created": 1537251947,
              "upvotes": 1,
              "replies": {
                "e66qbxd": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66qbxd/",
                  "text": "Nope actually I signed up for classes right away and tried switching to a better one until the last minute. Only one left all other ones had waiting lists. Pretty sure my college is understaffed ",
                  "author": "BrooklynWc",
                  "created": 1537268794,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e66742z": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66742z/",
      "text": "Hey I’m at UF and if you choose to start a student union I am 100% with you!! ",
      "author": null,
      "created": 1537237930,
      "upvotes": 2,
      "replies": {
        "e66bg0p": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66bg0p/",
          "text": "I’m not sure what we need to do to get one but UF DEFINITELY and ESPECIALLY needs a student union holy shit ",
          "author": "BrooklynWc",
          "created": 1537242188,
          "upvotes": 1,
          "replies": {}
        },
        "e66bgw8": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66bgw8/",
          "text": "Curious, what major are you in? I’m talking in the point of view of the journalism college ",
          "author": "BrooklynWc",
          "created": 1537242215,
          "upvotes": 1,
          "replies": {
            "e66d041": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66d041/",
              "text": "[deleted]",
              "author": null,
              "created": 1537244024,
              "upvotes": 2,
              "replies": {
                "e66d25x": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66d25x/",
                  "text": "look out for a survey I’m going to put out soon about how much value students believe they are getting out of their classes. Cause I am making it soon and releasing it within the CJC just to see what happens ",
                  "author": "BrooklynWc",
                  "created": 1537244099,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e665ue6": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e665ue6/",
      "text": "The thing is that all the classes were filled to the brim. I got into the class last second so I could still graduate on time and I didn’t have the option of going to another teacher. I emailed to get on lists for other teachers class times and waited till the end of drop/add to see if anything would open up. I don’t think students should be stuck with bad teachers regardless because universities should have a more effective way to weed out bad teachers. There needs to be more accountability",
      "author": "BrooklynWc",
      "created": 1537236786,
      "upvotes": 2,
      "replies": {}
    },
    "e66456v": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66456v/",
      "text": "There are colleges out there with small class sizes, but they cost a lot more. Colleges have budgets and that means asking professors to teach more classes than they can competency do. I teach two classes a semester and it takes a lot of time to prepare and provide the students with a great learning experience. But some colleges have professors teaching three, four, and even five classes. At that point it is crowd control, not teaching.",
      "author": "beaubaez",
      "created": 1537235249,
      "upvotes": 2,
      "replies": {
        "e66bcqg": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66bcqg/",
          "text": "Yeah but in my case it’s not. There are other teachers for the class she only has two blocks. She doesn’t make time for the class/ she has another job that she should just focus on (in industry, as far as I know decently successful because I’ve looked on their website and they have a lot of in town clients) cause it’s clearly taking priority. ",
          "author": "BrooklynWc",
          "created": 1537242085,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e660mwj": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e660mwj/",
      "text": "Part-time adjunct professor here! \n\nI teach two classes - one where I was handed the whole course and told not to veer from it, and another that I'm pretty passionate about and given free reign.\n\nThe first class is a required course and mildly boring, but since I'm adjunct I have literally zero say in it and I have to deliver it the way it was given. It's terrible, but I have to do it this way.\n\nThe second one I have a lot more fun in, and I spend hours preparing lessons and lectures to try to give students more experience like what they'd find in the real world.\n\nI adjunct because I enjoy teaching, and it supplements my income. It doesn't happen very often so I try not to be super vocal so they don't skip over me next time they need an adjunct.",
      "author": "ILoveMagicUnderwear",
      "created": 1537232107,
      "upvotes": 12,
      "replies": {
        "e66b6vx": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66b6vx/",
          "text": "I bet you’re a great teacher you sound like you try your best even to convey the course material. I have no problem with professors or even ones that are still figuring out the teaching process but are doing their best. I’m talking about teachers who don’t prepare anything, don’t teach from subject material, and let everyone out early because they have nothing more that day every day. It’s professors who have put no thought or effort into the classes they’re teaching and i have to sit in their lectures do their busy work and pay money for an education that is not even being attempted to be given to me.",
          "author": "BrooklynWc",
          "created": 1537241909,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "e65yk7k": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65yk7k/",
      "text": "[deleted]",
      "author": null,
      "created": 1537230145,
      "upvotes": 9,
      "replies": {
        "e66b0cf": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66b0cf/",
          "text": "What’s more depressing is that most students I talked to about it are so apathetic. Like geez, you guys are kind of proving their point that we don’t give a shit enough to deserve better teachers ",
          "author": "BrooklynWc",
          "created": 1537241708,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "e65wxw3": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65wxw3/",
      "text": "I could not agree anymore, these professors are knowledgeable when it comes to their work. However when it comes to explaining it , they're pretty much are useless. My own classmates can explain topics better. Sometimes my professor is so boring when he lectures. It actually discourages me from trying to be active during class. \n\n&#x200B;\n\nThey really do need to changed that, but then again how would you determine a professor is good to teach? some students may not like a professor while other may love them. So it can be pretty tricky to decide. \n\n&#x200B;",
      "author": "GodOfThunder101",
      "created": 1537228553,
      "upvotes": 5,
      "replies": {
        "e66axnf": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66axnf/",
          "text": "Yeah it is subjective on what a good teacher is. My main issue is with teachers who aren’t even trying to do the bare minimum but I am required to pay hundreds of dollars along with dozens of other students because the class is required and supposedly will help me with my career ",
          "author": "BrooklynWc",
          "created": 1537241627,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e65uqsu": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65uqsu/",
      "text": "A lot of your professors feel the same way, but for them it's slightly better than working at Starbucks, which is probably thier next option. ",
      "author": "ikilledtupac",
      "created": 1537226401,
      "upvotes": 0,
      "replies": {}
    },
    "e65uelt": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65uelt/",
      "text": "You attend a large university. Professors are hired based on their research productivity and how much grant money they bring in, not on how well they teach. If you want quality teaching, you’re better off at a small college or community college. That’s unfortunately how it works. And even at small colleges, we’re constantly asked to teach more classes and more students, hence things like online homework systems. If I had to grade all the homework I need you to do to learn the material, I wouldn’t have time to sleep. ",
      "author": "eridalus",
      "created": 1537226073,
      "upvotes": 5,
      "replies": {
        "e66aurc": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66aurc/",
          "text": "I’m talking about in-person classes with 20 people. I get the mass lecturer thing but there is a difference in not wanting to grade all that homework and not putting any effort into your teaching.",
          "author": "BrooklynWc",
          "created": 1537241538,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "e65sxd7": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65sxd7/",
      "text": "One thing you're realizing, OP, is that not all colleges treat teaching the same or prioritize it equally. While what you're experiencing is all too common at certain types of schools, it is far from universal. At teaching-centered schools (like liberal arts colleges) *teaching* is the primary duty of faculty and research comes second. Faculty who cannot demonstrate high-quality teaching consistently cannot earn tenure or promotion at those schools. Moreover, such institutions do not have graduate students (so no graduate TAs) and they generally rely far less on  adjunct/temporary faculty than large schools like yours. Teaching evaluations by students often play a major role in hiring/tenure/promotion at such schools, and they will generally take concerns about teaching raised by students seriously.\n\nWhen someone tells you \"all colleges are basically the same\" they are incorrect. Incidentally, they are often also incorrect when they tell you it's going to be cheaper to attend a huge public university rather than a small private college--- many students find that financial aid at private schools ends up making them cost the same or even less out-of-pocket as their state universities.",
      "author": "SnowblindAlbino",
      "created": 1537224690,
      "upvotes": 18,
      "replies": {}
    },
    "e65rtbd": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65rtbd/",
      "text": "God I feel you. I don’t know what can be done, but I have 5 classes this semester and only 2 are taught by professors, that’s how bad my school has gotten. \n\nTwo are taught by grad students. One just doesn’t give a shit about the class and you can tell. She spends long periods of time out of the room, dedicates most of every lecture to “class discussion,” which she doesn’t participate in at all except to call on kids raising their hands. She also treats the class, which is a creative writing class, as a lit analysis class. The vast majority of each class has been dedicated to discussion about the novels we’re reading rather than what we’re writing. I’m not getting what I’m supposed to get out of this class. \n\nThe other grad student teacher I have is sincerely trying, but she’s incredibly nervous and obviously doesn’t actually know an incredible amount about what she’s teaching. It’s a 300 level course and we’re learning essentially all the same things we learned in a 100 level class on the same subject I took last semester. She also doesn’t know how to control a class, and the class tends to get out of her hand and discussion is dominated by two egomaniac kids we have in class who only want to talk about themselves. \n\nOne more class isn’t taught by a professor. It’s taught by a high school teacher, I shit you not. He’s not bad, but he obviously has no barometer for the difference between his high school students and his college students. He just assigns an impossible amount of reading for each class and I can never find the time to do it on top of my other classes so I just have to sparknotes everything which is really not what I want to do. \n\nI really just can’t believe I’m paying for these classes. I had to write this down somewhere. I’ve been wondering all the same things as you lately. ",
      "author": "robertjohnston276",
      "created": 1537223666,
      "upvotes": 13,
      "replies": {}
    },
    "e65qdoj": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65qdoj/",
      "text": "A big reason is because the career path to becoming a professor has very little to do with actual teaching. You don't get any training on how to teach a class effectively, how to comunicate technical ideas, how to make a lesson plan, etc. Getting a PhD is the minimum requirement to become a professor at most colleges/universities (aside from community colleges), but all the experience you gain through your PhD is about doing research not teaching. Yes, many PhD students *do* get some teaching experience by TAing but TAs aren't usually given any instruction on *how* to teach a class aside from maybe a day of orientation they have to go to their first year. And you often don't have any control over the content of the class(this varies widely by discipline). The professor you are TAing for will usually provide you with the course materials and assignments and your job is mostly to grade. \n\nBut more importantly, you are judged primarily on your research accomplishments than your teaching. Universities don't necessarily hire a professor because they think they will be great teachers. They hire them because they think they will be able to publish quality research and get awarded grants for their research, which in turn rakes in more money and prestige for the university. Yea, when hiring for tenure track positions they do consider what classes you've taught and your teaching evaluations. But arguably your publication record and research accomplishments are more important. A big part of the interview process is usually a pitch that describes the kind of research you plan to do as a professor at the university. And when you are being considered for tenure, one of the main focuses is on your research output during the time you've worked at the university.  \n\nOf course, everything I just described is probably more true for big research universities than say small liberal art colleges that don't have a graduate program. But ironically the \"best\", most prestigious schools are usually large, research universities...\n\nSo, basically, a lot of the garbage professors fall into two categories. They are professors who are actually really knowledgable about their field and good researchers but just horrible at communicating/teaching. Or they are adjuncts who have had little to no teaching experience yet.  ",
      "author": "stathicus",
      "created": 1537222338,
      "upvotes": 27,
      "replies": {}
    },
    "e65n4so": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65n4so/",
      "text": "[deleted]",
      "author": null,
      "created": 1537219517,
      "upvotes": 0,
      "replies": {
        "e65npva": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65npva/",
          "text": "Many, not most. The majority of faculty in the US are not tenured. ",
          "author": "ecklesweb",
          "created": 1537220010,
          "upvotes": 8,
          "replies": {
            "e66cadr": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66cadr/",
              "text": "Well there’s enough tenured ones to make most students’ experience absolute shit. ",
              "author": "spacedust94",
              "created": 1537243151,
              "upvotes": 2,
              "replies": {}
            },
            "e65p7dv": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65p7dv/",
              "text": "[deleted]",
              "author": null,
              "created": 1537221281,
              "upvotes": 2,
              "replies": {
                "e65tlao": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65tlao/",
                  "text": "The majority of faculty - nontenured - have no job protections. You don’t get fired, you just don’t get renewed. That’s true even at public universities in the US.  ",
                  "author": "ecklesweb",
                  "created": 1537225301,
                  "upvotes": 12,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e65lwdu": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65lwdu/",
      "text": "In general it will be pretty hard to do anything about the way a professor teaches or the effort they put into their classes. However, what you can do on your end is take professors, not classes. Figure out what classes you need for the semester and then see what professors teach it and search them all on websites like RateMyProfessor. Then get enrolled in courses that have highly rated professors or professors that cater to your learning style.",
      "author": "abcrck",
      "created": 1537218474,
      "upvotes": 12,
      "replies": {
        "e665xw9": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e665xw9/",
          "text": "I had no option but this class time, regardless I think it’s wrong that anyone is stuck paying for a class where the teacher doesn’t care and the students suffer. ",
          "author": "BrooklynWc",
          "created": 1537236875,
          "upvotes": 4,
          "replies": {
            "e66a9ad": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66a9ad/",
              "text": "I totally agree with you. It’s not fair that universities get to take thousands of dollars of our money and not give us competent teachers; it’s the least they could do for how much we’re paying! Unfortunately I think the amount of things you could do to impact a teacher’s effort is minimal, which sucks. All I can think of is maybe going to office hours and asking questions about the material in order to force your professor to engage. But I wish you luck pushing through with that class and hopefully you’ll be able to take better professors next semester!",
              "author": "abcrck",
              "created": 1537240905,
              "upvotes": 5,
              "replies": {
                "e66bs67": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66bs67/",
                  "text": "Appreciate it! Especially with so many students paying for the class I feel like it would be easier to get better teachers. I just feel wronged. With being a stem focused school I wish that they would just not have a journalism college altogether rather than this half baked and low effort college (still ranked one of the best in the country) ",
                  "author": "BrooklynWc",
                  "created": 1537242569,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e65lnpe": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65lnpe/",
      "text": "The main thing I have a problem with is how almost every teacher I have is using the slides and work provided by Pearson or McGraw Hill. My problem is with the companies and with the teachers. The lessons feel so lifeless. They stick to the slides and assign work in WileyPlus or My(insert subject)Lab. What happened to creating your own damn lesson plan and being an actual teacher and not just a medium for these massive companies to extort money out of students.\n\nIdunno I just wish my professors were more interactive and didnt depend so much on other people to create their material. Maybe its just my school or my professors, but I feel like this is a widespread issue.",
      "author": "ncoburn1234",
      "created": 1537218274,
      "upvotes": 69,
      "replies": {
        "e65ns13": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65ns13/",
          "text": "Classes like this are what students should be protesting. It is offensive. ",
          "author": "VROF",
          "created": 1537220060,
          "upvotes": 29,
          "replies": {}
        },
        "e66glia": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66glia/",
          "text": "If a school wants to recruit freshman. This should be an advertisement. God awful companies",
          "author": "Tommy27",
          "created": 1537249057,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "e65krox": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65krox/",
      "text": "professors at large state schools are research oriented because that's how they get their grants. tbh you're not a priority fam and i truly do get it since i go to a state school as well.",
      "author": "davvidho",
      "created": 1537217562,
      "upvotes": 11,
      "replies": {}
    },
    "e65kos4": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65kos4/",
      "text": "I feel like eliminating the whole idea of tenure would be a big step in the right direction.\n\nNo one should have total job security like tenured professors do even if they suck at their job.",
      "author": "LordMudkip",
      "created": 1537217496,
      "upvotes": 9,
      "replies": {
        "e65nnf4": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65nnf4/",
          "text": "To offer the counter argument, if you don’t have tenure, you can’t teach or research unpopular or controversial topics. Your work will be milquetoast. ",
          "author": "ecklesweb",
          "created": 1537219950,
          "upvotes": 28,
          "replies": {
            "e65off6": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65off6/",
              "text": "This is virtually never relevant.  \n\n1.\tThe vast majority of research is boring as hell and not controversial whatsoever. \n2.\tresearch is driven by grant acquisition, which means even professors with tenure have to appeal to whoever controls the purse strings to do their job effectively. \n\nAcademia in its current form is a black hole of accountability. Unsurprisingly, it attracts the most self-important, vindictive people who can take the most advantage of the position. The whole system needs an overhaul. ",
              "author": "deadliestcat",
              "created": 1537220618,
              "upvotes": -2,
              "replies": {}
            }
          }
        },
        "e65nq50": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65nq50/",
          "text": "> I feel like eliminating the whole idea of tenure would be a big step in the right direction.\n\nI feel like lack of tenure is why there are so many garbage teachers in college right now. Part time staff is paid very little and they sometimes end up teaching at multiple colleges just to make a living. This leads to bad teaching practices in order to manage time as opposed to full-time faculty who only teach a few classes. ",
          "author": "VROF",
          "created": 1537220016,
          "upvotes": 14,
          "replies": {
            "e668emr": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e668emr/",
              "text": "Yep. Almost every tenured professor I've had has been great. My bad experiences have mostly been with TAs or adjunct professors.",
              "author": "harryrunes",
              "created": 1537239132,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "e65k0mc": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65k0mc/",
      "text": "well there are a few options: first report lackluster performance on rate you professor and on course evaluations. Second dont take professors that have bad reviews on ryp.",
      "author": "bestjakeisbest",
      "created": 1537216967,
      "upvotes": 7,
      "replies": {
        "e65zbkc": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65zbkc/",
          "text": "which is impossible if you're in certain programs that only have one class with one professor teaching the course.",
          "author": "sa5m_i_am",
          "created": 1537230877,
          "upvotes": 5,
          "replies": {
            "e666eyu": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e666eyu/",
              "text": "in that case you have one real option: kiss his/her ass. If it is just one class, just kiss their ass and get it over with, if it is multiple courses perhaps look at a different college (transfer) and hope you have better luck.",
              "author": "bestjakeisbest",
              "created": 1537237300,
              "upvotes": 2,
              "replies": {
                "e66r241": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66r241/",
                  "text": "hahaha. You don't just transfer in graduate school. I've been around a while with bad teachers, on my second graduate degree from an ivy league. There is really no kissing ass, transferring, or etc... \n\nYour advice perhaps has merit in undergrad, but if you get a shit professor in one of the 30 or so mandatory classes taught by one person with one section, sucking up does not make them a better teacher.",
                  "author": "sa5m_i_am",
                  "created": 1537269976,
                  "upvotes": 2,
                  "replies": {
                    "e67bwcu": {
                      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e67bwcu/",
                      "text": "i never said i could fix the teachers i just gave options, and even if transferring would mean starting over for grad school it is still an option (bit of a nuclear option but still)",
                      "author": "bestjakeisbest",
                      "created": 1537290244,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "e65ipf5": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65ipf5/",
      "text": "A professor in my college last year had over half of the class drop because he was such a stuck up asshole, the student society released a news article about it and he’s back again this year teaching more classes with barely any students because people refuse to take his classes. The college and university did absolutely nothing to help the students out. ",
      "author": "lztandro",
      "created": 1537215926,
      "upvotes": 133,
      "replies": {
        "e65p5oq": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65p5oq/",
          "text": "I had a prof I rated 2 stars on ratemyprofessor and somehow it was refuted and the rating got dropped. She then proceeded to find who posted it by questioning the students individually.",
          "author": "tburns12",
          "created": 1537221239,
          "upvotes": 68,
          "replies": {
            "e65p911": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65p911/",
              "text": "Should have reported that bitch",
              "author": "lztandro",
              "created": 1537221320,
              "upvotes": 56,
              "replies": {
                "e65pksv": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65pksv/",
                  "text": "For what she questioned ppl after class ended and then publicly announced it in class a few classes later. Idk what I could’ve done but I’m glad to be out of that class",
                  "author": "tburns12",
                  "created": 1537221612,
                  "upvotes": 20,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "e65in74": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65in74/",
      "text": "Form a student union!",
      "author": "rea1l1",
      "created": 1537215879,
      "upvotes": 17,
      "replies": {
        "e65kxy5": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65kxy5/",
          "text": "Lol could this work? What do they do? ",
          "author": "BrooklynWc",
          "created": 1537217703,
          "upvotes": 4,
          "replies": {
            "e65li8f": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65li8f/",
              "text": "Presuming they can get students to sign up and guarantee that students will be responsive, they can easily demand that a teacher no longer teach a particular class if they can get all of the students to refuse to sign up for it unless a decent teacher is placed in charge. At my college, if 15 students haven't signed up for the class it gets cancelled. Do this for all of the classes of a particular teacher... and then what happens?",
              "author": "rea1l1",
              "created": 1537218149,
              "upvotes": 11,
              "replies": {
                "e65n36g": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65n36g/",
                  "text": "The way they got around that at my college is by hiding the names of the professors at registration for a certain department so it's luck of the draw if you get a certain shitty prof. ",
                  "author": null,
                  "created": 1537219479,
                  "upvotes": 8,
                  "replies": {
                    "e65nf7b": {
                      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65nf7b/",
                      "text": "That shouldn't make a difference. Day one of class: bad professor on the union blacklist? \n\nDrop class. \n\nYes, it will suck for those students, but that's the only way to fight back.",
                      "author": "rea1l1",
                      "created": 1537219755,
                      "upvotes": 7,
                      "replies": {
                        "e65oj2s": {
                          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65oj2s/",
                          "text": "I feel like dismissing the negative consequences of being stuck with a bad prof, or potentially not getting into a class and graduating late is not a great way to get people to join your revolution",
                          "author": null,
                          "created": 1537220705,
                          "upvotes": 8,
                          "replies": {
                            "e65q6iw": {
                              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65q6iw/",
                              "text": "Oh, I know. I'm not dismissing the negative consequences. They are there. It's not the best. If people aren't willing to sacrifice a little bit for the greater good, then there is no greater good, and we are all fucked. We must be willing to personally lose in the now for the whole to win the future. That's how it's always been. That's how it will always be. \n\nAre you willing to do what is right and fight the good fight? Or will you merely do what is convenient, and let the little evils of the world prosper? Do you care about our society being one of virtue, or shall we accept the decadent corruption and avoid dealing with it, ever pushing it upon our children?",
                              "author": "rea1l1",
                              "created": 1537222161,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "e66mwye": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66mwye/",
              "text": "I’d be down for stuff like this but idk how it could be implemented and not abused (for those folks super desperate about getting good grades) ",
              "author": "iceleo",
              "created": 1537261635,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "e65gx3h": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65gx3h/",
      "text": "It gets complicated because I feel like it's hard to get a good definition of \"bad teaching.\" A lot of the lower-level classes are lecture-style classes and you could classify that as \"bad teaching,\" even though that is the norm in most schools. It's at least low-engagement teaching, but it's a necessary evil because it's not practical to have one-to-one teaching if it's hundreds of students in each class. \n\nIt's not like people haven't tried to get accountability for teaching in the classroom, but most of that is aimed at the lower grades, specifically high school. There is a lot of continuing education high school teachers have to go through to continue teaching, but I don't know if that necessarily translates into better teaching. \n\nJust curious as to what you describe as \"bad teaching\" in your classes currently? Teaching is like any other skill...it's like a bell curve. So most teachers fall somewhere in the middle and in the rare cases you get a really bad or really amazing teacher. ",
      "author": "dreamsofaninsomniac",
      "created": 1537214505,
      "upvotes": 49,
      "replies": {
        "e65pggc": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65pggc/",
          "text": "Or teachers that have a class oriented around a fuckin PowerPoint that was made by someone else years ago and they just read it verbatim. I didn’t pay hundreds of dollars for a PowerPoint and a narrator.",
          "author": "tburns12",
          "created": 1537221504,
          "upvotes": 32,
          "replies": {
            "e65xunk": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65xunk/",
              "text": "That’s exactly what some of my classes are, especially last year. ",
              "author": "DancingWithOurHandsT",
              "created": 1537229453,
              "upvotes": 7,
              "replies": {}
            }
          }
        },
        "e65nmrk": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65nmrk/",
          "text": "> it's hard to get a good definition of \"bad teaching.\" \n\nA good start is identifying which teachers choose to use textbooks that require an additional code purchased that allows students to access online features like tests, quizzes, and homework. That means the teacher isn't creating those materials and is requiring students to pay even more for something that should have already been included in the fees they pay for Canvas/Blackboard and the tuition that pays a teacher to perform these tasks. \n\n",
          "author": "VROF",
          "created": 1537219934,
          "upvotes": 27,
          "replies": {
            "e65p9l2": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65p9l2/",
              "text": "It’s not always up to the professor. At my college some departments are required by the school to use online textbooks through some agreement with a publisher. ",
              "author": "introvertedbassist",
              "created": 1537221334,
              "upvotes": 21,
              "replies": {
                "e65pcp1": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65pcp1/",
                  "text": "This is the kind of thing students should protest. ",
                  "author": "VROF",
                  "created": 1537221408,
                  "upvotes": 17,
                  "replies": {}
                }
              }
            },
            "e65pio9": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65pio9/",
              "text": "What if a teacher feels the materials are good in the book? This hasn't happened to me but it is happened to people I know who are professors. Students honestly are not the greatest at deciding what is good and bad teaching because they're only learning the material for the first time, they don't know what is important to emphasize, and their experience may not be close to the statistical average.",
              "author": "Reggaepocalypse",
              "created": 1537221559,
              "upvotes": 21,
              "replies": {
                "e65q33e": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65q33e/",
                  "text": "I graduated from college in the 90s and in the last 10 years have taken several classes at a local CC and local University for fun. Some of the teachers are just garbage, some of them are outstanding. One of the best teachers I had taught an online history class that required no textbook. She found free online resources for us to use and created excellent assignments. I retained a lot of information from that class based on the modules she built. Yes, most of the other students complained that she was too hard and they didn't like doing the work. \n\nI have also taken classes where we had to buy a textbook with access code for $100 or just the code for $80. My kids were in high school and we all took it together. So instead of sharing one book, I ended up paying for three access codes to take idiotic quizzes and turn in homework assignments. It was absurd. We never even opened the textbook. The class met once a week and the teacher cancelled a few of those. She was an adjunct of course who taught at other colleges in the area. \n\nColleges should require departments to develop programs using as many free materials as possible and teachers should not be allowed to require students to purchase access codes. They already pay technology fees for Canvas/Blackboard and teachers who want to teach can create modules themselves with the quizzes, tests, and homework for students to use on those platforms. \n\nIn California they are always trying to raise tuition to pay their chancellors and presidents more money all while hiring part time adjuncts to actually provide the education students pay for. ",
                  "author": "VROF",
                  "created": 1537222073,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            },
            "e669u9p": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e669u9p/",
              "text": "I think there are benefits to the online math problems. My prof. All had to go through and choose the questions they wanted so they do have input. Then as a student immediately seeing if I was correct was nice. And finally all of the programs I used would show a worked out problem when I got it wrong which really helped me. So seeing a required access code was not an indicator of the skill of the prof.",
              "author": "Spacepirateroberts",
              "created": 1537240488,
              "upvotes": 4,
              "replies": {}
            }
          }
        },
        "e665njr": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e665njr/",
          "text": "A lot of the teachers have been out of industry for 10+ years and are teaching out dated material. the teacher that inspired me to make this post is part time and spends a quarter of the class going over homework another quarter going over watered down slides that don’t seem to site anything except what she thinks and then she lets us out an out early. She even reuses slides from last class. When I am routinely getting let out early cause you haven’t prepared for the rest of class you’re a bad teacher.",
          "author": "BrooklynWc",
          "created": 1537236614,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "e65ff4z": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65ff4z/",
      "text": "Some of those professors are \"career adjuncts\".  These are faculty who have not earned tenure and cobble together a career out of contingent semester-long contract appointments.  They often are there because the university simply doesn't have the money to pay a regular faculty member.  Maybe you get what you pay for.\n\nSome of those professors are tenure track.  Those profs have six years to build a scholarly portfolio that will either result in a job for life or getting fired.  While every university and department is slightly different, a research university like Florida probably emphasizes research at the expense of teaching.  No one ever got tenure for being an amazing teacher, but many have been denied tenure for being sub-par researchers.  You do the math.\n\nSome of those professors are tenured.  Presumably they've been through one of the most rigorous selection processes this side of the Navy Seals, but that process may not have focused much on teaching, and once tenured, promotion opportunities are still heavily research oriented.\n\nSome of those professors are \"true adjuncts\".  These are professionals with day jobs in industry who are hired to teach a class here or there to fill a gap and presumably to lend practical experience.  Many have no background at all in education or academia, and it will take them a while to get good at teaching.\n\nI think in the end what matters is what your university and department emphasize.  There are plenty of colleges that emphasize teaching and have great teachers -- community colleges and liberal arts colleges are often among this group.  Research universities typically are not.\n\n&#x200B;",
      "author": "ecklesweb",
      "created": 1537213288,
      "upvotes": 247,
      "replies": {
        "e65fnxn": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65fnxn/",
          "text": "That really helps put it into context. And the semester-long contracts makes a whole lot of sense. A general consensus amongst students within my specific college (journalism) feel like the university prioritizes sciences and math based colleges because of its research focused. But by national ranking UF still has one of the best journalism colleges which is nuts",
          "author": "BrooklynWc",
          "created": 1537213490,
          "upvotes": 66,
          "replies": {
            "e65nh9v": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65nh9v/",
              "text": "Is your university trying to pay admin more to \"get good people?\" Because that is a good place to start. Look at the faculty in your department and find out how many are full-time and how many are adjuncts. I think you will find it is staffed with part time teachers just trying to make a living. This means it is more likely they will use textbooks where the company makes the homework, quizzes and tests and the teacher has to do very little beyond lecture. Sadly that is becoming more and more common and students need to be protesting that. ",
              "author": "VROF",
              "created": 1537219804,
              "upvotes": 18,
              "replies": {}
            },
            "e66chhb": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66chhb/",
              "text": "[deleted]",
              "author": null,
              "created": 1537243391,
              "upvotes": 5,
              "replies": {
                "e66d5og": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66d5og/",
                  "text": "We just got reviewed for our accreditation and apparently the person they sent was overtly surprised about how archaic our classes were for such a high ranked school lmao many of our teachers are from industry but they left 20 or so years ago and are super out of touch with what’s happening now ",
                  "author": "BrooklynWc",
                  "created": 1537244221,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "e65ycou": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65ycou/",
              "text": "That's because STEM brings in much MUCH more money to the University than communications. ",
              "author": null,
              "created": 1537229940,
              "upvotes": 5,
              "replies": {
                "e66aeeq": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66aeeq/",
                  "text": "Yeah the teacher that *inspired* me to make this post is part time. She doesn’t put any effort into her lectures and lets us out early every class cause she doesn’t have enough prepared ",
                  "author": "BrooklynWc",
                  "created": 1537241052,
                  "upvotes": 8,
                  "replies": {
                    "e66hraw": {
                      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66hraw/",
                      "text": "And is probably making barely enough to eat and keep a roof over her head working 60+ hours a week. \n\nAverage pay for a part time faculty member is around $1500-$2500 for a semester long class. ",
                      "author": "Eigengrad",
                      "created": 1537250954,
                      "upvotes": 9,
                      "replies": {
                        "e66qaui": {
                          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66qaui/",
                          "text": "She has another job it’s a whole business actually and as far as I know it’s pretty successful. I’ve looked on her website and it has a lot of in-town clients I work at another agency in town that has less and everyone is doing just fine. ",
                          "author": "BrooklynWc",
                          "created": 1537268741,
                          "upvotes": 2,
                          "replies": {
                            "e676fey": {
                              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e676fey/",
                              "text": "You keep mentioning how much you’re paying for the class, I’m pointing out how little of that goes to pay faculty. \n\nAt $1500, that’s $15 and hour for 100 hours of work. Lectures are about 50 hours for a 3 credit course, so then there’s an hour per class meeting for grading and prep. \n\nSo if the lectures look like they’ve taken less than an hour to put together, you know why. \n\nWant better teachers? Lobby for them to be paid enough that they can spend time teaching. ",
                              "author": "Eigengrad",
                              "created": 1537285783,
                              "upvotes": 7,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "e665l67": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e665l67/",
          "text": "Exactly.\n\nMe putting a lot of effort into my teaching is like you studying the non-examinable material in a class: in an ideal world, being an ideal person, you would, but it actually doesn't help you in an immediate sense and there are \"better\" things you can spend your time on.\n\nI'd *love* to put way more effort into my teaching, but at the end of the day I'll never be rewarded for that. In fact, I'll be overtaken by people who put almost no effort in because they'll have significantly more time for research, and that's our yard-stick. We're supposed to be aiming for *4* publications every year. \n\nIf you want things to change, you need to be looking at your universities, not predominantly the professors. It's the university that forces us to take on way too many classes with way too many students, use proprietary software and expensive textbooks, and focus away from teaching. I know a lot of people who would love to do more in their teaching but are explicitly told not to bother with it since it detracts from what really matters. If I focus on teaching, then I won't be teaching you for very long. \n\nAcademia has some toxic issues right to the core, and the entire system needs to be overhauled. You can't even rely on student evaluations because they're known to be biased against women and minorities, so much so that one university termed their use a human rights violation. Your professors are often overworked, underpaid, and under appreciated by their community. ",
          "author": "NoxiousQuadrumvirate",
          "created": 1537236552,
          "upvotes": 18,
          "replies": {
            "e66ie2x": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66ie2x/",
              "text": "Funnily enough, I read beyond what we had to learn for a teacher who was really passionate about teaching ",
              "author": "mimibrightzola",
              "created": 1537252063,
              "upvotes": 1,
              "replies": {
                "e66j7s4": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66j7s4/",
                  "text": "I assume that's because you had the time and energy to spare to do that. If you were constantly bogged down in work and barely keeping afloat, you probably wouldn't bother with extra work that won't be recognised. \n\nWhen it comes to research, there aren't really that many deadlines, and pretty much all of it is \"opt-in\" in some sense. That means we've never technically finished our work for the day or for the week. If I finish all of my marking then there are still infinite things I can do for my research. Those research tasks will help me in my career, whereas putting extra effort into teaching will not. Considering how cutthroat the academic job market is, I'm pretty well obligated to focus on research. Grants and publications don't go to researchers because they're good teachers. \n\nAnd I *do* do a lot of extra outreach work, but I recognise that it won't get me a job at the end of the day. In fact, I can name a few people who were purposely overlooked and even kicked out of their graduate programs because they were focussing too much on teaching and outreach and weren't publishing enough - they apparently weren't \"dedicated\", in spite of keeping on track and getting great results. In as many words, it's the universities themselves that tell us not to focus on teaching. It's very much a sort of Pareto principle in action. ",
                  "author": "NoxiousQuadrumvirate",
                  "created": 1537253593,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            }
          }
        },
        "e66icid": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66icid/",
          "text": "The university doesn’t have the money to pay them? Lol. Do you know most universities have multi million, even billion dollar endowments? I’m so sick of universities being willing to hire tons of administrative staff and yet somehow coming up short every time when it comes to the people who actually keep the place running. ",
          "author": "soberasfuck",
          "created": 1537251985,
          "upvotes": 4,
          "replies": {
            "e66q342": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66q342/",
              "text": "Perhaps it's better to say \"departments don't have money to pay them\". They are given a budget and hiring must be kept within the boundaries of the budget.",
              "author": "aftersox",
              "created": 1537268363,
              "upvotes": 8,
              "replies": {}
            },
            "e67vuoj": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e67vuoj/",
              "text": "Students should definitely advocate that good teachers get paid a wage that reflects their teaching excellence and the contributions they make to your education.  \n\nBut the answer \"they have a big endowment\" is not really the right solution.  It's something a lot of critics understandably point to because it's a big number, but not enough people understand how endowments work generally and what that means for higher ed.\n\nFirst of all, the biggest portion of the endowment shouldn't ever be spent.  That's the point of an endowment:  you set aside money that will be invested, not spent, so that it throws off earnings which *can* be spent on things.  So a college with a $500M endowment doesn't, in fact, have $500M available to spend on making things better.  They aren't supposed to spend the $500M at all.  What they are supposed to do is invest the endowment and then use some of the interest to make stuff better (how much is usually decided by a policy set by the board or regents or trustees), and use the remainder of that interest to plow back into the corpus (that's the main part of the endowment) so the value is protected against inflation.\n\nNow, it is completely fair to say, \"Okay, what is my college doing with the interest/proceeds, and why isn't it spending it on paying adjuncts better?\" Well, one issue is that often times when people give money to the endowment, they give it with a purpose in mind and there are restrictions built into the gift agreement.  They may have given it for the music school and want any interest earned to support the symphonic bands.  Or they wanted it to support a cancer researcher.  Or they wanted it to go for financial aid.  That's what the college has to spend it on; their flexibility is limited.  And frankly, there probably aren't a lot of big-time donors that have given to the cause of paying adjuncts better.  \n\nNow, THAT SAID, spending the gift funds on financial aid or the symphony or whatever, sometimes frees up some of the general fund money the college was formerly spending on those things.  Not always!  Donors are likely to think, \"I want my money to help you give MORE aid; I don't want you to give the same aid you always have, and use the money you used to spend on aid for something else.\"  But where possible, a college might be able to free up some money thanks to the endowment proceeds. So from that standpoint, proceeds from the endowment may allow them to pay adjuncts better.  \n\nI know this got a little long, but I hear this kind of concern from students a lot--not understanding how and why a large endowment is being used.  The answer is, it probably is being used, but some of those uses are guided by the original donor.   I also think that endowment spending is typically pretty \"invisible\" to students because they don't have the time or the access to see the source of spending.   They may think their tuition dollars are paying for everything while the endowment does nothing.  But in fact, their tuition dollars are being supplemented in a number of areas by endowment proceeds.\n\nI'd like to see colleges do a lot better job explaining this!  My university's endowment is in the billions, and students are naturally very interested in how it is used. ",
              "author": "FeatofClay",
              "created": 1537306098,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "e65dv66": {
      "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65dv66/",
      "text": "Vote with your wallet",
      "author": null,
      "created": 1537212050,
      "upvotes": -14,
      "replies": {
        "e65dzxv": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65dzxv/",
          "text": "What if I am required to take a class for my major? I can’t just skip it cause I don’t like the teacher. And moving to another university is just going to drive up my expenses.",
          "author": "BrooklynWc",
          "created": 1537212156,
          "upvotes": 7,
          "replies": {
            "e65k14j": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65k14j/",
              "text": "If the professor is really unbearable, your best path is to either drop the class and take it another semester if another professor is teaching it (at my school we usually have two professors teach a class: one in the fall, one in the spring),or take the course at another university (either community college nearby, an online course, or at another university over the summer). You will always have at least one shitty professor in your academic career.",
              "author": "skilledman101",
              "created": 1537216978,
              "upvotes": 4,
              "replies": {}
            },
            "e663szm": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e663szm/",
              "text": "Pay 50k a year if you want a decent education.",
              "author": "Ultra_dc",
              "created": 1537234946,
              "upvotes": 2,
              "replies": {}
            },
            "e65fenw": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65fenw/",
              "text": "So taking the financial hit is still the most economically rational choice. Behave rationally.",
              "author": null,
              "created": 1537213278,
              "upvotes": -6,
              "replies": {}
            }
          }
        },
        "e65u14y": {
          "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65u14y/",
          "text": "Really surprised you got downvoted to oblivion. Seems like a reasonable answer to me. Don’t like the teaching?  Go elsewhere. Enough people do that, things change. Hypothetically, at least. ",
          "author": "ecklesweb",
          "created": 1537225720,
          "upvotes": 2,
          "replies": {
            "e65u35k": {
              "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e65u35k/",
              "text": "Money talks, people just dont like it for whatever reason. ",
              "author": null,
              "created": 1537225774,
              "upvotes": 1,
              "replies": {
                "e66wj9d": {
                  "link": "/r/college/comments/9gndbu/i_feel_like_colleges_are_scamming_students_with/e66wj9d/",
                  "text": "The definition of insanity is doing the same thing over and over again expecting different results. It's a common theme I've noticed on topics consisting of \"Struggling with -insert class/college-, studying, how to get good grades, etc.\" Some people are resistant or oblivious to doing things different if something isn't working unfortunately.",
                  "author": null,
                  "created": 1537276797,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634056797
}