{
  "sid": "raietq",
  "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/",
  "title:": "My job is offering full ride college through a program?",
  "text": "Hello everyone! I am 31 and dropped out of college many years ago and have a chance to go back. My company works with Strayer University and completely covers all costs. Has anyone done one of these programs before? Did it actually benefit you? I’ve read mixed reviews, but my thought is it’s a free degree so why not? Any tips or advice is welcome please!",
  "author": "alien_opossum",
  "created": 1638826522,
  "updated": 1639517765,
  "over_18": false,
  "upvotes": 7,
  "upvote_ratio": 1.0,
  "comments": {
    "hnim0ne": {
      "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hnim0ne/",
      "text": "Strayer University is widely seen as a diploma mill, has one of the highest amount of student debt, has a graduation rate which is one of the lowest in the nation, and (according to a government report: https://www.help.senate.gov/imo/media/for\\_profit\\_report/PartII/Strayer.pdf) \"Strayer spent $1,329 per student on instruction in 2009, compared to $2,448 per student on marketing and $4,520 per student on profit.\" \n\nHowever, if it is free (provided it is actually FULLY free), you could always at least try it.",
      "author": "DrAlawyn",
      "created": 1638829347,
      "upvotes": 12,
      "replies": {
        "hnisgm8": {
          "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hnisgm8/",
          "text": "That doesn’t seem like a good way to invest in your students! Thank you for the information! We are finding out this week how it all works, but from what they have said so far we won’t have to pay a dime… but corporations do corporation things so we will see.",
          "author": "alien_opossum",
          "created": 1638832023,
          "upvotes": 9,
          "replies": {
            "hniue5s": {
              "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hniue5s/",
              "text": "Is it accredited? Can you get a masters with it?",
              "author": "BlueOcean7987",
              "created": 1638832851,
              "upvotes": 1,
              "replies": {
                "hnix0ys": {
                  "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hnix0ys/",
                  "text": "They are accredited and offer associate, bachelor, and master degrees",
                  "author": "alien_opossum",
                  "created": 1638833989,
                  "upvotes": 3,
                  "replies": {
                    "hnixmx1": {
                      "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hnixmx1/",
                      "text": "I mean if it’s accredited, your work acknowledges it, and it’s free it would be silly not to do it. Just be aware you might have to pay taxes on anything over 5250.",
                      "author": "BlueOcean7987",
                      "created": 1638834260,
                      "upvotes": 7,
                      "replies": {
                        "hniyth3": {
                          "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hniyth3/",
                          "text": "That’s kind of what I’m thinking too, why not? Do you mean if the tuition they pay is that much, then I pay taxes?",
                          "author": "alien_opossum",
                          "created": 1638834779,
                          "upvotes": 2,
                          "replies": {
                            "hnj45pk": {
                              "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hnj45pk/",
                              "text": "It’s taxable over limit. Anything over 5250 would be taxable at your tax rate so I’m assuming 20-25%. So if the yearly tuition your employer pays is 14k you would subtract 5250 and pay taxes on remaining. Your taxes maybe around 2-3k a year. Your employer will most likely take that from your check over a certain period. All associates and bachelors are taxable over limit. Some masters if you answer questions a certain way you don’t have to pay taxes on the benefit. For instance does this open you up for a new career? If you want the full picture about costs ask about taxes. Also school is a time commitment so factor opportunity costs. On the flip look up salaries of jobs that will be open to you if you have a degree. Look up jobs outside of company that you could get too. You might also want to ask if you have to stay at the company a certain amount of time after the degree. Although if it’s a small org you might not want to for politics.",
                              "author": "BlueOcean7987",
                              "created": 1638837189,
                              "upvotes": 2,
                              "replies": {
                                "hnlykma": {
                                  "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hnlykma/",
                                  "text": "This is a lot to think about, thank you! I won’t mind paying taxes if that’s my only expense for the whole thing. I’m not sure what I even want to get a degree in yet, but if they don’t offer me more money here for having one then I would switch companies. Thankfully there is a few years to figure that out!",
                                  "author": "alien_opossum",
                                  "created": 1638894957,
                                  "upvotes": 1,
                                  "replies": {}
                                }
                              }
                            },
                            "hnke3by": {
                              "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hnke3by/",
                              "text": "adding to the other comment, understand that those taxes are paid by *you*, so the net \"take-home\" money you get is **lower**.",
                              "author": "wobbletelescope",
                              "created": 1638859794,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hnjxe2v": {
      "link": "/r/college/comments/raietq/my_job_is_offering_full_ride_college_through_a/hnjxe2v/",
      "text": "I would take this opportunity and if you have to pay taxes I don’t think it is going to be a lot. Either way, you should consider it because they are going to pay for everything and learning is always good and specially in college bc its an experience (even tho is drag sometimes bc of school but thats part of it) plus you don’t have anything to lose. And believe me when i say this bc a situation similar to yours happened to me and it has changed my life bc i am planning going to continue my masters and is my new passion.",
      "author": "Business-Ad-6048",
      "created": 1638850055,
      "upvotes": 3,
      "replies": {}
    }
  }
}