{
  "sid": "q4r5dq",
  "link": "/r/college/comments/q4r5dq/how_am_i_suppose_to_make_friends_if_my_school_has/",
  "title:": "How am I suppose to make friends if my school has basically no clubs right now?",
  "text": "Hi, so first off I go to a commuter school, and vaccination is required, therefore about half of the student population remains online. So already the school is a ghost town. However due to this, the class sizes are horrendously small, even in auditoriums, therefore everyone spreads out from each other, no one sits near each other, and no one makes communication. Ive been trying to get myself out there by meeting new people however due to COVID everyone wants to keep their distance from each other. Plus, there’s so many tables to sit at, if I chose to sit by someone at a table, I just end up getting dirty looks because there was empty tables nearby I could have gone to and the people are probably thinking “why’s he sitting right next to me, there’s a million other empty tables nearby!” It’s the same situation for sitting in class as well. It is the 6th week of school and I have not met one person yet. Not one. Zero. And then people online or family members always tell me to join clubs, however that’s basically not happening at my school! My schools club list hasn’t been updated and it still says 2019-2020! There are no active clubs, and if there are I can’t seem to find them…. There was never a club rush or anything like that either! \n\nHow am I suppose to make friends if every single tool I could use is useless? I mean, the schools a ghost town, everyone commutes, everyone stays to themselves, no one talks to each other, I get dirty looks whenever I chose to sit near someone (probably due to COVID), class sizes are at half capacity therefore NO ONE is forced to sit next to each other, and there are no clubs going , no parties, AND my school isn’t doing any fun get togethers where students can meet each other and just hang out. I dread going. I’m a huge introvert and i never thought I would feel so sad and useless by the lack of human interaction, when I use to thrive off being alone. I’m craving interaction. I even reached out on a GroupMe chat for ALL of my classes, and not one person replied. \n\nWhat am I to do? What resources do I have left?",
  "author": "johyyy",
  "created": 1633804504,
  "updated": 1634083105,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hg0h247": {
      "link": "/r/college/comments/q4r5dq/how_am_i_suppose_to_make_friends_if_my_school_has/hg0h247/",
      "text": "Is there a student government or newspaper? Those are usually the most active clubs because they have an organization and deadline. Or try to get involved in research or something so you can meet people in your lab.",
      "author": "dobbysreward",
      "created": 1633806016,
      "upvotes": 3,
      "replies": {
        "hg0lwn4": {
          "link": "/r/college/comments/q4r5dq/how_am_i_suppose_to_make_friends_if_my_school_has/hg0lwn4/",
          "text": "I think it’s too late for student government.  Maybe I’ll try research.",
          "author": "johyyy",
          "created": 1633808168,
          "upvotes": 2,
          "replies": {
            "hg0m85j": {
              "link": "/r/college/comments/q4r5dq/how_am_i_suppose_to_make_friends_if_my_school_has/hg0m85j/",
              "text": "guarantee it isn't too late. Might be too late for elected positions but there's always \"senators\" or \"assistant to the President\" and other bullshit roles. Just go to a meeting and see how you can get involved.",
              "author": "dobbysreward",
              "created": 1633808308,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hg0wajd": {
      "link": "/r/college/comments/q4r5dq/how_am_i_suppose_to_make_friends_if_my_school_has/hg0wajd/",
      "text": "I did my studies at a small regional university\nI made friends with all my classmates as we experienced college.\n\nCollege is a hard grind but if you can get through you become qualified, and desirable.",
      "author": "Impressive-Name5129",
      "created": 1633812734,
      "upvotes": 2,
      "replies": {}
    },
    "hg0mib6": {
      "link": "/r/college/comments/q4r5dq/how_am_i_suppose_to_make_friends_if_my_school_has/hg0mib6/",
      "text": "See if anybody wants to study or do homework in your class GroupMe together and make friends that way? Also maybe there’s events going on locally or rec leagues",
      "author": "harry01772",
      "created": 1633808432,
      "upvotes": 1,
      "replies": {
        "hg0mloe": {
          "link": "/r/college/comments/q4r5dq/how_am_i_suppose_to_make_friends_if_my_school_has/hg0mloe/",
          "text": "I tried the group me thing multiple times. No one ever replied",
          "author": "johyyy",
          "created": 1633808473,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}