{
  "sid": "kyv505",
  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/",
  "title:": "My microbiology professor asked if it was okay to not wear a mask and I was too scared to speak up after my whole class immediately agreed and said it was okay.",
  "text": "So I'm not really sure what to do in this situation and would like some perspective.  \n  \nOn my first day of class this past week I had my Microbiology professor say some things I consider to be really unprofessional.  \n  \nFirst, as he begins his introduction he pauses to ask me and another student (we are seated in the front row) if it was okay if he didn't have his mask on while he was in the front of the class (which is JUST barely 6 feet away). He said he already cleared it with the Administration and as long as we were okay with it they would allow it.  \n  \nThen he goes into a spiel about how masks are pointless because they don't work; virus' are too small to be blocked by masks. When I questioned him on why would they mandate it if it didn't work he went into it about how Fauci is an idiot who was out of touch with reality and hasn't worked as a clinician since his residency many years ago.  \n  \nHe also mentioned he got COVID-19 last January though I find that odd because I don't even think they were testing for COVID-19 at that point last year in the US.  \n  \nHe then ends it with saying the only way to get over this mess that is COVID is herd immunity.  \n  \nOf course it's my fault for not speaking up right away, I just found it hard to when the whole class agreed immediately. I have a bit of social anxiety. But I do find all the things he said to be unprofessional. I know professors are human and can have opinions but I'm really put off by him asking if we would be ok with him taking his mask off.  \n  \nI'm looking for any advice on what to do in this situation or if anyone has been in a similar predicament. I'm weary of approaching I guess cause of my grades since he has control of them. Not sayin he would do anything but bias' are a real thing.  \n  \nEDIT: I'm in FL",
  "author": "lazyspectator",
  "created": 1610843153,
  "over_18": false,
  "upvotes": 1101,
  "upvote_ratio": 0.9,
  "comments": {
    "gjjrx5u": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjrx5u/",
      "text": "Locked. Advice has been given.",
      "author": "Laurasaur28",
      "created": 1610861807,
      "upvotes": 1
    },
    "gjjr0cx": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjr0cx/",
      "text": "My college has a mask mandate and distancing rule, but my environmental science professor told us a few times that we were too young to get sick from covid.",
      "author": "Adhdicted2dopamine",
      "created": 1610861201,
      "upvotes": 5,
      "replies": {}
    },
    "gjjpy4h": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjpy4h/",
      "text": "Honestly? I'd drop the class and report him. No way I'd be taking a biology class, out of all things, from someone who doesn't understand masks",
      "author": "al_the_time",
      "created": 1610860501,
      "upvotes": 4,
      "replies": {}
    },
    "gjjp3bh": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjp3bh/",
      "text": "I would just transfer to a different section with a different professor if possible. This guy sounds like a jerk and I wouldn’t want to be in his class if  I could help it.",
      "author": "QueenOfEndor21",
      "created": 1610859938,
      "upvotes": 1,
      "replies": {}
    },
    "gjjo87b": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjo87b/",
      "text": "Your professor sounds like a moron. I thought my school was being dumb about COVID but I’ve never seen a prof or administrator go without a mask. That’s also so fucked up that he teaches microbiology you do NOT need to be learning that from him. Reminds me of my roommate who’s currently COVID positive and is still going out as normal infecting the rest of the town, and she’s going to med school next year. Summary is I hate how stupid people are and if I had your professor I probably would have started throwing hands.",
      "author": "smeseal99",
      "created": 1610859375,
      "upvotes": 3,
      "replies": {}
    },
    "gjjo47a": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjo47a/",
      "text": "\"you miss 100% of the shots you don't take.\"",
      "author": "TheMcWhopper",
      "created": 1610859303,
      "upvotes": 2,
      "replies": {}
    },
    "gjjnn2b": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjnn2b/",
      "text": "Wow. \n\nReach out to your advisor or administration and talk to them about it. In your discussion, outline the following:\n\n- Explain that the nature in which the question was discussed (with great bias) did not allow for time to think about it nor did it allow for anonymity in voting\n\n- If your state requires masks then it doesn’t matter if everyone says yes or not - it’s still going against the mandate. \n\n- lastly, and perhaps most likely to get them to move on this, mention that the professor’s views on this contradict the CDC and WHO recommendations, and given that any student in the classroom could potentially contract the virus and have a potential for long term damage (emerging data supports this, even for the college aged population), it’s a liability to the school if they are not enforcing precautions",
      "author": "thetorioreo",
      "created": 1610859000,
      "upvotes": 5,
      "replies": {}
    },
    "gjjm95z": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjm95z/",
      "text": "I see you are in Florida. Insane state that allows indoor teaching and no masks. The United States is doomed.\n\nIf you can, sit in the back away from the whackjob professor.",
      "author": "dan5234",
      "created": 1610858151,
      "upvotes": 3,
      "replies": {}
    },
    "gjjlzfm": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjlzfm/",
      "text": "According to my professor with a doctorate in immunology, herd immunity refers to vaccination (so the herd is immune because most people are immune), not letting vulnerable people die. I am extremely skeptical of this professor’s credentials not just because of his treatment of COVID but also the terms he is using. Please update us with what happens!",
      "author": "moonsands",
      "created": 1610857988,
      "upvotes": 3,
      "replies": {}
    },
    "gjjlmf6": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjlmf6/",
      "text": "Can you sit a couple rows back? I understand wanting to be attentive (I’m that kid too) but sounds like that’s a hazard with this guy.",
      "author": "skrrtlord667",
      "created": 1610857775,
      "upvotes": 1,
      "replies": {}
    },
    "gjjkye8": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjkye8/",
      "text": "Well, that's why he's a professor of microbiology. This guy should head the NIA.",
      "author": "foreveryoungemokid7",
      "created": 1610857384,
      "upvotes": 2,
      "replies": {}
    },
    "gjjky96": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjky96/",
      "text": "Ditch the class and Rate My Professor that asshole",
      "author": "cev4",
      "created": 1610857382,
      "upvotes": 5,
      "replies": {}
    },
    "gjjkv2t": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjkv2t/",
      "text": "Not in my class specifically, but an E&M professor in my department (physics) had kids writing an extra credit essay about why COVID is a hoax created by 5G, and how its mass government control and suppressing American freedoms. For those of you who aren't physics majors, while you cover E&M concepts in physics II, this is typically a junior level class.\n\nInevitably, when people complained, he said that this was a paper meant to have people look for ligament information and not just take everything they see on the news as literal. Information literacy is important, but this is a 300 level physics course. I can't think of any physics majors who are openly anti-maskers or conspiracy theorists, but professors don't need to feed into that. Also, it's disrespectful to call something a hoax when students have lost family members, had it themselves, etc. \n\nThis professor has been dinged before for being openly anti-vaxx, a staunch creationist against the big bang theory, and other weird stuff. I know that COVID isn't' exactly a physics topic, but for someone who has a PhD in physics, this professor is not super STEM-literate or aware of the world.",
      "author": "quantum_complexities",
      "created": 1610857332,
      "upvotes": 3,
      "replies": {}
    },
    "gjjk92a": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjk92a/",
      "text": "Only one of my professors wears a mask. The students all do, but I didn't think anything of it until these comments.",
      "author": "PhilosophicalElk",
      "created": 1610856995,
      "upvotes": 5,
      "replies": {}
    },
    "gjjjze4": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjjze4/",
      "text": "And this is a microbio professor???? I had a microbio professor last semester and he spent the whole semester teaching us about viruses and bacteria and infections and stuff (obvi), all the while using the class material as justification for why mask wearing and social distancing is so important. What you went through is absolute bullshit.",
      "author": "keisaramus",
      "created": 1610856846,
      "upvotes": 7,
      "replies": {}
    },
    "gjjjz19": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjjz19/",
      "text": "Florida i could see it",
      "author": "Odin16596",
      "created": 1610856840,
      "upvotes": 7,
      "replies": {}
    },
    "gjjjjwi": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjjjwi/",
      "text": "Move to the back of the room and then report him.",
      "author": "rmthugger",
      "created": 1610856608,
      "upvotes": 2,
      "replies": {}
    },
    "gjjiie9": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjiie9/",
      "text": "My atmospheric science professor was a climate change denier. A Ph.D isn’t always a sign of intelligence",
      "author": "logan-8787",
      "created": 1610856029,
      "upvotes": 41,
      "replies": {}
    },
    "gjjg6ak": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjg6ak/",
      "text": "How is this guy a microbiology prof?",
      "author": "Oreo-808",
      "created": 1610854772,
      "upvotes": 15,
      "replies": {}
    },
    "gjjfqz7": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjfqz7/",
      "text": "wear your mask and you’ll be fine",
      "author": "grubbycoolo",
      "created": 1610854549,
      "upvotes": -14,
      "replies": {}
    },
    "gjjfn9q": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjfn9q/",
      "text": "Bunch of snowflakes. Withdraw. Obviously....the rest of the class is fine with it. Fuck it. Life is too short 🤣",
      "author": "tejedaj",
      "created": 1610854497,
      "upvotes": -20,
      "replies": {}
    },
    "gjjfm15": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjfm15/",
      "text": "I fucking hate people like that, just wear the piece of cloth, I work in the ER and we wear our N-95’s 12 hours a freaking day, yeah we complain but we choose to wear it, it’s the only reason why I haven’t gotten covid yet. \nAnyways, I would email the higher ups and actually make sure that he was cleared because wtf? My university asks professors to double mask and wear a face shield if they have to break the 6 foot rule",
      "author": "imarabianaff",
      "created": 1610854479,
      "upvotes": 1,
      "replies": {}
    },
    "gjjcwx8": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjcwx8/",
      "text": "Can you sit towards the back of the class? That would at least protect you, if not the other students in the front. Does your teacher have a soft voice, cause I know their are a lot of quiet people who already struggle to project to the whole class and wearing the mask just makes it worse for them. Not saying he is in the right, but I sympathize.",
      "author": "meandgoliath",
      "created": 1610853077,
      "upvotes": 5,
      "replies": {}
    },
    "gjjcb5h": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjcb5h/",
      "text": "Drop the class and file a complaint. No reason to deal with that.",
      "author": "BenjaminTW1",
      "created": 1610852743,
      "upvotes": 3,
      "replies": {}
    },
    "gjjbo2y": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjbo2y/",
      "text": "I've worked in universities for almost two decades, closely with every group -- faculty, students, senior admins, lawyers, HR... I'm 90% sure your professor did not clear this with the administration or the administration agreed to something safer that he didn't actually do. \n\nHaving known professors with a \"this rule doesn't apply to me\" attitude, my gut says it's something akin to this: he was in a department meeting recently where the head was reviewing the school's safety mandates for in-person teaching; the head says \"now, this one part about when it's okay to remove a mask is ambiguous, so I'll follow up on that, so in the meantime obviously use your best judgement\"; and your prof is now describing that as \"cleared it with the administration\".\n\nSo don't bother contacting your professor. If you're comfortable DM'ing me your school name, I can walk you through the offices you should reach out to instead. (The unit names and responsibilities vary from school to school.)\n\nI should ask since it may help others: did your prof specifically say \"administration\"? As opposed to \"administators\" (or something else). \"Administration\" means the institution's senior offices, and it would make absolutely no sense if an individual professor went to them to clear permission for himself to not wear a mask. If he said \"administrators\", that means the people who do the day-to-day work of departments and absolutely would not be ones deciding on when it's okay to wear a mask. Lastly, if he had perhaps phrased it as, \"The administration cleared it for us to do this,\" there will be a stated policy somewhere. I'd that's what he said, I'm happy to help you find that policy.",
      "author": "dcgrey",
      "created": 1610852382,
      "upvotes": 165,
      "replies": {
        "gjjexke": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjexke/",
          "text": "Thank you for the advice and offer. He specifically said 'administration' which I found very ambiguous. It just really seems like he doesn't want to wear it...this is for a lab class which specifically prohibits drinks/food and he had his drink with him the whole lab (actively drinking from it) so I just get the feeling he's close to retirement or just doesn't care.",
          "author": "lazyspectator",
          "created": 1610854148,
          "upvotes": 85,
          "replies": {
            "gjjjr3t": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjjr3t/",
              "text": "Biologists often have a mindset of “when I’m working with anything really dangerous I’ll follow the rules” because there aren’t a ton of genuinely dangerous things in a bio safety level 1 lab, but that doesn’t mean you can openly float the rules in a Lab course. I would definitely message the person you replied to in this threat and ask for their guidance in contacting the appropriate personnel",
              "author": "samskyyy",
              "created": 1610856720,
              "upvotes": 48,
              "replies": {}
            }
          }
        }
      }
    },
    "gjjb3e7": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjb3e7/",
      "text": "it's less about the masks and more about how he's supposed to be a science teacher... and a microbio teacher at that and he believes all that crazy nonsense. If it were any other subject. I would still be annoyed but not worried since it doesn't really relate to the subject you're learning about. But... having a science teacher act this way towards COVID is worrying, to say the least. Also, I'm not sure about your school's covid rules but mine has a small fine for students not wearing masks. Go look at your school's covid rules if it has anything similar tell him and that if he acts up again, you'll report him. I would even talk to another science teacher you may know and express your concern. This isn't how he should be acting almost a year into a global health pandemic.",
      "author": "extrasmallbillie",
      "created": 1610852055,
      "upvotes": 30,
      "replies": {}
    },
    "gjjb1yl": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjb1yl/",
      "text": "My microbiology teacher was a creationist who excelled in her field of cancer research. You do not owe fealty to an instructor.  They are flawed humans as we all are.",
      "author": "Hedgehogz_Mom",
      "created": 1610852033,
      "upvotes": 7,
      "replies": {}
    },
    "gjjavdy": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjavdy/",
      "text": "Could just start coughing a lot.",
      "author": null,
      "created": 1610851930,
      "upvotes": 3,
      "replies": {}
    },
    "gjja5vd": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjja5vd/",
      "text": "You should email the dean to report him for not wearing a mask and risking his students lives. You would think as a science major he would know how dangerous covid is 😬",
      "author": "Worth_Disaster2813",
      "created": 1610851541,
      "upvotes": 3,
      "replies": {}
    },
    "gjj9q6l": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9q6l/",
      "text": "[removed]",
      "author": null,
      "created": 1610851298,
      "upvotes": -18,
      "replies": {
        "gk26zzu": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gk26zzu/",
          "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #4: Don't be an asshole.  \r\n\r\nAnything threatening or harassing is immediately removed and often results in a ban. That includes slurs against oppressed or disadvantaged people of any stripe.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
          "author": "VA_Network_Nerd",
          "created": 1611237480,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gjj9p2i": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9p2i/",
      "text": "masks do not prevent covid from spread it reduces the odds",
      "author": "deathworld123",
      "created": 1610851281,
      "upvotes": -12,
      "replies": {}
    },
    "gjj972d": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj972d/",
      "text": "Just saying NY and Cali have way more covid cases than FL and TX.. guess which one has the tighter restrictions?",
      "author": "spliffgang",
      "created": 1610851014,
      "upvotes": -14,
      "replies": {}
    },
    "gjj962b": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj962b/",
      "text": "I support the professor",
      "author": "sharpwaffle",
      "created": 1610851000,
      "upvotes": -21,
      "replies": {}
    },
    "gjj8ute": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj8ute/",
      "text": "He's a nutcase. Run. This will be a miserable semester for you if you stay in his class. Drop it. Delay it. Anything. The university's admin are morons too if they allow professors to unmask \"if they ask.\"",
      "author": null,
      "created": 1610850831,
      "upvotes": 3,
      "replies": {}
    },
    "gjj7z07": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj7z07/",
      "text": "Bruh",
      "author": "toolshed_abandoned",
      "created": 1610850352,
      "upvotes": 11,
      "replies": {}
    },
    "gjj7rqh": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj7rqh/",
      "text": "Isn’t your school offering remote instruction? I am not entirely sure how on earth can a lecture with loads of ppl gathered in one confined space not causing any problem. \n\nHere in Southern California (esp. in my  school), all classes are remote, and the campus is like a ghost town. I don’t consider it to be anything good, but these efforts are necessary and inevitable IMO.",
      "author": "Typical_Resource_340",
      "created": 1610850240,
      "upvotes": 8,
      "replies": {
        "gjjc64i": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjc64i/",
          "text": "FL has got some crazy people running it right now, I'm afraid.",
          "author": "Gavindorf",
          "created": 1610852666,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "gjj78cc": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj78cc/",
      "text": "I could understand if the professor was maybe literally any other subject but... Microbio? He should have his credentials taken away holy shit.",
      "author": "redemptionsoath",
      "created": 1610849957,
      "upvotes": 26,
      "replies": {}
    },
    "gjj6uig": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj6uig/",
      "text": "Email him anonymously telling him that you're uncomfortable with him not wearing a mask, but you were uncomfortable saying that in front of everyone.",
      "author": "temsik1587againtwo",
      "created": 1610849755,
      "upvotes": 4,
      "replies": {}
    },
    "gjj5ahp": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj5ahp/",
      "text": "Pretty sure he would have tried to humiliate you in front of the class if you called him out on it. Don’t be scared though, have the courage to follow through even with stuff like following the herd/mob mentality/everyone else saying it’s ok. I know it’s hard sometimes to speak up but you gotta do it sometimes. I recently had a similar run in with a Karen about a different ethical issue and I debated calling her out on it as I knew it would escalate. I called her out on it(she called cops but idgaf and lied and tried to overdramatize while making a scene). If necessary go annoymous and report but have the courage to call out people who violate your moral code, stand up for yourself even if no one else will",
      "author": "Lifedeather",
      "created": 1610848939,
      "upvotes": 28,
      "replies": {
        "gjjfylg": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjfylg/",
          "text": "This, OP. It's typically only scary to stand up for your beliefs the first time you do it AND you might embolden others in the class who agree with you to speak up as well (this also holds true for questions. You might feel stupid for asking, but there are most likely others who want to know too).\n\nPlus! It's January, so add/drop is probably still an option if he makes you feel uncomfy for saying something, but check first, of course.\n\nI would also recommend downloading a record app on your phone and just hit record right before saying something  (provided that's allowed in your school/state) this could help make sure you have proof of your 1) perfectly reasonable and polite request that he wear a mask and 2) proof of any pushback, especially if there's harsh treatment involved in that pushback. And if there is, you can show this to the head of the department and say \"listen, I was polite, I was reasonable, and this is how he responded.\" \n\nAsk yourself \"Should this be my problem?Whose problem should it be?\" Make it their problem.\n\nNinja edit: I would also like to point out here that *one* of the reasons wealthier students tend to do better in University is because they're better at self-advocating. Learn this skill, it's SO rewarding.",
          "author": "SomeBroadYouDontKnow",
          "created": 1610854657,
          "upvotes": 13,
          "replies": {}
        }
      }
    },
    "gjj4xln": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj4xln/",
      "text": "Talk to whoever is head of the department or just send him an email.",
      "author": "andredude2008",
      "created": 1610848748,
      "upvotes": 2,
      "replies": {}
    },
    "gjj4wj5": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj4wj5/",
      "text": "If you feel uncomfortable with it, just let him know. He’ll likely accommodate your concerns. I’m seeing a lot of people getting really upset and borderline calling this professor evil. He’s not evil. He’s opinionated, and you can disagree with him on the subject, but I think reporting or pursuing punishment before talking to your professor is the wrong way to go.",
      "author": "McChickenFingers",
      "created": 1610848731,
      "upvotes": 7,
      "replies": {}
    },
    "gjj4dmn": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj4dmn/",
      "text": "I’ll avoid arguing about all of the other things since it seems covered.\n\nYou need to be an adult and speak up. If you’re uncomfortable with something say you’re uncomfortable with it. or email them or whoever is above them as was suggested. \n\nIt’s a very important lesson and skill to learn for the rest of your life, college is a great time to learn and grow and establishing boundaries with superiors is a very valuable skill that will benefit you greatly.",
      "author": "Satan_and_Communism",
      "created": 1610848450,
      "upvotes": 6,
      "replies": {}
    },
    "gjj46tg": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj46tg/",
      "text": "Prof here.  His actions are NOT okay.",
      "author": "catscience247",
      "created": 1610848351,
      "upvotes": 49,
      "replies": {
        "gjj7792": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj7792/",
          "text": "Answer see above",
          "author": null,
          "created": 1610849941,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "gjj3ydg": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3ydg/",
      "text": "This professor sounds nuts. Any decent, objective microbiologist would understand that SARS-CoV-2 doesn’t travel through the air by itself, but rather, on tiny spit droplets that we always let out when we breathe/talk, which *can’t* pass through masks very easily.\n\n[This picture](https://science.sciencemag.org/content/sci/368/6498/1422/F1.large.jpg?width=800&height=600&carousel=1) from a [Science article](https://science.sciencemag.org/content/368/6498/1422.full) describes how it works pretty well.\n\nIf your professor is so against masks that they’d ignore science that they *should* know to support their rhetoric, I’d try to get out of that class and switch to a different professor, if you can. This professor doesn’t seem to be the most trustworthy source of information.",
      "author": "Atrapper",
      "created": 1610848226,
      "upvotes": 16,
      "replies": {}
    },
    "gjj3sz9": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3sz9/",
      "text": "I- goddamit\n\nI’m a microbio major and to respond to your professor....while it is pretty obvious that viruses are fucking tiny and yes, they can pass through the mask, the reason why it is implemented to wear them is to prevent the saliva aerosols that CONTAINS the viruses from entering our system. It increases the chance of you not getting covid. It doesn’t mean it’s 100% foolproof but that don’t make it pointless...ahhh and yes. Herd immunity. Tell him it’ll be a long time before we can achieve herd. Fucking. immunity considering anti-maskers often are also antivaxers\n\n\nSo while your professor not wanting to wear them is one thing but to tell his students that masks are useless is fucking ridiculous & to say that Fauci doesn’t know any better is even more ridiculous. How old is he? What is even going on in that class/ that school? Why is there in-person lecture? If the class is not required you can switched out. If it is. Avoid sitting in the front and  remind yourself that his lectures from now on should be taken with a grain of salt",
      "author": "BadNad",
      "created": 1610848143,
      "upvotes": 98,
      "replies": {
        "gjjb9i1": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjb9i1/",
          "text": "They shouldn’t say a damn thing to him because he’s obviously into partisan politics if he thinks like this despite being a freaking microbio professor and OP will be targeted by their professor and probably classmates too if they say anything. Unfortunately.",
          "author": "zipfour",
          "created": 1610852151,
          "upvotes": 28,
          "replies": {
            "gjjo8ij": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjo8ij/",
              "text": "Nah ur right- i was pissed when I wrote that so hoping OP would not respond at all since that prof is too far gone",
              "author": "BadNad",
              "created": 1610859380,
              "upvotes": 11,
              "replies": {}
            }
          }
        }
      }
    },
    "gjj3sgw": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3sgw/",
      "text": "please please please report him to the chair of the department.\n\nIt’s not just the not wearing a mask and putting y’all in danger, it’s the spewing politically-motivated pseudoscience as a microbiology professor. Report him.",
      "author": "esk12",
      "created": 1610848135,
      "upvotes": 40,
      "replies": {
        "gjj64py": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj64py/",
          "text": "[removed]",
          "author": null,
          "created": 1610849377,
          "upvotes": -17,
          "replies": {
            "gjj9lb0": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9lb0/",
              "text": "I’m sorry, but are we talking about third grade? It’s nice to think critically before posting",
              "author": "pokemonareugly",
              "created": 1610851225,
              "upvotes": 7,
              "replies": {
                "gjjenvn": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjenvn/",
                  "text": "I had pointed out some blinding hypocrisy about political motivation in the classroom. It shouldn't be condoned either way. There was no lack of critical thinking on my part. If you have an intelligent reply to what I said then let me hear it. An insult isn't a good point.",
                  "author": "BIG_IDEA",
                  "created": 1610854009,
                  "upvotes": -1,
                  "replies": {
                    "gjjeyad": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjeyad/",
                      "text": "Yes except nowhere did we mention deconstructing privilege in third grade, or our opinions for or against it. It’s extremely disingenuous and whataboutism",
                      "author": "pokemonareugly",
                      "created": 1610854158,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gjj7fml": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj7fml/",
              "text": "Ones killing people and ones culturally based? Fuck off",
              "author": "TheNorthernQueen",
              "created": 1610850063,
              "upvotes": 4,
              "replies": {}
            },
            "gjj9um8": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9um8/",
              "text": "Ur ppl just violently attacked the US Capitol in an attempt to murder the Vice President and overturn election results last week. Ur grounded from these convos for a while",
              "author": "esk12",
              "created": 1610851366,
              "upvotes": 2,
              "replies": {
                "gjjcw3v": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjcw3v/",
                  "text": "What do you mean by my people? That's not my people.. What are you even trying to say? That I'm not allowed to speak on important topics because of what some other people did in a completely unrelated event?",
                  "author": "BIG_IDEA",
                  "created": 1610853065,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gjj3qla": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3qla/",
      "text": "AHHHHH, Florida.",
      "author": "symmetrical_kettle",
      "created": 1610848107,
      "upvotes": 13,
      "replies": {}
    },
    "gjj3q0c": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3q0c/",
      "text": "Tell your dean",
      "author": "davidc5494",
      "created": 1610848098,
      "upvotes": 7,
      "replies": {}
    },
    "gjj3lko": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3lko/",
      "text": "If he is talking, he is spewing droplets all throughout the air.\n\nNo, the mask will not 100% prevent it, but it will minimize it greatly.",
      "author": "982140747",
      "created": 1610848032,
      "upvotes": 759,
      "replies": {
        "gjj6k0r": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj6k0r/",
          "text": "How can you even understand that without being a professor? Droplets are so complex. It's not like we have been covering our coughs since age 5 for this very reason.",
          "author": null,
          "created": 1610849599,
          "upvotes": 285,
          "replies": {
            "gjjgk08": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjgk08/",
              "text": "Coming from a microbio professor out of all people",
              "author": "Prit717",
              "created": 1610854979,
              "upvotes": 141,
              "replies": {
                "gjjibr8": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjibr8/",
                  "text": "It's kind of hard to believe, but so was Jan 6.",
                  "author": null,
                  "created": 1610855928,
                  "upvotes": 62,
                  "replies": {}
                }
              }
            }
          }
        },
        "gjjoz6f": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjoz6f/",
          "text": "And bull shit to.",
          "author": "ampjk",
          "created": 1610859861,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "gjj2kbo": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj2kbo/",
      "text": "Not saying I agree with him at all because I don’t but some people got sick before the US started testing for COVID but you can tell if you had it through blood tests. I think there’s certain antibodies you can still see on these tests and it tells you if you’ve had it before",
      "author": "gotthatsushi",
      "created": 1610847497,
      "upvotes": -9,
      "replies": {}
    },
    "gjj2174": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj2174/",
      "text": "Is it possible to meet with him one on one to discuss this? Or just out of the way from the rest of the class? You shouldn't be uncomfortable in class, espeically in that case. I'm also in FL and have a professor like that, so I sit all the way in the back of class. I also have social anxiety, so I understand where you're coming from. I believe in you!",
      "author": "lettucezucchinisalad",
      "created": 1610847214,
      "upvotes": 5,
      "replies": {
        "gjj3hao": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3hao/",
          "text": "I appreciate the encouragement. Someone suggested to call in anonymous and just request he wear the mask which I think is the path I'll take. Good luck with your class, I hope it gets better.",
          "author": "lazyspectator",
          "created": 1610847969,
          "upvotes": 12,
          "replies": {}
        }
      }
    },
    "gjj1yqd": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1yqd/",
      "text": "If your goal is to have him wear a mask you could call whoever he cleared it with to say you weren't able to speak up do to anxiety but that you aren't comfortable with the prof being maskless while lecturing. You don't have to give your info or even which class exactly you are taking, just that you have a class with that prof and you want to see the mandate followed.",
      "author": "okThisYear",
      "created": 1610847176,
      "upvotes": 523,
      "replies": {
        "gjj2q6u": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj2q6u/",
          "text": "Wow I like this idea. I really do want to remain anonymous and I just want him to wear the mask. Thank you for the suggestion. It never occurred to me to call in for some reason.",
          "author": "lazyspectator",
          "created": 1610847579,
          "upvotes": 285,
          "replies": {
            "gjj8q52": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj8q52/",
              "text": "Definitely try to stay anonymous, unless you can maybe switch to a different session of microbiology with another professor. If that doesn't work, maybe move to the middle/back of the classroom/lecture hall and keep your mask on at all times?\n\nAlso, I'd definitely not want to learn microbiology from that professor (unless I had no other option). I wouldn't know what parts to trust and whether something is a fact or if he is injecting his trash personal opinions into it.",
              "author": "Apoptosed-BrainCells",
              "created": 1610850759,
              "upvotes": 126,
              "replies": {}
            },
            "gjjfwl7": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjfwl7/",
              "text": "Idk.  He might be able to peg you as the one who informed the administrator.  You did ask him why if they didn’t work were they mandated.  Unless there were other students that voiced a concern it seems like he could fairly assume it was you.  Anyway good luck.",
              "author": "stan_darce",
              "created": 1610854629,
              "upvotes": 25,
              "replies": {}
            },
            "gjj4ioh": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj4ioh/",
              "text": "Hope it goes over smooth!",
              "author": "okThisYear",
              "created": 1610848526,
              "upvotes": 14,
              "replies": {}
            }
          }
        },
        "gjj56ph": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj56ph/",
          "text": "[deleted]",
          "author": null,
          "created": 1610848884,
          "upvotes": -2,
          "replies": {
            "gjj598c": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj598c/",
              "text": "I don't care what you like or don't like, plague rat",
              "author": "okThisYear",
              "created": 1610848921,
              "upvotes": 6,
              "replies": {
                "gjjr40n": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjr40n/",
                  "text": "What is a “plague rat”?",
                  "author": "PasswordLogger",
                  "created": 1610861267,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gjj1qxi": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1qxi/",
      "text": "Wow this subreddit is filled with idiots. You’d think after a year of coronavirus, they’d realize things. This is precisely the reason covid won’t go away ever and we’re all gonna miss our college experience. It’s a piece of fabric. I wish people would stop crying about it and just put it on.",
      "author": "microfsxpilot",
      "created": 1610847060,
      "upvotes": 355,
      "replies": {
        "gjjl78r": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjl78r/",
          "text": "So you'd rather everyone wear a mask forever? No thanks.",
          "author": "foreveryoungemokid7",
          "created": 1610857527,
          "upvotes": -86,
          "replies": {
            "gjjlhaf": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjlhaf/",
              "text": "Wear a mask until we can establish herd immunity through the vaccine. As long as Biden doesn’t screw up and most the country isn’t selfish, this’ll be done with by the fall. \n\nElse, we’ll be dealing with mask mandates and closures for the rest of the decade. Idk about you but I’d rather just miss out one more year of my college experience than the entirety of it because some frat boys have no control.",
              "author": "microfsxpilot",
              "created": 1610857691,
              "upvotes": 41,
              "replies": {
                "gjjm7ns": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjm7ns/",
                  "text": "What do you think Biden will do? He has no legal authority to mandate masks or lockdowns. Both of those matters are up to the states. The best Biden can do is mandate masks on federal property and speed up vaccine distribution. And how do you know that they still won't force masks even at herd immunity level? What will the reasoning be then? You can't honestly think that they're not going to at least try to keep us in masks.",
                  "author": "foreveryoungemokid7",
                  "created": 1610858126,
                  "upvotes": -37,
                  "replies": {
                    "gjjpm0u": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjpm0u/",
                      "text": "... what benefit do they get out of forcing people to wear masks? Who is \"they\"? Big mask? The cabal? Come on man, exercise some critical thinking.",
                      "author": "Wildcatter93",
                      "created": 1610860276,
                      "upvotes": 31,
                      "replies": {
                        "gjjq44w": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjq44w/",
                          "text": "Apparently they gain the benefit of “control”. Guess these people have never heard of speed limits, seatbelt laws, traffic enforcements and tickets.",
                          "author": "microfsxpilot",
                          "created": 1610860611,
                          "upvotes": 23,
                          "replies": {}
                        },
                        "gjjqwb8": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjqwb8/",
                          "text": "The \"they\" is the elites, the politicians, the big people, not necessarily the cabal, but the ruling elites, soros, fauci, the WHO, celebrities, business CEOs, media executives, the people at the top.  And what benefit do they get? I'll lay it out. It's one of two things: 1: Masks cover the whole face up past the nose. That obviously includes the mouth. It's their way of asserting dominance over us and telling us to \"shut up and comply.\" \n2: They want to take away our humanity because once someone's lost their humanity, you can get them to do anything. Masks take away the expressions we make with our faces. Severe lockdowns keep most people home and away from physical interaction. Social distancing makes it sound like you have to stand apart and ignore and not even acknowledge each other. They want to break us and re-mold us into something with no humanity. Because then, we'll do whatever they want, without question. We'll kill, we'll lie, cheat, steal, anything, without a second thought. We'll be used for whatever they wanna use us for. \n\nThere's your requested critical thinking.",
                          "author": "foreveryoungemokid7",
                          "created": 1610861127,
                          "upvotes": -37,
                          "replies": {}
                        }
                      }
                    },
                    "gjjnre2": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjnre2/",
                      "text": "I think the people in charge of whatever know how much most people resent masks considering how many people refuse to wear that. I see Biden helping the situation by leading by example and telling people that COVID is NOT a hoax. And vaccine distribution which has definitely been hindered by an inefficient system. I don’t think “they” will try to keep us in masks, but we may have to wear them longer than we like. It will probably be personal choice by the end of the year in most states. There are ways for the federal government to incentivize states to do what it wants though so maybe that will happen in order to get more restrictions in place. But who tf knows, the situation is fluid and still unprecedented.",
                      "author": "smeseal99",
                      "created": 1610859076,
                      "upvotes": 7,
                      "replies": {
                        "gjjo1uh": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjo1uh/",
                          "text": "Yeah. \"Incentivize\" in other words threaten to withhold funding and other stuff to force states to do what they want. Sounds like a dictator move to me. This country is fucked.",
                          "author": "foreveryoungemokid7",
                          "created": 1610859260,
                          "upvotes": -7,
                          "replies": {
                            "gjjon3i": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjon3i/",
                              "text": "I don’t think the Biden administration will do that unless things get really dire, but it’s a possibility.  That incentivization happens though in every presidency, for small stuff usually. I do think his administration will help the situation more than Trump’s has. But yes, America is fucked, I won’t argue with that",
                              "author": "smeseal99",
                              "created": 1610859641,
                              "upvotes": 7,
                              "replies": {
                                "gjjos9i": {
                                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjos9i/",
                                  "text": "Glad we can talk and agree on something🤝",
                                  "author": "foreveryoungemokid7",
                                  "created": 1610859735,
                                  "upvotes": -1,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gjjncap": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjncap/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1610858814,
                      "upvotes": 8,
                      "replies": {
                        "gjjnhz4": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjnhz4/",
                          "text": "Unless it is regarding federal property, he does not have the power to force people to wear masks. That is up to the states.",
                          "author": "foreveryoungemokid7",
                          "created": 1610858911,
                          "upvotes": -7,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "gjjlzqw": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjlzqw/",
              "text": "If everyone wore a mask and followed guidelines we wouldn’t be wearing masks forever. Thanks!",
              "author": "bobabeeb",
              "created": 1610857993,
              "upvotes": 24,
              "replies": {}
            },
            "gjjm8av": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjm8av/",
              "text": "YUP.",
              "author": null,
              "created": 1610858137,
              "upvotes": 10,
              "replies": {
                "gjjmdr5": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjmdr5/",
                  "text": "Hmm. How fascist of you. Then again, that's what progressivism is in disguise so really not that surprising.",
                  "author": "foreveryoungemokid7",
                  "created": 1610858225,
                  "upvotes": -13,
                  "replies": {
                    "gjjmxb8": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjmxb8/",
                      "text": "Fascism? Hhmmm I don't see someone having to wear a mask in public, indoor spaces to protect the community from a virus that could possibly kill you OR handicap you for the rest of your life as fascism.",
                      "author": null,
                      "created": 1610858555,
                      "upvotes": 15,
                      "replies": {
                        "gjjnazr": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjnazr/",
                          "text": "Exactly why it's been so easy for them to gain control. People don't see it. None of this has been about \"public health\" it has all been about control. And they'll use that control until they're done with their power trip. Wake up.",
                          "author": "foreveryoungemokid7",
                          "created": 1610858791,
                          "upvotes": -9,
                          "replies": {
                            "gjjnff5": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjnff5/",
                              "text": "L O L k.",
                              "author": null,
                              "created": 1610858867,
                              "upvotes": 14,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gjje9gx": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjje9gx/",
          "text": "[deleted]",
          "author": null,
          "created": 1610853813,
          "upvotes": -100,
          "replies": {
            "gjjertv": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjertv/",
              "text": "Vaccine and masks are the only scientifically proven method to control this virus. We can’t eradicate it at this point but it’s out of control. I live in Michigan and our governor has done the best she could to control this virus. Last I checked, we’re 42nd in the nation in terms of covid cases/1,000,000 people. \n\nAnti-vaxxers and anti-maskers will be the reason we still have to deal with this virus a decade from now. This is the ONLY known way to achieve herd immunity.",
              "author": "microfsxpilot",
              "created": 1610854065,
              "upvotes": 60,
              "replies": {
                "gjjf4jp": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjf4jp/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1610854246,
                  "upvotes": -71,
                  "replies": {
                    "gjji0ji": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjji0ji/",
                      "text": "Many other nations around the world are effectively combating the pandemic, ofc they’re not eradicating it. That’s not the idea, the idea is to sit your ass down, wear a fucking cloth, wait for the needle, and then we’ll stop dying by the fucking thousands",
                      "author": "Sfn_y",
                      "created": 1610855756,
                      "upvotes": 26,
                      "replies": {}
                    },
                    "gjjngmu": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjngmu/",
                      "text": "It works in other societies. It works when the leadership of the country isn’t deliberately and enthusiastically combating scientifically derived advice for prevention. We’re in a fucked up situation because of disinformation. This clusterfuck was crafted.",
                      "author": "brightwhys",
                      "created": 1610858888,
                      "upvotes": 19,
                      "replies": {}
                    },
                    "gjjg7cg": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjg7cg/",
                      "text": "It's scientifically proven to stop droplet transmission. Sure maybe some parts of society aren't going to follow the mask mandate but it's better than just doing nothing and hoping we don't die. If some people still commit DUIs should we just let everyone drive drunk? Because it's a bad idea since it hasn't worked and people still commit DUIs??\n\nThe mask mandate was never to eradicate COVID, but just to control the spread. States having the virus after mask mandates mean absolutely nothing - being free of covid won't happen that fast. You said it yourself - some other viruses have taken decades",
                      "author": "RandomMan0880",
                      "created": 1610854787,
                      "upvotes": 53,
                      "replies": {
                        "gjjglk3": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjglk3/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1610855002,
                          "upvotes": -54,
                          "replies": {
                            "gjjjzho": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjjzho/",
                              "text": "I would like to see a source that supports your claim that “plenty of masks commonly used have no effect”. \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC7301882/\n> We show that the use of masks will reduce the airborne droplet transmission and will also protect the wearer from the droplets expelled from other subjects. However, many droplets still spread around and away from the cover, cumulatively, during cough cycles. Therefore, the use of a mask does not provide complete protection, and social distancing remains important during a pandemic. \n\nMasks **do** reduce the transmission factor, but it needs to be used in conjunction with social distancing to have a greater effect in reducing transmission rates.\n\nIf you’re not into reading scientific papers, https://www.cdc.gov/coronavirus/2019-ncov/more/masking-science-sars-cov2.html\n\nThis is **presumably** from your own government’s CDC.\n\nSome other papers: \nhttps://www.sciencedirect.com/science/article/pii/S0048969720330278\n\nhttps://advances.sciencemag.org/content/6/36/eabd3083 (All types of **commonly used** masks reduce droplet transmission to a certain extent, except neck gaiters)\n\nGoogle for details on how some countries are keeping COVID under control - Masks and social distancing. It works. \n\nEDIT: Seems like you’re a premed student who doesn’t know how to do simple research for scientific papers that prove the exact opposite of your beliefs. A doctor that doesn’t believe in the efficacy of masks? Wow.",
                              "author": "ZeroPauper",
                              "created": 1610856847,
                              "upvotes": 26,
                              "replies": {}
                            },
                            "gjjhqfv": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjhqfv/",
                              "text": "Dude. If you're denying the consensus of scientists and society, provide evidence. Otherwise, shut up. If you're right, surely you can provide a journal article showing the ineffectiveness of masks. This is a COLLEGE subreddit. Folks here should know how to do basic research.",
                              "author": "aridan9",
                              "created": 1610855605,
                              "upvotes": 48,
                              "replies": {
                                "gjjlc9q": {
                                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjlc9q/",
                                  "text": "It makes it worse that this guy is a “premed student”. A future doctor that doesn’t believe in the efficacy of masks.. wow",
                                  "author": "ZeroPauper",
                                  "created": 1610857609,
                                  "upvotes": 31,
                                  "replies": {
                                    "gjjppoy": {
                                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjppoy/",
                                      "text": "Bruh he said premed student lmaoooo \nThat really doesn’t mean shit lol",
                                      "author": "Sfn_y",
                                      "created": 1610860344,
                                      "upvotes": 20,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            },
                            "gjjhslg": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjhslg/",
                              "text": "There's multiple peer-reviewed studies that masks have been correlated to a decrease in covid cases: https://www.healthaffairs.org/doi/10.1377/hlthaff.2020.00818\n\nEven if cloth masks are comparatively less useful that does not mean they are useless:\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC7191274/\n\nI'm confused as to how you might simultaneously manage to \"think\" a \"statistically reasonable\" conclusion about the entire country/world out of nowhere and yet deny the results of published research \n\nBesides, if we slow the spread, we buy more time to decrease the area of the curve. Less cases per day means that more medical care is available to individual patients which leads to better survival rates",
                              "author": "RandomMan0880",
                              "created": 1610855636,
                              "upvotes": 35,
                              "replies": {}
                            },
                            "gjjk07l": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjk07l/",
                              "text": "Controlling the spread does matter even if the area under the curve remains the same mainly because of hospital capacity. ICUs have a limited number of beds, and if more people are being infected than the hospitals in the area can keep up with, then people who may have survived the virus may not simply because too many people were infect at once. Where I live there are no available ICU bed at the moment, because infection rates have gone up recently, and the hospitals simply cannot keep up with it.",
                              "author": "uhidk17",
                              "created": 1610856859,
                              "upvotes": 16,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "gjjj6lb": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjj6lb/",
                      "text": "The vaccine is the only thing that can effectively reduce transmission more than 90%. Masks I believe the stat was 60% effective? No mask is 0% effective. And yes, you’re right. It SHOULD’VE worked by now in an ideal world where everyone wore their masks. Unfortunately no one wears their masks 100% of the time they have to. I admit even I don’t when I’m around friends. No ones perfect but as long as people try their best and comply, it’ll work the best it can. Some mask is better than no mask.",
                      "author": "microfsxpilot",
                      "created": 1610856402,
                      "upvotes": 12,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gjjrsno": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjrsno/",
          "text": "So what about the people that literally struggle to breath with a mask on? I have moments, even when massless, where I feel like I am suffocating. I was in the grocery store the other day and I had to take a moment, take the mask off, and focus on breathing just so I could feel like I wasn’t dying. But oh no, the second I take my mask off there always has to be the mask police that think it’s okay to tell me to put my mask on. If you’re scared of COVID then stay home. I take my mask off because there are times where I feel like I am suffocating. If me having my mask off scares you then get your groceries delivered",
          "author": "PasswordLogger",
          "created": 1610861724,
          "upvotes": -80,
          "replies": {}
        }
      }
    },
    "gjj16ce": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj16ce/",
      "text": "Your professor is right. Little cotton masks are absolutely shit and won’t do shit to protect you or anyone else.",
      "author": "GetYourselfAHapa",
      "created": 1610846765,
      "upvotes": -71,
      "replies": {
        "gjj3hsu": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3hsu/",
          "text": "Do you have an academic study or paper that supports this?\n\nHere’s a paper from the International Journal of Nursing Studies in the NCBI database:\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC7191274/\n\n> In the community, masks appeared to be effective with and without hand hygiene, and both together are more protective.\n\nOr how about a study published in Health Affairs?\n\nhttps://www.healthaffairs.org/doi/10.1377/hlthaff.2020.00818\n\n> [Exhibit 1](https://www.healthaffairs.org/cms/10.1377/hlthaff.2020.00818/asset/images/medium/figureex1.gif) plots the event study estimates of effects of state mandates for community face covering in public on the county-level daily growth rate of COVID-19 cases, with 95 percent confidence intervals, obtained from the main regression model (in appendix B) using county-level daily data from March 31 through May22; appendix exhibit C1 (column 1) reports the exact estimates.\n\n> The study provides evidence that US states mandating the use of face masks in public had a greater decline in daily COVID-19 growth rates after issuing these mandates compared with states that did not issue mandates. These effects were observed conditional on other existing social distancing measures and were independent of the CDC recommendation to wear face covers issued April 3, 2020. \n\nThese are literally the first two results that appear when searching “academic paper masks” on Google. All of the evidence suggests that masks are effective in preventing the spread of airborne diseases like COVID-19 in asymptomatic individuals.",
          "author": "Atrapper",
          "created": 1610847976,
          "upvotes": 28,
          "replies": {
            "gjj61x2": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj61x2/",
              "text": "https://www.reuters.com/article/us-health-coronavirus-facemasks/danish-study-finds-face-masks-provide-limited-protection-to-wearer-idUSKBN27Y1YW\n\nThe evidence suggests that anything less than an N-95 doesn’t significantly protect you. Unfortunately, this is the only study I’ve seen done about the real life, messy, real effectiveness on cloth masks, but i don’t think the benefits they bring from everybody wearing them justify the societal costs. I say wear a cloth mask if you’re symptomatic, but otherwise it’s better to just go maskless. N-95’s are pretty good if you’re really concerned and still want to wear something.",
              "author": "McChickenFingers",
              "created": 1610849339,
              "upvotes": -18,
              "replies": {
                "gjjcfz8": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjcfz8/",
                  "text": "While I’d have to read the original study, rather than the article written about it, to get a full idea of what’s going on here, this paragraph seems to give an explanation:\n\n> The findings are consistent with previous research. Health experts have long said a mask provides only limited protection for the person wearing it, but can dramatically reduce the risk to others if the wearer is infected, even when showing no symptoms. Preventing the spread to others is known as source control.\n\nBased on this paragraph from the article, I’m assuming the study examined individuals wearing masks and going about their daily lives, then checking to see if they contracted the disease.\n\nWearing masks has been shown to make the person wearing it transmit SARS-CoV-2 less, but only protect people wearing masks from getting COVID-19 to a certain degree. The Dutch study that the Reuters article discusses actually mentions this:\n\n> “The study does not confirm the expected halving of the risk of infection for people wearing face masks,” it said. “The results could indicate a more moderate degree of protection of 15-20%, however, the study could not rule out that face masks do not provide any protection.”\n\nIn other words, the study suggests that while it’s possible that wearing a mask doesn’t lower your chance of contracting COVID-19, it’s more likely that it does and that we just overestimated how effective it is in this regard.\n\nBesides, what kind of “societal costs” are there? It’s just a piece of cotton over your face. It doesn’t infringe upon liberties, if we go by Abraham Lincoln’s take on liberties:\n\n> My right to swing my fist ends where your nose begins.\n\nWhile I can’t find the date on the quote to see if it predates the following idea, John Stuart Mills published *On Liberty* in 1859 (around the time of Lincoln’s presidency) where he wrote about that idea, calling it the Harm Principle. Mills argues:\n\n> The only purpose for which power can be rightfully exercised over any member of a civilized community, against his will, is to prevent harm to others.\n\nIn essence, your liberties don’t encompass things that adversely affect others. Not wearing a mask could potentially cause you to unknowingly spread COVID-19 to someone else, meaning that it’s not a liberty to not wear a mask, but instead, a disservice to others around you.",
                  "author": "Atrapper",
                  "created": 1610852818,
                  "upvotes": 22,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gjj1397": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1397/",
      "text": "Hey man. This is a big deal and especially with Microbio? I would definitely email the dean of STEM at your school or even the Dean as a whole. You don't include where you are or where your college is, but in NJ masks are mandatory and they should be. Especially with regard to a professor whose specialty should be bacteria and viruses.",
      "author": "kimareth",
      "created": 1610846719,
      "upvotes": 134,
      "replies": {
        "gjjj99a": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjj99a/",
          "text": "Sounds like someone who’s been teaching the same material so long they’re incapable of being up to date on any info. I agree, OP should consider finding another professor, but that’s impractical a lot of the time. Also any university still doing in-person classes with no option for at-home is just begging for infections",
          "author": "samskyyy",
          "created": 1610856442,
          "upvotes": 25,
          "replies": {}
        }
      }
    },
    "gjiy7nx": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjiy7nx/",
      "text": "[deleted]",
      "author": null,
      "created": 1610845144,
      "upvotes": -64,
      "replies": {
        "gjj0y5l": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj0y5l/",
          "text": "It's not like a pane of glass. People can hear you.",
          "author": null,
          "created": 1610846643,
          "upvotes": 26,
          "replies": {
            "gjj1uau": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1uau/",
              "text": "[deleted]",
              "author": null,
              "created": 1610847110,
              "upvotes": -9,
              "replies": {
                "gjj525t": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj525t/",
                  "text": "I think it’s the inability to read lips. If we can’t fully hear what somebody says, we fill in the information by reading their lips",
                  "author": "McChickenFingers",
                  "created": 1610848818,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "gjiytz5": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjiytz5/",
          "text": "I can hear professors just fine with a mask over zoom, and it's even better in person. There's no reason for the prof NOT to wear one.",
          "author": "-Knockabout",
          "created": 1610845489,
          "upvotes": 31,
          "replies": {}
        },
        "gjjl02y": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjl02y/",
          "text": "This is one of the stupidest comments I have ever read. If someone who doesn’t care sits in the front and gets covid from the professors spewing droplets everywhere, they will spread it and you’re back to full remote. Also, if you can’t hear someone with a mask on ask them to speak up.",
          "author": "IgodZero",
          "created": 1610857410,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gjivcgd": {
      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjivcgd/",
      "text": "I would ask to see some credentials. I wouldn't take biology from a professor that didn't insist on everyone wearing two masks. Herd immunity his way would consider killing off 6.6 million an acceptable outcome.",
      "author": null,
      "created": 1610843590,
      "upvotes": 359,
      "replies": {
        "gjj0bgl": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj0bgl/",
          "text": "[deleted]",
          "author": null,
          "created": 1610846296,
          "upvotes": 48,
          "replies": {
            "gjj0roc": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj0roc/",
              "text": "Now your taking his approach.",
              "author": null,
              "created": 1610846543,
              "upvotes": 19,
              "replies": {
                "gjj0x0d": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj0x0d/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1610846625,
                  "upvotes": 5,
                  "replies": {
                    "gjj2xxb": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj2xxb/",
                      "text": "He'd at least want to wait until it hit a logistical curve before joining that experiment. It's a poorly executed bad idea.",
                      "author": null,
                      "created": 1610847691,
                      "upvotes": 0,
                      "replies": {
                        "gjj351l": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj351l/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1610847794,
                          "upvotes": -3,
                          "replies": {
                            "gjj3o01": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3o01/",
                              "text": "If only there was some medical intervention that served the same purpose.",
                              "author": null,
                              "created": 1610848069,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gjj1a3c": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1a3c/",
          "text": "Do  you see the irony that you are demanding credentials from someone who has a lot more than you?",
          "author": "CrazyHorse_CFH",
          "created": 1610846815,
          "upvotes": -7,
          "replies": {
            "gjj3ja7": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj3ja7/",
              "text": "No, I see it as verification he is an actual professor.",
              "author": null,
              "created": 1610847999,
              "upvotes": 17,
              "replies": {}
            },
            "gjj2d3v": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj2d3v/",
              "text": "I was going to ask this. He's a professor on microbiology. Even worse, he is HIS professor. The man is clearly competent within his field.\n\nOP should have instead said that it makes him uncomfortable, which is the truth. OP does not have a better understanding of biology than his professor, but he has the right to express his concerns.",
              "author": "MrStealYourFrog",
              "created": 1610847389,
              "upvotes": 5,
              "replies": {
                "gjj9ee8": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9ee8/",
                  "text": "I wouldn’t say so. There are some professors within biology that claim vaccines don’t exist. A degree doesn’t make you immune from being bstshit",
                  "author": "pokemonareugly",
                  "created": 1610851123,
                  "upvotes": 55,
                  "replies": {
                    "gjjgpv5": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjgpv5/",
                      "text": "Of course that could apply equally well on both sides.  There are credentialed experts that say masks don’t work as well as experts that say they do.  You’ll find competing views in almost every field.  Therefore, you have to do what makes the most sense to you.  I live in California and we’ve been wearing masks for almost 6 months and it hasn’t done a thing to slow cases.",
                      "author": "stan_darce",
                      "created": 1610855068,
                      "upvotes": -2,
                      "replies": {
                        "gjjnrn5": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjnrn5/",
                          "text": "Quick note: I’d like to point out that the efficacy of masks ranges depending on the fabrics used in them. For example, coming from a country with a population of 23 million and a total of 7 COVID-related deaths so far, I can tell you straight off that masks work — but medical grade ones work the best, because they actually have filters sandwiched between the cloth fabrics that are able to filter the air. Cloth masks are absolutely better than nothing, but their efficacy is greatly limited. \n\ntl:dr; MASKS DO WORK. But it depends on what type of mask you have.",
                          "author": "charlenemiu",
                          "created": 1610859080,
                          "upvotes": 13,
                          "replies": {}
                        }
                      }
                    },
                    "gjjqv7h": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjqv7h/",
                      "text": "I would assume there is a reason OP is taking the professor's class, and the professor isn't taking OP's class. He could just be a lecturer and not a professor anyway, I suppose.",
                      "author": "MrStealYourFrog",
                      "created": 1610861107,
                      "upvotes": -9,
                      "replies": {}
                    }
                  }
                },
                "gjj6df6": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj6df6/",
                  "text": "Well, I've never had cause to ask before, but I would want to see a diploma or whatever wizard degree they give professors.",
                  "author": null,
                  "created": 1610849502,
                  "upvotes": 13,
                  "replies": {
                    "gjj8mvl": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj8mvl/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1610850711,
                      "upvotes": 8,
                      "replies": {
                        "gjj9bv5": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9bv5/",
                          "text": "Generally, but for something this dumb; I'm gonna require physical paper.",
                          "author": null,
                          "created": 1610851086,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    },
                    "gjj8p5r": {
                      "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj8p5r/",
                      "text": "Usually, you need AT LEAST a PhD to be a professor. You have to be very good at what you do to get a PhD.",
                      "author": "MrStealYourFrog",
                      "created": 1610850745,
                      "upvotes": 0,
                      "replies": {
                        "gjj93zu": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj93zu/",
                          "text": "He could be a lecturer and she thinks he's a professor. Maybe a TA cause the real prof. got covid. Who knows? Big crazy world.",
                          "author": null,
                          "created": 1610850968,
                          "upvotes": 9,
                          "replies": {
                            "gjjqixy": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjqixy/",
                              "text": "He could definitely just be a lecturer and not a professor, but I just go by what OP said in his post.",
                              "author": "MrStealYourFrog",
                              "created": 1610860879,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        },
                        "gjjeo15": {
                          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjeo15/",
                          "text": "Plenty of professors only have masters",
                          "author": "APaintedBirdByDesign",
                          "created": 1610854011,
                          "upvotes": 7,
                          "replies": {
                            "gjjr4ry": {
                              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjjr4ry/",
                              "text": "Do they? I have not met a single professor throughout my degree (physics) without a PhD. There are some lecturers that do only have a masters, but all the professors I have had, had a PhD. \n\nMaybe it is different in biology, who knows. I perhaps should've googled a bit more before making such a claim purely from anecdotal experience.",
                              "author": "MrStealYourFrog",
                              "created": 1610861281,
                              "upvotes": 4,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "gjj6yve": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj6yve/",
              "text": "Entitled college students, who would have guessed?",
              "author": "Gamerred101",
              "created": 1610849818,
              "upvotes": -11,
              "replies": {
                "gjj9owg": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj9owg/",
                  "text": "Hey, the check cleared. Usually people frame it; not a huge ask.",
                  "author": null,
                  "created": 1610851279,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gjj11ct": {
          "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj11ct/",
          "text": "Well sorry but that’s life. Not everyone lives. If my family and I die but millions more live then that’s just the price to pay. Life isn’t forever.",
          "author": "GetYourselfAHapa",
          "created": 1610846690,
          "upvotes": -38,
          "replies": {
            "gjj1jhb": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1jhb/",
              "text": "The prof is asking to be a risk to everyone in the front row especially but also everyone else in the class. He's not that special.",
              "author": "okThisYear",
              "created": 1610846947,
              "upvotes": 27,
              "replies": {
                "gjj78lb": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj78lb/",
                  "text": "Unless you have pre existing conditions, which most don't, college students are hardly at risk for anything. Doesn't make it right to spread the virus, but it's still true.",
                  "author": "Gamerred101",
                  "created": 1610849961,
                  "upvotes": -18,
                  "replies": {}
                }
              }
            },
            "gjj1arj": {
              "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj1arj/",
              "text": "Which is super cool, but people like to come to it on their own terms. Or sometimes even opt to remain living in special cases.",
              "author": null,
              "created": 1610846824,
              "upvotes": 12,
              "replies": {
                "gjj4zea": {
                  "link": "/r/college/comments/kyv505/my_microbiology_professor_asked_if_it_was_okay_to/gjj4zea/",
                  "text": "then OP shouldn't sit six feet from the professor.",
                  "author": "BIG_IDEA",
                  "created": 1610848776,
                  "upvotes": -11,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634052157
}