{
  "sid": "q01sol",
  "link": "/r/college/comments/q01sol/lost_motivation_completely_due_to_death_need/",
  "title:": "Lost motivation completely due to death - need advice",
  "text": "A childhood friend of mine passed away on Tuesday after battling cancer. I attended her service on Thursday. My professors excused my absences on Thursday and Friday, and have been very understanding. However, I have absolutely no motivation or energy to do anything school-related for the upcoming week(s). I realize that of course, my mood and motivation levels will fluctuate, but I could really use some advice from those who have lost loved ones on how to find a rhythm again",
  "author": "throwaway029e8e",
  "created": 1633203223,
  "updated": 1634089683,
  "over_18": false,
  "upvotes": 43,
  "upvote_ratio": 0.96,
  "comments": {
    "hf4vuxh": {
      "link": "/r/college/comments/q01sol/lost_motivation_completely_due_to_death_need/hf4vuxh/",
      "text": "Inform your professors that you’re still dealing with a loss and you’ll keep them updated if things get worse. \n\n\nIf you must, consider taking a leave of absence for the semester if you genuinely feel like you can’t do anything. Of course, you’ll have to restart that semester so there’s that.",
      "author": "BjornReborn",
      "created": 1633204147,
      "upvotes": 22,
      "replies": {}
    },
    "hf4wbc9": {
      "link": "/r/college/comments/q01sol/lost_motivation_completely_due_to_death_need/hf4wbc9/",
      "text": "Everyone is different. For me what works is to view working on things as a temporary escape from grief and mourning.\n\nGrief is a process and work. It takes time and energy to go through. It can help to acknowledge that. Also to make some formal ways of grieving/commemorating, like writing in a journal, taking a walk or sitting in a special place for some time to reflect, etc. That way you can start to feel like your grief has its time and place, rather than creeping in all over your life.\n\nAlso realize that a few days hasn't been much time. You're still in the acute stage of grief - that's perfectly normal but may clash with the practical demands put on us by life. \n\nOne thing that might help is instead of waiting to do your school work when you feel up to it, tell yourself you're going to work on one small thing whether you have the energy or motivation or not.",
      "author": "Violet_Plum_Tea",
      "created": 1633204341,
      "upvotes": 8,
      "replies": {}
    },
    "hf5aotk": {
      "link": "/r/college/comments/q01sol/lost_motivation_completely_due_to_death_need/hf5aotk/",
      "text": "If it was me, I'd find a way to convince myself to finish. I've worked through grief before. But honestly, it's your own mental health. Withdrawing from a class, especially this early into a semester, is perfectly normal. Take a break from school. Get a job and work off that negative energy. Talk to a chaplain/pastor, they listen to people's problems all the time and can offer consolation and reassurance. Don't stay in school if you're physically overwhelmed with grief, because your grades will follow you. I'd recommend withdrawing, and resuming once you've come to terms with your loss.",
      "author": "Nighthawk68w",
      "created": 1633210585,
      "upvotes": 4,
      "replies": {}
    },
    "hf5qh87": {
      "link": "/r/college/comments/q01sol/lost_motivation_completely_due_to_death_need/hf5qh87/",
      "text": "Decide what you want to do. If you want to push through, just go through the motions of pushing through. I know it's not the same, but last year I lost my dog who'd been my best friend for a decade and a half. I was socially isolated, and she was everything to me. We fought the cancer, but...anyway. It was the last thing I wanted to do, but I made myself push through. Maybe if I'd had a support system or anything else in my life, I would've had something else to focus on, but I didn't. I focused on school, and pushed through to try to make it all worth it. I'm not sure I got into a rhythm, but I got on a schedule where I made myself do work work during certain hours and just blanked out my brain honestly.\n\nThere is no \"should\". No one else can determine how affected you are or how well you can cope. I'm still not over it, and I don't think I will be for a long time, but at least I can get closer to my goals in the meantime.",
      "author": "cosmicmerperson",
      "created": 1633217579,
      "upvotes": 4,
      "replies": {}
    },
    "hf6mkar": {
      "link": "/r/college/comments/q01sol/lost_motivation_completely_due_to_death_need/hf6mkar/",
      "text": "You don’t ever get over it, you just eventually move on. Life doesn’t stop and new things come into your life.",
      "author": "Aggravating_Ad7333",
      "created": 1633232996,
      "upvotes": 2,
      "replies": {}
    },
    "hf6f9i7": {
      "link": "/r/college/comments/q01sol/lost_motivation_completely_due_to_death_need/hf6f9i7/",
      "text": "You are grieving, and it's completely to be expected that you'll be out of the normal swing of things for awhile. Don't be hard on yourself, go through what you need to do in order to find some peace. I'm sorry for your loss.",
      "author": "VeryStink",
      "created": 1633229195,
      "upvotes": 1,
      "replies": {}
    },
    "hf7i9gv": {
      "link": "/r/college/comments/q01sol/lost_motivation_completely_due_to_death_need/hf7i9gv/",
      "text": "Whatever you decide to do about it, just know you aren’t alone. I dropped out due to grief my first semester.",
      "author": "delusionalry",
      "created": 1633255120,
      "upvotes": 1,
      "replies": {}
    }
  }
}