{
  "sid": "ku70sj",
  "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/",
  "title:": "Anyone else feel guilty that their parents are paying for their college?",
  "text": "Currently a sophomore and go to a top public school and my parents are footing the entire bill (tuition, room/board etc). I come from an immigrant family and we are upper middle class (couldn't get any aid). I've had this lingering feeling of guilt ever since college started and it has especially been exacerbated recently since one of my parents is a medical worker and working long hours bc of the pandemic. There's not a day that goes by where I don't think of the sacrifices they are making to give me a good education.\n\nI asked how I can \"repay\" them and they said through \"putting in hard work and trying my best\". I think I've been pretty successful in college so far (high GPA, got a pretty good finance internship lined up etc.) but I still feel like what I'm doing isn't \"enough\". I hope to pay them back one day but they said they wont take any of my money (you know how immigrant parents are lol)\n\nJust wondering how to deal with this burden and guilt and if anyone else is in a similar position to mine.",
  "author": "eplinx",
  "created": 1610251603,
  "over_18": false,
  "upvotes": 1524,
  "upvote_ratio": 0.97,
  "comments": {
    "glt489g": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/glt489g/",
      "text": "My parents did something called Florida Pre-paid, which I'm sure other states have but for anyone who doesn't know, you can basically start a plan for your child as early as when they are born, you lock in a price to pay each month based on the plan you pick and their age you start at. You can choose plans as minimal as  \"2 year degree, not including housing\" and then I think they have tiers all the way up to something like \"6-8 year degree including books and housing\". Basically as long as you go to a Public Florida college and start when your child is young, they will have most of tuition covered and then maybe books or housing if you choose. May parents picked on that covers tuition for about 4 years.... and I feel guilty about this ALL THE TIME. \n\nAs another comment mentioned below, it has made me VERY stubborn about trying to work as much as possible to be as independent as possible.\n\n Interestingly enough though, my parents have always made it a point to let me know that they simply wanted better for me and that they just hope by doing so I can give an even better life to my children and most of the guilt actually stems from other classmates and coworkers....\n\nTo give some back story, my mother is from the Philippines, where the American way of kicking a child out at 18 is seen as kind of cruel. It is customary to support children throughout their education.  My father is American, and since she was able to save so much from being supported through college, she actually paid off my father's student loans before they got married. The whole student loan experience of my father's only added to their point of wanting me to NEVER have to get sucked into that hole. And knowing this growing up kind of mellowed the usual stems of guilt.\n\nUNTIL, I actually graduated high school and started college and started working more consistently. Classmates, coworkers, and friends from high school alike all had something to say about my college being paid for in the sense of \"must be nice for mommy and daddy to pay for school.\" As if I was some spoiled unappreciative rich kid.... when in reality I was working a lot to try and save and be independent and growing up, while mostly a comfortable middle class, we were not luxurious in any sense.\n\n It was after I had a conversation with a now EX friend that I realized that i shouldn't let others make me feel so guilty about this (even if I can't help still feeling it a little bit) She was on this whole rampage of \"I have to get financial aid, my parents came to this country with nothing, I'm not lucky like YOU\"... meanwhile I had known her since middle school and  her and her parents drove nice cars, had the latest iPhones, always shopped at the mall, wore name brand clothes and jewelry, went on trips every year, etc. Etc. Well... growing up my family shopped at places like Ross and TJ maxx, spent weekends couponing, and didn't travel much. I had a flip phone when all my friends had iPhones, and never wore brand names like them. So while her family found importance in wearing name brands and having the latest iPhone, my parents were taking the money they saved on not indulging us in those things and paying for that college plan. \n\nWhich honestly, to each their own, but if YOU are gonna come for ME with my off brand shoes and Android complaining about how you're so poor while holding your new iPhone, with your Tiffany rings and Tory Burch flip flops, you can kindly f** off. \n\nSo now I just make peace with the fact that my parents taught me to have my priorities straight. I can worry about being guilty, or I can focus my energy in being so grateful and making sure that I make them proud so that I can give my children even more..\n\nAnd yes, I realize that there are many out there who had neither luxury of nice things or college tuition, but in the area I live in, most of the bitter backlash was coming from individuals who are more privileged than they admit and it is obvious when they just prioritize different things.",
      "author": null,
      "created": 1612315574,
      "upvotes": 1,
      "replies": {}
    },
    "gjayyhy": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gjayyhy/",
      "text": "I left college the first time with a job in my field and my parents did not agree with it! They paid for the first semester of school than I got an internship and a job by that Xmas. Going back I luckily qualify for fafsa but it does not cover all my classes and after my mom saw how committed o was to school this time around she offered to pay the difference. I feel really bad about it and to be honest I didn’t know she was going to just do it when the webpage was up. I have been buying her stuff for her new house since I feel really bad but I honestly can’t afford to keep that up. I know I made my bed with school years ago but now after an injury has ended my coding career I don’t have another option really aside from maybe learning to type quickly with toes? Even as some one who has had a relatively successful career it’s rough to cut the extra cash when I’m not working",
      "author": "thorsvalkyrie",
      "created": 1610679903,
      "upvotes": 1,
      "replies": {}
    },
    "gj443ay": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gj443ay/",
      "text": "You will be paying for their nursing homes so don’t worry about it",
      "author": "TruUulyRotten",
      "created": 1610547665,
      "upvotes": 1,
      "replies": {}
    },
    "gittyg3": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gittyg3/",
      "text": "I feel like it's kind of their responsibility. They chose to create you, with that comes the responsibility to help you get ready for adult life, including paying for your education, driver's license, etc. Once you are self-sufficient it's up to you to make the best of it, but until then they owe it to you. That doesn't mean you can disrespect them and of course you can be grateful that you have parents who believe this because there are plenty who do not. Still, they decided to have you and you didn't ask for it, the least they can do is help you be prepared for it. \n\nIn my opinion parents are responsible for their child until the child is ready to face the world. You can't do that with just a highschool education.",
      "author": "llilaq",
      "created": 1610330926,
      "upvotes": 1,
      "replies": {}
    },
    "gito72f": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gito72f/",
      "text": "As a person who's parents were awesome enough to pay for my schooling, I recommend the following advice: \n\n- don't take longer to graduate because you spent a year skipping classes and partying. You're there for an education. \n- take advantage of internships. If your parents are paying your living expenses, you can maybe take a lower paid internship to get your foot in the door over bartending. \n- go to class! When you're away from home and you don't have a job, sometimes you skip class. You miss out on relationships with your professors who can help you out later.",
      "author": "BearTerrapin",
      "created": 1610328242,
      "upvotes": 1,
      "replies": {}
    },
    "gitky3o": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gitky3o/",
      "text": "nope, in my culture parents paying for college (in the absence of grants/scholarships) is considered the bare minimum duty for parents to perform.",
      "author": null,
      "created": 1610326577,
      "upvotes": 1,
      "replies": {}
    },
    "gitgwfg": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gitgwfg/",
      "text": "All they want is for you to succeed. Prove they made a great investment :)",
      "author": "WinterIsComingxX",
      "created": 1610324595,
      "upvotes": 1,
      "replies": {}
    },
    "gitgv8e": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gitgv8e/",
      "text": "Your parents worked hard for this, for you, so you could have a great life. Just don’t ever forget that. Do your job, which is making something of yourself, and be grateful because a lot of people are not as lucky as you are.",
      "author": "Jasmotron3k",
      "created": 1610324579,
      "upvotes": 1,
      "replies": {}
    },
    "git9u7p": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/git9u7p/",
      "text": "Show your appreciation by passing on the good deeds; maybe help your friend who is working their way through school with a homework assignment, or if you have children someday, pass on the favour. As someone who's parents are not paying for their tuition, I never look down on my friends whose parents are paying for their college; I have met tier parents, and the joy their parents get out of seeing their kid succeed is rewarding enough.",
      "author": null,
      "created": 1610321125,
      "upvotes": 1,
      "replies": {}
    },
    "git7j7n": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/git7j7n/",
      "text": "I’m a first generation college student also from an upper middle class family, and my parents are paying for my college too. I have my moments where I feel guilty, but I know that their dream was for their children to get a college education so they don’t mind paying for it. Also, I helped them out some by applying for scholarships before on top of my merit aid (I got no financial aid either), making it less of a burden on their end. \n\nI agree with many of the other comments saying that it’s an investment. I’ve had a pretty easy run academically in college, and I also have a good GPA, and it makes them really happy. You’re doing exactly what you should be doing!\n\nPS: The field I’m going into has a lot of well paying jobs, so my dad jokes I can buy him a Porsche and that will repay him for my education. Even though he’s joking I fully intend on doing just that when I can!",
      "author": "iglooss88",
      "created": 1610319996,
      "upvotes": 1,
      "replies": {}
    },
    "gisze4h": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisze4h/",
      "text": "You should not feel guilty at all. College should be free and housing should be free for full time students. Nobody should have to work in college. \n\nJust be grateful that you are fortunate enough not to have to take out massive amounts of debt only to get a job and spend the rest of your life paying it off. Just because the system is fucked doesn't mean you should feel guilty for not having to be subject to it. \n\nIf the guilt just won't leave you alone then maybe you should do something really nice for your parents so that they know how grateful you are for their contributions to your future.",
      "author": null,
      "created": 1610316132,
      "upvotes": 3,
      "replies": {}
    },
    "gisxvve": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisxvve/",
      "text": "I feel bad asking my dad to co-sign a loan for me",
      "author": "Canadia_213",
      "created": 1610315420,
      "upvotes": 1,
      "replies": {}
    },
    "gisx9yx": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisx9yx/",
      "text": "As a parent, if my kids ever need help with school or rent or whatever, I will help if I can and I'd never expect anything in return. Just accept it, be grateful, and pay them back in other ways if you really feel you need to.",
      "author": "dyvrom",
      "created": 1610315127,
      "upvotes": 1,
      "replies": {}
    },
    "giswpjp": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giswpjp/",
      "text": "grow up and pay off some of their mortgage, send them on nice vacations when they’re retired, take care of them the way they took care of you but only when you’re financially ready for it. It’s likely they’ve been saving since you were a baby so you don’t have to worry about it right now. Recognize and appreciate your privilege but don’t feel guilty for it! They wouldn’t be paying for it if they didn’t want to. They are giving you the greatest gift of a free education, just thank them always, do your thing, and you’ll have plenty of opportunities to pay them back in one way or another. That’s my plan w my (middle class immigrant) parents because they refuse to let me worry about it right now.",
      "author": "theKaces",
      "created": 1610314855,
      "upvotes": 1,
      "replies": {}
    },
    "gisupr7": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisupr7/",
      "text": "I feel guilty all the damn time.\n\n\nWhile my family isn’t an immigrant family, neither of my parents had any higher education, and struggled a lot financially starting out. My dad worked his whole life on a really awful rotating night shift and eventually retired at 58, and told me he’d pay for my college so I didn’t have a hard start like they did.\n\nI was an asshole my first 3 semesters. Failed a semester (bad mental health), switched majors multiple times at an expensive university setting me back because I didn’t know what I wanted to do, and I was told what I wanted to do was bad and I’d regret it by peers and friends. When I was 18, I didn’t see this as a big deal. \n\nI’m 22 and on track at a community college now for a nursing degree (what I really want to do) and I can’t help but feel awful for the amount of money I wasted. \n\nI look forward to helping my parents when they’re older and I’m able too. I feel like that’s the only real way to pay them back.",
      "author": "Niarah",
      "created": 1610313878,
      "upvotes": 1,
      "replies": {}
    },
    "gistv4d": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gistv4d/",
      "text": "I don't necessarily feel guilty about my parents being the ones to pay, but moreso that other students are faced with tougher circumstances but expected to perform the same. Students who have to work a part time job or worry about their tuition while I just focus on school work. Feels bad that I see other students in the library in their work uniform and I just woke up. In regards to your parents, they likely just want you to be in a better place than they were at your age. If you can achieve that, them paying for college will have been worth it in their eyes, and it sounds like you are on your way to achieving that with an internship and good GPA. Don't worry too much about paying them back or anything, just succeed in school and live the best life you can. When they retire and you have a career, then you can worry about taking care of them(again, assuming they don't end up needing help before then.)",
      "author": "waffleking_",
      "created": 1610313457,
      "upvotes": 1,
      "replies": {}
    },
    "gistuld": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gistuld/",
      "text": "thats why I joined the military. the tax payers paid for my education haha \n\nbut seriously, your parents understand that one day the roles will be reversed and you most likely will be taking care of them. Family looks out for one another and thats what your parents are doing by paying for your education since it will brighten your future and ensure that you can help them when they may not be able to help themselves. Just dont forgot when you are successfull, how you endeed got there.",
      "author": "SenorTonto",
      "created": 1610313450,
      "upvotes": 1,
      "replies": {}
    },
    "gistc87": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gistc87/",
      "text": "Nah. College is too expensive these days for anyone to reasonably pay for on their own (for those of you pulling it off, congratulations that's incredible). I feel bad that other people had to take on a ton of debt, but not that I didn't",
      "author": "SkiMonkey98",
      "created": 1610313196,
      "upvotes": 1,
      "replies": {}
    },
    "gissn1q": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gissn1q/",
      "text": "Same but don't worry you'll pass the favor on by paying for your kids tuition",
      "author": "ekoisdabest",
      "created": 1610312852,
      "upvotes": 1,
      "replies": {}
    },
    "gisrpxl": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisrpxl/",
      "text": "Out of respect for those who have to pay a loan, make the most of it. Don't blow the money that you make on silly stuff, spend it wisely. You are in the position to avoid selling your time in school, so try finding something that furthers your own interests. They do not expect anything back, that's the magic of some parents, and you seem to be lucky that yours can afford it!",
      "author": "Inmortal2k",
      "created": 1610312408,
      "upvotes": 1,
      "replies": {}
    },
    "gisobf4": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisobf4/",
      "text": "I have three daughters, ages 4, 3, and 1, and I am already working to make sure I can help pay for their college. It’s part of MY dream to help them this way.\n\nDon’t feel guilty. Your parents are helping because they want to and can. It may or may not be difficult for them, but they wouldn’t be doing it if they didn’t want to.",
      "author": null,
      "created": 1610310836,
      "upvotes": 1,
      "replies": {}
    },
    "giskg3e": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giskg3e/",
      "text": "I graduated from a private school in biology and my parents paid for the whole thing. They’re also immigrant parents and are upper middle class now, though middle class when I was growing up. They wanted me to go to graduate school in a field I disliked, so I left after a year of grad school, so the bulk of my guilt is mainly with the $95k that was spent for tuition, room, and board that was completely wasted. Even though I did well my undergraduate career, I feel like dropping out of a graduate program overwrites all of that. Now I’m taking prerequisite courses and planning on applying to an accelerated 1-1.5 year nursing program (another $20k). I plan on paying them back for all of it, but I don’t have as much time to do so since my parents are older (in their 67 and 70). I feel a little better that despite my failed grad career, my parents have plenty saved for retirement so even if I didn’t exist and this was all just a bad investment they still have plenty. Plus my siblings (12 years older than me) are doing well now and also plan on paying back my parents for college - unsure if they have already. I will probably need another 6-10 years to be able to pay back the entire amount and one day, if I still have enough time to save up the amount required, I also want to buy them another rental property so they have extra income going well into their 80s. \n\nThere’s definitely ways to pay your parents back if you absolutely want to (I definitely will for minimum the 95k wasted, probably for my entire college) by spending time with them, caring for them, giving them money for emergency medical expenses or retirement, buying them a house. You can also be appreciative and just do really well in your life and tell them about it. I’m still not sure my way is the best way, and maybe they won’t even want me to pay them back or won’t accept my money. But I’m still going to be thinking about it and if they won’t accept my money upfront at least I’ll buy them a house.",
      "author": "illumiee",
      "created": 1610308957,
      "upvotes": 1,
      "replies": {}
    },
    "gisettq": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisettq/",
      "text": "Just be appreciative. It’s a good thing they’re paying for you.... I and several others have to pay everything for ourselves  and it’s a struggle everyday. So Just be thankful they have the money to do that for you",
      "author": null,
      "created": 1610306155,
      "upvotes": 1,
      "replies": {}
    },
    "giserd6": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giserd6/",
      "text": "My parents payed my tuition as well I still feel guilty. But they constantly tell me it’s an opportunity that they didn’t have. They are investing in my future so I can succeed. Makes me feel a little better. I just graduated this fall and plan on paying it back to them in some other way in the future. I think it’s natural to feel a little guilty. Especially when you know how hard they work.",
      "author": "weird_looking_mango",
      "created": 1610306120,
      "upvotes": 1,
      "replies": {}
    },
    "gisdm0t": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisdm0t/",
      "text": "Never complain about having an easy life.",
      "author": "nhaire123",
      "created": 1610305557,
      "upvotes": 2,
      "replies": {}
    },
    "gisbg1r": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisbg1r/",
      "text": "Immigrant parents are the salt of the earth. Odds are they just want you to do better than they did. They may not have had the chance to go to college or if they did, had to work or go through hardships that they are trying to spare you from. \nTrust me, they know that as we grow up we’ll need them less and less; but they are still ready to give you everything they can to see you accomplish your goals. Repay them by living a good life. Your degree or certification and joy and passion for your field of study is shared with them; it’s your family’s degree and passion too. Also call your mom more, moms worry",
      "author": "likeneverbefore",
      "created": 1610304463,
      "upvotes": 1,
      "replies": {}
    },
    "gis3i5m": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis3i5m/",
      "text": "Guilty? No, privileged and grateful yes.",
      "author": "eelnitsud",
      "created": 1610300082,
      "upvotes": 1,
      "replies": {}
    },
    "gis2ymy": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis2ymy/",
      "text": "Imma give you the most real answer. What matters isn’t what you come from it’s what you do with it. You can be disciplined and still be spoon-fed. That being said appreciate your opportunities",
      "author": "SadisticShe3p",
      "created": 1610299842,
      "upvotes": 1,
      "replies": {}
    },
    "gis2vdg": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis2vdg/",
      "text": "I've defiantly felt this some times (though I'm white upper-middle class and family has been in the states for several generations). I think the best thing to do is work hard to graduate and be successful in what ever career you choose. and remember there will likely come a day when you parents will need you to help take care of them.",
      "author": "patmorgan235",
      "created": 1610299786,
      "upvotes": 1,
      "replies": {}
    },
    "gis2kjo": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis2kjo/",
      "text": "Your folks are doing what good parents do. As long as you don't party away your years and flame out of school, you're repaying them, in full, every day. This is coming from a parent with 2 kids in school, so please believe this. Heck, I'm proud of you, and I don't even know you.",
      "author": "Visible_Negotiation",
      "created": 1610299642,
      "upvotes": 3,
      "replies": {}
    },
    "gis29tm": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis29tm/",
      "text": "My parents aren't paying for my school, but they are paying for my apartment. I was so thankful when they told me they were covering it, and I also asked how to repay them for it, and they just told to \"work hard and finally graduate\".",
      "author": "WWalker17",
      "created": 1610299501,
      "upvotes": 2,
      "replies": {}
    },
    "gis1w30": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis1w30/",
      "text": "That’s what your parents want to do. Honestly I’m jealous I don’t even know if I can finish school lol",
      "author": "mokenz",
      "created": 1610299321,
      "upvotes": 1,
      "replies": {}
    },
    "gis1o6b": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis1o6b/",
      "text": "I feel this way as well. I am very grateful that my parents can afford to and are willing to support my academic journey, but I don’t want to burden them. That’s why I am working as an RA on campus. The free room and board combined with my scholarships means that my parents haven’t paid anything for my education this year",
      "author": "SonicStrings",
      "created": 1610299219,
      "upvotes": 1,
      "replies": {
        "gis1v1o": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis1v1o/",
          "text": "But at the end of the day, my parents (and possibly yours) have been saving up for me to go to college since I was born. So it’s not like I’m taking away money that they could use to pay bills or anything. The funds must be used for education anyway",
          "author": "SonicStrings",
          "created": 1610299308,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gis150k": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis150k/",
      "text": "The reason they are doing this is because they love you and want only the best for you. You can pay them back by loving them back and always keeping in touch when you move away/ visiting on holidays etc . As a parent, that’s all I want.",
      "author": "bebeloves37",
      "created": 1610298970,
      "upvotes": 1,
      "replies": {}
    },
    "gis0ytj": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis0ytj/",
      "text": "As a parent that is presently putting two kids thru college, do well in school and be successful. Show your gratitude to them.",
      "author": "chefmorg",
      "created": 1610298877,
      "upvotes": 1,
      "replies": {}
    },
    "gis0yrl": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis0yrl/",
      "text": "Man, would you rather that or rather have your parents hold every penny they so *graciously* spent over your head like my parents?\n\nYou're over-thinking this OP. Just be grateful for your parents' help. It's less stressful for you in the long run and you get to focus on what really matters which is your studies.",
      "author": "goodpup",
      "created": 1610298876,
      "upvotes": 1,
      "replies": {}
    },
    "girxz24": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girxz24/",
      "text": "You can always pay them back with being kind, helpful and show gratitude for the things they do. Also I don’t think they actually mind the money but instead your manner and how much you truly work hard for it. Cause the only thing they regret is incase you actually don’t work for it or pay them respect. They are parents I am sure they planned this way before you where born. So don’t feel any guilt, you are making them very happy by going to college. You know some parents are in sorrow cause their child chose the wrong path or dropped out of college to do illegal stuff etc. as long as you aren’t doing anything like that. Don’t feel bad, they wouldn’t be happy to know you feel guilty, they would be happy seeing you being ambitious and enjoy your day/life.",
      "author": "Tanya_9904",
      "created": 1610297375,
      "upvotes": 1,
      "replies": {}
    },
    "girwg3d": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girwg3d/",
      "text": "find scholarships maybe??",
      "author": "davidc5494",
      "created": 1610296581,
      "upvotes": 1,
      "replies": {}
    },
    "girvmhg": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girvmhg/",
      "text": "If you parents can pay for it and you have good grades then they almost owe it to you in my opinion. You didn't ask to be born!",
      "author": "chucharino",
      "created": 1610296143,
      "upvotes": 1,
      "replies": {}
    },
    "girvgv6": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girvgv6/",
      "text": "No.  Because my parents didn't pay for shit (either times I went to college or trade school). \nBut you shouldn't either. Just thank them and count your blessings.  You have proper parents.",
      "author": "TheVoidWithout",
      "created": 1610296058,
      "upvotes": 1,
      "replies": {}
    },
    "girupoc": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girupoc/",
      "text": "I am a parent and I will be paying for my kids college. \n\nI don't want them to feel guilty. I want them to feel grateful, and to appreciate the gift they are getting. I want them to understand that few people get this gift, and to understand that they are fortunate to not carry debt after college. \n\nI believe that anyone would take the money offered for college. It's just few get the chance. \n\nDon't feel guilty. Don't feel entitled. Just consider the debt you now owe is one to society to help make the world a better place.",
      "author": "which_spartacus",
      "created": 1610295655,
      "upvotes": 1,
      "replies": {}
    },
    "girujaz": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girujaz/",
      "text": "This is just how selfless parents can be. They want us to have best of all and they are willing to  provide us with everything they have. It’s always good to be grateful but don’t get devoured by this feeling. When they age and get old, you can take care of them like they did to you when you were young. I believe even you can’t help with the finance now, they are still pound of you for what you have achieved academically!",
      "author": "Analyst-Aromatic",
      "created": 1610295560,
      "upvotes": 1,
      "replies": {}
    },
    "giru0gz": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giru0gz/",
      "text": "I wish mine would pay for mine. Instead I pay them for shit",
      "author": "imthenewcat",
      "created": 1610295280,
      "upvotes": 1,
      "replies": {}
    },
    "girsvlv": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girsvlv/",
      "text": "Nope because my parents couldn’t afford to pay for my college. All me baby!",
      "author": "kh7190",
      "created": 1610294662,
      "upvotes": 1,
      "replies": {}
    },
    "girrxfp": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girrxfp/",
      "text": "Nope. Fuck my Dad imo",
      "author": "Quack3496",
      "created": 1610294137,
      "upvotes": 1,
      "replies": {}
    },
    "girqge2": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girqge2/",
      "text": "For context: I am Turkish, my parents are Turkish, we live in Turkey so there may be cultural differences. But I am gonna take a guess and say all parents feel the same way about their children.\nMy parents are paying for my Uni as well. Growing up my dad has repeatedly said “I am working for you, I am earning money for you; so I can get you everything you want, and so you don’t miss on anything you want.” My dad is an engineer, he works as a project manager and I’d say we are well off with just the money he earns alone. When I was a child we were poor to the point he would send mom away to her mom’s house because they couldn’t pay the bills and the house would be too cold, and he didn’t want me going through that. He just called me the other day, drunk, talking about how he is sorry he couldn’t get me the toys i wanted so much when I was a toddler, and how awful he felt because of that, and that he’s trying everything he can so he can make me live under the best conditions he can provide. He says I am his motivation to work. \n\nPoint is, parents want whats best for their children. They don’t want their children to suffer, or be stressed, or any of that. Especially if they were poor at some point, that’s what they work so hard for, so we don’t experience the same difficulties. I know me going to Uni makes him so so proud, he boasts about it to his friends. I don’t feel guilty because I know he is happy. He is happy that I am getting this education, and every time i tell him a mid term or a final went well I can hear the joy and how proud he is through his voice over the phone.",
      "author": null,
      "created": 1610293306,
      "upvotes": 3,
      "replies": {}
    },
    "girq06p": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girq06p/",
      "text": "I am not in college. But, I share your feelings. \n\nI have planned to at least bear my other expenses (in case, I cannot pay for college) through passive income earned from the internet and other sources.\n\nThe biggest repayment will always be  \"success\" and what others have mentioned.",
      "author": "cee_deimos",
      "created": 1610293048,
      "upvotes": 1,
      "replies": {}
    },
    "girppia": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girppia/",
      "text": "My mother and I are both Russian immigrants, migrating to the US when I was young (haven’t been back since I was 15, though). Were quite poor growing up, luckily enough to get $50k+ in need-based aid per year. At the start of college she tried sending me a few hundred $ a month to pay for other expenses (despite multiple injuries forcing her into medical retirement), but I figured out ways to make do without (e.g. not buying any textbooks or a computer and instead using library resources, working out a ‘deal’ with dining hall employees whereby I’d say hello to them and they’d give me lots of free food, taking advantage of free marginal entertainment supplied by clubs, learning how to hitchhike, etc.). She refused to stop sending me money so I had to close my bank account an open a new one to which she lacked access. Was a bit mad at first but eventually came around, and later on I managed to snag several more scholarships and save enough money to smooth over future financial bumps (e.g. starting grad school I still had ~$15k saved after working a dig in France and bumming around Southern Europe, which helped when it turned out my first paycheck wouldn't come until a month and a half in). Also used some of that to e.g. send her and her boyfriend to an all-inclusive resort for a week, and otherwise try pay back long-standing debts through other fancier gifts, when possible. It's still not entirely clear what my long-term financial trajectory will be like, but hopefully if my wife and I ever start making the really big bucks we can ensure that my mum (& grandparents, etc.) is well taken care of lol.",
      "author": "--MCMC--",
      "created": 1610292878,
      "upvotes": 1,
      "replies": {}
    },
    "girpcq0": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girpcq0/",
      "text": "Make them proud, that's how you can repay them.\n\nYou are a good human.",
      "author": "bassaleh",
      "created": 1610292674,
      "upvotes": 1,
      "replies": {}
    },
    "girormy": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girormy/",
      "text": "If it makes you feel better, how about you pay for your books and some of the essentials of living.  Just let your parents know how you feel and start to pay for a few things.  It might make you feel better and since at some point you will be footing your own bill you could start small now.  Does your internship pay?  You don't have to give your parents cash, just take care of a few things.  Good luck.",
      "author": "GreyMatter399",
      "created": 1610292330,
      "upvotes": 1,
      "replies": {}
    },
    "giroi21": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giroi21/",
      "text": "My parents are only helping me with community college, I’ll have to pay for myself when I go onto university. They said it was because they rather I save my money for university than spend it on community college.",
      "author": "bluesolur",
      "created": 1610292172,
      "upvotes": 1,
      "replies": {}
    },
    "girnt26": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girnt26/",
      "text": "I'm a parent to a middle schooler, a (non-traditional) college student, and daughter in-law to immigrants. My husband grew up overseas, his father worked in gas stations and did odd jobs just to get his kids the opportunity to go to high school and college in the states. Didn't have enough money to pay for their kids' college, but just getting them here was a big sacrifice. \n\nAs parents, and having the \"background\" that I/we do, It sounds like they're proud of you, and I can tell you they feel like they \"got their money's worth\" just by your being successful in college. \n\nYou'll \"pay them back\" by being a good person, and by giving them your time when they need it (and when you can spare it - I'm not trying to suggest that you're their slave now) later in life, especially when they get older. \n\nBasically, they don't want your money, and barring really hard times, they'll never want your money. They want your happiness and your success, and they want you to be someone that they're proud of. \n\nGuilt is normal though, I think, just try to block it out? Sorry... \n\nSo here's my guilt story: I'm an older student, with kids, and my husband is the one paying my tuition (and for the kids school.) Meanwhile, I'm studying, so I don't really have time for taking care of the house and kids like I used to. Yeah, I feel guilty, when my 3 year old wants me to see what he drew and tell an elaborate stoy about it, but I'm studying for a test that I have to take in about 30 minutes. Or, when the tuition bill comes and we have to figure out how to cut expenses to avoid having to borrow money from people to pay it, Or even just when classmates talk about how they have work on a certain day, but I don't have or even need a job. \n\nI approach it the same way I learned how to deal with failing an exam. Essentially, accept it, and move on. \n\nJust some backstory: I'm otherwise a straight A student, but engineering classes have started to \"put me in my place\" with exam scores or 30-40% here and there and class averages of 60%.",
      "author": "symmetrical_kettle",
      "created": 1610291758,
      "upvotes": 1,
      "replies": {}
    },
    "girnov2": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girnov2/",
      "text": "No- it’s the least they can owe us.  We didn’t ask to be born.",
      "author": "Qwerty172xx",
      "created": 1610291689,
      "upvotes": 1,
      "replies": {}
    },
    "girn9n9": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girn9n9/",
      "text": "I’m in the same situation. Immigrant family in which they worked super hard and got to middle class status so we get no aid. They have no savings or retirement fund. It eats away at me, but I plan on becoming a doctor so I’ve been working really hard in undergrad and I’m gonna try to get merit scholarships for med school and no matter what I’m gonna give them money once I have my “doctor salary” and I’ll try to pay for their retirement (they don’t know that I plan on paying them back yet so idk how they’ll take it once we get there lol)",
      "author": "ekaplun",
      "created": 1610291428,
      "upvotes": 1,
      "replies": {}
    },
    "girmmax": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girmmax/",
      "text": "It's a down payment so that you can get a good job and help them through retirement, retirement homes and ene of life care.",
      "author": "pabupaybe",
      "created": 1610291019,
      "upvotes": 1,
      "replies": {}
    },
    "girmjkf": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girmjkf/",
      "text": "The sense of entitlement is strong in the comment section...\n\nNo, just because you didn't choose to be born doesn't mean your parents owe you college tuition. Are kids being serious here? I mean holy sht do I feel bad for your parents if you feel this way.\n\nTry seeing how hard it is to save just 1 grand as an adult, paying your own rent / bills / etc. Its effin hard! Thats not even with dependents. Now look at college tuition, including room and board, and see how many times you need to do this.\n\nYou want to imagine what it's like? Imagine doing that sht for close to 2 decades, only for all your hard work saving money (cutting coupons, giving up buying cool stuff for yourself, etc) to be flushed out relentlessly in 4 years. Then you find your pos entitled kid is posting on reddit saying \"yeah, of course, it's their duty\" or some nonsense like that. It would completely break my heart. Oh, and the kicker is your kid is gonna come crawling back for grad school, since an undergrad degree is going to be worthless in a few years.\n\nParents go through all this hot garbage because we love our kids and want them to have an easier life than we did. We don't \"owe\" you a damn thing.\n\nTo OP: you sound like a good kid, and your parents should be proud. Take good care of them!",
      "author": "paerius",
      "created": 1610290971,
      "upvotes": 0,
      "replies": {
        "gitazta": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gitazta/",
          "text": "My dad did not come from money. He had to work damn hard to pay for college himself and then law school, where he met my mom. They waited to have kids until they were in their 30s. By this point they were both practicing lawyers and had a good bit of money. They only had one child. They paid for my college tuition and rent during college. My dad told me that he did not want me to have to struggle with money the way he did. He wanted me to have a leg up on life. I would certainly say I had that (and I am incredible grateful!). I was able to save money when so many of my peers had to spend it paying off their loans. I saved enough to pay for my own masters degree, in cash. By age 28 I had saved $80k for a down payment on my first home which I now own. I will keep saving because I absolutely feel it is my duty to pay for my future kids’ education. This is how you build intergenerational wealth. You pay it forward because it benefits your family.",
          "author": "IthacanPenny",
          "created": 1610321703,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "girmg9e": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girmg9e/",
      "text": "Do exactly what your parents said. Keep putting in the hard work, and always give your all. Trust me, as a parent myself, I can promise you they're plenty proud of that and probably even brag about you for doing well in college. You can continue to pay them back after college by being a productive member of society. Your parents are making an investment in you and your future. Keep up the hard work, and don't forget a \"thank you\" or \"I love you\" when you're done.",
      "author": "Viking_Dev",
      "created": 1610290913,
      "upvotes": 1,
      "replies": {}
    },
    "girme2p": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girme2p/",
      "text": "Damn I could have written this post myself. For me, looking for external scholarships, even in small amounts, helps lessen both my own guilt and the financial burden on my parents.",
      "author": "analiseh18",
      "created": 1610290875,
      "upvotes": 1,
      "replies": {}
    },
    "girjcmm": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girjcmm/",
      "text": "Would you pay for your children's tuition if you had the means? I would.\n\nMy parents are not wealthy people so I financed myself through university. However I did live with them rent free for a year after graduation and the sentiment is similar. Even if it is less money.\n\nThey love you. They want to support you and they have the means to do so.\n\nJust don't ask them for more money unless you absolutely need it. They'll appreciate it.\n\nSometimes my step dad gets annoyed at me for never asking for help though lol.",
      "author": "Elastichedgehog",
      "created": 1610288771,
      "upvotes": 1,
      "replies": {}
    },
    "girig4d": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girig4d/",
      "text": "I kind of (but don’t fully) understand how you feel. This is my third year in university and I’ve been paying tuition with my post 9/11 GI bill benefits from my dad. He spent over 20 years in the army and gave all the benefits he could to me even though I have 2 sisters. I basically bombed my first year and a half in college, I felt absolutely horrible thinking that my dad sacrificed so much throughout my life for me to just, not put in as much effort as I could have. Luckily in these sorts of situations parents usually want the best for you, we’re both extremely lucky that our parents are able to basically provide an education for us. Truly the best thing you can do is do your best in college and respect your parents wishes as long as you live under their roof. (Although being the grandson of immigrants I understand how that story goes as well lol) \nI definitely wouldn’t feel guilty though. Everyone is in different places and it’s important to just practice gratitude and humility as you go through life, no matter what you do or don’t have.",
      "author": "xxfukai",
      "created": 1610288150,
      "upvotes": 2,
      "replies": {}
    },
    "giribo8": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giribo8/",
      "text": "Don't feel bad. Just work hard, get the best grades, and make them proud. You don't want to be in debt, trust me. This is way above and beyond what my parents would ever do, and they were born here and see no value in higher education. Mine were from the old school where you got a job right out of high-school and your life turned out okay. Sadly, they never considered my own future nor did they plan for it. If you decide to have kids open a 529 account for their school. I did that for my daughter just because I want to do better for her.",
      "author": null,
      "created": 1610288062,
      "upvotes": 1,
      "replies": {}
    },
    "girevl1": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girevl1/",
      "text": "You shouldn’t feel this way, though I understand it may feel natural to feel like for certain people. Your parents love you, and their position in society is why they are able to pay for your college. Feel honored and loved, but never guilty for “taking their money”. My mom is on disability, she can’t help pay a single dime. I put off college for a semester just so I could make enough money to pay fees. I had to pay 1k for a class that my aid didn’t cover and it really stressed me out. I wish I had parents like yours to support me. Really appreciate your parents. I cooked and cleaned for my mom, and even paid a ticket, car battery, and a couple of tires for her.",
      "author": "LunarianPrince",
      "created": 1610285456,
      "upvotes": 1,
      "replies": {}
    },
    "gireiaa": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gireiaa/",
      "text": "Everyone commenting has very good points, I'd like to add that you could look into scholarships! They're really helpful",
      "author": "helysia",
      "created": 1610285155,
      "upvotes": 1,
      "replies": {}
    },
    "girdh19": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girdh19/",
      "text": "Don’t feel bad!! your parents worked hard to be able to do this for you I’m sure it brings them happiness and satisfaction as well. You sound appreciative of this very great privilege and that’s good enough!! My parents were never able to afford any type of school for my siblings and I (thank god for fafsa) and my parents always felt bad about it. Just think about how happy they are that their child is going to college and they’re able to do this for you!",
      "author": "dmorrison666",
      "created": 1610284291,
      "upvotes": 1,
      "replies": {}
    },
    "girc4sw": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girc4sw/",
      "text": "I remember my parents paying for one of my classes. We were dead ass poor but FA said my parents made too much. Anyways, just for this one class. My parent said, talk to us about your school day. They didn't want money back but to still be part of my life... they were showing me to get my education and not to forget about them while in school. I love that idea as it also shows them where their money is going. Things I remember talking about was my struggles and how I over came them.",
      "author": "tillD2t",
      "created": 1610283133,
      "upvotes": 1,
      "replies": {}
    },
    "girbcyv": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girbcyv/",
      "text": "Capitalism got you feeling guilty on parents providing for an ever expanding list of basic needs needed to survive the real world.",
      "author": "oliver_bread_twist",
      "created": 1610282421,
      "upvotes": 4,
      "replies": {
        "giu4qgu": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giu4qgu/",
          "text": "[deleted]",
          "author": null,
          "created": 1610336433,
          "upvotes": 1,
          "replies": {
            "giu5kra": {
              "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giu5kra/",
              "text": "My point is capitalism and commercialization of school is the underlying cause of what you've mentioned.",
              "author": "oliver_bread_twist",
              "created": 1610336870,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gir9vgx": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir9vgx/",
      "text": "I kinda do feel guilty about it so I feel the urge to have to repay my parents when I get a salary.",
      "author": "TheSKorpionKing",
      "created": 1610280995,
      "upvotes": 2,
      "replies": {}
    },
    "gir6gx6": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir6gx6/",
      "text": "Obvious first step is to get good grades and not let them slip.",
      "author": "SilentJon69",
      "created": 1610277572,
      "upvotes": 2,
      "replies": {}
    },
    "gir60sb": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir60sb/",
      "text": "No, lol why ? Just leaverage your loan and trade options for tuition and profit",
      "author": "Thewushuking123",
      "created": 1610277126,
      "upvotes": 1,
      "replies": {}
    },
    "gir55pt": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir55pt/",
      "text": "See, the guilt would be there till you are dependent on them and its normal to feel that way. But don't let it distract you from studying and relaxing.\n\nSee, consider your education and life an investment by your parents so that you can have pursue your passion and have a better life then them. You do exactly that. \n\nAnd in return, be there for your parents when they need you, take care of them after retirement, provide them with a better life then they have currently, etc. \n\nAnother thing which you can do is keep a list of all the wishes, goals, things, etc, your parents wanted to do or buy but couldn't because of financial reasons. Once you have enough money, start making their dreams come true.\n\nLike, suppose they wanted to go to Hawaii but couldn't because of money, then buy tickets for hawaii for their birthday or anniversary gift. Make them happy. \n\nYou can also look for scholarships and get one to ease some of the burden, but I won't suggest a part time job. Keep your focus on your studies, mental and physical health. Score the best and land at a high paying job. Do whatever you want for your parents only then. \n\nI'll tell you about a friend of mine who overthought about this issue. \nI once knew a girl who felt so guilty that she withdrew from mess service provided by college and instead started eating only two times a day and ate cheap junk food, so that she can \"save\" some of the money her parents are spending on them despite having medical issues such as chronic headache and tonsilitis. Shortly, she grew weak, lost weight and couldn't even study properly but she kept going on and got the lowest possible marks in her entire college life. She didn't even tell her parents about this. I tried making her talk to a therapist but she kept declining. She got super depressed after that.\nNo parent would want this for their child. Poor girl. \n\nDO NOT BE THAT GIRL, DON'T THINK YOURSELF TO DEATH ABOUT THIS ISSUE.",
      "author": null,
      "created": 1610276257,
      "upvotes": 3,
      "replies": {}
    },
    "gir4jhn": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir4jhn/",
      "text": "> I hope to pay them back one day but they said they wont take any of my money\n\nSpend a lot of time with them. Maybe treat them to a nice breakfast/dinner every once in a while once you are financially  stabilized. At the end of the day a good parent wants to sacrifice for their child. Why else would they have one? It makes me sad that there are some bad parents that throw their kids away. \n\nI am paying for all of my university solo, but my family still sacrifices for me in other helpful ways. \n\nThe way I dont feel guilt is by vowing to somehow return the favor to someone else one day. Even if I dont have kids, Ill for sure know a kid and Ill help them out. Hell I can help out my siblings. Make sure we are all alright. I know my parents would not want it any other way.",
      "author": null,
      "created": 1610275625,
      "upvotes": 3,
      "replies": {}
    },
    "gir3sf7": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir3sf7/",
      "text": "I feel bad as well which is why I put a lot of pressure on myself this last semester. Granted, at one point I had 2 Cs, but I managed to somehow bring one up to a B and I just did pass/fail on the C. I feel like if I don't do well, I'm just wasting this incredible opportunity my dad's given me. Because of covid I decided to not get involved in research (I'm also a freshman). Plus, apparently next semester in bio there will be a time when we learn about how to get involved in bio research, so imma hit up that opportunity.\n\nOverall though, I feel guilty because so many people can't go to the college they want due to financial issues. My parents have done so much for me, especially my dad, and I don't think I'll ever get a chance to repay him. I'm scared because he has cancer that's probably terminal. I'm afraid that his death will impact my grades, which is going against this whole opportunity",
      "author": "Isekai_Trash_uwu",
      "created": 1610274858,
      "upvotes": 3,
      "replies": {}
    },
    "gir3jw1": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir3jw1/",
      "text": "As someone who's parent's died, whose inheritance is my life savings and paying for most of my food, college, past times, I've faced a similar question from my half-sister. Whether I'm spending \"my dad's money\" correctly? If I should be out getting a job and being a \"real adult\" to pay for my good, games, rent. I know she just doesn't wanna see me blow through all my savings I've been given but, man is it a depressing guilt trip. \"Would my dad/mom approve of how I'm spending this money, or living my life?\" \n\nI'd say, once it's been given to you, you shouldn't feel guilty on how you spend/use it. If they give you money for college, just enjoy the opportunity you have that many others don't. Make the most of it. \n\n(btw, wouldn't say this to her face, but sis. I think dad would just be proud I'm making it through college with friends and a plan for a career. Of course, if he were here, whether he helps me financially with college would be up to him. And I, out of necessity, would probably have a college job to support me too. But, I'm just making the most out of my opportunity to enjoy my college life, with the knowledge that my budget DOES support my spending with enough savings left for emergencies when I finally get to my career.) - sorry for the rant Reddit, she's been on my back about this for years. 🙃",
      "author": "HeadlockKing",
      "created": 1610274607,
      "upvotes": 1,
      "replies": {
        "gir3vqo": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir3vqo/",
          "text": "As for paying back OP, make a list. I have a list of people that helped me along the way I plan to pay back when I've started my career. Via..\n- Thoughtful gifts/things they need\n- Visiting Often\n- Taking them out for food\n- Helping them with projects around the house \n- Just a nice cash bonus when I've finally got a stable income + living condition. \"Hey u/HeadlockKing's boss who gave him a summer contracting job on short notice. Here's an envelope with 2000$. You supported me when I was struggling so, it's the least I can do to thank you back. Wanna go get some food?\"",
          "author": "HeadlockKing",
          "created": 1610274952,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gir3hd6": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir3hd6/",
      "text": "I feel worse that I'm paying it myself.",
      "author": "LewisLegna",
      "created": 1610274534,
      "upvotes": 3,
      "replies": {}
    },
    "gir3e3y": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir3e3y/",
      "text": "I was in the same boat 21 years ago. And it weighed heavy on me especially when I was struggling with some of my engineering classes, I remember getting bad grades on an exam made me think I was such a waste of resources and the money could have been helping my family with other things.\n\nI suffered alone at the time because I didn't want to be more of a burden. Years later after I graduated and my mother was sharing pictures of my graduation with a friend of hers and she had a beaming smile while talking about them sending me to get my education.\n\nAfter the friend left, I told my mother how I was struggling at the time and of the guilt I felt about them spending all the money on me. I was speaking fast and was avoiding eye contact since mental feelings and such isn't really a thing you talk about because of the negative connotation that comes with. When I finally looked up to see her reaction, I just saw tears running down her cheeks which kind of freaked me out a little (my mother is very strong woman). She just hugged me and said she didn't know I struggled in that way with it, and she said that me getting an education and doing better in life than they did is the dream of all parents.\n\nI then told her that it was so much money at the time, she said yes but it was one of the best investments they made in providing us kids with an education. She then told me I would understand when I have kids of my own. Then she hit me in the feels when she said that the fact that I cared that much about them and their time and money, means the combination of parenting and education had created a good thoughtful person. Then being my mother and realizing I was tearing up, she started teasing about when I will give her grandchildren.\n\nI teared about a little now thinking about all of that. My baby daughter is in her crib a few feet away from me, and now I understand what my mother is talking about. I make good money and would be totally okay living in a van by the river if it meant giving all my money and resources to help my daughter do better in life.\n\nSo, the best thing you can do is keep doing well in school and improving your life, because the joy you give them from that is immense even if you don't realize it.",
      "author": "vtmoon",
      "created": 1610274440,
      "upvotes": 17,
      "replies": {
        "gixcysk": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gixcysk/",
          "text": "You would live in a van [down by the river?](https://www.youtube.com/watch?v=Xv2VIEY9-A8)",
          "author": "comped",
          "created": 1610398944,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gir2ya0": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir2ya0/",
      "text": "Honestly? Go see a therapist. It sounds like you're obsessing about these things to the point of unhealthiness.",
      "author": "MissWatson",
      "created": 1610273981,
      "upvotes": -15,
      "replies": {
        "girmrkn": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girmrkn/",
          "text": "This is completely normal. It is toxic and immature of you to say this.",
          "author": "bambiamberam",
          "created": 1610291114,
          "upvotes": 3,
          "replies": {}
        },
        "gistcng": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gistcng/",
          "text": "Oh, you got that impression from one Reddit post? Good god—Elastagirl would hurt herself with that stretch you just made.",
          "author": "AnStudiousBinch",
          "created": 1610313202,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gir28d1": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir28d1/",
      "text": "Be the best version of you you can be and that's all they will ever need to feel rewarded. Its good you have a conscious and they know your appreciative. Beyond that dont feel guilty just appreciation by doing things to help them down the line.",
      "author": "number7infamilyof6",
      "created": 1610273236,
      "upvotes": 2,
      "replies": {}
    },
    "gir1znx": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir1znx/",
      "text": "Listen friend, I had to get into debt in order to attend college. My family was not able to give me a single penny for my tuition because they simply couldn't afford it. You're probably gonna hear this a lot but you need to be grateful for what you have. Your parents are literally giving Life to you in a silver platter. The way you wrote this post makes you seem like a privileged individual looking for an excuse to feel like you're \"struggling\" like the rest of us.",
      "author": "DaDudeNextToYou",
      "created": 1610272994,
      "upvotes": -7,
      "replies": {
        "gis186c": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gis186c/",
          "text": "I think you need to see a therapist",
          "author": "tejaslikespie",
          "created": 1610299006,
          "upvotes": 0,
          "replies": {
            "giskzyr": {
              "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giskzyr/",
              "text": "Why would I need a therapist?",
              "author": "DaDudeNextToYou",
              "created": 1610309231,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gir0wyt": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir0wyt/",
      "text": "They chose to have you why should you feel guilty",
      "author": "OmegaApple",
      "created": 1610271904,
      "upvotes": 5,
      "replies": {}
    },
    "gir0bm3": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir0bm3/",
      "text": "Yep i feel bad even though my parents are just essentially giving me a 0 intrest loan and financial aid has pretty much cut my costs in half",
      "author": "KebDoesTheStuff",
      "created": 1610271297,
      "upvotes": 4,
      "replies": {}
    },
    "giqxl49": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqxl49/",
      "text": "Be thankful that your parents love you and were able to save up money for you to go to college. There are many students that are not as fortunate. \n\nYou should only feel guilty if you aren't taking college seriously and start failing classes when your parents are paying for it.",
      "author": "MaxMonsterGaming",
      "created": 1610268552,
      "upvotes": 12,
      "replies": {}
    },
    "giqx258": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqx258/",
      "text": "Ha no don't feel bad. Enjoy the joys of higher education without worrying about crippling debt and working in college like the most of us. You're parents are doing this for you because they love you and have the chance to afford to this.",
      "author": "Slyis",
      "created": 1610268034,
      "upvotes": 7,
      "replies": {}
    },
    "giqwih3": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqwih3/",
      "text": "Yes. I feel guilty that my parents have sunk so much money into my education, health and well-being that it’s the reason why I’m *very* stubborn about being independent and paying for what I can. I asked my mom how I should pay them back and she just says that when I get my degree and have a decent enough job where I can afford to travel like I want to someday, I should take her along on my trips. My dad says that I should just remember to visit and call every other day to update them on my life.\n\nParents just want to see their kids happy and successful. Just helping out wherever you can and showing a little gratitude for all they do for you is enough. When you get your degree and find a job, talk it up to your parents and tell them all about it, and thank them for helping you get this far. They’ll be happy that you’re happy",
      "author": "K3yB0ard5eizur3",
      "created": 1610267505,
      "upvotes": 35,
      "replies": {}
    },
    "giqw39n": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqw39n/",
      "text": "Hey I was in the same position as you. I tried my best to graduate within 3 years double majoring (and i did just last quarter!). I wanted to save my parents' money. I looked for a part time job so I can cover my own living and food expenses while they only covered solely my tuition, or I would feel even worse. Now that I am graduated, I still do feel bad because I do not have a job currently and am living under their roof. I cook for them and clean for them because I felt bad for being out of the house for so long and having nothing to repay them. I know they worry about my job and future so if I were to go back, I wished I tried even harder in school than worrying about financial issues. I kept worrying that my parents are stressing over my tuition and I felt horrible so i would work many hours of my part time job along with school and barely eat because I needed the money to pay rent. \nYou can repay them back in the future. Our parents #1 thing that breaks them is seeing their own children struggle. Your worries are normal and maybe one day you guys can sit down and talk about them. For now, I would invest your time in school and that internship lined up! Make your parents proud with your achievements.",
      "author": "Fuuwawa",
      "created": 1610267100,
      "upvotes": 6,
      "replies": {}
    },
    "giqv2qe": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqv2qe/",
      "text": "I’m the daughter of an immigrant family as well my dad always told me his goal in this country to know that everything was worth it was me and my brothers getting into college and graduating , I’m the youngest and I got in and my dad is paying and one day I’ll be able to repay him for all he’s done. Be grateful not too many parents can do that or are willing too and one day you can pay your family back that kindness",
      "author": "hollow_ling12",
      "created": 1610266126,
      "upvotes": 3,
      "replies": {}
    },
    "giquyy0": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giquyy0/",
      "text": "I'm in the same boat you are except that I still work because I made financial choices that I don't expect nor want them to take care of. They said the deal was that they'll keep paying so long as I actually stick to my degree and don't drop out again (which I did the first time due to a massive mental breakdown and the second time to help out the family when my older sister was unfortunately diagnosed with cancer). \n\nOne of the things mom told me recently is that it'll all be worth it when they see me finally walking to get my degree and they can show off to their friends that both their kids are college educated (something both of them value very much because they grew up in communist Cuba and my dad had to drop out at 14 to help feed his family). It'll all be worth it in the long run, dear, and I think the best way to say thank you is not only by keeping up your grades and doing the best you can, is by taking care of yourself and make sure you're doing okay and if you'd like, do little things here and there around the house for them. They only want the best for you and anything you can do/contribute will be much appreciated.",
      "author": "fallenlatest",
      "created": 1610266028,
      "upvotes": 4,
      "replies": {}
    },
    "giquw2q": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giquw2q/",
      "text": "No because they aren’t paying",
      "author": "NoSpaceAlien",
      "created": 1610265954,
      "upvotes": 4,
      "replies": {}
    },
    "giqubsg": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqubsg/",
      "text": "Not an immigrant parent but we are paying for our student’s college education as well.  We’re making sacrifices so we can pay but wouldn’t have it any other way.  We don’t want to saddle our student with a huge amount of debt, plus parent love, plus our own experiences with debt led us to this decision.  My advice, take the gift and give back love and whatever else your parents value.  Our student has said and written us some pretty awesome things during their college experience.  Parenting is a really weird, emotional and unexplainable journey.  Sometimes we make choices that don’t make sense from a logical standpoint but make sense from the heart.",
      "author": "savvyj1",
      "created": 1610265427,
      "upvotes": 143,
      "replies": {
        "girf2wb": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/girf2wb/",
          "text": "Great answer. I’m a parent too who desperately wants to fund both my kids college. Debt is a dirty word to me and I don’t want them to have any. It has taken years of sacrifice, watching other families go on huge yearly vacations while we stay close to home, and the sacrifices will continue. My husband kind of disagrees to the point that I might have to ask them to find like $3000 a year to keep him feeling good about it. \n\nTo the op, THANK YOU for your attitude and your sense of gratefulness! Please always tell them of and show them with your appreciation. When you have a great family, visit them often with their grandchildren!!",
          "author": "do-over47",
          "created": 1610285619,
          "upvotes": 34,
          "replies": {}
        }
      }
    },
    "giqu9lh": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqu9lh/",
      "text": "Yep im one semester in and im pretty sure im wasting their money and gonna turn into a disappointment",
      "author": "This_is_a_sckam",
      "created": 1610265369,
      "upvotes": 5,
      "replies": {
        "giu97ug": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giu97ug/",
          "text": "you're not going to disappoint them if you try your hardest to do well in classes! They understand this is not the easiest time to go to college. you're not a disappointment. it's easy to feel guilty when it isn't going well, but if you know you're trying as hard as you can, then you are not a disappointment! <3",
          "author": "beepbopboopbop69",
          "created": 1610338795,
          "upvotes": 1,
          "replies": {
            "giujlwl": {
              "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giujlwl/",
              "text": "Thanks, thats really nice but the thing is I dont try my hardest. Im extremely lazy and never have any motivation. I barely passed last semester, i actually skipped 2 of my finals",
              "author": "This_is_a_sckam",
              "created": 1610345405,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "giqu2ey": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqu2ey/",
      "text": "As a student that has parents that aren’t helping pay for college don’t feel guilty. If your parents can/ are willingly to help you appreciate it!",
      "author": "Midnighttonigght",
      "created": 1610265183,
      "upvotes": 82,
      "replies": {
        "gir8yek": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gir8yek/",
          "text": "Exactly! Not all of us have that privilege and we should be grateful",
          "author": "Plouka_97",
          "created": 1610280079,
          "upvotes": 27,
          "replies": {}
        }
      }
    },
    "giqtsta": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqtsta/",
      "text": "I feel the same way with my dad as well. He pays for my education (I live at home though) and it’s not cheap... He just wants me to be happy and not have to worry about debt like he did, so I know the best way I can repay him is doing well in school and striving for what I want. \n\nAlso, my personal goal is being successful enough in life that if he needs me to help take care of him (nursing home, place to live, etc.) I can afford to do that for him. He’s done a lot for me and I think it’s only the minimum amount that I could pay him back 🥰",
      "author": "Vig_Big",
      "created": 1610264936,
      "upvotes": 5,
      "replies": {}
    },
    "giqtp3k": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqtp3k/",
      "text": "Everyone comes from a different path in life; some have been given money and others have been given other stuff like great family, extraordinary skills, other stuff etc. What only matters is how you can use what you have been given and put it to good. I think you're doing good so far :)",
      "author": "PakiMan10",
      "created": 1610264843,
      "upvotes": 5,
      "replies": {}
    },
    "giqt38w": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqt38w/",
      "text": "Your parents love you enough and are able to support you. My parents foot about 50% of living expenses (bills, food, etc) but I’m paying for the college part, getting a degree that’s useless and will be in debt for. Your smart SnD your parents are kind to use the resources they have.",
      "author": null,
      "created": 1610264289,
      "upvotes": 5,
      "replies": {}
    },
    "giqrn64": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqrn64/",
      "text": "I'm paying for my own college. But I still feel that way sometimes.",
      "author": "jackfrostyre",
      "created": 1610263016,
      "upvotes": 8,
      "replies": {}
    },
    "giqraul": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqraul/",
      "text": "Same here and it's that appreciation that I think keeps me moving forward when things get tough and hectic.",
      "author": "big_tuna6",
      "created": 1610262722,
      "upvotes": 3,
      "replies": {}
    },
    "giqo56k": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqo56k/",
      "text": "Don’t have that problem. My dad is a doctor and doesn’t pay for my college. I just accept it at this point. I am happy for you though.",
      "author": "famous_shaymus",
      "created": 1610260166,
      "upvotes": 1,
      "replies": {}
    },
    "giqlju4": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqlju4/",
      "text": "There's no need to feel guilty. Like other's have mentioned, your parents obviously love you very much and don't want you to be burdened and held down by student loans later in life. If you really want to try and help out, you could always research local scholarships for your college so a little bit of your tuition is handled. If you already have researched and applied for scholarships, just make sure your parents know that they're appreciated.",
      "author": "gingereIIa",
      "created": 1610258225,
      "upvotes": 1,
      "replies": {}
    },
    "giqk2bv": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqk2bv/",
      "text": "I’m in pretty much the same boat here. Even after getting married and starting graduate school, my parents are still covering my education and related expenses and I still feel a lot of guilt about it. Despite the fact that my parents are pretty well-off and they started saving for my education when I was born, I still have a deep feeling that I should take some responsibility for myself. I’ve talked a lot about it with my mom and honestly just telling her how I feel has really helped me deal with it. It kind of allowed her to tell me why it was important to her to do this for me. I know they wouldn’t want me to pay back the money they’ve spent directly but my hope is that one day I can make enough money to give some nice things back to them, maybe I’ll buy them a vacation one day or help them out with something they need. I don’t think there’s really a way to be totally free of the guilt but it helps me feel better to be committed to doing something good that benefits my parents someday.",
      "author": "QueenOfEndor21",
      "created": 1610257160,
      "upvotes": 9,
      "replies": {}
    },
    "giqjm0p": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqjm0p/",
      "text": "No that is what is expected of parents if they can afford it. You pay them back by doing the same for your children",
      "author": "FeistyHelicopter3687",
      "created": 1610256841,
      "upvotes": 130,
      "replies": {
        "giqs091": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqs091/",
          "text": "yep, this. you work hard now and take advantage of what they did for you. then you provide a good future for your children and set them up well. take care of your parents when they're old too!",
          "author": "AshingtonDC",
          "created": 1610263335,
          "upvotes": 59,
          "replies": {}
        },
        "giqp19h": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqp19h/",
          "text": "This^",
          "author": "no_names_availablee",
          "created": 1610260853,
          "upvotes": 21,
          "replies": {}
        }
      }
    },
    "giqjf7v": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqjf7v/",
      "text": "They are supporting you because they are your parents and they are financially able to. Part of being a parent is investing in your child's success and independence. You'll probably do the same if you are a parent one day.\n\nYour parents likely also realize that it's much easier for them to bear the burden of tuition as opposed to you having to repay all those loans when you are just starting out with no savings and (possibly, depends on major) not a lot of income. They are much older and presumably the payments have (comparatively) much less of an impact on them.\n\nYou can show appreciation by treating their investment seriously: graduate and do something meaningful. Perhaps make a name for your family if one isn't already out there.",
      "author": "br1039",
      "created": 1610256712,
      "upvotes": 21,
      "replies": {}
    },
    "giqh77j": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqh77j/",
      "text": "I used to feel guilty about it, but my dad kept telling me \"it's like I'm your employer and I'm paying you in the form of college tuition.\" He would explain that it was an investment he was making; he spends a large sum of money on me now so he's not paying for my living expenses for the rest of my life. The sooner I get my degree, the sooner I move out and am no longer financially dependent and leeching off my parents. I don't come back to them with my problems seeking help; they can live worry free and spend 100% of their money on them in the future.",
      "author": "pumpkin-jesus",
      "created": 1610255217,
      "upvotes": 300,
      "replies": {
        "gisl3s0": {
          "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/gisl3s0/",
          "text": "Yup, my grandparents paid for part of my college and I felt like I had to go well to make good of their money, it would be insulting if I failed and wasted their investment.",
          "author": "aj_thenoob",
          "created": 1610309284,
          "upvotes": 16,
          "replies": {}
        }
      }
    },
    "giqh2uq": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqh2uq/",
      "text": "Show you appreciation in other ways. Help around the house when you’re home. Make dinner, surprise them with yard work, etcetera. Express your gratitude with patience, kindness, and respect. I think that’s key in your situation",
      "author": "perspiredpedestrian",
      "created": 1610255139,
      "upvotes": 402,
      "replies": {}
    },
    "giqcwoi": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqcwoi/",
      "text": "Same",
      "author": "lovejilly7",
      "created": 1610252633,
      "upvotes": 5,
      "replies": {}
    },
    "giqbhwt": {
      "link": "/r/college/comments/ku70sj/anyone_else_feel_guilty_that_their_parents_are/giqbhwt/",
      "text": "Your parents love you, and don't want you succumbing the the lifelong debt of student loans that so many fond themselves struggling with. \n\nThe best thing to do is what they saod-continue doing your best to succeed so you can set yourself up with a decent job. To graduate with no student loans is something you will learn to appreciate as you get older. Don't feel guilty at all, they are saving you from so much future stress.",
      "author": "JH1515",
      "created": 1610251852,
      "upvotes": 773,
      "replies": {}
    }
  },
  "updated": 1634056588
}