{
  "sid": "r2eiv3",
  "link": "/r/college/comments/r2eiv3/pell_grant_question/",
  "title:": "Pell grant question.",
  "text": "Ok so I received a pell grant for my community college. My question is will I be able to get books and a laptop with whatever left I don’t use for the semester?? I can’t afford books and I need a laptop for my classes. Also I’m a single mom so I kind need daycare too and my college offers daycare for full time students. Can I use my pell grant to help pay for that as well or no?? I don’t really know the logistics of all this so any help would be great",
  "author": "Capital-Scene3221",
  "created": 1637900003,
  "updated": 1638206939,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hm49pfy": {
      "link": "/r/college/comments/r2eiv3/pell_grant_question/hm49pfy/",
      "text": "Yes, I used my remaining Pell money on books and a laptop since both can be classified as necessary educational costs. I can't speak on the daycare aspect, but someone at the college (financial aid department for sure, possibly the daycare department though they just make send you to financial aid to cover themselves) would know the answer to that for sure.",
      "author": "advicegiving25",
      "created": 1637900678,
      "upvotes": 3,
      "replies": {}
    },
    "hm4ea25": {
      "link": "/r/college/comments/r2eiv3/pell_grant_question/hm4ea25/",
      "text": "Yep, those grants are supposed to be used for school and living expenses. No one will track what you actually use it for.",
      "author": "SnowOverRain",
      "created": 1637903392,
      "upvotes": 3,
      "replies": {}
    },
    "hm5djxc": {
      "link": "/r/college/comments/r2eiv3/pell_grant_question/hm5djxc/",
      "text": "Yes.\n\nthis and all other questions you may have about anything related to financial aid can be answered by your school's financial aid office.",
      "author": "lucianbelew",
      "created": 1637930532,
      "upvotes": 1,
      "replies": {}
    }
  }
}