{
  "sid": "a5yuda",
  "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/",
  "title:": "Do you crave breaks during the semester and want class during breaks?",
  "text": "So finals just finished and I am waiting for my grades to come in. I feel confident in my finals, nothing too shocking and come to realize I am going home and getting a break. And I don't want it to come, I want to continue classes and learning rather than being bored at home and doing nothing besides working. \n\nAll through the semester, I wanted to not have anything and be on break to relax but right now I want to go to class and do work.\n\nAm I alone in this feeling? ",
  "author": "brotallyswagical_",
  "created": 1544742555,
  "over_18": false,
  "upvotes": 1005,
  "upvote_ratio": 0.97,
  "comments": {
    "ebt374w": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebt374w/",
      "text": "I get this feeling during the end of break, towards the end of break I want to go back to college and be in the classroom and meet new people, but towards the end of the semester I can't wait to go back home",
      "author": "Carloverguy20",
      "created": 1544827229,
      "upvotes": 1,
      "replies": {}
    },
    "ebshykh": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebshykh/",
      "text": "If all of you guys don’t like breaks look into classes you can take during the breaks... ",
      "author": null,
      "created": 1544811027,
      "upvotes": 1,
      "replies": {}
    },
    "ebs9npx": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebs9npx/",
      "text": "oh God yes, I'm the same way. our winter and summer breaks are long af too. My finals end next Friday and then I don't start the next semester until March 1st, and then we end in June and start September 1st. What to do for 2 and a half months besides work, if i'm not enrolled in the winter/summer semester course? I have to really motivate myself to study on my own and stay busy and not fall into lazy habits. Working a lot to save a ton of money helps, but it doesn't feel like a break. And during the semester all I want to do is sleep and hate going to class. And i think it's because I never really get a \"break\" from everything, ever. I'm too broke to go traveling or take on unpaid internships and I have my rent and tuition to pay on my own, so it's pretty rough. But sometimes I really like some of my courses, or the fact that maybe i didn't do so well during the semester in one course motivates me to want to be more studious or do my own side-reading on something. I feel like i'm not getting the education I'm paying for usually, which doesn't help motivation, and I'm constantly burnt out and sleep-deprived and improperly fed lol.  \n\n\nDuring the breaks too we can't always be around our friends so easily like during the semester so it's easy to feel bored or lonely.   \n\n\nWhat's worked best for me under these circumstances - I'm in my 5th year so i've had a lot of time to figure some things out - is getting into a routine. If that includes a part-time job, set a schedule for yourself and try your best to stick to it. Make time for yourself too, like for exercising, meeting friends, self-study, reading, Netflix, other hobbies you like to do, and try to get into a normal sleep schedule so you can recharge and start the next semester off on a good foot. ",
      "author": "khaleesi_onthatbeat",
      "created": 1544805337,
      "upvotes": 1,
      "replies": {}
    },
    "ebs64wu": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebs64wu/",
      "text": "No I just graduated and am never looking back. Fuck school ",
      "author": "BroJobs88",
      "created": 1544803537,
      "upvotes": 1,
      "replies": {}
    },
    "ebs1c8j": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebs1c8j/",
      "text": "Same! I think it's because before finals, we study and immerse ourselves in our classes and then it's taken away and we have literally nothing else to do. Whereas during the semester, we will study our asses off and the have to study our asses off and then have to... Etc. It doesn't end, lol",
      "author": "Seattle1213",
      "created": 1544801271,
      "upvotes": 1,
      "replies": {}
    },
    "ebrin93": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebrin93/",
      "text": "That's why either winter/summer classes or study abroads are great.",
      "author": "IAmBecauseofPan",
      "created": 1544791421,
      "upvotes": 1,
      "replies": {}
    },
    "ebr8s3i": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebr8s3i/",
      "text": "for me at least i want the social factor of school but the relaxation of being on break.",
      "author": "Bryceroars",
      "created": 1544775149,
      "upvotes": 1,
      "replies": {}
    },
    "ebr6nd8": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebr6nd8/",
      "text": "I thought about this today, I had the pleasure of having a fantastic professor last semester, yesterday I was like, what the hell am I going to do all day haha.",
      "author": "California-hiker",
      "created": 1544771935,
      "upvotes": 1,
      "replies": {}
    },
    "ebr3zrh": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebr3zrh/",
      "text": "I also always want things that I dont have and hate the things that I do have",
      "author": "xaos9",
      "created": 1544768238,
      "upvotes": 1,
      "replies": {}
    },
    "ebr2uua": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebr2uua/",
      "text": "I finished my last final of the semester today and I came home and started watching Crash Course for the Organic Chemistry class I'm taking next semester. xD I feel it too. ",
      "author": "AspireandAchieve",
      "created": 1544766868,
      "upvotes": 1,
      "replies": {}
    },
    "ebr2ipb": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebr2ipb/",
      "text": "I miss the sense of productivity that comes with classes, but being able to actually sleep is pretty awesome.",
      "author": "grumpy_flareon",
      "created": 1544766488,
      "upvotes": 1,
      "replies": {}
    },
    "ebr22vj": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebr22vj/",
      "text": "I take some time to adjust. Once you're accustomed to high levels of productivity, it can feel empty to stop. It happens to me every time. I have found that one good way to fight this is to read during the break. It can feel accomplishing and also be stimulating for the mind.\n\nOf course you don't have to read. But I think the trick is to find something worth doing that makes your mind work at least a little bit.",
      "author": "grahamalondis",
      "created": 1544766012,
      "upvotes": 1,
      "replies": {}
    },
    "ebqzh5k": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqzh5k/",
      "text": "I really don’t have this feeling. I just finished 18 credit hours of all math/science/engineering courses. Exhausted myself studying for finals, and am looking forward to a month of freedom before I do it again. \n\nI like learning, and it’s very fulfilling to get good grades, but man I’m burnt out from this semester.",
      "author": "TheOneScroogeMcDuck",
      "created": 1544763287,
      "upvotes": 1,
      "replies": {}
    },
    "ebqzap8": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqzap8/",
      "text": "Go out with family or friends, play video games, watch tv shows, movies, anime... anything for me is better than writing reports and doing hws ",
      "author": "dates_juice",
      "created": 1544763100,
      "upvotes": 3,
      "replies": {}
    },
    "ebqz2z5": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqz2z5/",
      "text": "I get bored during breaks. I just graduated. Time to find a hobby..and a job I guess.",
      "author": null,
      "created": 1544762882,
      "upvotes": 1,
      "replies": {}
    },
    "ebqz0sf": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqz0sf/",
      "text": "Yep. I get bored a week into break. ",
      "author": "favnh2011",
      "created": 1544762822,
      "upvotes": 1,
      "replies": {}
    },
    "ebqx533": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqx533/",
      "text": "I can honestly say that I don't really understand your experience. I'm able to entertain myself, so I don't really end up craving things I know I won't enjoy just so I won't be bored. I sometimes end up wanting to get back to class, but that's just wanting to take a class, not wanting to avoid boredom.",
      "author": "onlytoask",
      "created": 1544761166,
      "upvotes": 2,
      "replies": {}
    },
    "ebqus6t": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqus6t/",
      "text": "Nope lol i enjoy laying in bed all day and planning trips and going out🙃",
      "author": "Linabearr",
      "created": 1544759081,
      "upvotes": 2,
      "replies": {}
    },
    "ebqtgqa": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqtgqa/",
      "text": "Yeah I dont know what it is about blowing something important off that makes what you are doing to blow off said important thing more entertaining. During classes I am addicted to TV but when I have a break I couldn't care less about it.",
      "author": "macattackk1",
      "created": 1544758037,
      "upvotes": 1,
      "replies": {}
    },
    "ebqtgk7": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqtgk7/",
      "text": "Yep, good example would be the fires we just had. Although the 2 weeks off was nice, it was also kinda boring.",
      "author": "Mawmi-Rawks",
      "created": 1544758034,
      "upvotes": 1,
      "replies": {}
    },
    "ebqs5bv": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqs5bv/",
      "text": "Yea it’s weird, I’m waiting for one grade and I am relieved my 19 hours are over but my final for calculus was one of those 50:50 pass fail ratio, so I’m kinda NERVOUS AF RN tbh because if I didn’t pass the final then I’m not graduating tomorrow\n\nShit got me FUCKED up \nBut I know exactly what you mean lol ",
      "author": "TheAstroPickle",
      "created": 1544756981,
      "upvotes": 1,
      "replies": {}
    },
    "ebqremd": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqremd/",
      "text": "i feel you",
      "author": "What-the-heck-Craig",
      "created": 1544756374,
      "upvotes": 1,
      "replies": {}
    },
    "ebqr3ai": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqr3ai/",
      "text": "I'm taking an online winter class to save my sanity but give me some freedoms of a break still",
      "author": "garishthoughts",
      "created": 1544756100,
      "upvotes": 1,
      "replies": {}
    },
    "ebqqaw5": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqqaw5/",
      "text": "Yes. It’s the classic you want to be where you’re not. When I’m at university I want to be at home and when I’m home I wanna be back at university ",
      "author": "oceans09",
      "created": 1544755401,
      "upvotes": 1,
      "replies": {}
    },
    "ebqpk4w": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqpk4w/",
      "text": "Man, I work full-time and I don’t know what to do with my time when schools on break. ",
      "author": null,
      "created": 1544754763,
      "upvotes": 5,
      "replies": {}
    },
    "ebqnrnc": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqnrnc/",
      "text": "Get additional training through Lynda.com, Udemy, or your certification center of choice (SANS, CompTIA) during your free time.",
      "author": null,
      "created": 1544753235,
      "upvotes": 5,
      "replies": {}
    },
    "ebqnefk": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqnefk/",
      "text": "I realized today how effing bored I’m going to be for the next month. What do kids normally do? What do people DO with their free time? What TV do I start watching?",
      "author": "mackys",
      "created": 1544752909,
      "upvotes": 1,
      "replies": {}
    },
    "ebqne6s": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqne6s/",
      "text": "Yes. Thanksgiving break was okay, but this whole month is going to be so boring. My fiancé and i are lucky enough that my fiancé has a great income so i don’t have to work and i can focus on my studies but that leaves me with nothing to do during breaks this long. College has been so much better than high school ever was. I can confidently say that i absolutely love college and i love my major. I wish they had “winter classes” like they do summer ones, haha ",
      "author": "livinlife00",
      "created": 1544752904,
      "upvotes": 8,
      "replies": {}
    },
    "ebqn0x8": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqn0x8/",
      "text": "No, I would rather there be semesters and classes available 24/7 so i can finish a 4 year degree in 1 year and be on my merry way.",
      "author": "RandomStudentHere",
      "created": 1544752587,
      "upvotes": 1,
      "replies": {}
    },
    "ebqmybo": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqmybo/",
      "text": "Totally how I felt in college. Particularly because I thought of campus as home, not where my parents lived. ",
      "author": "Laurasaur28",
      "created": 1544752527,
      "upvotes": 1,
      "replies": {}
    },
    "ebqmdc8": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqmdc8/",
      "text": "The great thing about break is that you can literally do whatever you want.  Want to play video games? Do it. Want to be productive? Pick up a book or hobby, learn a skill, or maybe even get a head start on your hardest class next semester. You can do that too.",
      "author": "Nyyocom",
      "created": 1544752029,
      "upvotes": 5,
      "replies": {}
    },
    "ebqly91": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqly91/",
      "text": "I don’t really like going home for these long ass breaks (winter and summer) because it’s just so. Damn. Boring. I am happy to be away from classes and deadlines though so we are opposite on that part lol. I’d much rather spend my breaks in my own apartment with my boys and girls rather than sitting on a couch all day hearing about what books my dad is reading or what my mom plans to cook for dinner. I love my family to death and all so it’s nice to see them I guess. But I do get to see my dogs when I come home so they make it all worth it 😭😭\n\nEdit: Another really nice part of going home is you get to see literally every person you know post pictures of their animals from back home. It’s great.",
      "author": "TallBoy_Ryan",
      "created": 1544751668,
      "upvotes": 2,
      "replies": {}
    },
    "ebqlvs7": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqlvs7/",
      "text": "That's why I haven't taken a real break yet, i.e. longer than 2 weeks. \n\nI figure 2 weeks is enough time to decompress and to get my life together again, but after that, I need work to do every day. Hobbies aren't exactly things I want to be doing all day every day. It doesn't have to be paid work or consistent work, and I'd even count career activities like writing lengthy job applications to be \"work\". It just has to be something constructive. \n\nI did research or networking stuff through all of my breaks. If you really enjoy working then you don't have to take time off. People will eventually start trying to force you to go on an extended break, but if it makes you happy, keep working. ",
      "author": "NoxiousQuadrumvirate",
      "created": 1544751608,
      "upvotes": 3,
      "replies": {}
    },
    "ebqlnnb": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqlnnb/",
      "text": "This is why I started picking up books on things I can start learning during my breaks 😁 but I am on my second day of break and literally did nothing today except catch up on some YouTube videos. ",
      "author": null,
      "created": 1544751410,
      "upvotes": 9,
      "replies": {}
    },
    "ebqkyc7": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqkyc7/",
      "text": "This is why I think that more frequent, shorter breaks are much better than these rare huge breaks. I feel like my mental health would improve by like 1000000%. Longest break should be 2 weeks imo",
      "author": "-Knockabout",
      "created": 1544750807,
      "upvotes": 4,
      "replies": {}
    },
    "ebqku7f": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqku7f/",
      "text": "I love breaks and its the only time of year I can play video games and not worry about school, but yeah month long break can be too much and might be boring. \n\nWhat I do is set myself goals on what I want to do this break. For me I'm using this time to learn video editing and so far its been fun\n\nAlso if you have nothing you can give yourself a head start for next term. Im a CS major so I've been learning C++ because thats the program we are going to use next term and at the moment I have zero knowledge, etc.\n\nEnjoy your break!!! ",
      "author": "mrcipher0",
      "created": 1544750708,
      "upvotes": 4,
      "replies": {}
    },
    "ebqkrzi": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqkrzi/",
      "text": "The book \"power of the habit\" explains this in some sense. When you do an action repeatedly (going to class), you form a habit for it. Then, when you don't do it anymore, your body starts craving it.  \n\n\nWanting a break makes sense too because who doesn't want breaks lol",
      "author": "NotTryingToConYou",
      "created": 1544750656,
      "upvotes": 5,
      "replies": {}
    },
    "ebqkbql": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqkbql/",
      "text": "I get this feeling too. I hate it :D",
      "author": "GodOfThunder101",
      "created": 1544750266,
      "upvotes": 1,
      "replies": {}
    },
    "ebqk900": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqk900/",
      "text": "Why are you taking breaks in the summer? Are there no classes or internships you can take during this time?\n\nEdit: IMO, summer classes are the best time to knock out your gen ed classes that nobody really needs.  Shorter timeline. Most professors relax their standards in the summer.",
      "author": "Inactive_Account",
      "created": 1544750197,
      "upvotes": 4,
      "replies": {}
    },
    "ebqjpbr": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqjpbr/",
      "text": "I mean I work and go to school so maybe that’s why I think you’re crazy! I LOVE breaks because I can come home from work and do something that’s not homework. But I guess if I didn’t work and had nothing to do I might go crazy. ",
      "author": "cupcakescandy",
      "created": 1544749712,
      "upvotes": 3,
      "replies": {}
    },
    "ebqj26c": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqj26c/",
      "text": "I was supposed to graduate in December and am error is causing me to take one class in spring to finish out and I’m dreading it because I’m going to be so bored only taking one class, and also I’m pregnant so I’m most likely not going to be working full time during the spring so I’m going to be extra bored. \n\nI seriously get like a wave of sadness during breaks not having anything to do that’s productive, one can only play video games and clean their apt over and over so many times. ",
      "author": "mxivme",
      "created": 1544749190,
      "upvotes": 13,
      "replies": {}
    },
    "ebqitdg": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqitdg/",
      "text": "Yes, I bought supplemental books to prepare for my next quarter classes. And started going to the cafe as a class for 1hr each to work on them. \n\nIt feels so good. ",
      "author": null,
      "created": 1544748983,
      "upvotes": -1,
      "replies": {}
    },
    "ebqisg4": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqisg4/",
      "text": "The grass always seems greener on the other side! Weird how it works though, huh? ",
      "author": "transferStudent2018",
      "created": 1544748960,
      "upvotes": 10,
      "replies": {}
    },
    "ebqipei": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqipei/",
      "text": "[removed]",
      "author": null,
      "created": 1544748886,
      "upvotes": 52,
      "replies": {
        "ebqvlbz": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqvlbz/",
          "text": "Nah lmao",
          "author": "CaptnAwesomeGuy",
          "created": 1544759773,
          "upvotes": 7,
          "replies": {}
        },
        "ebs53vo": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebs53vo/",
          "text": "The neighbors chicken is in reality a goose. ",
          "author": "NamathDaWhoop",
          "created": 1544803035,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebqi42d": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqi42d/",
      "text": "dude yes. a week is fine, but a whole month for break is insane. i don’t know what i’m going to do (maybe play smash ultimate haha)",
      "author": null,
      "created": 1544748362,
      "upvotes": 73,
      "replies": {
        "ebqign8": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqign8/",
          "text": "I beg your pardon ",
          "author": "daetsmlolliw",
          "created": 1544748667,
          "upvotes": 29,
          "replies": {
            "ebqkm92": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqkm92/",
              "text": "Classes ended 1.5 weeks ago for me. No class until Jan 7th.  So yeah, a full month off.\n\nI'm spending in the gym burning off what I gained stress eating before finals.",
              "author": "Inactive_Account",
              "created": 1544750520,
              "upvotes": 25,
              "replies": {
                "ebqm44t": {
                  "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqm44t/",
                  "text": "Same boat. I get done Tuesday and won’t be back until late(and I mean late) January",
                  "author": null,
                  "created": 1544751810,
                  "upvotes": 9,
                  "replies": {}
                }
              }
            }
          }
        },
        "ebqlpqb": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqlpqb/",
          "text": "Lmao a month? I wish.\n\nTwo and a half weeks for us, and between work and seeing family/friends I won't have one free day lmao",
          "author": "cdoran09",
          "created": 1544751461,
          "upvotes": 17,
          "replies": {}
        },
        "ebsi4an": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebsi4an/",
          "text": "We get six weeks. SIX WEEKS.",
          "author": "caffeineandmath",
          "created": 1544811144,
          "upvotes": 3,
          "replies": {}
        },
        "ebrb1y6": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebrb1y6/",
          "text": "I have to agree with you, my class ended before November, and only start again in early February and I am bored out of my mind.\n(It's end of the academic year where I am)",
          "author": "lordhi",
          "created": 1544779240,
          "upvotes": 1,
          "replies": {}
        },
        "ebsa8ht": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebsa8ht/",
          "text": "my semester starts in March >.<",
          "author": "khaleesi_onthatbeat",
          "created": 1544805673,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebqfduo": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqfduo/",
      "text": "Yes, im taking a stats class over break though that starts in january, 2 weeks, 4 hours a day, when thats done im really gonna be craving a break",
      "author": "lanster77",
      "created": 1544745975,
      "upvotes": 20,
      "replies": {
        "ebqiusx": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqiusx/",
          "text": "I wanted to take a winter break but it doesn’t factor into my financial aid, so I have to stay home. ",
          "author": "CapriciousSalmon",
          "created": 1544749018,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ebqeth7": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqeth7/",
      "text": "I usually enjoy the first few days of the break, but then the feeling of not being productive hits me and makes me want to work again 😅",
      "author": "cmputing",
      "created": 1544745484,
      "upvotes": 89,
      "replies": {
        "ebqitfs": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqitfs/",
          "text": "I would like break if they gave you something to do. It honestly is gonna suck to get a month off. In high school, I feel the week break was good, but they at least gave hw. All college gives is you waiting for the adjunct to post your grades. ",
          "author": "CapriciousSalmon",
          "created": 1544748985,
          "upvotes": 14,
          "replies": {
            "ebv03za": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebv03za/",
              "text": "Can't you just, like, do something yourself? Read a book, practice an instrument, write something, learn a skill?",
              "author": "DrJPepper",
              "created": 1544902794,
              "upvotes": 2,
              "replies": {
                "ebvqs6j": {
                  "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebvqs6j/",
                  "text": "Good point LOL. But it sucks when you don’t have a job or a car or friends so you just sit in the house and do basically nothing but wait for teachers to post your grades. ",
                  "author": "CapriciousSalmon",
                  "created": 1544923298,
                  "upvotes": 1,
                  "replies": {
                    "ebvsdmn": {
                      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebvsdmn/",
                      "text": "I suppose the socialization aspect is true anyways",
                      "author": "DrJPepper",
                      "created": 1544924609,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ebqs5ad": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqs5ad/",
          "text": "There are other ways to be \"productive\". Don't live your life by letting others tell you how to define your success. ",
          "author": "No_more_depress",
          "created": 1544756981,
          "upvotes": 9,
          "replies": {}
        },
        "ebqpdu8": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqpdu8/",
          "text": "this is what I'm afraid of already.",
          "author": null,
          "created": 1544754613,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ebqdw1r": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqdw1r/",
      "text": "No I enjoy my breaks. ",
      "author": "thinkB4WeSpeak",
      "created": 1544744681,
      "upvotes": 201,
      "replies": {
        "ebqmf7s": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqmf7s/",
          "text": "Yea you guys are Wild. I could entertain myself for years without anybody telling me what to do ",
          "author": "wives_nuns_sluts",
          "created": 1544752075,
          "upvotes": 96,
          "replies": {
            "ebr8rdz": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebr8rdz/",
              "text": "Yeah. If I really crave learning I'll teach myself. Otherwise, nah.",
              "author": "kn33",
              "created": 1544775117,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "ebqv9db": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqv9db/",
          "text": "Literally same. I can binge watch hulu, cook myself meals, hang out with friends and family, pet my dog, play video games, literally not get out of bed and put on makeup. Y’all crazy ",
          "author": "Linabearr",
          "created": 1544759484,
          "upvotes": 35,
          "replies": {
            "ebqvp3p": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqvp3p/",
              "text": "People that don't know how to relax are gonna drive themselves crazy lol",
              "author": "eviltj97",
              "created": 1544759864,
              "upvotes": 34,
              "replies": {}
            }
          }
        },
        "ebrbmim": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebrbmim/",
          "text": "What do you do during breaks? I'm at home since 10 days with 20 more to go, I have finally decided to read some books after I felt too bored.",
          "author": "ReggaeMonestor",
          "created": 1544780319,
          "upvotes": 4,
          "replies": {
            "ebrc7x1": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebrc7x1/",
              "text": "Hang out with friends from HS who are back on break like every day. Spend as much time as I can with family. Just things that aren't me just sitting in my room alone",
              "author": "xanfire1",
              "created": 1544781452,
              "upvotes": 5,
              "replies": {}
            },
            "ebrkwjq": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebrkwjq/",
              "text": "Do you have any hobbies? I do art, write, read, practice music, working out (I like yoga and weightlifting, although during the summer I like to go on runs). Teach myself new skills. Go on adventures somewhere. I look for interesting opportunities. During the summer it's more fun because it's not freezing outside. But there's still plenty to do.\n\nThis break I hope to look for scholarships, work on my budget, play music, work on my blog (coding and graphic design), write some poems and short stories, play video games, watch some movies on my list, go to the library, organize my house and room... Hang out with my family. There's too many things for me to do!",
              "author": "wives_nuns_sluts",
              "created": 1544793454,
              "upvotes": 3,
              "replies": {}
            },
            "ebrp3f2": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebrp3f2/",
              "text": "This year I'm going home. Usually I just play video games, read, and hike. ",
              "author": "thinkB4WeSpeak",
              "created": 1544795910,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ebqce5n": {
      "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqce5n/",
      "text": "You are definitely not alone with this. Usually for me I’m ecstatic to begin my winter break until about a week in, and by that point I’m bored to tears.",
      "author": "darth_treyman",
      "created": 1544743403,
      "upvotes": 483,
      "replies": {
        "ebqcn11": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqcn11/",
          "text": "I hated HS and college has been fantastic for me. I’ve actually enjoyed learning and my grades show that!\nI don’t want to leave",
          "author": "brotallyswagical_",
          "created": 1544743613,
          "upvotes": 171,
          "replies": {
            "ebqqs96": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqqs96/",
              "text": "My strategy the last few breaks has been to start reading ahead for next quarter's classes. I always ~~pirate~~ acquire perfectly legitimate electronic copies of my textbooks anyway so it's no big deal to just read them on my laptop while I'm lying around in bed otherwise being useless.",
              "author": "damnisuckatreddit",
              "created": 1544755831,
              "upvotes": 61,
              "replies": {
                "ebqry38": {
                  "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqry38/",
                  "text": "SAME",
                  "author": "TheAstroPickle",
                  "created": 1544756816,
                  "upvotes": 7,
                  "replies": {}
                },
                "ebs9xe2": {
                  "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebs9xe2/",
                  "text": "I wish I could do this! But we don't register for classes until the month before the semester starts, and we don't know if we're in or not until the week before, and then have the first week for add/drop. The professors all suck at uploading their syllabi too so there's no way to know for sure if they are teaching the same course or using the same textbooks or materials. But I definitely think that doing some reading up on a topic, or reviewing material from previous courses that would be relevant to the course is a good idea. In my case I have a lot of foreign language courses, so brushing up on my vocabulary and grammar and such is important. ",
                  "author": "khaleesi_onthatbeat",
                  "created": 1544805494,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "ebqp7z7": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqp7z7/",
              "text": "It’s amazing what happens when you’re actually learning about what you want to learn about",
              "author": "powerofselfrespect",
              "created": 1544754472,
              "upvotes": 21,
              "replies": {}
            },
            "ebr05gv": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebr05gv/",
              "text": "Are you me?\n\nExcept I liked hs, but college is so much more fun ",
              "author": "YAZEED-IX",
              "created": 1544763989,
              "upvotes": 3,
              "replies": {}
            },
            "ebqz0eh": {
              "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqz0eh/",
              "text": "We on the same page brother, actually like college more than HS and I’m enjoying learning more in college than HS and I feel sad when this semester ended now I’m just gonna be on my house doing nothing ",
              "author": null,
              "created": 1544762811,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "ebrh4ps": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebrh4ps/",
          "text": "I realized I felt this way too. I also know that I have a hard time getting back into “school mode” after a month of no productivity. The last few winter breaks I’ve made reading goals for myself so I still have deadlines to meet, plus I can read a good chunk of the books I didn’t have time to read over the semester. 2000 pages in a month might kill my soul though. ",
          "author": "Zeroshim",
          "created": 1544789587,
          "upvotes": 3,
          "replies": {}
        },
        "ebqzmwg": {
          "link": "/r/college/comments/a5yuda/do_you_crave_breaks_during_the_semester_and_want/ebqzmwg/",
          "text": "Yep. I feel that",
          "author": "ca_republican",
          "created": 1544763455,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050560
}