{
  "sid": "q6yghd",
  "link": "/r/college/comments/q6yghd/is_it_possible_to_get_an_inadequate_profesor_fired/",
  "title:": "Is it possible to get an inadequate profesor fired?",
  "text": "\n\n\nI recently started a semester at a local community college and overall my professors are great, except for one. \n\n\nHe’s my intro to IT profesor and I deemed it my most important course prior to starting it. \n\n\nThe profesor is an old man who is retired and has Parkinson’s disease. There are times in class where he will stop talking and shake for a while, though he warns us about this and told us not to get alarmed, everyone still gets on edge from it. \n\n\nHe also starts all the zoom meetings late, I’m currently waiting for him to start a meeting and it’s been 20 minutes since the start time. He then takes 10 minutes to do attendance by role call instead of a poll or automatic. \n\n\n\nHe doesn’t teach throughout the class, he just reminisces how technology used to be and how it has changed so much and that he needs his granddaughter to help him with his computer (not the best thing to hear from your IT professor) \n\n\nLast class and the one before he didn’t teach a single thing. He only went through his emails and told us which of the students homework’s he has received or didn’t. The rest of the time was one of the students going on about how her computer doesn’t work and a ton of students were just talking back and forth about that. \n\n\nIt’s intensely frustrating. My girlfriend says I should be happy I have an easy class that doesn’t assign much homework or require a ton of attention, but I really wanted to learn something in this class and it’s difficult with a professor who doesn’t teach. Is there anything I could do?",
  "author": "RedRockWulf",
  "created": 1634081446,
  "updated": 1634590201,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hgf646u": {
      "link": "/r/college/comments/q6yghd/is_it_possible_to_get_an_inadequate_profesor_fired/hgf646u/",
      "text": "you have legitimate complaint, but do not mention his disability or everyone will instantly assume you are trying to get him fired for that reason and ignore everything else you have to say.",
      "author": "wobbletelescope",
      "created": 1634083331,
      "upvotes": 8,
      "replies": {}
    },
    "hgffpsk": {
      "link": "/r/college/comments/q6yghd/is_it_possible_to_get_an_inadequate_profesor_fired/hgffpsk/",
      "text": "While you can complain, I doubt it will do any good. There are plenty of reasons that courses have underperforming professors. From your description (a retired individual at a Community College who recognizes their shortcomings), the most likely reason is that he's doing a favor for a department that isn't able to find someone else to fill that spot.\n\nHowever, you do seem to be falling into the trap of looking at education as a passive experience rather than an active one. To a large extent, college exists to give you access to the resources you'll need to teach yourself rather than a place where you are 'taught' what you need to learn.",
      "author": "ViskerRatio",
      "created": 1634087787,
      "upvotes": 3,
      "replies": {}
    },
    "hgf4v01": {
      "link": "/r/college/comments/q6yghd/is_it_possible_to_get_an_inadequate_profesor_fired/hgf4v01/",
      "text": "Talk to the chair of the Dept. if no help there find out who the NEXT Professor you’d get would be, and talk to them about your maybe not getting what you’d need and what to do. They may already know you’re going to need extra help coming from that guy’s class.",
      "author": "Interesting-Return-9",
      "created": 1634082743,
      "upvotes": 2,
      "replies": {}
    }
  }
}