{
  "sid": "pwx0hw",
  "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/",
  "title:": "I wish there were no grades",
  "text": "I feel like I’m just doing things for a grade and not learning it. I study so hard for exam because I need a good grade. I haven’t studied because I want to understand. I also BS every assignment and lie about my opinions or whatever so I could get a grade. \n\nOur professor let us have 4 attempts on a quiz. I wanted to learn but I had no time so I just skimmed through parts of the text and found answers in the textbook without reading the chapter.",
  "author": "nathani3l0g",
  "created": 1632797681,
  "over_18": false,
  "upvotes": 186,
  "upvote_ratio": 0.95,
  "comments": {
    "henhmez": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/henhmez/",
      "text": "During the height of the pandemic, some universities implemented a pass/ fail grading scale. This grading scale was a big hit with students and is now a continued option for students who wish to attain a grade outside of the traditional letter grade we have become so used to.",
      "author": "sharksedition",
      "created": 1632868434,
      "upvotes": 1,
      "replies": {}
    },
    "hen0xkv": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hen0xkv/",
      "text": "I would have to disagree with your reasoning.  If someone who has the ability isn't learning, its not because they have to study for tests.  Rather, that person has very little interest or enthusiasm for the the subject matter.  They only care enough to get the grade, not to learn.   \n\nYou are also lying on your papers by telling the professors whatever you think they want to hear.  That will only prepare for you for a career as a sycophantic yes man, which I hope is not your goal.  You instead need to be able to give honest responses, and to know enough to discuss challenges to your opinion in an reasoned manner.",
      "author": "taxref",
      "created": 1632861170,
      "upvotes": 1,
      "replies": {}
    },
    "helq0yh": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/helq0yh/",
      "text": "Most professors hate grading more than anything in life (myself included).\n\n&#x200B;\n\nAdministrators, Dept of Education, and Accrediting agencies love them, and that's where all the money comes from (and goes to).  Whenever trying to \"ungrade\" my courses, the amount of pushback is massive, and this is at multiple colleges.",
      "author": "capital_idea_sir",
      "created": 1632841584,
      "upvotes": 6,
      "replies": {}
    },
    "helh8kp": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/helh8kp/",
      "text": "Try to get your actual opinion in your assignments, if only for your own sanity. Do you worry your political views do not align with what your professors dictate? My experience has been that professors have always been respectful if I have contrarian social/political opinions, as long as they’re not too extreme. Just try to be yourself.",
      "author": "madmax543210",
      "created": 1632837783,
      "upvotes": 3,
      "replies": {
        "hemfe8j": {
          "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hemfe8j/",
          "text": "No nothing political or social. I just make up an opinion that is easy to write about and that clearly can be supported without trying. Like for psychology I had to write about the best theory. I used the simplest topic and wrote about it because it was convenient and really easy to write about. I didn’t think about it much",
          "author": "nathani3l0g",
          "created": 1632852018,
          "upvotes": 1,
          "replies": {
            "henkbwk": {
              "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/henkbwk/",
              "text": ">I used the simplest topic and wrote about it because it was convenient and really easy to write about. I didn’t think about it much\n\nThats probably why you feel like you dont learn anything and that grades are useless, because youre putting in the minimum effort",
              "author": "taybay462",
              "created": 1632869691,
              "upvotes": 2,
              "replies": {
                "henmzy7": {
                  "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/henmzy7/",
                  "text": "But like when there is a bunch of readings you have to do and lecture. There is no time to put effort into your assignments. \n\nIt’s either spend hours on assignments or studying which I would do the latter.",
                  "author": "nathani3l0g",
                  "created": 1632870933,
                  "upvotes": 1,
                  "replies": {
                    "henph65": {
                      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/henph65/",
                      "text": ">There is no time to put effort into your assignments. \n\nThats debatable. How many credits are you taking? How many hours a day do you spend on work outside of class? Im taking 13 credits in a medium difficulty major and I spend 4-5 hours a day on hw and studying. Im in class allll day tuesdays but the rest of the days im done by 2pm or 4pm. Go home and study, take a break for dinner, around 11pm-midnight start watching tv and wake up at 11am for class. Im not only keeping up with class but im ahead. Its doable if you put the time in, if you dont have the time then you need to do less of whatever youre spending time on that isnt school. College is a full time job, treat it as such, spend 8 or 9 hours a day total on it and youll be decent.",
                      "author": "taybay462",
                      "created": 1632872092,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hel2aul": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hel2aul/",
      "text": "You could consider why you have no time and remedy that.\n\nBackwards learning, when you are searching for specific answers is a thing.  \n\nNothing is preventing you from reading the chapter in addition to doing that.\n\nIf you are only doing stuff for a grade, and not doing any of the other stuff that is not getting graded, and complaining that is the fault of a system and not on you, how are grades preventing you from understanding something or truly learning the material.\n\nThose quizes are there precisely for people like you, who do don’t do the practice and readings unless they are compelled to.\n\nThe rest of the grade is there to show that you demonstrated at last X amount of mastery/skill.\n\nWould you not want that from you accountant, your mechanic, the people who work in your Dr office, your Dr.\n\nIf you hire someone who says, yup, i know how to write well enough to be totally on my own here, and here is my transcript to show it, should I better replace that with a happy face sticker?\n\nWhat do you suggest as an alternative?",
      "author": "PersephoneIsNotHome",
      "created": 1632830073,
      "upvotes": 6,
      "replies": {}
    },
    "heklpbz": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/heklpbz/",
      "text": "I agree wholeheartedly. Grades ruin so much passion. A learning forced by grades is worthless,I never could wrap my head around their philosophy.",
      "author": "IR-KINGTIGER",
      "created": 1632816620,
      "upvotes": 0,
      "replies": {}
    },
    "hekiaz0": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hekiaz0/",
      "text": "same. i have spent my time reviewing the materials instead of having an in depth understanding about a certain topic just so i can have a “good grade”.",
      "author": "introvertedandroid",
      "created": 1632813510,
      "upvotes": 4,
      "replies": {
        "hekmmv9": {
          "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hekmmv9/",
          "text": "Alternate viewpoint. If you are in college, especially taking courses at the 100-300 level, you don’t really know anything yet. You do need to memorize quite a bit so that you can have a productive conversation later.  \n \nWhat students often want to do is take a new concept and integrate that into what they already think. That’s not learning.  That’s more like, say, the way the anti-vaxxers think. They take ideas that seem similar and smash them. \n\nLearn the material the way the prof suggests. You will be impressed with yourself and the fluidity of thought that you get.",
          "author": "Awkward_Result6214",
          "created": 1632817502,
          "upvotes": 10,
          "replies": {
            "helq0yx": {
              "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/helq0yx/",
              "text": "thank you, i'll keep this in mind.",
              "author": "introvertedandroid",
              "created": 1632841584,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hek7jnz": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hek7jnz/",
      "text": "When I transfered to a 4 year after getting my AA I went to an online school with no test and it made a huge difference. Learned so much more because grades were based on discussion boards and papers that make you think about a topic and not just memorize random facts. I didn't realize how much I enjoyed learning until I started a school without tests.",
      "author": "wellSoB",
      "created": 1632805502,
      "upvotes": 21,
      "replies": {
        "hel2iy5": {
          "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hel2iy5/",
          "text": "There are many different forms of assessment, including projects and essays and writing , for which you still get grades.\n\nLower level classes and uppper level classes are there for different reasons and different types of learning and have different kinds of assessments.\n\nThey still have grades",
          "author": "PersephoneIsNotHome",
          "created": 1632830210,
          "upvotes": 4,
          "replies": {}
        },
        "hekiqfw": {
          "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hekiqfw/",
          "text": "So lucky. The thing that sucks is those schools with no test will be looked down upon by institutions. I’m sure that a graduating senior will know nothing when they first get their job so exams and grades do not test your knowledge.",
          "author": "nathani3l0g",
          "created": 1632813891,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hek0oh2": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hek0oh2/",
      "text": "You might enjoy this [video--\"Grading is a Scam\"](https://www.youtube.com/watch?v=fe-SZ_FPZew&t=2171s). It is a bit long, but it has a professor breaking down the problem with grades and their negative impact on education.",
      "author": "Coloradical27",
      "created": 1632801241,
      "upvotes": 4,
      "replies": {}
    },
    "hek01lx": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hek01lx/",
      "text": "There are colleges that don’t give grades! Check out Eckerd College in Florida, for example. There’s a college for every learning style and every learning need. But you do have to do some research.",
      "author": "renebeca",
      "created": 1632800891,
      "upvotes": 56,
      "replies": {
        "hekfwrb": {
          "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hekfwrb/",
          "text": "Does everyone automatically get a diploma, how to you “earn” it?",
          "author": "Nofapdeity",
          "created": 1632811525,
          "upvotes": 23,
          "replies": {
            "helnf6y": {
              "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/helnf6y/",
              "text": "Professors write long performance reviews at the end of each class that convert to credits. You need a certain amount of credits to graduate (like any other school).",
              "author": "renebeca",
              "created": 1632840480,
              "upvotes": 13,
              "replies": {}
            }
          }
        },
        "heks7yt": {
          "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/heks7yt/",
          "text": "hey that's Hank Green's alma mater",
          "author": "occamy_kng",
          "created": 1632822617,
          "upvotes": 6,
          "replies": {
            "helnjcc": {
              "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/helnjcc/",
              "text": "It's gorgeous! And has its own beach :)",
              "author": "renebeca",
              "created": 1632840528,
              "upvotes": 2,
              "replies": {
                "helnkns": {
                  "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/helnkns/",
                  "text": ">:)\n\n:)",
                  "author": "tiny_smile_bot",
                  "created": 1632840544,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "hen2wqq": {
          "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hen2wqq/",
          "text": "[deleted]",
          "author": null,
          "created": 1632862020,
          "upvotes": 1,
          "replies": {
            "hen79sd": {
              "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hen79sd/",
              "text": "I have done that, but the students ALWAYS under-graded themselves. So I had to throw it out and regularly grade them anyway. \n\nRelatedly, during the first semester of the pandemic, half my class opted for the P/F option when they would have ended up with As anyway. It was unfortunate.",
              "author": "renebeca",
              "created": 1632863834,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hejv9dy": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hejv9dy/",
      "text": "I 100% know what you’re talking about. I learned the grades don’t matter at the end of the day. In the future we won’t be thinking about a specific test or assignment. As long as we know we tried, that is all we can do. There are so many more important things than grades.",
      "author": "Crafty_Requirement_2",
      "created": 1632798363,
      "upvotes": 20,
      "replies": {
        "hekil99": {
          "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hekil99/",
          "text": "Not unless you need to get into your major. My school we apply for our majors and it is competitive",
          "author": "nathani3l0g",
          "created": 1632813763,
          "upvotes": 8,
          "replies": {}
        }
      }
    },
    "hejv45t": {
      "link": "/r/college/comments/pwx0hw/i_wish_there_were_no_grades/hejv45t/",
      "text": "i feel the same way. i feel like i’m not even really learning anything",
      "author": "etherealpjm",
      "created": 1632798291,
      "upvotes": 7,
      "replies": {}
    }
  },
  "updated": 1634056652
}