{
  "sid": "qddrnn",
  "link": "/r/college/comments/qddrnn/i_thinki_fell_for_someone_who_will_never_like_me/",
  "title:": "I think...I fell for someone who will never like me back. (Also MAYBE dating my friend)",
  "text": "Ok at this point, I (20/M/Bisexual) just don't know where to put my thoughts out. I need to but like I just had to. So I work for the Dean staff at my dorm and I got to get close with one of the RA's in particular because he is actually my friend's best friend. I met him during the summer and it so happened that we got to get the same dorm to work in. So I am a desk worker but I am in the process to work his floor as he is the only one and they need a second one soon as he might be getting into the Nursing program. \n\n&#x200B;\n\nHe is a good-looking guy and he is the type that can get any girl he wants and he actually isn't a jerk. I've gotten to know him pretty well as most of the weeks have passed by. The reality is that i think i am starting to like him. I told him i was bi and he's been hella chill about it. The thing is is that he technically fits my type of guy and he makes me feel good. The thing is is that my other close friend and him are actually getting to know each other and stuff is happening......fast.....too fast. They are part of my friend group and I had a past friend group who had the same thing happen and.....lets just say we all crashed and burned because of the relationship. I don't want to relive that trauma that still affects me today about it even though I never was part of any romance in the old friend group. \n\n&#x200B;\n\nI see my friends hanging out and just vibing and then there's me knowing that either its gonna go good or bad. Sure, i think I do have my feelings in the way whenever I see them together but I value my friendships and it is a work in progress to work on my feelings and eventually be able to appreciate him as a friend and a SUPER CLOSE BEST FRIEND.",
  "author": "iiolympicnerd",
  "created": 1634897501,
  "updated": 1635184755,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {}
}