{
  "sid": "qtup09",
  "link": "/r/college/comments/qtup09/staying_near_home_or_far/",
  "title:": "Staying near home or far?",
  "text": "I think I would feel a sense of independence if I went far away but it'll be cheaper if I can stay near home though. What are your experiences?",
  "author": "Meh2Life",
  "created": 1636910907,
  "updated": 1637181713,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkm79ns": {
      "link": "/r/college/comments/qtup09/staying_near_home_or_far/hkm79ns/",
      "text": "I live an hour away in the next city over from my parents. I love it. It's far enough away that i still have my independence but it's still close enough that my folks can help out in an emergency or if I want to go home for the weekend.",
      "author": "LordEndride",
      "created": 1636914226,
      "upvotes": 5,
      "replies": {}
    },
    "hkm4p11": {
      "link": "/r/college/comments/qtup09/staying_near_home_or_far/hkm4p11/",
      "text": "I went away, and its been great! But if you need to save money and can’t do that far away, stay close for a bit.",
      "author": "Turbulent-Rip-5370",
      "created": 1636913297,
      "upvotes": 3,
      "replies": {}
    },
    "hkmmmtc": {
      "link": "/r/college/comments/qtup09/staying_near_home_or_far/hkmmmtc/",
      "text": "Look 1-2 hours away. I’ve heard from many that they wanted independence but then they felt isolated. 1-2 hours away is enough that your parents will leave you alone but when you want to come home, they’re perfectly fine coming to get you. It’s not a trip they would want to make frequently so you will have independence and that safety option of going home.",
      "author": "Parking_Cranberry935",
      "created": 1636919903,
      "upvotes": 2,
      "replies": {}
    },
    "hknf9rg": {
      "link": "/r/college/comments/qtup09/staying_near_home_or_far/hknf9rg/",
      "text": "I’m a freshman who moved 1,000 miles away for college (from Oklahoma to Pennsylvania). Besides the colder weather and out-of-state tuition I really like it and I’m glad I took the opportunity to gain an entirely new experience.",
      "author": "bottleoftrash",
      "created": 1636931295,
      "upvotes": 1,
      "replies": {}
    }
  }
}