{
  "sid": "r2jxwr",
  "link": "/r/college/comments/r2jxwr/i_took_college_for_granted/",
  "title:": "I took college for granted",
  "text": "Hello there r/college. I moved recently down south to another state which is a an extremely big state in September. I went to college as freshman in August and September before being sent away because of issues with a loud speaker and behavioral issues. I also had sleep problems and was taking a lot of naps during the day which caused me to miss class and I got in trouble for that. Now that I’m in another state and in an apartment I feel like I took the environment for granted and now I have a job at lifetime fitness down south of the state I was in. Now I am enrolled in online community college with my parents helping me with some of the work as of now for me as of now. One of them is in a different state and I wanna do much more of the work now because they are basically doing it all for me and that doesn’t sit right with me. My laptop also broke down in college and I need another one. I asked my parents to send it as well but I’m not sure what type I want. I’m 19 and I should be doing that work. I also got my lifetime job in October so I have had it for a bit over a month. I’m making a lot more money than my previous job but it can get pretty lonely at my job and I wanna go back to the college experience. I also my miss my roommate a lot and I feel like I let him down. He had a lot planned for me. I need lots of help and advice. Thank you\n\nSincerely,\n\nBroad-Classic5509",
  "author": "critchfan1",
  "created": 1637921017,
  "updated": 1638206940,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.4,
  "comments": {
    "hm6pxwa": {
      "link": "/r/college/comments/r2jxwr/i_took_college_for_granted/hm6pxwa/",
      "text": "A big state in September? As far as I'm aware, all states remain a consistent size throughout the year. \n\nYour parents are doing your school work? Do they have any openings for more children?\n\nWait, your room mate had a lot planned for you? I'm so confused. \n\nGo back then!",
      "author": "Awkward_Mail_2786",
      "created": 1637954286,
      "upvotes": 1,
      "replies": {
        "hm9q5tc": {
          "link": "/r/college/comments/r2jxwr/i_took_college_for_granted/hm9q5tc/",
          "text": "No I was there in the apartment with my mom and she left to Arizona last month and later on she had a roommate come stay with me over an app.",
          "author": "critchfan1",
          "created": 1638018144,
          "upvotes": 1,
          "replies": {}
        },
        "hm9qkkq": {
          "link": "/r/college/comments/r2jxwr/i_took_college_for_granted/hm9qkkq/",
          "text": "I honestly didn’t know they were doing it at first man it’s a long story we gotta go back to august 2021 first",
          "author": "critchfan1",
          "created": 1638018410,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}