{
  "sid": "reml47",
  "link": "/r/college/comments/reml47/reflecting_on_this_semester_and_how_odd_it_was/",
  "title:": "Reflecting on this semester and how odd it was for me socially.",
  "text": "TL;DR - I feel I was socially outcast because of my age and grades. Advice on making friends moving forward? \n\nSo I’m on “older” student (25) in my first year at a 4yr university. I got my associates at a community college while I was in the military and got out to pursue my degree full time. This was my first semester so I took it easy and only took 1 science class which is A&P1. Literally everyone in this class is aspiring to go to med school or equivalent and I’m no different(dental honestly but same idea). First test this semester I bombed. I’ve never been one to have to study so this was new and honestly a wake up call. I put together a study group and got the highest grade on the next test and have been pretty consistent sense. But here’s the kicker my study group dumped me after the second test. No reason just started meeting without me and made another group chat only answering my messages to find out what I got on test. I found out from one of the group members it was because of my grades and that “I don’t like to hang out”. I live off campus with a partner and don’t really want to invite anyone over who I don’t know as we have a lot ove nice things we’ve worked hard to collect and don’t want ruined. I don’t drink in fact I never have (neither does my partner no reason other than we just don’t like it and thinks it’s a waste of money) I have been used so much as a DD and an alcohol provider, I don’t like to put myself in that situation. Anyways all that is beside the point. Is this what I have to look forward to on my next year and a half? People being weird about my grades and acting weird cause I told them when they asked? I even tried checking myself and making sure I’m not sounding condescending,rude or disrespectful. Tried avoiding the conversation all together as well but people insist. It feels odd to lie about something like grades. Also any advice on getting along? I feel like I’m connecting better with the TAs than I am my peers. I was hoping I would be making some friends as all my military friends have moved on and don’t live in my state.",
  "author": "sleepyminidachshund",
  "created": 1639305937,
  "updated": 1639516547,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "ho8qgyu": {
      "link": "/r/college/comments/reml47/reflecting_on_this_semester_and_how_odd_it_was/ho8qgyu/",
      "text": "You have to remember the younger students are not mature in any sense of the word. I totally understand you being a bit of an outsider because of your age and experience. The grades just add to it. There's so much jealousy and cut throat hatred around pre med that I don't enjoy their company generally. \n\nTry getting a new study group of more nerdy people.  The more outsiders you have, the better! Cool kids are groupthink kids. TAs and grad students are good people for socializing. \n\nThank you for your service!",
      "author": "CindsSurprise",
      "created": 1639314709,
      "upvotes": 4,
      "replies": {
        "hocp7sf": {
          "link": "/r/college/comments/reml47/reflecting_on_this_semester_and_how_odd_it_was/hocp7sf/",
          "text": "Thanks for the support! I didn’t feel like 5-7 years is that big of a gap but I was thinking about how much growth I did from 18 to now and you are absolutely right. Next semester I’m gonna try to find the ones in my age group and go from there. The only thing with TAs is that they can’t fraternize with undergrads so I’d be toeing a thin line I wouldn’t want anyone to loose their job because some kid thinks the TA is being too friendly to a student. I’m hopeful for next semester. Thanks for the reply!",
          "author": "sleepyminidachshund",
          "created": 1639378768,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}