{
  "sid": "rcmozp",
  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/",
  "title:": "Reporting Professor to department head?",
  "text": "I’m not one to to make a big deal out of small stuff. But this is my last semester, I’m taking a course that I need to graduate. And the Professor is killing my grade because of attendance. \n\nLong story short, her syllabus states we have three free absences and everyone after that we lose two percent of our final grade and every three late counts as an absence. \n\nSo this semester I was later 12 times and absent 13 times in her book. So that 28 percent of my grade I’m losing.  But of those 13 absences 6 of them I was sick. \n\nThe syllabus states that if we’re six I need proper documentation and submit it to the dean or something. I thought that was a bit excessive so I emailed her about it and she said if I shared it with her she would excuse it. I have that on email. But now she’s saying she can’t because I didn’t share it to the dean. Her syllabus states that a late is after 15 minutes. I have instances where I came in ten minutes late and it was counted as an absence and I couldn’t even debate because she posted them a week after and I forgot by then. \n\nLike not making any excuses, I was not a stellar student this semester.  But I did my assignments so there’s no reason for my grade to go from an 88% to almost failing because of so my absences and a couple lates. She was a terrible professor that did not teach well. You ask a question and her answer is because that’s what it is. \n\nWhy would I wanna show up for that? Waste of my time. She also had the audacity to brag the last day of classes that a lot of us will fail solely on attendance alone. \n\nI’m not one to complain but this is her first semester teaching. And this is a 100% bs. What you guys think?",
  "author": "CaptainVJ",
  "created": 1639071358,
  "updated": 1639517158,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.41,
  "comments": {
    "hnvrht0": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvrht0/",
      "text": "It sounds like you didn’t follow the syllabus. You knew the requirements, and still chose not to attend half the classes.\n\nAssuming she gives you those 6 sick absences back (3 of which are your free ones), you still have 13 lates and 7 absences. The lates would count as 4 absences, bringing the net total to 11 - or a 22% grade reduction.\n\nIf you’re at an 88%, the lates and absents bring you down to 66%. That a D. Most universities don’t count that as passing credit.\n\nNext time, just show up to class.",
      "author": "peakfreak18",
      "created": 1639074310,
      "upvotes": 55,
      "replies": {
        "hnvu81u": {
          "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvu81u/",
          "text": "This is the answer. You may not like her policies or teaching style, but the syllabus is the syllabus, and you could have dropped the course if you didn’t like it. A complaint will most likely go nowhere.",
          "author": "PhDapper",
          "created": 1639075397,
          "upvotes": 27,
          "replies": {}
        },
        "hnvugtl": {
          "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvugtl/",
          "text": "What a horrible answer, don't be sick. Lol",
          "author": "who-tf-farted",
          "created": 1639075493,
          "upvotes": -13,
          "replies": {
            "hnvuupn": {
              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvuupn/",
              "text": "That’s factoring in having excused absences for being sick. Being sick wasn’t the problem - not going to class was the problem",
              "author": "peakfreak18",
              "created": 1639075640,
              "upvotes": 15,
              "replies": {
                "hnxi1bz": {
                  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnxi1bz/",
                  "text": "Gate keep all you want, OP doesn't define sick, so you get to? Hahahahaha hope you get sick and your boss doesn't believe it.",
                  "author": "who-tf-farted",
                  "created": 1639100473,
                  "upvotes": -3,
                  "replies": {}
                }
              }
            },
            "hnwbg3j": {
              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwbg3j/",
              "text": "They were sick for 6 out of all those absences. So no, they're not saying don't get sick...they're saying if you didn't like how the class was taught, you should have dropped it instead of skipping because it was a \"waste of my time.\"",
              "author": "maddsjanep",
              "created": 1639082264,
              "upvotes": 9,
              "replies": {
                "hnxi8kz": {
                  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnxi8kz/",
                  "text": "K, sick is only what again? \n\nAnxiety isn't sickness? Admitting your anxiety overwhelmed you about a class, that doesn't count if you don't admit it... Whatever.",
                  "author": "who-tf-farted",
                  "created": 1639100563,
                  "upvotes": -2,
                  "replies": {
                    "hnzgbw9": {
                      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnzgbw9/",
                      "text": "OP literally said they skipped class because it was a waste of their time. Youre projecting your own reasons for skipping class onto this post.",
                      "author": "maddsjanep",
                      "created": 1639143070,
                      "upvotes": 3,
                      "replies": {
                        "hnzh3y9": {
                          "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnzh3y9/",
                          "text": "Sure, that's what they said, but education is about learning around the issue as well. The fact OP could have asked for accommodation as well for the sick times may have led to them not thinking it was a waste of time for other periods. But I gotcha, you think I'm projecting. On the internet, where I get fake points for being right, hahahaha.",
                          "author": "who-tf-farted",
                          "created": 1639143469,
                          "upvotes": -1,
                          "replies": {
                            "hnzk0y7": {
                              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnzk0y7/",
                              "text": "You've gotten nothing but down votes here...clearly you aren't right in this situation",
                              "author": "maddsjanep",
                              "created": 1639144918,
                              "upvotes": 2,
                              "replies": {
                                "hnzkov4": {
                                  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnzkov4/",
                                  "text": "Oh no, I'm not popular with strangers on the internet, what should I do? Agree with people who have no experience and understanding of my point of view?!? I'll pass, I'm good. Just don't ever get chronically sick and have someone judge you for it.",
                                  "author": "who-tf-farted",
                                  "created": 1639145232,
                                  "upvotes": 0,
                                  "replies": {
                                    "hnzl69n": {
                                      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnzl69n/",
                                      "text": "Why are you still talking about things OP did not mention as reasons for skipping class? I'm so confused why you're inferring they had chronic illness and/or anxiety when they flat out said they did not like the way the course was taught so attending class was a waste of their time? Reading comprehension is so important.",
                                      "author": "maddsjanep",
                                      "created": 1639145459,
                                      "upvotes": 2,
                                      "replies": {
                                        "ho1boek": {
                                          "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/ho1boek/",
                                          "text": "It really is, sorry that you are confused, I guess that looking outside of what is being discussed isn't rekeva... I don't care what you think, especially when you are patronizing.",
                                          "author": "who-tf-farted",
                                          "created": 1639170831,
                                          "upvotes": 0,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "hnvuyiq": {
          "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvuyiq/",
          "text": "At my college a D is a passing grade, and I’m not sure if the three free absences would count for three of my six lates. At the end of the day, it’s still ludicrous that my grade is going from an 88 to almost failure because of a silly attendance policy where she is a useless professor. \n\nIt’s her first ever semester teaching and she’s going to be failing 7 students.",
          "author": "CaptainVJ",
          "created": 1639075681,
          "upvotes": -15,
          "replies": {
            "hnvwaej": {
              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvwaej/",
              "text": "If it’s in the syllabus, the dean will take her side. \n\nIs a D passing or passing with credit?\n\nYou knew the rules in September and chose to ignore them. That’s on you. Of course the 3 free would be used for your sick days. The policy isn’t “sick days plus 3”. The whole point of the 3 free days is so the professor doesn’t need to worry about approving every sick day, holiday, and family death. If you’re sick more than 3 days (or have other excused absences), then you get permission for those.",
              "author": "peakfreak18",
              "created": 1639076200,
              "upvotes": 19,
              "replies": {
                "hnvxq3a": {
                  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvxq3a/",
                  "text": "I received one D- in my college career and it did fulfill a major requirement, so I’m assuming it’s passing with credit. I believe the requirement is having above a 2.0 gpa",
                  "author": "CaptainVJ",
                  "created": 1639076779,
                  "upvotes": 1,
                  "replies": {
                    "hnvy3oh": {
                      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvy3oh/",
                      "text": "Then you’re good, congrats!!",
                      "author": "peakfreak18",
                      "created": 1639076935,
                      "upvotes": 5,
                      "replies": {}
                    },
                    "hnw9xsb": {
                      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnw9xsb/",
                      "text": "A D- may be passing in some instances but not all. If it’s a major class, it might still technically be passing, but if it’s a core gen Ed class you usually need at least a C to pass.",
                      "author": "caligirlthrowaway104",
                      "created": 1639081654,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hnwg18p": {
              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwg18p/",
              "text": "She’s not failing students. Students have earned failing grades. If you don’t like a prof or their policies, change sections or drop the class. If you need it graduate, suck it up and deal with it.",
              "author": "Hazelstone37",
              "created": 1639084120,
              "upvotes": 6,
              "replies": {}
            }
          }
        }
      }
    },
    "hnw1rt0": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnw1rt0/",
      "text": "Go for it, but you're likely wasting time.\n\nIf the professor is tenured, not a chance.",
      "author": "GenXtreme1976",
      "created": 1639078418,
      "upvotes": 15,
      "replies": {
        "hnw3e6q": {
          "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnw3e6q/",
          "text": "She’s a phd student and this is her first semester",
          "author": "CaptainVJ",
          "created": 1639079057,
          "upvotes": -6,
          "replies": {
            "hnw42xh": {
              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnw42xh/",
              "text": "Go ahead and complain but it probably won't do anything because they're using her to teach as part of her PhD program.",
              "author": "GenXtreme1976",
              "created": 1639079329,
              "upvotes": 9,
              "replies": {}
            },
            "hnwg3ix": {
              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwg3ix/",
              "text": ">She’s a phd student\n\nWait, do you mean a graduate student? Then she shouldn't be the professor of record and has to be working under a faculty member.",
              "author": "hdorsettcase",
              "created": 1639084147,
              "upvotes": -2,
              "replies": {
                "hnwr5uc": {
                  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwr5uc/",
                  "text": "This depends on the institution. Some PhD students are instructor of record for some courses, especially if they are near the end of the their program.",
                  "author": "Bravely-Redditting",
                  "created": 1639088653,
                  "upvotes": 6,
                  "replies": {}
                },
                "hnww7y6": {
                  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnww7y6/",
                  "text": "In my PhD program, teaching fellows could be instructors of record. That’s because we were all qualified to be instructors as we all had master degrees prior to our PhD program. Graduate students also include master students, who would not be qualified until they earn a certain number of credit hours.",
                  "author": "PhDapper",
                  "created": 1639090775,
                  "upvotes": 3,
                  "replies": {}
                },
                "hnwg6v8": {
                  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwg6v8/",
                  "text": "Yes, and no idea how that works haha",
                  "author": "CaptainVJ",
                  "created": 1639084185,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hnw9ufl": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnw9ufl/",
      "text": "Ok, I'm gonna be straight with you. I don't think reporting her is gonna do anything for you. I get that you were sick for 6 classes, and you should absolutely not lose credit for that. But that means you still decided to skip class 7 times and show up late 12 times. You did that with full knowledge of her attendance policy, you knew it would affect your grade, and you still decided to do it. I understand you may have issues making it difficult to get there on time, but the burden would fall on you to discuss that with her. Honestly her attendance policy isn't unreasonable at all, 3 free absences is pretty solid.\n\nI'm not trying to be mean or insulting, but (not including the sick days) this is ultimately something you brought on yourself, and administration will probably say the same thing.",
      "author": "PBandJews",
      "created": 1639081617,
      "upvotes": 14,
      "replies": {}
    },
    "hnwag09": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwag09/",
      "text": "13 absences is A LOT. You admit you didn’t like her class so you didn’t show up. But you also knew what the attendance policy was in the syllabus. Even if you don’t agree with it, you didn’t show up knowing what the syllabus said. You could have avoided this by just showing up for class, and showing up on time. Sure some of the days you were sick, but more of the absences were because you didn’t want to be there. That would be on you no matter how much the class sucked.",
      "author": "caligirlthrowaway104",
      "created": 1639081857,
      "upvotes": 12,
      "replies": {}
    },
    "hnw9bl8": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnw9bl8/",
      "text": ">she said if I shared it with her she would excuse it. I have that on email. But now she’s saying she can’t because I didn’t share it to the dean.\n\nYou can probably communicate with her and get some points back here, if she indeed said she would excuse it. But I'm having doubts on what you have described. It would be very strange for deans to accept those documents unless students are filing for serious hardship.\n\n&#x200B;\n\n>Why would I wanna show up for that? Waste of my time. She also had the audacity to brag the last day of classes that a lot of us will fail solely on attendance alone.\n\nIt doesn't matter what you think of the rules. As long as they are reasonable (which they are), you are responsible for the consequences when you choose to break them.",
      "author": "AcademicDifficulty",
      "created": 1639081408,
      "upvotes": 11,
      "replies": {}
    },
    "hnvy17c": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvy17c/",
      "text": "You can’t say “not making excuses” and then make a ton of excuses on why she sucks so much\n\nJust go to class",
      "author": "shawnglade",
      "created": 1639076906,
      "upvotes": 27,
      "replies": {}
    },
    "hnwrdsx": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwrdsx/",
      "text": "Wow, that's a huge number of absences and late arrivals. Did you ever actually arrive to class on time? I'm surprised they didn't fail you outright.",
      "author": "Bravely-Redditting",
      "created": 1639088745,
      "upvotes": 5,
      "replies": {}
    },
    "hnws0jk": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnws0jk/",
      "text": "Go to class.",
      "author": "WalmartDarthVader",
      "created": 1639089007,
      "upvotes": 6,
      "replies": {}
    },
    "hnwbzme": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwbzme/",
      "text": "I'm having a similar issue and am trying to backtrack for as many Dr excuses as I can. I've gotten ill SO MANY TIMES this semester. All of my professors have said they absolutely don't want you showing up to class sick. So, when I'm sick I've been sending emails to them to let them know. Covid has seriously changed everything and most mean it when they say don't come. \n\nMost of my professors have been really good about it. I have even mentioned getting drs excuses and basically all of them have just been like \"thank you for letting me know\" \"I hope you feel better soon\" \"this is where you can find the work you need\" \"you will have all the flexibility you will need\" ... Almost none have wanted them. \n\nWell, one prof in particular (who I actually really love despite the fact they they confuse and drive me nuts quite a bit) was probably the most upset about a student coming in with the flu. The professor got sick and was out for two weeks and she was really upset about it. She's also an older professor with asthma, so probably high risk. She even emailed me personally saying something about it and telling me she wouldn't let anyone in the class come in sick, covid or not. \n\nAnywayyy... I took that very seriously. I didn't want to get her ill. Every time I was sick I would email her and send in my work. It never seemed to be an issue... But now she's telling us that most of us aren't doing well in her class. some of us because of all our absences. Now, I'm trying to see how many times I went to the Dr so I can try to get documents sent over. \n\nI feel kind of stupid for not doing that right away, but she made it seem like everything was fine. That, and I can't afford to go to the Dr every time I'm sick. I'm a little upset because I thought I was doing the right thing and the university hasn't been very clear on procedures with covid and sick students. \n\nFrom now on I'm immediately going to try to get Dr excuses as much as I can. That, and try to get something in writing (if it's not mentioned in the syllabus) if the professor tells us we aren't allowed to come in sick. I'm just hoping I'll be okay for her class bc I really tried. She told me I was one of her best students in turned in the best work in the class. :( I just get absolutely wrecked when I get sick and don't want that for anyone else.",
      "author": "Animasylvania",
      "created": 1639082484,
      "upvotes": 2,
      "replies": {}
    },
    "hnw0q19": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnw0q19/",
      "text": "Is that the policy in the syllabus? Yes. Did the student know? Yes. But following blatantly obnoxious rules just because tHoSe ArE tHe RuLeS is the height of stupidity and low level thinking. Isn't higher education supposed to produce independent thinking? Losing 20% off a grade that is a measure of your academic abilities because of petty \"adult life\" bs is ridiculous. I've spend time in the military and nothing has halted common sense functioning and productivity quite like a religious unbending belief in \"I don't get it either but those are the rules so we gotta do it this dumb way\"",
      "author": "dh731733",
      "created": 1639077997,
      "upvotes": -2,
      "replies": {}
    },
    "hnvud1x": {
      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnvud1x/",
      "text": "Hit up the ethics department, the whole want to know why you were sick thing is something for accommodations, not the professor",
      "author": "Burrito_Capital",
      "created": 1639075451,
      "upvotes": -4,
      "replies": {
        "hnw9ukq": {
          "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnw9ukq/",
          "text": "Accommodations are for those with serious disabilities, not someone claiming to be sick.  OP should have contacted the Dean of Students, as this falls into their lap.  In fact, according to OP, the syllabus says just this - but OP declared that the policy was \"a bit excessive\" - and so OP decided to do things their own way.  Professors have every right to ask why a student isn't present, especially if the student intends to benefit from said absence.  Nothing unethical about this.",
          "author": "DeskRider",
          "created": 1639081618,
          "upvotes": 7,
          "replies": {
            "hnwdipa": {
              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnwdipa/",
              "text": "And the professor stated that is an acceptable way.",
              "author": "CaptainVJ",
              "created": 1639083095,
              "upvotes": 1,
              "replies": {}
            },
            "hnx46us": {
              "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnx46us/",
              "text": "Disabilities are rated on what the client needs, glad you don't work in accomodations.\n\nIs it serious to you or to the client that needs accommodation? Is depression serious, anxiety, adhd? Sick isn't just cough, cough, I can't be there. It could be something OP doesn't want to disclose.\n\nDon't be an ass.",
              "author": "Burrito_Capital",
              "created": 1639094226,
              "upvotes": 1,
              "replies": {
                "hnxdrx1": {
                  "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnxdrx1/",
                  "text": "News flash:  I've worked in accommodations, so I've had some experience with what generally qualifies and what does not.\n\nStudents with issues like depression, ADD, broken bones, or any other medical situation must have documentation from their physicians before the accommodation process can even start.  Most, if not all, students who have accommodations underwent a process - it wasn't accomplished overnight.  Arguing that you're \"sick\" will not secure an accommodation. \n\nSorry to hurt your feelings, but the vast majority of students who come to accommodations won't receive them because they won't follow the process.  Legally, if you don't, then no accommodations can be granted.\n\nYou're trying to argue that this is an 'ethical' issue.  It's not.",
                  "author": "DeskRider",
                  "created": 1639098543,
                  "upvotes": 1,
                  "replies": {
                    "hnxeit1": {
                      "link": "/r/college/comments/rcmozp/reporting_professor_to_department_head/hnxeit1/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1639098885,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}