{
  "sid": "qz8hpo",
  "link": "/r/college/comments/qz8hpo/18m_what_should_i_study_for_college/",
  "title:": "18M What should i study for college?",
  "text": "I graduated from highschool 6 months ago.\nI was slacking off the whole time but now that 2022 is coming, i need to decided on what to study. I cant just stay here at home doing nothing.\n\nIm not particularly interested in anything big and high paying. I just want a typical job that i can enjoy and pay everything that i need in my daily life.\n\nI do have some hobbies that might help me pick.\n\n* Video games!\n(maybe i could pick game designer, software developer or somthing idk)\n\n* Animations!\n I like both 3D and 2D animations but i dont know how thats gonna earn me money (3D animator)\n\n* Heres my favourite: Content creating!\nThe past 3 months ive been learning how to edit videos for my youtube channel.\n I try to make my videos as entertaining as possible and im really passionate about working on them full-time. \nIt would be the perfect job for me since i sit on a computer everyday.\nI really think i have potential but my parents wont allow it so content creating will just be a hobby for now.\n\n\nThere isnt anything else i could think of so..\n\nYes pls help me haha if you have some other programs that i could study for college pls do let me know in the comments! Thank you!\n\n\n\nEdit: omg i read through my post again and i sounded so lazy and annoying im so sorry \n\nIm very bad at explaining things and on top of that, english isnt my first language so i apologize if this came out really frustrating to read",
  "author": "DryTato",
  "created": 1637540721,
  "updated": 1637689143,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hllfpuc": {
      "link": "/r/college/comments/qz8hpo/18m_what_should_i_study_for_college/hllfpuc/",
      "text": "I mean, computer science would lead to a bunch of fields. An art degree specializing in computer rendered art would also be implemented in a variety of opprotunities surrounding games or animation. If content creation is what you're after, you're not gonna find it at school.",
      "author": "AHumbleLibertarian",
      "created": 1637551047,
      "upvotes": 2,
      "replies": {
        "hlljlq8": {
          "link": "/r/college/comments/qz8hpo/18m_what_should_i_study_for_college/hlljlq8/",
          "text": "Oh i see, i thought there was one for like teaching programs like premiere and stuff ahah i guess i could just learn that online. everybody can actually",
          "author": "DryTato",
          "created": 1637552962,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlku9xf": {
      "link": "/r/college/comments/qz8hpo/18m_what_should_i_study_for_college/hlku9xf/",
      "text": "Oh i saw this one called Graphic Designer! It seems pretty interesting i will add that to my list",
      "author": "DryTato",
      "created": 1637540937,
      "upvotes": 1,
      "replies": {}
    },
    "hlkyqzs": {
      "link": "/r/college/comments/qz8hpo/18m_what_should_i_study_for_college/hlkyqzs/",
      "text": "look at video game design.",
      "author": "rynpickles",
      "created": 1637543028,
      "upvotes": 1,
      "replies": {
        "hlkyybs": {
          "link": "/r/college/comments/qz8hpo/18m_what_should_i_study_for_college/hlkyybs/",
          "text": "will do! im actually reading about it rn",
          "author": "DryTato",
          "created": 1637543125,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlljb4l": {
      "link": "/r/college/comments/qz8hpo/18m_what_should_i_study_for_college/hlljb4l/",
      "text": "you can look up what professionals say about their jobs on Youtube. they’re usually titled like “so you want to be xxxx” or “how to become xxxx”",
      "author": "p-floof",
      "created": 1637552816,
      "upvotes": 1,
      "replies": {}
    },
    "hllwrx9": {
      "link": "/r/college/comments/qz8hpo/18m_what_should_i_study_for_college/hllwrx9/",
      "text": "Maybe computer science or graphic design? Lots of people start college undecided and that’s fine.",
      "author": "SinfullySinatra",
      "created": 1637560386,
      "upvotes": 1,
      "replies": {}
    }
  }
}