{
  "sid": "qpsors",
  "link": "/r/college/comments/qpsors/will_i_lose_my_instate_tuition_status/",
  "title:": "Will I lose my in-state tuition status?",
  "text": "My (23F) boyfriend (24M) is likely going to be moving to California from Arizona soon for an amazing job opportunity after he completes his degree this spring. I still have at least a year of undergrad left (finishing up some premed prerequisites). We have been together for two years and have lived together for over a year. Our relationship is going great, but we are both very reluctant to do long distance especially after we've lived together already.\n\nWe are trying to consider all of our options leading up to this move. I thought it could maybe be possible for me to move with him, and I can just finish up the rest of my classes online at the university I am currently enrolled at. But if I move to California, won't I lose my in-state tuition status in Arizona? \n\nConsidering I really don't have much left I don't want to transfer universities and I certainly can't afford out of state tuition. Unsure what to do.",
  "author": "captainnemo214",
  "created": 1636421826,
  "updated": 1637395211,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjw6j81": {
      "link": "/r/college/comments/qpsors/will_i_lose_my_instate_tuition_status/hjw6j81/",
      "text": "Yes, you would lose in state tuition. Do you have family in Arizona? Also, often times they only verify residency once. There's no reason for them to ask you to prove where you live as long as you don't tell them you're moving.",
      "author": "jordanstall09",
      "created": 1636429348,
      "upvotes": 3,
      "replies": {
        "hk8hqcz": {
          "link": "/r/college/comments/qpsors/will_i_lose_my_instate_tuition_status/hk8hqcz/",
          "text": "I do have several family members in Arizona. Would I be able to use their address for residency verification?",
          "author": "captainnemo214",
          "created": 1636656995,
          "upvotes": 1,
          "replies": {
            "hk90vpv": {
              "link": "/r/college/comments/qpsors/will_i_lose_my_instate_tuition_status/hk90vpv/",
              "text": "If your school will take pieces of mail for address verification, see if your family is okay with it. Mine never checked my license so just a thought. I don't know if a school would have a reason to reverify your address, however it would help in case they mailed something to you unannounced.",
              "author": "jordanstall09",
              "created": 1636664853,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}