{
  "sid": "rgeczv",
  "link": "/r/college/comments/rgeczv/missed_my_final_exam/",
  "title:": "Missed My Final Exam",
  "text": "I never saw any information about my Calc finals exam and decided today to ask one of my classmates and he said that the exam was YESTERDAY?? I just emailed my professor, is there anything I can do??",
  "author": "HighMagicLvl",
  "created": 1639507914,
  "updated": 1639848479,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hojlskg": {
      "link": "/r/college/comments/rgeczv/missed_my_final_exam/hojlskg/",
      "text": "I don’t think so. You’ll have to wait till your professor responds to you. I’m so sorry.",
      "author": "ChrisLovesLorde",
      "created": 1639507955,
      "upvotes": 5,
      "replies": {
        "hojm66d": {
          "link": "/r/college/comments/rgeczv/missed_my_final_exam/hojm66d/",
          "text": "Am I allowed to take the exam if I missed it? Or is it up to the professor?",
          "author": "HighMagicLvl",
          "created": 1639508102,
          "upvotes": 1,
          "replies": {
            "hojm8fu": {
              "link": "/r/college/comments/rgeczv/missed_my_final_exam/hojm8fu/",
              "text": "Up to the professor. No one else has authority in that case.",
              "author": "ChrisLovesLorde",
              "created": 1639508127,
              "upvotes": 4,
              "replies": {}
            },
            "hojmbmm": {
              "link": "/r/college/comments/rgeczv/missed_my_final_exam/hojmbmm/",
              "text": "Up to the prof. Technically they’re supposed to give you a zero but if they are they’re a massive dick",
              "author": "harry01772",
              "created": 1639508162,
              "upvotes": 1,
              "replies": {
                "hok32hm": {
                  "link": "/r/college/comments/rgeczv/missed_my_final_exam/hok32hm/",
                  "text": "> but if they are they’re a massive dick\n\nWhat why? If there was an exam time posted and everyone showed up, why is OP entitled to a makeup exam? I agree it'd be nice if OP was allowed to, but OP certainly isn't entitled to it.",
                  "author": "gargar070402",
                  "created": 1639514730,
                  "upvotes": 1,
                  "replies": {
                    "hok4scj": {
                      "link": "/r/college/comments/rgeczv/missed_my_final_exam/hok4scj/",
                      "text": "It’s not entitlement, but it’s kind of a “I would do it for you if you were in this situation”. We are all humans, we make mistakes. If this happened to me and I couldn’t make it up I would literally be on scholarship probation. My entire fucking career in jeopardy because the professor doesn’t want to be a good person. Sure I missed the day but those two hours shouldn’t define my entire career. If I were the professor and my student missed the exam day I’d let him make it up in some capacity and wouldn’t even think twice",
                      "author": "harry01772",
                      "created": 1639515430,
                      "upvotes": 1,
                      "replies": {
                        "hokec66": {
                          "link": "/r/college/comments/rgeczv/missed_my_final_exam/hokec66/",
                          "text": "So the prof should come in to proctor your exam  and lose her time because you didn’t use your time?\n\nI had to warn my students that there would be no make-ups because I literally have only 20 hours before I have to turn the semester’s grades.\n\nIt also depends on how the student did all semester.  If they constantly pulled shit like this - not handing in assignments and asking for extensions - then I’d be much less likely to grant them a make-up.",
                          "author": "emarcomd",
                          "created": 1639519335,
                          "upvotes": 7,
                          "replies": {
                            "hokg0iu": {
                              "link": "/r/college/comments/rgeczv/missed_my_final_exam/hokg0iu/",
                              "text": "Well yeah I definitely agree if they’ve been doing it all semester. But in my 4 years of college I’ve literally NEVER missed an assignment or an exam. You can also get a friend to proctor or a grad student. Like I said it’s an empathy thing. If I were the professor I 100% would give a second chance to someone like me.",
                              "author": "harry01772",
                              "created": 1639520036,
                              "upvotes": -3,
                              "replies": {
                                "hokjtyx": {
                                  "link": "/r/college/comments/rgeczv/missed_my_final_exam/hokjtyx/",
                                  "text": "I absolutely cannot get a grad student to proctor.  I'm an adjunct - and a lot of profs are.\n\nThis is not an empathy thing.  If you knew your scholarship depended on the exam, you would make sure to know when the exam was and make sure you get there early.\n\nPeople \\*absolutely\\* make mistakes.  But if I don't take extra time out of *my* schedule to help someone who didn't take time out of *their* schedule... that means I'm a bad person?  \n\nProfessors always say \"well when I was a student I \\*never\\* would have done X.\"  Honestly, they don't know what they would do if they were a student because they're no longer a student.\n\nSimilarly, your saying \"*If I were the professor and my student missed the exam day I’d let him make it up in some capacity and wouldn’t even think twice\"* is moot.  You're not a professor.  You don't know what you'd do.  \n\nYou've already said, \"*well in some cases they don't deserve it*.\"   So how bad does the student have to be?   If they miss one assignment and ask for an extension then we shouldn't give him a make-up?    What if they never asked for an extension, but haven't handed in 3 assignments.  What if they handed in all the assignments, but didn't show up for 5 classes.\n\nDon't say you 100% know what you'd do until you're doing it.",
                                  "author": "emarcomd",
                                  "created": 1639521641,
                                  "upvotes": 13,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "hokb970": {
                          "link": "/r/college/comments/rgeczv/missed_my_final_exam/hokb970/",
                          "text": "Are you a professor? If not, you likely don't know how much (or perhaps how little) authority professors have over situations like this.\n\nAnd, from the way you're describing this, you certainly make it sound like it's an entitlement. Again, just because you have a scholarship depending on it doesn't automatically mean that the professor has to show mercy, unfortunately.",
                          "author": "gargar070402",
                          "created": 1639518073,
                          "upvotes": 7,
                          "replies": {}
                        },
                        "honukug": {
                          "link": "/r/college/comments/rgeczv/missed_my_final_exam/honukug/",
                          "text": "Would you be equally forgiving to the professor if they forgot the deadline to turn in your grades that your scholarship depended on?",
                          "author": "the_banished",
                          "created": 1639586407,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "holxy0m": {
      "link": "/r/college/comments/rgeczv/missed_my_final_exam/holxy0m/",
      "text": "I hate to say it but you’re at the mercy of your professor and are probably fucked.\n\n  \nBut just for one class in one semester! You will absolutely have more than enough time to finish the course on schedule with graduating in 4 years and to fix your GPA.   \n\n\nI assume you’re a freshman, so let error be a lesson: ALWAYS make sure you know when finals are BEFORE finals week. If you don’t know, check the syllabus, check your school’s final exam schedule (just google “Collegename finals schedule 202X”), and finally, email your professor. Not knowing you had an exam is a bad excuse for missing it unless literally everyone missed it too. But hey, maybe your prof will throw you a bone, so best of luck!",
      "author": "LeadershipSweet",
      "created": 1639545049,
      "upvotes": 9,
      "replies": {}
    },
    "hoki8kx": {
      "link": "/r/college/comments/rgeczv/missed_my_final_exam/hoki8kx/",
      "text": "I've missed plenty of assignments and a final actually assuming they were all on the same day. But never had a professor not say anything about the final in the weeks or days leading up to it. There was no review or dead week to study?",
      "author": "djoness11",
      "created": 1639520971,
      "upvotes": 3,
      "replies": {
        "holp06g": {
          "link": "/r/college/comments/rgeczv/missed_my_final_exam/holp06g/",
          "text": "He told me in his reply back that there was an announcement on canvas.",
          "author": "HighMagicLvl",
          "created": 1639540312,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "hom01vh": {
      "link": "/r/college/comments/rgeczv/missed_my_final_exam/hom01vh/",
      "text": "You are fucked ):",
      "author": "WalmartDarthVader",
      "created": 1639546256,
      "upvotes": 2,
      "replies": {
        "hom5a78": {
          "link": "/r/college/comments/rgeczv/missed_my_final_exam/hom5a78/",
          "text": " 🖕",
          "author": "Impressive_Stuff_908",
          "created": 1639549476,
          "upvotes": -2,
          "replies": {}
        }
      }
    }
  }
}