{
  "sid": "rio5m9",
  "link": "/r/college/comments/rio5m9/should_i_transfer_universities/",
  "title:": "Should I transfer universities?",
  "text": "I’m an international student currently in my first year of law school in the UK and already hold a bachelors degree. After completing the first bachelors in my country and working for some time, I realised I really liked law and the work I can do with it to help people. So I applied and got into a law school in the UK. The plan was to complete law school in the UK and go back to my country.\n\nHowever, in the university, except for 1 class, the rest are not intellectually stimulating. The lecturers and tutors aren’t really interested in clearing students’ doubts and always seem to be in a hurry to get out of the class. Covid uncertainty further affecting the teaching where, now, it’s all online. Most of the students in my batch are also slowly losing the enthusiasm because of the lack of support from the professors/law department. Being in such an environment, away from my country and family, just to sit through these classes while paying so much tuition fee seem to me like a waste of my time and money. My physical health has also come down due to this stress.\n\nSo there is an option in my university to transfer my first year credits and finish the rest of my degree online. That way, I can go back to my country and work while also taking online classes. I’ll gain work experience while also getting the law degree from the same university at a much lesser cost. I am also better at self-study and always learn better when I’m doing it according to my schedule.\n\nBut speaking to some of my Professors at university, they said they would always prefer students actually attend live classes and wouldn’t recommend an online law degree, as the learning curve is better when you attend physical classes. I also won’t have the student community support anymore. I’m still convinced that an online degree is better for me at this stage of my life. I’m only worried because law as a subject requires debates/discussions and deliberations about various legal theories/approaches and philosophies. I won’t have that if I’m going to do it online. But I will have more legal work experience. I don’t know how much importance to give to in-person class interactions vs. legal experience.\n\nWhat would be your view?",
  "author": "BuzzKillBobz",
  "created": 1639767203,
  "updated": 1639787350,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {}
}