{
  "sid": "q6g78v",
  "link": "/r/college/comments/q6g78v/does_this_seem_like_a_bit_much/",
  "title:": "Does this seem like a bit much?",
  "text": "Today we( the entire class) learned that in one week we have a semester paper due. \nThis paper is 10-14 pages long. Plus it must have a lit review as well as an annotated bibliography. We must have 7 sources. \n\nAdditionally, we ( the same entire class) learned today that we need to have a  discourse analysis and textual analysis of two different pieces of media turned in on the same day as the semester paper. \n\nDoes this  seem like a bit much?\n\nNote. Our Professor is retired (emiritus) and since the semester started I have suspected early signs of dementia due to certain behaviors and what seems to be a forgetful nature.",
  "author": "eastgravity",
  "created": 1634021469,
  "updated": 1634082934,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hgbsswr": {
      "link": "/r/college/comments/q6g78v/does_this_seem_like_a_bit_much/hgbsswr/",
      "text": "So was this just completely left off the syllabus? Just no mention of any 10 page paper in there at all? \nIf so what fuckin college do you attend because that’s not how it works.",
      "author": "Jfogs2020",
      "created": 1634021685,
      "upvotes": 3,
      "replies": {
        "hgbszuf": {
          "link": "/r/college/comments/q6g78v/does_this_seem_like_a_bit_much/hgbszuf/",
          "text": "I forgot to mention. He overhauled the syllabus over the weekend. And we have not actually seen the syllabus. Like you click on the syllabus link and there is nothing there. Additionally, the main textbook is unavailable to half the class. His solution was to place his copy in the library where we can share it.",
          "author": "eastgravity",
          "created": 1634021841,
          "upvotes": 3,
          "replies": {
            "hgbt4gc": {
              "link": "/r/college/comments/q6g78v/does_this_seem_like_a_bit_much/hgbt4gc/",
              "text": "Yea I’d have atleast 3 emails sent to the head of whatever department that is. Unless your some upper level grad student somewhere you should have a syllabus and should have a bit more then a week to write that big of a paper.",
              "author": "Jfogs2020",
              "created": 1634021948,
              "upvotes": 2,
              "replies": {}
            },
            "hgcqzg2": {
              "link": "/r/college/comments/q6g78v/does_this_seem_like_a_bit_much/hgcqzg2/",
              "text": "Bro get in contact with the college, that is the first thing professor go over man",
              "author": "Neonhelix101",
              "created": 1634046574,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}