{
  "sid": "r71yet",
  "link": "/r/college/comments/r71yet/how_should_i_deal_with_my_professor_not_giving_me/",
  "title:": "How should I deal with my professor not giving me and my peers full credit for the final project?",
  "text": "The title is a bit off so I'm going to explain. Throughout the semester I was assigned to a group to write a critical analysis on our department as practice on a proposal grant. However, through the semester, only I and two other members (a total of 9) have been contributing to the work, researching articles, writing proposals, and making presentations. I tried bringing this up to his attention before by making a comment on Canvas went submitting an assignment, telling him who exactly did work and what sections. But in the next class, he told everyone that he didn't want us to \"tell on our classmates\" and to only do our part of the work and turn in incomplete work. In fact, he said \"everyone will get an A in the class regardless of the work so just turn in what you have\", citing the pandemic as a reason to do so. (I get the pandemic is stressful but that doesn't mean you don't do your own work)\n\nThe thing is though, not a single thing would get done because the other group members will ghost me and my two other group members. Even when we delegate work and follow his instructions, they legitimately did not touch any of the google docs until we caved and did them ourselves in order to finish the final grant and make the presentation so that there would be SOMETHING to turn in. It was then they \"decided\" to pop in and type a few sentences and their names, then leave and ghost us again. It's making me specifically mad because the professor says he's going to use our work for next semester's class to do the actual research and grant, and I absolutely do not want him to do so unless he gives proper credit where it's due, instead of giving everyone As. \n\nWhat I'm not sure now is how I should address the issue since I could send him an email again and let him know of the situation, but he most likely would cite the pandemic as his reasonings. Is this something I should escalate to the department head? the university dean? Would something like that be too much, should I simply not give my consent for him to use my work in his next class? I just would like some advice on how to proceed because I'm incredibly frustrated, so thank you.",
  "author": "wizardwlw",
  "created": 1638430258,
  "updated": 1638479994,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hmwqn8t": {
      "link": "/r/college/comments/r71yet/how_should_i_deal_with_my_professor_not_giving_me/hmwqn8t/",
      "text": "Speak to the department chair (never go directly to the dean - 9/10 times they’ll boot it back to the chair anyway). You have two issues here. One is that you do not feel as though you are being marked fairly. The second is an intellectual property issue with regards to your work being used next term. Especially if this is somehow connected to a grant, or research, that sounds incredibly problematic to me. You need clarity on exactly what your professor is proposing to do with your intellectual property.",
      "author": "alimck476",
      "created": 1638432766,
      "upvotes": 1,
      "replies": {}
    }
  }
}