{
  "sid": "prkqp6",
  "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/",
  "title:": "Help with switching majors/Advice???",
  "text": "Hello, so I am a sophomore in my first semester and I am wanting to change my major, but need some advice. To put in perspective I am currently a Biochemistry major with a Pre-Med co-major. Yet, my school is a liberal arts college, and I'm just realizing that I tend to like those classes more than the core classes of my actual major. Well to be honest I kind of simply hate my core classes, because I think I just focused too much on this area since high school and no longer have an interest in it/it made me never consider other studies. I am thinking about either switching to Anthropology or Political Science and adding a minor in business. My reasoning for this is because these two majors are both in the college of arts and science in which I have already created progress for in the number of credits I have, and I've just learned that I like the social sciences more (I would also like to graduate on time). However, my dilemma is that I don't know which is better. I am leaning forward to Anthropology because I see actual value in learning about different cultures, societies, and communication (etc). Yet everything I see is that this is a horrible degree and often the number one to avoid on countless lists/videos; even my own school website says about 30% of people go onto graduate school with this degree (which somewhat scares me, yet there could be obvious factors that perhaps these people simply didn't want to go). Now I don't think I am going to become an anthropologist by any means, but I just find that the skills I could learn from this would be beneficial and that it would be an interesting major that I could actually be passionate about. I'm also thinking it could be a good choice because I am considering using it as my foundation to perhaps go onto nursing school or get my MBA after undergrad. It's just I was originally Biochemistry/pre-med because I thought I wanted to be a doctor or physician assistant but am now realizing it wasn't necessarily what I wanted for myself, but what others expected for me. I am still interested in healthcare, but just not in that same area anymore. So I guess what I'm trying to get at is if I go for Anthropology with a business minor, is it worth it? Should I swap it out for political science or do something completely different instead? I've even considered double majoring in political science and anthropology, but I would probably have to drop the minor and I don't know if it would be all too wise to have two social science majors. I've come to the conclusion that I much rather find passion in what I study rather than killing myself over a \"high earning degree\" that I'll be miserable in and just have barely decent grades. I know high-earning degrees are subjective and that you can argue that you can work with any degree, but in general, will anthropology leave me unemployable?  I want to make sure I have something at least stable and that I won't be in debt and misery for the rest of my life. Any advice is greatly appreciated!",
  "author": "elijah_gahn",
  "created": 1632100767,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hdkcyef": {
      "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdkcyef/",
      "text": "[removed]",
      "author": null,
      "created": 1632122450,
      "upvotes": 1,
      "replies": {}
    },
    "hdjwzqg": {
      "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdjwzqg/",
      "text": "So are you planning on not doing pre med anymore? If so, what other careers would you consider in the future?",
      "author": "postmaloneismediocre",
      "created": 1632111014,
      "upvotes": 1,
      "replies": {
        "hdkvuo0": {
          "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdkvuo0/",
          "text": "I am not planning to do pre-med anymore. My college advises picking something you're interested in first then think of jobs so that's kind of my thought process right now. Not only that, but since I had grown up only thinking I wanted to be a doctor, I'm not even fully sure what I want to be 100% at the moment. I'm thinking possibly about a career in nursing or business for the future.",
          "author": "elijah_gahn",
          "created": 1632138435,
          "upvotes": 1,
          "replies": {
            "hdobynf": {
              "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdobynf/",
              "text": ">My college advises picking something you're interested in first then think of jobs so that's kind of my thought process right now.\n\nI don't think this is great advice. You're going to be spending 4 years of college but potentially are going to work for 40 years, so what career you pick seems like it is going to be more important than what you major in. If you want a career in nursing, you would have to get a degree in nursing to do that, which means you may want to think about transferring. If you want to work in business, firstly consider what career you want, since business is a very broad field. If you want to work in accounting, for instance, then you would almost certainly need an accounting major. If you want to work in finance, then a finance/econ major would be most fitting, but it depends way more on prestige of your school/networking and recruiting opportunities. If you want to work in marketing then the major you choose may be less important. Regardless, I think the smartest thing would be to narrow down what career you want and try to shape your major choice around that, instead of the other way around. Because otherwise you could major in something but have very little idea of what jobs are available in that field.",
              "author": "postmaloneismediocre",
              "created": 1632193858,
              "upvotes": 2,
              "replies": {
                "hdoduxt": {
                  "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdoduxt/",
                  "text": "Yeah, I understand that viewpoint. The way I see it however is that I will need additional schooling regardless of which path I take. I could get my BSN for nursing in only 2 years at my local community college. Also, I could get my MBA if I really wanted to get serious and advance in business. Yet, I have heard through others that Anthropology is a great stepping stone for either, and know others that have gone into both these fields with similar degrees. Right now the minor I am considering in is just \"general business\" but I go to a very prestigious college in regards to our business school. I will definitely talk it over with my academic counselor, but I feel both pathways I am considering, this degree opens it up to both. Thank you so much for your advice though, I will definitely reconsider some things and I guess see more into what careers it could yield.",
                  "author": "elijah_gahn",
                  "created": 1632194866,
                  "upvotes": 1,
                  "replies": {
                    "hdoeivi": {
                      "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdoeivi/",
                      "text": "The way I see it is that this is a game of odds. You're right, there are tons of people with non quantitative, liberal arts degrees who go into business. English, history, sociology majors from Harvard and Princeton often go to work in finance. But generally, a quantitative/business major such as econ, finance, accounting, math or stats will make it easier to get interviews and could give you a some additional skills in certain domains of business. So purely from a practical point of view, I think the choice is clear. If you want to take a gamble on something you find more interesting, but with less application though, you are free to do so, just understand that it does not align as closely with what you want to do in the future, and it is possible you may incur a penalty as a result.\n\nBut yeah, I would recommend seeing if you could transfer to the business school. I think that would make the most sense given your circumstances.",
                      "author": "postmaloneismediocre",
                      "created": 1632195237,
                      "upvotes": 1,
                      "replies": {
                        "hdog020": {
                          "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdog020/",
                          "text": "Ok, that makes sense, and I can see the benefit in that. On another note though, what are your thoughts on a co-major? If I were to keep the anthropology major, add on a business co-major, then perhaps a more concentrated/particular business minor, would that make me stand out anymore? I've also considered that I could double major in anthropology and data analytics or economics (as these are all in our college of arts and science) which could also be a good choice perhaps? My only fear with switching to the business school as my primary major is that it almost would be like starting from scratch and I most likely won't be able to minor or co-major in anything else to graduate on time (which makes me nervous if I find I don't fully love business).",
                          "author": "elijah_gahn",
                          "created": 1632196057,
                          "upvotes": 1,
                          "replies": {
                            "hdogpmg": {
                              "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdogpmg/",
                              "text": "By co major do you mean double major (as in, upon graduating you have a major in both anthro and business?) If so, I think that's a very good option. I think double majoring is a great experience since it exposes you thoroughly to many different subjects. I would have done it if I had decided earlier in my college career what I wanted to major in, but I kind of ran out of time, lol.\n\nEcon + anthropology or data analytics + anthropology I think are versatile combinations. Both econ or data analytics are often held by people going into business, and I think anthropology would give you a more rounded education. If you choose that combo, finance or data science/analysis could be good career paths.",
                              "author": "postmaloneismediocre",
                              "created": 1632196459,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hdjqxpw": {
      "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdjqxpw/",
      "text": "I felt this. I’m in my senior year and I’ve switched majors I think 3 times now. It’s hard to know what you like until you switch! Switching made me happier - I won’t make nearly as much money with the new major but it’s so worth the switch.",
      "author": "oopsypoopsy12",
      "created": 1632107709,
      "upvotes": 2,
      "replies": {}
    },
    "hdjcse1": {
      "link": "/r/college/comments/prkqp6/help_with_switching_majorsadvice/hdjcse1/",
      "text": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
      "author": "hotlinehelpbot",
      "created": 1632100778,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634050541
}