{
  "sid": "qneuhr",
  "link": "/r/college/comments/qneuhr/efc_vs_in_state_tuition_at_my_state_school/",
  "title:": "EFC vs in state tuition at my state school?",
  "text": "My state school is Rutgers and i'm really overqualified. I have a 1550 sat, 4.56 weighted GPA, 3 seasons of sports, and enough extracurriculars. I got accurate enough info (I think) about my parents finances to run through the EFC calculator for a few universities and I got odd results.\n\n&#x200B;\n\nFor Williams - my EFC was 28k, and Rutgers in state tuition is 30k. Some places say Rutgers in state is 16k however. I would need this financial aid to be able to afford to go to a school that is not Rutgers. What is the actual price of a Rutgers in state education, and what are my options?",
  "author": "Throwaawy12738172983",
  "created": 1636129734,
  "updated": 1636187930,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjfsf71": {
      "link": "/r/college/comments/qneuhr/efc_vs_in_state_tuition_at_my_state_school/hjfsf71/",
      "text": "Why do you think your EFCs are odd? Is Williams Rutgers?\n\nNo one here can tell you how much you'll pay. You'd have to contact the uni about that. \n\nHave you completed the FAFSA yet? You'd want to do that. You should also apply for state aid and scholarships.",
      "author": "IwriteIread",
      "created": 1636132371,
      "upvotes": 1,
      "replies": {}
    },
    "hjgivp5": {
      "link": "/r/college/comments/qneuhr/efc_vs_in_state_tuition_at_my_state_school/hjgivp5/",
      "text": "EFC is not what you will actually pay EFC is the number from FAFSA that estimates how much your family can contribute. You can have an EFC of 50k and a full ride merit scholarship and pay $0. Are you saying you ran the net price calculator for the school? Remember those calculators tell you total cost of attendance which includes room and board estimates not just tuition",
      "author": "Concerned-23",
      "created": 1636142432,
      "upvotes": 1,
      "replies": {}
    },
    "hjguexl": {
      "link": "/r/college/comments/qneuhr/efc_vs_in_state_tuition_at_my_state_school/hjguexl/",
      "text": "All schools publish the estimated annual costs on their website.",
      "author": "WCCobra",
      "created": 1636146780,
      "upvotes": 1,
      "replies": {}
    }
  }
}