{
  "sid": "qdonol",
  "link": "/r/college/comments/qdonol/if_my_family_is_low_income_would_i_be_able_to_go/",
  "title:": "If my family is low income, would I be able to go out of state?",
  "text": "My brother goes to Uni and he is able to afford it because he is in state. Our efc is 0 because of the pandemic this year. I’m not sure if I will be able to afford out of state because even with a low efc my brother still has to loan 5k. The tuition for out of state college insane. \n\nIf you were low income, did your financial aid cover everything including housing?",
  "author": "minidare56",
  "created": 1634931849,
  "updated": 1635184693,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hho2rmz": {
      "link": "/r/college/comments/qdonol/if_my_family_is_low_income_would_i_be_able_to_go/hho2rmz/",
      "text": "Cost of attendance for out of state schools are usually upwards of $20k/year. The Pell grant max (given to those with an EFC of 0) is only about $5-6k meaning it probably wont cover all costs of attendance. You will either have to take out loans and/or check if the school provides need based scholarships or consider community college.",
      "author": "danielr088",
      "created": 1634936518,
      "upvotes": 2,
      "replies": {}
    },
    "hhoksfa": {
      "link": "/r/college/comments/qdonol/if_my_family_is_low_income_would_i_be_able_to_go/hhoksfa/",
      "text": "Out of state state schools may be unaffordable. But a private with good aid could be an option if you want to be out of state.",
      "author": "Katherington",
      "created": 1634945144,
      "upvotes": 1,
      "replies": {}
    },
    "hhovgh5": {
      "link": "/r/college/comments/qdonol/if_my_family_is_low_income_would_i_be_able_to_go/hhovgh5/",
      "text": "It strictly depends on the college. As well as you, I come from a low income family and I’m applying to need-blind colleges. That means that cost will not be an impediment to attend once I’m accepted. Moreover, I remember that in some college website I read something like “If you can pay just a little amount, we pay the rest”",
      "author": "ImCerc4u",
      "created": 1634950611,
      "upvotes": 1,
      "replies": {}
    },
    "hhp5ily": {
      "link": "/r/college/comments/qdonol/if_my_family_is_low_income_would_i_be_able_to_go/hhp5ily/",
      "text": "If you really want to go out of state it doesn’t hurt to try. I’m an out of state student because I got so much financial aid from my school that it actually made it way cheaper than any of the in state schools I got accepted to. I am planning on transferring so I’m hoping it’ll be like that at my next school. I would definitely recommend looking at schools in surrounding states to see if they have a border state discount.",
      "author": "SundropsPop",
      "created": 1634955797,
      "upvotes": 1,
      "replies": {}
    },
    "hhqcnls": {
      "link": "/r/college/comments/qdonol/if_my_family_is_low_income_would_i_be_able_to_go/hhqcnls/",
      "text": "You can apply to them and see if they offer you any financial aid packages but, I would say 90% of the time, out of state is about 3x-5x more expensive than in state. 5k in loans isn’t too bad. Rule of thumb is to not take more loans out than what you expect to make your first year. \n\nSo if you expect to make 40K Your first year working, try to take out less than that in loans. Of course, the least amount of loans you can take out the better. Sometimes that means commuting instead of dorming.",
      "author": "mudpuppyy",
      "created": 1634988384,
      "upvotes": 1,
      "replies": {}
    }
  }
}