{
  "sid": "im1kpg",
  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/",
  "title:": "Sent home after two weeks of classes",
  "text": "If you’ve seen the news in the US, you may have heard about my college, SUNY Oneonta. I moved there on the 17th of August and classes started on the 24th. I am back home. I left on Monday after exactly three weeks being there, concerned for my safety.\n\nI’m a freshman, and I would not be afraid to admit that my peers are the reason why we were sent home. Covid cases spiked like crazy, and at 200 cases the school announced a 2 week shut down. That’s when I decided to go home for the rest of the semester. Only three days later, -today- the cases are now at almost 400 and we have learned everyone is being sent home for the rest of the semester. \n\nI took two tests and am thankfully negative. Though I cannot assure the same for my peers as I already know a few people from my dorm who were not as lucky.\n\nAny questions?\nAsk away.\n\nEdit: I left Reddit for a few days while moving back home and getting my routine adjusted... just came back to the awards and so so many comments which I’ll try to get to! \nThank you guys for all the love! (˶‾᷄ ⁻̫ ‾᷅˵)\n\n(Also cases are now at 700 so I’m really glad I came home lol)",
  "author": "SeulkiHyu",
  "created": 1599165144,
  "over_18": false,
  "upvotes": 1705,
  "upvote_ratio": 0.98,
  "comments": {
    "g457j16": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g457j16/",
      "text": "As unfortunate as that is OP, I wish my school would have just cut all ties and done the same. We have full floors of dorms on lockdown. All because they refuse to close the campus and give us our money back.",
      "author": "rennxpenn",
      "created": 1599326598,
      "upvotes": 1,
      "replies": {
        "g4jkm2w": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jkm2w/",
          "text": "I understand the risk of sending everyone home, because that could get others sick, but schools should have had a better plan in the long run on what to do with affected students, so healthy students wouldn’t have to suffer too.",
          "author": "SeulkiHyu",
          "created": 1599657476,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g4348wh": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4348wh/",
      "text": "Meanwhile there are no covid cases at college (cause I’m at a small college in a state that has barely no cases recently) and my college has been cracking down on parties and large gatherings. They kicked out 30 students the other day for partying, and they took all the chairs out of the dining hall last week because people weren’t social distancing (and they havent said when theyre gonna put the chairs back. They also said we can’t have any more social events because people were partying without social distancing (but they were wearing masks)\n\nI gotta be honest...I miss home. I miss walking through the park and eating good Chinese food.",
      "author": "RandomRedditor44",
      "created": 1599283340,
      "upvotes": 1,
      "replies": {
        "g4jks91": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jks91/",
          "text": "My dining halls had no seats from the beginning. I guess it’s taken a little different in a smaller school. As for the students getting kicked out, that happened at my school too which I don’t think was the best idea honestly. If they were sent home and infected, they just got their whole family sick.",
          "author": "SeulkiHyu",
          "created": 1599657586,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g41ncol": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g41ncol/",
      "text": "Yeah this is why i told everyone to rent an apartment instead of a dorm with thier financial aid. Any student going back to school thinking they wouldnt get sent back home is naive. CSUS (my school) lasted one day before the first kid died and shut down the rest of the school supposedly. We were like 90% online as it was, but they let people stay in dorms on campus. I have all online classes and dont live on campus so it hasnt affected me.",
      "author": "Cerenya",
      "created": 1599254464,
      "upvotes": 1,
      "replies": {
        "g4jku3y": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jku3y/",
          "text": "Oh my god you had a death? I’m so sorry for that!",
          "author": "SeulkiHyu",
          "created": 1599657618,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g41f63f": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g41f63f/",
      "text": "We only have 4 cases at my uni. There’s about 9-10k students. So it could be worse. But all classes are online unless you’re a freshman",
      "author": null,
      "created": 1599252018,
      "upvotes": 1,
      "replies": {
        "g4jkvu2": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jkvu2/",
          "text": "Pretty much all classes were online for every grade level, except a few labs",
          "author": "SeulkiHyu",
          "created": 1599657649,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g41bj81": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g41bj81/",
      "text": "My schools at 500+ cases, 2% of students have caught it, double from the last week. Greek students are at 8%, actually a bit down from 10%. Everyone seems to be betting we may get sent home after the tuition refund period ends.",
      "author": "TWR3545",
      "created": 1599250810,
      "upvotes": 1,
      "replies": {
        "g4jkwzs": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jkwzs/",
          "text": "Of course *after* the refund ends lol",
          "author": "SeulkiHyu",
          "created": 1599657669,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g40pmup": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40pmup/",
      "text": "wow, congrats in your school taking that step though. i'm not at illinois state university yet but i live in the town that it's in and so i get isu news, they are at 1,000+ cases with no word or anyone being sent home. it's absolutely terrible",
      "author": "ronie-kaye",
      "created": 1599243443,
      "upvotes": 1,
      "replies": {
        "g4jkylk": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jkylk/",
          "text": "That’s absolutely terrible. I hope you’re staying safe and healthy!!",
          "author": "SeulkiHyu",
          "created": 1599657697,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g40pjcg": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40pjcg/",
      "text": "i go to a suny school as well but i didnt move back on campus this semester. our school has no cases yet despite being v close to nyc and they’re about to implement pool testing. i think it’s a school culture difference bc people are taking it p seriously at my school",
      "author": "Flightstar",
      "created": 1599243411,
      "upvotes": 1,
      "replies": {
        "g4jl8d6": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jl8d6/",
          "text": "We started pool testing after the first week and that’s when the cases really started showing up. Best of luck to your school and for your online learning!",
          "author": "SeulkiHyu",
          "created": 1599657866,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g40hxcj": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40hxcj/",
      "text": "We are at 1500 but they still refuse to send us home, they even made people move out of their dorm rooms to provide more isolation space. But hey, college football profits over lives am I right?",
      "author": "No_God_Here",
      "created": 1599241035,
      "upvotes": 3,
      "replies": {
        "g4jnixg": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jnixg/",
          "text": "College sports are gross. I don’t make the rules. \nOn a serious note, i hope everything is going okay for you and that you stay happy and healthy!",
          "author": "SeulkiHyu",
          "created": 1599659275,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g40hl5q": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40hl5q/",
      "text": "The unfortunate truth is that it is not your peers fault that you got sent home. It’s the schools fault for opening up in the first place. Did you get sent home in two weeks because people were being stupid and throwing parties? yeah but you would’ve gotten sent home anyway. The reason they opened up is so that you would have to pay for housing and school and then when things got bad they could just send you home and seem like heroes because they’re doing what they should be. Everybody pinning The spread of an extremely infectious disease on other students allows the school to get away with this. They put a bunch of young people (Who scientifically are bad at making good decisions) in close quarters together so that they could get your money. It is predatory as hell. They take advantage of young people who are excited to go to school for the first time and get out of their parents house desperate for their first taste of freedom. And put you guys in a situation where you could get sick.\nEdit: spelling and grammar",
      "author": "number-one-jew",
      "created": 1599240925,
      "upvotes": 3,
      "replies": {
        "g4jnt8f": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jnt8f/",
          "text": "I agree wholeheartedly with everything you just said. I wish people were more considerate, and that money didn’t corrupt the humanity of people.",
          "author": "SeulkiHyu",
          "created": 1599659442,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g40dcoe": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40dcoe/",
      "text": "Your peers really fucked it up for my roommate and I. Both of us come from abusive, toxic households and moved in the earliest time slot on the first day to get away. We don’t even know if we’ll get approved for the exemptions. I hope everyone had fun at those parties. I don’t understand why on earth oney didnt shut down sororities beforehand.",
      "author": "cleanurcloset",
      "created": 1599239516,
      "upvotes": 3,
      "replies": {
        "g4jny38": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jny38/",
          "text": "I made a friend who had a bad home life and she was stressing how bad she didn’t want to go home. I feel absolutely awful that people were so inconsiderate of other people’s situations. I really hope you and your roommate are okay. Shoot me a message if you wanna talk ❤️",
          "author": "SeulkiHyu",
          "created": 1599659522,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3zta2k": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zta2k/",
      "text": "I’m so sorry you went through that. The students are acting like idiots, but what else did colleges expect? They set up everyone to fail",
      "author": "ahof8191",
      "created": 1599232560,
      "upvotes": 1,
      "replies": {
        "g4jl9t7": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jl9t7/",
          "text": "Exactly. I had a feeling we weren’t going to last until November, my friends didn’t believe me lol.",
          "author": "SeulkiHyu",
          "created": 1599657892,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g3zomuw": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zomuw/",
      "text": "Reading y'alls posts about your schools is terrifying. I go to a really small SUNY (ESF) and we've only had one case so far. If things continue to go well we could make it to November.",
      "author": "Scalyboi228",
      "created": 1599230943,
      "upvotes": 1,
      "replies": {
        "g4jldfm": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jldfm/",
          "text": "Smaller schools I think have either a much higher risk getting sent home with such small numbers due to ratio, but also such a low risk because of the amount of students in itself. It’s really a lottery. I hope your school makes it!!",
          "author": "SeulkiHyu",
          "created": 1599657955,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g3zol5h": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zol5h/",
      "text": "I attend a private college and we’ve only had a total of 2 (confirmed) cases on campus and it’s been 3 weeks as well",
      "author": "septic_sofa",
      "created": 1599230925,
      "upvotes": 1,
      "replies": {
        "g4jlfb1": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jlfb1/",
          "text": "I’m glad some schools are handling cases better. Best of luck to you!",
          "author": "SeulkiHyu",
          "created": 1599657988,
          "upvotes": 2,
          "replies": {
            "g4jls4v": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jls4v/",
              "text": "thank you!",
              "author": "septic_sofa",
              "created": 1599658208,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g3zo5bo": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zo5bo/",
      "text": "My prediction is that my university will close before the end of the month. Parties are still happening, people are lax about masks, and testing is only recommended even though it's free. I still don't see why we moved in in the first place.",
      "author": "MintyChewingGum",
      "created": 1599230741,
      "upvotes": 1,
      "replies": {
        "g4jlgej": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jlgej/",
          "text": "That what I said about mine and no one believed me. And here we are.",
          "author": "SeulkiHyu",
          "created": 1599658007,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g3z5ns8": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3z5ns8/",
      "text": "Darn, UofSC has 1000-2000 cases atm and said they have no intention of shutting down anytime soon. They just shut down their walk up testing because the head of the lab got sick.",
      "author": "omanagan",
      "created": 1599223601,
      "upvotes": 1,
      "replies": {
        "g4jlimd": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jlimd/",
          "text": "Yeah that’s absolutely insane. A lot of the big state universities have so many cases and are doing nothing about it ):",
          "author": "SeulkiHyu",
          "created": 1599658044,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3yweji": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yweji/",
      "text": "This is the stupidest move. Sending potentially infectious kids back home to their families is idotic",
      "author": "McChickenFingers",
      "created": 1599218284,
      "upvotes": 1,
      "replies": {
        "g4jls9r": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jls9r/",
          "text": "All of the students that tested positive were stuck on campus to isolate. Negative students went home and were pushed to get individual tests. Of course some people that were positive going home is inevitable, but I feel it would’ve been the same if we were sent home in November which was the original plan.",
          "author": "SeulkiHyu",
          "created": 1599658210,
          "upvotes": 2,
          "replies": {}
        },
        "g401ffu": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g401ffu/",
          "text": "Only negative tested people are leaving.  Positive tests are quarantining.",
          "author": null,
          "created": 1599235372,
          "upvotes": 1,
          "replies": {
            "g40jec6": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40jec6/",
              "text": "Still though. If they’ve been cleared by the mitigation tests, those have a high false positive and likely a high false negative rate. Best think to do would be to keep everybody here at least until Thanksgiving.",
              "author": "McChickenFingers",
              "created": 1599241522,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3yi5v4": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yi5v4/",
      "text": "We’re over 1,000 cases and we’re pretending all is well 😭😭😭😭 I adore my school, but this ain’t it. \n\nBet you can guess where I go lol",
      "author": "ChellyBellyBean98",
      "created": 1599204313,
      "upvotes": 3,
      "replies": {
        "g40y1pg": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40y1pg/",
          "text": "That's insane to me! My school has that many people on campus, it hard to imagine just everyone here having covid...",
          "author": "kdf1245",
          "created": 1599246274,
          "upvotes": 3,
          "replies": {
            "g4jnnu1": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jnnu1/",
              "text": "Small schools are either safe or extremely at risk and I feel there’s no telling which way it’ll go. Good luck!!",
              "author": "SeulkiHyu",
              "created": 1599659354,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g4jnm3m": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jnm3m/",
          "text": "I assume a state university?",
          "author": "SeulkiHyu",
          "created": 1599659328,
          "upvotes": 2,
          "replies": {
            "g4lhogp": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4lhogp/",
              "text": "Yep haha",
              "author": "ChellyBellyBean98",
              "created": 1599692329,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g3yb2xu": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yb2xu/",
      "text": "As much as the parties may be at fault, Oneonta is one of the only schools that didn't tests students before allowing them to come this year. I went to SUNY Oneonta as well and I loved it so much, but administration plays a key role and they dropped the ball.",
      "author": "Sammichelle",
      "created": 1599198045,
      "upvotes": 1,
      "replies": {
        "g401xhb": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g401xhb/",
          "text": "All SUNY schools followed the same guidelines, testing wasn't mandatory across the board and it was all self-reporting.  7 day quarantine before returning to school, 14 days if you had traveled to an \"at risk\" area.",
          "author": null,
          "created": 1599235543,
          "upvotes": 1,
          "replies": {}
        },
        "g4jm4jo": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jm4jo/",
          "text": "Yeah people are saying that oneonta is one of the few SUNYs that didn’t require tests. A lot of my friends went to schools where testing was mandatory.",
          "author": "SeulkiHyu",
          "created": 1599658425,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3yb0pp": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yb0pp/",
      "text": "I’m a freshman at Missouri State University. I was on campus from my move in date (August 15) to the following Friday (August 21) because my roommate and suite mates went to some frat parties and got me sick. I’ve been at home for 2 weeks now after less than a week on campus. Our cases are up to above 350 for the week now, and I’m just waiting to be sent back home as soon as I go back to campus on Labor Day. Assuming campus shuts down for the semester, I’m probably going to do online next semester and just save the hassle.",
      "author": "Bacca_Boi_",
      "created": 1599197997,
      "upvotes": 1,
      "replies": {
        "g4jm91z": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jm91z/",
          "text": "I’m so sorry your roommates were inconsiderate. My roommates friend was infected by her roommate. The girl infected didn’t party at all but her roommate did and she suffered the consequences",
          "author": "SeulkiHyu",
          "created": 1599658504,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3y9j33": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y9j33/",
      "text": "My university is in the Midwest and we just hit 200 cases, I assume it’s closing shortly. There were 124 confirmed cases between the first day of class, Aug. 31 and Sept 2. I’m a junior and I have an apartment, so if/when we shut down, I don’t have the luxury of going home lol. \n\nWhat were the procedures for you guys on campus? Did you have to wear masks outside or just indoors and in classrooms?",
      "author": "AfterAmbition",
      "created": 1599196831,
      "upvotes": 0,
      "replies": {
        "g4jk5um": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jk5um/",
          "text": "We were to wear masks everywhere. When we were outside it wasn’t enforced, but people with basic human decency would wear their masks outside whenever passing people. We could take them off in dorm rooms if we were comfortable with it. There were only four students allowed in dorm room at once, masks always on in the res hall If you’re not in your room. It was crazy.",
          "author": "SeulkiHyu",
          "created": 1599657189,
          "upvotes": 1,
          "replies": {
            "g4o54iw": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4o54iw/",
              "text": "And even with all of those precautions it still got that bad, leaves me with little hope for the rest of us.",
              "author": "AfterAmbition",
              "created": 1599742723,
              "upvotes": 2,
              "replies": {
                "g4qrw26": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4qrw26/",
                  "text": "Exactly. Best of luck to you~",
                  "author": "SeulkiHyu",
                  "created": 1599769834,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "g3y7xis": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y7xis/",
      "text": "Just moved in on the 24th of August. We’re not getting a refund and I just found out an entire floor of our dorms is being quarantined. I’m distraught.",
      "author": "dazmynjebono",
      "created": 1599195625,
      "upvotes": 1,
      "replies": {
        "g4jmaeb": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmaeb/",
          "text": "I’m so sorry you’re going through this. Schools are not handling this well AT ALL.",
          "author": "SeulkiHyu",
          "created": 1599658527,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3y3mml": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y3mml/",
      "text": "200 cases caused a shutdown? We have 400 and nothing has happened",
      "author": "cdevaney66",
      "created": 1599192666,
      "upvotes": 1,
      "replies": {
        "g3y4nb7": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y4nb7/",
          "text": "State rules we can’t go over 100 in 1 week",
          "author": "GMan_SB",
          "created": 1599193323,
          "upvotes": 2,
          "replies": {
            "g3y7ex9": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y7ex9/",
              "text": "Haha Alabama doesn't care about safety",
              "author": "cdevaney66",
              "created": 1599195246,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g4jmcbt": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmcbt/",
          "text": "It also depends on numbers, we only have about 5k students (maybe even less) on campus",
          "author": "SeulkiHyu",
          "created": 1599658559,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3y32qb": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y32qb/",
      "text": "You don't say how many students th3 campus has, so the numbers don't have much context",
      "author": "mikeblas",
      "created": 1599192301,
      "upvotes": 0,
      "replies": {
        "g4jjzp9": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jjzp9/",
          "text": "Ah my apologies, on campus there were around 5-6,000? I don’t have the exact number I’m sorry",
          "author": "SeulkiHyu",
          "created": 1599657081,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3y111a": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y111a/",
      "text": "Was this because of partying? I remember hearing about this here in SUNY Cobleskill.",
      "author": "redsockman22",
      "created": 1599191005,
      "upvotes": 0,
      "replies": {
        "g4jk77k": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jk77k/",
          "text": "Yep, people partied every damn night. I’m so ashamed of my peers honestly.",
          "author": "SeulkiHyu",
          "created": 1599657214,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g3y0rv8": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y0rv8/",
      "text": "Ohio State has announced anything and I believe we are at somewhere between 800-900 cases. Off campus is not looking good and they don’t have enough isolation rooms I don’t think...",
      "author": "Rickbar1",
      "created": 1599190850,
      "upvotes": 2,
      "replies": {
        "g4jmld1": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmld1/",
          "text": "So many flaws in preparations",
          "author": "SeulkiHyu",
          "created": 1599658714,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xwkob": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xwkob/",
      "text": "So we are getting refunded for housing and no offense to Freshman but they kinda dropped the ball on this one. But with that said so many upperclassmen did too. It sucks so much my sophomore year is essentially gone after my second freshman semester was too. Oneonta did a shit job handling things too so blame the people in charge more.",
      "author": "Sonoftheone1119",
      "created": 1599188343,
      "upvotes": 1,
      "replies": {
        "g4jkiax": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jkiax/",
          "text": "Yeah no I totally agree, it was known amongst the freshman that hulbert res hall was going crazy with parties, and frats and sororities were hosting them too. I’m so sorry your college experience has sucked ): this is definitely not how we wanted to experience SUCO, huh?",
          "author": "SeulkiHyu",
          "created": 1599657410,
          "upvotes": 1,
          "replies": {
            "g4jv9wm": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jv9wm/",
              "text": "Not at all dude it's a good school overall the way the administration handled crisis's is horrible but it's good overall. Hopefully we all have a better next year because I've written off this spring semester as well. I just hope the Freshman who fucked everyone over see some sort of administrative punishment.",
              "author": "Sonoftheone1119",
              "created": 1599663524,
              "upvotes": 2,
              "replies": {
                "g4lh8sr": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4lh8sr/",
                  "text": "I’m not counting on going back in the spring at this point, but if it saves me money, cool I’ll take it. As for the freshman (and upper class men) who were irresponsible, I hope they get the punishment they deserve.",
                  "author": "SeulkiHyu",
                  "created": 1599692110,
                  "upvotes": 1,
                  "replies": {
                    "g4liqx6": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4liqx6/",
                      "text": "Word I shouldn't just say Freshman. It's the upper class mens fault for throwing the parties if they did just as much as the people who attended if not more dude. Stay safe and have a good semester if you can.",
                      "author": "Sonoftheone1119",
                      "created": 1599692912,
                      "upvotes": 2,
                      "replies": {
                        "g4qtemi": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4qtemi/",
                          "text": "Yeah, you stay safe too man. Hopefully things will get better, and we may even go back to campus in the spring. (Not counting on it though.) I miss Mills’ quesadillas haha",
                          "author": "SeulkiHyu",
                          "created": 1599770190,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g3xwfkt": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xwfkt/",
      "text": "Hi! I’m a junior at Oneonta! What the FUCK is wRONG with our adMINISTRATION AND STUFENT BODY",
      "author": "Jarde15",
      "created": 1599188261,
      "upvotes": -1,
      "replies": {
        "g4jk81f": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jk81f/",
          "text": "Periodt king/queen",
          "author": "SeulkiHyu",
          "created": 1599657228,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xvck0": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xvck0/",
      "text": "My university began in person classes the same day. We have no cases rn somehow, though.",
      "author": "Severe-Retard",
      "created": 1599187625,
      "upvotes": 1,
      "replies": {
        "g4jkbe5": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jkbe5/",
          "text": "My school is unfortunately a known party school, there were parties EVERYWHERE. \n(I didn’t go for the parties, they also have an amazing program for childhood ed majors which is why I went :/)",
          "author": "SeulkiHyu",
          "created": 1599657288,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xuj2n": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xuj2n/",
      "text": "Oh my lord that sucks... I hope your school actually tries to help you because I know my university would be purposely ignoring me until I called 4 times straight to just get my refund processes after it was late 5 weeks.",
      "author": null,
      "created": 1599187141,
      "upvotes": 1,
      "replies": {
        "g4jkcwm": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jkcwm/",
          "text": "I’ve called a few times with no answer, but when I did finally get through they were super understanding and nice!",
          "author": "SeulkiHyu",
          "created": 1599657314,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xsj7v": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xsj7v/",
      "text": "I work at a very large university. We're delaying dorm move-in for 2 weeks and then putting in curfews for the following weeks. Class start next week.\n\nI can work from home so I'm not allowed back in my campus office until 2021 (which is fine by me).\n\nI'm pretty sure despite all of the precautions that we will need to move to 100% remote learning. Cases are already showing up in our student athletes.\n\nIt's anything but business as usual.",
      "author": "Petronella17",
      "created": 1599185978,
      "upvotes": 4,
      "replies": {
        "g4jn4pv": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jn4pv/",
          "text": "Business as usual is the what way to describe this lmao",
          "author": "SeulkiHyu",
          "created": 1599659040,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xrtnh": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xrtnh/",
      "text": "[deleted]",
      "author": null,
      "created": 1599185565,
      "upvotes": 2,
      "replies": {
        "g4jmnog": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmnog/",
          "text": "Awe thank you!! Go red dragons 🐉❤️",
          "author": "SeulkiHyu",
          "created": 1599658754,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xqk52": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xqk52/",
      "text": "I honestly don't understand any of this. Are these schools just not testing students? Are the students at these schools just too stupid and selfish to wear masks and social distance?",
      "author": "Ruth_Badar_Ginsburg",
      "created": 1599184846,
      "upvotes": 2,
      "replies": {
        "g3y38sq": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y38sq/",
          "text": "My school has not required any testing so far. For a couple days, literally HUNDREDS of students were gathering on the volleyball courts, NO MASKS, no social distancing, for several days! People in the facebook group were saying they’re just trying to have fun before we get sent home, that if it wasn’t safe then administration would’ve said something, etc. Absolutely baffling. Haven’t seen anyone out there the last few days, but all it would’ve taken is one of those students to get everyone else sick, and without any testing, who knows!",
          "author": "qxeen",
          "created": 1599192411,
          "upvotes": 7,
          "replies": {
            "g3y8ay0": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y8ay0/",
              "text": "That's crazy. At my school, you're required to quarantine in your room until you've received two negative, and during that time you're aren't allowed to leave your room except for the bathroom and picking up delivered meals on the first floor. After the initial in-room quarantine period, we are tested twice a week, and aren't allowed to leave campus. If you are anywhere other than your room and suite common room, you must wear a mask and keep six feet apart. All meals are take-out and clubs are not allowed to meet in person. All gatherings must be kept to at most ten people, and everyone must be wear masks and social distance. Any violation of the testing, quarantine, and gathering regulations results in immediate removal from campus. So far, one student violated quarantine by attempting to test their swipe card access to a building while on there way from the initial test to their dorm, and they were disciplined within the hour. Since then, we haven't had any other known violations.  \n\nWith student life so restricted at my school, I just don't understand how other schools can pretend like nothing's going on. I'm also  surprised by this equal but opposite attitude of \"it's going to fail inevitably, so might as well do what we want\". Covid at colleges is a serious issue that requires taking serious restrictions, but it can still be navigating by adhering to those restrictions. If you pretend it isn't going to work, it isn't going to work. At that point, you're just shooting yourself in the foot.",
              "author": "Ruth_Badar_Ginsburg",
              "created": 1599195900,
              "upvotes": 4,
              "replies": {
                "g4jneqv": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jneqv/",
                  "text": "It seems oppressive but it’s a smart way to assure everyone is healthy. If you want to live on campus I guess these sacrifices have to be made. Best of luck to you!",
                  "author": "SeulkiHyu",
                  "created": 1599659206,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g4jn8o9": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jn8o9/",
          "text": "SUCO didn’t require testing before we came to campus. We have mask rules but of course not everyone is going to follow them because people are inconsiderate and selfish.",
          "author": "SeulkiHyu",
          "created": 1599659105,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xnrbs": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xnrbs/",
      "text": ">the cases are now at almost 400 and we have learned everyone is being sent home for the rest of the semester.\n\nGREAT! Let's send all of the possibly infected people back to their home cities spread it there! I really wish colleges would have thought about this more or planned better.",
      "author": "myalwaysthrowaway",
      "created": 1599183278,
      "upvotes": 42,
      "replies": {
        "g3zb3cp": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zb3cp/",
          "text": "I go to Oneonta and am currently still on campus atm. They're actually only letting people who tested negative go home and everyone who tests positive stays for two weeks and takes another test until they get a negative result.",
          "author": "spookyclownsscareme",
          "created": 1599225957,
          "upvotes": 16,
          "replies": {
            "g3zjp0y": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zjp0y/",
              "text": "Well that is actually reassuring good to know.",
              "author": "myalwaysthrowaway",
              "created": 1599229188,
              "upvotes": 7,
              "replies": {}
            },
            "g4jq708": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jq708/",
              "text": "^^^\nI, and a lot of other students who went home, took a second test just to make sure. They handled the going home situation pretty well.",
              "author": "SeulkiHyu",
              "created": 1599660809,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "g3xl6vr": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xl6vr/",
      "text": "“We are absolutely shocked, *shocked*!”\n-administration\n\n“We are absolutely not!”\n-anyone who has interacted with undergraduates\n\nSorry you’re dealing with this, glad you’re safe though.",
      "author": "General_Lee_Wright",
      "created": 1599181929,
      "upvotes": 29,
      "replies": {
        "g4jq1ti": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jq1ti/",
          "text": "Thanks, I hope all is well for you (:",
          "author": "SeulkiHyu",
          "created": 1599660726,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "g3xj2he": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xj2he/",
      "text": "[deleted]",
      "author": null,
      "created": 1599180745,
      "upvotes": 18,
      "replies": {
        "g4joy9y": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4joy9y/",
          "text": "I regret not staying home in the first place. I’m glad I’m getting my money back because I had paid off this entire semester in cash. That’ll help me save for next semester. It’s unfortunate that oneonta is a party school, because I chose to go there because of their great Ed major program. Hope you’re safe and healthy as well!",
          "author": "SeulkiHyu",
          "created": 1599660101,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xg7k2": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xg7k2/",
      "text": "I really hope my school moves online shortly... 1,100+ cases after a week and a half and that’s without mandatory testing. Thankfully almost everything of mine is online already",
      "author": "rbeck337",
      "created": 1599179193,
      "upvotes": 3,
      "replies": {
        "g4jnfud": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jnfud/",
          "text": "Oh god, I hope you stay healthy and safe!",
          "author": "SeulkiHyu",
          "created": 1599659225,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3xdlwp": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xdlwp/",
      "text": "My school’s cases are spiking right now. I’m self-quarantining because 2 of my coworkers just tested positive and 3 others are in mandatory quarantine until their test results get back. My school never contacted me, even though I worked with every student who got sick at my work place, so I’m extremely concerned that they aren’t doing any contact tracing. So far 3 entire sports teams are in isolation, and the cases are still climbing. I’m debating going completely online in the next couple of weeks before I get sick (if I’m not already, I’m getting tested Friday morning). My school is going down the same path as yours, since I’m not really sure what to do, do you wish you would have just gone home earlier?",
      "author": "kamair43",
      "created": 1599177943,
      "upvotes": 25,
      "replies": {
        "g4jppdl": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jppdl/",
          "text": "Yes, I do. I was honestly kinda miserable there because I had a hard time connecting with others due to the lockdown on everything. I wanted to get out and experience something different from home but I regret it. Assuming you’re a professor or some kind of campus staff, I really hope you stay safe. Teach in your and your students best interest. If that means online, then that’s a sacrifice that’s going to have to be made. All my professors are extremely upset with the way the virus is being handled and they feel awful for all of us. I wish you the best of luck ❤️",
          "author": "SeulkiHyu",
          "created": 1599660532,
          "upvotes": 2,
          "replies": {
            "g4m1h7s": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4m1h7s/",
              "text": "Thank you for your response, it really cemented my decision. I’m moving back to my home state and going completely remote in 3 weeks. I’m actually a student, I just work with a lot of other students (restaurant close to my school). My schools cases are at 68 right now, (about 5%), and they’re holding steady at that number, but my school is also doing an awful job at contact tracing. Contact tracers told me that they are only contacting students/faculty who were in direct contact with isolated students within 48 hours of them being tested. It’s a bad method, because most of the students don’t get tested until 3-5 days after their exposure. I’m just ready to be away from all the shadiness and corruption  of it all.",
              "author": "kamair43",
              "created": 1599702786,
              "upvotes": 2,
              "replies": {
                "g4qsn81": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4qsn81/",
                  "text": "Yeah I totally understand. I do recommend though immediately getting a covid test from your local hospital when you do get home though, in case there is a risk of you infecting others. I wasn’t able to see anyone except my parents until I got my results. Luckily I was negative.",
                  "author": "SeulkiHyu",
                  "created": 1599769994,
                  "upvotes": 1,
                  "replies": {
                    "g4rhj3o": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4rhj3o/",
                      "text": "I got tested the day after I found out and, thankfully, mine came back negative as well.",
                      "author": "kamair43",
                      "created": 1599777040,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g3xacry": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xacry/",
      "text": "[deleted]",
      "author": null,
      "created": 1599176876,
      "upvotes": -3,
      "replies": {
        "g4jjv0h": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jjv0h/",
          "text": "That’s totally okay! Also idk why you’re getting downvoted ): thanks for the concern!!",
          "author": "SeulkiHyu",
          "created": 1599656999,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3x6q9l": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x6q9l/",
      "text": "My school has gone from a 5% positivity rate to an 11% positivity rate in the last week and they haven't closed us lol",
      "author": "maybeitsmolly",
      "created": 1599175537,
      "upvotes": 8,
      "replies": {
        "g3xnpyc": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xnpyc/",
          "text": "Mine went from 13% to 28% and the only thing the did was decide fans can't go to the first football game.",
          "author": "demonangel105",
          "created": 1599183256,
          "upvotes": 6,
          "replies": {
            "g4jnzrw": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jnzrw/",
              "text": "TWENTY EIGHT",
              "author": "SeulkiHyu",
              "created": 1599659549,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "g3x5zz6": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x5zz6/",
      "text": "Almost 400 and shut down. Mean while university of South Carolina has 1000+ cases, multiple Greek quarantine, pool parties being busted, and their threat level is still low???",
      "author": "lman89607",
      "created": 1599175337,
      "upvotes": 7,
      "replies": {
        "g4jnpei": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jnpei/",
          "text": "Money > students well being and safety",
          "author": "SeulkiHyu",
          "created": 1599659380,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3x5xw2": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x5xw2/",
      "text": "What did the town of Oneonta do to prepare? I know the town of Oswego has been shutting down bars any big parties, and I'm pretty sure the school has already punished a Fraternity too.",
      "author": "mets926",
      "created": 1599175319,
      "upvotes": 2,
      "replies": {
        "g3xvla7": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xvla7/",
          "text": "Oneonta student and city resident here. A few parties were broken up, some students and greek organizations were suspended, but that's about it. We had very few if any cases before the semester started. Some testing stations popped up when some cases were found at the college, but not much else. Interestingly another college in the same city, not even a mile away, has had a much better time with covid. They barely have any cases from what I know.",
          "author": "zon_tafer",
          "created": 1599187770,
          "upvotes": 2,
          "replies": {
            "g3xwoyw": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xwoyw/",
              "text": "Interesting, do you think the town could've done a better job?",
              "author": "mets926",
              "created": 1599188414,
              "upvotes": 2,
              "replies": {
                "g3xwvmt": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xwvmt/",
                  "text": "I'm not sure. I don't see any glaring flaws in the town's response policy. This is really an issue with suny oneonta first and foremost. The college's operations allowed covid to spread, not much the town could have done that wouldn't overstep into the college's domain.",
                  "author": "zon_tafer",
                  "created": 1599188520,
                  "upvotes": 1,
                  "replies": {
                    "g4jmgc1": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmgc1/",
                      "text": "Yeah, I feel bad that the town is being affected and practically punished for the actions of Oney students.",
                      "author": "SeulkiHyu",
                      "created": 1599658629,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g4jmii7": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmii7/",
              "text": "Although, didn’t hartwick open a week or two after us? We could see cases later on-",
              "author": "SeulkiHyu",
              "created": 1599658666,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3x4z27": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x4z27/",
      "text": "Thank god my school only has 3 cases and they quarantined before even testing. The university also sends emails to EVERYONE who could have been in contact with the people. I think my school is safe, mainly cause everyone is following the rules (besides a few people outside here and there)",
      "author": "Kaitlin33101",
      "created": 1599174974,
      "upvotes": 1,
      "replies": {
        "g4jmjdz": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmjdz/",
          "text": "Must be nice",
          "author": "SeulkiHyu",
          "created": 1599658682,
          "upvotes": 2,
          "replies": {
            "g4jodik": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jodik/",
              "text": "It really is. My major is difficult online (music) because we need to use specific programs on computers and we need to access pianos, so it's great that the school is doing so well with regulations",
              "author": "Kaitlin33101",
              "created": 1599659771,
              "upvotes": 2,
              "replies": {
                "g4jqn78": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jqn78/",
                  "text": "My school’s flaw was the lack of communication. They didn’t tell us a lot besides the number of positive cases, and parents weren’t informed or anything.",
                  "author": "SeulkiHyu",
                  "created": 1599661058,
                  "upvotes": 2,
                  "replies": {
                    "g4jqwel": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jqwel/",
                      "text": "Oh wow, my school is very much on top of communication. They dedicated a page on the school website to the number of active and passed cases, and it even tells us whether the student lives on or off campus. So far, we have 6 active cases (9 others have recovered already) and they all live off campus",
                      "author": "Kaitlin33101",
                      "created": 1599661197,
                      "upvotes": 2,
                      "replies": {
                        "g4jr3wr": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jr3wr/",
                          "text": "Wow that’s amazing, I’m glad some schools are handling it so well. I really wish you the best of luck. I hope you stay happy and healthy! ❤️",
                          "author": "SeulkiHyu",
                          "created": 1599661312,
                          "upvotes": 2,
                          "replies": {
                            "g4jrljm": {
                              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jrljm/",
                              "text": "Thank you and same to you!",
                              "author": "Kaitlin33101",
                              "created": 1599661579,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "g3x4y3y": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x4y3y/",
      "text": "I am surprised they aren't requiring tests for everyone before leaving campus, and requiring anyone found positive to quarantine on campus for two weeks before leaving.",
      "author": "danielfletcher",
      "created": 1599174963,
      "upvotes": 17,
      "replies": {
        "g3xpivf": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xpivf/",
          "text": "If they send everyone home then it isn’t their problem anymore... Quarantining a bunch of people in dorms is not that easy. They probably rather save the money and keep what students paid for housing",
          "author": "toiavalle",
          "created": 1599184262,
          "upvotes": 3,
          "replies": {
            "g4joryy": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4joryy/",
              "text": "We’re getting a full refund on housing supposedly",
              "author": "SeulkiHyu",
              "created": 1599660003,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3x4oj4": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x4oj4/",
      "text": "[deleted]",
      "author": null,
      "created": 1599174864,
      "upvotes": 14,
      "replies": {
        "g4jofrd": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jofrd/",
          "text": "I live upstate too, about 30 mins from Albany. I’m just wondering when students from the capital region are going to get sent home from their huge universities, as that could pose a risk to the region.",
          "author": "SeulkiHyu",
          "created": 1599659807,
          "upvotes": 2,
          "replies": {}
        },
        "g3x66es": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x66es/",
          "text": "They aren't really \"sending them home.\" They're kicking them out of student housing. They can't keep all those people together in a dorm, it would spread like wildfire.\n\nNow, they shouldn't have made them move in in the first place, but that's a different story.",
          "author": "Bigfrostynugs",
          "created": 1599175389,
          "upvotes": 3,
          "replies": {
            "g4jogsb": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jogsb/",
              "text": "Fax",
              "author": "SeulkiHyu",
              "created": 1599659824,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3x3ah4": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x3ah4/",
      "text": "I'm so sorry this is what your first semester turned into:( I'm a senior and my college has had 4 total cases and they're still talking about shutting down. It's crazy to hear about the schools with hundreds of cases staying open.",
      "author": "heckin_cool",
      "created": 1599174415,
      "upvotes": 10,
      "replies": {
        "g4jo5m9": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jo5m9/",
          "text": "Thank you for the condolences. I am fortunate enough to be healthy and in a safe household, and back home where my boyfriend and one of my best friends are. I just hope people who aren’t as fortunate are okay ):",
          "author": "SeulkiHyu",
          "created": 1599659644,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3x2q75": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x2q75/",
      "text": "Did you have the option to go to college from home? If you did, why did you choose to stay in a dorm?",
      "author": "Nasalspray24",
      "created": 1599174191,
      "upvotes": 4,
      "replies": {
        "g3xki4y": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xki4y/",
          "text": "My mental health was suffering so much from being at home for so long that I was desperate for some kind of change even if it was risky. \n\nI mean, I just moved in today and I go to a small school that’s testing everyone over the next few days, quarantining anyone who tests positive, and continuing to randomly test samples of students each week + anyone who may have been exposed. They’re also taking a bunch of precautions and classes are hybrid leaning towards mainly online. I saw someone’s parents refusing to wear masks earlier (it’s move in day) & they legit got kicked out. It’s also a very small school with no Greek and very little party culture. I think we stand a better chance than bigger schools and schools that aren’t taking it seriously. So I’m somewhat hopeful that we could maybe make it. But I might just be naive. \n\nEven if I’m stuck in my dorm 99% of the time I’d rather be here, 800 miles from home, so that I can be independent because that helps me grow as a person.",
          "author": "IaniteThePirate",
          "created": 1599181546,
          "upvotes": 14,
          "replies": {
            "g3xkj7x": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xkj7x/",
              "text": "800 miles is 1287.48 km",
              "author": "converter-bot",
              "created": 1599181564,
              "upvotes": 4,
              "replies": {
                "g3xktrz": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xktrz/",
                  "text": "Thanks bot",
                  "author": "IaniteThePirate",
                  "created": 1599181726,
                  "upvotes": 4,
                  "replies": {}
                },
                "g4jmz6l": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmz6l/",
                  "text": "Good bot",
                  "author": "SeulkiHyu",
                  "created": 1599658948,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g4jn20k": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jn20k/",
              "text": "I wish you the best of luck in your college experience!!",
              "author": "SeulkiHyu",
              "created": 1599658995,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g3x6d4j": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x6d4j/",
          "text": "Not OP but I'm in that situation. Honestly? My parents totally don't get the risk and obviously wanted me to live on campus. Told them I give it a month.",
          "author": "BrainOnBlue",
          "created": 1599175439,
          "upvotes": 7,
          "replies": {}
        },
        "g4jmxjz": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jmxjz/",
          "text": "We did have that option, but I’m an only child and being daddy’s little girl couldn’t last forever, I needed to get out and experience more social interaction with people my age lol. I love my family dearly but I wanted a change. Told my parents I’d probably not be gone for long anyway lol",
          "author": "SeulkiHyu",
          "created": 1599658921,
          "upvotes": 1,
          "replies": {}
        },
        "g3zefsg": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zefsg/",
          "text": "Some people’s parents are abusive hehe",
          "author": "awholelottahooplah",
          "created": 1599227230,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g3x2etn": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x2etn/",
      "text": "My school also just announced today that we are online for the rest of the semester. Originally they announced we would just be online for two weeks and then come back, but nope they just announced online full semester.\n\nShocked they didn’t wait until after the tuition deadline!",
      "author": "pennypupper",
      "created": 1599174146,
      "upvotes": 28,
      "replies": {
        "g4jozlf": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jozlf/",
          "text": "Lmaooo they didn’t? They must be losing their minds",
          "author": "SeulkiHyu",
          "created": 1599660121,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3wzs2y": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wzs2y/",
      "text": "Idk why people are so surprised to be sent home tbh",
      "author": "tha_oz",
      "created": 1599173314,
      "upvotes": 48,
      "replies": {
        "g3x607d": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x607d/",
          "text": "Right? I'm fucking tired of these posts. Like what did you expect with an active pandemic?",
          "author": "Fookin_Normies",
          "created": 1599175338,
          "upvotes": 32,
          "replies": {
            "g4jp3o7": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jp3o7/",
              "text": "I- sorry I have upset you lmao, just a college kid tryna vent her frustrations, man.",
              "author": "SeulkiHyu",
              "created": 1599660186,
              "upvotes": 1,
              "replies": {}
            },
            "g3x6jkd": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x6jkd/",
              "text": "Like you can stay on campus if you want. Idrc. Just don't complain and act surprised if you guys get sent home god dammit lol",
              "author": "tha_oz",
              "created": 1599175496,
              "upvotes": -11,
              "replies": {
                "g3xniro": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xniro/",
                  "text": "It's not that simple. Not all of us were given a choice. My school is in a different state and I have in person classes not offered online. Staying home was not an option. There are a lot of people in similar situations. I'm lucky because my school promised a refund for dorming but not everyone else is as lucky. We're all expecting it but we can still be upset.",
                  "author": "demonangel105",
                  "created": 1599183142,
                  "upvotes": 15,
                  "replies": {}
                },
                "g3xbt1m": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xbt1m/",
                  "text": "No one’s surprised but it’s just not fair to expect students to pay full tuition. We paid this much to get in-person, quality classes. Online learning is not the same and the teachers acknowledge it too. My university waited until the day after tuition was due to announce that we’d be switching fully online. Pretty fucked up considering that they subject us to in person classes without even allowing us to access their health facilities. All so that we’d be more likely to stay and not defer. It’s all about money to them",
                  "author": "procrastinatinq",
                  "created": 1599177231,
                  "upvotes": 14,
                  "replies": {
                    "g3xn6zn": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xn6zn/",
                      "text": "> My university waited until the day after tuition was due to announce that we’d be switching fully online. \n\nYou seem surprised that your university did that. You should have anticipated that would happen especially with covid. If you thought that you guys would have in person classes then rip lol\n\n> Pretty fucked up considering that they subject us to in person classes  without even allowing us to access their health facilities. All so that  we’d be more likely to stay and not defer. It’s all about money to them \n\nYeah its fucked up but you that's how it is i guess.",
                      "author": "tha_oz",
                      "created": 1599182962,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                },
                "g4jp4y4": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jp4y4/",
                  "text": "Ouchie my feelings ):",
                  "author": "SeulkiHyu",
                  "created": 1599660206,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g3xhpc7": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xhpc7/",
          "text": "They’re in denial. These first years are so eager to be away from home that they wanna risk getting infected.",
          "author": "tjcc99",
          "created": 1599180004,
          "upvotes": 11,
          "replies": {
            "g3xnbmj": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xnbmj/",
              "text": "Yeah I don't blame them, I would be eager to move out to but it's fucking stupid if they think they're gonna be on campus all year long because of covid lol. Especially if its online anyways like whats the point?",
              "author": "tha_oz",
              "created": 1599183033,
              "upvotes": 15,
              "replies": {
                "g3xram7": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xram7/",
                  "text": "The worst is that some students actively try to take in-person classes just so they have a reason to go back to their college towns.",
                  "author": "tjcc99",
                  "created": 1599185260,
                  "upvotes": 0,
                  "replies": {
                    "g3xrpn8": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xrpn8/",
                      "text": "freakin freshman",
                      "author": "tha_oz",
                      "created": 1599185499,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g3xw9nw": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xw9nw/",
              "text": "Most don't have a choice. The lion's share of schools require freshmen to dorm their first year.",
              "author": "TorchIt",
              "created": 1599188166,
              "upvotes": 10,
              "replies": {}
            },
            "g4jpcgi": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jpcgi/",
              "text": "That was not my intention at all. Some people are seriously trying to get away from home at all costs. You should consider people’s living situations and look at it from a different perspective.",
              "author": "SeulkiHyu",
              "created": 1599660325,
              "upvotes": 1,
              "replies": {
                "g4un9mu": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4un9mu/",
                  "text": "“Some people are seriously trying to get away from home at all costs.”\n\nThat’s exactly my point lol",
                  "author": "tjcc99",
                  "created": 1599850202,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "g4jp1ql": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jp1ql/",
          "text": "I wasn’t surprised, I had been expecting it. I just needed to vent??",
          "author": "SeulkiHyu",
          "created": 1599660155,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3wxom9": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wxom9/",
      "text": "What was your university's testing protocol before? Were they testing students only during move-in or also requiring students to do mandatory testing throughout the week?",
      "author": "anonoyster10",
      "created": 1599172514,
      "upvotes": 16,
      "replies": {
        "g3xuyyq": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xuyyq/",
          "text": "Oneonta student, no testing protocol existed. We weren’t tested at move-in, and we didn’t have any regular testing until a few popped up and they mandated pool testing. We now have 507 cases.",
          "author": "tired-musician",
          "created": 1599187403,
          "upvotes": 9,
          "replies": {
            "g3y4beh": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y4beh/",
              "text": "Wow. Did you have to wear masks on campus and in classrooms?",
              "author": "GMan_SB",
              "created": 1599193111,
              "upvotes": 3,
              "replies": {
                "g3y4fb3": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y4fb3/",
                  "text": "Yes, it’s NY state law. 97% of classes were online, so no problem there. The problem was off-campus frat parties where students picked up COVID then brought them back to campus or their apartments.",
                  "author": "tired-musician",
                  "created": 1599193181,
                  "upvotes": 8,
                  "replies": {
                    "g3y4vfe": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y4vfe/",
                      "text": "Ah I get that I go to a private college in ny there is a huge party scene but the house owners are being a little more strict on kicking randoms out.  We don’t have frats but there’s a bunch of party houses and stuff. Still stupid, been avoiding those big parties for sure.",
                      "author": "GMan_SB",
                      "created": 1599193473,
                      "upvotes": 2,
                      "replies": {
                        "g4jooe3": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jooe3/",
                          "text": "Good on you. I’m scared of basic human interaction so parties weren’t a concern for me. My roommates friend had a shitty roommate who partied a lot though. She ended up getting my roommates friend sick.",
                          "author": "SeulkiHyu",
                          "created": 1599659945,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g4joj0y": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4joj0y/",
              "text": "Five days later and we’re at nearly 700.",
              "author": "SeulkiHyu",
              "created": 1599659859,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3wwj4j": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wwj4j/",
      "text": "Damn people out here are getting fucked over .  My school didn’t even bother going back and we started online.  They cut dorming and any on campus related costs out of tuition.",
      "author": "Zer0gu3",
      "created": 1599172135,
      "upvotes": 187,
      "replies": {
        "g3xdd79": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xdd79/",
          "text": "Damn, I should transfer there. My school raised tution and forced everyone on campus (until students refused to come back). They are celebrating \"low case numbers\" - yeah, cause you aren't testing people. There have been parties since people have come back, plenty of people aren't distancing, and plenty off campus foolery.\n\nI knew my school didn't care about us, but it hurts when it's this obvious. Not to mention the health care plan you have to pay for that the school won't help people cover...",
          "author": "NarrativeCurious",
          "created": 1599177815,
          "upvotes": 65,
          "replies": {
            "g3xe94t": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xe94t/",
              "text": "Wtf? Why did they raise the tuition?",
              "author": "u4900",
              "created": 1599178264,
              "upvotes": 16,
              "replies": {
                "g3xfglx": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xfglx/",
                  "text": "I have no idea. I know that most of the school departments took a 10 percent pay cut ... so I am really not sure where that money is going. \n\nIt's immoral to raise tuition knowing what the pandemic has done to people's families and for the fact that some classes are still via zoom anyhow, many facilities are closed, etc   - I can only see this as mass exploitation to line upper-admin checks. \n\nI'm just waiting for the body count to roll in at this point...",
                  "author": "NarrativeCurious",
                  "created": 1599178775,
                  "upvotes": 15,
                  "replies": {}
                },
                "g3xl2rj": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xl2rj/",
                  "text": "I feel like it's pretty normal for schools to increase tuition every year. But most schools also do a tuition freeze so you're paying the same all four years.",
                  "author": "bhawx10",
                  "created": 1599181867,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "g3x3axc": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x3axc/",
          "text": "Goddammit I wish my school would do that",
          "author": "Riley39191",
          "created": 1599174420,
          "upvotes": 17,
          "replies": {}
        },
        "g3x891e": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x891e/",
          "text": "So incredibly glad my school didn't do that. Not trying to pay $70k/year for khan academy.",
          "author": "slimdell",
          "created": 1599175980,
          "upvotes": 15,
          "replies": {
            "g3xbagi": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xbagi/",
              "text": "It’s not that bad.  We have classes face to face through zoom and there is interaction between us and the teachers.  All of the teachers have more accessible hours for help too.",
              "author": "Zer0gu3",
              "created": 1599177107,
              "upvotes": 13,
              "replies": {
                "g3xcads": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xcads/",
                  "text": "It's definitely better for some types of classes than others. When everything went online back in the spring I went from being super engaged and being on track for all A's to the opposite of that... This year we started in person for a couple weeks, had an outbreak and shut down and had all-online for 2 weeks, and now we're back in person after the numbers greatly improved. The difference in motivation and ability to actually learn anything is night and day, especially as an architecture major at a school with almost all hand-drafting curriculum.",
                  "author": "slimdell",
                  "created": 1599177445,
                  "upvotes": 5,
                  "replies": {
                    "g3xclul": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xclul/",
                      "text": "I agree that in person learning will no doubt result in better performance, but I also think the issue you point out affect non freshman the most.  I just started out college as a freshman this year so online is my first taste for college class and I don’t really have a comparison for it compared to in person.",
                      "author": "Zer0gu3",
                      "created": 1599177578,
                      "upvotes": 6,
                      "replies": {
                        "g3xcruh": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xcruh/",
                          "text": "That's fair -- in any case I hope this COVID thing is all resolved as quickly as possible so you and the rest of us can get the full extent of our short time in college. Cheers!",
                          "author": "slimdell",
                          "created": 1599177644,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g4jjoog": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jjoog/",
          "text": "Yeah I kinda wish my school had just did that, but they thought they could handle it. Ironically enough, we were one of the few SUNYs that didn’t require covid testing before we left.",
          "author": "SeulkiHyu",
          "created": 1599656887,
          "upvotes": 1,
          "replies": {}
        },
        "g3xdzds": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xdzds/",
          "text": "My school did the same thing. I wish we could have in-person classes, but I'm also glad we don't because I know young college kids are dumbasses and would be partying and spreading covid.",
          "author": "u4900",
          "created": 1599178152,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3ww7lk": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3ww7lk/",
      "text": "Seems about right. My university is at 800 or something and still hasn't pulled the trigger on closing :/",
      "author": "PotOfGreed98",
      "created": 1599172010,
      "upvotes": 292,
      "replies": {
        "g3wxapm": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wxapm/",
          "text": "Wtf? What state if you don’t mind",
          "author": "lonedelphi",
          "created": 1599172358,
          "upvotes": 121,
          "replies": {
            "g3wxqej": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wxqej/",
              "text": "Arizona State University, they have handled Covid with very mixed success. Its a BIG university, so 800 might not be the same ratio as someone else's 300... but its still double the point where our state government recommends closing.",
              "author": "PotOfGreed98",
              "created": 1599172534,
              "upvotes": 235,
              "replies": {
                "g3xn8w4": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xn8w4/",
                  "text": "I'm from Arizona but I don't go there yet most of my friends do. They're all freshmen so most of them stayed home but from what I've heard they aren't doing so well. I don't know what there were expecting. Arizona was such a hotspot for covid.",
                  "author": "demonangel105",
                  "created": 1599182991,
                  "upvotes": 27,
                  "replies": {}
                },
                "g3xbwq2": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xbwq2/",
                  "text": "Thank god my university is taking it seriously we only have around 25k ish grad and undergrad and not counting this currently week so the 24th-1rst we’ve had only 11 cases",
                  "author": "Omar345901",
                  "created": 1599177276,
                  "upvotes": 10,
                  "replies": {}
                },
                "g3x3v34": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x3v34/",
                  "text": "Go Lumberjacks!",
                  "author": "GennaroIsGod",
                  "created": 1599174649,
                  "upvotes": 16,
                  "replies": {
                    "g3x5gl5": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x5gl5/",
                      "text": "That's Northern Arizona University, not ASU.",
                      "author": "Bigfrostynugs",
                      "created": 1599175178,
                      "upvotes": 39,
                      "replies": {
                        "g3xaae7": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xaae7/",
                          "text": "I think they were implying that NAU is better off rn... which I can't really disagree with.",
                          "author": "PotOfGreed98",
                          "created": 1599176849,
                          "upvotes": 27,
                          "replies": {
                            "g3xn1y4": {
                              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xn1y4/",
                              "text": "Didn't NAU keep pushing back the start date because they weren't sure how to hande covid? I don't go there but my co worker does.",
                              "author": "demonangel105",
                              "created": 1599182884,
                              "upvotes": 5,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g3xi8i1": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xi8i1/",
                  "text": "Also most of the cases are off campus only 400 positive cases in tempe 0 in poly that we know of",
                  "author": "fadedreams15",
                  "created": 1599180281,
                  "upvotes": 3,
                  "replies": {
                    "g3xj7cy": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xj7cy/",
                      "text": "Right, and only a few of those off campus students are going to in person classes",
                      "author": "PotOfGreed98",
                      "created": 1599180821,
                      "upvotes": 4,
                      "replies": {
                        "g3xjmfg": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xjmfg/",
                          "text": "Yeah i work in the classrooms only a max of 5 people can be in a classroom at once including teachers",
                          "author": "fadedreams15",
                          "created": 1599181052,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g4jj00r": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jj00r/",
                  "text": "I was just about to say, you must have a huge school then",
                  "author": "SeulkiHyu",
                  "created": 1599656414,
                  "upvotes": 1,
                  "replies": {}
                },
                "g3yl8bi": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yl8bi/",
                  "text": "For anyone interested I got an email a few hours ago from the president of the university which these numbers and saying specially “there will be no operational changes”",
                  "author": "dazedconfusedev",
                  "created": 1599207509,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            },
            "g3xhauk": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xhauk/",
              "text": "University of Alabama has 1.2k cases as of early this week and isn’t closing.",
              "author": "SeeDontLook",
              "created": 1599179786,
              "upvotes": 28,
              "replies": {
                "g3xllfo": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xllfo/",
                  "text": "University of Iowa too. President and board of regents refuse to pull the cord",
                  "author": "salma-rios",
                  "created": 1599182138,
                  "upvotes": 21,
                  "replies": {
                    "g3yduyu": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yduyu/",
                      "text": "U of I, UNI, and Iowa State are all doing piss poor. I’ve heard we’re almost out of room for on campus students to quarantine and isolate here at UNI.",
                      "author": "TheAnxiousAntisocial",
                      "created": 1599200360,
                      "upvotes": 9,
                      "replies": {
                        "g3ye9tx": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3ye9tx/",
                          "text": "It’s awful in Iowa City. I didn’t go back to campus and opted to stay home this semester. Thank god I did. Almost 1 out of every 30 has COVID. Ridiculous.",
                          "author": "salma-rios",
                          "created": 1599200717,
                          "upvotes": 8,
                          "replies": {
                            "g3zxyyx": {
                              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zxyyx/",
                              "text": "For sure. I didn’t want to commute from home everyday for classes (I have to stay enrolled because student loans and scholarships) so I just terminated my dorm contract and decided to move off campus to an apartment near UNI. Luckily, I was able to appeal the fee due to mental health issues and concerns so I ended up not having to pay the giant cancellation fee.\n\nEither way, Iowa’s response to COVID in general is absolutely pathetic and awful, and it is only being highlighted by our recent numbers. It is completely ridiculous.",
                              "author": "TheAnxiousAntisocial",
                              "created": 1599234191,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "g3y86lr": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y86lr/",
                  "text": "What in the fuck? That's about 4% of their enrollment. There has to be so many mistakes collectively between the student body, the university, and multiple levels of government to even let something like that happen.",
                  "author": "PonchoHung",
                  "created": 1599195810,
                  "upvotes": 6,
                  "replies": {
                    "g3yc3px": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yc3px/",
                      "text": "The thing about Alabama (And at least a few other SEC schools) is that if you want meaningful community policy you always start with Greek Life, and that didn't appear to happen.",
                      "author": "jaynay1",
                      "created": 1599198875,
                      "upvotes": 5,
                      "replies": {}
                    }
                  }
                },
                "g3ygdux": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3ygdux/",
                  "text": "speed running it, i see.\n\n#games_done_quick",
                  "author": "Takiatlarge",
                  "created": 1599202604,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "g3x0z4p": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x0z4p/",
          "text": "I’m at UGA and we had 800 cases LAST WEEK and we still open",
          "author": "NotCreativeEnoughFor",
          "created": 1599173715,
          "upvotes": 43,
          "replies": {
            "g3xi7l1": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xi7l1/",
              "text": "800 new cases last week or 800 total?",
              "author": "Big-_D",
              "created": 1599180267,
              "upvotes": 10,
              "replies": {
                "g3xknir": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xknir/",
                  "text": "821 cases  from the 24th to the 28th.",
                  "author": "NotCreativeEnoughFor",
                  "created": 1599181630,
                  "upvotes": 13,
                  "replies": {
                    "g3y33ch": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y33ch/",
                      "text": "GO DAWGS!",
                      "author": "SeveredHead",
                      "created": 1599192312,
                      "upvotes": 8,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g40y357": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40y357/",
              "text": "What the fuck that’s more than my whole state. The fuck is wrong with the south",
              "author": "gunksmtn1216",
              "created": 1599246286,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g3x6ecw": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x6ecw/",
          "text": "My university is at 500+ cases and we’re almost done with our second week...\nIt really disappointing how other students are handling the situation. My school isn’t doing a whole lot either and is literally just blaming the students even though they’re letting people who tested positive stay in the dorms that use communal bathrooms...",
          "author": "annagirl98",
          "created": 1599175449,
          "upvotes": 29,
          "replies": {
            "g4jjg3w": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jjg3w/",
              "text": "Oneonta luckily was smart enough to isolate all positive students into a res hall that was completely empty for the use of isolation. They couldn’t leave and had food brought to them.",
              "author": "SeulkiHyu",
              "created": 1599656731,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "g3xkv35": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xkv35/",
          "text": "UIUC has had \\~200 new case a day for the past couple of days and we've got massive testing infrastructure. They put us basically on lockdown for the next two weeks to curb the spread but I'm a bit skeptical that it will actually do anything.",
          "author": "bhawx10",
          "created": 1599181748,
          "upvotes": 16,
          "replies": {
            "g3xlhse": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xlhse/",
              "text": "Big oof man. I hope things go as well as possible for you there.",
              "author": "PotOfGreed98",
              "created": 1599182087,
              "upvotes": 6,
              "replies": {}
            },
            "g3xxpj1": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xxpj1/",
              "text": "UIUC freshman here, I really don’t know which way we’re gonna go. Depending on how people treat this two week lock down, we either stay or get sent home. Seeing as how the first week and a half went, I have a bad feeling that these two weeks won’t end well.\n\nIt’s disappointing, I really thought our testing infrastructure would do the trick...",
              "author": "saablade",
              "created": 1599188998,
              "upvotes": 11,
              "replies": {
                "g3yggrk": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yggrk/",
                  "text": ">  or get sent home. \n\nThat's a legit public health concern for the state. There's the potential to seed hundreds of unknowing infectees back to families with more vulnerable members.",
                  "author": "Takiatlarge",
                  "created": 1599202679,
                  "upvotes": 5,
                  "replies": {}
                },
                "g3xyxer": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xyxer/",
                  "text": "Yeah it's a real shame. And it's gotta be really bad for you as a freshman, that's tough. I've been real down in the dumps about it and want to go home already. I can't see my friends on campus and I live by myself so it's been hard.\n\nWe have all that testing, about 60-75% of our classes are online, strict mask policies and other procedures yet we ended up just as bad as some of these other schools. At least we have really good info about how we're doing. I kinda hope we just get sent home sooner rather than later because I'm sick of living with this fantasy that it'll work out. First week or two on campus were pretty good but if we're just bouncing in and out of lockdowns, that's gonna suck. I wanna be home until there's a vaccine, at least I have my family that I can hangout with then.",
                  "author": "bhawx10",
                  "created": 1599189716,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "g3xhbon": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xhbon/",
          "text": "Zero here in Montana (no, not bozeman). Hope ASU gets their shit figured out and soon.",
          "author": "Affenballe",
          "created": 1599179798,
          "upvotes": 7,
          "replies": {
            "g3xj8co": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xj8co/",
              "text": "Did they actually release numbers? Last I checked they hadn't.",
              "author": "charm59801",
              "created": 1599180836,
              "upvotes": 3,
              "replies": {
                "g3xjbvh": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xjbvh/",
                  "text": "At MSU bozeman or in Montana?",
                  "author": "Affenballe",
                  "created": 1599180891,
                  "upvotes": 1,
                  "replies": {
                    "g3xjv9l": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xjv9l/",
                      "text": "For the UM, last I heard they hadn't released any numbers. There was a confirmed staff member with it and increasing numbers in Missoula. I imagine there's at least a handful on campus. Seems disingenuous to say we have 0 cases.",
                      "author": "charm59801",
                      "created": 1599181188,
                      "upvotes": 2,
                      "replies": {
                        "g3xk3ff": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xk3ff/",
                          "text": "I don't go to UM, I go to MSU Northern. I can't speak for the other schools.\n\nEdit: I should say we don't have any cases that are showing symptoms. I am sure we have cases that don't show any.",
                          "author": "Affenballe",
                          "created": 1599181316,
                          "upvotes": 1,
                          "replies": {
                            "g3xko0w": {
                              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xko0w/",
                              "text": "Ah I see you said not msu so I assumed UM. My b",
                              "author": "charm59801",
                              "created": 1599181638,
                              "upvotes": 2,
                              "replies": {
                                "g3xksx4": {
                                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xksx4/",
                                  "text": "Not a problem. But if it came down to it... Go Cats!",
                                  "author": "Affenballe",
                                  "created": 1599181714,
                                  "upvotes": 1,
                                  "replies": {
                                    "g3xlfkw": {
                                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xlfkw/",
                                      "text": "I could care less lol *go cheap state school in the city I grew up in*",
                                      "author": "charm59801",
                                      "created": 1599182057,
                                      "upvotes": 1,
                                      "replies": {
                                        "g3xmcau": {
                                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xmcau/",
                                          "text": "Fair 'nuf. Lol. Have a great evening and go enjoy the kick-ass Montana sunset.",
                                          "author": "Affenballe",
                                          "created": 1599182496,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "g3x52e6": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x52e6/",
          "text": "Damn, my school only has 800 living on campus. We only have 3 cases and they're quarantined and live off campus",
          "author": "Kaitlin33101",
          "created": 1599175017,
          "upvotes": 11,
          "replies": {}
        },
        "g3x5c47": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x5c47/",
          "text": "lol mine is over 1k, still going strong...",
          "author": "enfinity12345",
          "created": 1599175127,
          "upvotes": 11,
          "replies": {
            "g3x69rv": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x69rv/",
              "text": "Bama?",
              "author": "damsus121",
              "created": 1599175413,
              "upvotes": 5,
              "replies": {
                "g3x8dgq": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x8dgq/",
                  "text": "Post History indicates South Carolina",
                  "author": "RedBoatz",
                  "created": 1599176026,
                  "upvotes": 9,
                  "replies": {
                    "g3xgtp2": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xgtp2/",
                      "text": "yep",
                      "author": "enfinity12345",
                      "created": 1599179527,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g3ydr1o": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3ydr1o/",
          "text": "All 3 public universities in Iowa are doing horrible and we have no plans to close either :/",
          "author": "TheAnxiousAntisocial",
          "created": 1599200265,
          "upvotes": 3,
          "replies": {}
        },
        "g3y1h69": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y1h69/",
          "text": "christ we barely have 800 living on campus and only 4 confirmed positive tests so far.",
          "author": "JesusRocksSocks",
          "created": 1599191284,
          "upvotes": 2,
          "replies": {}
        },
        "g3z54z7": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3z54z7/",
          "text": "Mine has over 1000 cases with only 11000 students, and it still hasn’t closed, but I’ve left",
          "author": "Superslowmojoe",
          "created": 1599223333,
          "upvotes": 1,
          "replies": {}
        },
        "g3zfy2z": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zfy2z/",
          "text": "UofSC has hit 1000 and the schools alert level is “low”",
          "author": "AshTheCatcher",
          "created": 1599227776,
          "upvotes": 1,
          "replies": {}
        },
        "g40y16g": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40y16g/",
          "text": "That’s more than my whole state wtf",
          "author": "gunksmtn1216",
          "created": 1599246269,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "g3wrjig": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wrjig/",
      "text": "2-3 weeks. Like clockwork.",
      "author": "snomflake",
      "created": 1599170302,
      "upvotes": 72,
      "replies": {
        "g3x034j": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x034j/",
          "text": "We are coming to the end of week three and there have been 16,000 students and staff tested with only 249 positive tests. That is 1.57% positivity rate, I have a feeling we are going to stay open for in person class.",
          "author": "Danderson0079",
          "created": 1599173432,
          "upvotes": 35,
          "replies": {
            "g3xgfkm": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xgfkm/",
              "text": "My school is in the same boat. We're closing in on week 2 and have had around 100 test positive which for the population at the school is less then 1% of the students. It feels like we'll stay open because I haven't heard anything about closing down. They're also pretty strict with the whole mask mandate and quarantining people.",
              "author": null,
              "created": 1599179314,
              "upvotes": 11,
              "replies": {
                "g3z2doh": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3z2doh/",
                  "text": "Sounds nice. My college is hitting the news, 28.8% positive rate last week, & an announcement saying they have no plans to go online. They also started explaining how it is the student's responsibility to not get infected & they feel the university doesn't need to enforce rules.",
                  "author": "Gamerz1818",
                  "created": 1599221857,
                  "upvotes": 5,
                  "replies": {
                    "g48sfff": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g48sfff/",
                      "text": "That sounds like a shitshow and I hope the positivity rate goes down. As of yesterday, my school emailed some of us and told us traces of Corona were found in some of the dorms water. I happened to live in those dorms and may need to get tested again. This whole situation is ridiculous, but stay safe and best of luck.",
                      "author": null,
                      "created": 1599409335,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "g4jq0bf": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jq0bf/",
                      "text": "My school is on the news like crazy too, my dads friend from Tennessee heard about it on his news station, blows my mind.",
                      "author": "SeulkiHyu",
                      "created": 1599660703,
                      "upvotes": 3,
                      "replies": {}
                    },
                    "g43m5s8": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g43m5s8/",
                      "text": "Yeah that is insane i'm sorry... Do they not have an option for students that feel unsafe to go remote?",
                      "author": "Danderson0079",
                      "created": 1599295262,
                      "upvotes": 1,
                      "replies": {
                        "g456mw7": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g456mw7/",
                          "text": "Yeah, I can take most of my in person classes online if I choose too. Have a a lab & 3 classes in person & three online right now. My in person classes have like 20 people in the whole room, so I feel good going to them.",
                          "author": "Gamerz1818",
                          "created": 1599326130,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g434iw0": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g434iw0/",
                  "text": "Same here. The only people who are quarantined are those from states with high covid rates (such as Texas), and afaik no one has covid.",
                  "author": "RandomRedditor44",
                  "created": 1599283529,
                  "upvotes": 1,
                  "replies": {
                    "g48t7le": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g48t7le/",
                      "text": "It's kind of nice, but at the same time the risk of closing down is still very real. I hope things get better for everyone.",
                      "author": null,
                      "created": 1599409688,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g3yck0d": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yck0d/",
              "text": "My school's at 22 positives with 21288 total tests for a .1% positive rate.  Which honestly makes me more suspicious of their testing than confident in the school, but no way we close with those numbers.",
              "author": "jaynay1",
              "created": 1599199247,
              "upvotes": 5,
              "replies": {}
            },
            "g3x8znq": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x8znq/",
              "text": "my school decided to not test faculty and i'm still not sure why that decision was made",
              "author": "EpicBroomGuy",
              "created": 1599176287,
              "upvotes": 8,
              "replies": {
                "g3xc2pm": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xc2pm/",
                  "text": "because they're afraid of what the results will inevitably be",
                  "author": "ornitholoqy101",
                  "created": 1599177346,
                  "upvotes": 7,
                  "replies": {}
                }
              }
            },
            "g3y810q": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y810q/",
              "text": "And considering the likelihood of false positives it's even less of a concern.",
              "author": "Godofthechicken",
              "created": 1599195697,
              "upvotes": 1,
              "replies": {}
            },
            "g434f3v": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g434f3v/",
              "text": "Same here. There are no covid cases at college (cause I’m at a small college in a state that has barely no cases recently) and my college has been cracking down on parties and large gatherings. They kicked out 30 students the other day for partying, and they took all the chairs out of the dining hall last week because people weren’t social distancing (and they havent said when theyre gonna put the chairs back.",
              "author": "RandomRedditor44",
              "created": 1599283457,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g3x5rb5": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x5rb5/",
          "text": "Who could have known?? If only everybody knew this was coming and said it would happen exactly this way! \n\n/s",
          "author": "Bigfrostynugs",
          "created": 1599175273,
          "upvotes": 4,
          "replies": {}
        },
        "g3z72bd": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3z72bd/",
          "text": "We had our first two weeks online and start our first week of in person on Monday and I’m fully expecting to be sent home the end of the second week. I’m living in a townhouse tho so I’ll probably apply to stay here.",
          "author": "SporkFanClub",
          "created": 1599224306,
          "upvotes": 0,
          "replies": {}
        }
      }
    },
    "g3wjfj8": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wjfj8/",
      "text": "Based on what you saw at your campus, do you think campuses will shut down if kids are still partying? Also how often were you tested?",
      "author": "Gano_vv",
      "created": 1599167128,
      "upvotes": 79,
      "replies": {
        "g3x1hpy": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x1hpy/",
          "text": "The parties are imo a lame way to pass the blame onto students, rather than administrators.\n\nThis was 100% inevitable. You can’t have hundreds of kids living in dorm rooms with ventilation during a pandemic. It’s the same fucking thing as a nursing home. All it takes is one person.",
          "author": "Boh-dar",
          "created": 1599173860,
          "upvotes": 148,
          "replies": {
            "g3x3e9j": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x3e9j/",
              "text": "It's on schools for putting their greed ahead of the safety of students. Obviously it isn't safe for schools to go back fully but they want the money so they forced kids back even though it put people at risk.",
              "author": null,
              "created": 1599174449,
              "upvotes": 62,
              "replies": {
                "g3x3wxi": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x3wxi/",
                  "text": "Nailed it.\n\nThey got their tuition checks for the semester. Mission accomplished. Now the students can fuck off back home for a shitty virtual education at full price.",
                  "author": "Boh-dar",
                  "created": 1599174669,
                  "upvotes": 43,
                  "replies": {
                    "g3xcmqt": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xcmqt/",
                      "text": "That’s EXACTLY what my school did. Waited until the day after tuition was due to send us home. In addition to that, before switching completely online, they made us attend in person classes while closing off their healthcare facilities. To top it off, they went to Instagram first before sending out an email to lie that it would only be 2 weeks when everyone knew damn well it was 2 semesters. And it’s not the first time the school has purposely tried to bring our hopes up. Like everyone knew this was inevitable",
                      "author": "procrastinatinq",
                      "created": 1599177592,
                      "upvotes": 14,
                      "replies": {
                        "g3xmces": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xmces/",
                          "text": "I decided to just do the semester online from home cause I’m suspecting that’s what my school is gonna do. Tuition is due the tenth so we’ll see how quickly after they do it, but a lot of us have been joking about getting sent home on 9/11",
                          "author": "BylvieBalvez",
                          "created": 1599182498,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "g3y2xcz": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y2xcz/",
                  "text": "I'm sorry, but some of us can't work remote. I am back in school because I need practical application, and I don't have $9000 in equipment at home to build reels on, or studios to work. Additionally, the fact is that online learning consistently tests lower than in person.\n\nI agree admins want to blame the students, but online learning isn't worth anything for many of us, if any of us.",
                  "author": "theBrineySeaMan",
                  "created": 1599192204,
                  "upvotes": 6,
                  "replies": {
                    "g40047m": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g40047m/",
                      "text": "So allow the minority of students who legitimately need on-campus equipment to come back, but not anybody else.\n\n&#x200B;\n\nI know a lot of people with labs that they can't really do remotely. On the other hand, most of the people I know only have lecture courses this semester that they can do remotely just fine.\n\n&#x200B;\n\nAt my school, most of the students who live on campus are freshmen. Very few of them have any labs whatsoever, and most who are currently living on campus have either all of their classes online, or they have at most two classes that they can attend one time a week. There is no legitimate reason that those students need to be living on campus, yet they are.\n\n&#x200B;\n\nIs it as good as in-person classes? No. But we have a hell of a situation on our hands, and some sacrifices need to be made. The difference between in-person and remote classes, with the exception of some labs, is not worth the number of people who may catch the virus from doing irresponsible in person classes.",
                      "author": "Dj_White_Gold",
                      "created": 1599234933,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g3xilsi": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xilsi/",
              "text": "I agree that it's inevitable, but both groups are at fault. Students for not having self control, and administrators for being stupid and greedy enough to assume people will have self control.",
              "author": "13steinj",
              "created": 1599180484,
              "upvotes": 11,
              "replies": {}
            },
            "g3xcwcb": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xcwcb/",
              "text": "If anything I'd say it's equal, but you gotta keep in mind that while the administration was greedy af for trying on campus stuff, the students who went despite there being a pandemic (edit: let me really hammer it in that they chose to attend), partied, and are now surprised everything has to shut down are *also* big idiots. They have no right to be surprised by this when everyone has been saying this was going to happen from the beginning.",
              "author": "joyleaf",
              "created": 1599177673,
              "upvotes": 10,
              "replies": {
                "g3zdpjz": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zdpjz/",
                  "text": "I mean that's not entirely fair. My program moved completely online for this semester, but it also already had an online sister program. HOWEVER, if we are going back in spring to in person, and we want to transfer to our online counterpart, we loose 100% of our funding and will once again have to rely on loans.\n\nPersonally, I'm not in the financial state to give up a full ride to grad school, so I'll just have to suck it up and die if thats what they want me to do. \n\nStudents who choose to party and socially distance are one thing, but those who attended period are not necessarily in the wrong",
                  "author": "skelechel",
                  "created": 1599226973,
                  "upvotes": 1,
                  "replies": {
                    "g401jb5": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g401jb5/",
                      "text": "While true, we have to remember that students who didn't have a choice make up a minority of the students who are there in-person.\n\n&#x200B;\n\nPersonally, I'm at school because I'm an RA and don't want to lose that scholarship. But all of the freshmen on my floor? 80% of them have nothing keeping them here besides their own choice. At least half don't even have any in-person classes.\n\n&#x200B;\n\nThe majority of students on college campuses right now chose to be there. They wanted the college experience, they obviously aren't too intimidated by the virus, and quite frankly most of them are really stupid. It's the unfortunate reality for the people like you and I who did not have much of a choice whether to come to school or not.\n\n&#x200B;\n\nI'd be amazed if any college makes it through September.",
                      "author": "Dj_White_Gold",
                      "created": 1599235406,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g3x7uo5": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x7uo5/",
              "text": "The notion that the blame lies on the administration solely and not at all on the students who party is ludicrous. I go to Notre Dame and we had a big initial outbreak but it all traced back to off campus parties (at a school where 80% of students are on campus). They locked down more strictly for 2 weeks and cases slowed down so much and the positivity rate dropped from >20% to <1% with massively increased testing. Now we're back to in-person classes and we're all very optimistic for the rest of the semester. Clearly the blame is on the students who disregarded the rules and not on the administration who has done everything in their power to provide students the college experience they deserve and pay for.",
              "author": "slimdell",
              "created": 1599175888,
              "upvotes": 9,
              "replies": {
                "g3x8u5x": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x8u5x/",
                  "text": "If I put a bunch of rabbits in a box with a snake and the snake decided to eat all the rats, would you blame the snake for the rabbits dying or the person who put both of them in a box together. Sure, some people are certainly to blame for disregarding the rules, but what do you expect? It’s a bunch of kids, a bunch of horny kids at that, the school knew this would happen and they brought people back anyway.",
                  "author": "RedBoatz",
                  "created": 1599176219,
                  "upvotes": 5,
                  "replies": {
                    "g3x9lvu": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x9lvu/",
                      "text": "Your analogy doesn't work for many reasons. First, if you can successfully track down the snakes (thru aggressive contact tracing) and punish them (suspension, expulsion, etc.) then that reduces the danger. Second, you're assuming that the rabbits don't want to be there -- they do! The overwhelming majority of the student body STRONGLY desires to be on campus. As an architecture major, I literally cannot receive a proper education from 1000 miles away with a dining room table in place of a drafting desk and a virtual professor instead of an interactive studio environment.",
                      "author": "slimdell",
                      "created": 1599176551,
                      "upvotes": 11,
                      "replies": {
                        "g3y90ob": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y90ob/",
                          "text": ">you can track down the snakes and punish them\n\nThat's not changing the facts that the rats died. \n\n>The student body wants to be there\n\nSome of them want to be there for different reasons. Some of them have jobs and internships to tend to. But others are just there to party. This is the kind that mostly would not be there without the justification of in-person classes. There are also faculty and staff, and residents of the surrounding area who have little say in the matter but are affected nonetheless.",
                          "author": "PonchoHung",
                          "created": 1599196439,
                          "upvotes": 3,
                          "replies": {}
                        },
                        "g3xc4c7": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xc4c7/",
                          "text": "Im doing arch drafting at uaf.   My professors  feel the same way.   Thankfully most of my peers are older and don't live in the dorms, but still.",
                          "author": "dnbrower",
                          "created": 1599177365,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    },
                    "g403716": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g403716/",
                      "text": "The thing is, a snake isn't a person. A snake acts on instinct. A person should be able to control themselves.\n\n&#x200B;\n\nWhile we know how people actually act, and we shouldn't have started college in-person to start with, it is remarkable how low are standards for behavior are that we don't put blame on the students who cause this.\n\n&#x200B;\n\nIs it really so unreasonable to ask students to wear masks and not party, with the incentive being that they get to go to actual college instead of sitting in their parent's house for a whole year?\n\n&#x200B;\n\nMost students can handle that. It's pretty simple. It's the 10% of idiots who are causing all of the problems. I think they should be expelled. If you're so stupid that you go to a party given the current situation, then you're too stupid for college.\n\n&#x200B;\n\nAnd that is what's happening at a lot of schools- students who break the rules, if not expelled, are at least getting sent home for the semester.\n\n&#x200B;\n\nThey are the one marshmallow kids, except instead of only messing it up for themselves, they're ruining what could be a relatively normal semester for everybody.",
                      "author": "Dj_White_Gold",
                      "created": 1599236013,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "g3x973q": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x973q/",
                  "text": "Everything except test them when they arrived there, right?\n\nJust a minor oversight by the administration",
                  "author": "Boh-dar",
                  "created": 1599176381,
                  "upvotes": 1,
                  "replies": {
                    "g3xa4no": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xa4no/",
                      "text": "I'm not going to blindly defend every action of theirs, and I certainly think they fell short initially, but I find it even more impressive that they were able to bounce back from that with greatly increased testing, full transparency, addressing student concerns, which all led to an extreme decline in cases. Students want to be on campus and at this point we've proven we can do that -- not sure why you want to disregard that.",
                      "author": "slimdell",
                      "created": 1599176778,
                      "upvotes": 4,
                      "replies": {
                        "g3xbzup": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xbzup/",
                          "text": "I’m referring specifically to SUNY Oneonta, which did not test students upon arrival and now has over 400 cases and is shutting down after a week.\n\nThey haven’t “bounced back” from anything.",
                          "author": "Boh-dar",
                          "created": 1599177313,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            },
            "g3zx5nj": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3zx5nj/",
              "text": "(None of this had to do with dorms.)",
              "author": null,
              "created": 1599233915,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "g3wf6dm": {
      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wf6dm/",
      "text": "Did you receive a refund for housing and meal plans?",
      "author": "bobbyjoemamma",
      "created": 1599165681,
      "upvotes": 653,
      "replies": {
        "g3x3qdv": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x3qdv/",
          "text": "My SUNY made it very known that nobody would be refunded at all",
          "author": "psilvs",
          "created": 1599174597,
          "upvotes": 236,
          "replies": {
            "g3xohkg": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xohkg/",
              "text": "My SUNY made us re-sign our housing and meal plan contracts, with an added clause in there that states after 2 official weeks of classes, refunds due to unforseen circumstances (i.e. having to move home due to covid) are not allowed.",
              "author": "ZachTheYek",
              "created": 1599183684,
              "upvotes": 120,
              "replies": {
                "g3xyvum": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xyvum/",
                  "text": "Not a lawyer, but I can't imagine a virus outbreak/hotspot during an active pandemic can be considered \"unforseen circumstances.\" In fact, I'd go as far to say it is one of the most foreseen circumstances possible.",
                  "author": "BlottomanTurk",
                  "created": 1599189690,
                  "upvotes": 186,
                  "replies": {
                    "g3y5shu": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y5shu/",
                      "text": "Especially due to time of forced signature",
                      "author": "gabbagabbalabba",
                      "created": 1599194097,
                      "upvotes": 45,
                      "replies": {}
                    },
                    "g3y7oco": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y7oco/",
                      "text": "Yeah also not a lawyer but from what I gather, contracts like those can help a little bit but they don't slam cases shut.",
                      "author": "PonchoHung",
                      "created": 1599195438,
                      "upvotes": 27,
                      "replies": {
                        "g3yagf7": {
                          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3yagf7/",
                          "text": "They're just banking, quite literally, on the sheer amount of students/families that won't be able to afford getting tied up in the courts over it. \n\nBut hey, maybe a few class action suits can put these institutions back in their place.",
                          "author": "BlottomanTurk",
                          "created": 1599197550,
                          "upvotes": 46,
                          "replies": {
                            "g3ygbt2": {
                              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3ygbt2/",
                              "text": "> won't be able to afford getting tied up in the courts over it.\n\nHmm, that's when you know something's wrong with the legal system.",
                              "author": "Takiatlarge",
                              "created": 1599202551,
                              "upvotes": 26,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "g45f6r3": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g45f6r3/",
                      "text": "Idk about them but the housing contracts my school had specifically named covid and said if we’re kicked off for that we aren’t entitled to a refund",
                      "author": "BylvieBalvez",
                      "created": 1599330263,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "g3z6g7y": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3z6g7y/",
                  "text": "That’s terrible. I’m sorry.",
                  "author": "DJayne42",
                  "created": 1599224000,
                  "upvotes": 3,
                  "replies": {}
                },
                "g4jiuko": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jiuko/",
                  "text": "That’s absolutely ridiculous",
                  "author": "SeulkiHyu",
                  "created": 1599656312,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "g3xrhz8": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xrhz8/",
              "text": "The fucked up part is that you’re kinda not allowed to leave either. If you take the semester off you loose your scholarships/financial aid.",
              "author": "Aqua7KH",
              "created": 1599185377,
              "upvotes": 53,
              "replies": {}
            },
            "g4jiqt9": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jiqt9/",
              "text": "I’ve heard a lot of SUNYs aren’t doing refunds which seems ridiculous. But maybe if that you decided to go home and are not forced home?",
              "author": "SeulkiHyu",
              "created": 1599656242,
              "upvotes": 1,
              "replies": {
                "g4jm7d6": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jm7d6/",
                  "text": "99% of students had the option to be 100% online and stay home this semester. If you decided to come to campus you were going to be rolling the dice.\n\nThey need the money and gave students another option if they didn't want to pay. I'd say it's fair.\n\nAlso last semester you were allowed to stay on campus if you didn't want to return home",
                  "author": "psilvs",
                  "created": 1599658474,
                  "upvotes": 2,
                  "replies": {
                    "g4jqei9": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jqei9/",
                      "text": "I wish the staying on campus thing applied this semester too. I can only imagine how difficult it’s going to be for people with rough home lives.",
                      "author": "SeulkiHyu",
                      "created": 1599660925,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "g3wuz65": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3wuz65/",
          "text": "lol, if only things were fair",
          "author": "TheMonsterClips",
          "created": 1599171525,
          "upvotes": 364,
          "replies": {
            "g3y5old": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y5old/",
              "text": "From the SUNY Oneonta website:\n\n“The college plans to issue full housing refunds and prorated dining refunds for students who move out of their rooms during the move-out period.”",
              "author": "_The_Professor_",
              "created": 1599194023,
              "upvotes": 103,
              "replies": {
                "g3y6m2o": {
                  "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y6m2o/",
                  "text": "Awesome! Thankfully they weren't scummy about the situation",
                  "author": "TheMonsterClips",
                  "created": 1599194668,
                  "upvotes": 34,
                  "replies": {
                    "g4jiyj7": {
                      "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jiyj7/",
                      "text": "They would’ve had a lot of angry people on their hands. The college is already garnering a shitty reputation because of us being the first to shut down.",
                      "author": "SeulkiHyu",
                      "created": 1599656387,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "g3xloqv": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3xloqv/",
              "text": "It sounds like they did tho",
              "author": "BylvieBalvez",
              "created": 1599182179,
              "upvotes": 37,
              "replies": {}
            }
          }
        },
        "g3x92ug": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x92ug/",
          "text": "The news stations are saying yes, but from what I heard the students don’t know anything about refunds.",
          "author": "KingdomsPath",
          "created": 1599176328,
          "upvotes": 40,
          "replies": {
            "g4jitof": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jitof/",
              "text": "I called the Reslife office because I wanted to make sure and they said it’s going to be refunded luckily.",
              "author": "SeulkiHyu",
              "created": 1599656296,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "g3x977n": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x977n/",
          "text": "They announced a refund",
          "author": "Dougth",
          "created": 1599176383,
          "upvotes": 20,
          "replies": {}
        },
        "g3x57lw": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3x57lw/",
          "text": "Lol, that's a good one.",
          "author": "Bigfrostynugs",
          "created": 1599175074,
          "upvotes": 34,
          "replies": {
            "g3y5qz9": {
              "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g3y5qz9/",
              "text": "They will refund room and board, though.",
              "author": "_The_Professor_",
              "created": 1599194068,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "g4jin8m": {
          "link": "/r/college/comments/im1kpg/sent_home_after_two_weeks_of_classes/g4jin8m/",
          "text": "Our school said we would be receiving a full refund on housing and mostly full refund on meal, excluding the 2ish weeks we were there and ate. Which makes sense.",
          "author": "SeulkiHyu",
          "created": 1599656175,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634054318
}