{
  "sid": "qkgkn4",
  "link": "/r/college/comments/qkgkn4/i_feel_like_a_failure/",
  "title:": "I feel like a failure",
  "text": "I just don't understand. Prior to this semester I was great.  Now all of a sudden I have a C for physics & a D for chemistry. I feel so sure of myself then when I get the test, I flunk it. I'm working towards the medical route but if I can't pass a single test what makes me so sure I'll excel veterinarian school. I know if I want to go I need to have the best of the best grades. I'm thinking maybe medicine just won't be my thing.",
  "author": "cheesebuggie",
  "created": 1635780906,
  "updated": 1635890816,
  "over_18": false,
  "upvotes": 9,
  "upvote_ratio": 1.0,
  "comments": {
    "hiwy6jx": {
      "link": "/r/college/comments/qkgkn4/i_feel_like_a_failure/hiwy6jx/",
      "text": "Have you been going to the tutors at your school? Any office hours? How many hours are you studying for? Physics and Chemistry are both tough subjects and do need a certain amount of studying for succeed in it. Form studying groups in your classes and try to take effective notes in the classes. If you want good studying materials and sources, try looking the Youtube channel, \"The Organic Chemistry Tutor\" on Youtube. He helps well with physics and chemistry.",
      "author": "Critical-Paper",
      "created": 1635792272,
      "upvotes": 5,
      "replies": {
        "hix5mhe": {
          "link": "/r/college/comments/qkgkn4/i_feel_like_a_failure/hix5mhe/",
          "text": "Not tutors because it's online, though I could try. I study 2-3 hours a day. I have a study group online, more like the whole class is the study group. Teacher just have PowerPoints of the chapter so I just feel like I'm not actually learning. I have to teach myself how to work the problems and i feel like I'm confusing myself by looking at different resources like YouTube or books and such since they all do it differently.",
          "author": "cheesebuggie",
          "created": 1635795324,
          "upvotes": 2,
          "replies": {
            "hix6s4j": {
              "link": "/r/college/comments/qkgkn4/i_feel_like_a_failure/hix6s4j/",
              "text": "Have you asked for help at least? Have you tried to look at the YouTube channel that I suggested? What type of chemistry and physics are you learning? Organic chemistry and physics 1? I suggest that you study longer hours and should be able to take a break. Have you been sleeping healthy? There's othe good habits that can help you out",
              "author": "Critical-Paper",
              "created": 1635795791,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hixb69e": {
      "link": "/r/college/comments/qkgkn4/i_feel_like_a_failure/hixb69e/",
      "text": "I feel you. I’ve had to cheat my entire way through a math class and it made me realize that I can’t pursue a degree in biology. I tried videos, tutoring, asking the TA for help, I’ve tried everything and I’m still barely holding on. I don’t think there’s any shame in realizing that something isn’t for you, as long as you try your best. I would try absolutely every option before giving up though.",
      "author": "Temporary_Help3169",
      "created": 1635797562,
      "upvotes": 2,
      "replies": {
        "hixjwen": {
          "link": "/r/college/comments/qkgkn4/i_feel_like_a_failure/hixjwen/",
          "text": "Yeah that's how I'm feeling! I had to do the same for my last chem class. I'm trying to become a veterinarian but I feel like all the classes that aren't related to animals & have math aren't just working out for me. I will keep trying though, thank you!",
          "author": "cheesebuggie",
          "created": 1635801089,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}