{
  "sid": "r23m38",
  "link": "/r/college/comments/r23m38/im_strongly_considering_switching_my_major_to/",
  "title:": "I'm Strongly Considering Switching My Major To Food Science or Nursing, Need Advice On Which Would Be Best For Me? Also, would it be worth it?",
  "text": "Good afternoon everyone,\n\nWhile spending some time off college due to COVID and mental health issues, I did some reflecting on college and the choices I made, I realized that if I had to pick one bachelor degree and go into a solid amount of debt for a degree, I'd pick something with a better return on investment and that has to do with my second favorite subject, science. \n\nI started college as a Video Game Art major at a small 4-year college for two years, but I was having issues finding a part-time job or scholarships to pay for it, and at the time I had serious doubts about whether I could finish the program with a good GPA, so I transferred to a university a commutable distance from home to be a digital art major called \"Art and Technolgy\" where I spent a single semester until COVID happened.\n\nDon't get me wrong, I do enjoy video game art and I would love to work as a 3D artist, but I probably don't need a degree in it, so that's why I'm leaning towards getting a degree in something else I like.\n\n&#x200B;\n\nSo I'm considering either food science or nursing.\n\n&#x200B;\n\nThe reasons I'm considering food science and technology degree is because:\n\n\\-I got into cooking over COVID and realized I also have a passion for food in general, which is why I'm leaning towards it.\n\n\\-I'm perfectly okay with traveling, actually it would probably be a plus!\n\n\\-Unlike a lot of other science degrees, I could probably get a job with just a bachelors degree.\n\n\\-There are a solid amount of career paths I could go down, Quality Assurance sounds alright (but a bit repetitive) and food lab technician sounds good too, and plant superintendent sounds good as well. I might also do the Google or IBM data analysis certificate to add to my skillset to help me.\n\nThe only thing that's really worrying me about the degree is that there aren't as many jobs available as nursing and it's relatively lower paying.\n\n&#x200B;\n\nThe reasons why I'm considering nursing is because:\n\n\\- I also like the idea of helping people and making a difference.\n\n\\-Main reason why I'm also considering it is that it has much better job prospects than a food science and technology degree.\n\n\\- I could become a travel nurse if I want to travel.\n\n\\- Living anywhere I want would be great!\n\nThe \"cons\" I can think of it for me is that I heard it's very specialized, the hours can be very long and unpredictable, and maybe the physical strains might be a slight problem.\n\n&#x200B;\n\nWhich major do you guys think I should switch to?\n\n&#x200B;\n\nAlso, would it be worth switching as a junior? I spoke with a food science advisor and she said it should take about 3ish years, and I'm assuming it should be about the same for Nursing. My father and mother are suggesting I just finish my current art degree because simply having a degree would be better, but I'm worried about continuing any kind of art degree due to the uncertainty and majoring in literally anything isn't worth it to employers anymore.",
  "author": "Saul104",
  "created": 1637866521,
  "updated": 1638206979,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.99,
  "comments": {
    "hm2o488": {
      "link": "/r/college/comments/r23m38/im_strongly_considering_switching_my_major_to/hm2o488/",
      "text": "There’s a high demand for nurses, and the pay is pretty good. Nursing is a hard job though. Maybe see if you can find some people in each field and ask them what they like and hate about their jobs.",
      "author": "AceyAceyAcey",
      "created": 1637871417,
      "upvotes": 3,
      "replies": {
        "hm2taob": {
          "link": "/r/college/comments/r23m38/im_strongly_considering_switching_my_major_to/hm2taob/",
          "text": "They're in demand, but OP wants to become a travel nurse and the market is saturated right now. The higher salaries due to Covid-19 made every other nurse make the switch. And the salaries nurses make now will drop once Covid-19 is over.",
          "author": "kizeltine",
          "created": 1637873746,
          "upvotes": 1,
          "replies": {
            "hmb1bcl": {
              "link": "/r/college/comments/r23m38/im_strongly_considering_switching_my_major_to/hmb1bcl/",
              "text": "Oh I see, that's unfortunate. I would also be okay with another nursing specialty like pediatric nursing or one of the more common nursing specialties.",
              "author": "Saul104",
              "created": 1638040398,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "hmb4am0": {
          "link": "/r/college/comments/r23m38/im_strongly_considering_switching_my_major_to/hmb4am0/",
          "text": "Yeah I have been asking people about the pros and cons, pretty much the only cons of working in the food science industry is that it kind of region locks you, there's a potential to get exposed to biological and chemical hazards, and that it can be a bit dirty. Those cons don't really bother me that much.\n\nI also read online about the cons of nursing, and they don't bother me that much either.\n\n&#x200B;\n\nI guess what I was intending to ask is if I should switch to Food Science and Technology since I find it more interesting than nursing, even though nursing would probably be better from a financial perspective.",
          "author": "Saul104",
          "created": 1638041625,
          "upvotes": 1,
          "replies": {
            "hmb63xz": {
              "link": "/r/college/comments/r23m38/im_strongly_considering_switching_my_major_to/hmb63xz/",
              "text": "Can you do a bit of both for now? The worry with picking one you don’t like as much is you might burn out sooner.",
              "author": "AceyAceyAcey",
              "created": 1638042369,
              "upvotes": 1,
              "replies": {
                "hmcw0x8": {
                  "link": "/r/college/comments/r23m38/im_strongly_considering_switching_my_major_to/hmcw0x8/",
                  "text": "You mean take the prerequisites and a few of the courses if I can from both majors? Yeah I probably could.",
                  "author": "Saul104",
                  "created": 1638070456,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hm2d3wc": {
      "link": "/r/college/comments/r23m38/im_strongly_considering_switching_my_major_to/hm2d3wc/",
      "text": "Also happy Thanksgiving everyone!",
      "author": "Saul104",
      "created": 1637866674,
      "upvotes": 1,
      "replies": {}
    }
  }
}