{
  "sid": "qcfbk3",
  "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/",
  "title:": "Am I way off base being annoyed by a lack of examples in the lectures that match assignments?",
  "text": "I've been getting frustrated by a lack of similarity between lectures and the assignments. I learn by examples. If I need to learn how to do something, like a certain process (which is what most problems are in assignments) then the best way for me to learn is to see the exact same type of process being done. but in this one class, the professor has examples, but not at all the same types of examples as what we're expected to do for assignments.\n\nAm I just being a whiner? Or is there validity to my complaint?",
  "author": "Missing_Back",
  "created": 1634776749,
  "updated": 1634849191,
  "over_18": false,
  "upvotes": 172,
  "upvote_ratio": 0.98,
  "comments": {
    "hhfmzg2": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhfmzg2/",
      "text": "I had a professor who did the same but his reasoning was that you shouldn't be memorizing a rigid process to solve the answers but understand the concept so that no matter the format of how the question is asked, you should be able to solve it.",
      "author": "Traaaaaaaaap",
      "created": 1634777199,
      "upvotes": 99,
      "replies": {
        "hhi8lvp": {
          "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhi8lvp/",
          "text": "I don’t usually mind when they do that for assignments. Now when they throw a curveball during a test…",
          "author": "CrazFight",
          "created": 1634833018,
          "upvotes": 5,
          "replies": {}
        },
        "hhicqnt": {
          "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhicqnt/",
          "text": "Then they should do a better job of explaining the core concept rather than showing a theorem and two problems that aren’t similar to the homework.",
          "author": "Tuckertcs",
          "created": 1634834640,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhfmsf4": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhfmsf4/",
      "text": "Assignments should ideally go beyond lecture materials to stretch your thinking and see if you can extrapolate beyond things that are just given to you during the lecture.",
      "author": "PhDapper",
      "created": 1634777110,
      "upvotes": 49,
      "replies": {}
    },
    "hhfnime": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhfnime/",
      "text": "While I understand the reasoning behind your complaint, it's not a valid complaint. You're going to college so that you can learn concepts that you'll be able to apply to random real world situations. If you need a professor to hand-hold you through how to apply the concepts, then you're not actually learning anything useful and your grade should reflect that inability to apply the concepts to novel situations.",
      "author": "HumanDrinkingTea",
      "created": 1634777436,
      "upvotes": 50,
      "replies": {}
    },
    "hhi62vt": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhi62vt/",
      "text": "The further you go along, the more that this is not the case.  My best professors were always assigning projects and work that either mimicked cases we would see in the field, or projects that would have to build off of multiple lectures and readings to be successfully completed. \n\nShowing examples of how to do an assignment is something you'll see in 100-200 level courses. In those cases, the assignment is something to reinforce a key process or formula that needs to be memorized. Or it's a very basic introduction to a subject. Anything you build off of that typically requires that you do your own critical thinking, and just copying examples deprives you of that opportunity. \n\nI think the only time I can think of where examples were critical were my grad school machine learning courses. We had alot of math and business majors, so coding in R or Python or even SQL/SAS was minimal at best (I couldn't code worth a damn because I was coming from journalism lol). Basic solutions needed to be shown in class to bridge the concepts, but beyond that we were asked to code on our own or find and adapt solutions from elsewhere.",
      "author": "rabel10",
      "created": 1634831984,
      "upvotes": 4,
      "replies": {}
    },
    "hhgijos": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhgijos/",
      "text": "University only gives you the tools to think.",
      "author": "paulllis",
      "created": 1634793757,
      "upvotes": 8,
      "replies": {}
    },
    "hhgmoed": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhgmoed/",
      "text": "Not sure if this is an unpopular opinion but similar to experiments in science subjects, tutorials should mostly be stimulated real world situations where you have to apply theoretical concepts to clients for example.",
      "author": "Eddie_078",
      "created": 1634796845,
      "upvotes": 5,
      "replies": {}
    },
    "hhhkarf": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhhkarf/",
      "text": "No, your feelings are valid and you’re allowed to feel however you want. I’ve had to essentially teach myself/supplement my upper level science classes using outside resources/tutors/videos/practice problems, and it sucks but it is what it is lol. I’ve come across a lot of things that are really “unfair” in college courses, and I’ve just had to suck it up and give myself the best chance I can. I feel you though! I can’t stand professors that intentionally try to make a course harder than it needs to be, or those who brag about half the class failing every semester. It’s not a flex.",
      "author": "Able_Succotash_8914",
      "created": 1634822397,
      "upvotes": 3,
      "replies": {}
    },
    "hhgo8qs": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhgo8qs/",
      "text": "this happens with students often. and you do have a valid point. i remember students from my class had raised a similar question as yours so our professor made us practise every kind of example that existed for a particular problem/chapter. though it took more time than needed, he made sure that every student should be able to solve every question without facing any trouble. and that really helped. he was luckily our maths professor and i liked this approach of teaching. i was weak at maths but his method worked pretty well for me.",
      "author": "lazyybag",
      "created": 1634798111,
      "upvotes": 3,
      "replies": {}
    },
    "hhg70c2": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhg70c2/",
      "text": "Valid! I feel the same. I get if you want me to think through the more complex stuff by myself, but at least show an easy example in class!",
      "author": "bioluminescent-bean",
      "created": 1634786721,
      "upvotes": -1,
      "replies": {}
    },
    "hhi0b8r": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhi0b8r/",
      "text": "If you are in a math/physics/engineering this is normal and expected.",
      "author": "maxweiss_",
      "created": 1634829597,
      "upvotes": 1,
      "replies": {}
    },
    "hhi3n9b": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhi3n9b/",
      "text": "Most of my classes are like this as well. It’s normal for the prof to only explain the concepts and give you basic examples, and it is up to you to apply those concepts to the assignments. Usually, if you ask for help during office hours, they will point you in the right direction.",
      "author": "JupiterRocket",
      "created": 1634830985,
      "upvotes": 1,
      "replies": {}
    },
    "hhja0t6": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhja0t6/",
      "text": "Yikes, I'm surprised at the answers here. I'm non-neurotypical and find myself having to pour more hours into the assignment just to get a latch on the initial concepts and it burns me out of the subject entirely. Or, I find myself plugging more things into my schedule just to meet with a tutor and I put things off until I can ask about them, and it crowds my time management.\n\nMy pre-calc class was notorious for this. I can't think of a \"calculus-y\" example offhand, but let's say you're doing simple arithmetic and the professor spends the session dividing easy numbers, and then, on the HW, the first one divides by zero. Second one divides by a tiny decimal. I feel like its a confidence killer from the offset.  If its your first time seeing it, you don't know how to handle these special cases. My calc class, however, was taught in a reasonable way with a \"walk then run\" mentality and nearly everyone did well. My pre-calc class? Not so much. Most failed. It's not cool to dump these things off on the students and then blame the students, and that professor had a mentality like that. \n\nYour complaint's valid, and everyone has academic strengths and weaknesses. If you're asking for additional help, please don't feel like you need \"hand-holding\" through \"basic concepts\" like some have said here. And no, it doesn't mean you'll be a shitty industry worker; I can say from experience in industry that you're given all of the background knowledge you need to not make mistakes.\n\nIf its the accepted ethos of professors to teach like this... then that explains why a lot of people are burned out and depressed recently.",
      "author": "mindvarious2",
      "created": 1634848021,
      "upvotes": 1,
      "replies": {}
    },
    "hhh5oxt": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhh5oxt/",
      "text": "[removed]",
      "author": null,
      "created": 1634813569,
      "upvotes": -4,
      "replies": {
        "hhi2ni1": {
          "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhi2ni1/",
          "text": "Sorry, it seems your thread or comment is in violation of /r/college Rule #5: Keep it legal and safe.  \r\n\r\nWe permanently ban members whose posts or comments either describe participation in or advocate for illegal or dangerous behavior. The number one offense in this category is piracy. If you link or otherwise refer someone to a repository of pirated material, it's a no questions asked permanent ban. Same for drugs, same for any other activity that breaks the law or endangers safety.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
          "author": "VA_Network_Nerd",
          "created": 1634830575,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhhizy7": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhhizy7/",
      "text": "[removed]",
      "author": null,
      "created": 1634821731,
      "upvotes": -1,
      "replies": {
        "hhi2et4": {
          "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhi2et4/",
          "text": "Sorry, it appears your thread or comment is in violation of /r/college Rule #2: No Spam, No Memes, No Advertising  \r\n\r\nThere are other communities within Reddit better suited for this content. Please share your content there.  \r\n\r\nThe rules can be viewed [here](https://www.reddit.com/r/college/comments/ilbn8c/rcollege_rules/?utm_source=reddit&utm_medium=usertext&utm_name=college&utm_content=t5_2qh3z).  \r\n\r\n-----  \r\n\r\n*If you wish to appeal this action please* **DO NOT** *reply to this automated comment.*  \r\n\r\nInstead, please [message the moderation team](https://www.reddit.com/message/compose?to=%2Fr%2Fcollege).*",
          "author": "VA_Network_Nerd",
          "created": 1634830476,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhirl3r": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhirl3r/",
      "text": "These professors fucking suck. \n\nI had a professor last semester that just reiterated the textbook word for word. We had an exam coming up and he had shown no examples or anything, I was extremely confused. He provided zero additional resources or direction. I didn't understand any of it. I asked him if he could do an example problem some time so I could understand.\n\nHe said no. He was too busy. \n\nI dropped the class. I dropped my concentration in photonics too, because this class was required for that and he was the only professor that conducted the course. \n\nAwful experience.",
      "author": "temsik1587againtwo",
      "created": 1634840586,
      "upvotes": 0,
      "replies": {}
    },
    "hhiznm3": {
      "link": "/r/college/comments/qcfbk3/am_i_way_off_base_being_annoyed_by_a_lack_of/hhiznm3/",
      "text": "Nope! I literally just made a post about something similar. Your paying thousands of dollars to be under-taught the subject and tricked on the exams. It’s totally a scam!",
      "author": "Themanchilddebo",
      "created": 1634843865,
      "upvotes": 1,
      "replies": {}
    }
  }
}