{
  "sid": "r1ykkm",
  "link": "/r/college/comments/r1ykkm/is_dropping_out_a_good_option_for_me_or_should_i/",
  "title:": "Is dropping out a good option for me or should I stick with my program and graduate?",
  "text": "So long story short I'm a student at full sail and before that there were some mistakes. \n I was homeschooled and I lost my transcripts and had to get a GED. I did previously take the ACT which turned out to be pointless. \nI'm still kind of ashamed of that. Every single option felt burnt out and my family kind of thought full sail was the best option so I kind of went a long with that. \nI've spent 3 years of my life taking an online course and it feels like a mistake. \nI hate it and my degrees going to be useless its creative writing btw. So far I have 60,000 dollars worth of debt. I feel like crap and I genuinely don't see an upside to this I feel like my lifes becoming a waste. I know that I'm fully responsible for the mess I'm in I just really want some advice. \nWhat would you guys do if you were in my position and for those that were in my position is there an upside?",
  "author": "DefiningBoredom",
  "created": 1637852878,
  "updated": 1638206990,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hm1pt92": {
      "link": "/r/college/comments/r1ykkm/is_dropping_out_a_good_option_for_me_or_should_i/hm1pt92/",
      "text": "I'd get the degree. You already have accrued a huge amount of debt that will be difficult to pay off with a minimum wage job. At this point, it would be a bigger waste of money to not finish.\n\nJust because you have a bachelor’s in one subject doesn’t mean you’ll have to stick with that industry. It’s not useless. Your degree will allow you to find other jobs that offer better salaries than if you were to have none.",
      "author": "kizeltine",
      "created": 1637856825,
      "upvotes": 3,
      "replies": {}
    },
    "hm4q57j": {
      "link": "/r/college/comments/r1ykkm/is_dropping_out_a_good_option_for_me_or_should_i/hm4q57j/",
      "text": "Maybe consider going to school part-time and working part-time simultaneously. Kind of a compromise. Let's face it: you're already in debt, so you might as well be in debt with a degree rather than be in debt without a degree.",
      "author": "beepbopboopbop69",
      "created": 1637911354,
      "upvotes": 1,
      "replies": {}
    }
  }
}