{
  "sid": "m5qdf6",
  "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/",
  "title:": "Reading off a power point is not a lecture.",
  "text": "I think this is a fair statement.\n\nBut yeah, reading off a power point word for word is not a lecture. Now, if you want to call it a lecture, by all means, call it one.\n\nIt still isn’t the same as in person",
  "author": "Romano16",
  "created": 1615830410,
  "over_18": false,
  "upvotes": 664,
  "upvote_ratio": 0.99,
  "comments": {
    "gr4ktnz": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr4ktnz/",
      "text": "Every student is different in terms of their needs from a teacher. Some get super pissed when everything that might be assessed isn't written down (usually on a slide) for them to study. Others, like OP, can't stand just \"reading\" from the slides because it is boring. Similarly, showing up to class isn't studying and sadly, most students aren't exactly reading the textbook before they get to class.",
      "author": "signalorthenoise",
      "created": 1615905679,
      "upvotes": 1,
      "replies": {}
    },
    "gr3kqap": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr3kqap/",
      "text": "Ah yes the good ol instructor who got to comfortable and lost its passion to teach.",
      "author": "depressedbuttermilk",
      "created": 1615878182,
      "upvotes": 1,
      "replies": {}
    },
    "gr3hcow": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr3hcow/",
      "text": "I once had a prof that had us read the chapter before class, took a quiz when class started. Then proceeded to read the power point that was mainly copied from the chapter we had already been quizzed on. It was the most repetitive difficult class I’ve ever had to sit through. It was awful.",
      "author": "sparklinglove",
      "created": 1615874949,
      "upvotes": 1,
      "replies": {}
    },
    "gr3efhs": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr3efhs/",
      "text": "I have a professor this semester that prepares 60+ slides for each of our lectures and she reads them word-for-word. Each slide is jam packed and I actually don't know how she manages to go through the whole thing.",
      "author": "ur_avg_joe_6v6",
      "created": 1615872393,
      "upvotes": 2,
      "replies": {}
    },
    "gr3434j": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr3434j/",
      "text": "Lol then they have the audacity to tell students not to do the same..for a presentation",
      "author": "LinkOn_NY",
      "created": 1615865255,
      "upvotes": 8,
      "replies": {}
    },
    "gr33q18": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr33q18/",
      "text": "I once dropped a class on the first day because the dude wrote his entire lecture in essay form on PowerPoint (like full paragraphs and very long ones). He would just read what was on the PowerPoint",
      "author": "jennybean2442",
      "created": 1615865034,
      "upvotes": 3,
      "replies": {}
    },
    "gr335le": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr335le/",
      "text": "I like how everyone is acting like this wasnt a normal thing some profs would do before COVID hit.",
      "author": "ooof_buddy",
      "created": 1615864701,
      "upvotes": 5,
      "replies": {}
    },
    "gr2ye07": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2ye07/",
      "text": "You have lectures?",
      "author": "Shohdef",
      "created": 1615862071,
      "upvotes": 3,
      "replies": {}
    },
    "gr2xy1r": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2xy1r/",
      "text": "Better than hearing some old fart go off-topic. Some classes are perfectly fine with PowerPoint like CS courses as they don't have to write during lectures and they can rather explain the concepts in more detail.",
      "author": "themexpride",
      "created": 1615861824,
      "upvotes": 5,
      "replies": {}
    },
    "gr2wigd": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2wigd/",
      "text": "Just make them engagement-based and process-based instead of content-based.",
      "author": null,
      "created": 1615861040,
      "upvotes": 1,
      "replies": {}
    },
    "gr2slk0": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2slk0/",
      "text": "YES",
      "author": "QueenZeon101",
      "created": 1615858953,
      "upvotes": 1,
      "replies": {}
    },
    "gr2s50h": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2s50h/",
      "text": "Wow this literally reminds me of my bio lecture that I had about 20 mins ago. I’d have to walk 10 mins around 7 PM to get to class only for the professor to read of the slides.",
      "author": "leeeelihkvgbv",
      "created": 1615858715,
      "upvotes": 1,
      "replies": {}
    },
    "gr2rpm2": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2rpm2/",
      "text": "I think it's fine to do this as long as the course work is not too hard. If the instructor just reads slides and then on the assignment and test are questions not on the slides at all is when I have a problem. The only thing worse than that is stuff on tests not covered on assignments or slides or even book. I had one instructor do that and it pissed everyone off to the point we never got the first test marks into the system because of how bad it was for everyone lol",
      "author": "Moist_Smegma_Seepage",
      "created": 1615858494,
      "upvotes": 2,
      "replies": {}
    },
    "gr2olj8": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2olj8/",
      "text": "Fully agree.",
      "author": "mathathon1234",
      "created": 1615856877,
      "upvotes": 1,
      "replies": {}
    },
    "gr2mrlr": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2mrlr/",
      "text": "This happened even in the days before PPT.\n\nAs an undergrad I had one prof. who just read from an ancient packet of faded handwritten notes  so old they were falling apart. I always wondered if these were his decades-old notes from grad school. From start to finish, every class, the whole class. One time he forgot his packet of notes, and I swear, the poor guy  panicked and cancelled the class. Ordinarily I would have dropped the course, but he was a nice old fellow, and I felt sorry for him. I promised myself never to be that guy.",
      "author": "SnooHobbies3488",
      "created": 1615855905,
      "upvotes": 14,
      "replies": {}
    },
    "gr2h8gl": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2h8gl/",
      "text": "[deleted]",
      "author": null,
      "created": 1615852696,
      "upvotes": 22,
      "replies": {
        "gr2hd1a": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2hd1a/",
          "text": "This gave me a strong headache. I am so sorry",
          "author": "Romano16",
          "created": 1615852781,
          "upvotes": 7,
          "replies": {}
        },
        "gr2osmm": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2osmm/",
          "text": "Ouch!",
          "author": "SnooHobbies3488",
          "created": 1615856980,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gr2gnbc": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2gnbc/",
      "text": "Lol I had a thermo prof who read off powerpoints but also circled to emphasize, except they circled basically everything to the point where you could no longer read them",
      "author": "Marethyu38",
      "created": 1615852301,
      "upvotes": 28,
      "replies": {
        "gr2npd8": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2npd8/",
          "text": "What a picture! I spit coffee when I read this. :)",
          "author": "SnooHobbies3488",
          "created": 1615856405,
          "upvotes": 6,
          "replies": {}
        },
        "gr2xzky": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2xzky/",
          "text": "That's my digital electronics professor... just underlines and circles things on the slides. The entire screen gets covered in marks everywhere. The class is also boring as shit even though I'm interested in the subject",
          "author": "unholymanserpent",
          "created": 1615861847,
          "upvotes": 3,
          "replies": {
            "gr47ixl": {
              "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr47ixl/",
              "text": "But it’s required for CSBS....I try to find meaning in how it applies",
              "author": "Romano16",
              "created": 1615898794,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "gr235yu": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr235yu/",
      "text": "I don't care about lecture, Id rather every word be on the slide than be studying a powerpoint with unlabelled diagrams",
      "author": "Daniel_The_Thinker",
      "created": 1615843149,
      "upvotes": 8,
      "replies": {}
    },
    "gr222ar": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr222ar/",
      "text": "I have had the same situation for Calculus II (ikr), and Physics I and II - so I hated when I had to go through the book myself and wasted my time sleeping at class.\n\nI think professor's next move should be to turn on accessibility mode and start making the computer read the lecture, and they can just sleep in the lecture like most of us do. (pun intended) \n\nI thought the purpose of the powerpoint slides were like short notes, so the students/professors can use it when they forget some details - not read through it line by line.",
      "author": "p_hu",
      "created": 1615842635,
      "upvotes": 2,
      "replies": {}
    },
    "gr20jfn": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr20jfn/",
      "text": "This is a very fair statement. I enjoy it when professors explain in-depth on how everything works, because it allows for a greater understanding... plus it piques my interest more.\n\nDuring presentations, some students read off of the PowerPoint. Meanwhile I’m here with flashbacks of my vocational teachers hammering ideas about successful, professional presentations into my brain... 😅",
      "author": "Visneko",
      "created": 1615841930,
      "upvotes": 2,
      "replies": {
        "gr20pt5": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr20pt5/",
          "text": "Exactly but I’m in Calc 1 and he’s just reads nonstop for like 45 mins and then that’s it from a ppt",
          "author": "Romano16",
          "created": 1615842011,
          "upvotes": 1,
          "replies": {
            "gr330u5": {
              "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr330u5/",
              "text": "A math class was the last thing I was expecting",
              "author": "figi_luigi_",
              "created": 1615864624,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "gr208ma": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr208ma/",
      "text": "Now I can only see teachers reading off a script on Zoom class xD",
      "author": "dragevards",
      "created": 1615841794,
      "upvotes": 1,
      "replies": {}
    },
    "gr1wu8j": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1wu8j/",
      "text": ">It still isn’t the same as in person\n\nGuess, what -- people do this in person also.\n\nThere's nothing that makes reading it not a lecture. Essentially what they're doing is let you read the lecture notes.",
      "author": "bl1y",
      "created": 1615840270,
      "upvotes": 6,
      "replies": {
        "gr1x5ax": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1x5ax/",
          "text": "I cannot ask questions in a zoom class I have no choice to attend because of COVID though. \n\nAnd the “Lab TA” doesn’t go over anything.\n\nFinally, all tutors are online only. But I am still making an effort during office hours!",
          "author": "Romano16",
          "created": 1615840410,
          "upvotes": 1,
          "replies": {
            "gr21448": {
              "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr21448/",
              "text": "That counts! I'm sure professors appreciate that. I like the one on one attention, and my questions can be really explained when I'm stuck without the stress of feeling like I'm holding up the rest of the class.\n\nIt sucks that you can't ask questions during zoom. I have only one class that meets on zoom, and I can't imagine not begin able to speak up during them. Although, I guess emailing professors works, but it they're busy too, and it takes a while to get help sometimes.",
              "author": "Defrost_ThenStir",
              "created": 1615842193,
              "upvotes": 1,
              "replies": {
                "gr21bzs": {
                  "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr21bzs/",
                  "text": "But I feel so dumb when talking to him. I literally am trying to grasp the concept and feel so bad that I’m not getting it right away",
                  "author": "Romano16",
                  "created": 1615842296,
                  "upvotes": 1,
                  "replies": {
                    "gr22bk6": {
                      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr22bk6/",
                      "text": "Those are the worst. I experienced that especially with math classes. I just made sure I was writing everything down even if it wasn't making sense at the time. And that's probably because I knew I wasn't getting it, maybe I was behind by a section, but the pressure of not wanting to let the professor know I was behind was keeping me from understanding what they said. But as long as I wrote everything down, I could go back to it after the meeting and somehow, with the pressure of being in front of the professor being lifted, the pieces started making sense. But I did have to re-write those notes most of the time; so it is a chore.\n\nThen there were those times when that didn't work either, and I just had to take a break from that assignment for at least a whole day. Usually that helped.",
                      "author": "Defrost_ThenStir",
                      "created": 1615842756,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gr4md57": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr4md57/",
          "text": "I mean, do you personally find it helpful? I typically skip some classes because of this, the professors just read the slides verbatim with no extra input and a few are awful at answering questions to the point that I'm better off reading the slides on my own. In fact, I learn the material much faster that way.\n\nJust feels weird to pay for someone to read your notes out loud to you, I guess.",
          "author": "quantumtrouble",
          "created": 1615906396,
          "upvotes": 1,
          "replies": {
            "gr4xick": {
              "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr4xick/",
              "text": "So let's start with the claim that just reading off power point slides is a waste of time. Well, that tells us one option to \"improve\" things is to have the professor lecture without the slides. They're saying the exact same stuff, just reading from the same script, but now without the added value of the slides. We fixed the problem by making it worse.\n\nSo then we say that just reading a script is a waste of time. Well, we can again \"improve\" things by taking the script away and having the professor lecture mostly the same material, but now from memory. Since the prepared version was probably better than just working from memory, we've again solved the problem by making it worse.\n\nEventually what we have to get at is not saying \"this is bad\" but rather asking \"what do you think would be better\"?",
              "author": "bl1y",
              "created": 1615911427,
              "upvotes": 0,
              "replies": {
                "gr50um7": {
                  "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr50um7/",
                  "text": "I described what would be better in my question--adding their own input or expanding on the topic in a way the slides can't. When you're giving a presentation as a student, are you taught to read off the slides verbatim? No.\n\nThe slides are a guide, but you expand on each point in a way the slides can't. You ask questions to prompt students to interact with you. If you're struggling to imagine how this works, I'll provide an example.\n\nSay there's a slide for what variables are in a computer programming language, and the definition is very technical. The slide might say \"Variables are a storage location paired with an associated symbolic name.\" The professor may then expand on this by comparing variables to a type of box that can hold information. \"Imagine you have a box with some piece of valuable information, such as the position of a player in a video game. At various points in the game, you want to know the players position, so you decide to open the box to look at the value inside. The box is labeled 'Player Position.' Whenever you modify the players position, such as when the player presses the forward key to move, you modify the value inside the Player Position box.\"\n\nIn other words, the professor can add additional metaphors, analogies, and help struggling students by explaining further. Professors who do not do this and instead read off the slides verbatim and also are poor at answering student's questions offer zero value to the student. They literally could not be there and nothing would change.\n\nHope this helps.",
                  "author": "quantumtrouble",
                  "created": 1615912892,
                  "upvotes": 1,
                  "replies": {
                    "gr53555": {
                      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr53555/",
                      "text": "So again this is a case of we can just fix it by making it worse: Decrease the amount of text on the slides, but change nothing about what the professor has said.",
                      "author": "bl1y",
                      "created": 1615913892,
                      "upvotes": 0,
                      "replies": {
                        "gr58dg6": {
                          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr58dg6/",
                          "text": "I guess you're unable to understand what I've written, lol. Good day sir.",
                          "author": "quantumtrouble",
                          "created": 1615916186,
                          "upvotes": 0,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gr1vhmm": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1vhmm/",
      "text": "Depends. During in person classes, I hated when professors would do this. Word for word. But, on the flip side, I had the best experience when they did read off the slides, and then would ask us questions to help us think about the slide. Another good usage of slides is if they only put short bullet points on there, and then lecture on it for a while, so you're forced to make your own notes. It makes me feel like I'm really making myself learn something versus someone who is simply reading to me.\n\nNow, for virtual setting, reading slides is only helpful to me if they are more than just listing off the section headings of the textbook I just read. It's like, did this professor just give us an outline of the chapter? My book already has that. And for those that don't read text books, it's equally as useless.",
      "author": "Defrost_ThenStir",
      "created": 1615839669,
      "upvotes": 94,
      "replies": {
        "gr2bhab": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2bhab/",
          "text": "Back in high school, when we did presentations, our teachers drilled into our heads that we have to only have the bare minimum on our slides. Told us that we needed to learn how to take notes and teach without having everything on the slides spelled out for us since that's what it would be like in college. Almost every class has had an extensive powerpoint to go with the \"lecture\".\n\nThey also told us we would need cursive in real life so I guess we should have realized they were full of shit.",
          "author": "sarahleijon",
          "created": 1615848923,
          "upvotes": 45,
          "replies": {
            "gr2qwfj": {
              "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2qwfj/",
              "text": "Adult student and I find cursive faster to write.",
              "author": "MyCatThinksImSoCool",
              "created": 1615858070,
              "upvotes": 11,
              "replies": {
                "gr2vwdv": {
                  "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr2vwdv/",
                  "text": "Cursive is faster to write but many people cannot read it. I had one girl from Ireland back in Highschool, took beautiful notes in cursive, but no one could read them, we compared it to the Declaration of Independence.",
                  "author": "Romano16",
                  "created": 1615860713,
                  "upvotes": 18,
                  "replies": {
                    "gr34eh8": {
                      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr34eh8/",
                      "text": "That's sad. It is a lost art.",
                      "author": "MyCatThinksImSoCool",
                      "created": 1615865440,
                      "upvotes": 9,
                      "replies": {
                        "gr37bh1": {
                          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr37bh1/",
                          "text": "dang. i learned cursive in 2nd grade and forgot it by 3rd. no way i could've known then but i wish i would have stuck with it. i know one person in my current high school class of 550 that can write cursive and he's a legend. my grandma writes to me in cursive so i at least can read it",
                          "author": "irontricep",
                          "created": 1615867246,
                          "upvotes": 6,
                          "replies": {
                            "gr4q4kd": {
                              "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr4q4kd/",
                              "text": "Practice... Not much else to do in a pandemic.",
                              "author": "MyCatThinksImSoCool",
                              "created": 1615908118,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gr3in8n": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr3in8n/",
          "text": "That's interesting. I learn a lot more from reading than from verbal instruction, so when we have professors that make us take our own notes, I don't do as well in those classes. \n\nEveryone learns differently I suppose.",
          "author": "auntruckus",
          "created": 1615876161,
          "upvotes": 4,
          "replies": {}
        },
        "gr1wz6m": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1wz6m/",
          "text": "Well I can’t ask questions via zoom",
          "author": "Romano16",
          "created": 1615840333,
          "upvotes": -5,
          "replies": {}
        }
      }
    },
    "gr1o1wq": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1o1wq/",
      "text": "A lot of professors do this in person too",
      "author": "kapbear",
      "created": 1615836407,
      "upvotes": 22,
      "replies": {}
    },
    "gr1m7cb": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1m7cb/",
      "text": "Lecturing truly is an art form.\n\nI pride myself on at least trying to not be one of those people who reads off of the lecture slides. It's such a boring, tedious way of communicating.\n\nI feel like I have to casually insert [Death by Powerpoint](https://www.youtube.com/watch?v=lpvgfmEU2Ck) here now...",
      "author": "catscience247",
      "created": 1615835586,
      "upvotes": 139,
      "replies": {
        "gr6uath": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr6uath/",
          "text": "I try to have each lecture be a one slide with a picture, a slide with an equation, and just do example problems for the rest of the hour with class participation.",
          "author": "shadowcentaur",
          "created": 1615943913,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gr1jk53": {
      "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1jk53/",
      "text": "[deleted]",
      "author": null,
      "created": 1615834413,
      "upvotes": 2,
      "replies": {
        "gr1jyab": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1jyab/",
          "text": "I suppose you’re correct but in terms of math and sciences? I learned Pre-Calc online by myself and I passed with an 87%\n\nNow in Calc 1 I’m struggling a bit. I have been studying on my own to improve.\n\nBut now this begs the question: “Why pay thousands of dollars to study something, truly by myself?”",
          "author": "Romano16",
          "created": 1615834585,
          "upvotes": 3,
          "replies": {
            "gr1o9os": {
              "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1o9os/",
              "text": "I think math/science is hard to learn online. I like actually watching how the professor solves it by hand. I don’t even like when they click the PowerPoint and the next line shows up.",
              "author": "kapbear",
              "created": 1615836503,
              "upvotes": 2,
              "replies": {
                "gr1oep6": {
                  "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr1oep6/",
                  "text": "Okay so my current professor does this in 25 mins time then we have lab with our fellow students and then we basically sit in silence for another 45 minutes because no one knows how to do anything.\n\nLab TA doesn’t review or teach just puts us in rooms and we work together",
                  "author": "Romano16",
                  "created": 1615836564,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gr217jk": {
          "link": "/r/college/comments/m5qdf6/reading_off_a_power_point_is_not_a_lecture/gr217jk/",
          "text": "i get that you’re supposed to study the material by yourself, but to say the professor is nice to even read the slides is kind of dumb, no? I could be misinterpreting what you meant, but if the lecture is based on a powerpoint, and the professor isn’t even doing the bare minimum of reading the slides of the powerpoint, what are they even doing?",
          "author": "Kaydon0",
          "created": 1615842238,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634056167
}