{
  "sid": "qusnll",
  "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/",
  "title:": "Is it out of ordinary if you haven’t had one meal with your roommate?",
  "text": "Over 2 months in this semester I still haven’t had a meal together with my roommate. We are civil, crack jokes once in a while, he’s an ok roommate. But I just got a vibe from him implies that this dude wouldn’t want to go with me, so I never I ask. Can anyone give me some insight?",
  "author": "codemonsty",
  "created": 1637016451,
  "updated": 1637181466,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hks9d70": {
      "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hks9d70/",
      "text": "Nope, you don't have to be friends with your roommate, just someone you share a sleeping spot with.",
      "author": "GoldRequest",
      "created": 1637019161,
      "upvotes": 3,
      "replies": {
        "hks9hd8": {
          "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hks9hd8/",
          "text": "Thanks for input",
          "author": "codemonsty",
          "created": 1637019210,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hks9jnj": {
      "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hks9jnj/",
      "text": "I had 8 different roommates and 5 different living situations throughout college and only one of them I had a meal with. Keep in mind I’m a chatty, social person and all of these roommates I did not know more than an acquaintance prior to moving in. It’s a little weird, but I’m just happy to say I made it out the other side with no horror-story roommates!",
      "author": "oddcowgirl",
      "created": 1637019238,
      "upvotes": 2,
      "replies": {
        "hks9y8o": {
          "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hks9y8o/",
          "text": "Gotcha, appreciate your input!",
          "author": "codemonsty",
          "created": 1637019414,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hksaagv": {
      "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hksaagv/",
      "text": "Kinda relieved reading the comment so far",
      "author": "codemonsty",
      "created": 1637019564,
      "upvotes": 2,
      "replies": {}
    },
    "hksncij": {
      "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hksncij/",
      "text": "No, I haven't done anything with my roommates this year. Don't feel like you need to be best friends or anything",
      "author": "hardtaildude",
      "created": 1637025427,
      "upvotes": 1,
      "replies": {}
    },
    "hksrby9": {
      "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hksrby9/",
      "text": "Yeah don’t feel the need to be friends but also if you want to ask them to eat dinner with you, just ask",
      "author": "dejisbenches",
      "created": 1637027180,
      "upvotes": 1,
      "replies": {}
    },
    "hksx2nk": {
      "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hksx2nk/",
      "text": "I can't really speak to this specific scenario since I have 3 roommates but i can share my experience lol. They were all strangers coming in for me and I was prepared either way to have them be just people I live with or to become friends. Two of the roomies already knew each other, so they kinda initiated me into their group and now we're actually pretty close friends and it's nice (for me) to feel comfortable with the people I'm living with and to have people to ask how your day was when you get back from class and to wish you luck on your exam when you leave in the morning. That being said, i don't think there's anything wrong with roomies just being people you live with, but it can make living with strangers more fun and comfortable if you make an effort to get to know them. I'm a homebody so just hanging out at home when my roomies are here is fun. I'd recommend at least sharing a meal to try and break the ice, you def don't have to be friends, but it may make you feel more at ease around the person you live with if you've had some more convos with them",
      "author": "mesingicouldneverok",
      "created": 1637029697,
      "upvotes": 1,
      "replies": {}
    },
    "hkt0amy": {
      "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hkt0amy/",
      "text": "i had with him once, on the day we first met. \n\nhaven't had with him since and probably won't again. not because of anything bad but just because we don't have time and are acquaintances at best",
      "author": "grownrespect",
      "created": 1637031137,
      "upvotes": 1,
      "replies": {}
    },
    "hktiidj": {
      "link": "/r/college/comments/qusnll/is_it_out_of_ordinary_if_you_havent_had_one_meal/hktiidj/",
      "text": "No it's not out of the ordinary.",
      "author": "KW01328",
      "created": 1637040309,
      "upvotes": 1,
      "replies": {}
    }
  }
}