{
  "sid": "rh7eqf",
  "link": "/r/college/comments/rh7eqf/can_my_plan_work/",
  "title:": "Can my plan work?",
  "text": "hey guys, hope u guys doing alright\n\n&#x200B;\n\ni'm hoping to see if my plan works and hopefully some of you with experience through the whole college process can help with reassurance.\n\n&#x200B;\n\ni'm a senior in high school and my GPA as of right now is a 2.5 on a 4.0 scale, and unfortunately I feel like theres a 50/50 chance my GPA will go up or down by graduation, however after high school i either plan to take a year gap (if you wanna know why please ask) or go to community college in order to...\n\n1. cushion my GPA to better my chances getting into the university of my liking\n2. get my associates degree as well (i wanna break this down as well)\n3. be in a better financial position, since i am writing into scholarships/grants/etc. but still want a better standing.\n\nnow before continuing, i've had my mind set on going full on accounting major, then after, work on getting my MBA and CPA, the reason for this is so i can have security on the business side, however for some time i've been thinking of completing a degree in IT at community college, then continuing with said plan, since I want to have a standing on both the business side, and trade side, meaning having hella flexibility out there. (i know that seemed mad confusing, im sorry <3)\n\n \n\nso going back to my second question...\n\n1. is it possible for my to get my associates degree in community college, then continue into university to get my bachelor's?\n2. does it seem as if this plan will work? If not, what should I change or do to make it work?\n3. if you were in my shoes, what would you do?\n\n&#x200B;\n\n&#x200B;\n\nIf you want to know anything else, please let me know.",
  "author": "pandaszn000",
  "created": 1639597140,
  "updated": 1639787895,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hooqcw8": {
      "link": "/r/college/comments/rh7eqf/can_my_plan_work/hooqcw8/",
      "text": "That plan will work, it's common to start at a CC and transfer to a 4 years and most CCs will have transfer agreements with local public 4 years to facilitate this. It's a bit unusual to go IT -> accounting and I'm not sure how much an accountant will benefit from IT skills but as long as you take relevant transfer courses you should still be able to transfer (just make sure you take the classes that will be required for an eventual accounting major).",
      "author": "Melodic_Echidna",
      "created": 1639598662,
      "upvotes": 1,
      "replies": {
        "hosuiox": {
          "link": "/r/college/comments/rh7eqf/can_my_plan_work/hosuiox/",
          "text": "thanks for commenting man, but the reason why I wanted to do IT and Accounting was because I was very interested in both fields, I've been working with computer since I was young, and learned about accounting in my sophomore year and knew I enjoyed learning about it as well. Also, as stated in the post i wanna be as flexible as i possibly can after school, and so whatever happens down the line, i can be able to have options to bounce back from if that makes any sense. btw i talked to a CEO who had graduated from college with a degree i believe was Business Administration, even though he mostly was doing accounting, and said that when he pursued in his MBA, that many tech majors had much difficulty with it due to little knowledge on the business side, but rich on the trade side. but yah it is very unusual for someone to go from IT then into Accounting lmaooo.",
          "author": "pandaszn000",
          "created": 1639674170,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hop9qvh": {
      "link": "/r/college/comments/rh7eqf/can_my_plan_work/hop9qvh/",
      "text": "Coming from someone who went to CC and got their associates and is now at a university to get their Bachelor's, it's totally possible. CC is even better of a route imo because you'll be saving money on classes that are the exact same at a university. I also thought it was less stressful. CC isn't as hard on you about grades as a university is. I graduated high school with a 2.8 GPA and I knew that most universities wouldn't risk taking me because of it. CC had been my plan from the start, anyway. I'm also an IT major, so if you have any questions I can do my best to answer them. I was literally in your shoes 4 years ago. It's not a bad option at all. And you would be getting two degrees at half the price, which is sick. Hope this helps :)",
      "author": "begayanddocrimes",
      "created": 1639606195,
      "upvotes": 1,
      "replies": {
        "hostmyg": {
          "link": "/r/college/comments/rh7eqf/can_my_plan_work/hostmyg/",
          "text": "thanks man, just knowing that other people went down this similar route give hella reassurance.\n\n&#x200B;\n\nyou mentioned you were an IT major yourself and I wanna ask some questions.\n\n1. From your time studying in IT, what are the benefits and drawbacks of it?\n2. Can you tell me your most difficult time with it and how you overcame it?\n3. Are there any resources I can use to get a better standing before going into it?\n\n&#x200B;\n\nagain many thanks for commenting, I'm much more focused on pursuing this path because of this!",
          "author": "pandaszn000",
          "created": 1639673828,
          "upvotes": 1,
          "replies": {
            "hov5y1u": {
              "link": "/r/college/comments/rh7eqf/can_my_plan_work/hov5y1u/",
              "text": "One major benefit for me was becoming more interested in learning on my own time. I was actually going into graphic design and I took a basic coding class as an elective course and discovered that's what I really wanted to do. The drawbacks for me were and still are getting prerequisites and program requirements out of the way. I hate liberal arts classes like history, English and math. It's hard to keep myself focused and on track because it isn't what I want to learn. So keep yourself focused and you should be just fine. Especially if you're better at time management and are more disciplined than I am lol.\n\nI didn't really have any difficulties going into it, other than the classes I didn't want to take. I'm a girl though, haha, so trying to fit myself into the \"man's world\" of technology has been a little stressful for me. Other than that, nothing major. Just struggling with burnout and loss of motivation, I guess.\n\nUse your professors!!! Academic advisors!!! Peers in the same field!!! The more connections you make, the better. Find a club related to IT, or even computers in general. Practice on your own time. Build a computer. Upgrade your computer. Fix up some old technology you or someone else might have lying around. I'm super into web development, so practicing my HTML and CSS is helpful for me. But I also like the actual fixing part of IT, so I got a work study job on campus in the IT Department. Look into your community.\n\nI'm so glad I could help you! Please reach out if you have any more questions!",
              "author": "begayanddocrimes",
              "created": 1639708608,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hopgtjk": {
      "link": "/r/college/comments/rh7eqf/can_my_plan_work/hopgtjk/",
      "text": "Yes, this would work, and is probably the smartest option.",
      "author": "needhelpne2020",
      "created": 1639609108,
      "upvotes": 1,
      "replies": {}
    }
  }
}