{
  "sid": "q0zymy",
  "link": "/r/college/comments/q0zymy/at_what_point_does_the_professordepartment_be/",
  "title:": "At what point does the professor/department be held responsible for the pass rate of a class?",
  "text": "I am currently taking a class in solids in college for an engineering degree in civil. This class is notoriously class but I don't feel this is the reason in my case more so the professor/department.\n\nThis class is notorious for its pass rate. It has a pass rate of at least 20-25 % of students pass and also of those that did pass about 80% are repeaters. On average it takes at least 3 tries to pass. This is made possible because the department only allows this professor to teach the class and also bar you from transferring it in from anywhere else. There also isn't any curve in this class so your performance isn't based on your peers.\n\nThe professor's exams are extremely difficult not because of the material itself being hard but the exams are made of concepts and techniques that we never went over in class.There were times where  I did a question and got a 5/10 for an exam and was told by the TA that was a good score even though my answers were correct and the reason was because he didn't understand what I was doing even though i can explain it back to him. \n\nI am extremely frustrated because there are students who are in the program for 5-7 years because of this. It's not because the students aren't capable because many switch schools and majors and take this class and pass with flying colors I just would like to know if its just me or is the department just trying to milk us by keeping the program like this.",
  "author": "MAB592",
  "created": 1633329030,
  "updated": 1634084238,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hfd0otc": {
      "link": "/r/college/comments/q0zymy/at_what_point_does_the_professordepartment_be/hfd0otc/",
      "text": "The pass rate for the class is evaluated on a long-term, multiple class basis. If students struggle every time they teach the course, it could be a pattern and will be brought up. But one class? -- nah, it's entirely possible that most of the students are idiots. It happens sometimes.",
      "author": "Bravely-Redditting",
      "created": 1633361891,
      "upvotes": 4,
      "replies": {}
    },
    "hfdeay2": {
      "link": "/r/college/comments/q0zymy/at_what_point_does_the_professordepartment_be/hfdeay2/",
      "text": "A low pass rate is not necessarily the fault of the professor, it can also just be a hard course. This is more acceptable in upper level classes than introductory classes because of the complexity of the information. The issue is less the pass rate and more is the teacher presenting expected material, preparing students adequately for assessment, and giving appropriate exams.  If these are true than it is simply a hard course, otherwise there may be a reason to adjust the class.",
      "author": "hdorsettcase",
      "created": 1633367224,
      "upvotes": 2,
      "replies": {}
    },
    "hfbpg8a": {
      "link": "/r/college/comments/q0zymy/at_what_point_does_the_professordepartment_be/hfbpg8a/",
      "text": "Unfortunately a ton of math and science college courses operate this exact same manner in the USA. Some instructors even brag how tough their courses are. \n\nYou can try to bring this issue up with the department chair and the Office of Student Affairs, but I don't think much can be done.\n\nAlso, maybe the department offers tutoring for the course.\n\nGood luck!",
      "author": "jayatcsus",
      "created": 1633330844,
      "upvotes": 1,
      "replies": {}
    },
    "hfciikf": {
      "link": "/r/college/comments/q0zymy/at_what_point_does_the_professordepartment_be/hfciikf/",
      "text": "I have a class exactly like this. Botany. It’s ridiculously hard and the professor also stopped anyone from going elsewhere to take it. Luckily the school has to honor their transfer relationship with one of the community colleges nearby, so you are supposed to be able to take it there. Unfortunately though that school wasn’t offering it last summer, so I’m taking the class here once again. He has tenure and is very well respected by the professors here, but I’ve literally had other professors tell me straight up not to take it here since you will most likely fail. If you go anywhere else you will pass easily. It’s ridiculous.",
      "author": "WickedPuffin",
      "created": 1633353485,
      "upvotes": 1,
      "replies": {}
    },
    "hfcjr9l": {
      "link": "/r/college/comments/q0zymy/at_what_point_does_the_professordepartment_be/hfcjr9l/",
      "text": "Make friends with someone who took the classes before and study their old test",
      "author": "kapbear",
      "created": 1633354133,
      "upvotes": 0,
      "replies": {}
    }
  }
}