{
  "sid": "eqm3o6",
  "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/",
  "title:": "Professor erased my answer on the final exam",
  "text": "I had a final exam in fall 2019 in macroeconomics. I completed all the questions and even came to him a couple of times during the exam. My exam has been written with a pencil, and I got 26/30. I lost 3 points because one of the questions I didn't attempt. I assigned the meeting with him on January 7 after almost a month after the grade was posted because he was not able to see me earlier. When we met, I didn't expect that I missed a question, and I definitely forgot everything about this exam, but when I came home that's got clear that I actually completed this part, but it has been erased because I personally remember how I was coming to him regarding this part. I got B for this course with 88%, but if this part would be completed I would get almost 94% what would be an A. What shall I do in order to get my points?",
  "author": "AlexShox",
  "created": 1579380487,
  "over_18": false,
  "upvotes": 553,
  "upvote_ratio": 0.93,
  "comments": {
    "ff1h5d8": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/ff1h5d8/",
      "text": "lol everyone in the comments are like \"*a prof wouldn't do that ever!!!*\".....as if some professors arnt complete dickheads lol.\n\nim not saying i think op is 100% lying or forgot. and im also not saying that the prof 100% did it ,either.\n\nbuts its very...interesting see the amount of people who **immediately** think the prof 100% didn't have anything to with it.",
      "author": "ButteryBakedSalmon",
      "created": 1579479146,
      "upvotes": 2,
      "replies": {}
    },
    "fezl4wm": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fezl4wm/",
      "text": "Why would a professor do that",
      "author": "trippyequid",
      "created": 1579458496,
      "upvotes": 1,
      "replies": {}
    },
    "fezb2sc": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fezb2sc/",
      "text": "Moral of the story: write in pen. Seriously, it's a lot easier to cross off am answer with a pen than to erase. If it's a calculation based test make sure you give yourself space to get the wrong answer. \n\nAlso the prof has no reason to erase your answers. (Unless they are a secret villain who has plotted this moment for a long time). Chances are you forgot you erased it and handed it in before you realized you didn't answer it. This isn't an appeal because you failed, it's an appeal because you think you deserve better. Most appeal committees/department will dismiss this immediately.",
      "author": "squatterbee",
      "created": 1579455559,
      "upvotes": 2,
      "replies": {}
    },
    "feyr9av": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feyr9av/",
      "text": "That's probably one of the reasons why we aren't allowed to use pencils or erasable pens in exams. Also, the writing is heat sensitive, so getting too hot (sometimes even being in a backpack in summer, seriously, I once lost half of my notes for an open book exam like this) can lead to erasure",
      "author": "CombatWombat994",
      "created": 1579449667,
      "upvotes": 4,
      "replies": {}
    },
    "fex19pj": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fex19pj/",
      "text": "[deleted]",
      "author": null,
      "created": 1579422680,
      "upvotes": 0,
      "replies": {
        "feyijjx": {
          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feyijjx/",
          "text": "TA",
          "author": "AlexShox",
          "created": 1579445920,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "fewwtxn": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fewwtxn/",
      "text": "Take the b",
      "author": "JuanaSmoke",
      "created": 1579420718,
      "upvotes": 4,
      "replies": {}
    },
    "fewiwkm": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fewiwkm/",
      "text": "It sounds to me more like you wrote an answer that was incorrect, erased it because you knew it was incorrect, and rather than own up to your grade and admit your lost points you are trying to come to a subreddit and brainstorm for plausible reasons a professor would erase your answer on a test, which makes absolutely no fucking sense and sounds absolutely preposterous.",
      "author": "chrisrayn",
      "created": 1579411457,
      "upvotes": 29,
      "replies": {
        "fey5727": {
          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fey5727/",
          "text": "Yeah OP seems to want to justify his garbage.",
          "author": "GrantNexus",
          "created": 1579440940,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "few5naq": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/few5naq/",
      "text": "Did the professor hire any students to grade papers? I know sometimes that happens. My only thought would be what if that student wanted to be top of the class?",
      "author": "ham-man-roy-the-boy",
      "created": 1579405751,
      "upvotes": 8,
      "replies": {}
    },
    "fevwgpf": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fevwgpf/",
      "text": "I am an economics student in college right now and I would be furious. I’d skip and go right to administration and file a complaint. That is serious.",
      "author": "lichesschessanalyst",
      "created": 1579402307,
      "upvotes": -42,
      "replies": {}
    },
    "fevo5xp": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fevo5xp/",
      "text": "I can think of a couple scenarios, but none of which include the professor erasing test answers for statistical reasons.  Maybe during the test you were provided some instruction which was erased following your mid test discussion with the expectation you would fill it in yourself and the professor would not technically be answering questions for you. Then you sat back down and continued the test without actually answering the question.  Or perhaps.....Frankly, stating that your arrival home \"triggered\" a sudden clarity regarding the situation sounds like you've presented this narrative to your parents who are calling you out on a lie by asking you to pursue the matter further. Either way, you have a blank test which isn't redeemable for points.",
      "author": null,
      "created": 1579399615,
      "upvotes": 23,
      "replies": {}
    },
    "fevewz7": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fevewz7/",
      "text": "I would go to him about it, but phrase it as \"I am really positive that I answered this, and as you might remember I thought about this question in-depth beforehand and even came to you to discuss it. So I was fully prepared and was sure to answer it. As a result, I am confused that my work is missing for this question. I believe there was a chance that my test was altered after taking it. Is there anything I can do?\" \n\nAs another commenter mentioned, the much more likelier case is that a fellow student got a hold of your test and erased an answer. Even if the class isn't curved, someone could have just been salty about doing poorly in the course, or wanted to look better, or resented that you seemed to be doing well. Maybe they saw you raise your hand in class and got jealous, or maybe they don't know you and just erased some random answers on random people's tests. \n\nIt's a good idea to bring this to your professor's attention, because first off it's possible this was a more widespread problem, and second off he should have some knowledge about who handled the tests, where they were stored, etc. that could help answer if another student accessed them. \n\n(Not only would suggesting he changed it ruin your chances of him helping you, it's also very implausible. If he had too many A's he could just curve the test or final grades.)",
      "author": "emelita_mouse",
      "created": 1579396579,
      "upvotes": 73,
      "replies": {}
    },
    "feu3yvr": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feu3yvr/",
      "text": "[deleted]",
      "author": null,
      "created": 1579382909,
      "upvotes": 65,
      "replies": {
        "fewu9ma": {
          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fewu9ma/",
          "text": "This sounds like the plot of an after school Disney show.",
          "author": "shackusa",
          "created": 1579419584,
          "upvotes": 33,
          "replies": {}
        }
      }
    },
    "fetwgq6": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fetwgq6/",
      "text": "I agree with the other commenter here, I can't think of a single reason why a professor would feel the need to do something like that. I feel like there's something you're not telling us.",
      "author": "CirKill",
      "created": 1579380720,
      "upvotes": 169,
      "replies": {
        "feu12tr": {
          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feu12tr/",
          "text": "I understand that point too, but there is a sign of eraser...(",
          "author": "AlexShox",
          "created": 1579382099,
          "upvotes": 28,
          "replies": {
            "feuwqyy": {
              "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feuwqyy/",
              "text": "The obvious explanation is that you erased something during the exam and just forgot about it.",
              "author": "justaboringname",
              "created": 1579390716,
              "upvotes": 132,
              "replies": {
                "feuxcxm": {
                  "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feuxcxm/",
                  "text": "I don't think so, I remember clearly that I gave him to check this question before submitting, and he told me that this question looks okay, and I submitted right after he told me that.",
                  "author": "AlexShox",
                  "created": 1579390908,
                  "upvotes": 22,
                  "replies": {
                    "few12ps": {
                      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/few12ps/",
                      "text": "I hate to say it but you said you don’t remember anything about the exam? Also you probably just gave up frustrated and erased your answer",
                      "author": "charlesdickinsideme",
                      "created": 1579403970,
                      "upvotes": 60,
                      "replies": {
                        "few55h9": {
                          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/few55h9/",
                          "text": "Honestly, it’s really fucking hard to forget everything about an exam. OP’s argument also has like zero credibility. OP erased a question and forgot.",
                          "author": "uhRomeo",
                          "created": 1579405540,
                          "upvotes": 49,
                          "replies": {
                            "fezvmfs": {
                              "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fezvmfs/",
                              "text": "Like if we just do logical deduction, there's a lot of other options we can jump to before we reach the conclusion of \"professor erased answer and risked professional reputation for some random reason?\" Like I'm surprised he even got the exam back; I never get my final exams back.",
                              "author": "doneanddead",
                              "created": 1579462238,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ff08nfr": {
          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/ff08nfr/",
          "text": "Some professors have tiny dick energy. They do shit like that because they are bullies who never left highschool.",
          "author": "Ryugi",
          "created": 1579466350,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "fetvqk0": {
      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fetvqk0/",
      "text": "Did you look at the exam? It would be very obvious if an answer was erased. Also what motive would a professor have to do that..?",
      "author": "jumorgan",
      "created": 1579380564,
      "upvotes": 395,
      "replies": {
        "feu0mii": {
          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feu0mii/",
          "text": "Yep, the exam has the signs of an eraser in this part. I don't know, but I have an idea that he wanted that only 20% of the class should have an A, and maybe this semester was exceeding an amount of A students.",
          "author": "AlexShox",
          "created": 1579381959,
          "upvotes": 292,
          "replies": {
            "feu6nph": {
              "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feu6nph/",
              "text": "Hmm it’s just hard to argue. You said you don’t remember anything about the exam. So maybe you answered it and changed your mind and then forgot to fix your answer? Who knows.",
              "author": "jumorgan",
              "created": 1579383641,
              "upvotes": 191,
              "replies": {
                "feuy3rg": {
                  "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feuy3rg/",
                  "text": "That makes sense to me, but I had problems with this question and I came to him a couple of times regarding this, and even right before submitting I asked him about this question.",
                  "author": "AlexShox",
                  "created": 1579391061,
                  "upvotes": 123,
                  "replies": {
                    "few9s8s": {
                      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/few9s8s/",
                      "text": "If you answered and erased a couple of times, there's a possibility that the friction of the paper on top of it effectively erased it again on its own. \n\nSo, sadly the Prof is right, and you did nothing wrong.",
                      "author": "which_spartacus",
                      "created": 1579407278,
                      "upvotes": 53,
                      "replies": {
                        "fewb1qf": {
                          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fewb1qf/",
                          "text": "That seems far-fetched in all honesty, but a good idea.",
                          "author": "MidnightAdrenaline",
                          "created": 1579407786,
                          "upvotes": 69,
                          "replies": {
                            "fewbn05": {
                              "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fewbn05/",
                              "text": "It's an experiment you can try. It may put your mind at ease.",
                              "author": "which_spartacus",
                              "created": 1579408020,
                              "upvotes": 15,
                              "replies": {
                                "fewgr83": {
                                  "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fewgr83/",
                                  "text": "I tried it. It could be a low quality eraser but I reeeeeeally had to rub the papers together and I left a lot of eraser on the paper. I still don't believe this is a plausible argument--it seems like a possibility, but an anomaly at that",
                                  "author": "MidnightAdrenaline",
                                  "created": 1579410315,
                                  "upvotes": 32,
                                  "replies": {}
                                }
                              }
                            },
                            "feyxqum": {
                              "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feyxqum/",
                              "text": "Agreed that it seems far fetched, but the idea that the professor actually erased his answer seems even more far fetched lol",
                              "author": "synchh",
                              "created": 1579451734,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "feyqstk": {
                      "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feyqstk/",
                      "text": "Wait you’re allowed to ask your professor about exam questions?! Is that normal in the US?",
                      "author": "purple_5",
                      "created": 1579449373,
                      "upvotes": 5,
                      "replies": {
                        "feywiqb": {
                          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/feywiqb/",
                          "text": "Most professors will allow questions about the exam mainly for clarification purposes. Like if I didn’t understand exactly what a professor was asking with a certain question I could ask him/her to clarify.",
                          "author": "ScribblesTh3Dog",
                          "created": 1579451384,
                          "upvotes": 6,
                          "replies": {
                            "ff0497v": {
                              "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/ff0497v/",
                              "text": "Oh right I see, that makes sense",
                              "author": "purple_5",
                              "created": 1579465031,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "fez1j76": {
          "link": "/r/college/comments/eqm3o6/professor_erased_my_answer_on_the_final_exam/fez1j76/",
          "text": "The more likely explanation is TS erased the answer intendeing to go back to change it but forgot.",
          "author": "wolf2600",
          "created": 1579453061,
          "upvotes": 3,
          "replies": {}
        }
      }
    }
  },
  "updated": 1634050557
}