{
  "sid": "q55em8",
  "link": "/r/college/comments/q55em8/is_it_bad_i_wasnt_productive_during_vacation/",
  "title:": "Is it bad i wasn’t productive during vacation before i start college.",
  "text": "So college is about to start, and I had an almost 5 months long vacation. Is it bad that I didn’t really do anything that is productive? There are days that i was productive but then i’ll go back in a slump for weeks. All i did were sleep, watch movies/youtube vids, and read. Half of me is guilty and half of me is saying that it’s okay since i wouldn’t have this much of free time in college.",
  "author": "clzhongs",
  "created": 1633861151,
  "updated": 1634083077,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hg3bxf8": {
      "link": "/r/college/comments/q55em8/is_it_bad_i_wasnt_productive_during_vacation/hg3bxf8/",
      "text": "Regardless whether it's\"bad\" or not, don't beat yourself up over it. It's over and it's in the past. There's nothing positive that will come from dwelling on it.\n\nJust stay motivated now and make sure you take your school work seriously. You'll be a-okay.",
      "author": "CFDoom13",
      "created": 1633865099,
      "upvotes": 2,
      "replies": {}
    },
    "hg3byvc": {
      "link": "/r/college/comments/q55em8/is_it_bad_i_wasnt_productive_during_vacation/hg3byvc/",
      "text": "There's nothing wrong with relaxing during a vacation. You don't always have to be productive if you don't feel like it and aren't obligated to. Hopefully you enjoyed your vacation and don't regret how you spent your time.",
      "author": "noagnst",
      "created": 1633865129,
      "upvotes": 2,
      "replies": {}
    },
    "hg3nlzs": {
      "link": "/r/college/comments/q55em8/is_it_bad_i_wasnt_productive_during_vacation/hg3nlzs/",
      "text": "A lot of my classes had ungraded (you got 100% for doing it) 1st assignments, reduced weight 1st assignments or just started assignments a week or two after the semester started. This basically acted as a warm up period to dust off the cobwebs from my brain from doing zero academic anything for 4 months. Hopefully your school does the same system.",
      "author": "SussyVent",
      "created": 1633872537,
      "upvotes": 2,
      "replies": {}
    }
  }
}