{
  "sid": "qxlxpo",
  "link": "/r/college/comments/qxlxpo/depression_is_ruining_my_school_life_and_gpa_i/",
  "title:": "Depression is ruining my school life and GPA I don’t know what to do anymore….",
  "text": "I’ve tried every support system my school has to offer and I must say it’s done nothing for me… I’ve taken medication, therapy etc and nothing. My gpa is starting to suffer and I have two midterm exams next week and I don’t even know where to begin…. So I’m pretty sure I’m going to fail. I’m so behind in my studies as most days I feel so shitty I just sleep any free time I have. My peers are studying all day and all night but I just don’t have that drive anymore. I’ve pushed and pushed myself and the more I tried my grades just keep falling so I’ve just actively stopped trying and I feel like I’m slowly digging my own grave. I’ve no friends, I don’t go out so I’m stuck in my dorm room all day doing online classes and I can’t stay awake to study and I’ve slowly lost interest in my degree since I’m having such a krappy time. What do I do? Is there anyway to save myself? I keep contemplating dropping out but I’m already in my 4th year of a 5 year program.",
  "author": "Alphafluffy101",
  "created": 1637345288,
  "updated": 1637389872,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hlb8xn5": {
      "link": "/r/college/comments/qxlxpo/depression_is_ruining_my_school_life_and_gpa_i/hlb8xn5/",
      "text": "i feel you, im in my third year of a four-year program. im ready to take a break. doesn't mean im giving up, just taking my time. no need to rush through this. college should not feel like a chore. i notice my classmates are also far more driven than i am and my professor always brings up that this is all part of the \"college experience\". if it's not fulfilling, maybe it's time to just take a breather",
      "author": "throwawayyayayye",
      "created": 1637359759,
      "upvotes": 2,
      "replies": {}
    }
  }
}