{
  "sid": "rgfmm0",
  "link": "/r/college/comments/rgfmm0/can_my_professor_do_anything/",
  "title:": "Can my professor do anything?",
  "text": "We have a Final Essay for one of my courses, the thing is whether I get a 0 or 100% my grade remains a B, if I don’t turn in my final can my professor do anything besides give me a 0? For not doing the final.",
  "author": "Lazy-Masterpiece666",
  "created": 1639511363,
  "updated": 1639515991,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hojvc8a": {
      "link": "/r/college/comments/rgfmm0/can_my_professor_do_anything/hojvc8a/",
      "text": "I heard from others that professors can fail you for missing an exam.",
      "author": "SportsMajor",
      "created": 1639511690,
      "upvotes": 1,
      "replies": {}
    },
    "hojwpdi": {
      "link": "/r/college/comments/rgfmm0/can_my_professor_do_anything/hojwpdi/",
      "text": "Read the syllabus. It sounds like this “final essay” doesn’t count for much if it can’t even change your letter grade. I have definitely done this before, that is I haven’t turned in assignments at the end of the semester that wouldn’t affect my final grade in order to prioritize other things. In my opinion that’s just working smarter and not harder. Read the syllabus, read the assignment, read everything to make sure that you’re not required to do this to pass the class, but otherwise I wouldn’t bother. Also double check your math to make sure it won’t bring your grade down if you get a zero.",
      "author": "ilikecacti2",
      "created": 1639512221,
      "upvotes": 1,
      "replies": {
        "hojxu2r": {
          "link": "/r/college/comments/rgfmm0/can_my_professor_do_anything/hojxu2r/",
          "text": "It’s worth nearly a whole grade, the thing is if I get 100% I’m still barley at 89% I doubt she’ll bump my grade a whole 1% not to mention I’d need a PERFECT essay to even get to the 89%, meanwhile if I don’t take it my grade falls to like an 80.5% which is still a B. Thanks for your insight.",
          "author": "Lazy-Masterpiece666",
          "created": 1639512664,
          "upvotes": 1,
          "replies": {
            "hok2tan": {
              "link": "/r/college/comments/rgfmm0/can_my_professor_do_anything/hok2tan/",
              "text": "So you're saying the final exam takes up 8.5% of your grade? That sounds like a really weird percentage for the final exam to be, but if you're sure that the case then you're probably good, although I'd take the exam just in case.",
              "author": "gargar070402",
              "created": 1639514627,
              "upvotes": 1,
              "replies": {
                "hok32en": {
                  "link": "/r/college/comments/rgfmm0/can_my_professor_do_anything/hok32en/",
                  "text": "It’s cause she wants to keep the course at exactly 100 points, so I just simply have to look at how many points I have for my % I’m already over 81.5 so I’ve secured a B.",
                  "author": "Lazy-Masterpiece666",
                  "created": 1639514729,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}