{
  "sid": "q1kdov",
  "link": "/r/college/comments/q1kdov/is_a_history_degree_worth_it/",
  "title:": "Is a History Degree worth it?",
  "text": "Any idea if perusing a degree in history is worth it job wise? Currently a stem major in ecology but considering changing to history because I am utterly failing chemistry. I’ve always loved history and I feel more passionate about that rn than whatever I’m doing. But I feel like if thats what I want to do then I should just drop out because whats a degree going to get me when I could just read as many books as I can? Idk",
  "author": "Harpo1999",
  "created": 1633397442,
  "updated": 1634084157,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hfhhpu5": {
      "link": "/r/college/comments/q1kdov/is_a_history_degree_worth_it/hfhhpu5/",
      "text": "2020 graduate and history degree holder here. I worked in public history at my city’s historic preservation non-profit while in college. I got a lot of great experience and made some amazing community relationships that helped me to build my career.\n\nI would suggest tapping into the local network to take full advantage of your academic experience and begin to work on building your ideal career while you’re still in school.\n\nI worked with professors on research gigs having my work published in books and publications and with locals to assist in litigation support and miscellaneous newspaper and genealogical research. After college I began working for a national consulting corporation on location-based research for environmental impact for real estate due diligence project. I am again using my research and writing experience to pivot my career into the media sales industry in a research role that uses insights and research to connect media companies with prospective advertisers.\n\nI love history and have been able to pivot around the foundation that my degree provides. Ultimately if you want to specialize within the field or go into law you must prepare for further education. Otherwise be sure to enhance your resume with extracurriculars and meaningful experience.",
      "author": "holyrodeo",
      "created": 1633445812,
      "upvotes": 2,
      "replies": {}
    },
    "hffj3rv": {
      "link": "/r/college/comments/q1kdov/is_a_history_degree_worth_it/hffj3rv/",
      "text": "Depends. What do you want to do with it? Does your program have you specialize or not?",
      "author": "ItzN0tMe",
      "created": 1633399226,
      "upvotes": 1,
      "replies": {}
    },
    "hffqm39": {
      "link": "/r/college/comments/q1kdov/is_a_history_degree_worth_it/hffqm39/",
      "text": "you should deeply consider what kind of career you want before changing your major.",
      "author": "postmaloneismediocre",
      "created": 1633403045,
      "upvotes": 1,
      "replies": {}
    },
    "hfgyiyz": {
      "link": "/r/college/comments/q1kdov/is_a_history_degree_worth_it/hfgyiyz/",
      "text": "IMO, no.",
      "author": "TragicalKingdom",
      "created": 1633436521,
      "upvotes": 1,
      "replies": {}
    },
    "hfkkuze": {
      "link": "/r/college/comments/q1kdov/is_a_history_degree_worth_it/hfkkuze/",
      "text": "Try to consider International Relations instead.",
      "author": "dostoyevsky013",
      "created": 1633497453,
      "upvotes": 1,
      "replies": {}
    }
  }
}