{
  "sid": "rd1e0f",
  "link": "/r/college/comments/rd1e0f/how_should_i_interpret_an_8984_in_chem/",
  "title:": "How should I interpret an 89.84 in chem?",
  "text": "So i’m a freshman in college. I’ve always been a straight A student. I graduated as salutatorian of my high school with a 5.3 GPA. I’m very proud of my first semester of college. I’ve maintained A’s in every class… except chemistry. it’s really just not my strong suit. i have studied my ass off for the class, and i’ve really put forth all of my effort. My professor posted a final grade calculator spreadsheet where we enter all of our grades and it spits out our average along with a letter grade. I just got my lab grade back today, so i was playing around with the calculator. i was pretty sure all semester that i’d end up getting a b in the class (89-80). when i put all of my grades in the spreadsheet, my final average is an 89.84, and the column next to it reads “A.” however, i know many professors aren’t really fond of rounding… Do i assume it’s a B and hope for an A? or do i expect that the spreadsheet is right? or should i just email my professor and ask him? i’ve already checked the syllabus and there’s nothing about rounding grades, but they get finalized tomorrow. any help would be appreciated.",
  "author": "PeanutButterflyg",
  "created": 1639114449,
  "updated": 1639516770,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hnyckwl": {
      "link": "/r/college/comments/rd1e0f/how_should_i_interpret_an_8984_in_chem/hnyckwl/",
      "text": "You did your best and it might get you an A. I would just wait it out and see what you get. Congrats smartie!",
      "author": "BlueOcean7987",
      "created": 1639114818,
      "upvotes": 3,
      "replies": {}
    },
    "hnyo7j4": {
      "link": "/r/college/comments/rd1e0f/how_should_i_interpret_an_8984_in_chem/hnyo7j4/",
      "text": "check your syllabus. it's possible that a 89.84 really does count as an A\n\nlastly it's just a grade, i see the perfectionism but when you don't get what you want, you have to let it go and value more important things like good health, friends, personal interests, and family support. your alternative is being miserable over something that has little bearing over you as a person and not in your control.",
      "author": "No-Statement-5594",
      "created": 1639122323,
      "upvotes": 3,
      "replies": {}
    },
    "hoet01r": {
      "link": "/r/college/comments/rd1e0f/how_should_i_interpret_an_8984_in_chem/hoet01r/",
      "text": "just wanted to update everyone: the grade was indeed rounded and i ended my first semester with a 4.0. thanks for all of your advice!",
      "author": "PeanutButterflyg",
      "created": 1639421098,
      "upvotes": 1,
      "replies": {}
    },
    "hnydsgm": {
      "link": "/r/college/comments/rd1e0f/how_should_i_interpret_an_8984_in_chem/hnydsgm/",
      "text": "If there isn't any harm in doing so, you might as well just email your professor. Better than not taking a shot at all.",
      "author": "kakusei_zero",
      "created": 1639115530,
      "upvotes": -2,
      "replies": {}
    }
  }
}