{
  "sid": "qkldsw",
  "link": "/r/college/comments/qkldsw/is_it_possible_for_me_to_get_into_a_decent/",
  "title:": "Is it possible for me to get into a decent master's program at all??",
  "text": "I am about to be a junior next semester and currently have a 2.7 GPA right now. I also don't go to a very popular college and it's located in the city. I have low grades and I am thinking about either getting into a masters program for applied statistics, economics, data science, or accounting. However, I might have no chance because I got a few C grades in my early math classes and I had to withdraw from Calculus 1 twice. I am also interested in economics and I have a B and B- in the first two economics classes so far. I understand that I screwed up bad but I am thinking about changing my life around. I have a total of 5 w grades and I am thinking about trying to at least get into a masters program for higher education as that I am thinking about pursuing a career in data science or possibly a consulting/financial field like quantitative analysis. I have a total of 5 w grades on my transcript so far and I don't want to end up a failure. I just need brutal honesty. I am currently about to be a junior this Fall and if it's not possible for me to get into a master's program, what are some possible career choices for me? What else can I do? I don't have internships yet but I am looking for some experience in the field so that I can get accepted later possibly. Are online master's a good choice because I was just thinking about that. I also graduate in two years so does anyone have some advice for me?",
  "author": "Journeyman-3444",
  "created": 1635794195,
  "updated": 1635890858,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hixom52": {
      "link": "/r/college/comments/qkldsw/is_it_possible_for_me_to_get_into_a_decent/hixom52/",
      "text": "Try to aim for a 3.0 at minimum upon graduation. Most places will not look at applicants under 3.0 (3.5 is competitive in many places.) As the other poster said, look for opportunities in research, internship, etc. Doing better and showing an upward trend is important. If you have circumstances that contributed to these grades or having difficulty they can usually be addressed in a grad school statement. Hope is not lost.",
      "author": "lightbluejellyfish",
      "created": 1635803046,
      "upvotes": 2,
      "replies": {}
    },
    "hix5eer": {
      "link": "/r/college/comments/qkldsw/is_it_possible_for_me_to_get_into_a_decent/hix5eer/",
      "text": "Firstly, take a deep breath, another, maybe a few more. Seems like you need it\nNow, coming from someone who got a couple conditional Master's offers from the UK, based on my experience, you may not be able to get into a top uni, but if you improve your performance you'll make to a good place.\nRegarding what else you can do, I'd say seek help, seems like you could do with it,\nAlso, look for opportunities,  don't just wait for them, seek them out. Figure out what academic event interests you - could be a financial competition, paper presentation, maybe something else. And look for those opportunities.  What boosted my application was my participation in paper presentations. \nAn internship is a good idea too, but make sure it's relevant to Economics/Finance\n\nIt's not too late, you can turn this around and get into a good Master's programme \nBest wishes!",
      "author": "grapewaterlemon",
      "created": 1635795234,
      "upvotes": 1,
      "replies": {}
    }
  }
}