{
  "sid": "pxac5v",
  "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/",
  "title:": "Which major is more difficult Electrical engineering or Nursing?",
  "text": "The reason I ask which major is more difficult, is because my family always likes to put whatever I do on a lower pedestal than them. I recently began Nursing school, and both of my brothers have graduated with an electrical engineering degree. My father recently said and I quote \"your work doesn't even come close to what they did in engineering, not even close.\" Here is the situation, my brothers never needed to work towards their education because they just understood the material instantly, meaning they didn't need to study. This ability was great for them, and I am happy they had an easier time in school. However, I don't appreciate when they put down my major constantly. \n\nPersonally, I need to put effort towards every class I take, whether its math or science, because I sometimes don't understand those materials right away. Not only that, but my mother wrote every paper my brothers had assigned since they were in high-school, whereas I have always done my own work to obtain my grades. Is it true what my brothers say that electrical engineers don't write many papers in college? I guess what I'm trying to say, is an electrical engineering degree truly harder than nursing?",
  "author": "Federal_Listen_5299",
  "created": 1632847214,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "heotkei": {
      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heotkei/",
      "text": "I'm gonna say to you what your family *should* be saying to you: I'm sure you will be incredible at whatever you choose to do. Follow your passion and give it your all. What ultimately matters is that you love what you do, not meaningless bragging rights about how \"hard\" your major was. \n\nI am genuinely shocked that your family is essentially mocking your chosen path rather than being your biggest supporters. That sucks...",
      "author": "Apprehensive_Half617",
      "created": 1632892619,
      "upvotes": 1,
      "replies": {}
    },
    "hemz3gn": {
      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hemz3gn/",
      "text": "Funny this post exists, as I’m studying electrical engineering and my girlfriend is studying nursing. We’re both struggling lol. However, I say this time and time again, I feel like personally I’d much rather solve a problem or use a tool to work my way through a problem than memorize information. So far from what it seems, nursing school seems to require FAR more memorization than what I’m doing right now. So I feel like for me personally, nursing school would be way harder. Also, it’s important to mention that my grading scale for many classes are curved to where a 65% is a C, while my girlfriend needs a 78% for a C in most classes. \n\nIt’s silly to compare college majors though, they’re all difficult in their own way\n\nEDIT: I’m sorry about your parents. What they should be doing is commending you for your hard work, and how much you’re giving back. Nurses are vital to the healthcare system, and it would fall apart without them. Bravo to you and any other nurses/nursing students/CNA’s out there!",
      "author": "Deathgripsbadimfunny",
      "created": 1632860316,
      "upvotes": 1,
      "replies": {}
    },
    "hemg3gy": {
      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hemg3gy/",
      "text": "They’re both challenging in their own ways. EE in my experience is way too imaginary which is why I picked MechE. I had a few friends who did nursing and some of those chem and sci classes were gnarly",
      "author": "NinjaLorian",
      "created": 1632852314,
      "upvotes": 4,
      "replies": {}
    },
    "hemblkk": {
      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hemblkk/",
      "text": ">  Not only that, but my mother wrote every paper my brothers had assigned since they were in high-school, whereas I have always done my own work to obtain my grades.\n\nLol, if this is true then your brothers have nothing on you, regardless of whether or not your major is \"easier.\" Take the high road and ignore that noise.",
      "author": "HumanDrinkingTea",
      "created": 1632850448,
      "upvotes": 3,
      "replies": {
        "hembtqk": {
          "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hembtqk/",
          "text": "Oh it's true, and they claim they didn't have any papers to write during college, so that their major was still more difficult than mine.",
          "author": "Federal_Listen_5299",
          "created": 1632850540,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hem9te9": {
      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hem9te9/",
      "text": "Both are very challenging",
      "author": "TragicalKingdom",
      "created": 1632849717,
      "upvotes": 2,
      "replies": {}
    },
    "hem59cu": {
      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hem59cu/",
      "text": "Firstly, I highly doubt your brothers understood the materials in electrical engineering instantly. Generally electrical engineering and any engineering major take tons of work and studying. EE is a Stem degree which are notorious for being the most difficult degrees to get both in terms of complexity and work load. \n\nHOWEVER, and i must insist on this, it is not okay to put anyone down for the major they have chosen. i’m sorry that your in this situation. Just remember no matter the difficulty of the degree, a degree is still a degree. Get a one that allows you to do something that makes you happy, and makes you a living. The difficulty of your degree does not and should not matter.",
      "author": "Fluffy-Mechanic-7052",
      "created": 1632847861,
      "upvotes": 8,
      "replies": {
        "hemu7qi": {
          "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hemu7qi/",
          "text": "I mean STEM majors are easy for gifted students, but sadly most people are normal intelligence at best and not gifted.",
          "author": "malarkeyasian",
          "created": 1632858114,
          "upvotes": 0,
          "replies": {
            "hemz4ms": {
              "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hemz4ms/",
              "text": "Easy? no. Easier yes. No amount of “gifted” will get you through without completing the difficult assignments and studying properly for exams.",
              "author": "Fluffy-Mechanic-7052",
              "created": 1632860330,
              "upvotes": 7,
              "replies": {
                "hennulr": {
                  "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hennulr/",
                  "text": "I mean the issue is that if you're gifted enough the difficult assignments are actually not going to be difficult, just time consuming.",
                  "author": "malarkeyasian",
                  "created": 1632871326,
                  "upvotes": 0,
                  "replies": {
                    "henpuae": {
                      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/henpuae/",
                      "text": "being gifted does not inherently make things “easy”. Engineering and STEM degrees by nature attract people with higher levels of intelligence. This increased level intelligence may help them learn and pick up things quicker but it doesn’t mean it’s easy. All stem degrees are filled with students with remarkable levels of intelligence who still struggle with the material and have to put in the extra effort.\n\nIntelligence or gift on its own means absolutely nothing. What you are willing to do with it is what matters. Abstract and difficult ideas remain difficult regardless of iq. People who have a higher level of intelligence don’t have a magic key that makes learning difficult concepts and getting through difficult materials easy. Easier? yes but not easy. Either way I see from your post and comment history that you seem to have an obsession with iq and intelligence and you’ve already made up your mind. So have a wonderful day and thanks.",
                      "author": "Fluffy-Mechanic-7052",
                      "created": 1632872262,
                      "upvotes": 3,
                      "replies": {
                        "henqqwf": {
                          "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/henqqwf/",
                          "text": "No, I personally think most people are equally smart (which in terms is normal intelligence). You're either below average or above average or normal. In other words, most people in university are (in general) equally smart. \n\nA lot of people think they're above average, but in fact they're only of normal intelligence. Their really isn't much difference in intelligence between most people unless you're gifted or below average. \n\nAlso it seems that you're still underestimating what average people are capable of and assume that you and your classmates are above average in intelligence. Also you seem to have a different definition of what is considered intelligent or gifted. \n\nIt seems like you believe that someone's intelligent all because they can be able to synthesize information and are knowledgeable, even if they struggle with abstract thinking. I'm sure gifted people would not struggle as much, trust me. I know I'm not gifted either, and I'm sure most STEM students are not. You haven't really seen a true gifted person.",
                          "author": "malarkeyasian",
                          "created": 1632872684,
                          "upvotes": 0,
                          "replies": {
                            "hensnw6": {
                              "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/hensnw6/",
                              "text": ">No, I personally think most people are equally smart (which in terms is normal intelligence). You're either below average or above average or normal. In other words, most people in university are (in general) equally smart.\n\nYes, the IQ bell curve supports this. That is kind of the point of an average. (the outliers, both in terms of high IQ and low IQ are few and far between.\n\n>A lot of people think they're above average, but in fact they're only of normal intelligence.\n\nThis really has no bearing on our discussion. What people think or believe their IQ isn't relevant to whether \"gift\" or \"IQ\" makes STEM degrees easy\n\n&#x200B;\n\n>Also it seems that you're still underestimating what average people are capable of and assume that you and your classmates are above average in intelligence. Also you seem to have a different definition of what is considered intelligent or gifted.\n\nYou seem to have shifted the goalposts here. So what you're saying is that it is easy for gifted students to get stem degrees, yet perfectly doable for those of average intelligence? So is their \"gift\" making it easy? or is it easy by default? Forgive me but I do not see how or why this point is even relevant to what we were discussing. Can people of average intelligence finish STEM degrees? Absolutely this is evidenced by the thousands of people of average intelligence who do complete STEM degrees. Basically, you don't need to be special to do stem work. You just have to be willing to put in the hard work to understand complex theoretical concepts. However, you cannot ignore the fact that Engineering, Maths, Physics and Chem programs, have higher average levels of intelligence than the rest of academia, we can chalk it up to having to deal with theoretical and abstract concepts.\n\n>You haven't really seen a true gifted person.\n\nOdd of you to assume such a thing, over the internet, about a person you've never met before.\n\nThe whole premise of our conversation is that even those who are gifted or have higher levels of IQ will still struggle with the abstract concepts in STEM, and it will in no way be easy. It might perhaps be easier for them than it is for those of average intelligence, but not a walk in the park as you make it sound.",
                              "author": "Fluffy-Mechanic-7052",
                              "created": 1632873595,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        },
                        "heohhfp": {
                          "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heohhfp/",
                          "text": "I disagree with this. My brother is great at math (currently getting his PHD) and he put literally no effort into his high school calculus classes that I had to study a lot for in order to get a decent grade. To him, the level of math that I'm doing is easy. It's the same for many other traits. It may be easy for a naturally athletic guy to run a mile in under five minutes. For me, it would be very difficult, and I would probably have to train for a while before I could come close.",
                          "author": "postmaloneismediocre",
                          "created": 1632885414,
                          "upvotes": 0,
                          "replies": {
                            "heohnq5": {
                              "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heohnq5/",
                              "text": "except a stem degree isn’t high school. especially the more advanced classes are no walk in the park.",
                              "author": "Fluffy-Mechanic-7052",
                              "created": 1632885504,
                              "upvotes": 1,
                              "replies": {
                                "heoigvs": {
                                  "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heoigvs/",
                                  "text": "He described the linear algebra class, ODE class, and calculus classes at his college as \"easy\" as well.",
                                  "author": "postmaloneismediocre",
                                  "created": 1632885939,
                                  "upvotes": 0,
                                  "replies": {
                                    "heojll3": {
                                      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heojll3/",
                                      "text": "you’re brother must be one of a kind if he finds analysis easy without having to put in the work.",
                                      "author": "Fluffy-Mechanic-7052",
                                      "created": 1632886549,
                                      "upvotes": 1,
                                      "replies": {
                                        "heokrqu": {
                                          "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heokrqu/",
                                          "text": "No, he didn't find analysis easy. But many people would be straight up incapable of doing analysis (probably myself included, lol). That's kind of missing my point though. He found calculus, linear algebra, and ODEs to be easy classes and didn't study for them but still got As. Someone like myself would have to study a lot to get a grade not even as good. So yeah, for some people relatively difficult math classes can be \"easy.\" Also, why are you downvoting me?",
                                          "author": "postmaloneismediocre",
                                          "created": 1632887197,
                                          "upvotes": 2,
                                          "replies": {
                                            "heol8kn": {
                                              "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heol8kn/",
                                              "text": "Fair enough, if he seems to find those classes easy then more power to him. I still believe that this doesn’t come from him being inherently intelligent but rather a factor of intelligence + strong foundational work somewhere along his development either as a child, or young adult. If for example you dropped a genius into a calculus class without prior mathematical understanding they’d struggle just as hard as anyone. Also i’m not downvoting your comments , i’m rather intrigued by what you have to say.",
                                              "author": "Fluffy-Mechanic-7052",
                                              "created": 1632887456,
                                              "upvotes": 1,
                                              "replies": {
                                                "heom94g": {
                                                  "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heom94g/",
                                                  "text": "You're right, he didn't just understand calculus out of nowhere, he did have to learn it first. But let me put it this way. Everyone (except for mentally disabled people who can't do any math) have a threshold at which math, or hell, any subject, starts getting hard for them, but the subject before that point is easy. \n\nI would consider myself relatively average at math, so I think my experience would be reflective of most. In elementary school, I thought addition subtraction, etc. was pretty easy. In middle school, it got a bit harder with algebra and geometry. In high school, it got to the point that I would consider \"difficult\" : trig and calculus, and I had to study a lot in order to get decent grades. For someone who has a keen gift in a particular subject, that point at which the subject stops being \"easy\" is much later. In high school, I knew people who breezed through calculus, but then in college started having more trouble with differential equations. But there are also very gifted students who I know that did not have trouble with dif EQs, linear algebra, and calculus in college, but then it got hard for them at analysis, geometry, topology, etc. They still had to put in years of work to get to that position, but that doesn't mean those years of work were hard for them. My years of work of understanding addition, subtraction, fractions, etc. were necessary to get to the point of understanding algebra, but I would call those topics easy as well.",
                                                  "author": "postmaloneismediocre",
                                                  "created": 1632888042,
                                                  "upvotes": 2,
                                                  "replies": {
                                                    "heomrqp": {
                                                      "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heomrqp/",
                                                      "text": "So then we can come to an agreement that it may be easy up until a certain threshold, where no matter how gifted you are, you won’t succeed without working?\n\nMy issue would then be, would it be even MORE difficult for the genius once he reaches his threshold, since he has not developed the proper “learning” skills and studying habits throughout his years.",
                                                      "author": "Fluffy-Mechanic-7052",
                                                      "created": 1632888340,
                                                      "upvotes": 1,
                                                      "replies": {
                                                        "heonue4": {
                                                          "link": "/r/college/comments/pxac5v/which_major_is_more_difficult_electrical/heonue4/",
                                                          "text": "I agree on your first point. Unless the task has a binary level of success, for example, running a mile under 5 minutes, it will always get hard for everyone at some point. The best mathematicians in the world had trouble proving Fermat's last theorem, etc.\n\nHowever, I would disagree with you on the last point. I think that applies to people who are more \"decent\" than geniuses, if that makes sense. I think pretty much everyone has heard the following story. Someone who is pretty good at math, let's say, and coasts by with decent grades in mediocre classes in high school. Then college comes and they get wrecked by their first physics or diff EQ class.\n\nHowever, these people probably aren't geniuses, I would say. The people I knew from high school who I could immediately recognize as very gifted found my AP calculus class quite easy. One of the guys I looked up recently though, and he had a very high GPA in computer science, and was a TA for a bunch of different classes, and had taken higher level CS/math classes in algorithms and analysis. Very smart people end up adapting well to more difficult classes, since they already have a massive leg up due to their intelligence. And most very smart people are very curious and want to try hard, it's just that their current classes aren't doing it for them. Like I said, I had been working very hard in high school to do well in my math classes, but I have no doubt I would be blown out of the water in an analysis class by someone who was just naturally great at math.\n\nPlus, a lot of the genius level people find their basic math or whatever classes easy, but then do really hard stuff outside of school. My brother was studying for math competitions and also learning higher level math while taking the \"easy\" calc classes.",
                                                          "author": "postmaloneismediocre",
                                                          "created": 1632888972,
                                                          "upvotes": 1,
                                                          "replies": {}
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  },
  "updated": 1634050688
}