{
  "sid": "qiu24f",
  "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/",
  "title:": "I feel like an utter friendless loser",
  "text": "I go to one of the biggest party schools in the nation and somehow I end up alone crying at my dorm. I texted literally all of my friends multiple times to try and make plans and everything fell through. What do I do? I hate college so much.",
  "author": "Throwaway-helpplspls",
  "created": 1635568608,
  "updated": 1636187226,
  "over_18": false,
  "upvotes": 70,
  "upvote_ratio": 0.96,
  "comments": {
    "hin5xxw": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hin5xxw/",
      "text": "Hey I feel like I’m spamming this on this sub today because this is absolutely 100% normal.  Especially this time of year.  My students at a large commonwealth campus are dealing with it too.  I dealt with it when I was in college at a large state school.  I’m currently a full time employee at the university and an adjunct for first year seminar and my students are discussing this article and watching the attached video this week: [Advice From a Formerly Lonely College Student](https://www.nytimes.com/2018/10/09/well/family/advice-from-a-formerly-lonely-college-student.amp.html) in preparation from a visit from our Counseling and Psychological Services Office next week.  \n\nJust know this isn’t just you, you aren’t alone, and other people are suffering through it right next to you.  You’ll find them and it’ll get better!",
      "author": "punchyouinthewiener",
      "created": 1635602129,
      "upvotes": 23,
      "replies": {}
    },
    "himwg87": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/himwg87/",
      "text": "My son is also. And you know what? He had some friends up\nFriday from home after a 9hr day. He said Saturday and Sunday he's studying and getting his huge essay done. Totally shocked as he was a social butterfly before. He literally decided he's not partying at a party school and focusing on his education and keeping his scholarship. I don't even recognize this kid anymore. Good for him. If you want to make friends, then be a good friend. Join some clubs you have an interest in. Rush fraternities (you don't have to join just go rush and meet people). Plenty of ways. Stop feeling sorry for yourself after today and make an effort to meet people. Go to the gym. Ask for a spot on weights and give a spot. Man so many ways to just meet people. Son met 3 people at McDonald's at 3am and exchanged DM info. People are everywhere. Carry gum and altoids and offer some to people. It works. Now get out there!",
      "author": "jetclimb",
      "created": 1635597069,
      "upvotes": 14,
      "replies": {}
    },
    "hilw6zj": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hilw6zj/",
      "text": "Maybe it’s not the school for you? Your education is for your future success. It is expensive, and there is an actual pandemic. Nothing wrong with not liking school, it might just mean you haven’t found what’s for you. \n\nThese people are not quality friends. These parties are not quality social stimuli, and are more dangerous than ever. \n\nFind groups that match your interests. Go to clubs, join activities. Community service clubs are pretty good places to find a variety of people, who (usually) aren’t giant assholes. Go to the SI sessions for your courses, and meet people in your classes who are putting in extra effort to succeed. Surround yourself with people who would nurture who you are. Not these selfish kids who want to party. \n\nMaybe for tonight, find a really good movie, some fuzzy socks, and snacks? Do something that makes you feel like you’re taking care of yourself, and have a great time hanging out with you. You’re probably great.",
      "author": "Bekah_grace96",
      "created": 1635569707,
      "upvotes": 21,
      "replies": {
        "hilwjqk": {
          "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hilwjqk/",
          "text": "It's just so heartbreaking putting in effort to better myself and make new friends day after and have it fail over and over.",
          "author": "Throwaway-helpplspls",
          "created": 1635569938,
          "upvotes": 2,
          "replies": {
            "hilxfch": {
              "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hilxfch/",
              "text": "It sounds like these people shouldn’t be your friends, and don’t deserve your time. I didn’t make any “real” friends in college until my junior year or so. Now I have only retained 2, and they’re engaged to each other. \n\nYou logically know that bettering yourself is not synonymous with these parties. In reality, these parties are loud, dirty, and usually annoying. I went to one college party and never even considered it again. \n\nAlthough, I had some pretty severe anxiety, and the effort it took to socialize was more than I could handle. \n\nI got a dog, therapy, and spent a year on anxiety medication. I found my passion, and realized that college is for *me.* I was there for an education. Soon into college, I didn’t have much time for socializing, because I had to study. That made my anxiety worse. I changed to a less academically challenging school, moved closer to home, got treatment, my dog, and a whole not more freedom. I realized how much I hated that college town, and the giant campus of such immature people. I had a kitchen, and I could eat real food. I got a job as a care assistant at my pediatric hospital, and that is probably the only reason I got into medical school. \n\nI was so, so much happier outside of that environment. I felt less anxiety and stress when I realized what I wanted in an adult life, and started working towards it. This took *a lot* of therapy. \n\nNow I am definitely my favorite person to hang out with. Being alone is what restores my energy now.",
              "author": "Bekah_grace96",
              "created": 1635570505,
              "upvotes": 7,
              "replies": {
                "him7c76": {
                  "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/him7c76/",
                  "text": "I guess I'm way too desperate for intimacy and friends. I just want to try to party once and see if it's for me.",
                  "author": "Throwaway-helpplspls",
                  "created": 1635577735,
                  "upvotes": 5,
                  "replies": {
                    "him7j9t": {
                      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/him7j9t/",
                      "text": "Yeah man, you do you. I think that’s a reasonable thing to want to try, I’m just trying to say it may not live up to your expectations, and you may find that these people don’t meet your expectations. \n\nIf you want to go to a party, just go to one. You don’t need anyone’s permission, or need those friends to go with you. You may even meet new people there that you really enjoy",
                      "author": "Bekah_grace96",
                      "created": 1635577890,
                      "upvotes": 2,
                      "replies": {
                        "him7v3y": {
                          "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/him7v3y/",
                          "text": "It's kinda hard when u can't get an invite but I get what u mean",
                          "author": "Throwaway-helpplspls",
                          "created": 1635578145,
                          "upvotes": 3,
                          "replies": {
                            "him8cdq": {
                              "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/him8cdq/",
                              "text": "I know at your specific school, many parties are sort of just advertised as an open invitation. When I was in school, it was all on Facebook and through flyers and talking, and then later more on Snapchat and stuff like that. You may be able to just find things like this. I’m sure the pandemic has affected some of the ways people party, especially if and when gatherings are prohibited",
                              "author": "Bekah_grace96",
                              "created": 1635578525,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hiotm2j": {
              "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hiotm2j/",
              "text": "at least you’re making an effort! you should be proud of yourself, i’m sure you’re doing great. sounds cliche but don’t give up, you’ll find your group of friends one day",
              "author": "triforcebae",
              "created": 1635628002,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hinntpw": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hinntpw/",
      "text": "It seems like you have low self-esteem and are hurt by your friends' rejection. \n\nThe truth is people are very sensitive to detecting self-hatred, fear of rejection, and/or desperation in others.  It repells them through an instinct to protect their mental well-being.  Invulnerability mirrors invulnerability. Rejection, hatred, rejection, hatred: it becomes a vicious circle, unless the course is changed. \n\nThe solution is to improve your communication skills, the image you are giving off to the world.  An attractive person is always smiling and talking in a bubbly, light-hearted voice.  Rather than being inauthentic, learning this one skill, an easy-going attitude, will provide space for other people to exist without reservations. \n\nThe development of emotional skills is of course important. If you are open to learning one skill in this area, I suggest seeking out rejection and learning how rejection is good, something that makes you stronger.  As you find meaning and necessity in rejection, you will be more open to situations with potential for rejection, and see that it is bearable.  The confidence will eventually make the chance if rejection less likely, in turn making you less sensitive to rejection. This is a much healthier feedback loop than the one of rejection and hatred.",
      "author": "Sniffalisp",
      "created": 1635610187,
      "upvotes": 3,
      "replies": {
        "hinq07n": {
          "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hinq07n/",
          "text": "I dunno I feel like the problem is my optimism. I was really looking forward to yesterday and I had a lot of things planned but nothing ended up happening. I don't know how to resolve how I always look forward and clear out my schedule for social things only for nothing to happen and be left with an empty feeling.",
          "author": "Throwaway-helpplspls",
          "created": 1635611113,
          "upvotes": 4,
          "replies": {
            "hinr8ei": {
              "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hinr8ei/",
              "text": "It's more the opposite end of the spectrum?  It's more that you have an excessively positive outlook that leads to crushing emptiness when disappointment occurs? \n\n Like the youthful and exuberant naivety of a child whose parents said they could go to the park then change their minds. The parents do not know what evil they commit against such a happy-go-lucky innocence whose only desire is to rejoice with the parents on a sunny day.",
              "author": "Sniffalisp",
              "created": 1635611623,
              "upvotes": 3,
              "replies": {
                "hinrocx": {
                  "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hinrocx/",
                  "text": "I don't know about that if someone has an understandable reason to not hang out or just doesn't want to that's fine. However when literally everyone I know decides that they'd rather not hang out with me and post fun stuff to their stories it's just soul crushing.",
                  "author": "Throwaway-helpplspls",
                  "created": 1635611805,
                  "upvotes": 3,
                  "replies": {
                    "hins6jj": {
                      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hins6jj/",
                      "text": "I see my child metaphor was a little hyperbolic and silly given how soul crushing it is. How do they not want to hang out with you?  What should you do about it?",
                      "author": "Sniffalisp",
                      "created": 1635612015,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hinzrld": {
              "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hinzrld/",
              "text": "Yeah this kind of thing has happened to me a lot too. I just learned not to set my hopes so high and think as if the planned thing isn't going to happen (making alternative plans by myself, etc.). Helps it a little bit.",
              "author": "Clarinetist123",
              "created": 1635615151,
              "upvotes": 3,
              "replies": {}
            }
          }
        }
      }
    },
    "hioeptm": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hioeptm/",
      "text": "The struggles of going to a top party school while being socially deficient....",
      "author": "aanuma",
      "created": 1635621391,
      "upvotes": 3,
      "replies": {}
    },
    "hip8s9q": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hip8s9q/",
      "text": "i go to one of the biggest party schools too and this weekend was a huge rivalry game plus halloween so it’s just especially hard right now. everyone is so happy, having the time of their lives with their best friends making memories and i’m crying alone in my dorm room wishing i could go back home 😪",
      "author": "ricekrispiesandmilk",
      "created": 1635635097,
      "upvotes": 3,
      "replies": {
        "hip920n": {
          "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hip920n/",
          "text": "I hope it gets better. You're probably just a freshman so remember most friendships formed even now are just not really that concrete.",
          "author": "Throwaway-helpplspls",
          "created": 1635635232,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiot2wf": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hiot2wf/",
      "text": "Join clubs",
      "author": "_AnCap_",
      "created": 1635627758,
      "upvotes": 1,
      "replies": {}
    },
    "hip3c57": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hip3c57/",
      "text": "I have this too. I went to a school that none of my friends ended up going to, and I've made new friends, but they will never be as close as the friends that I've grown up with. Just understand that college should be about education and preparing for your future. Real friends will stick with plans and won't bail on you. I promise it will end up ok.",
      "author": "GoodSandpiper96",
      "created": 1635632465,
      "upvotes": 1,
      "replies": {}
    },
    "hiph66v": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hiph66v/",
      "text": "Same bro",
      "author": "LaniakeaSuper",
      "created": 1635639324,
      "upvotes": 1,
      "replies": {}
    },
    "hippscp": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hippscp/",
      "text": "I'm sorry you had a terrible day. I can relate because that's how my evening went too!\nI've found that making yourself less available to others subconsciously makes you more attractive to them. You seem like a person who's okay to prioritize themselves and their alone time or maybe has some other friends and hence are less available or more \"exclusive\". Don't just pretend, though. Go and actually do those things. Spend some time by yourself, especially if you're in a new city or new part of a city. Go for a movie, to a museum, look for free and fun stuff to do online by yourself. And talk to random people - what bothers me most about being alone is not having people to talk to, so it's fun to talk to random people.\nAnd if people are nice enough to invite you somewhere, don't say no. But don't make yourself excessively available to anyone.\nHang in there :)",
      "author": "pretenderhead",
      "created": 1635643620,
      "upvotes": 1,
      "replies": {
        "hiprn8x": {
          "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hiprn8x/",
          "text": "This is really good advice thank you!",
          "author": "Throwaway-helpplspls",
          "created": 1635644560,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hiq0ojw": {
      "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hiq0ojw/",
      "text": "Life is short, before you know it you’ll be over 30 and chasing kids around and won’t even think of this day to day worry about friends. All my friends are parents from my son/daughter sports teams. 1 friend from high school/college and that was nonexistent for years because he didn’t have kids. Life changes, enjoy the moments your in as they pass and never come back.",
      "author": "Truebesobedooo",
      "created": 1635649327,
      "upvotes": 1,
      "replies": {
        "hiqmdzl": {
          "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hiqmdzl/",
          "text": "bruh this is awful advice, dude clearly doesn't like the moment he is",
          "author": "TopOfTheMeta",
          "created": 1635664472,
          "upvotes": 1,
          "replies": {
            "hir93jc": {
              "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hir93jc/",
              "text": "Nah, he/she just hasn’t found the right friends and needs to be okay with him/herself. Play some\nVideo games or sports or VR or join clubs (people similar interest) and so on. Get a part\nTime job and meet some new people. The possibilities are endless but yet so hard for someone so young. People in highschool and college are young and concerned with shit that doesn’t even matter. \n\nInvest in crypto via bloktopia , get addicted to charts and analysis and make some real money. I could go on and on with things to do other than party and worry about what friend wants to hang out. Be the attraction.",
              "author": "Truebesobedooo",
              "created": 1635682911,
              "upvotes": 1,
              "replies": {
                "hj2pdz4": {
                  "link": "/r/college/comments/qiu24f/i_feel_like_an_utter_friendless_loser/hj2pdz4/",
                  "text": "U make it sound so easy lmao",
                  "author": "Throwaway-helpplspls",
                  "created": 1635894028,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    }
  }
}