{
  "sid": "qnoqy8",
  "link": "/r/college/comments/qnoqy8/do_college_students_have_serious_mood_swings_do/",
  "title:": "Do college students have serious mood swings? Do you have any, or know someone with them?",
  "text": "**TLDR:** (read the bottom paragraph)\n\nI've had lots of mood swings this fall, I'm a sophomore in community college taking all online classes. Back in September, I was feeling very lonely, I didn't think I'd want the college experience since I liked being alone back in HS. Last month, I realized that I don't know what I want socially once I would transfer to a 4 year school next year. I think I would like partying and spending lots of time with people, but I realize it's totally possible that I'm just romanticizing the college experience because of my current situation, and might not like those things as much as I think right now.\n\nI was actually in a much better mood last school year, I didn't think at all about the college experience, I just focused on enjoying myself during my free time and doing well in my classes.\n\nLately, I've been falling behind in my classes and have been feeling stressed about my grades, I came to CC hoping to get much better grades than I did in HS, since back then they were all over the place. I had also crammed for a midterm I took this week. It's been making me feel extreme guilty of how I have managed my time. I also dropped a 4 credit math class, bringing me down from 19 credits to 15 (I knew it was a crazy amount, but I didn't think I would be as distracted as I've been this fall so far). \n\nMy sleep schedule has also been very irregular, and I'm highly dependent on sleep meds so I'm sure that's part of it. I feel bad for not starting to look at colleges for transferring yet, and am worried about my grades this semester turning out bad, hurting my chances at reach schools I would apply to. \n\nI would fluctuate between being in a very bad mood, feeling lonely thinking about how I'm at home and online at CC while almost all other schools are fully in person with lots of students having vibrant social lives, partying and living their best lives, and the possibility of not getting into good colleges because my fall grades would turn out bad; to being in a very good mood, confident or hopeful that my hard work will pay off giving me good grades, and not feeling lonely at all, remembering that I lots of ways to enjoy being by myself and that I don't want a social life right now, since I should be busy with school and looking at schools for transferring. A lot of times, my mood would fluctuate like that in a matter of mere minutes.",
  "author": "TheTwelveYearOld",
  "created": 1636158909,
  "updated": 1636655868,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hjiayhf": {
      "link": "/r/college/comments/qnoqy8/do_college_students_have_serious_mood_swings_do/hjiayhf/",
      "text": "Man the partying clubbing shit is honestly overrated.",
      "author": "bigdickro",
      "created": 1636169898,
      "upvotes": 1,
      "replies": {
        "hjinrwb": {
          "link": "/r/college/comments/qnoqy8/do_college_students_have_serious_mood_swings_do/hjinrwb/",
          "text": "As an experienced partier/clubber who is now starting to stay at home and value down time more, I agree 100%",
          "author": "GingaSnaps0_0",
          "created": 1636177637,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}