{
  "sid": "q0wkiw",
  "link": "/r/college/comments/q0wkiw/should_i_transfer/",
  "title:": "Should I transfer?",
  "text": "I am a freshman and go to a college in the Midwest and I absolutely hate it. I wanted to go to this school all throughout high school and was so excited to go. I started early in the summer with about 1000 other freshman and absolutely loved it, but when 40,000 other people showed up I was miserable. I like my major, but because of my university, I have to take super irrelevant classes. A lot of the classes here are “weed out” classes meaning that are intended to fail a certain number of students every semester. There is absolutely no support from the school, they could not care less about their students. I do not like my roommate, the dorms are disgusting (but i have to be grateful that they didn’t stick me in a bunker), my RA is a few months older than me and an absolute nightmare. Everything is so crowded, extreme lack of organization, and everything is such a let down. There are so many people here that it’s hard to get to know anyone because you’ll most likely never see them again. This school is also stereotypically nerdy and so many of the kids lack basic social skills or common sense. The university tries to advertise everything to make it sound so great (events, academics, the school itself) and then when you get there, it sucks. It feels like I was sold a lie as a high school student and now I’m paying for it. It loves to brag about its amazing ranks and how prestigious it is, but in reality it sucks the living souls out of their students for that prestige and is willing to sacrifice at one of us. I am very much wishing I went to a smaller, different school. Not sure if transferring will make my life easier because I think I dislike college life in general.",
  "author": "CategoryOdd9751",
  "created": 1633315044,
  "updated": 1634089611,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hfb165k": {
      "link": "/r/college/comments/q0wkiw/should_i_transfer/hfb165k/",
      "text": "Its your money, transfer",
      "author": "Geek_is_my_chic",
      "created": 1633315219,
      "upvotes": 1,
      "replies": {}
    },
    "hfb33qi": {
      "link": "/r/college/comments/q0wkiw/should_i_transfer/hfb33qi/",
      "text": "Maybe a smaller college would be more your style. \n\nBut look up the courses required for your major at anywhere else you look at. Most majors at most schools do require some general education courses bc they want you to have skills and general knowledge, not only stuff in your major.",
      "author": "AceyAceyAcey",
      "created": 1633316194,
      "upvotes": 1,
      "replies": {}
    },
    "hfcun3x": {
      "link": "/r/college/comments/q0wkiw/should_i_transfer/hfcun3x/",
      "text": "A transfer might help some of the non academic issues, but whatever college you go to, you’re going to spend some time pounding dirt without it feeling important or relevant. It’s just the American university structure.",
      "author": "Casual-Economist",
      "created": 1633359235,
      "upvotes": 1,
      "replies": {}
    }
  }
}