{
  "sid": "dob8tz",
  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/",
  "title:": "Are you suppose to enjoy college?",
  "text": "*Edit - I DID IT. I graduated in 3 years with a BS in CS. I'm glad I stuck with it and having a valuable degree is worth the extra work.\n\nI'm going for computer science and every programming class I can't stand and am terrible at. I find no enjoyment in programming and don't plan on doing it ever again for my career. The only reason I am going for CS is all the other tech or computer related fields are for IT, which screw fixing school projectors for eternity, or engineering. I wouldn't be able to pass the math needed for engineering. Computer Science is so diverse that I can get a job that doesn't require any programming with the degree. But I feel like I am wasting my time on something I will never use again and sorta is the focus of the degree. I much prefer hardware, networking, cyber security, and sys admin work.",
  "author": "GupBuck",
  "created": 1572280263,
  "over_18": false,
  "upvotes": 572,
  "upvote_ratio": 0.98,
  "comments": {
    "f5z9rln": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5z9rln/",
      "text": "[Steve Job's Commencement Address at Stanford University](https://www.youtube.com/watch?v=UF8uR6Z6KLc)\n\nAbsolutely you are supposed to enjoy college. You are supposed to enjoy almost everything that you choose to do in your life. Sure, for every major that you pursue there will undoubtedly be classes that you don't completely enjoy. However, at the absolute bare minimum, you should see that there is some value to the work you're doing in each class. If you find that you hate your classes you should really reconsider what it is you are doing. Your work in college will take up a massive amount of time in your life as it will when you get out of college so if you don't enjoy it then what is the point? Don't settle for anything that makes you unhappy.",
      "author": "Kingslayer1337",
      "created": 1572571012,
      "upvotes": 1,
      "replies": {
        "f5znkks": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5znkks/",
          "text": "I guess it's just easier to suffer a tad for another year and a half for the economic and time burden it saves. I have plenty of free time even with 17 credits right now so I can do what I love outside of the class work",
          "author": null,
          "created": 1572581434,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f5z57j1": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5z57j1/",
      "text": "Thank you all for the great responses. I'm going to against what almost everyone says here and persist with Computer Science. I'm terrible at programming which means I would benefit if I learned more about it and improved. I might not like it but I feel I shouldn't run from something I don't know a lot about.",
      "author": "GupBuck",
      "created": 1572567477,
      "upvotes": 1,
      "replies": {}
    },
    "f5vuo2x": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5vuo2x/",
      "text": "You probably should have been an IT Major instead if your less interested in Programming. But even in IT Fields like Cybersecurity that you mentioned, Programming plays a big part. You have to both understand and make your own scripts in Cybersecurity. If your Terrible at your Programming classes, it’s because you have the wrong attitude and are not attempting to put in the effort to be at least a decent programmer.",
      "author": null,
      "created": 1572500935,
      "upvotes": 1,
      "replies": {}
    },
    "f5qyg3q": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5qyg3q/",
      "text": "I'm only a high school senior, but I learned cybersecurity for three years as an extracurricular. I tried multiple coding classes, nd hated all of them. Networking and cybersecurity fascinates me and I think it's useful knowledge, but for me at the end of the day I'm not a computer science person, it's not how my brain works, I'm a communication/emotion person. \n\nI really think you should switch, I know way too many people who get a STEM degree and end up wishing they pursued something they were more passionate about.\n\n I know if you don't want to do something and hate it, no matter how disciplined you are or how much you lie to yourself, it's going to destroy you.",
      "author": "wwormtown",
      "created": 1572385160,
      "upvotes": 1,
      "replies": {}
    },
    "f5pyj0r": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5pyj0r/",
      "text": "Programming is Badass bro. If you're not up to the insanity it can bring,  fine, leave it alone.",
      "author": "TheBlingKing",
      "created": 1572369889,
      "upvotes": 1,
      "replies": {}
    },
    "f5pthcu": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5pthcu/",
      "text": "Just curious, how did you pass the exam/assignment if u find it hard to understand?",
      "author": "joao789",
      "created": 1572367409,
      "upvotes": 1,
      "replies": {
        "f5q1a0a": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5q1a0a/",
          "text": "It's hard doesn't mean it's impossible. Just takes a lot of time for me",
          "author": null,
          "created": 1572371047,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f5pm41q": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5pm41q/",
      "text": "Why don’t you just be a computer/electrical engineer then?",
      "author": null,
      "created": 1572362638,
      "upvotes": 1,
      "replies": {
        "f5pooyp": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5pooyp/",
          "text": "Wouldn't be able to pass the math and physics classes",
          "author": null,
          "created": 1572364343,
          "upvotes": 1,
          "replies": {
            "f5ppgln": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ppgln/",
              "text": "Well then how are you gonna go into the fields you want? You need basic understanding of at least vector calculus and a lot of E&M principles to do these jobs",
              "author": null,
              "created": 1572364837,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f5pecjm": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5pecjm/",
      "text": "I was in the same boat as you. I hated my coding classes and wanted to switch majors but I had 2 semesters left. Then I started taking other classes in my major. Data security classes, VR, 3D modeling and AI. Try taking classes that dont need coding and if you still dont like them then switch. VR doesnt have much coding and you can get a pretty good job.",
      "author": "PasstheySoysauce",
      "created": 1572357242,
      "upvotes": 1,
      "replies": {
        "f5popqq": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5popqq/",
          "text": "My school offers jack shit in terms of electives",
          "author": null,
          "created": 1572364356,
          "upvotes": 1,
          "replies": {
            "f5pp0ki": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5pp0ki/",
              "text": "See if the school offers classes at other schools. Or maybe try auditing a grad class",
              "author": "PasstheySoysauce",
              "created": 1572364552,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f5p0881": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5p0881/",
      "text": "There is a language barrier here, so what I'm suggesting might not be an existing division in english, but you might want to look into IT Engineering as opposed to Computer Science. I'm doing IT Engineering and we have a bunch of varied subjects. There are many classes that are hardware close (networks and network communication, embedded systems etc.) and many others are about system and program design (a bunch of software development, and programming mostly). There is also some AI and computational theory and a bunch of other things thrown into the mix. Then later on we have to choose a specialization from one of these things.\n\nAnother university in the city has what I'd translate as CS, what they do is almost all theoretic with a **lot** of maths, programming and algorithm and computational theory.",
      "author": "TheKBMV",
      "created": 1572342426,
      "upvotes": 1,
      "replies": {}
    },
    "f5own3h": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5own3h/",
      "text": "You're answering your own question.\n\n>I much prefer hardware, networking, cyber security, and sys admin work.\n\nMaybe if you were doing something you enjoy, you'd enjoy college more.",
      "author": "tastydorito",
      "created": 1572336443,
      "upvotes": 1,
      "replies": {}
    },
    "f5ot8uo": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ot8uo/",
      "text": "You are supposed to enjoy life, but you must find your own way to do so. College is a part of life. You may enjoy it more or less than other parts of your life, but that’s for you to determine.\n\nI have been told to do what you like; not what you love. Anything you do will be work, and you will lose at least some enjoyment from it at some point. If you do what you like, then it will be tolerable enough for you to pursue what you love in your own time.",
      "author": "MetricCascade29",
      "created": 1572330972,
      "upvotes": 1,
      "replies": {}
    },
    "f5osznl": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5osznl/",
      "text": "Not to call a user out but u/shaw201 has the right idea here. I’ve been studying Computer Science and I still fucking love it, post general education nonsense and a community college in the US fucking me over just a little. But, Information Systems with a focus on Security will keep you away from fixing printers - and instead keep you focused on breaking them even more - and get you into some really cool shit (caution, the focus might make you more paranoid though).",
      "author": "GaijinKindred",
      "created": 1572330590,
      "upvotes": 1,
      "replies": {}
    },
    "f5oqcig": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5oqcig/",
      "text": "You’re programming for the wrong reasons.\n\nProgram for fun, not for school. :)",
      "author": "leecharles_",
      "created": 1572326908,
      "upvotes": 1,
      "replies": {}
    },
    "f5onhmv": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5onhmv/",
      "text": "Why not? You’re young, filled with potential, and surrounded by opportunity.",
      "author": null,
      "created": 1572323635,
      "upvotes": 1,
      "replies": {}
    },
    "f5ohd71": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ohd71/",
      "text": "I did information systems and became an aws cloud architect and I love it and find it very fulfilling. Obviously programming skills are required but not to the extent of a true software developer position",
      "author": null,
      "created": 1572318171,
      "upvotes": 1,
      "replies": {}
    },
    "f5ogcsc": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ogcsc/",
      "text": "Just think of the sweet, sweet 180k starting comp",
      "author": "whitelife123",
      "created": 1572317424,
      "upvotes": 1,
      "replies": {}
    },
    "f5ofq5k": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ofq5k/",
      "text": "Senior year, computer information technology major here. My school offers Comp Sci and CIT. Both have the same amount of programming classes required to graduate but CIT is a lot more computer classes while comp sci is bs calculus. I didn't have to take a single calc class. Only linear algebra and fundamentals of math. You should switch while you can. Don't be miserable.",
      "author": "_Jubilating",
      "created": 1572316958,
      "upvotes": 1,
      "replies": {}
    },
    "f5oehte": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5oehte/",
      "text": "I don’t, but that’s because I’m at community college and not university. I wanna compete for collegiate powerlifting and my college doesn’t have that.",
      "author": "BurgerBoi19",
      "created": 1572316082,
      "upvotes": 1,
      "replies": {}
    },
    "f5oeco3": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5oeco3/",
      "text": "It's like beer. First taste is terrible, but then it grows on you.",
      "author": "x3lr4",
      "created": 1572315988,
      "upvotes": 1,
      "replies": {}
    },
    "f5odvfl": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5odvfl/",
      "text": "Just hit junior year, intro level classes were so awful for me, but now that I’m learning theories and applying my intro knowledge into deeper concepts I love it so much. I enjoy the readings and like going to classes. I think college should definitely be enjoyable. College is a choice, spend  your time doing what you love. Otherwise, why bother?",
      "author": "bridget22",
      "created": 1572315685,
      "upvotes": 1,
      "replies": {}
    },
    "f5odtbq": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5odtbq/",
      "text": "Look into Computer Information Systems. I am a CIS major and I love it! This degree (really any information systems degree) prepares you more for a general tech role after graduation because of the heavy business focus instead of pure coding. This degree allows YOU to choose whether you want to focus more on front-end, back-end, middleware, devops, security, networking, databases, business analytics, statistics, or any other sort of project management/business role. It depends completely on your course work and is super fun compared to the intense courses that come from straight computer science.",
      "author": "Lord_Ahrim1536",
      "created": 1572315647,
      "upvotes": 1,
      "replies": {}
    },
    "f5odpi7": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5odpi7/",
      "text": "Finish the CS degree. People (HR) place a higher value on it. \n\nI’m in a similar situation as you. 4th year CS major at a UC, super interested in information security. Currently interning as a infosec analyst at a Fortune 500. Love every day of it. The CS classes, not so much, but they’re tolerable. School doesn’t offer a “cybersec” or “information systems” degree. \n\nBtw, Just because you don’t enjoy something doesn’t invalidate it’s importance/usefulness to you (eating healthy)\n\nAlso, Recommend studying some basic comptia certs on the side (Network/Sec+)",
      "author": "7fruit6",
      "created": 1572315577,
      "upvotes": 1,
      "replies": {}
    },
    "f5ocri0": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ocri0/",
      "text": "I’m in Software Engineering and a senior. Dude if you don’t like it at least a little it’s foolish to get a degree in that. I’d switch to anything else and get the CS as a minor if offered. Not necessarily IT though. Is their a hardware option like computer systems? Also, don’t say you can’t do it. If you want anything bad enough you can. I graduated HS second to last in my class, never made a grade higher than a D in math, and I have a 3.9 in engineering now. Once you’d decide it’s what you want, you can do it.",
      "author": "MaddieBre",
      "created": 1572314984,
      "upvotes": 1,
      "replies": {}
    },
    "f5ocer1": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ocer1/",
      "text": "Some universities actually have a major in cyber security. Maybe look for a college you can transfer to that has that? I go to a fairly small liberal arts college that has a lot of specific majors like biomedical illustration, cyber security, international & global studies/communications, and so much more.",
      "author": "hiroshimasfoot",
      "created": 1572314760,
      "upvotes": 1,
      "replies": {}
    },
    "f5obzcy": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5obzcy/",
      "text": "Go to the carrier center they can help you evaluate if there's another major that might be a better fit for you.",
      "author": "patmorgan235",
      "created": 1572314475,
      "upvotes": 1,
      "replies": {}
    },
    "f5ob83o": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ob83o/",
      "text": "Why don't you switch to IT and pursue cybersecurity? Cybersec is a subfield of IT, and you can go into security analysis which pays well but requires no coding.\n\nI mean there are other careers in IT/CS that don't require coding as well, I just mentioned that one because you said you'd like cybersecurity somewhere on this page.",
      "author": "dobbysreward",
      "created": 1572313984,
      "upvotes": 1,
      "replies": {}
    },
    "f5oahkt": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5oahkt/",
      "text": "I’m in the same exact boat you’re in as well. I’m a 4th year CS major and despite sliding by most of the 3 years with Java and Python. I find myself this year without motivation to go through yet another year of scratching my head trying to figure out the logic behind the complex coding projects. I have no idea what I’m going to do come spring when I graduate, and I’m honestly scared. I’m figuring I’m going to do something with IT dealing with server side/Cisco systems; but I could never do programming for a career.",
      "author": "chris977s",
      "created": 1572313511,
      "upvotes": 1,
      "replies": {}
    },
    "f5o8ro8": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o8ro8/",
      "text": "I hate this shit, it's just never ending stress about the next test.\n\nAt least I'm almost done.",
      "author": null,
      "created": 1572312463,
      "upvotes": 3,
      "replies": {}
    },
    "f5o84rq": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o84rq/",
      "text": "No your not supposed to enjoy college",
      "author": "JazzlikeSpinach3",
      "created": 1572312065,
      "upvotes": 4,
      "replies": {}
    },
    "f5o7wog": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o7wog/",
      "text": "Bro I'll tell you right now as someone with a bit of industry knowledge, employers in IT-related fields don't really care about what degree you have. They care that you have the soft skills that enable you to communicate effectively and the technical skills to do the job efficiently. \n\nHowever, it's not a bad idea by going for a degree in CS, Computer Engineering, or any other IT-related degree. BUT, you must accompany those degrees with certifications and experience (which you can gain from internships). Internships especially!!\n\nIn IT, the degree serves the purpose of showing you are teachable and can commit to something, however without the necessary certifications and/or experience in the field, the degree is practically meaningless. \n\nIf you truly want to get into fields such as cybersecurity, networking, cloud computing, or any other specialization in IT, look for the certs that'll help you get into those fields. I don't mean to come off as a broken record, but certs + experience go a long in the way. Way more than the degree.\n\nBut if you can go for all three at the same time, all the power to you, it's definitely possible. If you need any more info, go into the ITCareers subreddit. There's plenty of professionals in there that will most likely tell you the same and even more!\n\nOne last note: in IT, you are eventually going to have to obtain some knowledge about programming to a solid extent. That's just how fast the field is converging. These days, the field is converging faster than ever into software which revolves around a lot of AUTOMATION (via programming). So we're talking about learning python (one of the hottest programming languages out now) and maybe something else if you ever want an administrator or managerial position (Tier 2 or Tier 3 position). \n\nGood luck!",
      "author": "KonohamaruEighth",
      "created": 1572311921,
      "upvotes": 2,
      "replies": {}
    },
    "f5o7wml": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o7wml/",
      "text": "Some people enjoy nothing, some people enjoy everything.  \n\n\n\\>The only reason I am going for CS is all the other tech or computer related fields are for IT  \n\n\nThis is not correct.  Most computer engineers have either an EE or a CE degree.  CS is rather rare in my 30 year experience.",
      "author": "OVSQ",
      "created": 1572311920,
      "upvotes": 2,
      "replies": {}
    },
    "f5o7cja": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o7cja/",
      "text": "Yes",
      "author": "OkayTalk",
      "created": 1572311578,
      "upvotes": 1,
      "replies": {}
    },
    "f5o6rdn": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o6rdn/",
      "text": "Would you please do something?\nThere's a book from Victor Frankl named \"Man's search for meaning\".\nAs a university student, I found myself delightful not knowing what I want, what should I do, and how I'm ducking everything up.\nGiven up life and looking for help, I found this book, eagerly finished it in 8 hours which fully changed my life.\nRight now I'm forcing one of my friends to read it, calling him every night, checking which page he is. Right now he has read 1/3 of it.\nPlease read it, It has a very important thing everyone should know.",
      "author": "hummingbird1346",
      "created": 1572311214,
      "upvotes": 2,
      "replies": {}
    },
    "f5o5zof": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o5zof/",
      "text": "You can always switch majors. I switched from nursing into teaching higher ed, I am SUPER happy now and look forward to going to class everyday.",
      "author": "Mainemountains",
      "created": 1572310742,
      "upvotes": 4,
      "replies": {
        "f5o9927": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o9927/",
          "text": "Thanks for the comment. Sounds great",
          "author": null,
          "created": 1572312760,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f5o54oc": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o54oc/",
      "text": "Hey! I'm an information systems major right now and it might be a better fit for you! It also has a lot of practical skills regarding business that can be easily transferable if you end up not enjoying it. One thing you can do is talk to your advisor about what can transfer over depending on what classes you're taking. If your graduation date is going to be affected by you switching majors, your advisor might be able to apply credits from CS to your IS degree. Hope this helps!",
      "author": "ekoehler00",
      "created": 1572310212,
      "upvotes": 2,
      "replies": {
        "f5o914o": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o914o/",
          "text": "I have a year buffer right now so I think graduation date is nothing to worry about",
          "author": null,
          "created": 1572312624,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "f5o2wba": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o2wba/",
      "text": "No you’re not supposed to enjoy it. The only thing you’re supposed to do is learn.",
      "author": "likemikelikemike",
      "created": 1572308840,
      "upvotes": -1,
      "replies": {}
    },
    "f5o24eq": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o24eq/",
      "text": "Different people get different things out of college. Some are here to grind for four years and get the degree that will make them the most money, and some people are here to party for 4+ years and maybe get a degree if they're lucky. Most are somewhere in between. So you just have to decide whether you're willing to live with the classes required to get the degree you want, or if you're willing to get a different degree (which might or might not actually hurt your job prospects) to make life more fun right now",
      "author": "SkiMonkey98",
      "created": 1572308342,
      "upvotes": 1,
      "replies": {}
    },
    "f5o0l02": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0l02/",
      "text": "The thing that I have seen makes people employable after graduation is actual work experience. Your major is going to make it hard to get involved in clubs and activities so try to find something that interests you and do it well. Find a major you love and form relationships with teachers. Look for internship opportunities in that field. Network. Make friends. Get a job and build a resume. If you do these things you will be employable after graduation regardless of major. You might not make a ton or get your dream job right away but you will have opportunities.",
      "author": "VROF",
      "created": 1572307382,
      "upvotes": 2,
      "replies": {
        "f5o1k4i": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o1k4i/",
          "text": "I don't want to sound like an asshole but my resume is pretty good for someone my age. I have a wide variety of jobs ranging from IT support technician for 1.5 years to an engineering sys admin, all the way to freelance software engineer for industrial control systems, and mixed in freelance video/photographer with being certified in AdobeCC, Microsoft suite, and other popular applications used in industry. I have seen just how important work experience is as my sister is a electrical engineer and her resume is really lacking as she has no work experience in anything related to her field so finding a job has been tough.",
          "author": null,
          "created": 1572307992,
          "upvotes": 1,
          "replies": {
            "f5o5nu3": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o5nu3/",
              "text": "That stuff is probably more important than a major you hate. Sounds like you know what to do so go get an education you enjoy.",
              "author": "VROF",
              "created": 1572310536,
              "upvotes": 1,
              "replies": {
                "f5o987z": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o987z/",
                  "text": "I know but convincing my parents has become pretty nasty. I just talked to my mom and she personally insulted me with something about a previous girlfriend. Thanks mom I needed a kick to the teeth right now",
                  "author": null,
                  "created": 1572312745,
                  "upvotes": 1,
                  "replies": {
                    "f5za1x6": {
                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5za1x6/",
                      "text": ">parents\n\nYou are an adult. Your parents cannot control what major you pursue or what classes you take.",
                      "author": "Kingslayer1337",
                      "created": 1572571233,
                      "upvotes": 1,
                      "replies": {
                        "f5znhci": {
                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5znhci/",
                          "text": "Tell them that lol",
                          "author": null,
                          "created": 1572581361,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "f5o0jqt": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0jqt/",
      "text": "At my college, you can separately major in IT. My friend is terrible at math and he switched from comp sci to IT for that reason.",
      "author": "TrippyGirl420",
      "created": 1572307360,
      "upvotes": 1,
      "replies": {
        "f5o1lto": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o1lto/",
          "text": "Interesting. My school has IS, MIS, and I'm not sure if they have CIS",
          "author": null,
          "created": 1572308022,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f5o0d0z": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0d0z/",
      "text": "You should be enjoying your major, but the rest of the experience is going to be a grind.",
      "author": "Velvet_Daze",
      "created": 1572307246,
      "upvotes": 1,
      "replies": {}
    },
    "f5nzpnb": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nzpnb/",
      "text": " I choose cis over cs for the very reason of a less heavy computer and math load and more into business which is good for future management positions",
      "author": "Shadow3647",
      "created": 1572306839,
      "upvotes": 1,
      "replies": {}
    },
    "f5nxjkc": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nxjkc/",
      "text": "Nah bro I fucking hate college. I even transferred and realized it’s not the college, it’s just college lmao",
      "author": null,
      "created": 1572305451,
      "upvotes": 11,
      "replies": {}
    },
    "f5nn511": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nn511/",
      "text": "I don’t know what university you’re going to but most computer science majors will have to do Calc I, Calc II, Diff. Eqs, and Linear Algebra at the very least... So if you’re not interested in math or programming theory you should probably switch over to a CIS program or a software engineering degree if you’re not completely sure yet.",
      "author": null,
      "created": 1572302055,
      "upvotes": 8,
      "replies": {
        "f5nvavh": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nvavh/",
          "text": "I've already taken all the required math and just have statistics left for winterium. Math is not my favorite and I struggle sometimes but it's nothing like programming for me. For a recent assignment it took most students an hour or less to do but it took me over 7 hours. Every time in lab I'm always the last person to finish or not finish at all. It's not lack of material knowledge either as I understand what's happening it's just logically converting that to syntax that works.",
          "author": null,
          "created": 1572304592,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "f5n9vds": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5n9vds/",
      "text": "I was the same way... I hated programming and wanted to be a sysadmin.\n\nExcept there is no future in working helpdesk for the rest of your life.  If you want to advance, you need to know programming.  Devops?  That means doing operations (sysadmin) work from a developer's point-of-view... which means automating tasks with scripts.\n\nCybersecurity?  Better brush up on your assembly programming.",
      "author": "wolf2600",
      "created": 1572298052,
      "upvotes": 2,
      "replies": {}
    },
    "f5n6q9k": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5n6q9k/",
      "text": "I thought entering college I would be a mechanical engineer, but I soon found I hated a lot of the courses I was doing. It took a while before I found the field for me, but years 8 years later I’m finally finishing my bachelors degree in forestry. My advice is do what interests you!",
      "author": "escami23",
      "created": 1572297236,
      "upvotes": 5,
      "replies": {
        "f5nuvmr": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nuvmr/",
          "text": "Damn that sounds like a lot of grueling decisions",
          "author": null,
          "created": 1572304393,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "f5mvogq": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5mvogq/",
      "text": "If you're not studying what you enjoy, you will be miserable. Take it from someone who fucked up their first few years and ruined their changes of transferring from the liberal arts college to the school of biology like I had wanted  because of bad grades",
      "author": "Slanglie",
      "created": 1572294170,
      "upvotes": 25,
      "replies": {}
    },
    "f5moz63": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5moz63/",
      "text": "It sounds to me like you should be in a Cybersecurity major instead. Idk about your college but I know my college has that as an option",
      "author": "CirKill",
      "created": 1572292199,
      "upvotes": 13,
      "replies": {
        "f5nh43n": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nh43n/",
          "text": "Doesn't offer it here and I would like that a lot",
          "author": null,
          "created": 1572300146,
          "upvotes": 3,
          "replies": {
            "f5nki6c": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nki6c/",
              "text": "Maybe consider transferring?",
              "author": "CirKill",
              "created": 1572301156,
              "upvotes": 5,
              "replies": {
                "f5nusb6": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nusb6/",
                  "text": "I have and my school is sorta shit so some credits will probably not transfer and I don't really have the funds to go to someplace out of state",
                  "author": null,
                  "created": 1572304350,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "f5ocoue": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ocoue/",
              "text": "Learning coding in a cs degree can help a fair bit in cyber security. You might be able to find more joy from your cs classes if you were able to take the concepts and then apply it to side projects in cyber security that you enjoy. You can probably find more ways to concentrate your current degree on the stuff you like as well. Especially when you get more flexibility with your electives you can really focus down on what best supports your goals. So don't completely throw away the option of sticking to your cs degree now if you are able to shift it into something you find enjoyable,\n\nI would consider talking to your professors as well because they will probably have some of the best advice for you to what your best options are to pursue your passions. Best of luck!",
              "author": "SkrtSkrts",
              "created": 1572314935,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f5m98to": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5m98to/",
      "text": "Of course you hate it. You don't like the field. Dude you are going to have difficult classes in every major but you are gonna hate CS which is heavy heavy programming. Also IT isn't what you think it is. There are so many IT jobs a lot of IT guys at school didn't get a degree. From what it sounds like you want to go into IT because a lot of what you said is IT.",
      "author": "cheesynachoman",
      "created": 1572287746,
      "upvotes": 195,
      "replies": {
        "f5ngrm1": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ngrm1/",
          "text": "But am I limiting myself if I go into IT? I currently have 3 semesters left for CS. This is my second year in college but I am going to graduate early. I was just reviewing the upcoming CS core classes and the only ones am looking forward to are networking and any electives I choose",
          "author": null,
          "created": 1572300015,
          "upvotes": 29,
          "replies": {
            "f5nhpbj": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nhpbj/",
              "text": "Then I recommend changing because you just seem to hate it. You're going to hate any job at some point but do something with your life that will make you somewhat happy. In my personal opinion you will have a better life with a career you enjoy a little more. It's a tough decision I agree. Talking to advisors and councilors might help as well. This is just my two cents.",
              "author": "cheesynachoman",
              "created": 1572300267,
              "upvotes": 43,
              "replies": {
                "f5nu5vh": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nu5vh/",
                  "text": "Here's the thing. I've already worked in IT for around 1 and a half years and last summer was an intern engineering system administrator at HPE and loved it. I'm continuing the internship this summer again and if I don't get fired they will offer me a job when I graduate. It's exactly what I enjoy. Almost all hardware and networking with a tad bit of programming, but that's mostly scripting, with some cyber security mixed in, and it's all in Linux. Everything I have done for jobs on my resume I have learned outside of school. That's why I feel like something doesn't align quite right",
                  "author": null,
                  "created": 1572304219,
                  "upvotes": 8,
                  "replies": {
                    "f5nwb8q": {
                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nwb8q/",
                      "text": "Does your IT program require CS classes? I know some programs do and if so maybe you can transfer into that and still have all the coding experience. Ask your employer and professors first. I just hate to see you continue a major your dislike and are struggling with. You have to find something you somewhat enjoy.",
                      "author": "cheesynachoman",
                      "created": 1572304927,
                      "upvotes": 8,
                      "replies": {
                        "f5nxnpl": {
                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nxnpl/",
                          "text": "Yes the core classes for IT would almost all be satisfied as the CS core is higher up. I would be able to graduate a semester earlier than I am right now",
                          "author": null,
                          "created": 1572305523,
                          "upvotes": 6,
                          "replies": {
                            "f5nxudv": {
                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nxudv/",
                              "text": "Assuming you employer is satisfied by that and you are too sounds like a win win.",
                              "author": "cheesynachoman",
                              "created": 1572305641,
                              "upvotes": 8,
                              "replies": {
                                "f5o00mp": {
                                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o00mp/",
                                  "text": "Yeah I'll talk to them. But how could you phrase it without making it sound like a turn off and them looking elsewhere? I guess they have already made a 2 year investment in me and like me too",
                                  "author": null,
                                  "created": 1572307031,
                                  "upvotes": 2,
                                  "replies": {
                                    "f5o2k32": {
                                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o2k32/",
                                      "text": "Say you're thinking of switching majors to IT because it aligns better with your interests, and ask if they'd be okay with that. If not, you can reevaluate and decide whether or not it's worth sticking with the CS major for them",
                                      "author": "SkiMonkey98",
                                      "created": 1572308620,
                                      "upvotes": 5,
                                      "replies": {
                                        "f5o32s7": {
                                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o32s7/",
                                          "text": "Does asking the question worry them at all? Because now they probably won't feel as sure. If they end up not wanting to hire me because I swapped majors I did get a lot of valuable work experience from a massive company so I guess that helps",
                                          "author": null,
                                          "created": 1572308955,
                                          "upvotes": 2,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "f5nl2ks": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nl2ks/",
              "text": "You’re limiting yourself if you stay in CS because it clearly doesn’t make you happy.",
              "author": null,
              "created": 1572301390,
              "upvotes": 12,
              "replies": {
                "f5nu7af": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nu7af/",
                  "text": "My parents are really pushing me to stay in CS though",
                  "author": null,
                  "created": 1572304233,
                  "upvotes": 3,
                  "replies": {
                    "f5nw7nw": {
                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nw7nw/",
                      "text": "why post this thread if you’re going to disregard the advice every person in it is giving to you?",
                      "author": "cop08807",
                      "created": 1572304872,
                      "upvotes": 21,
                      "replies": {
                        "f5nxic1": {
                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nxic1/",
                          "text": "I'm not disregarding it. I'm just saying the counter example to their statement. Trust me I am taking in everything everyone says. I just state the opposition to what they say to see what their response is to the scenario to see how it aligns with mine and others. I'm just considering and weighing everything. What he said is very cut and dry and is easier said then done. That's why I wanted to elaborate on it",
                          "author": null,
                          "created": 1572305429,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "f5o70vl": {
                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o70vl/",
                      "text": "You can have a conversation with them if you really want to switch. Otherwise, a CS degree or just a bachelor’s degree in general opens up enough doors that the one extra year is still worth it by this point",
                      "author": null,
                      "created": 1572311376,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f5onp0g": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5onp0g/",
              "text": "You're going to fucking hate them. That I promise you",
              "author": "psilvs",
              "created": 1572323851,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f5m72qr": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5m72qr/",
      "text": "Parts of it are enjoyable.  It's certainly more fun once you're through the prereqs and into the meat of whatever you're studying, and the social aspects are fun if you're that kind of person.  My advice is don't look at college solely as a place and time to study and prepare for your career.  Attend performances, go to art exhibitions, join clubs and orgs, go to parties, meet interesting people and learn from them.  Grind through the boring stuff and get into the real study of your subject.  You might consider asking an advisor or a professor if there's a program that engages more with what you actually want to do.  They'll probably try their best to help you, and they likely have a lot of experience in their fields, so their help comes from a place of knowledge.",
      "author": "ApocSurvivor713",
      "created": 1572287211,
      "upvotes": 34,
      "replies": {
        "f5nh09r": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nh09r/",
          "text": "Yeah definitely. I met with the head of the CS department and they are so short on professors any electives are chosen for you at this point.",
          "author": null,
          "created": 1572300110,
          "upvotes": 6,
          "replies": {}
        }
      }
    },
    "f5lw6ty": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5lw6ty/",
      "text": "Why don’t you look into Information Systems as a degree",
      "author": "shaw201",
      "created": 1572284016,
      "upvotes": 346,
      "replies": {
        "f5nghg1": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nghg1/",
          "text": "I guess mainly I was following what people told me to do and you make more with a computer science degree.",
          "author": null,
          "created": 1572299898,
          "upvotes": 102,
          "replies": {
            "f5npuap": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5npuap/",
              "text": "If you only have 3 semesters left its a bit late to switch, but cs is a lot of programming so try to enjoy it",
              "author": "shaw201",
              "created": 1572302843,
              "upvotes": 63,
              "replies": {
                "f5nszr8": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nszr8/",
                  "text": "Only my second year though",
                  "author": null,
                  "created": 1572303855,
                  "upvotes": 29,
                  "replies": {
                    "f5nyjf5": {
                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nyjf5/",
                      "text": "Switch man",
                      "author": null,
                      "created": 1572306092,
                      "upvotes": 84,
                      "replies": {
                        "f5nznyo": {
                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nznyo/",
                          "text": "Is that accepting failure though? Like part of me says I am doing this because it's \"too hard\". But then also when I go home I spend all my free time learning about things related to other fields",
                          "author": null,
                          "created": 1572306810,
                          "upvotes": 22,
                          "replies": {
                            "f5o0afv": {
                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0afv/",
                              "text": "No man. it's about you. If you're not enjoying yourself do something that you enjoy. you'll find more success when you're passionate about something vs. something you hate.",
                              "author": "TheFallingArc",
                              "created": 1572307203,
                              "upvotes": 102,
                              "replies": {
                                "f5o0m02": {
                                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0m02/",
                                  "text": "If that's the case I should swap to film school",
                                  "author": null,
                                  "created": 1572307399,
                                  "upvotes": 20,
                                  "replies": {
                                    "f5o117s": {
                                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o117s/",
                                      "text": "I understand why you say this. For me, I could go into something I love but I know doing it for 40 hours a week would make it a chore for me. It would start becoming annoying and I would no longer like it. Honestly, pick something that will burn you out slowly. I see that you absolutely hate programming but you’re going to be doing even more programming your next two years.",
                                      "author": null,
                                      "created": 1572307662,
                                      "upvotes": 21,
                                      "replies": {}
                                    },
                                    "f5ocmez": {
                                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ocmez/",
                                      "text": "No dear god do not go to fucking film school. Major in something you can tolerate to do more than other things. Simple fact is that work is work and you’re not going to ENJOY whatever job you have. But you can sure tolerate some jobs way more than others! But yeah fuck Computer Science lol, I switched to Information Systems. I can’t handle the math",
                                      "author": "bcwills",
                                      "created": 1572314892,
                                      "upvotes": 18,
                                      "replies": {
                                        "f5oemty": {
                                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5oemty/",
                                          "text": "I couldn't handle the math either.   I'm doing Technology Management and they have an accounting class that has me stuck.   Maybe I need to do what you're doing.",
                                          "author": "chris72234",
                                          "created": 1572316175,
                                          "upvotes": 3,
                                          "replies": {
                                            "f5ohh2m": {
                                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ohh2m/",
                                              "text": "Accounting 1 & 2 is required for this major lol. It’s alright I’m worried too. I’m literally going to go ask a CPA firm for help at some point though I’m sure.",
                                              "author": "bcwills",
                                              "created": 1572318252,
                                              "upvotes": 2,
                                              "replies": {}
                                            },
                                            "f5ovmly": {
                                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ovmly/",
                                              "text": "[deleted]",
                                              "author": null,
                                              "created": 1572334774,
                                              "upvotes": 1,
                                              "replies": {
                                                "f5oxa3f": {
                                                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5oxa3f/",
                                                  "text": "That's what I thought but then I got the textbook and there's 1500 pages to it.  The 1+1=2 part is easy.  It's the other stuff I'm struggling with.",
                                                  "author": "chris72234",
                                                  "created": 1572337513,
                                                  "upvotes": 2,
                                                  "replies": {}
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "f5o0dta": {
                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0dta/",
                              "text": "I'm a senior this year, last semester I changed majors from one field to a kinda similar field because I couldnt handle being the major I was before any longer\n\nBest decision I've made in a long time. I dont regret it one bit and I'm much happier now",
                              "author": "tman97m",
                              "created": 1572307259,
                              "upvotes": 17,
                              "replies": {
                                "f5o0l06": {
                                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0l06/",
                                  "text": "Alright thanks for the info",
                                  "author": null,
                                  "created": 1572307382,
                                  "upvotes": 5,
                                  "replies": {}
                                }
                              }
                            },
                            "f5o2ibb": {
                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o2ibb/",
                              "text": "IS has a lot of practical skills that will help as well, and you can keep CS as a minor.\n\nI was double majoring them until I hit Calculus 2 and realized it just wasn't worth it, so I dropped CS to a minor. No regrets.",
                              "author": "KnowledgeableNip",
                              "created": 1572308588,
                              "upvotes": 5,
                              "replies": {
                                "f5o35ya": {
                                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o35ya/",
                                  "text": "Alright what year are you now?",
                                  "author": null,
                                  "created": 1572309008,
                                  "upvotes": 2,
                                  "replies": {
                                    "f5o6dfj": {
                                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o6dfj/",
                                      "text": "I'm currently getting my Master's degree in MIS and I work full time in financial reporting.\n\nAdding:\nObviously talk to an advisor and think it through before you make a change though.",
                                      "author": "KnowledgeableNip",
                                      "created": 1572310974,
                                      "upvotes": 3,
                                      "replies": {
                                        "f5ocwgf": {
                                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ocwgf/",
                                          "text": "I’m an information systems major too. What made you choose this major? I knew that I didn’t want to be a programmer or software developer so I didn’t go with CompSci. I like I.T. and that kind of stuff, and I want to own my own business some day. Apparently this is a good major for me. We shall see. I’m only in my 2nd year of school and still doing general education. I am taking a micro economics class right now though and it’s been pretty tough for me but I do feel good when I grasp it.",
                                          "author": "bcwills",
                                          "created": 1572315071,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                },
                                "f5o51fu": {
                                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o51fu/",
                                  "text": "Just curious, what about Calculus 2 was the tipping point? How did you do in Calculus 1? Do you enjoy math in general (or before Calc 2)?\n\nTaking Calc 2 next term and Calc 3 in spring term, then Linear Algebra and Diffential Equations next year. I'm excited, as I love math and I'm doing well in Calculus 1. But your perspective scares me a bit. Figure if I could maybe see what brought you to drop Calc 2 and/or your background and academic interests I can gauge how rough it'll be for me.",
                                  "author": "AyyItsNicMag",
                                  "created": 1572310159,
                                  "upvotes": 1,
                                  "replies": {
                                    "f5o6j4a": {
                                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o6j4a/",
                                      "text": "I'm not a math person and I took it too far apart from Calc 1. Calc 2 wasn't the root cause. Discreet mathematics wasn't great and Calc 1 was pretty terrible.",
                                      "author": "KnowledgeableNip",
                                      "created": 1572311070,
                                      "upvotes": 2,
                                      "replies": {
                                        "f5o8h5b": {
                                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o8h5b/",
                                          "text": "Ah, I see. I appreciate the reply! I can't remember if you said one way or the other, but I hope your new path is treating you well :) it seems math is a barrier for most people, and understandably so. I know many people who want so badly to enjoy math and do well in it, but missing or forgetting concepts in previous classes snowballs very quickly into pain and suffering in subsequent classes. \n\nI feel for you, I really do. My theory is that all it takes is one bad math teacher in middle or high school, or one class where you didn't try as hard (totally understandable, since before calc 1 it's really, really hard to see any applications of what you're learning in math) to really get screwed over in the future. At that point, you either revisit everything you've done from algebra 1 through  precalculus, and geometry and trig and identify anything you're not confident with anymore, or you struggle and/or have to switch majors. Math is incredible and beautiful, but it's so common to appear the complete opposite of beautiful.\n\n\nGood luck with your future endeavors! I may not know you, but I'll be rooting for you!",
                                          "author": "AyyItsNicMag",
                                          "created": 1572312277,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    },
                                    "f5o94cz": {
                                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o94cz/",
                                      "text": "I'm a MechE who hates math and made it through calc 1 and 2 (calc 3 is just calc 2 but with nested integrals i.e integrals within integrals and some other 3D versions of calc 2 stuff), DiffEQ and linear algebra (not the engineering versions).  I wouldn't worry too much about it if you enjoy the subject it will be a lot easier for you.",
                                      "author": "jackfrost2013",
                                      "created": 1572312677,
                                      "upvotes": 1,
                                      "replies": {
                                        "f5on9qz": {
                                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5on9qz/",
                                          "text": "Thank you for this!!! That gives me more confidence. In my head I know I can do it, I just think I'll always be anxious about it until I'm actually through it. Not sure if that makes any sense. But this helps!",
                                          "author": "AyyItsNicMag",
                                          "created": 1572323411,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            },
                            "f5oa5nb": {
                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5oa5nb/",
                              "text": "Accepting failure? Don't equate You not liking something  to a failure. You tried it and found out it wasn't for you. So switch. If it takes you an extra semester or year, it will be worth it. You don't have to love what your doing in college but you have to be able to do it later in your career. \n\nI don't exactly have a computer science degree but my major includes coding, and most of the jobs I've applied to so far which aren't computer science related, they have asked if I know how to code. If you stick with CS expect people to ask you if you know how to code when they see your degree, and employers are not going to want to hear, \"I do, but I don't like it.\"",
                              "author": "ayojamface",
                              "created": 1572313312,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "f5o2x5n": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o2x5n/",
                  "text": "Get out then. Lots of people change majors.",
                  "author": "ikilledtupac",
                  "created": 1572308855,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            },
            "f5nz2fx": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nz2fx/",
              "text": "Here’s the thing with that. If you don’t like the job you’re never going to be particularly good at it and you might not make more money at all. You’ll be competing against people that actually like it (some even passionately love it), who don’t mind staying a little late to get that last bit of code right. \n\nTry to find something that is a balance between well-paid and passion and you’ll likely be so much more successful.",
              "author": null,
              "created": 1572306427,
              "upvotes": 6,
              "replies": {
                "f5nzthl": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nzthl/",
                  "text": "That's very true. I honestly don't care if I make $50,000 or $120,000. I can make both work and material goods don't give me joys. While buying things is nice I'm fine without buying a new Tesla every 2 years",
                  "author": null,
                  "created": 1572306906,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            },
            "f5o06u1": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o06u1/",
              "text": "Programming in Information Science and Technology approaches the craft in a non-mathematical light. IST majors who become programmers can make just as much money as CS majors. The difference is the majority of IST majors choose the IT or librarian path. Therefore, there is a misconception on salary outcomes. IS is a more well-rounded option. I know plenty of individuals who have gotten an IST degree and received programming jobs with an excellent salary. It comes down to your skill level. Why would you continue in CS if your dragging your feet to get through it?",
              "author": "ClovertheRover",
              "created": 1572307143,
              "upvotes": 3,
              "replies": {
                "f5o0ouc": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0ouc/",
                  "text": "Parents, current internship, and future job opportunities",
                  "author": null,
                  "created": 1572307449,
                  "upvotes": 2,
                  "replies": {
                    "f5o656t": {
                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o656t/",
                      "text": "I got a Business degree back in 2012 because it was an obligation to my parents. I’m now 28 and back in school for a degree that actually interests me. Don’t just do something because your pressured. Career outcomes of CS and IST majors can cross paths. Job opportunities shouldn’t even be a concern unless you plan to build spaceships. You have to prove that you have the skills for most programming jobs anyway... they won’t just hire you if you have a degree.",
                      "author": "ClovertheRover",
                      "created": 1572310834,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "f5orweo": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5orweo/",
              "text": "Don’t do what pays more, do what you enjoy. You’ll be doing it for the rest of your life and will be miserable. I did CS for a couple semesters and DESPISED it, so i finally said fuck it and switched to IT/Security and I actually have fun in my classes now. My only regret is not switching earlier. I know a lot of people who HATE work because they went for what pays the most. They might be bringing in 120k, but they’re miserable 40 hours a week of their life where I have other friends who are making 60-70K, but enjoy the hell out of life and are love going to work and are extremely passionate about it.",
              "author": "ThousandFootOcarina",
              "created": 1572328996,
              "upvotes": 1,
              "replies": {}
            },
            "f5osmrh": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5osmrh/",
              "text": "It is true that you might make in CS compared to other majors. But, you will also have to bear the pressure. The money comes with some cost. The cost you pay is your dedication, concentration and hardwork. Not all students are great in programming, but all of them can become great if they practice and practice.",
              "author": "nonewuser2019",
              "created": 1572330062,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "f5lrwak": {
      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5lrwak/",
      "text": "The first  couple years of college are not really that fun or interesting. You have to get through the boring prereqs to get to the fun stuff.\n\nAnd it never really gets THAT fun. It's always work, and a shitload of it at that.",
      "author": "cakeknife3",
      "created": 1572282533,
      "upvotes": 41,
      "replies": {
        "f5npkiw": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5npkiw/",
          "text": "Says you. I enjoyed all of my intro classes and electives and they helped me find a major I now enjoy taking classes for. I enjoy the hell out of college.",
          "author": "CosmicMetamorphisis",
          "created": 1572302730,
          "upvotes": 16,
          "replies": {
            "f5nufxk": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nufxk/",
              "text": "I feel I would too if I was taking classes I wanted. I would much rather take network security than advanced data structures in java",
              "author": null,
              "created": 1572304300,
              "upvotes": 8,
              "replies": {
                "f5nvkmp": {
                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nvkmp/",
                  "text": "What's stopping you, exactly?",
                  "author": "CosmicMetamorphisis",
                  "created": 1572304717,
                  "upvotes": 4,
                  "replies": {
                    "f5nxqrf": {
                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nxqrf/",
                      "text": "The chance of regret later in life. My parents. The sense I failed.",
                      "author": null,
                      "created": 1572305576,
                      "upvotes": 3,
                      "replies": {
                        "f5nxyag": {
                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nxyag/",
                          "text": "Do what you want!! YOLO!",
                          "author": "CosmicMetamorphisis",
                          "created": 1572305711,
                          "upvotes": 6,
                          "replies": {
                            "f5o02oh": {
                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o02oh/",
                              "text": "If that's the case I'm going to be a cinematographer or industrial package designer",
                              "author": null,
                              "created": 1572307069,
                              "upvotes": 2,
                              "replies": {
                                "f5o0a57": {
                                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0a57/",
                                  "text": "Sounds better than moping around Reddit asking people to separate you from your internal conflicts ;)",
                                  "author": "CosmicMetamorphisis",
                                  "created": 1572307198,
                                  "upvotes": 13,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "f5o0b9v": {
                          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0b9v/",
                          "text": "The sense of regret later in life? What are you going to do if you make it through graduation and start working and realize “hey wow, I still hate this”? Do you not think you’ll regret having forced yourself into a career field you don’t enjoy and wasting years of what many consider to be the best time of your life? If your parents’ love begins and ends with you being a CS major, your relationship probably isn’t healthy enough for you to be basing the rest of your life on their opinions. If it doesn’t, they probably aren’t going to disown you for switching majors.",
                          "author": "Queen-of-Leon",
                          "created": 1572307216,
                          "upvotes": 3,
                          "replies": {
                            "f5o0v0a": {
                              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o0v0a/",
                              "text": "I just don't want to limit myself in the future for jobs opportunities. Say I really want this job and they pick someone with a CS degree instead of me with a CIS degree because they know CS is harder",
                              "author": null,
                              "created": 1572307557,
                              "upvotes": 0,
                              "replies": {
                                "f5o3gg8": {
                                  "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o3gg8/",
                                  "text": "You’re limiting your job opportunities right now to stuff you wouldn’t enjoy if you’re sticking with a field you hate.",
                                  "author": "Queen-of-Leon",
                                  "created": 1572309194,
                                  "upvotes": 3,
                                  "replies": {
                                    "f5o3qeq": {
                                      "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5o3qeq/",
                                      "text": "Even with how broad the computer science job market is right now? Now that you mention it many jobs I a interested in say CS, MIS, Computer Engineering, or 5 years of related experience for their requirements",
                                      "author": null,
                                      "created": 1572309372,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "f5ngtwl": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ngtwl/",
          "text": "Except the fun stuff is just more programming and next year is my last year",
          "author": null,
          "created": 1572300041,
          "upvotes": 3,
          "replies": {}
        },
        "f5nxp3n": {
          "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5nxp3n/",
          "text": "If fun means you are learning more in depth stuff that you are curious about, then yes, it can be fun.",
          "author": "Demosama",
          "created": 1572305547,
          "upvotes": 2,
          "replies": {
            "f5ny1n8": {
              "link": "/r/college/comments/dob8tz/are_you_suppose_to_enjoy_college/f5ny1n8/",
              "text": "Yes, that is obviously what I meant lol.",
              "author": "cakeknife3",
              "created": 1572305774,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  },
  "updated": 1634056716
}