{
  "sid": "rilrrd",
  "link": "/r/college/comments/rilrrd/should_i_transfer_out_of_community_college_after/",
  "title:": "Should I transfer out of community college after my freshman year or sophomore year?",
  "text": "I’m overall tired of being at home and I’m craving going to university. I got into a lot of universities after high school but wanted to save money for a year or two before I went off.\n\nReasons I’m thinking about transferring after a year:\n\n1. I want to join student organizations at my university and gain experience for my job. I’m a business major and want to get a good leadership position in a club by my senior year.\n\n2. I want yo get an internship my sophomore or Junior year. I want to get an early internship to gain as much experience possible.\n\n3. I feel like I’m missing out so much and being at home is boring. I want out and I’m tired of sitting back at home it literally sucks when I could’ve been going to football games and parties.\n\n4. Home isn’t suitable for college student. I have a bunch of chores and tons of responsibilities at home physically and financially and it gets stressful especially on top of being a full time student and working a lot of hours.\n\n5. I strongly believe I can get a large scholarship to university because I have high grades plus I saved a year of at community college I won’t be in the worst financial situation. Nothing on this path is guaranteed but gosh I wanna go off so bad.\n\nReason I’m thinking about staying another year at home\n\n1. Money/ another guaranteed year of free college",
  "author": "Musclemanic003",
  "created": 1639760377,
  "updated": 1639787333,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hoynk7j": {
      "link": "/r/college/comments/rilrrd/should_i_transfer_out_of_community_college_after/hoynk7j/",
      "text": "The extra year's worth of money helps out a ton",
      "author": "Ifoundyouguys",
      "created": 1639772183,
      "upvotes": 2,
      "replies": {}
    },
    "hoyxlef": {
      "link": "/r/college/comments/rilrrd/should_i_transfer_out_of_community_college_after/hoyxlef/",
      "text": "It's up to you. See what's up with transferring now, see what schools you can get into and/or what they want you to have. Some schools for some programs they want you to have completed a certain amount of courses before they admit you into the program. I am not a business major, but I know for computer science in my state to transfer, most publics want you to have about the first 2 years completed to have the best chance of admission. \n\nTransferring from a cc to a university can be competitive as well. I'm not trying to rain on the parade, best of luck really, but big schools might have lower rates of acceptance for transfers than their general admission rates into the school for those out of high school. So, make sure to keep those grades up as much as possible and your total credit hours completed low. \n\nAlso do your research. you said in your post \"football & parties\". what if i told you not every college has that? You might be like bullshit. But nah, man i'm telling you haha. the college I transferred to has no football team, no school spirit, and social life is worse than the community college somehow. Thing is, the rankings are decent for my state. So the prestige mindset got to me and I thought stupidly, that if a school had that good of rankings, it had to be fun! wrong. lol not this school.  so, don't be dumb like me, look for those big brand / sports program schools. That is where those football games & parties are. Aim high!\n\nLastly, on the note of staying at cc, here's something to think about. This semester for many universities across the country was an experiment. For over a year prior, even those big party schools, were all put on hold because of covid. This semester things got back into the swing of things, but still in a limited way. If I were transferring, I would wait at least 1 more semester at the cc save $$, and then think about it, see how things panned out at your prospective universities. Especially if you're transferring, the time to do it for fun is the fall. Usually that's when the most people arrive. I think it's worth another semester at the cc, just to play it safe. I like to think, things will just get progressively better next semester at these universities and back to where it normally was before, but it will be a continual process. What would you rather have a half-ass party school or a three-quarter-ass party school? lol the latter is better than half for sure haha",
      "author": "pekkalacd",
      "created": 1639776235,
      "upvotes": 1,
      "replies": {}
    }
  }
}