{
  "sid": "qgj5kc",
  "link": "/r/college/comments/qgj5kc/having_a_high_school_so/",
  "title:": "having a high school s/o",
  "text": "i really like a guy who i go to school with and have since day 1, but he has a gf back home. we def have a bit of chemistry but i am NOT about to be the cause of him cheating on her or a break up (i have morals). it really sucks though because since she isn’t here as a tangible obstacle i just want him all to myself. how long do high school relationships tend to last in college? thinking maybe i can wait this out. we’re both freshmen, for context.",
  "author": "nakabrook",
  "created": 1635290939,
  "updated": 1635302374,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hi6to8j": {
      "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi6to8j/",
      "text": "I'm going to be blunt: please don't be *that* bitch. I know you stated you don't want to be, but thoughts like this can lead to that without us knowing sometimes. Don't go breaking up a couple just because you went and set your eyes on someone who is already taken. If he felt the same way about you, it's his relationship so it would be his responsibility to handle it how he would see fit. Don't embarrass yourself and do yourself a favour by not pining over a committed person. Overall it's not that serious, both high school and college relationships don't usually last, but like you mentioned, it's about morals. Don't keep yourself waiting, if it's meant to be it'll be.",
      "author": "NoDryHands",
      "created": 1635296300,
      "upvotes": 1,
      "replies": {
        "hi7223a": {
          "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi7223a/",
          "text": "that was never my plan from the start. i’m not going to go interfere with his affairs. but i can’t help but like him, that part is hard to change. i’m great at hiding my feelings so this won’t be a challenge but i admit that in the event that their relationship ended (WITHOUT my interference), i would be inclined to maybe? make a move. idk i get anxious over this stuff. for the time being we’re just friends, and i’m okay with that",
          "author": "nakabrook",
          "created": 1635300098,
          "upvotes": 1,
          "replies": {
            "hi72lqo": {
              "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi72lqo/",
              "text": "That sounds good then, a lot of people tend to get carried away with feelings and the lines of morality get blurred, you don't even realise when you've crossed the line. What you're describing is pretty much all you can do, and if they did naturally break up then I'd say it would be fine for you to make a move (maybe after another stretch of waiting to give him time to get over it? Idk). But for right now, you saying that you're okay with being friends is good. If possible, I would say maybe try to get over your feelings for him because being mentally and emotionally hung up over someone who is unavailable can definitely be exhausting, especially when you're only starting out at college. Other than that, good luck with everything and I hope everything works out for the best for everyone.",
              "author": "NoDryHands",
              "created": 1635300349,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hi6usrz": {
      "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi6usrz/",
      "text": "As a freshman myself, the relationships are no different than in high school. Their relationship will most likely not last just as yours won’t. \n\nYou say that you don’t want to be that type of person, but you already have that mentality. It’s quite disrespectful honestly to both the guy you like and his friendship. \n\nBesides, even if he does breakup with his girlfriend, the next person he dated is inevitably the rebound. Similar situation just happened to a girl I knew a few weeks ago.",
      "author": "kizeltine",
      "created": 1635296812,
      "upvotes": 1,
      "replies": {
        "hi71mbe": {
          "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi71mbe/",
          "text": "i don’t have high hopes, is the thing. and i don’t think i’m disrespecting him or our friendship ?? i haven’t made any moves (and don’t plan to). i haven’t been suggestive in the very least. i just really like the guy and hope he becomes available eventually. and tbh even if he does chances are i wouldn’t make a move because i get anxious about this kind of thing",
          "author": "nakabrook",
          "created": 1635299898,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi6iv30": {
      "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi6iv30/",
      "text": "College relationships don’t last long either so just a heads up on that",
      "author": "Spicybooiii",
      "created": 1635291398,
      "upvotes": 2,
      "replies": {}
    },
    "hi6ny10": {
      "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi6ny10/",
      "text": "Don't waste your time with this one. It's extremely disrespectful to both the guy and his gf who may be very happy together. It would be better to just try to find a different guy who is not in a committed relationship",
      "author": "nightfire00",
      "created": 1635293700,
      "upvotes": 2,
      "replies": {
        "hi72jf5": {
          "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi72jf5/",
          "text": "like i’ve said in other responses, i mean no disrespect. this is just a genuine question that’s been weighing on my mind, as i have other friends who have either stayed with or broken up with their high school partners. i have zero intentions to do anything that would compromise their relationship. it obviously be wrong on my part, and i would hate to see him upset. \n\nregarding that last part, i’m not actively looking to date someone. i just like who i like, and it just happens to be him at the moment",
          "author": "nakabrook",
          "created": 1635300318,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hi6im40": {
      "link": "/r/college/comments/qgj5kc/having_a_high_school_so/hi6im40/",
      "text": "Typically not long because of the distance and difficulty.",
      "author": "beywill19",
      "created": 1635291286,
      "upvotes": 1,
      "replies": {}
    }
  }
}