{
  "sid": "qlcaie",
  "link": "/r/college/comments/qlcaie/21m_third_year_of_college_still_having_a/",
  "title:": "21M, third year of college, still having a difficult time picking a career path",
  "text": "I am a college student and I am really struggling. It's not that college is hard, but I just have a lack of motivation and depression in college, which is causing me to really have bad thoughts tbh. Mostly I am just seriously stuck and I am not really sure of what I want to do in life because it's a seriously difficult time of my life in the early 20s. My own siblings refuse to talk to me, my mother wants me dead because I am such an embarrassment. I am just lost and not interested in anything else. I have tried different skills such as computer programming skills but I am very bad with computers so it's not for me and I struggled very hard in my intro to programming class. Honestly, I am not a very smart individual as I struggle very hard in logical thinking and I struggle to understand things faster than my peers. I also probably have a really low IQ so that's not a good situation. Being 21 and still living with my parents isn't a good thing as that I am seriously trying very hard to move out but I struggle with finding a stable job to leave from my parents house. It's a huge struggle because I don't have any skills or any type of income to live comfortably in NYC. Currently I am about to start junior year in college and my GPA is currently below 3.0 and I believe that I can't get into medical school, P.A school, law school, or high level finance. I really don't want to do finance but it seems like the easiest degree at my college and it kinda sucks tbh since I go to a non target school.\n\n\n\nEdit: Blue collar jobs aren't for me because I got into an injury years ago that was a car crash and it affected my ability to stand up for long hours plus I am not good at all with my hands as that I don't want to mess up somebody's property that might get someone hurt",
  "author": "throwaway7492977",
  "created": 1635881851,
  "updated": 1635890731,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hj1uqfe": {
      "link": "/r/college/comments/qlcaie/21m_third_year_of_college_still_having_a/hj1uqfe/",
      "text": "First off, stop being so hard on yourself. My girlfriend is kind of in the same boat you are. She still lives with her folks and has changed her major three times. She took some time off to get a data entry/shipping job with a manufacturer and now she’s heading back to school in Spring.\n\nHave you considered taking time off and working?\n\nLiving with your folks at 21 is not a bad thing these days. The housing market is insane.",
      "author": "CedarBuffalo",
      "created": 1635882090,
      "upvotes": 1,
      "replies": {}
    }
  }
}