{
  "sid": "rgh1fz",
  "link": "/r/college/comments/rgh1fz/lost_my_40_gpa/",
  "title:": "Lost my 4.0 GPA",
  "text": "Hi guys, I feel extremely depressed to lose my 4.0 Gpa. I took calc 2 this semester and let's just say it was NOT GOOD at all. My final exam score fucked me up. I passed the class with an 83 percent. It sucks to know that this will make my GPA go down bad. I also have an 87 percent in This other 3 credit hour class. There is one more class that I am not expecting an A in either. I am just a sophomore in college. I've had a 4.0 gpa so far, but will lose it now due to my performance this sem. I really wanted to pass with a 4.0 Gpa but it sucks to know that I lost it. I feel like the dumbest person in the world. It's so demotivating  :( I would love any advice on coping up with this. Thanks!",
  "author": "ShineHistorical1930",
  "created": 1639515222,
  "updated": 1639860481,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hok7pv0": {
      "link": "/r/college/comments/rgh1fz/lost_my_40_gpa/hok7pv0/",
      "text": "Your intelligence isn't defined by your grades and insulting yourself out of a bad semester will just hurt your confidence. Try to think about what went wrong, maybe take less courses, maybe use another studying techniques, but don't start chaining thoughts in a catastrophic manner (bad grade in calc 2 - > I'm bad at math - > I'll be a drop out, etc).\n\nNobody died, you are still you, there's a lot of room for improvement and many chances to try again.",
      "author": "cegalleta",
      "created": 1639516646,
      "upvotes": 11,
      "replies": {}
    },
    "hoken28": {
      "link": "/r/college/comments/rgh1fz/lost_my_40_gpa/hoken28/",
      "text": "Thats still an awesome gpa. Not everyones perfect. If it makes u feel better i have a 2.9 gpa first semester in engineering",
      "author": "numbnuts698",
      "created": 1639519460,
      "upvotes": 5,
      "replies": {}
    },
    "hokxf3q": {
      "link": "/r/college/comments/rgh1fz/lost_my_40_gpa/hokxf3q/",
      "text": "Rest assured that no one cares about a 4.0 but you. No job, grad school, or anyone puts value in a 4.0.  So many students stress out about this, but it has no real or practical implication. Many places care about 3.5+ or 3.0+, but not 4.0. You’re fine. Don’t stress.",
      "author": "KidsWontSleep",
      "created": 1639527675,
      "upvotes": 3,
      "replies": {}
    },
    "hom9g1q": {
      "link": "/r/college/comments/rgh1fz/lost_my_40_gpa/hom9g1q/",
      "text": "If it makes you feel any better, I just lost my 4.0 to precalc (C) and effing geology (B). Shit happens. Learn from it. I bet you’re still set up to graduate with honors",
      "author": "wafflepancake5",
      "created": 1639552365,
      "upvotes": 1,
      "replies": {}
    },
    "hozr2tv": {
      "link": "/r/college/comments/rgh1fz/lost_my_40_gpa/hozr2tv/",
      "text": "I just lost my 4.0 after my final exam today as a sophomore too. It sucks but I just decided to reset the goals I have set for myself. I'm going to loosen up and take it easy. No point in dwelling over it.",
      "author": "Poiuqwertz",
      "created": 1639788975,
      "upvotes": 1,
      "replies": {}
    }
  }
}