{
  "sid": "rhn35i",
  "link": "/r/college/comments/rhn35i/my_parents_think_im_graduating_college_but_ive/",
  "title:": "My parents think I’m graduating college but I’ve failed all my classes this semester and I failed last 2 semester too and never told them",
  "text": "\nI’m 23 about to be 24. This is my 5th year of college I’m studying to be a computer engineer and I’ve just felt completely burnt/ depressed. I feel like several things are making me feel like this. I’ve had a rough two years. my sister tried to blackmail my parents for money by saying my dad raped her and me which is a lie my dad is mean son of bitch but he’s never done anything like that or hurt me and that just felt like my sister died that day and we cut contact with her I don’t miss her I just feel like my parents are broken since then. Secondly Lockdown happened and I just hated the online classes and I wanted to just wait a year and my mother insisted I keep going and I didn’t learn anything I passed most my classes during it except the last 2 semesters and I’ve failed those. Then last spring my ex fiancé/ gf 5 years only person I’ve been serious with turns out she was lying to me about her being in nursing and her age and just a lot of things and that just pushed me over the edge. She broke up with me the day before finals and she lied to me about having heart surgery and getting pregnant and needed a abortion twice. This all just fucked my head I feel like and I desperately want to finish college i just feel like I need to take a break and work and get my mind right I can’t sit and think about what I need to do. And worst of all the thing that most is fucking me up inside is my own lying my parents think I’m graduating in a few days but I’m really failing and about 3 semesters at least away I just haven’t had the heart to tell my parents and I don’t want to be disowned like my sister and I don’t know how to tell them there son is just a failure. I’m gonna meet my mom in a day and I need to tell her the truth I can’t live the lie no more and they won’t trust me ever again probably I just want know what you think I should say and what I should do going forward I want to finish college I just know if I just go back in the spring I will just fail again and how do I tell them that and that I just want to get a job and work for a while and get my mind right.",
  "author": "Dunkindeeznutz69420",
  "created": 1639646488,
  "updated": 1639787781,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 0.75,
  "comments": {
    "horgrml": {
      "link": "/r/college/comments/rhn35i/my_parents_think_im_graduating_college_but_ive/horgrml/",
      "text": "Well i did the same thing at the same age, i think I'm just starting to get my mind right now and im gonna go back soon to finish it.",
      "author": "doctor_may",
      "created": 1639648087,
      "upvotes": 2,
      "replies": {}
    }
  }
}