{
  "sid": "qpvrhy",
  "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/",
  "title:": "My University is getting rid of my major after my class. Do I stay?",
  "text": "I am currently a freshman at a small, yet prestigious stem school in the Midwest. I am majoring in biology, but shortly after I committed to the school, it was announced that they were phasing out my major and pretty much any other non-engineering major. I was not happy, but academically the school made sense, bc their pre-med program has a 99% acceptance rate into med school. After the first half of my first semester, I'm having my doubts about staying. I can finish out my four years here, it is just more complicated and I might have to take some bio classes online which I really hate. Besides the academics, I love it here. I have friends, an on campus job, and there's a co-op program that is required where I work three months and then go to school three months and repeat that all four years. Will it look worse to stay at a school that is getting rid or your major as soon as you leave with multiple online classes or worse to transfer after my freshman year. I'm really worried either of these might affect if I get into med school or graduate school. Do I transfer elsewhere or stay?",
  "author": "ameliaw56",
  "created": 1636432178,
  "updated": 1636655305,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hjwko1g": {
      "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/hjwko1g/",
      "text": "Transfer. You can study anything to get into medschool, you mainly just need to do really well on the MCAT if it’s a degree outside of STEM. That being said med school is highly competitive and if you don’t get accepted the 1st or 2nd round are you going to be satisfied working in a career with a major you didn’t even want?",
      "author": "rynpickles",
      "created": 1636436850,
      "upvotes": 1,
      "replies": {}
    },
    "hjy2izy": {
      "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/hjy2izy/",
      "text": "Ah, fellow Kettering student. I’d suggest talking to the department of natural sciences about it if you haven’t already. They did confirm they are keeping pre-med for the foreseeable future",
      "author": "diesalotXV",
      "created": 1636472303,
      "upvotes": 1,
      "replies": {
        "hjy5fpd": {
          "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/hjy5fpd/",
          "text": "You got me lmao. I’ve been discussing it all with the bio/premed advisor and provost. They say there isn’t going to be anymore bio classes online and my courses shouldn’t suffer but I’m in an online class right now that they hired a community college professor to teach(who I might add refuses to record lectures)",
          "author": "ameliaw56",
          "created": 1636473495,
          "upvotes": 1,
          "replies": {
            "hjy6uyc": {
              "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/hjy6uyc/",
              "text": "If they aren’t recording lectures, you can report them to the department head. It’s policy that they have to",
              "author": "diesalotXV",
              "created": 1636474078,
              "upvotes": 1,
              "replies": {
                "hjy7p12": {
                  "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/hjy7p12/",
                  "text": "The whole class has reported them, but nothing smh",
                  "author": "ameliaw56",
                  "created": 1636474418,
                  "upvotes": 1,
                  "replies": {
                    "hjy83jd": {
                      "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/hjy83jd/",
                      "text": "That sucks. Sorry you have to deal with that person. They need to stop hiring people like that. If your department keeps that up, transferring might be a good option.",
                      "author": "diesalotXV",
                      "created": 1636474583,
                      "upvotes": 1,
                      "replies": {
                        "hjy8x0m": {
                          "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/hjy8x0m/",
                          "text": "I’m sticking it out for this semester and next semester so I can at least do one co-op term and then probably leaving. If things change maybe not but at least I have options",
                          "author": "ameliaw56",
                          "created": 1636474912,
                          "upvotes": 1,
                          "replies": {
                            "hjy9dy6": {
                              "link": "/r/college/comments/qpvrhy/my_university_is_getting_rid_of_my_major_after_my/hjy9dy6/",
                              "text": "That’s probably a good move. Try and convert that co-op to a summer internship wherever you transfer",
                              "author": "diesalotXV",
                              "created": 1636475100,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }
}