{
  "sid": "q83k6q",
  "link": "/r/college/comments/q83k6q/i_dont_know_how_to_do_x_what_are_some_things/",
  "title:": "\"I don't know how to do X.\" What are some things professors expect you to do, that you may not know how?",
  "text": "This issue came up recently in the discussions in our department.  A student claimed they were confused by the analog clock in the testing center and missed the cut-off for an exam.\n  \n  Now, as professors, we have learned not to take anything for granted.  Due to students coming to us from all backgrounds (out of state, out of country, English as a second language, etc.), we encounter students who are not familiar with imperial rulers in labs, or how to upload a file, or find the downloads folder on their computer.\n  \n  So what are some seemingly simple things like telling time using an unfamiliar clock, uploading a file, typing, finding the \"Roman numerals\" on the keyboard, looking up the definition of anomalous, or understanding the campus map that you think you may need help with in today's modern, international higher education?\n  \n  P.S., I wish I was joking.  This is your opportunity to help me help you.",
  "author": "That_Computer_Guy",
  "created": 1634229849,
  "updated": 1634252151,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hgmw596": {
      "link": "/r/college/comments/q83k6q/i_dont_know_how_to_do_x_what_are_some_things/hgmw596/",
      "text": "Fellow teacher here: The education system does not adequately prepare kids to actually use the technology necessary for function as an adult. Writing professional Emails, choosing a good email address, making decent passwords/using password managers, how to google effectively, the entire office suite is woefully under taught, how to build a 'professional' social media presence...etc all of it necessary and none of it taught formally.",
      "author": "Sengel123",
      "created": 1634232865,
      "upvotes": 3,
      "replies": {
        "hgnns2a": {
          "link": "/r/college/comments/q83k6q/i_dont_know_how_to_do_x_what_are_some_things/hgnns2a/",
          "text": "I’d like to further emphasizes that I think is both an issue within high schools and colleges. High schools fail to prepare students for the demands of college, and colleges expect too much for students their first year. \n\nThe issues with high school education are pretty self explanatory, low demands, easy course material, and students being constantly reminded by teachers to do their assignments. \n\nMeanwhile, colleges fails to adjust new or returning students to school the first semester. I’m a freshman in my first semester of school, and the student seminar class I’m taking that’s supposed to help assimilate me into the school hasn’t done so at all. For example, my professors suddenly expect for me to know how to write formal academic essays with proper citations. Keep in mind, all I’ve ever known is the infamous 5 paragraph essay structure and MLA format. \n\nIt’s things like these that should be implemented into introduction courses the first semester of college.",
          "author": "kizeltine",
          "created": 1634244296,
          "upvotes": 1,
          "replies": {
            "hgnrul3": {
              "link": "/r/college/comments/q83k6q/i_dont_know_how_to_do_x_what_are_some_things/hgnrul3/",
              "text": "I've always been in support of a 5th core class from 3rd on for technology and life skills. Early is basic how to use a computer and basic safety, then important applications, on until you get to senior year where it's advanced online safety, managing expenses, professional social media presence...etc.",
              "author": "Sengel123",
              "created": 1634246866,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hgnczct": {
      "link": "/r/college/comments/q83k6q/i_dont_know_how_to_do_x_what_are_some_things/hgnczct/",
      "text": "footnoting and bibliographies are the bane of my existence. i was sort of taught how to do them in high school, but for some reason professors just assume you know how to do them perfectly.",
      "author": "ourhouse1970",
      "created": 1634239849,
      "upvotes": 2,
      "replies": {}
    }
  }
}