{
  "sid": "r2ha0n",
  "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/",
  "title:": "Failing all of my classes",
  "text": "Yep, another one of these. \n\nI took a year and a half after high school while working full time to finally start college for an associates at a local community College. This is my first semester. I was doing pretty good the first quarter of the semester, then grades plummeted. Starting losing motivation and decided it wasn't for me. I started skipping my 3/4 of my classes (except one, because for some reason I liked this one class). \n\nEnded up dropping one of my classes on the deadline and wished I dropped the rest because now I'm failing all except one due to not doing the assignments. Just missed a giant essay and completely missed an exam (not final).  I really have 0 motivation to even attend the finals at this point because the semester ends soon, and feel really really guilty about my lack of effort, and it's starting to cause anxiety thinking about it that I never had before.\n\nIs it even worth going to the finals at this point? I dug myself into a hole i can't get myself out of and I'm gonna fail regardless it seems.",
  "author": "ragglefraggle20",
  "created": 1637910091,
  "updated": 1638206886,
  "over_18": false,
  "upvotes": 70,
  "upvote_ratio": 0.94,
  "comments": {
    "hm4qjkf": {
      "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm4qjkf/",
      "text": "Nah don’t go. You won’t pass anyways. Just fail and retake the classes again when you’re ready.",
      "author": "coronavirusisshit",
      "created": 1637911653,
      "upvotes": 47,
      "replies": {}
    },
    "hm4wr7j": {
      "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm4wr7j/",
      "text": "Talk to your professor and see what you can do. The secret about dropping is that professors can give you a W grade at ANY time if they want to. I had a convo with a previous prof in the last week of the semester, telling him why I gave up that semester and why I had to stop moving forward with his class. He did me a solid and gave me a W in the last week of the semester, even though it had been months since the drop deadline.",
      "author": "maora34",
      "created": 1637916475,
      "upvotes": 31,
      "replies": {
        "hm5n31i": {
          "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm5n31i/",
          "text": "Withdraws exist so you can leave a class after the drop deadline -- your prof didn't pull any special strings and it's not actually a secret! \n\nAnd to clarify (for anyone else just learning of these), the class can't have ended yet, so \"any time\" is still limited to the semester you're in. Once final grades are entered, that's it. My state caps withdraws at 6 for your entire higher education. Other programs and schools may also have their own caps.",
          "author": "dutempscire",
          "created": 1637936335,
          "upvotes": 21,
          "replies": {
            "hm5nfdr": {
              "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm5nfdr/",
              "text": "Most(basically every) uni has a date where you can’t even drop with a W. Ws exist so you can drop it after the NGR drop deadline. By this point, as a student, you are stuck with the course unless you qualify for an emergency withdraw. What I’m saying is that I was far, far beyond the W date and it could only have been input with my instructor submitting special paperwork to the college.\n\nIt is absolutely a secret that professors can work to give you a W after the W deadline. It’s super rare and I know it is because I was in contact with him to make it happen.",
              "author": "maora34",
              "created": 1637936522,
              "upvotes": 10,
              "replies": {
                "hm5s5t7": {
                  "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm5s5t7/",
                  "text": "Ah! I see. Good for them (and you) after all!",
                  "author": "dutempscire",
                  "created": 1637938986,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "hm4zo53": {
          "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm4zo53/",
          "text": "What's a W grade?",
          "author": "Zyrobe",
          "created": 1637918920,
          "upvotes": 8,
          "replies": {
            "hm501bs": {
              "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm501bs/",
              "text": "Withdraw. There's 3 kinds of withdraws. You can withdraw NGR, which means nothing is on your record, withdraw with a W, which places a W on your record(no effect on GPA), or excused/emergency withdraw, which may be a EW, EX, or no record depending on the school.",
              "author": "maora34",
              "created": 1637919229,
              "upvotes": 11,
              "replies": {}
            },
            "hm502db": {
              "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm502db/",
              "text": "Withdrawal, it goes on your transcript in place of an F or an SN.",
              "author": "FamishedHippopotamus",
              "created": 1637919255,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "hm8gd5a": {
      "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm8gd5a/",
      "text": "Do something else but realize that in college, life, or anything, you won’t get very far without working extremely hard. If you need time, take time. It’s a marathon, not a sprint.",
      "author": "Jellobeatshollaatme",
      "created": 1637984825,
      "upvotes": 1,
      "replies": {}
    },
    "hm8lyf3": {
      "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm8lyf3/",
      "text": "Yeah I agree with what others said, dont take em. College ain't for everyone, and especially not if you dont have a goal in mind or have time to study and finish all the assignments. Heck, this was my first semester ever going to college. Classes arent that bad, but with my real life issues, I am lucky to have only taken 3 classes. Cant even imagine 4. I wouldnt feel guilty about it. For college honestly, it nots as huge as people think it is. Some people make way more money than those with college degrees. I'm just doing it for myself and my future, as well as being the first to graduate in my family. \n\nYou can work for sometime and maybe if you want to go back, you can. I'm also doing an associates. I also struggle with motivation sometimes, but I just got to get it done, or else I fall behind, I hate that crap.",
      "author": "Sky_hunter",
      "created": 1637987918,
      "upvotes": 1,
      "replies": {}
    },
    "hm9x00y": {
      "link": "/r/college/comments/r2ha0n/failing_all_of_my_classes/hm9x00y/",
      "text": "You should. I know what it feels to lose motivation. And really the only somewhat effective way of fixing it is to find it fun. It’s hard. I know. Classes are boring and you normally just sit at your desk and sleep or something. But I realized in my physics class that simply getting up out of your seat is a lot more engaging. You might not be allowed to do so, perhaps. But maybe you could do your own extra work to make sense of everything. Find out why it exist, and always ask why it’s cool. I hate reading, personally. But recently I’ve payed more attention in class just figuring out how things work in format and linguistic elements. What you have is a big problem and it will appear in every other aspect of your life. And no one can help you. Why do you do it? Because, like every human being, you want to win. That’s something my dad taught me.",
      "author": "Intelligent-Agent520",
      "created": 1638022239,
      "upvotes": 1,
      "replies": {}
    }
  }
}