{
  "sid": "qatazt",
  "link": "/r/college/comments/qatazt/help_with_college_decision/",
  "title:": "Help with College Decision",
  "text": "I (recruited athlete) have to make a decision between two schools soon. I like both schools a lot but am indecisive about which one I should choose. I want to major in engineering and want to have very good career-building opportunities. Below are the main factors\n\nSchool A: Georgia Tech\n\n\\- Very high-ranked engineering program (my current intended major), large focus on engineering/tech\n\n\\- The athletic dorms are very nice, each person gets their own room, has a living room, showers, etc.\n\n\\- The campus is scooterable, and commute to classes & sports facilities is very easy\n\n\\- In a big city (Atlanta), which I personally like, both for things to do and potential internships\n\n\\- I would be able to drive there and have a car\n\n\\- Facilities are very nice\n\n&#x200B;\n\nSchool B: Duke\n\n\\- Very high ranked school overall, not only in engineering, students major in a larger variety of things\n\n\\- Sophomore, Junior, and Senior dorms are nice, but still with a roommate & communal showers/bathrooms\n\n\\- Commute would take longer, freshman year I would have to ride a bus between campuses for practice as opposed to a 3 minute walk\n\n\\- It is more selective than GT, and has a better reputation or \"curb appeal\", because it is ranked higher than GT\n\n\\- Because of the selectivity, I've been told that I'd meet many interesting/driven people while I'm there\n\n&#x200B;\n\nMy main worry about going to Georgia Tech is that if I chose to pursue something non-engineering (most likely will still be in the STEM field though), I will not get as good of an education/as valuable of a degree as I would from Duke. Also Georgia Tech doesn't carry the allure of being a top 10 school.\n\nMy anxiety about going to Duke is that 1) Commutes will be longer from the dorms, and the dorms aren't as nice, 2) Durham is a smaller city, whereas Atlanta has many large companies willing to offer internship positions\n\n&#x200B;\n\nI'm pretty adaptable, so I'm not going to *dis*like either school, I just don't want to waste a good opportunity.",
  "author": "MidnightFerret123",
  "created": 1634583292,
  "updated": 1634654361,
  "over_18": false,
  "upvotes": 16,
  "upvote_ratio": 0.91,
  "comments": {
    "hh56ak3": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh56ak3/",
      "text": "How are the finances? If one school gives you more scholarship money than the other, that’s valuable",
      "author": "SirSaladHead",
      "created": 1634584380,
      "upvotes": 26,
      "replies": {}
    },
    "hh5dhgc": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh5dhgc/",
      "text": "Disclaimer: im biased towards Atlanta, being from there. BUT prestige isn’t that important, and you definitely will receive as good as an education at Tech as Duke. They’re both great schools and unless you already know prominent Duke or Tech alumni, no one 10+ years out of school will care which school you chose as they both produce quality students.",
      "author": "Scoots1721",
      "created": 1634587313,
      "upvotes": 13,
      "replies": {}
    },
    "hh5f55k": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh5f55k/",
      "text": "Cool beans. Here is how you decide. First, congrats on being recruited, that's dope.\n\nSo this applies to life beyond just choosing this one thing as well.\n\nInside of you, you know which one you really want to go to. If you were to remove pros and cons from the equation and you just got to choose one because it was what you really wanted to do, one would stand out.",
      "author": "JakeTroxell",
      "created": 1634588000,
      "upvotes": 9,
      "replies": {}
    },
    "hh5wts8": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh5wts8/",
      "text": "Imagine the school if you didn’t have the sport. Would you still love the school without the sport?",
      "author": "ConfusionMaterial967",
      "created": 1634596294,
      "upvotes": 3,
      "replies": {}
    },
    "hh5vyl3": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh5vyl3/",
      "text": "Which one do you like more? No pros and cons, would you be more proud to tell people that you’re a Duke Blue Devil or a Georgia Tech Yellow Jacket? I spent way too much time trying to science out my decision and think about it rationally, go with your gut and you’ll be happy.",
      "author": "PartyBear9",
      "created": 1634595889,
      "upvotes": 2,
      "replies": {}
    },
    "hh66fr7": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh66fr7/",
      "text": "Duke, because of the amount of traffic in Atlanta.",
      "author": "jameskishtok",
      "created": 1634600894,
      "upvotes": 2,
      "replies": {}
    },
    "hh5tpuk": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh5tpuk/",
      "text": "they're both fine. You're just gonna have to figure out which one you want. nobody can figure that out for you.",
      "author": "RollWave_",
      "created": 1634594854,
      "upvotes": 2,
      "replies": {}
    },
    "hh6c9xu": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh6c9xu/",
      "text": "I would take a look at the scholarship amounts is a full ride from both or is one giving you more than the other.... In addition Maybe look at the cost of the parking pass and if you can't decide from that put both names in a piece of paper on separate pieces of paper and then put them in a hat then pick one and whichever name you pull out of the hat read it read it and then analyze your feelings because of it if your reaction is joy go with that 1 if your reaction is disappointment go with the other.... I know that isn't super helpful but sometimes if you can't find any major difference between the 2 that's about it... That how I picked between UChicago and Oxford when I couldn't decided... Oxford was the one I pulled out of the hat and I was a little disappointed so that was how I figured I wanted to go to UCHICAGO more...",
      "author": "pygmypuffonacid",
      "created": 1634603728,
      "upvotes": 1,
      "replies": {
        "hh6vw7b": {
          "link": "/r/college/comments/qatazt/help_with_college_decision/hh6vw7b/",
          "text": ".",
          "author": "AceTheGreat_",
          "created": 1634613350,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hh73vv7": {
      "link": "/r/college/comments/qatazt/help_with_college_decision/hh73vv7/",
      "text": "I've heard great things about Georgia Tech. I'm sure you'll get a great education regardless of which school you choose.\n\nHowever, 57% of STEM majors end up leaving the field, so maybe go with Duke.",
      "author": "Comprehensive-Ad3963",
      "created": 1634617970,
      "upvotes": 1,
      "replies": {}
    }
  }
}