{
  "sid": "quh4t7",
  "link": "/r/college/comments/quh4t7/dropping_ap_stats/",
  "title:": "Dropping Ap Stats",
  "text": "Hello im a high school senior who is applying for mostly schools in maryland like UMD, Towson Umbc Ect. I have been pretty good with my grades and have a steady growth in GPA throughout the years but now im a senior and Ap Statistics is getting me for example I never had a C or a D on my report card ever til last quarter and I got a D in stats. I was wondering how bad would it look if I dropped AP stats even though i need 4 math credits for most colleges and do a dual enrollment for my community college second semester to get that credit. Would college rather see me stick through it and get A D each quarter or drop it and take a College course that's a little easier and get a B or an A?",
  "author": "TrainingHeavy7820",
  "created": 1636984978,
  "updated": 1637181533,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hkpysyb": {
      "link": "/r/college/comments/quh4t7/dropping_ap_stats/hkpysyb/",
      "text": "Don’t you need high school credit to graduate? Or do you have enough already? Don’t worry about Towson tho, that is a notorious party school in DMV, the acceptance rate is very high. I’d say the only one that might say something is UMD since their college application is separated with common application.",
      "author": "mikeke3",
      "created": 1636985491,
      "upvotes": 3,
      "replies": {
        "hkq4r38": {
          "link": "/r/college/comments/quh4t7/dropping_ap_stats/hkq4r38/",
          "text": "I have enough and a college class would count over to high's school credit since it's dual enrollment",
          "author": "TrainingHeavy7820",
          "created": 1636988282,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkq8yde": {
      "link": "/r/college/comments/quh4t7/dropping_ap_stats/hkq8yde/",
      "text": "Have you checked to see if the class will count for college if you get a D? Some colleges specify on their websites that they want you to take 4 years and get a C or better in high school. I think I would try for dual enrollment provided you can get a whole year’s credit.",
      "author": "cmac6767",
      "created": 1636990141,
      "upvotes": 1,
      "replies": {
        "hkqjqbw": {
          "link": "/r/college/comments/quh4t7/dropping_ap_stats/hkqjqbw/",
          "text": "every school i applied to says they will accept D's but below 3.0 GPA is a space to space basis and i have well over a 3.0 even with a D.",
          "author": "TrainingHeavy7820",
          "created": 1636994585,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkryoo6": {
      "link": "/r/college/comments/quh4t7/dropping_ap_stats/hkryoo6/",
      "text": "While I don't have any advice on whether to drop or not, if you choose to push through, I suggest following the Khan Academy AP Stats course. I self-studied AP stats using only that course in less than a month, it's fantastic for teaching you all of the concepts in a short amount of time.",
      "author": "NoDryHands",
      "created": 1637014680,
      "upvotes": 1,
      "replies": {}
    }
  }
}