{
  "sid": "rf94yv",
  "link": "/r/college/comments/rf94yv/what_should_i_do/",
  "title:": "What should I do?",
  "text": "So like I go to a community college and I’m not sure if I should get an associates degree and stop there or should I transfer to a different school? Honestly, I’m leaning toward getting my associates degree from my community college instead of transferring. What are the pros and cons of what I want to do?",
  "author": "Aggressive_Top_6949",
  "created": 1639376655,
  "updated": 1639516180,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hocqrr0": {
      "link": "/r/college/comments/rf94yv/what_should_i_do/hocqrr0/",
      "text": "Currently I’m getting my associate from my community college and then transferring. The main reasons I’m doing so:\n\n-I’m getting my GERs out of the way now that are free at my community college rather than transferring and paying since sum for the same basic level of math writing etc. \n-gives me more time to get financially set \n-for me transferring means moving to a different state entirely, and being at a community college for the first two years has allowed me to make more professional connections in my home state, If I ever wanted to return I could and have a small network to work from \n\nI’d imagine a con of doing this is losing out on the freshman experience of dorms and what not, but personally I don’t care to have forced roommates and eating the school food",
      "author": "Sad_Membership_1998",
      "created": 1639379928,
      "upvotes": 1,
      "replies": {}
    },
    "hocuacu": {
      "link": "/r/college/comments/rf94yv/what_should_i_do/hocuacu/",
      "text": "What do you want your AS in? Most associate degrees are next to useless when it comes to getting jobs. Trust me, I have 5 of the fuckers lmao.",
      "author": "maora34",
      "created": 1639382678,
      "upvotes": 1,
      "replies": {
        "hoe5aqt": {
          "link": "/r/college/comments/rf94yv/what_should_i_do/hoe5aqt/",
          "text": "[removed]",
          "author": null,
          "created": 1639411713,
          "upvotes": 1,
          "replies": {}
        },
        "hoextna": {
          "link": "/r/college/comments/rf94yv/what_should_i_do/hoextna/",
          "text": "I want a associates degree in computer science",
          "author": "Aggressive_Top_6949",
          "created": 1639423022,
          "upvotes": 1,
          "replies": {
            "hoflc1g": {
              "link": "/r/college/comments/rf94yv/what_should_i_do/hoflc1g/",
              "text": "That’s actually a useful one. Go for it, but you may find a bachelor’s is better to help you slot into different roles. Tech is very meritorious and you can go far if you’re just a good SWE, but you may want a BS if you ever want to switch.",
              "author": "maora34",
              "created": 1639432662,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}