{
  "sid": "rghb1s",
  "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/",
  "title:": "Grading problem by professor. Professor does not communicate",
  "text": "Long story short. My accounting class was a peculiar one. At first I thought it was the best class ever because Professor said no quizzes or tests. He said “I’ll grade by your assignments.”Honestly this has been the most unorganized class. He never ever returns our emails and doesn’t care tbh (but he says he does) \nI had a meeting with him two weeks ago and he said I have an A-. Today i check my cunyfirst and see a B+. Mind you I’ve never missed any class, submitted email assignments and on wiley plus I have a 95%\nI text my class and I see students who didn’t even finish their works getting A-. It feels like he just gave grades randomly. Also, there have been instances where my classmates spammed 10 emails in a row but he didn’t reply. I kinda spammed emails but I really don’t think he’ll reply. It’s one thing to do my best and get a B+ but I’m upset that I put in the work but my grades are lower than what my professor told me. What can I do now? Please help",
  "author": "potatsko",
  "created": 1639515935,
  "updated": 1639856816,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hok8atk": {
      "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/hok8atk/",
      "text": "if you have a dean, reach out to your dean. grab any documentation you can if you doing the work, in case it's about to disappear online or something. \nyou can also email your professor, cc'ing the department head/chair, or email the chair directly. express your concern that you haven't heard back from your professor about grading inaccuracies",
      "author": "cripslocking",
      "created": 1639516882,
      "upvotes": 3,
      "replies": {
        "hokeqnl": {
          "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/hokeqnl/",
          "text": "I think I’ll do that but I’ll wait another day and see if he replies. Thanks!",
          "author": "potatsko",
          "created": 1639519501,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hokgncy": {
      "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/hokgncy/",
      "text": "Have you thought about the possibility that these students that got A+s or As excelled in other areas to justify their grade.\n\nSometimes, a lecturer grades on a wholistic view of the course. In these circumstances it's possible that these other students excelled in other ways.\n\nA B+ isn't the end of the world anyway it's still an excellent passing grade... Everyone here is saying go to the dean. I would say read your course outline to see how the course is graded before you go all out at the lecturer.\n\nAs for what your prof told you. Assuming he said this before your last assignment or before your final grades were tallied I wouldn't have given it so much wieght. As the reality is you had not been graded yet.",
      "author": "Impressive-Name5129",
      "created": 1639520303,
      "upvotes": 1,
      "replies": {
        "hokixz2": {
          "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/hokixz2/",
          "text": "I understand the other aspects but in the beginning of the semester professor said that as long as we submit the assignments, we will be fine. B+ isn’t a bad grade but I know that I deserve better because it’s not just me, other students of his are saying the same thing: that he as been giving grades like lottery. \nA guy who hasn’t been in class or submitted anything in the class got a C. Idk how to make sense of that. Other classmates of mine are trying to reach him but can’t. \nWhen we had talked in the last meeting i had submitted everything except one chapter and he said if I submit I’ll get A- which I submitted in the same day. As we didn’t have any quizzes or finals there shouldn’t be a drastic change in the grades. Aside from all that even if I was in the wrong, I would expect a reply from my professor explaining the situation but didn’t get any.",
          "author": "potatsko",
          "created": 1639521263,
          "upvotes": 1,
          "replies": {
            "hokkijv": {
              "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/hokkijv/",
              "text": "Check your spam folder?\n\nOther than that. Idk. Ask the prof. Maybe the class is one of the ones you cannot fail",
              "author": "Impressive-Name5129",
              "created": 1639521934,
              "upvotes": 1,
              "replies": {
                "hoklu6h": {
                  "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/hoklu6h/",
                  "text": "I just mentioned that there’s no way of contacting him. He never replies to student emails. Found a number from our school’s website but that’s turned off. Anyways thanks",
                  "author": "potatsko",
                  "created": 1639522495,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hokriw1": {
      "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/hokriw1/",
      "text": "What cuny school do you go to? At Baruch they accounting classes are graded on a bell curve - only the top 10% can get an A. So while you could have an A- from your grades you could have been graded down if your classmates did better.",
      "author": "goingclassic",
      "created": 1639524998,
      "upvotes": 1,
      "replies": {
        "hoks9w4": {
          "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/hoks9w4/",
          "text": "LaGuardia CC. The thing is he graded student who didn’t even finish their works with B. When we looked at my grades while we had a meeting he said that my grades are looking good and will get A- or up. I myself am very confused with the grading that’s why I wanted to talk to him.",
          "author": "potatsko",
          "created": 1639525336,
          "upvotes": 1,
          "replies": {
            "holrz16": {
              "link": "/r/college/comments/rghb1s/grading_problem_by_professor_professor_does_not/holrz16/",
              "text": ">student who didn’t even finish their works with B. When we looked at my grades while we had a meeting he said that my grades are looking good and will get A- or up. I myself am very confused with the grading that’s why\n\nI would email him and him if you were missing something because when you calculate  you grade yourself you end up with an A-",
              "author": "goingclassic",
              "created": 1639541810,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}