{
  "sid": "qar9qv",
  "link": "/r/college/comments/qar9qv/looking_for_advice_how_seriously_to_take/",
  "title:": "looking for advice: how \"seriously\" to take discussion questions",
  "text": "[Context: returning after time off and I'm really out of the rhythm of things.] \n\nSo we all eventually make the fun, \"smarter-not-harder\" discovery that not everybody does all or all of the readings or takes everything as seriously as those of us who were hopeless, earnest nerds did in high school... in a similar vein, how formally should one answer discussion questions? Or at least, what's the norm?\n\nIn one of my classes I've been a certain degree of Few Fucks Given™️— conversational tone, snarky reference to Wilde trials, semi-frequent Pratchett quotes in the footnotes, etc.— but that's fairly in keeping with expectations: Prof: \"They're personal reflections so I don't see how y'all *could* plagiarize, but don't.\" I've been amusing myself with my responses and it seems to have been fine, but it definitely wasn't my MO in the past. (I do actually give a damn. If it had turned out not to be okay, I'd've stopped amusing myself and written \"proper\" responses.) \n\nI just started another and the questions feel less informal. Thoughts?\n\nIf it's relevant, the new course is an intro and nearly all my classmates are first years/new to the discipline, which is my minor.\n\n(I'm on mobile, apologies for any formatting/spelling issues.)\n\n\nEDIT: I am a nerd. Insofar as I am poking fun at nerds, I am poking fun at my own tendency to overdo it. And \"no fucks given\" is to the tune of \"presenting my ideas in ways I find entertaining\", not \"lets see how much can I half- or even quarter-ass assignments.\"",
  "author": "cripslocking",
  "created": 1634577521,
  "updated": 1634654675,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hh5h81x": {
      "link": "/r/college/comments/qar9qv/looking_for_advice_how_seriously_to_take/hh5h81x/",
      "text": "It really depends on the rubric for the discussions, and the type of student your talking about. \n\nI’ve found that those who don’t give a damn about their grades evidently show it in their posts. They’re usually poor, grammatically incorrect regurgitations of class notes.\n\nI’d probably be the person you’d be making fun. I try to maintain an academic tone within my posts, support certain explanations with evidence when needed, cite, etc. My posts on average also exceed 600 words. \n\nBut whether I may get labeled a “try hard” or not, I don’t care. Discussion posts are free grade boosters. I’ve gotten 100 on every discussion posts for every class. Meanwhile, the average grade tends to be in the high to low 70s.\n\nMy philosophy is to take the easy grades where you can get them. Because if you fail a major exam or something, those discussion posts can boost your overall grade which can make a big difference even if if it is just a point or two.",
      "author": "kizeltine",
      "created": 1634588855,
      "upvotes": 2,
      "replies": {
        "hh6ctwz": {
          "link": "/r/college/comments/qar9qv/looking_for_advice_how_seriously_to_take/hh6ctwz/",
          "text": "Thanks. I do love an easy grade. Fairly sure we're being graded for, like, a. handing them in and b. putting in any actual effort whatsoever instead of just overtly half-assing them. I actually love discussion and I have frequently been given, uh, stern word limits (lol). These aren't posted to a main discussion board for other students to see, alas— if they were I wouldn't be asking here—, but go straight to the prof. \n\n&#x200B;\n\nAlso— damn. I was poking fun at myself: I am a nerd, have always been a nerd, and anticipate ceasing to be a nerd no sooner than the day I last draw breath (if then). \n\nThat said, my freshman year I took an upper-level lecture course with a discussion section and \\~300 plus (dense) pages of reading a week, and discovered literally the week before exams that not one of my classmates (all older) had been reading every single page and taking *quite* such detailed notes for discussion.... and I realized I could dial it back a bit and possibly get a bit more sleep. *Could* being the operative word; I'm actually pretty bad at \"trying easy\", and given the chance to take the course again I'm not sure I'd change much.\n\n\"No fucks given\" is 100%, absolutely referring to *how* I frame my ideas. I absolutely *do* give a damn about the quality thereof. (For that one other class, I'm amusing myself with snarky allusions to media I consume for fun— it could just as easily be the West Wing/19th C. US Lit/Ted Lasso/Mountain Goats lyrics— but I'm doing it in service of my point, never just doing it for the sake of doing it.)\n\nIf any of that makes sense. I just don't want to be overly... stuffy? Professional™️? Wearing a metaphorical suit to class every day when I don't have to?\n\nI'm sorry for not being clear in the original post (and hope I'm clearer here); I'm having a chronic illness flare and didn't proof the original.",
          "author": "cripslocking",
          "created": 1634603996,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}