{
  "sid": "r5es3e",
  "link": "/r/college/comments/r5es3e/pls_reply/",
  "title:": "Pls reply!",
  "text": "This is for a math act assignment \nI would need about 3 people to reply!:\n\nJust answer this question: how do you utilize math in your job?\n\nTHANK YOU!\n\ni couldn’t ask anyone else because it can’t be a relative and I have zero friends and social anxiety.",
  "author": "StarWars4Ever2571",
  "created": 1638246683,
  "updated": 1638480518,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 0.63,
  "comments": {
    "hmml6at": {
      "link": "/r/college/comments/r5es3e/pls_reply/hmml6at/",
      "text": "In my job we use math as a way to analyze data and trends. We look at the slopes of process variable data to see if they are within specifications, and use statistics to determine how wide our specifications can be. We also use math equations and models to control all of the automated equipment in the manufacturing facility where I work as an engineer. If you have more questions, feel free to send me a message and I can really ramble on and on.",
      "author": "Thelton26",
      "created": 1638248229,
      "upvotes": 2,
      "replies": {
        "hmmmedj": {
          "link": "/r/college/comments/r5es3e/pls_reply/hmmmedj/",
          "text": "Thank you so much! Means a lot to me thanks for the thorough description :) and will do!",
          "author": "StarWars4Ever2571",
          "created": 1638248909,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmnawj4": {
      "link": "/r/college/comments/r5es3e/pls_reply/hmnawj4/",
      "text": "Pretty low-brow math at my workplace but I’m proud of my growing arithmetic skills. \n\nThe office side of my job entails updating price adjustments: a percentage gets decided by the boss that I have to implement in all relative documents and customer accounts. \n\nThe warehouse side of my job tends to be a little more visceral: eyeballing inventory, getting myself the correct number of pallets on-deck, making decisions about precedence of outgoing orders, and assessing labor hours im gonna need to move all these damn boxes.",
      "author": "Pipesandboners",
      "created": 1638267246,
      "upvotes": 2,
      "replies": {
        "hmpgpug": {
          "link": "/r/college/comments/r5es3e/pls_reply/hmpgpug/",
          "text": "Thank you so much!! I appreciate it a lot :)",
          "author": "StarWars4Ever2571",
          "created": 1638304325,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}