{
  "sid": "r0gvfl",
  "link": "/r/college/comments/r0gvfl/taking_care_of_your_mental_health_is_like_walking/",
  "title:": "Taking care of your mental health is like walking on eggshells",
  "text": "I'm so glad that taking care of your mental health is less stigmatized now than ever before. But at the same time, it's still so, so hard to do.\n\nOn the one hand, you can take \"off days\" to allow yourself to heal a bit. But when you come back to the work, you find yourself even more behind, causing you more stress than before. Then you find yourself needing another break, continuing the cycle.\n\nOn the other hand, you can work through the anxiety and stress from the start, which puts you on track or slightly ahead with the content, leaving you more room to take care of yourself.\n\n&#x200B;\n\nI find myself flip flopping between these two states, which is just so hard. Every time I take a \"wrong break,\" I end up ruining my mental health more. And when I don't recognize that working through the pain makes matters worse, it's hard to reverse.\n\n&#x200B;\n\nWhat on earth does one do? I feel like the underlying issue here is bad habits.",
  "author": "International-Band52",
  "created": 1637684516,
  "updated": 1637688973,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 0.67,
  "comments": {
    "hls8i8m": {
      "link": "/r/college/comments/r0gvfl/taking_care_of_your_mental_health_is_like_walking/hls8i8m/",
      "text": "Look for a balance between the two. Instead of taking entire days off, set aside time each day to get enough sleep, spend one hour exercising, and one hour doing relaxing things before bed (that hour can include getting ready for bed, such as brushing your teeth, etc).\n\nTo be able to do those things takes good time management - working on course work ahead of time and not letting it build up. Time management is a skill that needs to be learned through practice - so don't expect perfection at first, instead look at making improvements and getting better. \n\nRemember the key is to find balance. Don't aim for \"perfect\" days. Don't let a day be \"ruined\" because you wasted an hour or two - just get back on track and make good use of the rest of the day.",
      "author": "Violet_Plum_Tea",
      "created": 1637685058,
      "upvotes": 1,
      "replies": {}
    }
  }
}