{
  "sid": "qnax34",
  "link": "/r/college/comments/qnax34/electric_bill/",
  "title:": "Electric bill",
  "text": "I live in an apartment downtown with one other roommate. Our electric bill, since May when we moved in, had steadily been $90-100. I figured this was a pretty decent price considering that we have to keep a loft air conditioned 24/7 and we are both on our computers/at our computers for most of the day. I got an email today with the new bill that is due December 1st and the amount is $190 lol. This makes absolutely zero sense. This past month we have had the A/C turned off for around 2 weeks, and I’m sure that our energy usage from electronics/lights have not changed THAT drastically. Just seems a bit ridiculous and our bill shot up 100 extra dollars. Not really looking for a solution but just was curious to see what your guys electric bills are and if you are in a similar situation as me… oh and fuck my electric company.",
  "author": "gmoneybaby666",
  "created": 1636118212,
  "updated": 1636137011,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hjeuzh1": {
      "link": "/r/college/comments/qnax34/electric_bill/hjeuzh1/",
      "text": "My guess:\n\nMost electric meters cannot be checked remotely, and some electric companies do not manually read every meter every month. They estimate usage based on the same month the previous year and bill based on that. When they finally got around to reading the physical meter, they may have found that the energy used over those months was more than they estimated and the meter has in fact advanced much farther, so they billed for the difference all at once. If I'm right, that means for the first few months you were basically paying based on the previous occupants' typical power usage, and in reality you and your roommate use more electricity. Again, if I am right, the good news is that the extra $100 is not just for one month, but is for your cumulative overage for 5 months total.",
      "author": "qthistory",
      "created": 1636118968,
      "upvotes": 2,
      "replies": {
        "hjevczm": {
          "link": "/r/college/comments/qnax34/electric_bill/hjevczm/",
          "text": "I guess I’ll just have to see what it amounts to after this month which I’m sure won’t be pretty. There’s a huge window the size of a wall and it gets cold super quick so I’m sure we’ll have to keep the heat on.",
          "author": "gmoneybaby666",
          "created": 1636119145,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hjf1n17": {
      "link": "/r/college/comments/qnax34/electric_bill/hjf1n17/",
      "text": "If I recall correctly, when it starts to get cold everyone’s electric bills get higher in apartments. Depending on your state, it’s illegal for utility companies to turn off your services once it gets cold so … maybe they’re everyones bill to offset that ?",
      "author": "SadCover1304",
      "created": 1636121912,
      "upvotes": 2,
      "replies": {}
    },
    "hjewzab": {
      "link": "/r/college/comments/qnax34/electric_bill/hjewzab/",
      "text": "Check your bills see if previous bills were estimated readings and then you recently had an actual reading. This will cause you to get a large bill all of a sudden. Their estimates were lower than your actual usage",
      "author": "Concerned-23",
      "created": 1636119877,
      "upvotes": 1,
      "replies": {}
    }
  }
}