{
  "sid": "pwtt58",
  "link": "/r/college/comments/pwtt58/offering_brownies_to_the_faculty/",
  "title:": "Offering Brownies to the Faculty",
  "text": "Tomorrow, a group of students, including me, from our Major will represent the department in a college event. The event is targeted towards freshmen and we decided to bake some brownies to welcome them. \n\nThe idea is to leave some of them to the Faculty office for the Professors. But there is one Professor (students love him) that due to the pandemic stays usually in class to avoid contact. \n\nWould it be weird to leave some brownies in the classroom for him to find them once he enters?",
  "author": "AngiePan98",
  "created": 1632786795,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hekihdb": {
      "link": "/r/college/comments/pwtt58/offering_brownies_to_the_faculty/hekihdb/",
      "text": "Thank you guys! Of course they will be in an airtight container because I don't think he will eat them otherwise. \n\nWell no one said anything about food and the pandemic I hope we won't face any problems.",
      "author": "AngiePan98",
      "created": 1632813666,
      "upvotes": 1,
      "replies": {}
    },
    "hejqtvp": {
      "link": "/r/college/comments/pwtt58/offering_brownies_to_the_faculty/hejqtvp/",
      "text": "It’s usually not a good idea to trust an unattended plate of brownies on a university campus. It’s a sweet gesture, though!",
      "author": "PhDapper",
      "created": 1632796203,
      "upvotes": 3,
      "replies": {}
    },
    "hejqq9c": {
      "link": "/r/college/comments/pwtt58/offering_brownies_to_the_faculty/hejqq9c/",
      "text": "Not at all! (Leave a note, too, obviously, so he’s not just like “why is there an abandoned plate of brownies here clearly this is some sort of trap.”) It’s a sweet gesture, pun retroactively intended, and I’m sure he’ll appreciate that you thought of him.\n\nEdit: typo",
      "author": "themathymaestro",
      "created": 1632796153,
      "upvotes": 2,
      "replies": {}
    },
    "hej8hgf": {
      "link": "/r/college/comments/pwtt58/offering_brownies_to_the_faculty/hej8hgf/",
      "text": "My college has said no homemade treats at university sponsored/affiliated events because of the pandemic.",
      "author": "FamousCow",
      "created": 1632787734,
      "upvotes": 3,
      "replies": {}
    }
  },
  "updated": 1634051755
}