{
  "sid": "rigsr8",
  "link": "/r/college/comments/rigsr8/to_major_in_foreign_language_do_i_have_to_have/",
  "title:": "to major in foreign language, do i have to have some knowledge of the language beforehand?",
  "text": "i want to be a foreign languages major (spanish) and minor in japanese. the only thing though is that i don’t speak either, is it still possible?",
  "author": "tiredboyz",
  "created": 1639745569,
  "updated": 1639787367,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hoxmkgg": {
      "link": "/r/college/comments/rigsr8/to_major_in_foreign_language_do_i_have_to_have/hoxmkgg/",
      "text": "Yes, it is possible. Colleges teach languages partially for this reason. Not everyone had access to all the languages they wanted to learn in high school or access to good teachers. \n\nMost likely anyone interested in Japanese has had no previous experience with the language. Spanish/French/German are the only languages most colleges could reliably expect US at least some students to potentially have knowledge of.",
      "author": "DrAlawyn",
      "created": 1639757909,
      "upvotes": 5,
      "replies": {}
    },
    "hoxr2ss": {
      "link": "/r/college/comments/rigsr8/to_major_in_foreign_language_do_i_have_to_have/hoxr2ss/",
      "text": "I don't think that would be super unusual; in classics we had to do 3-4 years of classical languages and none of us had experience with those. What would likely happen is you'd just have to knock out intro and intermediate classes while doing your gen eds and then pack in your other major requirements once you had the foundation for the language.",
      "author": "torgoboi",
      "created": 1639759616,
      "upvotes": 4,
      "replies": {}
    },
    "hoy7nlf": {
      "link": "/r/college/comments/rigsr8/to_major_in_foreign_language_do_i_have_to_have/hoy7nlf/",
      "text": "As someone with a Japanese language minor, I learned Japanese during high school, so I had prior knowledge before going to college. That being said, a lot of people I know started only when they came in to college and are able to fulfill all the requirements to have that minor. So yes, it is possible.",
      "author": "tofurific",
      "created": 1639765955,
      "upvotes": 2,
      "replies": {}
    }
  }
}