{
  "sid": "r0wfwb",
  "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/",
  "title:": "Normalize gap semesters",
  "text": "If I didn’t take a gap semester I’d be dead right now.  But I’m not, I’m alive and I’m going back to school.  I’m not a dropout or failure or pregnant or any of that offensive shit people say, I just took a break and now I’m going back.  Fuck everyone else’s idea of how I’m supposed to do college I’m a whole adult now man",
  "author": "awholelottahooplah",
  "created": 1637728287,
  "updated": 1638206989,
  "over_18": false,
  "upvotes": 671,
  "upvote_ratio": 0.95,
  "comments": {
    "hlvmq9b": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlvmq9b/",
      "text": "I think more so than \"normalizing\" it for other people, it would be nice if scholarships didn't mind it.",
      "author": "Ace0136",
      "created": 1637741697,
      "upvotes": 397,
      "replies": {
        "hlwgm86": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwgm86/",
          "text": "This is the big one",
          "author": "Flamennight",
          "created": 1637762763,
          "upvotes": 87,
          "replies": {}
        },
        "hlwixtx": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwixtx/",
          "text": "^ I took a gap year during COVID my junior year and no longer qualified for a lot of scholarships because I wasn’t enrolled in classes\n\nI’m a senior now but paying everything out of pocket as I didn’t qualify for scholarships. Fortunately, I worked during my gap year and can afford it but gap semesters/year are very tough if you rely on scholarships a lot",
          "author": "LieutenantCurly",
          "created": 1637763874,
          "upvotes": 81,
          "replies": {}
        },
        "hlx8zhd": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlx8zhd/",
          "text": "After covid started my school started making their four year scholarships not expire for five years, meaning there was room for 2 gap semesters. This was a great way to get new students in an uncertain time, but a bad deal for students enrolled before fall 2020.",
          "author": "anonymous_gam",
          "created": 1637774564,
          "upvotes": 13,
          "replies": {}
        },
        "hlx3tuz": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlx3tuz/",
          "text": "Great point, I didn't consider that.",
          "author": "BohemianJack",
          "created": 1637772546,
          "upvotes": 11,
          "replies": {}
        },
        "hlz4pmf": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlz4pmf/",
          "text": "I was diagnosed with multiple sclerosis and took a semester off when I had extreme stomach pain and began vomiting blood. Before I left, I made sure this wouldn't hurt my scholarship because it was for a disability related reason. When I returned I had special permission to take less classes and still be considered full time status to get the benefits of a full time student and also specifically so my scholarship would require less credits per semester to be completed. Well, the next semester began and I lost my scholarship. They told me that having less credits required for disability reasons does actually hurt my scholarship and that they had no clue who told me that, and said to appeal it. I went through the appeal process, filling out forms and writing an essay and getting a doctor's note, and it was approved! For a week. The scholarship committee emailed me a week later saying they made a mistake and it wasn't approved after all because I took time off the previous semester. I fucking hate universities and I cannot wait to graduate and move on from this stage of life. Fuck you, Stephanie, you wasted my time and now I'm paying for stuff out of pocket.",
          "author": "bubblegumpandabear",
          "created": 1637802290,
          "upvotes": 6,
          "replies": {}
        },
        "hlwxl9g": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwxl9g/",
          "text": "Talk to financial aid, sometimes they can help with that. My brother has scholarships to a big name university and he’s already deferred two years and still has hos scholarships because he discussed it with financial aid beforehand.",
          "author": "WingsofRain",
          "created": 1637770066,
          "upvotes": 12,
          "replies": {}
        },
        "hly4l12": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly4l12/",
          "text": "Yeah I get it there are definitely institutional constraints that are out of our control, I was meaning more attitude.  Sorry",
          "author": "awholelottahooplah",
          "created": 1637786948,
          "upvotes": 2,
          "replies": {}
        },
        "hlz9kg4": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlz9kg4/",
          "text": "this as well though!!",
          "author": "No-Cause8939",
          "created": 1637804452,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlwn4qh": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwn4qh/",
      "text": "My gap semester lasted 11 years. \n\nFor better or worse, I'm a \"non-traditional\" student now. I actually think it works in my favor because when I write papers or answer discussion questions, I have more experience to draw off of and just generally sound more intelligent than my peers. I also chose a major that I never would have the first time around. So I will have better job security than I probably would have had I finished all those years ago. The stakes are higher too, so I care A LOT more about my grades and looking as good as possible for prospective employers. \n\nBut then again, I earned minimum wage/entry level salary for a decade so there's a tradeoff.",
      "author": "kellyalltogether",
      "created": 1637765745,
      "upvotes": 37,
      "replies": {}
    },
    "hlw88h7": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlw88h7/",
      "text": "How was it? I really really want to take a break, but I think I’ll never want to go back to school.",
      "author": "UchihaClan_Fav",
      "created": 1637758257,
      "upvotes": 19,
      "replies": {
        "hlwu0qh": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwu0qh/",
          "text": "My mom is afraid of me taking a gap year for this reason.",
          "author": "TheRapidTrailblazer",
          "created": 1637768621,
          "upvotes": 17,
          "replies": {}
        },
        "hlwllob": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwllob/",
          "text": "The last Uchiha, in college.",
          "author": "itzjustal",
          "created": 1637765082,
          "upvotes": 4,
          "replies": {}
        },
        "hlxoqkb": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlxoqkb/",
          "text": "If you never want to go back to school then whatever else youre doing must be working for you. My gap only lasted 2 years because I was miserable in a minimum wage job and knew that that and only that would be my future if I didnt go back to school",
          "author": "taybay462",
          "created": 1637780686,
          "upvotes": 4,
          "replies": {}
        },
        "hly4vcd": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly4vcd/",
          "text": "Hey, if you take a break and don’t want to go back, don’t.  Do what will make you happy.  If that means doing something other than college that is fine.  If that means finishing college that’s great.  A gap semester will help you see what you really want, and college isn’t for everyone.  It is for me and now im happy going back!",
          "author": "awholelottahooplah",
          "created": 1637787060,
          "upvotes": 2,
          "replies": {}
        },
        "hly5dtv": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly5dtv/",
          "text": "Oh also it was really great!  I took a few weeks where I did near nothing to “come down”, then I went to a psychiatric partial hospitalization program and got myself sorted medically/on good meds with good doctors, and now that I’m feeling better my motivation is rushing back!  I started a part time job after a month, am starting several new independent projects/hobbies, and am very excited to go back to school! :)",
          "author": "awholelottahooplah",
          "created": 1637787263,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlvdpc0": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlvdpc0/",
      "text": "> Fuck everyone else’s idea of how I’m supposed to do college I’m a whole adult now man\n\nNo one needs to \"normalize gap semesters\". What needs to be normalized is the realization that everyone's living their own lives, and no one really gives a shit how you go about living yours.",
      "author": "BarackTrudeau",
      "created": 1637735289,
      "upvotes": 130,
      "replies": {
        "hlvf10r": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlvf10r/",
          "text": "Annoyingly it tends to be adults who look down on gap terms. My advisor gave me so much trouble about not graduating neatly in 4 years when I needed an extra semester rather than cram. Kept going off on me about it and I could see advisors like him being annoying about gap terms.",
          "author": "intl-uni-help-please",
          "created": 1637736144,
          "upvotes": 35,
          "replies": {
            "hlwl9ta": {
              "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwl9ta/",
              "text": "I hate this perspective, but it’s not always because of the advisor themselves. Some institutions have shitty setups for their staff where they’re penalized for students taking longer than four years to graduate. Load of crap if you ask me. Take a semester off if you need to! (I just wish our financial aid system wasn’t so shitty about this either. Loan grace periods go away, scholarships and grants lost…it’s not what’s best for the student.)",
              "author": "trustmeiknowthings",
              "created": 1637764933,
              "upvotes": 17,
              "replies": {
                "hlwx4mf": {
                  "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwx4mf/",
                  "text": "Yeah, I figured they have dept requirements of a success rate, but it really irked me because I was a transfer student and also he gets mad and yells a lot if things dont work out lol. If he was nicely encouraging it I wouldn't feel the pressure.",
                  "author": "intl-uni-help-please",
                  "created": 1637769879,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "hlwmxt5": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwmxt5/",
          "text": "Except scholarship providers 😔",
          "author": "AbstractCuriosity",
          "created": 1637765664,
          "upvotes": 5,
          "replies": {}
        },
        "hlwnkch": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwnkch/",
          "text": "Everyone wants everything to be \"normalized.\" It's just a buzzy catchphrase now. \n\nI agree. I don't give a shit if what I do is \"normal.\" Normalize not caring about whether something is normal or not, and just focus on what is right for your life.",
          "author": "kellyalltogether",
          "created": 1637765925,
          "upvotes": 13,
          "replies": {}
        },
        "hly4ot5": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly4ot5/",
          "text": "Idk I’m anxious man 😢",
          "author": "awholelottahooplah",
          "created": 1637786989,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlw8yv0": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlw8yv0/",
      "text": "I've done the same thing. Although my gap semester was like 20 semesters. \n\nWho says those offensive things? I've never heard anybody ever say anything like that to me, even after I told them I had dropped out. \n\nI feel like you've got a lot invested in other people's ideas without realizing that they don't necessarily exist. People don't have a negative attitude towards that shit, unless they are overbearing parents. If you have overbearing parents, tell them to fuck right off.\n\nPart of being an adult is taking care of yourself. It's your life and nobody else is playing it. Nobody is saying bad things about drop outs. If they are, you've found the fast track to identifying dick heads. I just generally feel like the general consensus on that stuff isn't negative, unless someone is trying to be an asshole. \n\nAs a working adult, I 'normalized' quitting jobs and taking time off. Between my girlfriend and I, we've both done it. One person supports both of us while the other takes a break. It's great! I highly suggest it.",
      "author": "Awkward_Mail_2786",
      "created": 1637758686,
      "upvotes": 34,
      "replies": {
        "hly54i1": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly54i1/",
          "text": "It’s hard sometimes to be unable to not care about other peoples opinions.  I really want to boldly be “myself” but other peoples perception of me matters, so stereotypes about dropping out after a gap year really effected me and I think it shouldn’t be joked about anymore you know, it’s harmful",
          "author": "awholelottahooplah",
          "created": 1637787159,
          "upvotes": 0,
          "replies": {
            "hly8qtr": {
              "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly8qtr/",
              "text": "Let's be VERY clear here. Your perception of other people's perception is unknown. You do not know anything about what they are thinking unless it's explicitly told to you. Don't get caught up making assumptions about others feelings towards a subject when you do not know them. \n\nIt's a dangerous game to get caught up in, and most people do at some point or another. \n\nWhat you really care about is how you think people think about you. Realize that the key there is how YOU think they feel, not how they feel. It's how YOU think they feel. It's not that you care about their opinions, considering you do not know them, it's that you care about what you *think* is their opinion. \n\nUnless you 100% know what they are thinking to the point you'd put your life on the line to prove, it's not worth taking your time worrying about those things. People don't think what you think they do. Their thought process will be more in line of what YOU are thinking about people in the same situation. Do you think dropping out makes you a piece of garbage? No. Then why in the hell would anybody else?!",
              "author": "Awkward_Mail_2786",
              "created": 1637788597,
              "upvotes": 3,
              "replies": {
                "hlyclks": {
                  "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlyclks/",
                  "text": "Dude it’s not that deep why are you so upset",
                  "author": "awholelottahooplah",
                  "created": 1637790159,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hlwqaic": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwqaic/",
      "text": "My gap year was the best thing I’ve ever done, especially since I got more normal college and luckily did it over when COVID first started",
      "author": "Morc-Glork",
      "created": 1637767084,
      "upvotes": 10,
      "replies": {}
    },
    "hlvz7kv": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlvz7kv/",
      "text": "Dude sometimes you just have to take a break... Worst case scenario if anyone asks what you were doing during that semester where you weren't taking classes and not doing an internship tell them you've got an idea for a book and that you were trying to write it or a play or something or you were researching some kind of project you had gotten the idea for therefore that while it didn't end as you would have hoped that it was worthwhile or you learned to play the guitar or you wrote a book of poetry or something it doesn't have to be published it's just you did that during that semester you took off so it's like you were being productive but but you weren't in academia at that moment that kind of thing is respectable enough. Oh you took us a Semester off because you were writing a book OK, And academically you're still eligible to attend courses so then you go back to school after that when in reality you may have just been working and chilling Is recharging your batteries so you could finish your degree without stressing or anything... But if you need to take a semester off take a semester off Do what you need to do do take care good luck",
      "author": "pygmypuffonacid",
      "created": 1637752001,
      "upvotes": 6,
      "replies": {
        "hly5nz5": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly5nz5/",
          "text": "Often times I find I don’t even have to lie about how productive I was in my gap, I feel like I was super productive cuz I was actively working on myself emotionally and my better state made me able to pursue hobbies/jobs/projects again!  Even if at first going on a break you feel it’ll be a waste on some level, if you’re focused on improving you will and that’s worth something.  It’s so worthwhile and needs to be standard.  I definitely couldn’t have actively worked on my emotional/mental state if I was distracted by ANYTHING else, it’s seriously exhausting work.  It’s like changing your brain chemistry.  The gap saved me, outpatient therapy + school + work wasn’t working",
          "author": "awholelottahooplah",
          "created": 1637787374,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlwmfhe": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwmfhe/",
      "text": "If it didn’t screw up financial aid sometimes I’d agree more",
      "author": "kryppla",
      "created": 1637765446,
      "upvotes": 6,
      "replies": {
        "hly65va": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly65va/",
          "text": "It screwed me up a little bit but luckily I only owed them like $200 (I was interning this semester and only had a $600 fee that financial aid covered, so I only owed back like 33% = $200).  If I had done a traditional 10k school semester I would’ve owed like 3k and been fucked :/ best case is probably to finish each semester and plan a gap semester instead of dropping partway, I think that prevents a lot of consequences.  At least at my school, they’re really good with non traditional students",
          "author": "awholelottahooplah",
          "created": 1637787571,
          "upvotes": 1,
          "replies": {
            "hlybl7d": {
              "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlybl7d/",
              "text": "My son would have lost his scholarship and not been able to get it back if he didn’t stay in school.  Anyone dependent on something like that just doesn’t have a choice.  I’m glad it worked out for you it should be an option for everyone.",
              "author": "kryppla",
              "created": 1637789750,
              "upvotes": 1,
              "replies": {
                "hlycoxl": {
                  "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlycoxl/",
                  "text": "Yes that’s horrible I totally agree.  Bad on his school for holding finance over his head like that",
                  "author": "awholelottahooplah",
                  "created": 1637790196,
                  "upvotes": 1,
                  "replies": {
                    "hlydmkx": {
                      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlydmkx/",
                      "text": "It’s everywhere.  It’s the system.",
                      "author": "kryppla",
                      "created": 1637790565,
                      "upvotes": 1,
                      "replies": {
                        "hlyhmtt": {
                          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlyhmtt/",
                          "text": "I agree with you it’s fucked up",
                          "author": "awholelottahooplah",
                          "created": 1637792141,
                          "upvotes": 2,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hlwy4m0": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwy4m0/",
      "text": "[deleted]",
      "author": null,
      "created": 1637770283,
      "upvotes": 8,
      "replies": {
        "hly6cd0": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly6cd0/",
          "text": "Hell yeah dude that’s the way to do it.  Save up money and educate yourself whether that be by interning or doing independent projects/learning, and you’re set no one will question it",
          "author": "awholelottahooplah",
          "created": 1637787640,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlvcarr": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlvcarr/",
      "text": "You do you brotha",
      "author": "gooters14",
      "created": 1637734405,
      "upvotes": 27,
      "replies": {}
    },
    "hlwvusm": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwvusm/",
      "text": "Its just called summer to other people. I always just said I was taking my summer early, or late. The 2 times I took gap semesters were before or after summer classes anyways.",
      "author": "bitetheboxer",
      "created": 1637769362,
      "upvotes": 5,
      "replies": {
        "hly6f3o": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly6f3o/",
          "text": "In my school my undergrad is 5 years with no summer lol.  So I don’t get a summer",
          "author": "awholelottahooplah",
          "created": 1637787670,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlwuwtw": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwuwtw/",
      "text": "About to take a gap quarter myself. Just wrapped up my Associates, went back this quarter to realize I needed a break. Gotta let the brain rest sometimes, and you are on your own timeline!",
      "author": "BrianWaters247",
      "created": 1637768982,
      "upvotes": 4,
      "replies": {}
    },
    "hlw3pzx": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlw3pzx/",
      "text": "Just out of curiosity, what did you do for that semester? I promise I'm not trying to be rude or pushy, just curious if you worked a retail job, explored majors, travelled? Did you go back home or keep living on your own?\n\nI'm glad it's helped you and sounds like you're much more prepared to keep pushing forward and succeed, I'm just curious what you did with the time so others can learn from it.",
      "author": "Thelton26",
      "created": 1637755296,
      "upvotes": 7,
      "replies": {
        "hly6yfg": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly6yfg/",
          "text": "I described in detail what I did in [this comment](https://www.reddit.com/r/college/comments/r0wfwb/normalize_gap_semesters/hly5dtv/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3), let me know if I can explain anything else (esp in DMs I can get more specific)\n\nI’m a really big advocate for taking control of your life.  Working on your mental state requires full devotion, no jobs no stress just focusing on changing your behaviors.  This is called DBT therapy and it’s developed for people with BPD but works for everyone to help understand your struggles and how to solve them basically.  That is worthwhile of a break in my opinion\n\nOther than that do some freelancing/independent projects or learning related to your career goals and no one will question the value of your break",
          "author": "awholelottahooplah",
          "created": 1637787885,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlwyr4o": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwyr4o/",
      "text": "My cousin's taking a gap semester right now. He's staying with my mom in Dubai because apparently everyone goes to her to wind down nowadays",
      "author": "EddaValkyrie",
      "created": 1637770535,
      "upvotes": 3,
      "replies": {}
    },
    "hlx03xk": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlx03xk/",
      "text": "On one RN ✌️",
      "author": "anon8403",
      "created": 1637771080,
      "upvotes": 3,
      "replies": {}
    },
    "hlx3365": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlx3365/",
      "text": "The problem is its hard getting back into it. You get a job to pay bills, whatever you're dealing with is still happening, etc. The longer you take off the harder it is to get back in.\n\nBut I genuinely agree. This year I had my niece and brother pass away and it really fucked with me. Im glad the semester is over but I did myself a disservice by pushing through, it was a rough semester.\n\nI ended up going because this is my second round trying to get my bachelor's and I didn't want to fall into the pattern in the first paragraph above. I know way too many people who didn't finish their degree because of one thing or another and they never went back and that's a huge regret of theirs.\n\nI agree with you 100%, but there is a risk involved.",
      "author": "BohemianJack",
      "created": 1637772251,
      "upvotes": 3,
      "replies": {
        "hly7tzm": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly7tzm/",
          "text": "Yeah honestly I won’t say it’s easy, but it’s certainly worth it if you can take a break",
          "author": "awholelottahooplah",
          "created": 1637788234,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlx4k0x": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlx4k0x/",
      "text": "Also normalize taking less credits if you think you can't handle the full course. I graduated last year, took half a year break and went back to take the prerequisites for masters. I'm only taking two classes per semester and it helped my mental health tremendously. Before that I was always anxious thinking about assignments, tests, and exams all the time. Two classes per semester seems more doable for me.",
      "author": "American_GrizzlyBear",
      "created": 1637772831,
      "upvotes": 3,
      "replies": {
        "hlycfwu": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlycfwu/",
          "text": "Yes!!",
          "author": "awholelottahooplah",
          "created": 1637790098,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hlxdij6": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlxdij6/",
      "text": "I am feeling the same way about this fall semester that I didn't enroll in. Now my parents and the student loan company is up my ass. God I wish I could just live my life how I feel ya know. Like it's 1 semester, I haven't started riding the rails across the country and doing hardcore drugs like geeez give me some credit.",
      "author": "Darth_waffle_iron",
      "created": 1637776322,
      "upvotes": 3,
      "replies": {}
    },
    "hlxdj8g": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlxdj8g/",
      "text": "same!",
      "author": "deyniejh",
      "created": 1637776331,
      "upvotes": 3,
      "replies": {}
    },
    "hlwo258": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwo258/",
      "text": "I took a gap semester after my fiancé died in 2019. Now I’m set to graduate next semester. Fuck what anyone else thinks, you’re doing great!",
      "author": "_OhayoSayonara_",
      "created": 1637766135,
      "upvotes": 7,
      "replies": {}
    },
    "hlw6vq3": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlw6vq3/",
      "text": "I like this attitude",
      "author": "fighterofthenightmxn",
      "created": 1637757413,
      "upvotes": 3,
      "replies": {}
    },
    "hlx0e32": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlx0e32/",
      "text": "can’t take a gap semester when you have a job.",
      "author": "WavyCucumbers",
      "created": 1637771188,
      "upvotes": 2,
      "replies": {
        "hly7buu": {
          "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly7buu/",
          "text": "That really sucks.  I could with my job but it’s a Fortune 500 so they’re more “progressive” and respect leaves of absense for health reasons. I hate that people can’t take time off for health reasons universally",
          "author": "awholelottahooplah",
          "created": 1637788034,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hlxkbwx": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlxkbwx/",
      "text": "Currently on my gap semester and literally nothing has been better for my mental health",
      "author": "lunarmadz",
      "created": 1637778987,
      "upvotes": 2,
      "replies": {}
    },
    "hlxmyef": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlxmyef/",
      "text": "Yeah buddy! Get that shit :)",
      "author": "Syrup_Scenery",
      "created": 1637779998,
      "upvotes": 2,
      "replies": {}
    },
    "hlxrmea": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlxrmea/",
      "text": "Taking a semester off right now. I was completely burnt out and developed a substance dependence over last year and knew I wouldn't be able to keep going without a break. I'll be going back next semester too good luck we got this",
      "author": "overly_emoti0nal",
      "created": 1637781822,
      "upvotes": 2,
      "replies": {}
    },
    "hlxtg62": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlxtg62/",
      "text": "I took a gap year right before COVID for mental health reasons. Best decision I’ve made yet, and if I needed to, I’d do it again. Luckily I was able to email my scholarship sponsor my sob story (for lack of better words) and diagnoses and they were like “you’re cool kid, pay off what you owe for dropping a class and we’ve got your back” and now I graduate in a year and a half",
      "author": "aniyuuhh",
      "created": 1637782542,
      "upvotes": 2,
      "replies": {}
    },
    "hlxveu9": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlxveu9/",
      "text": "Nobody takes a gap year and regrets it.",
      "author": "matchew566",
      "created": 1637783312,
      "upvotes": 2,
      "replies": {}
    },
    "hly4fdd": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hly4fdd/",
      "text": "Some people wont understand, and that sucks. But you know your situation the best. You have to keep firm in your head about it and not let those peoples judgment to creep in.",
      "author": "Idktbhhelpme",
      "created": 1637786886,
      "upvotes": 2,
      "replies": {}
    },
    "hlyinxh": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlyinxh/",
      "text": "Burn out is real af. It’s bad for your mental and physical health.",
      "author": "PsychologicalWave332",
      "created": 1637792551,
      "upvotes": 2,
      "replies": {}
    },
    "hlwlnog": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlwlnog/",
      "text": "No one asked! If it works for you so be it!",
      "author": "johnsmith069069",
      "created": 1637765107,
      "upvotes": -2,
      "replies": {}
    },
    "hlyl8rt": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlyl8rt/",
      "text": "[removed]",
      "author": null,
      "created": 1637793618,
      "upvotes": 1,
      "replies": {}
    },
    "hlz39ac": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlz39ac/",
      "text": "I needed a gap year and was pushed through for undergrad.\n\n My first cousin dropped out for a year (minimum) but since he was moving from a branch campus to main campus so naturally he just lost contact with people.\n\nin my case, I was pushed through and graduated in 5 years. now I am forced to clean up my act and finish what I started (I took technically 2 years off post grad). So my minors in business and computers are now retaking math and getting coding I missed and accounting for my cpa license as I need the cpa for work.\n\nits hard as I have to admit and clean up and its going to be easy 2-3 years before I am in grad school as I needed the cpa as well.",
      "author": "enoughstreet",
      "created": 1637801629,
      "upvotes": 1,
      "replies": {}
    },
    "hlz9hi9": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hlz9hi9/",
      "text": "I’m taking one next year so I completely agree. Gap semesters are seen so negatively and it’s awful like am i not suppose to be happy with MY life? I honestly don’t understand the logic behind it at all.",
      "author": "No-Cause8939",
      "created": 1637804415,
      "upvotes": 1,
      "replies": {}
    },
    "hm28aod": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hm28aod/",
      "text": "Financial aid should work like this:\n\nYou have 6 years to graduate, maybe more if you have extenuating circumstances outside of your control. The government will pay for your college if you graduate within this time frame. Fail to graduate, and the government will bill you to make up for the money it \"wasted\" on you, so there's no financial incentive for the government or university to bend over backward so you graduate (if you don't earn a passing grade, the government won't care if the professor subsequently assigns a below-passing grade.)",
      "author": "Comprehensive-Ad3963",
      "created": 1637864632,
      "upvotes": 1,
      "replies": {}
    },
    "hm62uj8": {
      "link": "/r/college/comments/r0wfwb/normalize_gap_semesters/hm62uj8/",
      "text": "they ARE normal dude what? I know hella people that did them, get out of ur own head",
      "author": "KIDPESOO",
      "created": 1637943970,
      "upvotes": 0,
      "replies": {}
    }
  }
}