{
  "sid": "qdt0ex",
  "link": "/r/college/comments/qdt0ex/how_long_do_college_credits_last_for/",
  "title:": "how long do college credits last for",
  "text": "I’m taking Calc 2, Physics 1, and a computer science class now. I am also in the military and may need to take time off for college if I get activated. Will be gone for around a year at most. So how long do credits last for? Do I have to retake any classes if I am gone from school that long? And I have to take Linear Algebra after Calc 2. Let’s say I finish Calc 2 this semester and I don’t take Linear Algebra next semester right away instead I wait a few semesters. If Calc 2 credit still counts I should be good to take Linear Algebra?",
  "author": "Prestigious_Union521",
  "created": 1634945326,
  "updated": 1635184657,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 0.86,
  "comments": {
    "hhooy0q": {
      "link": "/r/college/comments/qdt0ex/how_long_do_college_credits_last_for/hhooy0q/",
      "text": "I’m gonna play this safe and say that it depends on the school so you may want to ask. A few places I’ve been to say that math and science credits are good for 10 years whereas others say that they’re good for 4.",
      "author": "SnooDrawings9348",
      "created": 1634947280,
      "upvotes": 6,
      "replies": {
        "hhop1e8": {
          "link": "/r/college/comments/qdt0ex/how_long_do_college_credits_last_for/hhop1e8/",
          "text": "Gotcha. I’ll definitely as the director of my program and see what he has to say. Thanks",
          "author": "Prestigious_Union521",
          "created": 1634947330,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hhoqe6j": {
      "link": "/r/college/comments/qdt0ex/how_long_do_college_credits_last_for/hhoqe6j/",
      "text": "Lifetime for my school",
      "author": "No-Heart-5871",
      "created": 1634948021,
      "upvotes": 3,
      "replies": {
        "hhq78sq": {
          "link": "/r/college/comments/qdt0ex/how_long_do_college_credits_last_for/hhq78sq/",
          "text": "Yeahhhhh. I have credits applying to my graduation requirements that are close to 15 yars old.",
          "author": "MrFancyBlueJeans",
          "created": 1634983872,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hhoqzhw": {
      "link": "/r/college/comments/qdt0ex/how_long_do_college_credits_last_for/hhoqzhw/",
      "text": "Depends on your school, mine last for 5",
      "author": "Casual-Economist",
      "created": 1634948320,
      "upvotes": 2,
      "replies": {}
    },
    "hhpmpbf": {
      "link": "/r/college/comments/qdt0ex/how_long_do_college_credits_last_for/hhpmpbf/",
      "text": "Check with some veteran center at your school or maybe you plt sgt./ chain of command. Upon activation you get many perks that can hold your position. \n\nIn the civilian world, they last 8 years. \n\nI am military, too. Took time off college to go through basic and AIT and am in reserves. I also am in my 6th year as I decided to take a year off, come back part time, and am here full time now. \n\nI KNOW the 8 year, but military may offer the added perk of deployment forgiveness like they do with jobs.",
      "author": "guy_with-thumbs",
      "created": 1634966134,
      "upvotes": 2,
      "replies": {}
    }
  }
}