{
  "sid": "r62hr4",
  "link": "/r/college/comments/r62hr4/i_feel_like_im_drowning/",
  "title:": "I feel like I'm drowning",
  "text": "I stopped around Mid-August to prepare for College here in FL - currently only taking 2 classes because that's all I can take for pre-requisites, I already had some college credits in advance thanks to AICE classes in high school.\n\nI stopped working back in August because I am a person who needs a lot of time to relax and feel calm and easily is overwhelmed and stressed out. I can take a heavy load of work/college or school at once (like I did in my senior year of high school with 5 AICE classes online which I passed all), but I CANNOT handle both work AND school or college at the same time.\n\nThe reason for this being is that either one have a specific schedule which is large, but isn't large enough for me to always be on edge, so I was able to efficiently balance how often to take breaks and when to work on things.\n\nWith both work and college together however you have two not-so-big schedule eaters, both they're both large enough combined that on average most college students have literally less than 2 days off. I am NOT a robot, I need at least 2-3 days off, one day, and specially less than one day is simply not enough for me, I'll be too busy in that short period of time being worried about returning or eating it up studying/trying to complete to-do tasks before I realize I have to prep again for another busy day.\n\nI have recently started this week for the first time with work and college (4 days of work from 2PM-8PM on average), and 2 days of college with an online class in the morning and an in-campus class about 2hrs away from home at the campus.\n\nI can't take it, but I need to make the money to help out with the rent. I obviously just don't wanna only work 2 days or 3 days (and that would probably cost me my position as it's not a good look), and the job on itself isn't hard from my first impressions - but I just can't take this routine. It's just simply too much. The week has just started recently and I already feel like I am going to blow up.\n\nI genuinely need some advice with this. If you need more details on my job or something before giving advice please DM me. But I just need to know how to properly balance this, and I'm even more scared for the next semester when I'll have probably 3-4 classes thrown at me at once.\n\nI want to have time to do my homework, I want to have time to relax, I want to have time to go out, I want to have time to speak with my boyfriend, but now there isn't even enough time for me to properly study or do my homework.",
  "author": "SumnSu",
  "created": 1638320674,
  "updated": 1638480453,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}