{
  "sid": "r60g0r",
  "link": "/r/college/comments/r60g0r/discovered_that_my_college_isnt_offering_my_next/",
  "title:": "Discovered that my college isn’t offering my next Arabic course for me to graduate on time",
  "text": "Hi all! I don’t know if this is the right place to post but I’m getting a little desperate. I attend Bellevue College and normally every winter quarter they offer the second Arabic course. This is the first winter they’ve opted not to, and I need to take second and third level Arabic to graduate in spring. I intend to transfer to the University of Washington where, for my degree path, I will need three quarters of a language. I’m pursuing a competitive major so I can’t afford to transfer without the language credit. I can’t find any other community colleges that offer Arabic, and it’s too late in the game to take classes at a bigger state school. Does anyone know any accredited online colleges or something I can do to take second and third level Arabic to graduate? I’ve been looking but I can’t find anyone who offers it. Admissions for my program are only in fall, so if I don’t graduate on time I’m delayed over a year and I have worked way too hard to be delayed that long.",
  "author": "Averiella",
  "created": 1638314681,
  "updated": 1639849050,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmqhgub": {
      "link": "/r/college/comments/r60g0r/discovered_that_my_college_isnt_offering_my_next/hmqhgub/",
      "text": "Have you tried checking universities that offer Arabic courses online so you transfer the credit to your current college? Not just community colleges, I mean. I study in Canada so I don’t know if that’s something the 4 year you want to transfer to accepts.",
      "author": "MMSK_",
      "created": 1638319849,
      "upvotes": 2,
      "replies": {
        "hmqhyj3": {
          "link": "/r/college/comments/r60g0r/discovered_that_my_college_isnt_offering_my_next/hmqhyj3/",
          "text": "Big universities have already had their admissions come and go. Online based schools, like the university of Phoenix, have much more flexible admission dates. I only just found out about the change in course offering so I couldn’t get admitted earlier",
          "author": "Averiella",
          "created": 1638320066,
          "upvotes": 2,
          "replies": {
            "hmramx8": {
              "link": "/r/college/comments/r60g0r/discovered_that_my_college_isnt_offering_my_next/hmramx8/",
              "text": "Maybe this one? https://extension.ucsd.edu/courses-and-programs/arabic-for-communication-i The next course starts in May, unfortunately. But they have higher Arabic courses, II, III, and so on.",
              "author": "MMSK_",
              "created": 1638333300,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hmqiveh": {
      "link": "/r/college/comments/r60g0r/discovered_that_my_college_isnt_offering_my_next/hmqiveh/",
      "text": "What about taking one spring and one over the summer? Does that work at all?",
      "author": "iloveregex",
      "created": 1638320478,
      "upvotes": 1,
      "replies": {}
    },
    "hnqgqry": {
      "link": "/r/college/comments/r60g0r/discovered_that_my_college_isnt_offering_my_next/hnqgqry/",
      "text": "If I may ask, what is ur level in Arabic and what kind of Arabic r u learning?\n\nI don't know but if u need someone to speak to in Arabic I don't mind speaking to u as I saw ur posts in the Muslims and Jewish subreddits and I am impressed by what u r doing :)\n\nDM if anything other than that good luck 😊",
      "author": "Beta87",
      "created": 1638981540,
      "upvotes": 1,
      "replies": {}
    }
  }
}