{
  "sid": "qirck8",
  "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/",
  "title:": "Mental health check, how are yall doing?",
  "text": "I dont know what it is about this week but I and pretty much everyone I know is exhausted. I would have gone home this weekend but I have 2 exams next week and its really hard to focus there, I miss my kitty so much",
  "author": "taybay462",
  "created": 1635558261,
  "updated": 1636185588,
  "over_18": false,
  "upvotes": 33,
  "upvote_ratio": 0.97,
  "comments": {
    "hildbkp": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hildbkp/",
      "text": "No friends alone on Halloween weekend Friday night and will be Saturday night",
      "author": "Thirddayidk",
      "created": 1635559501,
      "upvotes": 30,
      "replies": {
        "hilf0lc": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilf0lc/",
          "text": "I know this is super cliche advice but just talk to people. This is my method: when youre wherever you eat, in class, library, etc make a comment to someone near you. Literally anything but its easiest if its something related to school. Ask how they think they did or will do on a test or quiz, if they did the hw yet, how theyre liking the class, whatever. Step 2 ask where theyre from, their major, etc. Step 3 ask for their number so you can compare homework answers/notes/whatever. This may seem awkward but just say \"hey can I get your number so we can _____\". Then at some point text them, either have a convo or ask to hang out and study or hang out and do other things. Try to do that at least once a day (start a convo, not text the same person everyday). I met a girl and we are very close friends now, we became friends when I sat next to her in class, I asked for her number and she asked if I wanted to have lunch with her and her friends. She wouldnt have done that if I didnt initiate the conversation. Idk what it is but people dont start conversations like they used to at college, I think everyones socially awkward from quarantine and online classes. Also last week made a friend, we were both at a professors office hours and when we left at the same time I got her number to compare hw answers. If your campus is small like mine youll tend to see the same people, either in your classes or walking to the same building at the same time. Its easiest to start with those people",
          "author": "taybay462",
          "created": 1635560356,
          "upvotes": 14,
          "replies": {
            "him3w6d": {
              "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/him3w6d/",
              "text": "Thanks for the response",
              "author": "Thirddayidk",
              "created": 1635575099,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hilmef4": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilmef4/",
      "text": "My 1 credit course has been hell and the weekly assignments are due every Friday at  11:30 AM. Every good professor makes their assignments due at 11:59 PM, not in the morning!",
      "author": "Make-Believe_Macabre",
      "created": 1635564102,
      "upvotes": 7,
      "replies": {
        "hilmmcn": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilmmcn/",
          "text": "My 1 credit class is easy peasy. Attendance is 75% of the grade, there were 5 short math assignments that I did before the semester even started, and theres only like 3 other assignments spread throughout the semester",
          "author": "taybay462",
          "created": 1635564222,
          "upvotes": 1,
          "replies": {}
        },
        "hima6wo": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hima6wo/",
          "text": "There's a 1 credit class I'm signing up for next semester that will include watching 4 prerecorded lectures, posting to 4 discussion boards about said lectures, and 1 final essay reflecting on the entire experience.",
          "author": "NoDryHands",
          "created": 1635580024,
          "upvotes": 1,
          "replies": {}
        },
        "hipw0no": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hipw0no/",
          "text": "Wow, mine too! I’m taking a yoga 1.5 credit class and she throws a ton of assignments at us and I didn’t even think a 1 credit class would do that. \n\n11:30am? Can u file a complaint, who’s even awake at that time? Ridiculous",
          "author": "kittymama25",
          "created": 1635646836,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "him4cze": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/him4cze/",
      "text": "No need to suffer through the excessive length of my comment, i really just need to get this off my chest, im sorry lol.\n\nI'm a senior and have been struggling greatly w my mental health for 3 years now, had to switch to part-time bc even just taking 12 credit hours somehow leaves me drowning. I thought I finally got it under control this semester and would be able to return to full-time next semester, but its all kind of crumbling again. Havent been able to obtain my medication for about two weeks now, had to end things with my my most recent therapist, and am now trying to find a new one asap. got a call that my brother is in the fucking hospital again. he is struggling w type 1 diabetes and severe alcoholism (going on 4 years now of being in the crippling range - pint(s) of vodka a day). this is the sixth (seventh? idk im losing count) time he's had to go to the hospital since february. i was living w him for the past year while school was online (back in-person now though) and began developing trauma responses to the fruity smell of his ketones rising as he entered into ketoacidosis. Him being in the hospital at the moment i think is really the biggest thing thats fucking w me right now even though i feel mostly disconnected to his situation (this is an intentional move ive made recently to free my self of the emotional toll his condition puts on me so maybe im just lying to myself and im not \\*actually\\* disconnected at all). Rushing him to the hospital over and over and over again as he is literally on the brink of death haunts me (his blood sugar shoots up to 800 and he goes into comas). I thought living with him and having to take care of him was hell, but idk just waiting for that call that my brother is dead does not feel much better. im really pissed and scared at the same time and remembering last halloween when i had to rush home as i got a call that he was passed out on the front lawn as trick or treaters were coming by. I have two tests coming up next week, and another in ochem the following week. i have A's in all my classes rn but im struggling to study bc i cant get my self to focus and i dont have anyone to talk to about this right now bc all my friends/family have their own shit going on and like i said i am between therapists right now. and i guess im just very overwhlemed and scared that this is just the beginning of another downward spiral and that im going to once again end up losing control of my symptoms. i dont have friends in college bc i transferred which is already hard making friends as a transfer and honestly, between my classes and trying to keep up w my idiotic and over-reactive brain, i just dont have any extra time to put into making any (also ptsd induced social anxiety is a bitch that im still trying to work through). so it makes it 10x worse that i go to a huge, party, state school and have to listen to all my drunken neighbors scream and laugh blaring music and stumbling home from whatever parties theyre going to while im sitting here just doing everything i can to try and pull my self together. no hate on them, im glad theyre having fun and whatnot, it's just sometimes i just really wish i could take a break from being me and be a little more resilient like everyone else. i know i sound like (or flat-out am) throwing the biggest pity party here, im well aware of the unproductive nature of wallowing, i know no body cares and i just have to suck it up and get over it, and blah blah blah. i know all this, i have been actively working on healthy coping-skills. its just ive been trying to keep it together, but have found my self extra weak today and i just need to vent this out before i explode. other than that though, honestly, this semester has not been nearly as bad compared to previous ones, so silver linings.\n\n&#x200B;\n\nanyway, back to my sad attempt to study. i guess.\n\nthanks for making this post.\n\n&#x200B;\n\np.s. i hope you get some kitty cuddles soon! i miss my mine too <3",
      "author": "clipboardisbrown",
      "created": 1635575450,
      "upvotes": 3,
      "replies": {}
    },
    "hilp52z": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilp52z/",
      "text": "My girlfriend of 3 years left me this afternoon so pretty shitty. I have one of those headaches you get from crying too much",
      "author": "Liam8482",
      "created": 1635565555,
      "upvotes": 4,
      "replies": {
        "him3le1": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/him3le1/",
          "text": "[removed]",
          "author": null,
          "created": 1635574874,
          "upvotes": 1,
          "replies": {}
        },
        "hipw5z7": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hipw5z7/",
          "text": "I’m sorry to hear that.",
          "author": "kittymama25",
          "created": 1635646912,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hinoqqv": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hinoqqv/",
      "text": "Not well! Just finished up the problem sets for my biology exam and the actual exam is on Tuesday. On top of that I have a 12 page research paper, a four page essay reflection, and a 7 page developmental analysis due before thanksgiving. Yeah I’m not well at the moment😅😢😤",
      "author": "95xander",
      "created": 1635610578,
      "upvotes": 3,
      "replies": {
        "hj6rjhd": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj6rjhd/",
          "text": "How was the exam?? I just finished my second exam of the week and am good for a while",
          "author": "taybay462",
          "created": 1635967446,
          "upvotes": 1,
          "replies": {
            "hj6rvkd": {
              "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj6rvkd/",
              "text": "It was awful! I studied the sets just for them not to be on the exam 🥲🔫 gotta love biology!! Thanks for asking though!",
              "author": "95xander",
              "created": 1635967578,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hilf6ti": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilf6ti/",
      "text": "Vibing. Just saw the new my hero academia movie and chilling with gf.",
      "author": "LeadingYogurtcloset8",
      "created": 1635560442,
      "upvotes": 1,
      "replies": {}
    },
    "hilp2es": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilp2es/",
      "text": "My professors decided to make us do a lot of work this week so I’m really tired. No Halloween plans bc of it.\n\nI also had a math test today that I did terrible on. Did everything I could to prepare for it but some things still didn’t click with me. Not looking forward to see my score.",
      "author": "orcanio-star",
      "created": 1635565514,
      "upvotes": 1,
      "replies": {}
    },
    "hilq53k": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilq53k/",
      "text": "The past 3 weeks I have been absolutely swamped. I had multiple tests, a lot of homework due, and daily orchestra rehearsals. Went through a low period over a couple of days where I just felt down. It was partly stress, partly loneliness from spending so much time doing work alone, and partly just exhaustion . \n\nBut I got over that feeling yesterday and I’m actually feeling pretty good right now. Had a pleasant convo with a friend today and played the concert I’ve been working towards . Luckily I don’t have as much going on next week and I can breathe.",
      "author": "PrincipessaEboli",
      "created": 1635566105,
      "upvotes": 1,
      "replies": {
        "hj6rqpy": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj6rqpy/",
          "text": "I cannot imagine also doing an instrument, or sports for that matter. Mad respect.",
          "author": "taybay462",
          "created": 1635967525,
          "upvotes": 1,
          "replies": {
            "hj7ge4e": {
              "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj7ge4e/",
              "text": "Well, the instrument is my major actually so that helps the situation. Thank you though!",
              "author": "PrincipessaEboli",
              "created": 1635977108,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hilsdxu": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilsdxu/",
      "text": "Tired and burnt out. Just 5 more weeks lol",
      "author": "Kiwi_1127",
      "created": 1635567402,
      "upvotes": 1,
      "replies": {}
    },
    "hiltedw": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hiltedw/",
      "text": "Best that I felt in Years of being in college. I'm not taking any Math classes. I'm in my Degree program classes for Cyber Security at a Community College. I was already super in to Cyber Security stuff and computer related stuff so the classes are easy and basic for me. I'm getting pretty much A's in All of my classes. To be fair I'm only taking 2 classes(Due to Learning disabilities). Next semester I'm taking 3 classes because I'm doing so well. This is earliest I have ever registered for classes because I'm going to pass these ones. \n\nI hope all of you are going well. You should know you are strong and motivated as hell for going to College in a pandemic and anything else you personally experienced is going to be hopeful easier than this.\n\nYou are going to get through this even if the things you are personally going through are hard as hell. \n\nI hope everyone is fine.",
      "author": "tcbobb16",
      "created": 1635567997,
      "upvotes": 1,
      "replies": {}
    },
    "hilw3rx": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hilw3rx/",
      "text": "I’m currently remote and am the happiest I’ve been for the past two years. It’s made me realize that 90% of my mental health problems were a result of being on campus.",
      "author": "may181804",
      "created": 1635569651,
      "upvotes": 1,
      "replies": {}
    },
    "him22dr": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/him22dr/",
      "text": "[removed]",
      "author": null,
      "created": 1635573749,
      "upvotes": 1,
      "replies": {}
    },
    "hindrbe": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hindrbe/",
      "text": "I prefer to use my gadgets and laying in bed all day. I feel unmotivated to do something in life, but that's okay. I can deal with it😃",
      "author": "SnooDoggos4418",
      "created": 1635605813,
      "upvotes": 1,
      "replies": {}
    },
    "hinnc26": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hinnc26/",
      "text": "I work full time, I'm a full time student, and i'm taking care of my terminal father as he continues to progress. I think I'm alright. Sometimes the reality of my situation sets in and it sucks, but a good day is any day we're still alive.",
      "author": "ticklemejesus420",
      "created": 1635609973,
      "upvotes": 1,
      "replies": {
        "hj6s0p7": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj6s0p7/",
          "text": "Thats.. 3 full time jobs. Holy shit. I hope your father is doing as well as he can be and that hes in minimal pain. Youre doing a great thing, someday it will all be worth it and life will be more manageable",
          "author": "taybay462",
          "created": 1635967633,
          "upvotes": 2,
          "replies": {
            "hj7c9fe": {
              "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj7c9fe/",
              "text": "I hope so. It's just really tough sometimes. These last two days It's hit me hard and I'll just get emotional throughout the day, but gotta take it in strides",
              "author": "ticklemejesus420",
              "created": 1635975462,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hios3ih": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hios3ih/",
      "text": "I dropped out",
      "author": "erockson62",
      "created": 1635627312,
      "upvotes": 1,
      "replies": {}
    },
    "hios9v4": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hios9v4/",
      "text": "Not good. Lost a very close friend to suicide this week. Then two weeks ago totaled my car. Also had a terrible ear infection that put me behind in classwork while also being in a bad home environment scared I’ll be kicked out at any moment for something small like forgetting to do dishes",
      "author": "darkerthanthenight",
      "created": 1635627390,
      "upvotes": 1,
      "replies": {}
    },
    "hiot7du": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hiot7du/",
      "text": "Trying. I wish you luck.",
      "author": "Life-of-Moe",
      "created": 1635627815,
      "upvotes": 1,
      "replies": {}
    },
    "hioyyfy": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hioyyfy/",
      "text": "OMG SAME",
      "author": "jackxlawrie",
      "created": 1635630418,
      "upvotes": 1,
      "replies": {}
    },
    "hip93op": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hip93op/",
      "text": "literally awful. i’m so alone at one of the biggest party schools there is and i know nobody. i have no friends here and i miss my long distance boyfriend more than anything.",
      "author": "ricekrispiesandmilk",
      "created": 1635635255,
      "upvotes": 1,
      "replies": {
        "hj6rnvg": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj6rnvg/",
          "text": "I have some friends and I go to parties with them but it sucks because it seems everyone knows each other already. Im not a huge party person to begin with, Id rather smoke a bong around a bonfire or something like that since I dont drink that much",
          "author": "taybay462",
          "created": 1635967494,
          "upvotes": 2,
          "replies": {
            "hj6ycfa": {
              "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj6ycfa/",
              "text": "i feel the exact same girl. i am not a drinker and i feel so left out bc of it. i’m a homebody and a stoner and i need to find people more like me in that aspect",
              "author": "ricekrispiesandmilk",
              "created": 1635970080,
              "upvotes": 2,
              "replies": {
                "hj72q5m": {
                  "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj72q5m/",
                  "text": "Ahh you dont go to a small state school in upstate NY do you?",
                  "author": "taybay462",
                  "created": 1635971753,
                  "upvotes": 1,
                  "replies": {
                    "hj8gp0g": {
                      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj8gp0g/",
                      "text": "sadly no😭😭",
                      "author": "ricekrispiesandmilk",
                      "created": 1635993100,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hipkrgj": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hipkrgj/",
      "text": "Tired. Full time job is killing me",
      "author": "depressedbuttermilk",
      "created": 1635641115,
      "upvotes": 1,
      "replies": {}
    },
    "hipwkne": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hipwkne/",
      "text": "Well someone at my school just committed suicide so...we’re all having a rough time as a community",
      "author": "Fubb1",
      "created": 1635647124,
      "upvotes": 1,
      "replies": {}
    },
    "hiq3pp5": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hiq3pp5/",
      "text": "I’m on duty all weekend as an RA for Halloween… how do you think I’m doing 🤧",
      "author": "TwelveBrute04",
      "created": 1635651017,
      "upvotes": 1,
      "replies": {
        "hj6s3fk": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj6s3fk/",
          "text": "Hahah how was it? Any notable shenanigans?",
          "author": "taybay462",
          "created": 1635967663,
          "upvotes": 2,
          "replies": {
            "hj947tr": {
              "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj947tr/",
              "text": "Oddly enough, not much just 1 house party (the campus owns some houses) and a couple minor things\n\nMost people went off campus where they’re not my problem!",
              "author": "TwelveBrute04",
              "created": 1636007670,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hiq8w1m": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hiq8w1m/",
      "text": "Lonely, exhausted, and ready to cry",
      "author": "karatecoconut",
      "created": 1635654139,
      "upvotes": 1,
      "replies": {}
    },
    "hiqmtu1": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hiqmtu1/",
      "text": "My friends only ask me if they want something from me (photography mostly) and don't ever include me when they go out, been heavily depressed staying in my room 24/7 failing all my classes. I'm not even anti-social, just the school I go too doesn't have any way for me to do things I like (film, music) and its just affected my mental to the point where I can't even bring myself to the cafeteria to eat. Going to transfer, but I don't even know if things will get better :[",
      "author": "TopOfTheMeta",
      "created": 1635664835,
      "upvotes": 1,
      "replies": {}
    },
    "hiu9gal": {
      "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hiu9gal/",
      "text": "Not good.",
      "author": "Warren-Binder",
      "created": 1635734006,
      "upvotes": 1,
      "replies": {
        "hj6s49q": {
          "link": "/r/college/comments/qirck8/mental_health_check_how_are_yall_doing/hj6s49q/",
          "text": "Keep chuggin along",
          "author": "taybay462",
          "created": 1635967672,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}