{
  "sid": "qp65ck",
  "link": "/r/college/comments/qp65ck/any_other_statistics_majors_here_feel_like_they/",
  "title:": "Any other statistics majors here feel like they are learning the same shit every semester?",
  "text": "Stats major here. I’ve been feeling kinda meh about this major. The classes are somewhat interesting but I just feel like I’m doing math for the sake of math with no application. Prove this theory, or use this formula, do this computation by hand, feels so repetitive in content too. I’ve learned hypothesis testing so damn much. We’re still using t table sheets from ap stats in my regression class. Overall just feels like such a boring major sometimes. It’s interesting at times but I’m not learning a lot of new things every semester it seems.",
  "author": "veeeerain",
  "created": 1636346339,
  "updated": 1636655482,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hjt7uql": {
      "link": "/r/college/comments/qp65ck/any_other_statistics_majors_here_feel_like_they/hjt7uql/",
      "text": "I thought stat was going to be a great major to pair up with my cs major. I have realized it's quite dry af (especially mathematical stat) and I decided to switch to math instead. No regrets switching to math cuz had I sticked to stat, I would have to take another hypothesis testing class bs. \n\nThere are few intereting areas in stat, such as financial stat, stochastic processes and probability theory but you can still take them even with very little stat knowledge anyways. \n\nIf you do consider a change, talk to ur advisors and see if they have any applied math program.",
      "author": "owlwaves",
      "created": 1636384442,
      "upvotes": 2,
      "replies": {
        "hjt9gtd": {
          "link": "/r/college/comments/qp65ck/any_other_statistics_majors_here_feel_like_they/hjt9gtd/",
          "text": "Yeah man. I’m considering a math minor now. The three topics you listed are pretty interesting to me, and honestly require more mathematical rigor than anything. Im gonna talk to my advisor",
          "author": "veeeerain",
          "created": 1636385135,
          "upvotes": 2,
          "replies": {
            "hjtaixd": {
              "link": "/r/college/comments/qp65ck/any_other_statistics_majors_here_feel_like_they/hjtaixd/",
              "text": "Yeah, even if u decided to go for a PhD in stat, mathematical rigor is far more important than stat (said by my TA who is a stat PhD student). For example, without measure theory(especially sigma algebra), it is basically impossible to have a deeper understanding of probability and mathematical stat. \n\nTake real analysis in ur undergrad if u can! Most stat undergrads who want to apply for grad school are taking it because it is so important.",
              "author": "owlwaves",
              "created": 1636385589,
              "upvotes": 2,
              "replies": {
                "hjtdidv": {
                  "link": "/r/college/comments/qp65ck/any_other_statistics_majors_here_feel_like_they/hjtdidv/",
                  "text": "Yeah, I’m taking real analysis in my major. However we only take the first part of the sequence instead of both.",
                  "author": "veeeerain",
                  "created": 1636386821,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hju2gcu": {
      "link": "/r/college/comments/qp65ck/any_other_statistics_majors_here_feel_like_they/hju2gcu/",
      "text": "I feel like I am not learning much. We are halfway done with the semester and my Professor hasn't given us 1 quiz yet. How is he grading us, I have no idea",
      "author": "TragicalKingdom",
      "created": 1636396829,
      "upvotes": 2,
      "replies": {}
    }
  }
}