{
  "sid": "qxccwu",
  "link": "/r/college/comments/qxccwu/matter_of_life_or_death/",
  "title:": "Matter Of Life or Death",
  "text": "I am currently in an extremely pivotal point of my life. I find myself in a situation where if I fail, I will face such a huge setback that might just push me towards commiting suicide. But if I succeed, it might also just propel me towards having a very fulfilling life. I cannot give the whole context of my situation but want to share the main issue that will eventually decide the final outcome of my situation for which I needed some advice and suggestions.\n\nSo, I currently have a course in my semester that I cannot fail no matter what. It might look trivial but in reality failing in this course is actually going to set me back in life by YEARS.\n\nOut of 100% grade of the course, 65% has been graded. I missed 25% worth of assignments and have only been able to score 26.5% yet. Out of the 35% left, I am supposed to score 23.5% which due to strict marking is actually very hard to achieve but will still try my best.\n\nSo to get myself out of this situation, I am trying to figure out some extreme ways to somehow have my 25% worth of assignments (3 in total) graded which were due almost 50 days ago and wanted some suggestions. \n\nI am thinking of making a special presentation for my professor to view showing how important is passing in this course for me and how I am working hard for the rest of the assignments and then requesting him to grade my old assignments. \n\nI just want to do something special and extreme that might cause the professor to grade my assignments.\n\nWhat could be some extreme ways that you guys can think of that I might use to persuade my professor to mark those assignments?",
  "author": "knoxmr",
  "created": 1637312956,
  "updated": 1639856837,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hl91k19": {
      "link": "/r/college/comments/qxccwu/matter_of_life_or_death/hl91k19/",
      "text": "I’m sorry but if this course is so important how come you missed 25 percent of the assignments? If something happened ( illness or family death) I’m sure you can let your professor know about it and work out something. 50 days is a very long time, I don’t know if your professor will be impressed by a presentation about how important it is to you when you missed the assignments and then waited almost two months to do something about it. All you can do is study your ass of and ace the remaining assignments. If the syllabus states that he doesn’t grade late assignments no matter what, he will not give you a pass.",
      "author": "Dry-Razzmatazz8352",
      "created": 1637327685,
      "upvotes": 7,
      "replies": {}
    },
    "hl93bld": {
      "link": "/r/college/comments/qxccwu/matter_of_life_or_death/hl93bld/",
      "text": "How will failing a single course set you back years",
      "author": "Spicybooiii",
      "created": 1637328617,
      "upvotes": 5,
      "replies": {}
    },
    "hl9lctv": {
      "link": "/r/college/comments/qxccwu/matter_of_life_or_death/hl9lctv/",
      "text": "Seems like you're in a ramped up emotional state and not seeing the situation clearly. You're not going to pass this class. Anything dramatic or \"extreme\" you might present to your professor is only going to annoy them. People fail classes all the time. It's not a big deal. Retake the class, or not, and try to have better study skills next term.",
      "author": "trunkNotNose",
      "created": 1637336760,
      "upvotes": 4,
      "replies": {}
    },
    "hl9uqle": {
      "link": "/r/college/comments/qxccwu/matter_of_life_or_death/hl9uqle/",
      "text": "First, get your social supports set up. Talk to your therapist, parents, everyone. Don't fucking commit suicide over a class.\n\n>So, I currently have a course in my semester that I cannot fail no matter what. It might look trivial but in reality failing in this course is actually going to set me back in life by YEARS.\n\nI'm assuming your talking about a class required to graduate, or something for something for grad school or like a practicum. \n\nThere's always a second option; Retaking class, other things in lieu, whatever. It might cost more or lose you a semester, but life fucking happens. Talk to the academic advisor, figure out plans B and C and D.\n\n>So to get myself out of this situation, I am trying to figure out some extreme ways to somehow have my 25% worth of assignments (3 in total) graded which were due almost 50 days ago and wanted some suggestions. \n\nThey were due 2 months ago. \n\nYour professor will not be swayed by whatever you do.\n\nYour lucky if they give you 5% at this point.\n\nThe much more reasonable idea rn is take a medical withdrawal due to depression or whatever reason caused you to take 2 months to finish the project. This loses you the cost of the class but keeps your GPA. \n\nThen retake it next term and petition for whatever is needed to keep you on the current path your so scared of losing.\n\nLook, tons of people fail or drop a class. Shit happens. Most transcripts have some I fucked up moment. \n\nIt happens. It's not a failure on your part. This is the equivalent of rear ending someone in an ice storm, it happened, it sucked, you sorta fucked up but also outside situations heavily heavily contributed. And virtually everyone has that situation eventually. Deal with it, deal with yourself and try again once the roads are better.\n\nTLDR:\n\n* Call therapist, family, set up supports.\n* Call academic advisor.\n* Probably medically withdraw or figure out other solution.\n* Work on whatever the second issue was, like grad school.\n* Repeat class or do additional work.\n* Take care of yourself.",
      "author": "adhdeedee",
      "created": 1637340495,
      "upvotes": 2,
      "replies": {
        "hlhocot": {
          "link": "/r/college/comments/qxccwu/matter_of_life_or_death/hlhocot/",
          "text": "I really appreciate you taking the time to write this. Thank You Very Much for the advice. I have something planned and now it seems more likely that I'll pass only if I somehow put the action in that is required.",
          "author": "knoxmr",
          "created": 1637485768,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}