{
  "sid": "q5f7b7",
  "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/",
  "title:": "Do I drop a class or potentially fail it?",
  "text": "Hello! \n\nHere’s a little bit of context, in high school I was always the type to put little to no effort and pretty much get A’s all the time. I know boo me. But now that I’ve stepped into the world of college wow does this technique not work. Currently studying in Biopharma and have a biochem midterm coming up worth a whopping 50% of my grade and oh man can I tell that I’m going to get mauled. I’ve learned my lesson and will absolutely change my ways of studying in the future. But for now my dilemma is, knowing that I will probably fail this exam and potentially the class, should I keep it and destroy my soon to be GPA, or do I drop it? I will have a meeting with the person in charge of this depending on how the midterm goes for definitive answers but as for now I would love to have some insight to help my mental.\n\nThanks to everyone!",
  "author": "Character_Lunch2730",
  "created": 1633895074,
  "updated": 1634083042,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.84,
  "comments": {
    "hg53w69": {
      "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/hg53w69/",
      "text": "Whats the withdraw deadline? If its after the test I would take the test then determine like you said. If you fail the test then drop the class.",
      "author": "GoldRequest",
      "created": 1633895383,
      "upvotes": 2,
      "replies": {
        "hg54kva": {
          "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/hg54kva/",
          "text": "Yes it’s way after the midterm. My current plan right now is to study as much as possible and do as best as I can but I don’t have much hope",
          "author": "Character_Lunch2730",
          "created": 1633895661,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg573ui": {
      "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/hg573ui/",
      "text": "Your situation is pretty common. Those who passed with ease in high school come to college to realize they’re average students. That’s because high school is too easy and disks to prepare students for the high expectations and demands of college. \n\nMy advice is study now and try your best on the exam. Go to office hours, the tutoring center, and use outside resources like videos, etc. If you fail, do what the other person suggested and drop the class. Retake it another semester or over the summer. \n\nBetter to try and conquer the exam before withdrawing and never knowing what you could’ve gotten on it.",
      "author": "kizeltine",
      "created": 1633896648,
      "upvotes": 2,
      "replies": {
        "hg57nk0": {
          "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/hg57nk0/",
          "text": "Indeed will try my best with what I can do currently. Thank you very much!",
          "author": "Character_Lunch2730",
          "created": 1633896859,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg57p87": {
      "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/hg57p87/",
      "text": "If you have time before the deadline definitely take the test, but a withdrawal always looks better than an F",
      "author": "GraphicGallery",
      "created": 1633896878,
      "upvotes": 2,
      "replies": {}
    },
    "hg65jpw": {
      "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/hg65jpw/",
      "text": "Try doing a little planning and figure out what future grades on quizzes/exams you would need to pass.  You can usually find the weighted percentages of each category in their syllabus. Also, make sure you know the deadline for the last day to drop a class. Once this date passes, you’re screwed. I had to drop a class this semester. My professor seemed to enjoy killing GPAs and her grading system would have never allowed me to recover. If you see yourself passing, stick it out. If not, don’t be afraid to drop.",
      "author": "Full-snack-5689",
      "created": 1633911974,
      "upvotes": 2,
      "replies": {
        "hg6chce": {
          "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/hg6chce/",
          "text": "Yeah I legit only have 2 exams that are both worth 50%…. So basically you mess one up and ur screwed…. What a class. Plus they’re all computerized multiple choice questions. Talk about lazy easy correction for the prof. I for one hate multiple choice, let me bs my way to the answer. Either way thank you very much!",
          "author": "Character_Lunch2730",
          "created": 1633915387,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hg7jz9b": {
      "link": "/r/college/comments/q5f7b7/do_i_drop_a_class_or_potentially_fail_it/hg7jz9b/",
      "text": "Does your college do pass/no pass? I did terribly in my first math class in college and switched to pass/no pass to save my gpa (plus if you get finical aid you don’t wanna drop below full time enrollment). Once you switch to pass/no pass you can decide to continue going to the class or put the effort elsewhere. Good luck!",
      "author": "CrispyMulch",
      "created": 1633943732,
      "upvotes": 2,
      "replies": {}
    }
  }
}