{
  "sid": "rgsnu9",
  "link": "/r/college/comments/rgsnu9/on_the_brink_of_being_kicked_out/",
  "title:": "On the brink of being kicked out",
  "text": "I have not been doing well in college really ever since I’ve gotten there two years ago. I am near being kicked out and to be honest I’m scared on one end but another end of me is barely interested in it like I do what to earn a degree and move on but except for a few health and life class I’ve taken I’ve either failed or done mediocrely in most others. I feel like I’m trying to keep a front up for my parents and family and I hate it so much. I’m so lost and do not know what to do anymore I feel like I’m letting my life slip away and I am just lost",
  "author": "Stunning-Airline195",
  "created": 1639549973,
  "updated": 1639787925,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "hom70b4": {
      "link": "/r/college/comments/rgsnu9/on_the_brink_of_being_kicked_out/hom70b4/",
      "text": "you only have one lifetime as you, you might as well say fuck it and do what makes you happy. it’s your life, it’s your happiness, it’s your despair. you have the power to choose, don’t let anyone tell you any different.\n\nsending you good vibes :)))",
      "author": "rowandaspam",
      "created": 1639550631,
      "upvotes": 2,
      "replies": {
        "hom77yl": {
          "link": "/r/college/comments/rgsnu9/on_the_brink_of_being_kicked_out/hom77yl/",
          "text": "I’m currently working as a pharmacy technician and working towards certification so I’m doing something it’s just I’ve not been in the right headspace and also work is hectic",
          "author": "Stunning-Airline195",
          "created": 1639550777,
          "upvotes": 1,
          "replies": {
            "hom7e9l": {
              "link": "/r/college/comments/rgsnu9/on_the_brink_of_being_kicked_out/hom7e9l/",
              "text": "actually i just applied to be a pharmacy tech! small world, are you enjoying it? also do you have anything that you like to do for relaxation, self care, anything that takes ur mind off the world for a while?? that can extremely help with the lost and lonely feeling",
              "author": "rowandaspam",
              "created": 1639550899,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hom7ult": {
      "link": "/r/college/comments/rgsnu9/on_the_brink_of_being_kicked_out/hom7ult/",
      "text": "For the first question it’s a pretty good job. Just beware of the workload and the people both customers and coworkers but this varies by location. My pharmacy is really busy so what I’ve mentioned is up to it’s extremes but it’s a good job and it’s always room for advancement. \n       When I’m not working I’m really into music and love playing bass guitar. I also like to listen to history videos as well as ones on anthropology.",
      "author": "Stunning-Airline195",
      "created": 1639551220,
      "upvotes": 1,
      "replies": {}
    }
  }
}