{
  "sid": "msbjld",
  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/",
  "title:": "Why are college courses so fast paced?",
  "text": "I feel like I’m wasting my time with my classes because despite finding them all so interesting, I can never fully grasp contents before moving on, which leads to frustration and me questioning if I’m interested in the subject at all. \n\nI feel like I started college “behind” my peers despite being top of my high school (a bit of imposter syndrome, a bit of the realization that my high school just sucked..). Are others able to keep up? I’m frustrated because I want to LEARN. but I find it so difficult with the pace. \n\nTips appreciated.",
  "author": "depressingthot",
  "created": 1618604271,
  "over_18": false,
  "upvotes": 1022,
  "upvote_ratio": 0.98,
  "comments": {
    "hd8wpzi": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/hd8wpzi/",
      "text": "Nobody here answered *why* it's so fast paced. I'd happily tack on an extra month to each semester if it didn't mean having to instantly master a concept every lecture.",
      "author": "sleepy_scav",
      "created": 1631908641,
      "upvotes": 2,
      "replies": {
        "hdirdir": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/hdirdir/",
          "text": "oh true —- seems impossible and counterproductive to me lol",
          "author": "depressingthot",
          "created": 1632090762,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gvcx12k": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gvcx12k/",
      "text": "Some recommendations:\n\n1. Do a time audit for everything you are spending time on in your life. Work, school, family time, health, daily commute, etc. You may realize that you are trying to allocate more time than you actually have in a day. Seriously consider if the places you are spending the most time actually deserve the time you are giving them. Separate in class time, hw/quiz/assignment time, and study time. Make sure that you are dedicating some time to studying every day so you dont forget what you went over in class.\n2. If you are doing a bunch of extracurriculars, consider just focusing on the most important one until you can steady your academics.\n3. Get enough sleep, exercise, eat healthy, and stay hydrated. Sound body, sound mind. \n4. Explore different note taking and study methods. I realized that taking notes DURING class time was more distracting for me than helpful so I just listened, asked and answered questions during class and used outside class time (before the class) to skim over the slides or book and bullet point the most important concepts and equations. Try a study method for a week or two and see how well it works for you, if it doesnt, change it. \n5. Try to find an external source of information that works for you. You professors teaching style might not work for you. See if there is a blog or youtube channel that explains your coursework better than your professor does.",
      "author": "gagegirl1o1",
      "created": 1619032772,
      "upvotes": 1,
      "replies": {}
    },
    "guxhflz": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guxhflz/",
      "text": "If you need time to study during the summer you can get the books and learn at home and then register for those classes in Fall. \n\nReason is that 120 credits or so are too much. Maybe this many credits shouldn't be needed for bachelor degree, since major credits are only 40 to 45.",
      "author": "Easygoing98",
      "created": 1618713996,
      "upvotes": 1,
      "replies": {}
    },
    "guw6mbi": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guw6mbi/",
      "text": "  \\[Academic\\] If you've been grocery shopping, I'd like to record your experiences in this survey. It's not long I swear! https://forms.gle/rQxdYfrkf358Muv57",
      "author": "crix10",
      "created": 1618689779,
      "upvotes": 1,
      "replies": {}
    },
    "guvkgwc": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guvkgwc/",
      "text": "I hate how the tldr of these comments is \" study more outside of class\" like man why does school take away from havinf a life outside of class.......I wish everything just happened in class bc we're there for a lot of our day anyway and then the rest of the day we have to ourselves. to live and do things we want. 😕",
      "author": "sabrinaaddict",
      "created": 1618680115,
      "upvotes": 1,
      "replies": {}
    },
    "guuyvva": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guuyvva/",
      "text": "A semester is like 5 months long, it takes forever if you ask me. The summer courses are the ones that feel and are fast pace.",
      "author": "talex625",
      "created": 1618672237,
      "upvotes": 1,
      "replies": {}
    },
    "guubbc6": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guubbc6/",
      "text": "Tips: The first thing is to expect to spend three hours of work per credit hour every week. You might have already been told this, but if not I want to bring it up first because it is crucial for me. If one class is 3 credits, you should be spending around 9 hours every week during that class. Additionally, one of the things that’s helped me is first taking notes from all of the lectures and readings, and then a few days later go back and annotate the notes so that you can ask questions about things you don’t understand or things you want to know more about. After this, go find some sources that answer your questions and add those in to your original notes. One thing that helps me to retain information is to process it in a visual way. Every week I pick one small topic from each class and make the information into a mind map or chart. I save all of these in a binder and it has been LIFE CHANGING. Finally, if you’re just starting your degree program it’s okay to not know everything! I graduate this semester and am only now just realizing the sheer scope of what I have retained. \n\nOh! Save your notes from your degree-specific classes. I’ve saved all of my notes from my classes and since I’m going to grad school I’ve been compiling all of my notes into a big book of foundational knowledge relevant to my field. It’s absolutely surreal how much shit I’ve learned. \n\nGood luck! I hoped that helped!",
      "author": "HighlyPolitical16",
      "created": 1618662664,
      "upvotes": 2,
      "replies": {}
    },
    "guuaf33": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guuaf33/",
      "text": "The mistake you made is that you expected to learn something in college. In my experience anyway college isn't there to learn anything, it's there to teach you how to just get by in life and in the end you hopefully end up with a shiny piece of paper.\n\nI swear almost no one in my college actually cares about teaching people. 9 out of 10 of them are just tenured teachers that need to do just enough to get by and don't really care what grade you get or how much you learn.",
      "author": "-__-_-___-_-__-",
      "created": 1618662298,
      "upvotes": -1,
      "replies": {}
    },
    "guu6uju": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guu6uju/",
      "text": "I felt a lot of my classes were too slow, to be honest. Was really annoying to spend a couple weeks just on the first law of thermodynamics.",
      "author": "OoglieBooglie93",
      "created": 1618660807,
      "upvotes": 0,
      "replies": {}
    },
    "guu3z2z": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guu3z2z/",
      "text": "I think about this so much. I feel like I’m barely learning anything! I do the assignments and get the grades but I have no time to actually grasp the content. I’m paying a lot for my education and it sucks that I feel like I’m barely being educated at this point, it’s way too fast!",
      "author": "dreamer0303",
      "created": 1618659542,
      "upvotes": 1,
      "replies": {}
    },
    "guu3jts": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guu3jts/",
      "text": "I am a professor and I sympathize. Things are going to feel fast and the other commenters are absolutely right that you need to put in time outside of class. There also may be university tutors (free!) who can help you figure out how to spend that time. I have many students in your situation, especially during the pandemic. Some of them spend no time at all outside of class working on the material--their only out of class time is on assignments. That's usually a mistake but I sympathize because many students are working part or even full-time jobs. When I went to university I had a library job that let me do homework in the slow moments (which was pretty much every moment), so I was pretty lucky, but I did put in lots and lots of out of class time. I think many of my classmates did as well and maybe that was more of an expectation in the 90s? I also may have had more challenging high school than what my students experience today--hard to tell. In any case it can feel that the deck is stacked against you, but there are steps you can take: 1) talk to professors 2) get a tutor 3) up your study time once you ask your profs and your tutors how to use that time.",
      "author": "raspberry-squirrel",
      "created": 1618659341,
      "upvotes": 2,
      "replies": {}
    },
    "gutp6t7": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutp6t7/",
      "text": "Yoo 😭 I thought I was the only one!",
      "author": "galacticgirl66",
      "created": 1618652049,
      "upvotes": 0,
      "replies": {}
    },
    "gutnwzc": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutnwzc/",
      "text": "I like your username",
      "author": "IIF34RII",
      "created": 1618651155,
      "upvotes": 1,
      "replies": {
        "gutny61": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutny61/",
          "text": "thank u :)",
          "author": "depressingthot",
          "created": 1618651180,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gutmkew": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutmkew/",
      "text": "For me it's really an issue of professors not pacing the class properly. I feel like I have weeks where I have a dozen major assignments due and then a week of absolutely nothing from anyone. Not a single class I'm in feels like it goes at a steady pace.",
      "author": "OFS_Razgriz",
      "created": 1618650193,
      "upvotes": 1,
      "replies": {}
    },
    "gutk2wd": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutk2wd/",
      "text": "I learned time\nManagement and using 4 colored highlighters as well as a tape\nRecorder for more fast paced classes. When my eyes were friend I would put the recording of class in and play it as I napped. It worked wonders. Now you can use apps like notability that record the class while taking notes. On playback it shows what you were writing at the time of the recording. Super cool. \n\nThe key is being prepared for class so\nWhat you hear sticks, reviewing after class so you memorize important points. Review your notes.",
      "author": "jetclimb",
      "created": 1618648228,
      "upvotes": 1,
      "replies": {}
    },
    "guti8p6": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guti8p6/",
      "text": "BECAUSE ITS A SCAM",
      "author": "legalalyen",
      "created": 1618646686,
      "upvotes": 0,
      "replies": {}
    },
    "guth798": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guth798/",
      "text": "Read and try to understand thw general material BEFORE class. During class try to get an answer to your open questions. After class review with fellow students or by yourself to fill in the gaps. If all this fails contact the teacher and ask them those specific questions that you didn’t get yet. Teachers are more helpful if you have specific questions instead of saying you don’t understand a whole topic. \n\nAnd yes, there will be many times other people seem quicker etc. But don’t compare. If you you need two weeks to grasp a concept, then you need two weeks. Don’t cut yourself or others short for not being as quick as the rest. College is for yourself, no need to make it about others.",
      "author": "MistAlp",
      "created": 1618645662,
      "upvotes": 2,
      "replies": {}
    },
    "gutebvy": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutebvy/",
      "text": "Honestly, a big part of it is that a lot of fields have advanced a LOT since the degree was created, so over time the material has been condensed and piled on. Much of the time is devoted to \"catching up\" from the foundational knowledge. \n\nA lot of larger fields, like biology, could afford to be split up in to more specific categories but many people do not know exactly where within those fields they want to go so.. it's a bit of a catch 22.",
      "author": "BulkBrewFrenchPress",
      "created": 1618642985,
      "upvotes": 1,
      "replies": {}
    },
    "guta7b1": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guta7b1/",
      "text": "College courses are fast paced because topics are broad, and in-class time is generally short, especially with 300-400 level classes that don't have recitations.\n\nSpend time reviewing the material, doing the reading, do extra practice problems, etc.  It is not uncommon to have that imposter feeling when you went from being a big fish in a little pond, to a large lake full of huge fish.  I was probably similar to you, breezed through high school and the first bit of college barely trying, but as topics got more complex, it got harder.\n\nThe other thing I will mention is use all of the resources provided.  If there are TA's, use them.  Go to their office hours, email them for assistance if you don't understand something, that is what they are there for.  When I was a TA, I was always surprised how few students would attend TA office hours (probably at most 10% on any given week, and there was at least 50-60% that I never saw, ever).  Most TA's I worked with in graduate school enjoyed interacting with students and helping, and for me, it was a nice break from the research I was doing and actually interacting with people (and feeling smart again).",
      "author": "guammm17",
      "created": 1618639505,
      "upvotes": 3,
      "replies": {}
    },
    "gut7fu5": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut7fu5/",
      "text": "I felt semesters were aptly paced, likely because I rarely took more than 12 crdt hours per full semester, and only worked part time. I didn't finish my bachelor degree, and several years later, I transferred to the university I currently attend. I chose the online program instead of in person for several reasons, namely saving on gas and mileage, and neurological conditions I have. What I didn't know is that it's an *accelerated* online program, and there's no condensing. A full 14 week semester every six weeks is way. Too. Much. I used to visit campus every few weeks to touch base with my counselor and use the library, and that helped a lot. It's still closed, but thankfully the coffee shop across the street from my apartment is open now, so that's great for a change of pace when I'm losing my mind.\n\n\nSo yeah...14 weeks' worth of reading, writing, Ted talks, Zoom meetings, lectures, and \"classroom interaction\" in six weeks is completely unrealistic. Honestly, it weren't for student loans and the fact that I'm so close to the end, I'd have dropped out at the start of the pandemic.",
      "author": "CarouselAmbra81",
      "created": 1618637300,
      "upvotes": 2,
      "replies": {}
    },
    "gut6t3c": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut6t3c/",
      "text": "I wonder if the two semester format is the best way for people to learn.",
      "author": "Twenty_Four_Hours",
      "created": 1618636815,
      "upvotes": 0,
      "replies": {}
    },
    "gut30a5": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut30a5/",
      "text": "When you’re struggling and thinking if others are too, answer is always yes. #1 thing I’ve learned in college is ask for help. I came in from never studying in high school and still getting As and Bs. Got the physics and calculus and in came the Cs. Thankfully i had a new girlfriend who whipped me into shape and told me to go to tutoring, and it was the best thing I ever did. Just getting that extra help and putting in time and work gave me immediate results. I also don’t time how much i study/do work, i kinda just do it until I feel comfortable with the topic. I’ve gone from C+ and an audit in Calc 1 and 2 to A’s in Calc 3 and differential equations.",
      "author": "Xodusss",
      "created": 1618634057,
      "upvotes": 3,
      "replies": {}
    },
    "gut1hhv": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1hhv/",
      "text": "Attend every lecture. Read/do every assignment. Talk to your professor after lecture and during office hours (not sure how this works during covid). Do your own research on the topic, start with a simple google search or wikipedia. Follow the syllabus so you know about the topic before the lecture and can ask your questions during class. Don't procrastinate. Do this for every class and you're looking at a high gpa and a strong work ethic that will let you do anything you set your mind to. Good luck my friend!",
      "author": "snowtato",
      "created": 1618633017,
      "upvotes": 4,
      "replies": {}
    },
    "gut04bg": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut04bg/",
      "text": "THANK YOU. I literally member have time to take my math notes.",
      "author": "Bakio-bay",
      "created": 1618632130,
      "upvotes": 0,
      "replies": {}
    },
    "gusxu7z": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusxu7z/",
      "text": "Mine is semester based and it is soooooo slow. It made me slack.",
      "author": "TheOGGizmo",
      "created": 1618630702,
      "upvotes": 2,
      "replies": {}
    },
    "gusxckd": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusxckd/",
      "text": "Education isn’t about helping the people who need it the most or value for money, it’s simply about churning people through as quickly as possible, hence why they front lid the majority of courses-if students drop out early on this forwent effect the tutors stats for people who pass v fail etc",
      "author": "Ball1091",
      "created": 1618630407,
      "upvotes": 5,
      "replies": {}
    },
    "gusxbml": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusxbml/",
      "text": "I feel like they’re slow paced tbh. Everyone is different",
      "author": "crystalliite",
      "created": 1618630391,
      "upvotes": -2,
      "replies": {}
    },
    "guswh2p": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guswh2p/",
      "text": "Couse college? You need to cover a lot in a little time? Like our syllabuses say that you need to spend at least 10 hours every week outside of class learning and reading and reviewing. Lectures aren’t all of it. Idk I’m on quarter system and I think it’s decent",
      "author": "Saandraa99",
      "created": 1618629886,
      "upvotes": -1,
      "replies": {}
    },
    "guswaq6": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guswaq6/",
      "text": "You mean extremely slow paced?",
      "author": "chuckmannorris",
      "created": 1618629782,
      "upvotes": -5,
      "replies": {
        "gusz1m7": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusz1m7/",
          "text": "r/iamverysmart",
          "author": "anickel120",
          "created": 1618631447,
          "upvotes": 6,
          "replies": {
            "guszb9f": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guszb9f/",
              "text": "You can learn most of first two years  of college in Khan Academy. The misconception is that college moves quickly not because it does, but because professors are terrible teachers typically, and something like Khan Academy allows one to teach themself and gain momentum at their own pace, thus increasing capacity to learn quickly and logically at an ever increasing rate.\n\nAn example would be sitting through a college calculus course for 4 months vs learning it online in maybe 2 or fewer.\n\nI understand the downvotes, but you don’t know until you try. (Actually I don’t because it isn’t a dislike or disagree button, another college skill to read the instructions and rules before using a tool)",
              "author": "chuckmannorris",
              "created": 1618631612,
              "upvotes": -4,
              "replies": {
                "guszef9": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guszef9/",
                  "text": "An answer to the question no one asked",
                  "author": "anickel120",
                  "created": 1618631668,
                  "upvotes": 6,
                  "replies": {}
                },
                "gut2u90": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut2u90/",
                  "text": "Kahn academy is a great resource before starting class too! You’re better prepared.",
                  "author": "Left-Fisherman6284",
                  "created": 1618633939,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "guswa9h": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guswa9h/",
      "text": "From my experience I would understand the content best after the test. Depends on your major but college is meant to push you. Don't let it get you down just try your best and you'll learn more than you think.",
      "author": "cburke5",
      "created": 1618629775,
      "upvotes": 1,
      "replies": {}
    },
    "gusvn5f": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusvn5f/",
      "text": "I am in quarter terms and in my biology class specifically everything goes so quickly that it is impossible to understand anything at all.",
      "author": "Sola_Fide_",
      "created": 1618629403,
      "upvotes": 1,
      "replies": {}
    },
    "gusu6lv": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusu6lv/",
      "text": "[deleted]",
      "author": null,
      "created": 1618628544,
      "upvotes": 2,
      "replies": {
        "guu5w8n": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guu5w8n/",
          "text": "Weed-out courses are not \"opaque.\" They are just at a high difficulty level, and their function is to let students know about their own aptitude and commitment level early so they can switch majors if they're in a bad fit. I associate these with math/science, where there are more first-year students than a department can really handle and where many students are only there because of the STEM prestige, not actual interest in the subject.",
          "author": "raspberry-squirrel",
          "created": 1618660396,
          "upvotes": 2,
          "replies": {
            "guujijh": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guujijh/",
              "text": "[deleted]",
              "author": null,
              "created": 1618666936,
              "upvotes": 1,
              "replies": {
                "guulalh": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guulalh/",
                  "text": "I hate to have to point this out to someone studying this (I'm not a STEM professor), but calculus and physics are meant to be together. There are non-calculus based physics classes in high school and those take some weird explanations and simplifications but the two disciplines are meant to go together! Calculus was developed for physics, essentially. It's not \"opaque\"--opaque would be making you learn German to read Leibniz to do your calculus in your physics class. It's just difficult.",
                  "author": "raspberry-squirrel",
                  "created": 1618667590,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gut884x": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut884x/",
          "text": "Never heard of that. Sounds like some conspiracy ngl",
          "author": "Green_Display5782",
          "created": 1618637903,
          "upvotes": 1,
          "replies": {
            "guton30": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guton30/",
              "text": "[deleted]",
              "author": null,
              "created": 1618651667,
              "upvotes": 5,
              "replies": {
                "guvj72s": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guvj72s/",
                  "text": "Thanks. Weeded classes are mandatory, or you can choose a different class and take a class you want in your 3rd/4th that might’ve been full.",
                  "author": "Green_Display5782",
                  "created": 1618679478,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gustny7": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gustny7/",
      "text": "I feel like professors aren't getting that their students usually have *at least* three or four other classes needed to keep a reasonable pace at finishing the degree, and because general requirements usually are not tangential to their course. \n\nIf you only had one class per semester, that would be more than enough time to not only study, but even do independent study and learning the subject aside from just drilling for a test, but it doesn't work that way at all. \n\nI get the feeling. It is amazing how it is about time for finals already, and i'm like \"that was it?\" TBH, i am not feeling like i was made qualified in the subject as advertised, but i was hustling to meet assignment requirements and prepare for tests the whole time. \n\nIf you really do find the subject topics interesting, always possible to research the subject independently after the course, and if your professor seemed amiable, you could ask them questions via messages and discuss the topic after the class.",
      "author": "zoyathedestroyah",
      "created": 1618628232,
      "upvotes": 13,
      "replies": {
        "guv47ts": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guv47ts/",
          "text": "It's not that we don't get it, it's that the system is designed such that a full load of classes is supposed to be equivalent to a full-time job (sometimes even a bit more). \n\nOur classes are designed to have a certain amount of work to meet accreditation standards, which means that if you are taking 15 credit hours, you are theoretically supposed to be attending class, studying, and working on homework up to 60 hours per week. That's a huge amount of work!\n\nObviously, if students are working full time, or even part time jobs, they aren't able to dedicate the time required.",
          "author": "TheProfessorsCat",
          "created": 1618674002,
          "upvotes": 4,
          "replies": {}
        },
        "guu565m": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guu565m/",
          "text": "We know about this. It's just that I have certain benchmarks I need people to hit in my class for their learning, and college courses last a prescribed amount of time. I can't do an \"extra slow\" class because then it doesn't prepare for the next one. Maybe my class is a Gen Ed for some and \"doesn't matter\"; for others it's their major and the skill absolutely does matter and they have to learn it when it's the appropriate time. We're working in a system and semesters have a cyclical quality. Students have to expect and plan to be doing a significant amount of work at certain moments, like midterms and finals. It's just how the whole thing works. I can't give my final in week 3 because students have more time to study then! As a student, your hard weeks are midterm/final time. My hard weeks are the two before the semester starts, where I'm driving myself insane reading a whole semester's worth of material and making enough lesson plans to get myself five-ish weeks down the road. The difference between professors and students is that the profs have had time to get to know the university system and deal with its rhythm, including the unpleasant bits. I'll work 4 80-hour weeks per year, and I accept this.",
          "author": "raspberry-squirrel",
          "created": 1618660085,
          "upvotes": 4,
          "replies": {
            "guvr721": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guvr721/",
              "text": "I agree with all these kinds of replies. It ***feels*** like they aren't acknowledging the existence of other course because its a set curriculum on a static timeline. It is what it is. What has to be done has to be done, and the semester is the pocket of time for it. \n\nIt just works out so a student is bouncing around to different subjects all the time. Its usually that finals and mid terms come fairly close to each other across classes, so \"cramming\" often belittles the meaningfulness of the material in a students mind.",
              "author": "zoyathedestroyah",
              "created": 1618683122,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gusth44": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusth44/",
      "text": "I don't know what your major is, but mine was Communications. Professors assumed we had read the assigned material BEFORE class, so most courses would be fairly fast-paced. College is not like elementary school or high-school, were the first time you hear of the concept they're teaching is when they bring it up in class and show you step-by-step how it works. Class is more to go over what you've read/studied and bolster your understanding of it, or answer your questions, if you have any.",
      "author": "BuyMeLotsOfDiamonds",
      "created": 1618628121,
      "upvotes": 13,
      "replies": {}
    },
    "gusrcxa": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusrcxa/",
      "text": "All of the advice here is really solid. It's really important to remember that this transition is hard for everyone, I know i constantly felt incompetent when i first started college, and a lot of times you'll feel like you're treading water. These effects are worse if you were like me and were led to believe you were a gifted youth. \n\nIt's a new environment, and your old mechanisms will have to change. Trust that it is hard for everyone, and it's supposed to be. You'll overcome it! Be kind and patient with yourself.",
      "author": "einemadchen",
      "created": 1618626905,
      "upvotes": 1,
      "replies": {}
    },
    "gusp7qf": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusp7qf/",
      "text": "You mean why are they not fast enough for adults to get a degree in one to two years? I don’t know.",
      "author": "collegelosser",
      "created": 1618625696,
      "upvotes": 0,
      "replies": {}
    },
    "gusoqyq": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusoqyq/",
      "text": "You're not alone in thinking this. And despite following some of the steps offered here such as studying 2-4 hours on top of every hour spent in class, I still fell behind and failed repeatedly. I feel after twenty years at it, I only retain lessons and such thanks to the many times I've repeated courses. Fail two or three times, pass on the fourth or fifth after giving it a go years later.  \n\n\nNot all of us operate that way. But there's quite a few like myself that do.",
      "author": "bentstrider83",
      "created": 1618625431,
      "upvotes": 17,
      "replies": {}
    },
    "gusojvc": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusojvc/",
      "text": "Yeah, college is like a full time job at least, so 40 hours a week or 8 hours per weekday. You might be in class like 2 hours a day? So you need to spend like 6 hours outside of that reading/studying/doing problems. And that’s like at minimum.",
      "author": "ColaRBT16",
      "created": 1618625318,
      "upvotes": 11,
      "replies": {
        "gut070i": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut070i/",
          "text": "That’s too much",
          "author": null,
          "created": 1618632178,
          "upvotes": -1,
          "replies": {
            "gut2oqw": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut2oqw/",
              "text": "Then prepare to fail",
              "author": "Left-Fisherman6284",
              "created": 1618633836,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "gusockf": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusockf/",
      "text": "Are you American? Because all they care about is testing.",
      "author": "SundanceKidZero",
      "created": 1618625200,
      "upvotes": 1,
      "replies": {
        "gusynha": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusynha/",
          "text": "In primary and secondary school yea, but college wayyyy less so",
          "author": "anickel120",
          "created": 1618631202,
          "upvotes": 4,
          "replies": {}
        },
        "guu7mlz": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guu7mlz/",
          "text": "[deleted]",
          "author": null,
          "created": 1618661142,
          "upvotes": 2,
          "replies": {
            "guz7ecv": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guz7ecv/",
              "text": "I'm also 30, and I guess it  just depends on the area you got your education in. High school was all about regurgitating information for grades. My college wasn't as bad, but in order to graduate, seniors had to take a comprehensive exam for their major. It was so stupid. I'm also a poor test taker, so I have a biased view unfortunately.",
              "author": "SundanceKidZero",
              "created": 1618760105,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gusm8oj": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusm8oj/",
      "text": "Can’t stress enough about active reading BEFORE the lecture. The lecture for me fills in the gaps of understanding, and the assignments reinforce that understanding. Do this and you will pass.",
      "author": "bills165",
      "created": 1618624041,
      "upvotes": 20,
      "replies": {
        "gusz73f": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusz73f/",
          "text": "Totally agree. Not everyone reading your comment will know what you mean by “active reading,” though! Could you explain further? I’m a teacher and it’s been my experience that too many students read something once and expect that to be enough. And they only read. What do you do, as active reading?",
          "author": "jmac94wp",
          "created": 1618631540,
          "upvotes": 2,
          "replies": {
            "gut0pac": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut0pac/",
              "text": "Active reading for me starts with previewing the text. Examining chapter introductions, section headings, charts, illustrations. I try to get a sense of what the chapter is about BEFORE actually reading it and taking notes. That way I can start to develop an ongoing narrative in my mind and ask myself what is important here? What is it that they want me to takeaway from this section, this chapter? You start forming questions in your mind as you scan the material. When you do this, the retention for me is so much better when you do finally go through the text in more detail. Aimlessly reading doesn’t really get you anywhere, but reading with a purpose does.",
              "author": "bills165",
              "created": 1618632506,
              "upvotes": 12,
              "replies": {
                "guwdh1f": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guwdh1f/",
                  "text": "I love this! It’s so easy to get burnt out! Great advice.",
                  "author": "LilAzNBBYgirl",
                  "created": 1618692108,
                  "upvotes": 1,
                  "replies": {}
                },
                "gv05bmk": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gv05bmk/",
                  "text": "Great way to start! And it’s so funny to me- I remember year after year, Language Arts teachers telling us to do that, and we all thought it was dumb and never adopted the habit. But pre-reading is an amazing tool!\n\nI had trouble as a freshman in college because I’d never really learned to study. Lucky for me, my English professor taught us the SQ4R method. It changed my life!\n\nS-  Survey the text (as you described)\nQ-  make a list of questions you think you’ll be expected to be able to answer. (Up through high school, most textbooks include chapter questions. You can also generate them from topic headings.)\nR-  Read all the way through once.\nR-“wRite” Read through again and take notes. Make a vocabulary list. When you spot answers to the questions, write them down.\nR-  Recite: go back through your notes and read the out loud. When you read your notes silently, your mind can easily wander. But It’s impossible to be distracted when you’re reading out loud. \nR-  Rehearse, meaning, you must have more than one study session for a set of material. Once won’t cut it.\n\nI hope this helps someone as much as it helped me!",
                  "author": "jmac94wp",
                  "created": 1618776486,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gusm80o": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusm80o/",
      "text": "This is precisely why my weekends are virtually non-existent. I study every day, but I make time for self-care too",
      "author": "notyourcouchpotato",
      "created": 1618624031,
      "upvotes": 7,
      "replies": {}
    },
    "gusij7q": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusij7q/",
      "text": "Good professors will introduce you to a topic and then provide resources for you to look into it further. Unfortunately, these professors can be very rare.",
      "author": "Jayburr001",
      "created": 1618622019,
      "upvotes": 7,
      "replies": {}
    },
    "gusf6mo": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusf6mo/",
      "text": "I hit a wall of incomprehension around my junior year (full disclosure: I've ADD and hadn't developed any appropriate study regime...just relying on some magical memory skills verging on photographic memory).\n\nI went to our counseling center to get help. We worked up a really regimented and scaffolded study program. One of the most helpful.tips I received was \"don't force your understanding...let it settle in for a few days...then come back to the task and try a new angle....rinse and repeat\"... The little educational seedlings keep sprouting new shoots which develop into leaves of epiphany LONG after the original course ended.",
      "author": "blonderengel",
      "created": 1618620170,
      "upvotes": 277,
      "replies": {
        "gut8yvy": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut8yvy/",
          "text": "I have that but with an extra H so my study plan was just meth.",
          "author": "Alistair_TheAlvarian",
          "created": 1618638500,
          "upvotes": 52,
          "replies": {
            "gutiyxl": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutiyxl/",
              "text": "Day 3 of adderall binge and my phone is swimming while I’m typing. But damn did I get a lot of work done",
              "author": "PM_ME_UR_GAMECOCKS",
              "created": 1618647294,
              "upvotes": 16,
              "replies": {}
            }
          }
        },
        "hig7tjx": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/hig7tjx/",
          "text": "Well until u run out of time because u have to meet deadlines. I mean with lectures only i dont have any problems at all because i can set a comfortable pace, but with exercises and lectures&excercises (a combination of both, dont know how it's called in english), i am running into big troubles.\nThe Problem is, cramming and memorizing, without understanding it, doesnt work for me anymore. Thanks to Depression, my concentration and Long Term memory is fucked Up.\nBut understanding Takes so much time, but without understanding i cant memorize Shit.",
          "author": "ezj_w",
          "created": 1635466346,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gusae8y": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusae8y/",
      "text": "As other said, you need to study more than you spend time in class. A general tip is for each hour in class, you need to study for two hours at home.\n\nFor me, they are too slow to be honest. The normal semester is around 3-4 months. A lot of homework seems dragged and stretched for no reason. The winter and summer are usually 3-4 weeks. I always see people dying during summer and winter. Why can't there be anything in-between?",
      "author": "timmy_42",
      "created": 1618617613,
      "upvotes": 8,
      "replies": {
        "gut802u": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut802u/",
          "text": "Metaphorically, you mean?",
          "author": "Green_Display5782",
          "created": 1618637730,
          "upvotes": 1,
          "replies": {
            "gut8q7l": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut8q7l/",
              "text": "What part should be metaphorical?",
              "author": "timmy_42",
              "created": 1618638314,
              "upvotes": 1,
              "replies": {
                "gutbu6y": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutbu6y/",
                  "text": "The dying part",
                  "author": "Green_Display5782",
                  "created": 1618640863,
                  "upvotes": 3,
                  "replies": {
                    "guuu2n0": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guuu2n0/",
                      "text": "Yes",
                      "author": "timmy_42",
                      "created": 1618670623,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gus97h0": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gus97h0/",
      "text": "Take your average course. In HS, a course is average 4 hours/week for a whole year. In college, that course is 3 hours/week in one semester. That means the course moves more than twice as fast.",
      "author": "rbro777",
      "created": 1618616983,
      "upvotes": 133,
      "replies": {
        "gut5nd7": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut5nd7/",
          "text": "And at least at my high school classes usually lasted two semesters instead of one, with about the workload overall workload of 1.25 of a semester college class",
          "author": "desba3347",
          "created": 1618635954,
          "upvotes": 40,
          "replies": {}
        },
        "gutdx2a": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutdx2a/",
          "text": "You guys didn’t have semesters in high school?",
          "author": "TopDawgT",
          "created": 1618642630,
          "upvotes": 15,
          "replies": {
            "guutts9": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guutts9/",
              "text": "We do but a lot of classes are a full year in length.  Some are only a semester long though",
              "author": "Platinum_Party_7",
              "created": 1618670543,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "guva5th": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guva5th/",
          "text": "This would only be true if high school classes and college classes were covering the same amount of material.  For example, I took US History in high school.  We covered the colonies through the 1960s.  In college, US History I covered half that time and US History II covered the other half.  There was more nuance to the explanations, but it wasn't a one-to-one comparison.",
          "author": "TheKwongdzu",
          "created": 1618676022,
          "upvotes": 3,
          "replies": {}
        },
        "gut6wgl": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut6wgl/",
          "text": "I don’t get what you’re saying ngl",
          "author": "Green_Display5782",
          "created": 1618636882,
          "upvotes": 6,
          "replies": {
            "guuftqd": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guuftqd/",
              "text": "In the US at least, high school classes meet every day of the week (unless you’re on a block schedule), but regardless throughout an entire year as opposed to a quarter or semester of a school year. So it’s less dense and slower paced because of the extra time.",
              "author": "ItIsShrek",
              "created": 1618665086,
              "upvotes": 4,
              "replies": {
                "guvjxn2": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guvjxn2/",
                  "text": "Oh, ok",
                  "author": "Green_Display5782",
                  "created": 1618679846,
                  "upvotes": 1,
                  "replies": {}
                },
                "guvjyfo": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guvjyfo/",
                  "text": "Thanks",
                  "author": "Green_Display5782",
                  "created": 1618679858,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gus2a6n": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gus2a6n/",
      "text": "Do a ton of self studying to prepare for the lectures. \n\nGet a tutor so you don't fall far behind.\n\nTake advantage of your professors' office hours.",
      "author": "AcademicDifficulty",
      "created": 1618613307,
      "upvotes": 12,
      "replies": {}
    },
    "gurxojt": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gurxojt/",
      "text": "[removed]",
      "author": null,
      "created": 1618610946,
      "upvotes": -23,
      "replies": {
        "gusf5tb": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusf5tb/",
          "text": "Weird, I'd expect someone with the creativity to name themselves \"yoloswagfish\" to have an *incredibly* low IQ",
          "author": "VogueCody25",
          "created": 1618620157,
          "upvotes": 8,
          "replies": {
            "gusfyqg": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusfyqg/",
              "text": "Cope, op is simply retarded",
              "author": "yoloswagfish-",
              "created": 1618620605,
              "upvotes": -18,
              "replies": {
                "gusitz8": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusitz8/",
                  "text": "This individual woke up this morning and picked hostility.",
                  "author": "matsudasociety",
                  "created": 1618622185,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        },
        "gut0dtq": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut0dtq/",
          "text": "You must be talking about yourself buddy. You must be both a dumb ass  with a low iq and  a prick",
          "author": null,
          "created": 1618632301,
          "upvotes": -1,
          "replies": {
            "gut0mm7": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut0mm7/",
              "text": "Anyone who says buddy shouldn't have an opinion. What are u 50 years old? Get off ur high horse retard",
              "author": "yoloswagfish-",
              "created": 1618632457,
              "upvotes": -2,
              "replies": {
                "gut0udc": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut0udc/",
                  "text": "Ooh says the one still calling people retards. Keep saying that, and watch you have a kid that turns into one 😂 you’re pathetic",
                  "author": null,
                  "created": 1618632597,
                  "upvotes": 1,
                  "replies": {
                    "gut20fy": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut20fy/",
                      "text": "[removed]",
                      "author": null,
                      "created": 1618633367,
                      "upvotes": 1,
                      "replies": {
                        "gut2ktj": {
                          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut2ktj/",
                          "text": "You’re as dense as a trump supporter. I’m embarrassed to even continue  replying to you. Please check yourself, cause you’re the only dumbass here",
                          "author": null,
                          "created": 1618633760,
                          "upvotes": 2,
                          "replies": {
                            "gut3eck": {
                              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut3eck/",
                              "text": "Bringing politics into something completely unrelated, the school system sure has failed you",
                              "author": "yoloswagfish-",
                              "created": 1618634327,
                              "upvotes": 0,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gurt5u8": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gurt5u8/",
      "text": "[deleted]",
      "author": null,
      "created": 1618608722,
      "upvotes": 40,
      "replies": {
        "gus40xt": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gus40xt/",
          "text": "I can relate, but I think it's just good cramming, and not long-term understanding.",
          "author": "Puzzleheaded_Elk_866",
          "created": 1618614241,
          "upvotes": 9,
          "replies": {}
        }
      }
    },
    "gurrsio": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gurrsio/",
      "text": "You might need to spend more time studying outside of class. Lectures are only a few hours a week; it's impossible to cover broad subjects without moving at a fast clip. You should plan to spend 2-3 hours studying and reviewing for every credit hour.",
      "author": "academicthro",
      "created": 1618608057,
      "upvotes": 347,
      "replies": {
        "gus9tbj": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gus9tbj/",
          "text": "I know a professor who spends part of the first day comparing in class lecture hours between college and high school to emphasize to the freshman that they have to put in time outside of class. It’s absurd how different they are. The quick math for American schools assuming even hours and a 36 week (pretty standard I think) high school calendar. \n\nCollege: 3-4 hours per week for 15-ish weeks gets you 45-60 in class hours per course. \n\nHigh school: 3-4.5 hours a week for 36 weeks gets you between 108-162 hours in class. Probably around 130 for block schedules. \n\nIn college you cannot rely on in class lectures to sufficiently introduce and understand material the way it was in high school.",
          "author": "General_Lee_Wright",
          "created": 1618617301,
          "upvotes": 125,
          "replies": {}
        },
        "guslni2": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guslni2/",
          "text": "Perspective from the other side: sometimes it's really just too fast. You don't need to always feel bad about it.\n\nI'm currently teaching a class that's *way* too fast for the students taking it. Even pre-COVID, this class should've been covering literally half of the material it's trying to cover. \n\nCan I do anything about it? Nope, because it's a GenEd class and I have to cover exactly what my department tells me to cover, and my department is full of fossils who haven't taught the class in decades but feel compelled to insist it's the student's fault that they're not working 60 hours/week for a class that isn't relevant to their major which they're missing 2 layers of pre-reqs for and should never have even been allowed to take.\n\nThe best and most general advice: go to office hours and talk to your professor. Ask questions about the material, even \"I don't get it, do you know anything that might help?\". Do a reasonable amount of work outside of class, and try to be really critical about what \"reasonable\" is. \n\nBut if the class is too fast, don't be too hard on yourself. Think about what you could do better (again, be honest with yourself if you aren't working as hard as you should), but try not to feel inadequate about it because there are lots of reasons you might still come up short that have nothing to do with your work ethic or intelligence.",
          "author": "newlaptopwhodis",
          "created": 1618623718,
          "upvotes": 125,
          "replies": {
            "gut0yvf": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut0yvf/",
              "text": "My issue is that I can do well in my classes and still feel like I haven’t really “learned” it. It feels like we have just enough time to grasp the general concept and then we’re moving on. It bums me out that I feel like after I get my degree I might be able to concentrate on relevant hobbies where I can actually learn the stuff.",
              "author": "Dont_Blink__",
              "created": 1618632677,
              "upvotes": 30,
              "replies": {
                "gut1y5l": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1y5l/",
                  "text": "I feel you, dude. But undergrad isn't meant to make you an expert - it's meant to give you a broad base of knowledge to draw on while you become an expert later. Enjoy getting the general ideas now, and then you can deep dive on one (or all of them!) later.",
                  "author": "ParsnipPizza2",
                  "created": 1618633325,
                  "upvotes": 20,
                  "replies": {}
                }
              }
            }
          }
        },
        "gusugre": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusugre/",
          "text": "I always thought of it as you’re at such a high level you are there to analyze and discuss the material in class. Learning and memorizing the material is for your own time.",
          "author": "High-Heels_and_Books",
          "created": 1618628712,
          "upvotes": 11,
          "replies": {}
        },
        "gusvq7k": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusvq7k/",
          "text": "This is a one way ticket to burnout.",
          "author": "TheColorOfYou",
          "created": 1618629452,
          "upvotes": 13,
          "replies": {
            "gutldx0": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutldx0/",
              "text": "Totally disagree. Burnout is what happens when you have homework due Friday spanning content you've learned since Monday, and then you try to do all the learning and working on Thursday night.\n\nTrust me, spreading it out across the week is the correct method. Not only do you spend *less* time this way, but you learn way faster. Reviewing Monday's lecture on Monday night instead of next week (or worse, right before the test) will ensure that the content is still fresh in your head and will help solidify it.",
              "author": null,
              "created": 1618649290,
              "upvotes": 18,
              "replies": {}
            },
            "gusvtm0": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusvtm0/",
              "text": "It's not; it's really the bare minimum. If you're in 16 credit hours, it means 32 hours of work per week, 40 tops. You shouldn't be aiming for less than that. College is your job.",
              "author": "academicthro",
              "created": 1618629508,
              "upvotes": 3,
              "replies": {
                "guszwa2": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guszwa2/",
                  "text": "[deleted]",
                  "author": null,
                  "created": 1618631985,
                  "upvotes": 9,
                  "replies": {
                    "guyyc9p": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guyyc9p/",
                      "text": "Sure, but then it shouldn't be a surprise that the classes you're half-assing feel \"too hard\" or \"too fast paced.\" Take fewer classes and actually do them right (yes, that means 2-4 hours outside of class for every hour of class time) and you will be amazed by how much your grades skyrocket - that's my advice as someone who worked 30 hours a week as an undergrad.",
                      "author": "ExplainsSocialNorms",
                      "created": 1618755526,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gusxbd7": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusxbd7/",
                  "text": "Don’t know of a single person who spends that much time doing schoolwork. I go to a school you have almost certainly heard of if you are in the US so it’s not like I’m at a community college (although it is not an Ivy League either). I’ve never had below a 3.5, and when I achieved a 4.0, I doubt I was doing anymore than 25-30 hours a week.",
                  "author": "amongus_sus_imposter",
                  "created": 1618630387,
                  "upvotes": 17,
                  "replies": {
                    "guszgof": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guszgof/",
                      "text": "I’m with you there. I knew too many people that got by just fine in GEs and lower div classes with nowhere near 6-9hrs per week per class. Only people I knew going through that much studying were people aiming for grad school/med school/law school",
                      "author": "Nkklllll",
                      "created": 1618631707,
                      "upvotes": 7,
                      "replies": {}
                    },
                    "gusxqq3": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusxqq3/",
                      "text": "Sure, there are people who spend much less time than that and do well. There are people who spend much more time than that and do poorly. That said, students’ estimation of how much time other students put in is basically never accurate except, sometimes, for close friends. Regardless, if OP feels things are moving too fast, they need to spend more time studying outside of class. \n\n>25-30 hours a week\n\nSo, around the 32 hour/week number that I said should l come with taking a standard courseload, then?",
                      "author": "academicthro",
                      "created": 1618630641,
                      "upvotes": 12,
                      "replies": {
                        "guszlau": {
                          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guszlau/",
                          "text": "I should’ve been more specific - 25-30 would be at the very high end. Usually is closer to 20, or even less.",
                          "author": "amongus_sus_imposter",
                          "created": 1618631786,
                          "upvotes": 3,
                          "replies": {
                            "guszogw": {
                              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guszogw/",
                              "text": "Sure, I believe that was the case for you. I also know for a fact that most students who spend below 20 hours per week on schoolwork do not attain anything close to a 4.0.",
                              "author": "academicthro",
                              "created": 1618631844,
                              "upvotes": 1,
                              "replies": {
                                "gutd6l3": {
                                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutd6l3/",
                                  "text": "I can send my transcript. Also 4.0 is not my cumulative GPA - my cumulative is a 3.8.",
                                  "author": "amongus_sus_imposter",
                                  "created": 1618642008,
                                  "upvotes": -1,
                                  "replies": {
                                    "gutda7f": {
                                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutda7f/",
                                      "text": ">I can send my transcript.\n\nIt's okay. Relax. I believe you. I also know your experience is not the norm.",
                                      "author": "academicthro",
                                      "created": 1618642095,
                                      "upvotes": 9,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "gusyebw": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusyebw/",
                      "text": "I am a graduate student in computer science. There are weeks I spend 30 hours on a single class.",
                      "author": "mrs_frizzle",
                      "created": 1618631044,
                      "upvotes": 7,
                      "replies": {
                        "guszmuq": {
                          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guszmuq/",
                          "text": ">graduate student in computer science \n\n\nThat would explain why.",
                          "author": "amongus_sus_imposter",
                          "created": 1618631815,
                          "upvotes": 5,
                          "replies": {}
                        }
                      }
                    },
                    "gutkxm8": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutkxm8/",
                      "text": "What's your degree? Because in my senior year 40 hours meant it was a good week lol. My schedule was basically wake up at 9, go to class from 10-2, go to the library and do work until anywhere between midnight and 4am, go home and do it again.",
                      "author": null,
                      "created": 1618648938,
                      "upvotes": 4,
                      "replies": {
                        "guw7ge1": {
                          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guw7ge1/",
                          "text": "Makes sense considering you are doing computer science, which is generally considered one of the hardest majors",
                          "author": "amongus_sus_imposter",
                          "created": 1618690051,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    },
                    "gutb4go": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutb4go/",
                      "text": "same here. I have a 3.9 GPA in college and I have never spent more than 25 hours a week studying except for when I have exams. Doing more than that sounds like hell especially if you have a job and other stuff going on such as extracurriculars",
                      "author": "FerThePro",
                      "created": 1618640261,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                },
                "gusyb96": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusyb96/",
                  "text": "Found the professor",
                  "author": "anickel120",
                  "created": 1618630991,
                  "upvotes": 3,
                  "replies": {
                    "gusych6": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusych6/",
                      "text": "Correct!",
                      "author": "academicthro",
                      "created": 1618631012,
                      "upvotes": 4,
                      "replies": {}
                    },
                    "gut6w7v": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut6w7v/",
                      "text": "[deleted]",
                      "author": null,
                      "created": 1618636877,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                },
                "gut0085": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut0085/",
                  "text": "32 hours? Fck that",
                  "author": null,
                  "created": 1618632056,
                  "upvotes": 3,
                  "replies": {
                    "gut08w8": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut08w8/",
                      "text": "Lol. What do you think is reasonable? \n\nThis conversation with undergrads is always wild to me. This is the thing that decides your future more than almost anything else in your life up to this point; if you can't treat it like the full time job it is, you should wait until you're mature enough to do so.",
                      "author": "academicthro",
                      "created": 1618632212,
                      "upvotes": 10,
                      "replies": {
                        "gut1j77": {
                          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1j77/",
                          "text": "Talk about elitism. Jeeze. Plenty of students these days have to work part-time or even full-time jobs just to afford college. Not sure what reality you're living in. If college is a full-time job, why doesn't it pay its workers?",
                          "author": "Various-Grapefruit12",
                          "created": 1618633048,
                          "upvotes": 19,
                          "replies": {
                            "gutm2w5": {
                              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutm2w5/",
                              "text": ">Talk about elitism\n\nElitism is warranted. He's a professor -- he's forgotten more about college than most of the undergrads posting here have ever known. You can't use the internet thinking every voice in the room is equal.\n\n>Plenty of students these days have to work \n\nAnd the majority don't. Obviously the advice here isn't one-size-fits-all. Take good advice and mold it to fit your specific situation.\n\n>If college is a full-time job, why doesn't it pay its workers?\n\nAlright... \n\nIf you take college seriously, and I mean really seriously, the impact it will have on your life will be more significant than any wage it could pay you (which is an absurd premise, by the way). I'm a graduate and I would not have had a chance to enter into my industry without college. College not only enabled my career, it taught me how to be studious, how to retain information, how to dedicate myself to a single endeavor, how to allocate my time, how to problem solve, how to manage stress... I think you get the picture.\n\nIf people want to treat college like it's high school and then lament in threads about how college is too tough (no offense to OP), then that's fine. But please understand the man you're speaking to is right. What you get out of college is a direct result of what you put into it. If you're averse to putting in any more effort required than the bare minimum, then expect college to have a bare minimum impact on your life. And if you're going to listen to good advice but ignore it because it sounds elitist, then prepare for all the advice you take to lead you to mediocrity. You can't become anything better than average if you only listening to average people's opinions. I'm not saying that to be mean, I'm saying that because it's true.",
                              "author": null,
                              "created": 1618649817,
                              "upvotes": 12,
                              "replies": {}
                            },
                            "gut1t1x": {
                              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1t1x/",
                              "text": "That's not what elitism is. Here's what I just posted in response to someone asking the same thing:\n\n>But the job can't take priority over school, nor can the school lower its requirements or give its a students a worse information (by covering less info) to accomodate outside jobs. If you find that the amount of time you need to spend working is cutting into the time you can spend doing schoolwork, and your grades are suffering as a result, then you may need to take fewer classes or become a part-time student so that you can support yourself and still devote enough time to your studies. \n\nas for this:\n\n>If college is a full-time job, why doesn't it pay its workers?\n\nThat can't be a serious question, lol.",
                              "author": "academicthro",
                              "created": 1618633232,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        },
                        "gut0p0q": {
                          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut0p0q/",
                          "text": "I have priorities. I don’t know anyone who have spent that much time for.... for school 🤢. Like you should put in work, but it’s all about finding the way that works efficiently. I think we have very strong opposite opinions on this. Studying 32 hours a week? I rather just kill myself",
                          "author": null,
                          "created": 1618632501,
                          "upvotes": 5,
                          "replies": {
                            "gut10y2": {
                              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut10y2/",
                              "text": "Your priorities are wrong if school's not close to the top; as I said, it will have more impact on your future than anything else you've ever done. And if 32 hours is too much for you, man, wait till you find out how many hours you have to devote to work post-college (it's generally well beyond 40). And yet people manage to work that much and still have thriving, active social lives - it's entirely possible to do both while in college.",
                              "author": "academicthro",
                              "created": 1618632713,
                              "upvotes": 8,
                              "replies": {
                                "gut8fmd": {
                                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut8fmd/",
                                  "text": "Idk man, paying thousands of dollars to work 32 hours is way worse than working 40 hours and getting paid the other way around",
                                  "author": "maoejo",
                                  "created": 1618638072,
                                  "upvotes": 12,
                                  "replies": {
                                    "gut8pg7": {
                                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut8pg7/",
                                      "text": "So don't pay the thousands of dollars and just go directly into the workforce. No one's making you go to college. Your reason for *choosing* to do so is that it leads to significantly improved lifetime earnings. The tradeoff is the time, money, and deferred gratification that college costs, but if you're not willing to put that in then there's nothing stopping you from trying to get a job right out of college.",
                                      "author": "academicthro",
                                      "created": 1618638297,
                                      "upvotes": 16,
                                      "replies": {}
                                    },
                                    "gutlhec": {
                                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutlhec/",
                                      "text": "So drop out and have fun learning the hard way.",
                                      "author": null,
                                      "created": 1618649366,
                                      "upvotes": 4,
                                      "replies": {}
                                    }
                                  }
                                },
                                "gut1dx8": {
                                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1dx8/",
                                  "text": "You can’t tell someone their priorities are wrong haha. School isn’t the only option for people, and In my opinion a student exhausting themself trying to meet the 32 hours is a waste of time. You keep talking about the future, when tomorrow is never promised. You know how much people had a mindset like you? Only focused on school and a future job- next thing you know they end up dead before they could reach it and regrets not doing things. 32 hours is not the minimum, there is no minimum as long as you find something that works",
                                  "author": null,
                                  "created": 1618632949,
                                  "upvotes": 2,
                                  "replies": {
                                    "gut1lsd": {
                                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1lsd/",
                                      "text": "> You can’t tell someone their priorities are wrong haha.\n\nSure you can. If someone is prioritizing getting drunk over going to their job, for example, it's reasonable to tell them that's wrong insofar as it's going to get them fired and they need to eat. \n\n>You know how much people had a mindset like you? Only focused on school and a future job- next thing you know they end up dead before they could reach it and regrets not doing things\n\nThis is not a mature mindset. Why do anything or plan for the future or work hard when you might just die? That's not a mindset that leads to success. \n\n>there is no minimum as long as you find something that works\n\nSure, if you have an excelletn GPA while working less than that then it clearly works for you. But if not, or you feel (like OP) that class is moving too fast, then it isn't working.",
                                      "author": "academicthro",
                                      "created": 1618633097,
                                      "upvotes": 10,
                                      "replies": {
                                        "gut2eul": {
                                          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut2eul/",
                                          "text": "Priorities are unique to the individual, they May not agree with your ridiculous standards but they agree with the person. \nOp’s question has nothing to do with me, I’ve managed to find what works for me and I’ve maintained  a high gpa. I haven’t studied since high school and now In college I study in total less than 5 hours a week with A’s.\nIt’s people like you with your ridiculous standards that intimidates people into thinking there’s only one option to go about something. \nHinting from your responses there’s no point trying to talk to you because you don’t even try to see the fault in your replies. Feels like I’m talking to a trump supporter 😂. \nI really hope you don’t have children, and aren’t a mentor to anyone especially those in college.\nI won’t say you need to get your priorities straight (as i shouldn’t anyway!), but you should reevaluate the meaning of life and success.",
                                          "author": null,
                                          "created": 1618633646,
                                          "upvotes": -1,
                                          "replies": {
                                            "gut2v2l": {
                                              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut2v2l/",
                                              "text": ">Priorities are unique to the individual\n\nSorry, this is meaningless. Just as opinions can be good or bad, so can priorities.\n\n>haven’t studied since high school and now In college I study in total less than 5 hours a week with A’s\n\nThat's great! (Although it's not something you should expect to continue for all four years). I'm sure most of your friends work more tthan that, though, and certainly most college students do. Either way, as I said:\n\n>if you have an excelletn GPA while working less than that then it clearly works for you.  But if not, or you feel (like OP) that class is moving too fast, then it isn't working.\n\nIt's not working for OP, who clearly needs to spend more time studying.\n\n>I really hope you don’t have children, and aren’t a mentor to anyone especially those in college.\n\nThis is a bit immature, don't you think? Doesn't seem much point in talking further. Anyway, best of luck keeping your GPA up while working and maintaining a healthy social life; it can be really tough, but there's always a way to make it work.",
                                              "author": "academicthro",
                                              "created": 1618633956,
                                              "upvotes": 5,
                                              "replies": {}
                                            }
                                          }
                                        }
                                      }
                                    },
                                    "gutplsj": {
                                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutplsj/",
                                      "text": "College is an investment in your future self. I spend easily 32 hours a week studying as an ungrad. Yes, sometimes it is exhausting but overall I want to put forth my best effort in school. If your argument is “tomorrow is never promised” why don’t you just go live a yolo life and drop out? Sorry but I agree with the professor in this thread.",
                                      "author": "lovingtolive",
                                      "created": 1618652328,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                },
                "gut1b8x": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1b8x/",
                  "text": "the only thing is with the price of university in the united states and other countries many students need a job outside of school to support themselves. 40 is a good amount of ours and feasible to do especially if you have a part time job, but  many people need to learn skills outside of school for their jobs and many people cannot afford to not have another job outside of school",
                  "author": "alphabetcarrotcake",
                  "created": 1618632900,
                  "upvotes": 4,
                  "replies": {
                    "gut1q9v": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1q9v/",
                      "text": "Of course. But the job can't take priority over school, nor can the school lower its requirements or give its a students a worse information (by covering less info) to accomodate outside jobs. If you find that the amount of time you need to spend working is cutting into the time you can spend doing schoolwork, and your grades are suffering as a result, then you may need to take fewer classes or become a part-time student so that you can support yourself and still devote enough time to your studies.",
                      "author": "academicthro",
                      "created": 1618633181,
                      "upvotes": 8,
                      "replies": {
                        "guu93td": {
                          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guu93td/",
                          "text": "Yes I agree! Everyone is in different circumstances at school especially with COVID, but it is important for people to try their best and be flexible if needed!",
                          "author": "alphabetcarrotcake",
                          "created": 1618661757,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "guvim47": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guvim47/",
                  "text": "I have no words but laughter at this comment.",
                  "author": "TheColorOfYou",
                  "created": 1618679184,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gust37u": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gust37u/",
          "text": "Based on that logic I should be studying 40-60 hours a week at the moment, which isn't feasible.",
          "author": "DjSzymek",
          "created": 1618627895,
          "upvotes": 11,
          "replies": {
            "gusthcx": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusthcx/",
              "text": "You’re right, I mistyped; it should be 2-3 hours studying outside of class for every credit hour. So with a 16 hour courseload, that’s more than doable. \n\nThat said, 40 hours of work a week is certainly doable. 60’s not reasonable for an undergrad, but it’s not impossible, either.",
              "author": "academicthro",
              "created": 1618628125,
              "upvotes": 10,
              "replies": {
                "gusuj5c": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusuj5c/",
                  "text": "If homework, projects, and other assignments count as studying/working then I certainly agree with you. \n\nI'm in my final semester of undergrad which is jam packed with design projects, so I think my case might be slightly skewed. I put in 40-60 hours a week on assignments alone at the moment.",
                  "author": "DjSzymek",
                  "created": 1618628751,
                  "upvotes": 13,
                  "replies": {}
                },
                "gutieoc": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutieoc/",
                  "text": "And when do you work for food and rent?",
                  "author": "WickedProblems",
                  "created": 1618646825,
                  "upvotes": 2,
                  "replies": {
                    "gutrqfr": {
                      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gutrqfr/",
                      "text": "You don't.\n\nUniversity has always been a place for the wealthy and full-time study means *full-time study*. You are expected to treat university as a full-time job. Adding another part-time (or god forbid, another full-time) job to that schedule was never meant to be easy. In a very real sense, you're not *supposed* to be working while you study. At my university, it's actually banned.",
                      "author": "officially_anxious",
                      "created": 1618653650,
                      "upvotes": 3,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "gut09j5": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut09j5/",
          "text": "[deleted]",
          "author": null,
          "created": 1618632223,
          "upvotes": 7,
          "replies": {
            "gut9sc2": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut9sc2/",
              "text": "Only people I knew doing that kind of studying were pre med trying to get into top 5 med schools",
              "author": "Nkklllll",
              "created": 1618639168,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "guso3b8": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guso3b8/",
          "text": "One of the most underrated advice.",
          "author": "Eddie_078",
          "created": 1618625058,
          "upvotes": 5,
          "replies": {}
        }
      }
    },
    "gurqnix": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gurqnix/",
      "text": "[deleted]",
      "author": null,
      "created": 1618607508,
      "upvotes": 74,
      "replies": {
        "gusrndg": {
          "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusrndg/",
          "text": "You will? It’s two years in and I definitely haven’t",
          "author": "BecomingCass",
          "created": 1618627068,
          "upvotes": 21,
          "replies": {
            "gusv199": {
              "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusv199/",
              "text": "3 years in, I haven’t",
              "author": "zninjamonkey",
              "created": 1618629044,
              "upvotes": 15,
              "replies": {
                "gusvtzi": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gusvtzi/",
                  "text": "All I have left is internships and thesis. Still haven't.",
                  "author": "HJSDGCE",
                  "created": 1618629514,
                  "upvotes": 14,
                  "replies": {}
                },
                "gut1sa4": {
                  "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gut1sa4/",
                  "text": "graduating in a month and i haven’t lol",
                  "author": "lasagnaisgreat57",
                  "created": 1618633218,
                  "upvotes": 8,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "guro2kq": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/guro2kq/",
      "text": "Don't worry about others, work at your own pace and try to \"have fun\" with what you're learning.",
      "author": "matsudasociety",
      "created": 1618606311,
      "upvotes": 9,
      "replies": {}
    },
    "gurkxju": {
      "link": "/r/college/comments/msbjld/why_are_college_courses_so_fast_paced/gurkxju/",
      "text": "I would read the textbook beforehand even if you don't understand it. Try to highlight things that make a good short summary of the main topic and make annotations of any questions or things that were confusing. Try to also memorize any key vocab words that are bolded or the topic. This will promote active recall in class and is better in terms of memorizing things. I also like to pretend to teach lessons on the topic after the class or I start flashcards that minute and put them in piles of I know and I don't know. I also write all I know about a topic. So if I have to knoe about the kreb cycle I'll write down everything I know and compare it to my notes. Then I'll add anything I missed or cross out anything I got wrong. If it's a lot of things I'll try to even condense it then into a paragraph or a few sentences.",
      "author": "noelblossom",
      "created": 1618604914,
      "upvotes": 34,
      "replies": {}
    }
  },
  "updated": 1636184185
}