{
  "sid": "r7cch7",
  "link": "/r/college/comments/r7cch7/is_it_ever_okay_to_dropout/",
  "title:": "Is it Ever Okay to Dropout?",
  "text": "People say college isn't for everyone but then in the same breathe, if someone mentions dropping out, they tell you to stick it out.  \n\n\nedit: spelling",
  "author": "Dannymax333",
  "created": 1638465691,
  "updated": 1639848415,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hmydr0q": {
      "link": "/r/college/comments/r7cch7/is_it_ever_okay_to_dropout/hmydr0q/",
      "text": "It's usually a good idea to finish for your future career prospects, earning potential, etc. But there are always exceptions for unique circumstances. If you can stick it out, try to do so. \n\nIf you are having mental health issues, talk to your doctor and follow their advice. If you are having other pressures, find an appropriate expert to discuss options (e.g., financial).\n\nGood luck and wishing you a peaceful day.",
      "author": "Buffalo-Castle",
      "created": 1638465909,
      "upvotes": 7,
      "replies": {}
    },
    "hmymdpl": {
      "link": "/r/college/comments/r7cch7/is_it_ever_okay_to_dropout/hmymdpl/",
      "text": "Everyone has their own circumstances, if you think it is the right thing to do, it should be okay. \nI do think it is important to at least have an idea of what to do instead of college.",
      "author": "IntricateTea",
      "created": 1638469225,
      "upvotes": 2,
      "replies": {}
    },
    "hmyxgo7": {
      "link": "/r/college/comments/r7cch7/is_it_ever_okay_to_dropout/hmyxgo7/",
      "text": "Honestly dropping out should only be considered when you have a legitimate backup plan in place and it takes a few weeks to months of planing to have one. As for that advice it’s basically just pandering since humans are a walking talking contradiction at least once in their lifetimes",
      "author": "PureDrip98",
      "created": 1638473485,
      "upvotes": 1,
      "replies": {}
    },
    "hmyzyuo": {
      "link": "/r/college/comments/r7cch7/is_it_ever_okay_to_dropout/hmyzyuo/",
      "text": "It really comes down to whether or not you will be able to finish the degree and get a job. If you won’t be able to pass the classes necessary to get the degree, then you should drop out now to avoid wasting more money, and you can chalk it up to college not being for you. Get out now before you are in even more debt. \n\nOn the flip side, if you will be able to pass the classes necessary to finish the degree, but you just need to retake them, you just need to change your major, or you just need to lighten your load and take an extra semester or two, then it may make sense to stay in college and finish it out. \n\nYou just have to examine whether or not you think you are capable of ever passing the necessary classes. \n\nThere is probably a point where it takes so much time that it’s no longer worth it, even if you could finish. You’d just have to look at your earnings potential after getting the degree coupled with the debt you’ll be in, and compare that with the earnings potential of getting a job without the degree but also without the debt.",
      "author": "ilikecacti2",
      "created": 1638474457,
      "upvotes": 1,
      "replies": {}
    },
    "hn1cf8p": {
      "link": "/r/college/comments/r7cch7/is_it_ever_okay_to_dropout/hn1cf8p/",
      "text": "My advice would be to get the associates degree if you haven't already. That way if you decide now college isn't for you and then later want to come back for some reason, you have a checkmark.",
      "author": "Imperator525",
      "created": 1638511720,
      "upvotes": 2,
      "replies": {}
    }
  }
}