{
  "sid": "rhfzkj",
  "link": "/r/college/comments/rhfzkj/is_college_worth_it/",
  "title:": "Is College Worth It?",
  "text": "I mean yes, obviously it is especially if you’re studying a S.T.E.M subject, planning to go into a complex profession (like the medical field) or looking to be paid well long term For my case I’m asking because I notice people who are going to/attended higher education tend to say their best experience was essentially “being free and independent”.  I have a very controlling mother and I thought I could just “get away” from her and then figure out the rest from there (I have a plan already, just nothing she’d ever approve). The longer I am in limbo I see how that previous plan cannot work so would it just be best to go to college for a few years to appease her but also for me to learn how to be independent (for myself)?\n\nI would be going to school in Jamaica in case that info is needed",
  "author": "Alert_Positive_6931",
  "created": 1639621228,
  "updated": 1639787819,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 0.83,
  "comments": {
    "horcow1": {
      "link": "/r/college/comments/rhfzkj/is_college_worth_it/horcow1/",
      "text": "Yes, absolutely. You’ll never have a better opportunity to learn new things and expose yourself to new perspectives than college and it’s a great introduction to independence.",
      "author": "RytheGuy97",
      "created": 1639644668,
      "upvotes": 1,
      "replies": {
        "hovmb3p": {
          "link": "/r/college/comments/rhfzkj/is_college_worth_it/hovmb3p/",
          "text": "Okay. If I can find a loophole that allows me to go for cheap or even free then I’ll do it",
          "author": "Alert_Positive_6931",
          "created": 1639716099,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "horr99i": {
      "link": "/r/college/comments/rhfzkj/is_college_worth_it/horr99i/",
      "text": "I think it is a great way to learn a bit about being free and independent but to offer an opposing view, college is also a bit of a delay into the working (real) world. And sure you get to schedule your own classes, pick a major, decided whether or not to actually go to those classes, decide how, when, and to what level you'll complete your homework etc. But also that's all within a structure, right? Especially once you've picked a major, you maybe have to take 15 or 20 classes out of a list of 30, you have advisors and teachers and other support staff all along the way, you have RAs in the dorms at least while you're on campus, etc. You're taking out more and more debt every year with limited checks on your ability to do so. And you know what lots of people do if they can't find a job after their bachelor's? Go back to school for a Master's, because school is familiar and comfortable, and there will continue to be a clear defined path and people watching over you and giving you immediate positive or negative feedback.\n\nIt's really not totally representative of the real world, and I think you could learn just as much about being independent from trying to learn a useful skill, getting your own apartment, learning how insurance works and paying for a car, learning about saving and investing money, working towards a career of some sort rather than just a piece of paper that you're told to get. \n\nAnd no, going for just a few years to appease her, if you don't plan on finishing and getting a degree is a fairly large waste of money, because only completing some college does not help career prospects or potential earning power very much. If you have scholarships and can get it for free, go ahead, but otherwise it's a huge money sink.",
      "author": "Thelton26",
      "created": 1639656159,
      "upvotes": 1,
      "replies": {
        "hovm7a0": {
          "link": "/r/college/comments/rhfzkj/is_college_worth_it/hovm7a0/",
          "text": "I see. I read through this all and you’re very right. I can’t necessarily afford an apartment right now but I’m sure working a job it two will probably be enough to rent a cheap place. And it’s not as expensive as university nor as stressful I presume?\n\nAlthough she wants me to get a degree she’s honestly fine as long as I get out the house and don’t bother her… I lost my scholarship and don’t really care to apply for another (or even go to school) so I’ll consider working instead",
          "author": "Alert_Positive_6931",
          "created": 1639716045,
          "upvotes": 1,
          "replies": {
            "hovp6ha": {
              "link": "/r/college/comments/rhfzkj/is_college_worth_it/hovp6ha/",
              "text": "I think that's a great path, the only thing I would say is work with a purpose. Don't just go out and get a retail job, try to find something that will teach you a skill of some sort. Or you could check out a local technical college and figure out a program path there. It's usually much cheaper and you can often work at your own pace and on your own schedule.",
              "author": "Thelton26",
              "created": 1639717624,
              "upvotes": 1,
              "replies": {
                "hovpllc": {
                  "link": "/r/college/comments/rhfzkj/is_college_worth_it/hovpllc/",
                  "text": "Okay, I can definitely try to find a job that provides skills but I’d mostly be working to move out anyways so I can at least have a safe nontoxic environment to reside in\n\n I’m more leaning to the technical college side… Could colleges that offer classes like cooking, architecture, beauty courses etc. be of benefit to my case or I shouldn’t consider them?",
                  "author": "Alert_Positive_6931",
                  "created": 1639717855,
                  "upvotes": 1,
                  "replies": {
                    "hovpw9d": {
                      "link": "/r/college/comments/rhfzkj/is_college_worth_it/hovpw9d/",
                      "text": "That's kind of what I would expect. I'm not sure about cooking classes, and I think architecture would probably have to be a 4 year degree. But they have programs like manufacturing technology, aircraft maintenance, small engine repair, welding, IT and Computer repair, cosmetology, dental assisting, medical software, etc. They're all about getting you to a decent job on your own timeline with minimal debt.",
                      "author": "Thelton26",
                      "created": 1639718020,
                      "upvotes": 1,
                      "replies": {
                        "hovqnyr": {
                          "link": "/r/college/comments/rhfzkj/is_college_worth_it/hovqnyr/",
                          "text": "I understand… well if it’s something I like I wouldn’t mind doing the 4 years, not sure about those hands on subjects though. But most importantly I just want to get away from my toxic environment and get a move on with my life. \nThank you for your help again! Hope you have a great rest of your day/night.",
                          "author": "Alert_Positive_6931",
                          "created": 1639718445,
                          "upvotes": 1,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hoqgd6n": {
      "link": "/r/college/comments/rhfzkj/is_college_worth_it/hoqgd6n/",
      "text": "It depends.",
      "author": "AutomaticPeak3748",
      "created": 1639624934,
      "upvotes": 0,
      "replies": {
        "hovm7lb": {
          "link": "/r/college/comments/rhfzkj/is_college_worth_it/hovm7lb/",
          "text": "On?",
          "author": "Alert_Positive_6931",
          "created": 1639716049,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}