{
  "sid": "ri1alw",
  "link": "/r/college/comments/ri1alw/need_advice_loa/",
  "title:": "Need advice! LOA",
  "text": "I took a leave of absence for this semester (Fall 2021), after being super burnt out from a freshman year completely online and suffering anxiety issues. I've been in therapy for the past couple of months at home and currently work about 25 hours a week, happier than I have been in a while. Since I had enough credits to graduate a semester early, this LOA didn't make my degree progress any longer so I had the same graduation date (May 2024). My original plan was to come back for the spring semester and get right back into classes, transfer work locations and work about 20 hours a week. However, housing was an issue and my school said there were no spots just a week ago (I applied in August and contacted them multiple times with no answer) so I was left to try to find a sublet on an apartment. I don't have a car and must be within walking distance of school/work and also can't completely break the bank since I pay for everything myself. I found an option I liked but the girl didn't respond at all or her answers seemed vague. Just yesterday the school contacted me saying they have ONE spot left in an apartment for spring. I'm now not sure if I am ready- I'm essentially pigeonholed into the one spot if I take it with random people and I have to throw together my life and move 1000 miles away in two weeks. I'm just worried that if I take another semester leave of absence and graduate in December instead of May that I'll be judged or it will look bad to employers on my degree. On the flip side, I'm worried that having these plans so last minute and moving with 0 support system so far would also be detrimental to the mental health I have worked so hard to get better for. It's hard for me to make this decision regardless because I've always been someone who was high-achieving academically and put that over my mental health and I don't know if I'm just putting imaginary standards on myself or if it would be ok. I do really miss school and classes... wish I could take some online and still be here not worried about housing but my school is completely in person this semester and won't allow me to take any classes outside of it. I would appreciate any thoughts on what I should do!",
  "author": "lunarmadz",
  "created": 1639691789,
  "updated": 1639787773,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {}
}