{
  "sid": "a4qau2",
  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/",
  "title:": "Why does it seem like so many people are so anxious and depressed?",
  "text": "Hello everyone, hope you are all having a fun finals week.\n\n&#x200B;\n\nI have made a discovery lately that has made me think quite a bit.  As I have become a bit more comfortable with my own insecurities and tried to talk to others it seems like a lot of my friends and people I know are terribly anxious inside and are overwhelmed by many things in our current society but NOBODY will talk about it. It seems like most people I end up talking to feel extremely insecure and overwhelmed with college life and people but everybody just puts on a facade and pretend it's okay.\n\n&#x200B;\n\nI know this is natural and nobody want's to look weak and maybe I am a bit naive here but it's a bit saddening to know that many people around me are just as anxious or stressed as me. Maybe it's just me and my upbringing but at my college I am curious where the realness is? I literally don't even understand people anymore and I am unsure if people are just so different and absorbed into their own world or if people actually feel like I do but don't want to admit it.\n\n&#x200B;\n\nI just want to understand things and not be so hard on myself in these times and I can't tell if it's just a personal problem due to my lack of experience or if everybody is kind of struggling? There's just a lot going on in life right now and so much different things to think about it and I just wonder how people balance it or maintain a balanced mindset. \n\n&#x200B;\n\nSorry if this isn't the right place to post this I just want to know how other people feel in their college experiences in their own lives and interacting with others.",
  "author": "saltyman420",
  "created": 1544400299,
  "over_18": false,
  "upvotes": 634,
  "upvote_ratio": 0.96,
  "comments": {
    "ecpp9sn": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ecpp9sn/",
      "text": "\"I am unsure if people are just so different and absorbed into their own world or if people actually feel like I do but don't want to admit it.\"\n\nTrust me when it comes to shit like insecurities and issues, everyones got em, people are just really good at hiding them. Everyone in college experiences some sort of adversity, and some sort of mental hardship along the way, if not then they've never tried something new.  ",
      "author": null,
      "created": 1545979169,
      "upvotes": 1,
      "replies": {}
    },
    "ebjh8or": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebjh8or/",
      "text": "I like to think of high school as Super Mario Bros and college as Ninja Gaiden\n\n(yes I know I’m old.)",
      "author": "nightstalker962",
      "created": 1544498650,
      "upvotes": 1,
      "replies": {}
    },
    "ebj0c4e": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj0c4e/",
      "text": "I'm not entirely sure, I know that I don't really talk about it because it ends up overwhelming me and then I get into this funk where it's hard for me to be productive. Maybe it's just we all know that we're anxious, so what's the point of talking about it? But we should though, so people don't bottle up these emotions.",
      "author": "nocctea",
      "created": 1544484062,
      "upvotes": 1,
      "replies": {}
    },
    "ebij2s1": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebij2s1/",
      "text": "I think we all have some level of understanding that our generation is suffering the most under the status quo. We're killing ourselves with three jobs and eighteen ton course loads to compete for careers that might be fully automated before we even graduate.\n\nI promise you're not alone; I bet every one here has a secret spot for crying somewhere on campus.",
      "author": "jawkneecache",
      "created": 1544470408,
      "upvotes": 1,
      "replies": {}
    },
    "ebie8ew": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebie8ew/",
      "text": "because the difference between having a comfortable and prosperous future and being a wage slave failure for the rest of your life is the amount of right answers you have at the end of the final.\n\nPeople would understandbly be pretty stressed by that pressure.",
      "author": null,
      "created": 1544466861,
      "upvotes": 1,
      "replies": {}
    },
    "ebibo8x": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebibo8x/",
      "text": "Join student committees or clubs. These are great resources to get in contact with students who care and know your schools resources.",
      "author": "Tommy27",
      "created": 1544465017,
      "upvotes": 1,
      "replies": {}
    },
    "ebib9h1": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebib9h1/",
      "text": "Cause we are lol",
      "author": "TheFoodWhisperer",
      "created": 1544464709,
      "upvotes": 1,
      "replies": {}
    },
    "ebi9yqk": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi9yqk/",
      "text": "It's completely normal to feel that way in college. It's on of the biggest stressors people go through. Perservere. Be there for others.",
      "author": "DancingBearsGalore",
      "created": 1544463740,
      "upvotes": 1,
      "replies": {}
    },
    "ebi233y": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi233y/",
      "text": "[removed]",
      "author": null,
      "created": 1544457448,
      "upvotes": -2,
      "replies": {
        "ebi6ru0": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi6ru0/",
          "text": "Damn, cool story bro. Really dig the humble brag part of it.",
          "author": "saltyman420",
          "created": 1544461270,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebhytyb": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhytyb/",
      "text": "HAHAHAHA. Check my post history. On top of the failing economy our generation is inheriting and the imminent global changes that no one is doing anything about. ",
      "author": "goblue_throw",
      "created": 1544454617,
      "upvotes": 0,
      "replies": {}
    },
    "ebhyqrb": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhyqrb/",
      "text": "I recovered from my depression not too long ago and I think that admitting to that costed my job, so to the grave it goes. \nI mean, if it's someone I trust then I'll be open to them about my struggle, but if it's just an acquaintance then nope. The worse thing than being depressed is telling someone and they take it lightly. \nCollege does breed a lot of stress. One day, I'm confident with the materials and the next day, I feel lost again. Not to mention those extracurricular activities or those part-time jobs that they are doing, and I'm still sitting at home struggling with my homework. I feel incompetent, but I've learned to do things at my own pace now. Because I'll get there eventually. Realizing something I want to do and set myself to achieving it motivates me a lot. ",
      "author": "FlorenzP",
      "created": 1544454534,
      "upvotes": 1,
      "replies": {}
    },
    "ebhxlov": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhxlov/",
      "text": "Thats how college has always been. Its tough you have to be strong. College prepares you for the real world. And to be honest the real world isnt easy or nice. If we make college easy and having little to no stress then how are we preparing students for the real world where stress is very high? I understand that it sucks to be stressed out all the time but sadly thats life. Its filled with happiness too not all stress and exams. \n\n\nSo I think its a good idea for students to be stressed during college. Because it will prepare them for the real world.",
      "author": "GodOfThunder101",
      "created": 1544453463,
      "upvotes": 2,
      "replies": {}
    },
    "ebhx2ul": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhx2ul/",
      "text": "because people don't know the difference between being really stressed temporarily and having medical anxiety or depression. 90% of the people who complain about their depression or anxiety are really just stressed out and like to hop on the bandwagon. \"Omg I have student loans/debt, those stress me out, I'm so depressed about it.\" It's just incorrect and a hyperbole.\n\nI mean literally just read through these comments, it's just people saying how stressed they are *right now* (finals). I'd put money on that there are very few actually depressed or severely anxious people in this thread.",
      "author": "MetallicGray",
      "created": 1544452957,
      "upvotes": 6,
      "replies": {}
    },
    "ebhulix": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhulix/",
      "text": "Because modern life is not natural, healthy or sustainable ",
      "author": "mrjamesmario",
      "created": 1544450391,
      "upvotes": 7,
      "replies": {}
    },
    "ebhs1u1": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhs1u1/",
      "text": "I mainly hear a lot of people say they're anxious. I may be biased right now because I just got out of a microbiology lab exam that went really bad and I'm going to have a genetics one in an hour, but that really made me sad. The problem in my major is that the material is *A LOT* and I don't have the patience and time for that, although I still manage to find time, which results in isolation, and most of the time, I end up fucking up in the exams and that's really demotivating. I've never talked to anyone about this, so I don't know how my peers feel",
      "author": null,
      "created": 1544447579,
      "upvotes": 2,
      "replies": {}
    },
    "ebhrynd": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhrynd/",
      "text": "Depressed students rise up ✊",
      "author": "matrixvortex51",
      "created": 1544447472,
      "upvotes": 2,
      "replies": {}
    },
    "ebhqkf4": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhqkf4/",
      "text": "I’m not anxious or depressed. Majority of my friends are not either. \n\nIt’s stressful sure, but not at an inordinate level. I can’t wait to get back to working though. ",
      "author": "double-click",
      "created": 1544445657,
      "upvotes": 2,
      "replies": {}
    },
    "ebhpdsy": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhpdsy/",
      "text": "my question is, does things get better after college for most people?   \n\n\nI was just having a conversation with my brother who is married. They had a great deal living with a family member for cheap, but now they need to move out. They need to get their own place, but will be living at poverty levels. My brother who is in full-time school is talking about picking up extra shifts, but I was worried that too much work could conflct with school. I moved home to go back to college, but still work about 24hrs a week or more. I know people my age who work multiple jobs and barely make it. The stress is real. The anxiety that I could fail a class or lose my money is horrifying.   \n\n\nIMO life is very hard for many unskilled workers trying to go to school or work their way up to skilled work with higher wages.  Feels like a trap. Once im out of college will I even be able to get a job with no real experience?  The path to a livable wage is hard and I think many feel like it's so out of reach for them.  \n\n\nIm 25, but might be years away from making even slightly a livable wage and that doesnt feel good.",
      "author": null,
      "created": 1544443924,
      "upvotes": 2,
      "replies": {
        "ebhsn54": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhsn54/",
          "text": "I hope life gets better for you after college. I’m struggling to find a job right now, even if its an internship to gain experience in my field (Info Tech). \n\nMy life has been full of depression since 2014 after graduating with an Associate’s Degree (Graphic Design). Went back to college after realizing too many companies asking for Bachelor’s in Graphic Design or Fine Arts (back then). Couldn’t afford to go to a college that offered Bachelors in Fine Arts. So I stuck with my college to take on Bachelor’s in IT. Two semester away from graduating, the college got rid of Cloud Computing courses. Leaving me and a lot of students wondering what to take on from the other four choices left. Can barely find an internship company to take me in. A semester away from graduating and i’m feeling more stressed than I usually am. \n\nI told my professor, might as well several of use students try to start a company. Since no one seems to be interested in students with no job experience in the field. ",
          "author": "x_Animefreakgal_x",
          "created": 1544448273,
          "upvotes": 1,
          "replies": {
            "ebipjxt": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebipjxt/",
              "text": "Thanks, Im also doing info tech! Im 3 semesters from my B.S. I choose to go to a nearby budget state college so I could stay home. I just dont have the money and im not willing to get into tons of dept. I know a guy who just graduated with a masters in IT and has 60k+ debt. The guy is seriously struggling to find a job. Tech is supposed to be growing fast and there should be plenty of jobs, but its hard to get your foot into the door. Hope you find success",
              "author": null,
              "created": 1544475303,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ebhnwkg": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhnwkg/",
      "text": "Because college births depression and anxiety. Many people I know including myself, never had major signs of depression or anxiety until college. It forces a wave of depression over you due to making you feel like everything rides on grades, not to mention some, not all, professors enjoy watching students struggle and fail. I just recently in my senior year changed majors due to a professor who would not pass me and the appeal process at my university sucks, I had 4 more classes with that professor so I gave up on that major. \n\nAlso due to the environment drinking starts and that doesn't neccesarily help with depression or anxiety.",
      "author": "Anoncollegestudent1",
      "created": 1544441431,
      "upvotes": 3,
      "replies": {
        "ebhsx18": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhsx18/",
          "text": "My depression usually shows up during final exam week. \n\nI literally try to get 90s on the exam and exercise (when we have multiple tries). That way I can just get below 75% on Final Exam w/o worrying too much. \n\nI honestly would have given up on my major as well, if I was in your situation. ",
          "author": "x_Animefreakgal_x",
          "created": 1544448587,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebhif6k": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhif6k/",
      "text": "\nNot entirely sure if this is allowed here, seeing as I’m a graduate student, but I just finished up a large paper regarding anxiety, depression, and other mental health issues within undergraduate student populations. I’m working on my master’s in college counseling and student development.\n\nAnyways! Research shows that college-aged students are the most prone to anxiety, depression, and many other mental health issues. Reasoning for this comes from a ton of different factors including environmental, biological, and genetic traits. A sedentary lifestyle contributes to an increase in depressive symptoms. Frequent social media usage has been shown to increase symptoms of depression, decrease one’s self-confidence, and heighten feelings of insecurity. Familial pressures and issues with money and tuition leads to all sorts of mental health issues. \n\nAnother piece of research I found states that depressed students are subconsciously attracted towards those who also show signs of depression, which I find interesting. \n\nOverall, it’s important and wonderful that you’re doing your job to remove the stigma surrounding depression and anxiety among your friend group. Opening up those conversations with those around you can potentially lead to saving someone’s life if they are suicidal. However, it’s important to seek out counseling resources on or off campus if you feel you anxiety, depression, or other issues are starting to affect your every day life. Most on campus counseling services are free of charge as far as I know.\n\nI’m here if anyone needs to talk! Working with college students is my passion, and I have my own personal history with mental health issues. Stay Alive!",
      "author": "Kbiv",
      "created": 1544430501,
      "upvotes": 1,
      "replies": {}
    },
    "ebhhaji": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhhaji/",
      "text": "Man, I’m 26M and have been in various environments since graduating college, going from working retail, to an office job, to grad school, to working in a hospital as a nurse now that I’ve settled into a career finally.\n\n\nLet me say this: SO MANY PEOPLE are depressed and anxious. It’s unreal. In every environment I’ve been in and worked in, it seems like mental health issues are waaaaaay more prevalent than the CDC stats say.\n\n\nWe feel alone a lot, but I’m starting to think we all struggle. Or at least there are only very few that don’t.\n\n\nIt sucks, but it really shows how important doing anything and everything we can to take care of ourselves is.",
      "author": "ajc_129",
      "created": 1544428594,
      "upvotes": 8,
      "replies": {}
    },
    "ebhg6hc": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhg6hc/",
      "text": "I think that there are a bunch of different reasons.\n\n1. Certain people have chronic depression (like me) and end up going to college, which tends to make symptoms even worse due to stress\n\n2. People starting out in college may be experiencing extreme stress for the first time, or for the first time to this extent\n\n3. The main age group currently in college have had high expectations put on their shoulders and feel like they’re not meeting the expectations \n\nI’ve had chronic depression and generalized anxiety from a very young age, so these feelings now that I’m in college aren’t new to me. But, it’s definitely more intense now. I’m much more stressed because now I know that college classes are seriously counting towards my career, and the grades I get matter much more than in high school. I also don’t want to disappoint my family and friends. My family is counting on me to be the first person to get an actual degree in our family. I also want to have a successful future in which I love what I do, and I don’t wanna fuck it up. I wanna be a veterinarian, and it’s a whole lot of schooling and going into debt. I have to have pretty damn good grades to get into a veterinarian school. \n\nSorry if it seems like I ranted in this comment. I am so stressed lol. I hope that, whoever reads this, you do great on your finals and you have a much less stressful week. Good luck, everybody. Please remember if your depression or anxiety gets so bad to seek help, and if you’re in college, there are usually a bunch of resources that your advisors can connect you to. ",
      "author": "ddftgr2a",
      "created": 1544426691,
      "upvotes": 1,
      "replies": {}
    },
    "ebheatp": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebheatp/",
      "text": "Because on my only class left to pass to graduate college, I got a 68.6 percent. I need a 70 to get credit and graduate.",
      "author": "DwarfWarrior17",
      "created": 1544423948,
      "upvotes": 2,
      "replies": {}
    },
    "ebhe3td": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhe3td/",
      "text": "Because society is so fucking competitive these days. If you dare to sit back and smell the roses, some fucker is gonna beat you to the degree, beat you to the good job, and beat you to your dream girl. It's like you can't ever just relax because you're constantly being reminded how inferior you are and how you need to kill yourself to stay ahead.\n\nIt's fucking brutal and it's not sustainable.",
      "author": "jldude84",
      "created": 1544423685,
      "upvotes": 9,
      "replies": {}
    },
    "ebhdq05": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhdq05/",
      "text": "Since I’ve been here I’ve noticed how open everybody is about it. It’s almost like everyone has depression or anxiety or something and is just open about it. For me, this came as a huge surprise because i hide everything ",
      "author": "AleafFromtheVine",
      "created": 1544423183,
      "upvotes": 3,
      "replies": {}
    },
    "ebhbjin": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbjin/",
      "text": "I disagree. People are probably tired of hearing my bitching about finals ",
      "author": null,
      "created": 1544420373,
      "upvotes": 1,
      "replies": {}
    },
    "ebhahdk": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhahdk/",
      "text": "I hate the way society is formed. The only way I would be happy is if the whole thing collapsed and we were to rebuild it without any of our mistakes that make it so horrible in the first place. I feel as if today’s society is too big therfore it lacks a feeling of connection with our community. I wish it we lived in the simpler times. This whole paragraph sounds naive to any reader. The only thing that is certain is that I am not happy with our world today. I feel like technology has actually separated us. Our futures aren’t secure. Our economy heavily relies on oil. Climate change is making our future more uncertain. I want to change the world into what I want, something that will make it better for everyone, but its so overwhelming that the only thing I can think of are drastic measures. I’m unhappy with the global leadership (or lack thereof). I’m unhappy with our environment. I’m unhappy with our economy, where people slave away their time that they could be spending with their families. Life can be better, but it isn’t, and thats what makes me sad. I want the future for humanity to be full of promise, all I see is demise. We are sinking and we haven’t even noticed.",
      "author": "lifewithnofilter",
      "created": 1544419090,
      "upvotes": 6,
      "replies": {
        "ebi7gzn": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi7gzn/",
          "text": "This is a summary of all of my feelings, too. :c",
          "author": "cyansky95",
          "created": 1544461828,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebh944j": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh944j/",
      "text": "Today there are very few people who don't put up some sort of facade compared to how they actually are behind closed doors. This is not only true for people in college, but most people in life, and most people don't to show that side of themselves to people they don't trust.",
      "author": "kjd12345678900",
      "created": 1544417546,
      "upvotes": 1,
      "replies": {}
    },
    "ebh84gw": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh84gw/",
      "text": "The world is moving at such a fast pace today. Much more happens than I think we are meant to cope with on a regular basis. There are higher expectations for people to have an education, which is often required to get a job. Rent and prices of buying homes are higher than ever. College tuition is expensive as all hell. It’s hard to start off on the right foot once you leave the best because of how expensive things are. ",
      "author": "essentially_hannah",
      "created": 1544416519,
      "upvotes": 6,
      "replies": {}
    },
    "ebh7dxl": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh7dxl/",
      "text": "\"Hope you are having a fun finals week...\" \n\nBYE ",
      "author": "sexydaydreams",
      "created": 1544415796,
      "upvotes": 5,
      "replies": {}
    },
    "ebh7awo": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh7awo/",
      "text": "[deleted]",
      "author": null,
      "created": 1544415713,
      "upvotes": 1,
      "replies": {
        "ebhb661": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhb661/",
          "text": "This is exactly where I am at right now...\n\n&#x200B;\n\nI have traditionally been a loner and spent most of my high school times playing video games and on the internet. Now that I have gotten to college and have started interacting with more people and taking on bigger school workloads I have just been getting hit in the face by realizations after realizations. Definitely was not ready for all this and wish I was better prepared lol.",
          "author": "saltyman420",
          "created": 1544419915,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ebh79af": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh79af/",
      "text": "Just there's so many things and reasons. For example I had class this year that each week had 2-5 online worksheets AND quizzes. Some weeks I'd be turning in 10 assignments for one fucking classes. And then on the other end I have another class where my whole grade is based off 3 quizzes, and two discussions and that is it. Its stressful.",
      "author": "myalwaysthrowaway",
      "created": 1544415668,
      "upvotes": 1,
      "replies": {}
    },
    "ebh6rwo": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh6rwo/",
      "text": "Jesus y'alls outlook on life is really shitty, and I'm not trying to be rude. I'm thrilled to be at school, and I just thought \"I want to die lol\" was a meme",
      "author": "cdoran09",
      "created": 1544415202,
      "upvotes": 1,
      "replies": {
        "ebha93i": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebha93i/",
          "text": "Then you should get out more and talk to people, it's kinda what college is for.",
          "author": "rodut",
          "created": 1544418819,
          "upvotes": 0,
          "replies": {
            "ebhb3jl": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhb3jl/",
              "text": "? I don’t get your comment, mine was about having a positive attitude and being glad to be in the situation I am",
              "author": "cdoran09",
              "created": 1544419827,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "ebhm5lp": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhm5lp/",
          "text": "i actually feel bad for you and your naivety. \"I thought it was just a meme\" are you actually for real? I feel sad to live in a world with dumb idiots like you.",
          "author": "alexturner8",
          "created": 1544438051,
          "upvotes": -4,
          "replies": {
            "ebhxu38": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhxu38/",
              "text": "If you actually feel that way please get off reddit and contact somebody to help you. ",
              "author": "cdoran09",
              "created": 1544453685,
              "upvotes": 0,
              "replies": {}
            }
          }
        }
      }
    },
    "ebh6d9m": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh6d9m/",
      "text": "Honestly, those of us working in the higher education field and those working in mental health are trying to figure out the *why*; but you’re certainly not incorrect in recognizing that everyone seems to be anxious and depressed. Anxiety and depression (in that order) are the most common mental illnesses. The prevalence of mental illness has shot up on college campuses recently. Anecdotally, my mom is a counselor at a college, and her average daily number of appointments has more than doubled since she started her job 15 years ago; data-wise, there was a 62.9% increase in the number of mental health appointments made at college campuses across all of America *between 2015 and 2017 alone*, with only a 26.9% increase in available clinicians. Now, some of that can be attributed to the decrease in stigma. Appointments are increasing simply because people who may not have sought help a few years ago are now. But that doesn’t seem to account for all of such a huge increase. \n\nYou’re right, everyone *is* anxious and depressed. More so even than just a couple years ago. And those of us in education and mental health fields find the data is moving too quickly for us to pinpoint why, or how we can help. It’s really hard to help, especially, when the increasing need outpaces our budgets. We need more counselors and more campus programs for coping. But we can’t just increase a department budget by 63% in the blink of an eye, unfortunately.\n\nEdit - source: My mother is the director at a college mental health center. I myself work in higher education and am also working on a Master’s in higher ed administration. I just gave a presentation in class about mental health issues on campuses a couple weeks ago. I can link the source for my percentages if anyone is interested when I’m not using mobile.",
      "author": "lumabugg",
      "created": 1544414799,
      "upvotes": 11,
      "replies": {
        "ebhb2id": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhb2id/",
          "text": "Damn, thank you so much for your reply. \n\n&#x200B;\n\nThis is seriously fascinating to read knowing that it is an actual thing that mental illnesses are becoming more prevalent with statistics to back it up.  The why seems like such a complex issue to tackle though. Our brains and understanding of societal norms have become so skewed and fucking strange it seems like.",
          "author": "saltyman420",
          "created": 1544419791,
          "upvotes": 4,
          "replies": {
            "ebhpw8s": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhpw8s/",
              "text": "There are a number of possible reasons, and it’s probably a combination of factors.\n\nFirst, as I mentioned, my mom always likes to tell people that some of the change is positive. Stigma reduction means more students are seeking help, and that increases the statistics, but they were always there, just uncounted. Stigma reduction also means that more kids are getting diagnosed and treated in high school. In the past, these students would not have had the tools to be successful enough in high school to get into college. They can get into college now. That’s great news.\n\nBut, of course, some of it’s bad news, too. I’ve seen some hypotheses as to what may be happening. A big one is technology and social media. Cyberbullying is one part of it. The bigger problem, though, seems to be social media giving young people a skewed perception of others’ lives and what their lives should look like. People overwhelmingly only share the most positive life events on their social media. So as you scroll through, it just looks like everyone is accomplishing more than you and having a better time than you are. This makes people feel inadequate, anxious that they’re doing something wrong, and depressed that things aren’t going that well for them. In reality, we just don’t see the messy parts of people’s lives on social media. (I know I sound old blaming it on that damn social media all the kids are into, but I graduated high school in 2010, so I caught some of this, too.)\n\nAnother issue is that kids are not coming to college emotionally prepared. Schools are focusing more on academic preparedness for college than ever, leaving less time for life skills. Teens are less independent and more reliant on parents than in previous generations. Many leave their parents only to discover they’re not emotionally prepared to do things on their own. This creates anxiety.\n\nPersonally, I would also like to see some research, if any is available, on the link between various types of high-stakes/high-consequence situations and students’ mental health. When I was in high school, Ohio had one graduation test that you took in 10th grade, which meant you had two additional years to pass it if you didn’t the first time. Now, though, you have to pass subject matter exit exams and earn at least 18 points on these exams to pass or something. There are a few alternatives, but the state legislature eliminated a few of the simpler ones out of nowhere this year, and now 30% of seniors at the nearby high school, including honors students with high GPAs, are in danger of not graduating this year. I can’t imagine the anxiety that produces. Also, I’ve heard that after something like 3 absences from school in this district, your parents have to come talk with a truancy officer, even if those were all excused absences with a doctor’s note. But also, other aspects of life are higher stakes, too. Both my parents have stories of being underage teens drinking while driving, and the cop just telling them to dump out their beer and go home, or we’ll call your parents. Meanwhile, my younger brother was drinking underage in college and walked to a nearby pizza place to pick up the pizza he and his friends had ordered. The pizza place called the police on him for suspected public intoxication, he got arrested, spent the night in jail, ended up with underage drinking and public intoxication on his record. My parents got a lawyer to help him get it expunged from his record because the consequence of such a record is no one hiring him after he finishes college.\n\nParents drink underage while driving = “go home, kid.”\n\nOur generation(s) make the responsible choice to walk a couple blocks while drunk instead of driving = possibly no job after graduation. \n\nEverything is higher stakes. Everything has exaggerated consequences that didn’t exist just a couple decades ago. We’re raising kids afraid of making mistakes, which is a recipe for anxiety and depression. \n\nAnyway, that’s my rant on the matter.  ",
              "author": "lumabugg",
              "created": 1544444696,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "ebhedr5": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhedr5/",
          "text": "It's all from childhood trauma, one type or another. A child raised without trauma won't have a perfect life, but they will be able to handle the curve balls life throws at them when they get older. It's really very simple, but people get lost in the details, and the majority of people look back at their past with rose-colored glasses. I recommend for more info, and some great comedy, to look up episodes of Loveline from about 1999-2005. All on YouTube. Not for everybody, but you will learn a lot listening to it.",
          "author": "Wdf1987",
          "created": 1544424058,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebh5nfq": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh5nfq/",
      "text": "How would one go about getting help?",
      "author": "SaucyAndProvoking",
      "created": 1544414106,
      "upvotes": 1,
      "replies": {
        "ebh8hvv": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh8hvv/",
          "text": "Reach out to your school's counseling/health center, a trusted friend or professor. Sharing your problems can feel daunting but it can get you in contact who can help you or provide further resources!",
          "author": "kat_goes_rawr",
          "created": 1544416888,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebh5glf": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh5glf/",
      "text": "i'm just dying from finals, will i fail, we shall see.",
      "author": "JoshuaJamesworld",
      "created": 1544413920,
      "upvotes": 3,
      "replies": {}
    },
    "ebh58bj": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh58bj/",
      "text": "well i think everyone is struggling in some way, but i think people don’t talk about it because not everyone gets or understands mental illness. my boyfriend for example he doesn’t get it, there have been many times where i’ve been ridiculously anxious and i don’t know exactly why or the things that are making me feel like that he doesn’t think are big things. but he does try to do everything he can to help. but on the other hand, i’m positive that there are people who just don’t get it and/or that don’t want to understand. so i think that by not talking about it (for some people) it’s a defense mechanism; if they don’t talk about it people who don’t get it can’t downplay what they’re feeling. i hope that made sense! ",
      "author": "kcamp99",
      "created": 1544413700,
      "upvotes": 3,
      "replies": {}
    },
    "ebh4pih": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh4pih/",
      "text": "The same people probably also spend a lot on time on social media and pretend their real life is as good as their online one. Then, as everybody does, they go through things like college that are stressful or disheartening, but they're too ashamed to talk in fear of their \"persona\" being exposed. Everybody thinks they're special and different, and it can depress people when they realize they are just normal. Then there's the ones with bad childhoods who carry it around with them, for the same reasons, but they were depressed and anxious before attending college.",
      "author": "Wdf1987",
      "created": 1544413214,
      "upvotes": 1,
      "replies": {
        "ebhax42": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhax42/",
          "text": "This is actually me. I think I am a really weird person and I have strange tendencies and most people I talk to I don't really vibe with or feel like they really understand me. I am unsure if this is a product of me sucking at communicating or if I just am different.\n\n&#x200B;\n\nHow do I break this belief that I am so special? I would like to dumb things down and treat everyone and myself as equals.",
          "author": "saltyman420",
          "created": 1544419609,
          "upvotes": 5,
          "replies": {
            "ebhbih2": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbih2/",
              "text": "The bad childhood part or the online persona part or both? I think being a little more confident in the fact that you're not alone helps. Like me for example, I didn't have a friend until I was like 14-15. I felt like a loser all the time, but one day realized that strangers don't know that, and it took a lot of the pressure off me. But these things can be complicated if you let them, so my advice is to get therapy, if not to just have someone to be honest with without fear of being judged. Maybe spend less time online and fill that time doing something real that you enjoy, which will give you confidence too.",
              "author": "Wdf1987",
              "created": 1544420337,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "ebh2bm8": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh2bm8/",
      "text": "Nobody is anxious or depressed.  You’re just anxious and depressed.  Go to a gym and take a long run.  Better your life and listen to Jordan Peterson  ",
      "author": null,
      "created": 1544410980,
      "upvotes": -2,
      "replies": {
        "ebhbb4z": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbb4z/",
          "text": "Lol I do listen to Jordan Peterson. I go to the gym 3-4 times a week and have been meditating and trying to cultivate new habits and appreciate myself more. I can see the anxiety within me and I am trying to understand it and figure out how to solve it and one of the questions I asked along the way is that I wonder if other people feel like me or if I am just exceptionally anxious?\n\nI am doing everything  I can to better my life so that's why I posted this thread to see if other people feel the same way so I could be a bit easier on myself. Lo and behold many people feel the same way.",
          "author": "saltyman420",
          "created": 1544420084,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ebh29h8": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh29h8/",
      "text": "I’ve found that the key to alleviating stress and anxiety in college is to find what your good at. Find your art. Find something that you just can’t get enough of and make time to go do it, or simply read up on it.\n\nThings are gonna suck for now. For some of us more than others. But if more people would recognize their God-given gifts and talents, rather than try to be something they’re not, then happiness would increase ten-fold.\n\nIf you’re reading this, I encourage you to bloom where you’re planted. Find your niche and don’t get caught up in trying to impress people with a fancy career or lifestyle. It’s gonna be hard at first, but you will prevail creating something you love rather than draining yourself for the sake of a high-paying career which may actually not turn out to be as exciting as it’s hyped up to be.",
      "author": "awmurphy50",
      "created": 1544410922,
      "upvotes": 10,
      "replies": {
        "ebhas0b": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhas0b/",
          "text": "I just went into my degree field which is business  because I don't know what I want to do yet and I don't want to go into college to get a psychology degree (even though I am most interested in humans think and act)  and then be in debt forever and get some minimum wage job as  I come out of college. \n\n&#x200B;\n\nI am just trying a lot of different things right now and want to figure out what I am best at. Suppose that takes trial and error. ",
          "author": "saltyman420",
          "created": 1544419440,
          "upvotes": 3,
          "replies": {
            "ebhb4zv": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhb4zv/",
              "text": "You’ll figure it out in due time. It may not even be remotely near any field of study. College is a bit messed up in that it typically takes in impressionable teenagers who have no clue what the hell they actually want to do in life. But the truth is you don’t have to know. That’s what college is for: figuring out the path YOU want to take; not submitting to somebody else’s plan for you, even if it may “guarantee” safety and security. Keep truckin’. ",
              "author": "awmurphy50",
              "created": 1544419875,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "ebh1rme": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh1rme/",
      "text": "This isn’t just college. It’s all of society. Being someone that returned to school after six years away, I regret to inform you that it’s only worse on the outside and it’s not getting any better.",
      "author": "mvdtex",
      "created": 1544410457,
      "upvotes": 10,
      "replies": {
        "ebhaijj": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhaijj/",
          "text": "Well that's bleak, isn't there a silver lining somewhere?\n\n&#x200B;\n\nI know that life isnt easy but there have to be moments that are worth striving for right? I am very naive but I don't want to accept the fact that everything is just going to get progressively harder and more depressing. Like, what are we working towards? There has to be something greater or deeper we can strive towards and find meaning within right?",
          "author": "saltyman420",
          "created": 1544419127,
          "upvotes": 6,
          "replies": {
            "ebhbb5y": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbb5y/",
              "text": "I’m not sure that there is any greater or deeper meaning. What I do know is that you are more free now than you likely will be when you are done with school. Our perspectives fluctuate over time and we all have ups and downs. \n\nAlthough a lie, you may end up happier if you embrace religion and simultaneously convince yourself that your job has a meaning. That is where you will be spending the majority of your waking life after all.\n\nOr. Reject the well-trodden path, admit that we have no idea what the fuck is going on here, that specific claims to the purpose of life are likely bullshit, and that most jobs are not fulfilling. Along with this comes a struggle for identity and purpose, which will involve depression, anxiety, and potentially suicide. Keep fighting for a purpose that may never come, but hopefully will; and accept the great risk that is inherent to this path.",
              "author": "mvdtex",
              "created": 1544420085,
              "upvotes": 4,
              "replies": {
                "ebhbhmx": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbhmx/",
                  "text": "I like that last paragraph a lot. I have been meditating a lot because even if things are very average and hard and quite depressing I would like to atleast take all of this in stride and be peaceful with it and watch it pass and not get caught up in it. I like the idea of spirituality. Religion seems fake. \n\nI am going to save your last paragraph and look at it frequently. I believe that difficult path is entirely worth it no matter the risks because I want to truly understand and know as much as I can about this world before I pass. Things are pretty average and bleak this is true but perhaps I can eventually find something worth striving for or that transcends our basic consumer lifestyle.",
                  "author": "saltyman420",
                  "created": 1544420307,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "ebh4syc": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh4syc/",
          "text": "Everybody is a special and unique snowflake /s",
          "author": "Wdf1987",
          "created": 1544413294,
          "upvotes": -4,
          "replies": {}
        }
      }
    },
    "ebh0x4h": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh0x4h/",
      "text": "It's like that man, we live in a world with tons of free options for counselling and other help but people don't utilize them, which is in itself a symptom of depression.  Life is hard and wears on people, especially college students who may be having their first taste of responsibility and independence, it gets better though ",
      "author": "lanster77",
      "created": 1544409674,
      "upvotes": 1,
      "replies": {
        "ebh4zxm": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh4zxm/",
          "text": "A lot of them are in denial, or oblivious about it too. I remember being like 15-16 before I had a close friend and thought all the negative thoughts I would have were what everybody experienced. I imagine some of these people haven't had that epiphany yet, yknow? It's hard to snap out of something when you don't even know there's other options.",
          "author": "Wdf1987",
          "created": 1544413475,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebgzwo9": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgzwo9/",
      "text": "These problems are only perpetuated by social media.",
      "author": "nwzack",
      "created": 1544408733,
      "upvotes": 5,
      "replies": {
        "ebh1el9": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh1el9/",
          "text": "Yes, I agree. That's why I have quit using social media. I still use snapchat to communicate here and there but looking at instagram or peoples stories on snapchats is such a time sink and it only leaves me feeling envious and unsatisfied with my life.  I really think social media has more complications than we realize which is fucking up a lot of peoples self-esteem and confidence now a days. Myself included.",
          "author": "saltyman420",
          "created": 1544410123,
          "upvotes": 9,
          "replies": {
            "ebh56pa": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh56pa/",
              "text": "Just yesterday on r/insaneparents, I was down voted to hell for saying that the parent was doing the right thing by banning their kid from using social media. I would too if I ever had kids, God forbid.",
              "author": "Wdf1987",
              "created": 1544413655,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "ebgz9n3": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgz9n3/",
      "text": "Honestly I think it stems from just general growing hopelessness. I *think* we might be one of the last generations to have a typical lifestyle (typical meaning post-WWII career and home ownership typical). Knowing how difficult we (gen Y to early gen z) have it, I absolutely can't fathom how hopeless being 12 to 18 feels like right now. If you want a good life nowadays as a young adult, either you **need** to know someone that can hook you up with a decent or better career, *or*, you just can't fuck up as in you need to get a good degree, need to get at least a 3.0 gpa, and **need** solid internships or experience. This is the minimum, you honestly should have a good relationship with at least a few professors so they can go to bat for you.\n\nAll of this sounds obvious but it is a **ton** of work and there are few obvious ways around it. I know extremely talented, smart, and hard-working people that simply can't find good employment or opportunity out of college.\n\nI can't help but look at the status quo and the overall state of many people I know and how it's naturally going to become more difficult over time and think \"something going to have to give\", society can't expect absolutely everyone to be overachievers, lord knows there are way more smart-hard working people graduating college than there ever has been but there simply aren't enough jobs for all these qualified candidates.\n\nSo, hopelessness is why root as to why everyone is somewhat stressed in my opinion.",
      "author": "FondabaruCBR4_6RSAWD",
      "created": 1544408158,
      "upvotes": 24,
      "replies": {
        "ebh5djh": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh5djh/",
          "text": "I would argue that it's not hopelessness but laziness. A lot of things come way easier than they used to, and kids feel entitled rather than feeling they need to put in the work earning things like scholarships and connections, or even their basic income. Probably a combination of both hopelessness and laziness.",
          "author": "Wdf1987",
          "created": 1544413838,
          "upvotes": -12,
          "replies": {
            "ebh9fod": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh9fod/",
              "text": "This is just wrong, our generation doesn't have half the opportunity of generations before while incurring absolutely massive debt.\n\nHere's a comment from a boomer I saved, the askreddit thread was asking what young people have better or worse than when they were kids and it was full of responses like this.\n\n\"Worse today – Opportunity; be it for a job or owning a home or hoping for a future retirement. I was able to get part of my education through inexpensive community college, and my university degree, though I had to have loans, was not a killer expense. Today college costs are raising at almost double-digit. How can we have an informed democracy if the population has such barriers to literacy? My career spanned banking, human services and IT. All of those jobs I did were either eliminated or centralized making them a shell of what they once were. I have no clue what my grandkids will do for a living as AI takes more and more opportunities away.\"\n\nWe have it worse than our parents and grandparents in all ways from a professional opportunity standpoint, and the centennials will have it even worse than us. Maybe we'll work hard and solve these issues so our kids don't have to claw for meager opportunity and earnings.",
              "author": "FondabaruCBR4_6RSAWD",
              "created": 1544417903,
              "upvotes": 13,
              "replies": {
                "ebhc0ui": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhc0ui/",
                  "text": "I completely disagree. I think those excuses are the entitlement and laziness I was talking about. They think the world owes them a good career and a house and car, but don't want to put in the effort. They'd rather take the easy way out and spend their time partying or taking pointless classes for degrees that don't lead to good and available jobs, and there's plenty out there. There will be even more coming with all these trade deals and stuff bringing production back to the US. ",
                  "author": "Wdf1987",
                  "created": 1544420994,
                  "upvotes": -10,
                  "replies": {
                    "ebhsrla": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhsrla/",
                      "text": "Oh, obvious troll is obvious.\n\nGo to a sub with more activity if you’re going to do this, you’re just wasting your time here.",
                      "author": "FondabaruCBR4_6RSAWD",
                      "created": 1544448417,
                      "upvotes": 7,
                      "replies": {
                        "ebht4m2": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebht4m2/",
                          "text": "No trolling by me. Sorry you disagree but at least offer a counter point. Nothing I said was wrong or outrageous. I almost said it's common sense just now, but apparently it isn't. What's common now is a sense of entitlement and inability to do the smart thing over whatever feels good at the moment. We all have the same opportunities here in America. Whether you take advantage or not is a personal choice. Choose whatever you want, just don't complain when you do it wrong.",
                          "author": "Wdf1987",
                          "created": 1544448826,
                          "upvotes": -6,
                          "replies": {
                            "ebi3nf9": {
                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi3nf9/",
                              "text": "\"We all have the same opportunities here in America.\" I am legitimately laughing at this statement right now bro. You didn't even take into account someone's income level, geographic location, family background or anything of that nature. The fact that you think people are depressed and anxious because they're entitled is a ridiculous notion.",
                              "author": "no_boy",
                              "created": 1544458754,
                              "upvotes": 5,
                              "replies": {
                                "ebi3w2k": {
                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi3w2k/",
                                  "text": "Pretty sure you're the one trolling..",
                                  "author": "Wdf1987",
                                  "created": 1544458950,
                                  "upvotes": -1,
                                  "replies": {
                                    "ebi4dhs": {
                                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi4dhs/",
                                      "text": "I'm not even the same guy",
                                      "author": "no_boy",
                                      "created": 1544459344,
                                      "upvotes": 1,
                                      "replies": {
                                        "ebi4oog": {
                                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi4oog/",
                                          "text": "Doesn't mean you're not trolling. Those excuses from you two are exactly what I'm referring to when I say entitled and lazy.",
                                          "author": "Wdf1987",
                                          "created": 1544459600,
                                          "upvotes": -1,
                                          "replies": {
                                            "ebiapep": {
                                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebiapep/",
                                              "text": "If you look at those factors as excuses and not explanations then we're in two different schools of thought. I'm not saying that no one should have any sense of self responsibility, but to pretend everyone's on an even playing field is a classic bootstrap ideal. ",
                                              "author": "no_boy",
                                              "created": 1544464296,
                                              "upvotes": -1,
                                              "replies": {
                                                "ebic38e": {
                                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebic38e/",
                                                  "text": "Short answer is bad parents lead to bad decisions. Then we'd argue what makes a \"bad\" parent. Look, out of the two of us, I've gone from literally homeless for 7 *years*, to being a manager at a business *while* homeless. Two years later and now I'm in my 2nd year in college so I can get an even better job and I'm in a house in a different state, and I just had surgery on the 7th for the injury that led to me being homeless in 2010.  \nSure, we all experience tough times, but that doesn't change the fact that it's up to us to make it better for ourselves, and that if we choose not to, but still expect a good life, we are lazy and entitled. I'm speaking from experience from the lowest place you can be, so I really do know what I'm talking about. If I had had a kid along the way, that would make me a terrible parent, especially if I expected sympathy and money for it. Improving your own life is not impossible, and most people would rather make excuses than put in the effort. \nSorry to lay that all on you but it pisses me off when people try to preach to me that life in the US is too hard or they were born into situations they just cannot be bothered to overcome.",
                                                  "author": "Wdf1987",
                                                  "created": 1544465320,
                                                  "upvotes": 4,
                                                  "replies": {
                                                    "ebj3cao": {
                                                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj3cao/",
                                                      "text": "Ahhh, you're an active user on r/The_Donald lmao. We're probably not going to come to an agreement on anything bro. Either way it's good to hear that you were able to overcome your circumstances and I wish you well in the future.",
                                                      "author": "no_boy",
                                                      "created": 1544486687,
                                                      "upvotes": -5,
                                                      "replies": {
                                                        "ebj4lif": {
                                                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj4lif/",
                                                          "text": "Wow, so you didn't read the comment and decided to snoop at my account, just so you can try insulting me instead of actually understanding my story. Or, you did read it but have nothing constructive to say, or even any valid criticisms or ideas, and fell back on the typical SJW insult of \"OMG, you like Trump\", like that somehow invalidates my entire life and the whole point of my very personal story. Dude, out of the two of us, you're a total piece of shit, that is obviously a lazy, immature and entitled asshole. Congratulations, you can be socially retarded and lack any critical thinking skills. How tolerant and accepting of you. Typical SJW.",
                                                          "author": "Wdf1987",
                                                          "created": 1544487802,
                                                          "upvotes": 6,
                                                          "replies": {
                                                            "ebj73c2": {
                                                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj73c2/",
                                                              "text": "😂🤣😂🤣 You obviously got some real internal issues brother. I hope you get the help you need. All I said was we wouldn't agree on much because of your subreddit choice and you jumped to calling me a piece of shit. Quite ironic if you ask me.",
                                                              "author": "no_boy",
                                                              "created": 1544490062,
                                                              "upvotes": -3,
                                                              "replies": {
                                                                "ebj7ox8": {
                                                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj7ox8/",
                                                                  "text": "You'll go through tough times one day too, and you won't have a clue what to do once you're in them. Like I said, laziness and entitlement. You could be the poster child.",
                                                                  "author": "Wdf1987",
                                                                  "created": 1544490595,
                                                                  "upvotes": 5,
                                                                  "replies": {
                                                                    "ebj7zl5": {
                                                                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj7zl5/",
                                                                      "text": "Because you definitely know everything about me like I must know everything about you 😂🤣😂",
                                                                      "author": "no_boy",
                                                                      "created": 1544490853,
                                                                      "upvotes": -2,
                                                                      "replies": {
                                                                        "ebj9h7o": {
                                                                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj9h7o/",
                                                                          "text": "You're too afraid to say anything about yourself. I wasn't. I was actually trying to help you. But you can't help someone who won't help themselves.",
                                                                          "author": "Wdf1987",
                                                                          "created": 1544492122,
                                                                          "upvotes": 3,
                                                                          "replies": {
                                                                            "ebjap7n": {
                                                                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebjap7n/",
                                                                              "text": "Damn man, you were mad enough to make a whole post about me on r/The_Donald. That shit's crazy bro lmao. AND YOU BLACKED OUT THE PART WHERE I CONGRAGULATED YOU😂🤣😂. You just can't make this shit up man. I guess I'm still the piece of shit though right?😂",
                                                                              "author": "no_boy",
                                                                              "created": 1544493143,
                                                                              "upvotes": 2,
                                                                              "replies": {}
                                                                            },
                                                                            "ebj9t8b": {
                                                                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj9t8b/",
                                                                              "text": "I'm not looking for a therapist on Reddit bro😂🤣 Y'all dudes be having me straight dead lol.",
                                                                              "author": "no_boy",
                                                                              "created": 1544492397,
                                                                              "upvotes": 1,
                                                                              "replies": {}
                                                                            }
                                                                          }
                                                                        },
                                                                        "ebj8rq5": {
                                                                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj8rq5/",
                                                                          "text": "[deleted]",
                                                                          "author": null,
                                                                          "created": 1544491525,
                                                                          "upvotes": 3,
                                                                          "replies": {
                                                                            "ebj9qb7": {
                                                                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebj9qb7/",
                                                                              "text": "Yeah you read someone's comment in one certain sub, then base your entire picture of the individual on said comment. Are you following me Teddy😂🤣 Y'all dudes project a lot of your insecurities onto others.",
                                                                              "author": "no_boy",
                                                                              "created": 1544492328,
                                                                              "upvotes": 1,
                                                                              "replies": {
                                                                                "ebjczw0": {
                                                                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebjczw0/",
                                                                                  "text": "[deleted]",
                                                                                  "author": null,
                                                                                  "created": 1544495070,
                                                                                  "upvotes": 3,
                                                                                  "replies": {
                                                                                    "ebjdv15": {
                                                                                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebjdv15/",
                                                                                      "text": "It doesn't feel like anything because this is the internet.",
                                                                                      "author": "no_boy",
                                                                                      "created": 1544495773,
                                                                                      "upvotes": 1,
                                                                                      "replies": {}
                                                                                    }
                                                                                  }
                                                                                }
                                                                              }
                                                                            }
                                                                          }
                                                                        }
                                                                      }
                                                                    }
                                                                  }
                                                                }
                                                              }
                                                            }
                                                          }
                                                        }
                                                      }
                                                    }
                                                  }
                                                }
                                              }
                                            }
                                          }
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "ebhi4lq": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhi4lq/",
                      "text": " I think the key word here is \"opportunity.\" The view you seem to have is that the good jobs are out there, people just aren't willing to work for them. In my experience that is not the case. People are competing for fewer jobs that will support a family in the current economy. There are many more jobs that do NOT pay to support even one person adequately.   \n\n\nYou might say that having a family is a luxury, and that may be true. The birthrate in the US is plummeting. This is an example of millennials seeing the writing on the wall and not having children until they are financially ready-- if ever. We are making these difficult decisions that it doesn't seem our parents had to, because our opportunities differ. \n\n&#x200B;\n\nThis is anecdotal, but the white collar workers in my office who have been there for twenty-thirty years constantly complain about how hard our work has gotten, how stressed they are, how fast the production pace is. How everything has changed in the last 5-10 years and become terrible-- with evidence to back it up in the form of citing policy changes. Meanwhile, I'm thinking about how much better it is to work where I am than the grueling and degrading life I had as a part-time server for two years (!) after I got my  B.S. in a STEM field. ",
                      "author": null,
                      "created": 1544430001,
                      "upvotes": 7,
                      "replies": {
                        "ebhphck": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhphck/",
                          "text": "Having a family IS a luxury. If the rate is dropping, that is good. People are making better decisions, and there's no shortage of kids needing adoption. But you show me someone with no college degree, no career, living off welfare and still having kids, and I'll show you an irresponsible, selfish, entitled moron that thinks the world owes them happiness and easy life. Nobody makes someone choose bad jobs, choose to get pregnant when they can't afford it, choose to hate their choice of career, or the company they work at. These are all bad decisions people make, and bad attitudes about them, not lack of opportunity. Move to a new state, new city. Get a different degree in the first place by learning from other people's mistakes, etc. But come on, if someone is so out of it and stubborn they make all the wrong choices, they only have themselves to blame, and they're setting terrible examples for the children they have.",
                          "author": "Wdf1987",
                          "created": 1544444075,
                          "upvotes": -3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ebgz14q": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgz14q/",
      "text": "I find that everybody is depressed and anxious, and everybody is pretty open about it all around me, both casually and in actually reaching out for help. I feel like it's so common to talk about it that it's not even that unique anymore, but maybe this is my own biased experiences. \n\nCollege just breeds endless stress. Think about it. Even if you get all of your work done that is due tomorrow, there's still that exam in two days, that paper due at the end of the week, the major project due at the end of the term. Add extracurriculars and work on top of it, and even if you stick to a strict schedule, it's never over, and there's always more you feel like you can be doing. It drains you emotionally, and makes it hard for you to find time for self care. And the situation I'm describing is one without any extra stressors added on, like interpersonal problems, mental health issues, or excessive struggling in one or more courses. \n\nWhen you're working, assuming that you don't take work home, then the stress is not constant. You know when you have to work, you know for how long, and you know that you don't have to take it home with you. And you know that all of the time outside of your work hours is your own time. Assuming you don't have any major issues on top of that, then it's a lot easier to handle the stress and anxiety and depression. At least personally, when I was working internships, my mental health flourished compared to when I was in class. ",
      "author": "Chasethehorror",
      "created": 1544407940,
      "upvotes": 66,
      "replies": {
        "ebh82a6": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh82a6/",
          "text": "I would like to add that as majority of college students are around 18-22 and we are thrusted into adulthood/college life but don't have the experience of these types of situations as we don't have much life experience at all. As a result, this probably triggers stress.",
          "author": "kat_goes_rawr",
          "created": 1544416459,
          "upvotes": 15,
          "replies": {
            "ebh9ze1": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh9ze1/",
              "text": "Yeah I was 17 going into college because of my late birthday. It was not a good time. I was not prepared at all. Already having severe depression and then multiple deaths in the family throughout my first year didn’t help to much either.",
              "author": "Functional_Sus",
              "created": 1544418514,
              "upvotes": 7,
              "replies": {}
            },
            "ebhdklw": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhdklw/",
              "text": "That's very true. I was raised to be very afraid of authority figures and to be a people pleaser (I'm not exactly looking fondly at my childhood but this is the one time it's a perk), so I've always managed to do well in college based just off of that, even though there really isn't anybody regulating me at college. If I didn't have that engrained fear, then I doubt I would be as successful as I am.\n\nThere's just so many things that can go wrong when somebody goes off to college alone. If somebody isn't mature enough, then they're going to struggle.",
              "author": "Chasethehorror",
              "created": 1544422988,
              "upvotes": 6,
              "replies": {}
            }
          }
        },
        "ebh6rx3": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh6rx3/",
          "text": "Well said",
          "author": null,
          "created": 1544415202,
          "upvotes": 4,
          "replies": {}
        },
        "ebhen44": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhen44/",
          "text": "Well said! I live with two other people who just work full time jobs instead of college, and I'm always jealous of all the strees-free free time and money they have!",
          "author": "KingofLurker",
          "created": 1544424420,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebgym9p": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgym9p/",
      "text": "(To the tune of Old MacDonald)\n\n🎶I'm so stressed that sunlight hurts, I am god's mistake🎵\n\nBut real talk, yeah. Most of my peers are struggling, and they don't talk about it much. Between being absolutely crushed by debt, unhelpful administration/professors, and absolutely abysmal mental health care available to us, life is pretty damn hard. That fosters an environment that isn't great for people, especially volatile stressed students in their early 20s. I just want a break, man. ",
      "author": "Simplemindedflyaways",
      "created": 1544407562,
      "upvotes": 2,
      "replies": {}
    },
    "ebgydoz": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgydoz/",
      "text": "I don't know about everyone else, but everyone has different reasons for why they are anxious/depressed. I feel depressed and anxious because my best friends from high school betrayed me, and its hard to trust anyone anymore. I feel lonely at college, and seeing everyone having friends and going out just makes me want to stay in my room and cry lmao. I'm taking an intro to biology class, and it's ridiculously hard so there's that too",
      "author": "caelinday",
      "created": 1544407342,
      "upvotes": 3,
      "replies": {
        "ebi8i22": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi8i22/",
          "text": "I feel exactly the same, you're not alone in this. \n",
          "author": "Coolmeow",
          "created": 1544462622,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ebgxoxu": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgxoxu/",
      "text": "That's a great question. There definitely seems to be more now compared to when I was in college (1998-2008). \n\nI've been told by psychology staff that, for whatever reason, a lot of the parents in the current generation of college students did a poor job of preparing them for stress. Things like participation trophies to avoid emotional pain and never letting kids get hurt to avoid physical pain have snowballed into an enormous number of people who are ill-prepared to handle the stress associated with University.\n\nAll that said, I have no idea if that's true or not and haven't seen any research discussing it one way or the other. Just hearsay from someone who does know that field intimately. Is be interested to hear back from the community on whether they feel this is true or not. They say the current generation of parents is doing a much better job of preparing their children. \n\nThere is also the issue of NCLB and similar policies impacting the preparedness of students getting into college. Entrance standards have decreased as well. This means that a larger number of students are going to college who are going to struggle significantly with college level coursework. That one isn't hearsay. I've seen those numbers.",
      "author": null,
      "created": 1544406708,
      "upvotes": 10,
      "replies": {
        "ebh0uc0": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh0uc0/",
          "text": "> Things like participation trophies to avoid emotional pain\n\nThose trophies make the people who get them embarrassed because they know they don't deserve it. The trophies are so the *parents* feel better, not the kids. No one likes them, and I remember in primary school that if you got one of the participation ribbons in the sports carnival you'd either throw it away or hide it. Those things are giant beacons of shame to children. ",
          "author": "NoxiousQuadrumvirate",
          "created": 1544409602,
          "upvotes": 11,
          "replies": {
            "ebh4zxz": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh4zxz/",
              "text": "Interesting... I've honestly never thought of it before since I predate them and have no children. \n\nMaybe that is part of the issue in stress then, children being slammed from a young age with inferiority trophies.",
              "author": null,
              "created": 1544413475,
              "upvotes": 1,
              "replies": {
                "ebh5iv4": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh5iv4/",
                  "text": "Just imagine being the slow kid who comes in dead-last, and then the adults give you a bright yellow ribbon for it. It's like they're saying \"wow, congratulations on being a loser, here's a neon sign so that all the other kids know you're a failure from 50 yards away\". If anything, it actually made losing a *crushing* experience because you couldn't just brush it off and forget. People were drawing attention to every single one of your failures. \n\nYou'd be less likely to participate wherever you could. You only get those trophies if you lose, and you can't lose if you avoid all challenges altogether. So then you don't do anything unless you're fairly certain you can get in the top 3 or win or whatever. ",
                  "author": "NoxiousQuadrumvirate",
                  "created": 1544413983,
                  "upvotes": 9,
                  "replies": {
                    "ebh71fv": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh71fv/",
                      "text": "I totally get what you're saying. It makes perfect sense. It's pretty depressing.\n\nI suppose even in \"my day\" in school, where participation trophies didn't exist, the worst thing was being picked last in gym class, or being first out on the spelling bee.",
                      "author": null,
                      "created": 1544415459,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ebh5mh3": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh5mh3/",
              "text": "Kids these days are being force-fed tolerance now so I imagine that the shame that used to go with things like that has been replaced with good feelings, though I can't think of the right adjective for it. Not happiness or accomplishment, but maybe muted indifference.",
              "author": "Wdf1987",
              "created": 1544414080,
              "upvotes": -3,
              "replies": {
                "ebh6bto": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh6bto/",
                  "text": "... what?\n\nShame and embarrassment *can* be taught by social repercussions, but a lot of it doesn't have to be. Very young children (under 2 years old) will start to show embarrassment when they make mistakes; it's something hardwired in the brain that helps with social cohesion. I mean, how do you think you \"just know\" when you've said something cringey? You didn't really learn that, just like you didn't really learn language or how to walk - it was already there. \n\nLacking that awareness and ability to feel embarrassed would make you developmentally delayed at best, and seriously cognitively disabled at worst. People on the Autism spectrum have incredible difficulty in picking up the non-verbal cues during socialisation that they've done something \"wrong\", so they don't feel embarrassed at the right time, and then go on to make the same social faux pas again and again. They must be taught by a professional to recognise the signs, and even then, it's not innate. Autism is a condition that affects brain development, and it'll never be totally \"natural\" to them. \n\nIt's an automatic human response in a typically-developing person. It doesn't matter how much you \"force-feed tolerance\" (whatever the fuck that means), people feel a little bit embarrassed when they make mistakes in the presence of other people. ",
                  "author": "NoxiousQuadrumvirate",
                  "created": 1544414761,
                  "upvotes": 3,
                  "replies": {
                    "ebh6t16": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh6t16/",
                      "text": "That's kinda what I said in a separate comment, and alluded to in this one you're replying to. Yes, every normal person will experience the full human range of emotions, but due to this extreme push for tolerance, they can either ignore the meaning behind those feelings (like shame) because people accept them anyways and they end up confused and depressed and anxious because they know something is wrong but are being told they're normal. Or they don't want to bring anything up out of fear of losing their social status, whatever that may be, because even with all the tolerance preaching, people still feel different or not good enough, etc sometimes. So they get depressed and anxious about it and hide it, rather than risk being intolerant of someone else who feels the same. I may not be wording this right, and it is a confusing double standard type thing, but it's real.",
                      "author": "Wdf1987",
                      "created": 1544415234,
                      "upvotes": -1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "ebgz38h": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgz38h/",
          "text": "I really don't think it's the participation trophies personally, haha. They're mostly for parents, anyway--I always saw participation trophies as a sign you lost (which you did).\n\nI think a lot of stress can be attributed to the money issue. There is SO much financial anxiety, colleges aren't paying or investing in actual good professors, mental illness is at an all-time high but still there's like 2 counselors for a school of 40k kids...it's no wonder people are more stressed, honestly! It's not even an option to go to college anymore. You /have/ to pay at least some sum of money to get a job, since even entry-level jobs want at least a bachelor's degree.",
          "author": "-Knockabout",
          "created": 1544407992,
          "upvotes": 10,
          "replies": {
            "ebh4x5b": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh4x5b/",
              "text": "While I also agree that the financial aspects are a huge stressor for students i actually disagree with you the need for a college education. There are still a lot of jobs in the trades that require no education and they are hurting for people. And they pay better than all the English and psychology degree holders I know that work in gas stations and Starbucks. They aren't glamorous, but neither is retail or food service.\n\nI think only about 50% of students going to college should actually be going. That's why the dropout rate is so high. I have a few advisees that literally fail everything every semester and keep going at it. And there are SO many more of them than most students realize. Especially at community colleges and regional state schools. I also think it's unethical for schools to take students with a 13 ACT expecting them to succeed, yet, that's where we are.",
              "author": null,
              "created": 1544413400,
              "upvotes": 3,
              "replies": {
                "ebh83h5": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh83h5/",
                  "text": "Which jobs? Trade school is of course always an option, but I also think I'm safe in saying that the majority of jobs (which are ethical, with decent pay) will require a degree of some kind. \n\nI do think you're kind of touching on what I am--why would people with actual degrees be working in gas stations and Starbucks? Is it because the degrees themselves are worthless, or because people are chronically underemployed and underpaid, you know? And it's not like people are going to college and going into massive debt because they /want to do that/. It's expected. \n\nI can definitely say that my school never even mentioned an option other than college. There is an undeniable pressure there. Even if there are technically other options I would argue there aren't enough.",
                  "author": "-Knockabout",
                  "created": 1544416492,
                  "upvotes": 1,
                  "replies": {
                    "ebh95co": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh95co/",
                      "text": "Strangely enough for a professor, I come from a very blue collar family. My brother is a mechanic, and worked automotive for about 20 years, but got out of it to work in repair and maintenance of industrial cleaning equipment last year. He goes into factories, warehouses, manufacturing facilities, etc... and apparently they are ALL always looking for good employees. They have a huge issue with hiring reliable people who can pass a drug test. He never had a hard time finding work as a mechanic, but now that he's working closely with the manufacturing industry, he is seeing that there is a huge number of unclaimed jobs for people willing to do them there also. Driving large trucks, construction, manufacturing, repair work, etc... all need people, none of them are glamorous, but they generally pay decent (far better than retail or food service). The problem is many people want a white collar job and won't even consider these other careers even though they pay well and have benefits.   \n\nAs far as why people with degrees can't get \"good\" jobs, I really think it's because there are simply too many people getting degrees compared to the number of jobs for people with those degrees.  ",
                      "author": null,
                      "created": 1544417583,
                      "upvotes": 4,
                      "replies": {
                        "ebhadnz": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhadnz/",
                          "text": "Yeah, that's a valid point. Trade school is an option, blue collar jobs are an option and absolutely necessary for daily life (though not everyone can handle labor-heavy jobs physically, which can limit options, especially those with any sort of disability). But I do think that college still is essentially necessary, at least socially. You've probably been out of school for some time if you're a professor, but I guarantee kids aren't being told they can go to trade school, or community, or just find a job. It's 4 year university or bust.",
                          "author": "-Knockabout",
                          "created": 1544418969,
                          "upvotes": 2,
                          "replies": {
                            "ebhbb4h": {
                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbb4h/",
                              "text": "I KNOW they are being told that, and I think that needs to change. It started back in the 90's telling everyone they had to go to college or they would be a failure, which is when I was coming up so I got that too.  \n\nIt's doing a terrible disservice to the education in this country though. Let me give you some VERY typical examples of how this is such a terrible way to approach careers:\n\n1. Susan hated school in K-12 and always just got by. She is told she needs college. She wants to be a doctor. She comes from a working class family that can't afford to send her to college, so in her quest to be a doctor, she takes the ACT, gets a comprehensive score of less than 20, and comes to college on loans. She flunks every major class her first 2 years until the school kicks her out. At this point, she owes about $400/month in student loan payments, and is in no better position to pay them off than when she was 16 working at Subway.\n\n2. Randy likes school but mostly for the social aspects. He gets student loans and pledges his first semester. His grades quickly tank as he dives headfirst into the social side of university. His professors email him but he never answers them. He's kicked out after one semester and is now ineligible for future student loans due to his professors reporting him as a \"no attendance\" student. \n\n3. Megan came to college though she didn't care much for school. She wants to study music, and always liked being in the school choir. She majors in vocal performance, and takes 5 years to get her bachelor's degree. Some of it was scholarships, some was loans. She was great at singing but music theory she had to retake a few times, and she struggled with her required math and science courses. She has graduated with $40K in debt, a 2.7 GPA, and a major in singing. She works at the local gas station and owes $500 of her $1,400 monthly salary in loans. She lives in a flat with 5 other people.\n\nIf I told you how many literal hundreds of students I've seen that fall into 1 or 2 or 3 above, you would cry. These people NEVER should have gone to college at all and would actually be much better off financially if they hadn't. I've had much more success in students who join the military first, or students that are top students from high school anyway. There is an issue with grade inflation right now, but I highly suspect a lot of it is because we are having to dumb down the material for a classroom half full of mediocre students. ",
                              "author": null,
                              "created": 1544420083,
                              "upvotes": 6,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ebi9gvy": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi9gvy/",
          "text": "I think a lot of kids have grown up today being told they’re special, great, and smart. \n\nSchool may also be easy. I’ve heard a lot of teachers and schools are trying to pass all their students, whether they deserve it or not. \n\nSo if you have a kid who does well in school with minimum effort, not studying or trying too hard, and put them in college where they have to actually study and do good work, they may struggle. That combined with being told you’re great all your life can have a negative effect on how you see yourself when you start not being great anymore. ",
          "author": "Comrox",
          "created": 1544463368,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ebgxfkw": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgxfkw/",
      "text": "because once you get that shiny degree its practically worthless unless you know how to network and make connections-\n\n&#x200B;\n\nfuture looks bleak- most college grads are not working in the field they majored in- stuck working dead end jobs-\n\n&#x200B;\n\nits a know somebody to be somebody type system and the system is rigged against you.\n\nsomething the college will not teach you. how to network. and how the real world works as opposed to the \"just get a degree meme\"",
      "author": "RandomStudentHere",
      "created": 1544406471,
      "upvotes": 8,
      "replies": {
        "ebgyfj9": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgyfj9/",
          "text": "Alright, this is true.but if you dont have your degree, it doesnt matter who you know. The trick is making connections, having a degree, and putting yourself out there. ",
          "author": "shdylady",
          "created": 1544407388,
          "upvotes": 5,
          "replies": {
            "ebgyiu1": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgyiu1/",
              "text": "but colleges dont teach you how to network and make connections. also most the time the field you end up working in through connections, literally 90% of the stuff you learned in college has nothing to do with it- and you end up learning on the job. classes like calculus, eng 102, lit, has nothing to do with business field.",
              "author": "RandomStudentHere",
              "created": 1544407475,
              "upvotes": 4,
              "replies": {
                "ebh08q4": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh08q4/",
                  "text": "My college promoted networking. Regardless, if you dont have the degree, often you dont qualify for the job. Or it's a reason to pay you WAY less. ",
                  "author": "shdylady",
                  "created": 1544409046,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ebgxo0a": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgxo0a/",
          "text": "Lol shit these are basically all of my worst fears. If it’s anything I’ve seen it’s all about who you know and the impressions you make. Do you know how to network?\n\nI’m going into business field of supply chain and I have literally no idea what to say to these people or how to make a good impression.",
          "author": "saltyman420",
          "created": 1544406684,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebgwus7": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgwus7/",
      "text": "Its freaken stressful. You cannot get an internship without experience, but to get a job you need an internship. Then there is student loans, shitty bottom barrel teachers, parking fees, books, etc. Stressful as fuck",
      "author": "LinShenLong",
      "created": 1544405951,
      "upvotes": 16,
      "replies": {
        "ebh5bpr": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh5bpr/",
          "text": "God the internship thing is too true. It keeps me up at night. ",
          "author": "SaucyAndProvoking",
          "created": 1544413791,
          "upvotes": 6,
          "replies": {
            "ebhan16": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhan16/",
              "text": "Literally in the midst of trying to land an internship for this summer and have been applying endlessly but nobody has gotten back to me. ",
              "author": "saltyman420",
              "created": 1544419274,
              "upvotes": 8,
              "replies": {
                "ebhbhn8": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbhn8/",
                  "text": "What year are you in? I'm a senior so if I don't get an internship for the spring or the summer (I really need both but I'd be giddy with just one) I'm pretty much screwed. ",
                  "author": "SaucyAndProvoking",
                  "created": 1544420308,
                  "upvotes": 4,
                  "replies": {
                    "ebhbj5a": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbj5a/",
                      "text": "I am a junior currently. I have been stressing about finding one before times up but that seems like you x2. I hope you find one. LinkedIn is a good place to look!",
                      "author": "saltyman420",
                      "created": 1544420359,
                      "upvotes": 6,
                      "replies": {
                        "ebhbtbn": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbtbn/",
                          "text": "Honestly LinkedIn is a bit of a dog's ass, the few interviews I've managed to land have been through networking/career events, so def take advantage of those if your uni hosts any. Good luck to you too! ",
                          "author": "SaucyAndProvoking",
                          "created": 1544420722,
                          "upvotes": 5,
                          "replies": {
                            "ebhc0jc": {
                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhc0jc/",
                              "text": "Yeah I have been attending a lot of meetings for recruiters to come too and it seems like meeting up in person has a much better effect than not. How have you been looking for jobs? Will take any advice.",
                              "author": "saltyman420",
                              "created": 1544420983,
                              "upvotes": 2,
                              "replies": {
                                "ebhcj9w": {
                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhcj9w/",
                                  "text": "Mostly online through LinkedIn, careebuilder, indeed, internships.com, ziprecruiter, monster, Glassdoor, but also through networking events, career/job fairs, and employment agencies. Best advice is to spend more time on networking. I guess the best way to get a job nowadays is to shake some hands and smell a few farts. ",
                                  "author": "SaucyAndProvoking",
                                  "created": 1544421660,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "ebgwukd": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgwukd/",
      "text": "I think everyone is struggling but there's a culture where people don't like to show it. Mental health is nothing to be ashamed of.",
      "author": "gettingintohypsm",
      "created": 1544405945,
      "upvotes": 7,
      "replies": {
        "ebhals4": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhals4/",
          "text": "That's what I am saying. People shouldn't have to be afraid of what they naturally feel. From what I understand the best way to work through things is to feel it and talk about it.  I hate this current social stigma of judging people because of their flaws. Nobody does it directly but I feel like everybody is always talking behind your back about it.",
          "author": "saltyman420",
          "created": 1544419232,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "ebgwsgf": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgwsgf/",
      "text": "Because finals are this week",
      "author": "21Hammers",
      "created": 1544405892,
      "upvotes": 1,
      "replies": {}
    },
    "ebgwkmp": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgwkmp/",
      "text": "Everyone is struggling in their own ways. It may not seem like it, but you are not alone. ",
      "author": "milkandcookies007",
      "created": 1544405695,
      "upvotes": 19,
      "replies": {}
    },
    "ebgw2nt": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgw2nt/",
      "text": "College is the main boss with many forms. In a way were fighting it.",
      "author": "Axl-Strange",
      "created": 1544405245,
      "upvotes": 22,
      "replies": {}
    },
    "ebgvcjc": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgvcjc/",
      "text": "It actually seems normal because everyone is so anxious and depressed. We’re getting up to our ass in student loans, just to graduate and HOPE we can find a job in or field. We HOPE that job pays enough to buy a house but it might not🤷🏼‍♀️ the economy is destroyed and we’re dealing with the consequences. \nWe go to school to get a job, get a job to survive, and work the rest of our lives. It’s hard to not be depressed when that’s the culture we’re raised in. ",
      "author": "cupcakescandy",
      "created": 1544404625,
      "upvotes": 197,
      "replies": {
        "ebh1p6m": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh1p6m/",
          "text": "Damn, very well put and very introspective.",
          "author": "claypooi",
          "created": 1544410397,
          "upvotes": 29,
          "replies": {}
        },
        "ebh7i1p": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh7i1p/",
          "text": "It is possible to rise above it though. I know, we do not have the best cards to play with but with the right strategy, the \"game\" can be won, I think. Again, it depends on the career that we choose, in my opinion. There are a good amount of STEM jobs out there. I know if you like aviation (and are willing to foot the bill) the airlines are begging for people and paying pretty well. I do not think that things are as bad as people try it make it seem. We sure do not have it great though, compared to our parents. ",
          "author": "Jefferson-not-jackso",
          "created": 1544415906,
          "upvotes": 0,
          "replies": {
            "ebhfwsf": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhfwsf/",
              "text": "[deleted]",
              "author": null,
              "created": 1544426284,
              "upvotes": 13,
              "replies": {
                "ebiaww7": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebiaww7/",
                  "text": "I can agree with that statement. While I do really enjoy learning, I think that university might not be the best place to learn all that you want to learn. I think that depends on the person though. ",
                  "author": "Jefferson-not-jackso",
                  "created": 1544464452,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "ebgucl6": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgucl6/",
      "text": "Well I mean it IS deadline season.",
      "author": "Gauntlets28",
      "created": 1544403794,
      "upvotes": 26,
      "replies": {
        "ebgvqkj": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgvqkj/",
          "text": "Finals week is death ",
          "author": "bl-999",
          "created": 1544404947,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "ebgtm8l": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgtm8l/",
      "text": "Because we are anxious and depressed.   \n\nOur entire future rides on our grades and we get bottom of the barrel teachers even though we're paying thousands upon thousands a year",
      "author": "destructor_rph",
      "created": 1544403225,
      "upvotes": 409,
      "replies": {
        "ebgvgzv": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgvgzv/",
          "text": "IKR. Almost all my professors are adjuncts, so if I try to email them, they don’t respond back or offer any extra aid. Some don’t even have a syllabus, so I can’t refute grades or even know what my grade is. ",
          "author": "CapriciousSalmon",
          "created": 1544404727,
          "upvotes": 104,
          "replies": {
            "ebgyulm": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgyulm/",
              "text": "Even if they're actual profs, they're not always TEACHERS. They're researchers who sloppily \"teach\" a class now and then.",
              "author": "-Knockabout",
              "created": 1544407778,
              "upvotes": 61,
              "replies": {
                "ebh3vrw": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh3vrw/",
                  "text": "IKR! It sucks when you can’t get a hold of their emails or contact them, and you can’t drop off work because they don’t have a mailbox. A lot of my professors I didn’t even know their grading policies or attendance policies, which sucked days I had to miss class. ",
                  "author": "CapriciousSalmon",
                  "created": 1544412455,
                  "upvotes": 12,
                  "replies": {
                    "ebh8613": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh8613/",
                      "text": "Geeze, that sucks! I'm lucky in that usually mine will have their syllabus up, but they're just...bafflingly awful. I have never heard people talk more and say less than I have in a college class.",
                      "author": "-Knockabout",
                      "created": 1544416562,
                      "upvotes": 7,
                      "replies": {
                        "ebh8yuy": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh8yuy/",
                          "text": "I always thought college was discussion based, since a lot of the APs I had were more discussion and readings. But most of my classes are me getting talked at for 75 minutes and getting work thrown at me. Even classes where it’s discussion based, like communication skills or freshmen seminar, the professors sometimes dawdle for way too long. And unfortunately, smaller colleges mean smaller classroom sizes and no cellphones or computers, unless you have a disability or the professor explicitly says it’s cool, so I have to listen. And I can’t just leave or miss class, since half the time, you miss one class, you drop a letter grade. ",
                          "author": "CapriciousSalmon",
                          "created": 1544417384,
                          "upvotes": 6,
                          "replies": {
                            "ebhal6w": {
                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhal6w/",
                              "text": "Yup. Once you get higher up in your courses that DOES get better (I know some of my friends are in like, 13 person discussion-based classes where it's nothing but back-and-forth, though of course it depends on your major too). So hold out hope, since I'm assuming you're a freshman or sophmore?\n\nAttendance is really dumb in my opinion. :/ 1) if someone wants to sabotage themselves, let them. 2) you're just encouraging sick kids to come to class and get everyone else sick, bc god knows if I'm out with a fever I'm not gonna go to the doctor. I'd have to drive or walk there and I'd....have a fever...ugh. 3) I take immunosuppresants so if a kid comes to class sick I will be 10x as sick 10x as longer. 4) sometimes people need catch-up and break days to excel, let them.",
                              "author": "-Knockabout",
                              "created": 1544419212,
                              "upvotes": 7,
                              "replies": {
                                "ebhj0x2": {
                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhj0x2/",
                                  "text": "I do most of my studying out of class, this so much. I dont learn nearly as much from lectures as I do from reading books and doing practice problems",
                                  "author": "xanfire1",
                                  "created": 1544431638,
                                  "upvotes": 6,
                                  "replies": {}
                                },
                                "ebhw2bb": {
                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhw2bb/",
                                  "text": "Attendance at my school depends on the teacher. While you have to give a doctors note or jury summons, most are you miss 3 classes and then after that, you get deducted a grade unless you have some sort of an excuse. We’re a catholic school, so 98% of the time, no cellphones, computers, or recording devices, unless it’s that kind of a class, the professor says it’s cool, or you legitimately have a disability, in which case, you have to go through the office of disability. \n\nI’m English with Secondary Education certification and Special Ed, and a minor in Psych, so hopefully, it’ll change. Only thing that sucks is you can’t as many electives as you want. ",
                                  "author": "CapriciousSalmon",
                                  "created": 1544451938,
                                  "upvotes": 2,
                                  "replies": {}
                                }
                              }
                            }
                          }
                        },
                        "ebh9b2j": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh9b2j/",
                          "text": "My school also makes you take education courses in the spring of your freshmen year, so yeah, it sucks. ",
                          "author": "CapriciousSalmon",
                          "created": 1544417763,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ebh8z68": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh8z68/",
                  "text": "SAY IT LOUDER FOR THE FOLKS IN THE BACK",
                  "author": "moodyfoodies",
                  "created": 1544417393,
                  "upvotes": 5,
                  "replies": {}
                }
              }
            }
          }
        },
        "ebgx580": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgx580/",
          "text": "I promise I'm not bottom of the barrel. I really try hard to make sure my students get the very best education money can buy (I also refuse to work for private schools because of the tuition cost).\n\nThat said, I've seen some appalling teaching, even in my own department. Especially true for adjuncts. We've had a few good ones, but some were so bad we had to fire them in the middle of the term.",
          "author": null,
          "created": 1544406214,
          "upvotes": 80,
          "replies": {
            "ebgxjbc": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgxjbc/",
              "text": "keep fighting the good fight friend",
              "author": "PulsarGlow",
              "created": 1544406566,
              "upvotes": 28,
              "replies": {
                "ebgy5wo": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgy5wo/",
                  "text": "I wish more faculty had my mindset on that. A lot aren't even cognizant of the price of books... The financial needs of college is so extreme now compared to when literally all of us were in college, and they turn a blind eye to it. For smart people, they aren't very perceptive.",
                  "author": null,
                  "created": 1544407144,
                  "upvotes": 16,
                  "replies": {
                    "ebgyrgv": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgyrgv/",
                      "text": "Well, if they're studying and researching what they love they probably don't care to think beyond that. It's pretty unfortunate for everyone though. I am hoping to reenter college soon and I know that'll be a wall to climb with a full time job and like you said, the price! But I really have to do something more. Rock and a hard place.",
                      "author": "PulsarGlow",
                      "created": 1544407697,
                      "upvotes": 4,
                      "replies": {
                        "ebgz2if": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgz2if/",
                          "text": "I would argue that it's their responsibility to care.",
                          "author": null,
                          "created": 1544407975,
                          "upvotes": 4,
                          "replies": {
                            "ebgzghs": {
                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgzghs/",
                              "text": "Oh, I absolutely agree! But, I don't know... seems like a lot of people don't go into it out of the joy of sharing knowledge. People go to school now because they were either told to or because they want money, and I'm afraid that's leaked into the general society of higher education. Less about becoming worldly and learned and more about personal greed. I could just be pessimistic, or underinformed though. I know several good professors who very much care about their students even though I've never been in college outside of dual enrollment, so I know that they're out there.",
                              "author": "PulsarGlow",
                              "created": 1544408328,
                              "upvotes": 3,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "ebgy7hw": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgy7hw/",
              "text": "Im not saying all of them by any means, hell my engineering professor was an absolute fucking g, he was passionate and helpful. But 90% of the professors barely speak english and murder you with power points.",
              "author": "destructor_rph",
              "created": 1544407183,
              "upvotes": 10,
              "replies": {
                "ebgz0gr": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgz0gr/",
                  "text": "I understand having poor instructors can be really frustrating, but I caution any and all students to not say their instructors \"don't speak English\". International academics often speak with an accent, but saying they don't speak the language isn't factually true. Coupled with the fact that many professors with accents are of minority racial groups, it can also come off racist to a lot of people.\n\nThat said, if 90% of your professors are terrible, I would encourage you to look into transferring. College is far too expensive to not learn anything in the process, and if 90% of your professors are truly terrible, you're doing yourself no favors by staying there.\n\n",
                  "author": null,
                  "created": 1544407924,
                  "upvotes": 9,
                  "replies": {
                    "ebh2p95": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh2p95/",
                      "text": "> it can also come off racist to a lot of people.  \n\nRacist or not, it doesn't help that i can't understand or learn from some dude who has an accent thick enough for me to not understand what he's teaching.   \n\n",
                      "author": "destructor_rph",
                      "created": 1544411351,
                      "upvotes": 6,
                      "replies": {
                        "ebh526z": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh526z/",
                          "text": "I understand that, but a more constructive way of approaching that is, \"I really have a difficult time understanding my instructors accent\", not \"my professor doesn't speak English\".",
                          "author": null,
                          "created": 1544413533,
                          "upvotes": 7,
                          "replies": {
                            "ebh5vp4": {
                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh5vp4/",
                              "text": "He did say they, “don’t speak English”. He said they barely did. There’s a difference, and frankly it’s ridiculous that we pay six figures to be taught by such poor communicators. Many of them should not be teaching. ",
                              "author": "69_sphincters",
                              "created": 1544414329,
                              "upvotes": 5,
                              "replies": {
                                "ebh6rk3": {
                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh6rk3/",
                                  "text": "Exactly my point.",
                                  "author": "destructor_rph",
                                  "created": 1544415192,
                                  "upvotes": 3,
                                  "replies": {}
                                },
                                "ebh6vop": {
                                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh6vop/",
                                  "text": "Yet, all of them can pass a TOEFL. Again, their English is fine, it's the accent that tends to be the problem.\n\nI do not work at a university that charges 6-figures, nor would I because I think it's a ripoff, but I can say that if your school is populated by people that have poor teaching skills (with or without the addition of a challenging accent), you should transfer to another school. If they are not able to help you learn, there is no point in paying that money to go there, especially if you are paying 6-figures. You would get a better education at a school that specializes in teaching over research, where we tend to specifically hire professors based on their abilities to teach. It's why I'm such a strong advocate of regional state schools and community colleges for undergraduate education (and only top research schools for graduate education).  ",
                                  "author": null,
                                  "created": 1544415306,
                                  "upvotes": 2,
                                  "replies": {
                                    "ebh8udj": {
                                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh8udj/",
                                      "text": ">\tYet, all of them can pass a TOEFL. \n\nI actually work with and tutor ESL students; a TEOFL is pretty hit and miss for their overall communication skills. ",
                                      "author": "69_sphincters",
                                      "created": 1544417252,
                                      "upvotes": 4,
                                      "replies": {
                                        "ebh9h5z": {
                                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh9h5z/",
                                          "text": "Let me put this another way. We heavily interview each and every person who gets hired. It's a 1-2 day interview of nothing but speaking. \n\nIf they literally can't speak English, they wouldn't get a job. They are also largely published in English journals. Again, it's an issue of accent rather than being generally poor at English. \n\nI had professors from all sorts of countries and backgrounds and spoke all sorts of languages as a student. I work with many colleagues from other countries as a professor. I teach a lot of students from different countries. It's not like I'm not familiar with this issue; especially in the sciences we tend to get a lot people from India, China, and Korea. I've never met a single one that couldn't put together English sentences in a cohesive, coherent way. It's usually the accent that trips people up. \n\nThe good thing about accents is that you can learn to understand them with practice, but frustrated students often don't want to bother with it, and (not accusing anyone here) I've seen a lot of very poor students use their professor's accent as an excuse as to why they are failing. They are failing my class too, and I'm from here.",
                                          "author": null,
                                          "created": 1544417949,
                                          "upvotes": 1,
                                          "replies": {}
                                        }
                                      }
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    },
                    "ebhmutx": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhmutx/",
                      "text": "This isn't exactly an unknown problem. Whether it's a lack of English fluency or just a heavy accent, the university is hiring people who bring a giant communications barrier with them.\n\nAnd it's not because they're so brilliant it's worth getting past that barrier. These professors are almost universally on the STEM side, not the humanities. Incidentally, STEM degrees (especially a Masters or PhD) are easier to get jobs with, so there's fewer good candidates in the adjunct market.",
                      "author": "bl1y",
                      "created": 1544439385,
                      "upvotes": 1,
                      "replies": {
                        "ebhtwdg": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhtwdg/",
                          "text": "What you are saying is not accurate. Most adjuncts are from the US due to visa restrictions of international people with no contract part-time employment (though graduate teaching assistants are often international).\n\nAnd I can assure you, there is no shortage of American applicants. We still get 60+ for each position, only a handful are international, and we rarely interview them due to the costs associated with them traveling here. The ones interviewed already live and work here (and are fluent English speakers).\n\nThe international people that do get hired are often spectacular researchers, and almost always do their doctoral work here (or other English speaking countries). By the time they become a professor, they have been in the US a decade or longer and have few issues with knowing the language, other than an accent. \n\nYou do specifically mention STEM, which I'm also in (chemist), and I teach my students the importance of working with understanding accents (like anything, it's a skill you have to work on). In any major company doing R&D, they will work with, present with, and write with people who have accents. ",
                          "author": null,
                          "created": 1544449662,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ebh04j0": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh04j0/",
          "text": "your entire future does not ride upon your grades. At bare minimum you have to pass, and if there are certain gpa requirements to be expected at future employers, you make that cutoff, and you don't worry about it anymore. balancing your curriculum and getting involved outside of classes is just as, if not more important than your grades.",
          "author": "de_mom_man",
          "created": 1544408936,
          "upvotes": 3,
          "replies": {
            "ebh7bah": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh7bah/",
              "text": "Depending on the career, I always hear that GPA only matters for the first few year in industry. That is what I am banking on at least with an engineering degree from a hard school...",
              "author": "Jefferson-not-jackso",
              "created": 1544415723,
              "upvotes": 3,
              "replies": {
                "ebhieys": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhieys/",
                  "text": "if you're hitting solidly north of a 3.0, you really shouldn't worry about it too greatly. If you can clear that floor, don't worry about your GPA too too much in engineering. \n\nFar too many engineering students make the mistake of sinking all their spare time into their coursework in pursuit of a wicked high gpa, only to have squat to put on a resume. Companies will hire engineering graduates well versed in communication, leadership efforts, and professional development pursuits with a 3.0 GPA every single time over some shut-in who grinded all 4 years for a 4.0 GPA, and that's it.\n\nGrades matter, but only so much. Get involved, and build your resume.",
                  "author": "de_mom_man",
                  "created": 1544430491,
                  "upvotes": 5,
                  "replies": {
                    "ebiaq33": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebiaq33/",
                      "text": "Exactly. I personally have a 2.88 because there was a year that I had some health issues that effected my ability to so school well. While this is can be worrying, I do have some \"real world\" experience on my resume that I am banking on. What drive me nuts is that a 3.0 can mean two different things at different schools.  A 3.0 at a community college is simply not the same as a 3.0 at a top engineering school.",
                      "author": "Jefferson-not-jackso",
                      "created": 1544464310,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "ebh2lkj": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh2lkj/",
              "text": "> your entire future does not rise upon your grades   \n\nIt absolutely does. It determines if i get COOPS, if i can transfer into the degree of my choice and i have to meet a certain GPA to maintain my scholorships. All of these determine if i graduate, which in tern determines the career i get, which in tern determines the life style ill be able to live.",
              "author": "destructor_rph",
              "created": 1544411251,
              "upvotes": 16,
              "replies": {
                "ebhi5sg": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhi5sg/",
                  "text": "yea, the grades matter, but past a certain point, the law of diminishing returns will begin to apply. By no means do I advocate throwing your grades to the wind, but at the end of the day, the kid who graduates with the lowest gpa in your major will have the same piece of paper that you do. It's about what you do with your education in school, how you develop yourself outside of your curriculum, and what else you bring to the table besides your degree.",
                  "author": "de_mom_man",
                  "created": 1544430058,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            },
            "eby3xpf": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/eby3xpf/",
              "text": "That's a bit of a closed-minded thing to say. Your GPA absolutely does matter for post-graduate education in the medical and law fields, as well as regular graduate school. \n\n\"C's get degrees\" may be true, but in this uber-competitive time we live in, grades really do mean a fuckton.",
              "author": null,
              "created": 1545006834,
              "upvotes": 1,
              "replies": {
                "ebyd9pi": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebyd9pi/",
                  "text": "This came from my personal perspective as an engineering student, and I can't speak for all fields—should've noted that commenting in this sub. \n\n&#x200B;\n\nWithin my field (Civil/Structural Engineering), and generally speaking throughout engineering, GPA is not noted so much as internships, professional development efforts, ability to communicate & lead, etc, etc. Not to discredit other fields, but it's understood that the work is hard, and most businesses, aside from the most elite (Boeing, Lockheed Martin, etc.),  don't expect stellar GPA's, and prioritizing GPA >> all is generally to your discredit as an engineering student. \n\n&#x200B;\n\nI personally aspire to understand my course material and its real world applicability, and once I've achieved that, I posit my energy elsewhere. I'd rather pull a 3.2-3.3 GPA and have time to get involved in student engineering societies, other clubs, leadership opportunities, etc. than pull a 3.5 or higher and be constantly immersed in my coursework like a hermit, doing nothing else.",
                  "author": "de_mom_man",
                  "created": 1545014802,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "ebhmg77": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhmg77/",
          "text": "It's also largely that Gen Z is less well prepared for college, especially in terms of lessening independence.",
          "author": "bl1y",
          "created": 1544438590,
          "upvotes": 2,
          "replies": {
            "ebiki32": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebiki32/",
              "text": "can confirm, i was not ready for how different college was from high school this year. High School was so easy to float through and get As. Going from high school to college feels like going from The Sims to Dwarf Fortress tbh.",
              "author": "destructor_rph",
              "created": 1544471444,
              "upvotes": 1,
              "replies": {
                "ebin94r": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebin94r/",
                  "text": "High school is a bit like Halo. You can find the easy setting, and no matter how many times you die the game basically pushes you through the levels and onto the next content.\n\nCollege is a lot more like Super Mario Bros.",
                  "author": "bl1y",
                  "created": 1544473556,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ebigeek": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebigeek/",
          "text": "I would estimate about 33% of professors actually want to teach for a living, 33% just want to do research and teach because they have to, and 33% didn't really want to work in academia at all but didn't know what else to do with their PhD/couldn't get a job. \n\nSo, in the end, about 66% of professors have no real interest in teaching. Just by my estimate, based on my experiences working in academia.   ",
          "author": "stathicus",
          "created": 1544468434,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebgt66c": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgt66c/",
      "text": "i have 120 question final tomorrow and i wanna die :)",
      "author": "jetblue723",
      "created": 1544402873,
      "upvotes": 77,
      "replies": {
        "ebgvhqz": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgvhqz/",
          "text": "What’s it on?",
          "author": "CapriciousSalmon",
          "created": 1544404746,
          "upvotes": 14,
          "replies": {
            "ebgvtzz": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgvtzz/",
              "text": "14 chapters on psychology ",
              "author": "jetblue723",
              "created": 1544405030,
              "upvotes": 31,
              "replies": {
                "ebh3svg": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh3svg/",
                  "text": "That sucks. You don’t get a study guide or a cheat sheet?",
                  "author": "CapriciousSalmon",
                  "created": 1544412381,
                  "upvotes": 8,
                  "replies": {
                    "ebhrrm9": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhrrm9/",
                      "text": "We actually don’t get a study guide or a cheat sheet. The teacher provides us a “what not to study guide” and it’s pretty pointless to be honest. ",
                      "author": "jetblue723",
                      "created": 1544447234,
                      "upvotes": 7,
                      "replies": {
                        "ebhvtp1": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhvtp1/",
                          "text": "Sorry. Good luck. Hope it’s not 50% of your final grade. For theology (I go to a catholic school) it’s the most stressful class because 25% is class work and participation in lectures, 25% is the midterm, 25% final, and 25% is a final Chicago style paper on social justice. I got a D on the midterm because my roommate had guys over the night before, so I had to work my ass off. ",
                          "author": "CapriciousSalmon",
                          "created": 1544451692,
                          "upvotes": 3,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "ebhp0cs": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhp0cs/",
                  "text": "As a psych major,Godspeed.",
                  "author": "Lexiiboo97",
                  "created": 1544443320,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ebh7a67": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh7a67/",
          "text": "Good luck dood holy shit",
          "author": "minibear00",
          "created": 1544415692,
          "upvotes": 7,
          "replies": {}
        }
      }
    },
    "ebgszx7": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgszx7/",
      "text": "\"[It's pretty common these days](https://www.youtube.com/watch?v=YvLXWe9A8Ms)\"",
      "author": null,
      "created": 1544402735,
      "upvotes": 4,
      "replies": {}
    },
    "ebgszdw": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgszdw/",
      "text": "I’ve been so bundled up in being an emotional wreck that I thought I was one of the few. A peer I rarely talk to just told me “hey can we study together please? I keep having mental breakdowns”.  I was fucking shook because he’s usually happy and optimistic as hell.\n\nI think it’s primarily because a lot of the people that are suffering through these things don’t show it to other people. They’ll be happy for a bit but when they’re alone they break down. ",
      "author": "ValerianTeal",
      "created": 1544402723,
      "upvotes": 201,
      "replies": {
        "ebgvmll": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgvmll/",
          "text": "I was suffering for weeks because I need to maintain a 3.0 gpa or I go on academic probation and can’t take courses relating to my major. It sucked. I was depressed, cried a lot, lost a lot of sleep, probably gained 20 extra pounds, and I’d have these constant headaches or nausea/vomiting. It sucks. \n\nTurns out it didn’t matter if i got a 3.0 this semester, since I took summer classes before I started freshmen year, and I got a 3.8, so even if I get a 2.6, I’ll still pass. ",
          "author": "CapriciousSalmon",
          "created": 1544404854,
          "upvotes": 41,
          "replies": {
            "ebh7lzx": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh7lzx/",
              "text": "Wow. You go on academic probation for a 3.0? Dang. For my school it is a 2.5. Then again,  I go to a harder than average engineering school",
              "author": "Jefferson-not-jackso",
              "created": 1544416017,
              "upvotes": 25,
              "replies": {
                "ebh95fa": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh95fa/",
                  "text": "No I mean if it’s lower than a 3.0, for professions like nursing or education. Like a 2.99 and I can only go on probation once before you get kicked out of the school for education. While education, I’m not gonna say is easier, nursing makes you take chemistry and clinical hours. I felt bad for a lot of the freshmen who were nursing majors. And for certification courses in education, you need a B- or better per course. If you go on academic probation, you can’t take any education courses, so it takes you 4.5 - 5 years to graduate as a result, since certain classes are only offered at certain points of the year. That almost happened to me and I spent a week panicking, crying, binging and migraing because of it. At least until the EOF Director said it was cool if I got lower than a 3.0 since I already had a 3.8 from summer classes, so a 2.6 would just give me a 3.2. \n\nAt my school it’s 2.0 for most majors, and you have to get a C or better in your major courses (not pre-requisites) since it’s a catholic school, and most of what I learned I know from high school. ",
                  "author": "CapriciousSalmon",
                  "created": 1544417585,
                  "upvotes": 13,
                  "replies": {
                    "ebicg6v": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebicg6v/",
                      "text": "I know at my school the GPA requirements depend on how many credits you are taking/have taken. It’s something like 0-19h: 1.5 minimum and then the minimum cumulative GPA goes up with your credit hours.",
                      "author": "NekoTaleStuckTrash",
                      "created": 1544465572,
                      "upvotes": 3,
                      "replies": {
                        "ebijajl": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebijajl/",
                          "text": "We can only take 18 maximum. If you take less than 12, you don’t qualify for housing. ",
                          "author": "CapriciousSalmon",
                          "created": 1544470564,
                          "upvotes": 1,
                          "replies": {
                            "ebijjmh": {
                              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebijjmh/",
                              "text": "Yeah you can only take up to 18 per semester, but I’m talking about total credit hours. As in the credit hours you took during previous semesters plus the credit hours you’re taking during the current semester.",
                              "author": "NekoTaleStuckTrash",
                              "created": 1544470748,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "ebin5ev": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebin5ev/",
          "text": ">don’t show it to other people. \n\nMost people are like that because education as a whole, especially in the higher levels such as College/University is very cutthroat and a vicious competitions of who will do better and who will turn out stronger/smarter. It's just how the system is set up and how it's evolved over the decades.\n\nSo people tend to keep their difficulties and anxiousness  to themselves in fear of showing weakness. It's a sad fact of the educational life.\n\nOne of the ways (which I personally picked up) is to use the 'whatever the fuck' mindset, of just going through it all without too much thought and worry. Usually you'll end up passing and saving yourself a lot of unneeded stress (which can be extremely harmful to your physical and mental health), but the downside is you wont come out with nearly as much knowledge, so it's pretty much a waste of money/time at that point.\n\nJust my 2c.",
          "author": "kryndon",
          "created": 1544473475,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "ebgsukv": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgsukv/",
      "text": "There's a good quote: \"Everybody likes you when you are strong, and nobody likes you when you are weak.\"\n\nBasically, nobody wants to be friends with someone who is always 'woe is me' and vocalizes their issues all the time. And because of that, nobody wants to say anything. I would rather my close friends be open with me and vice versa. It's just hard to vocalize when you're feeling bad/stressed/etc at the right time.\n\nLast year my best friend came out to me after a party we hosted that he was suicidal and contemplated killing himself because of stress and a bad relationship. I had no idea he was feeling that way until he told me, and am thankful that he did tell me. \n\nI even have a hard time opening up to people, but if one of my friends asked me how I was really doing at a good time to do so, I would open up completely. And I hope my friends will do the same.\n\nTL;DR: I think people are that way because we have a hard time figuring out when the right time to vocalize it is, and because of that we don't do it at all.",
      "author": "aj_thenoob",
      "created": 1544402615,
      "upvotes": 120,
      "replies": {
        "ebgtsna": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgtsna/",
          "text": "This is an extremely good point actually. I can see that in my own life with others. Nobody likes to hear about your issues or how hard things. I realized I was doing that all the time but I thought it was just because I was being truthful or being myself but really nobody needed to hear what was on my mind.\n\n&#x200B;\n\nThat's crazy though. I am really glad your friend told you about that and you were able to move forward. I like your way of thinking and your TL:DR raises a good point. I guess it's just too risky and society isnt at that point yet and all we  can do is just work on improving ourselves and being comfortable with where were at so far.\n\n&#x200B;\n\nI am going to try and take the steps so people can vocalize how they really feel to me and be an good friend. Nobody should have  to beat themselves up or close up their emotions. Thanks for your words. You sound like a wise person.",
          "author": "saltyman420",
          "created": 1544403362,
          "upvotes": 19,
          "replies": {}
        }
      }
    },
    "ebgslh9": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgslh9/",
      "text": "[deleted]",
      "author": null,
      "created": 1544402409,
      "upvotes": 34,
      "replies": {
        "ebgt3n4": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgt3n4/",
          "text": "Definitely more a guy than a girl problem imo. More and more studies are coming out that guys hold things in and don't say anything. I'm certainly guilty of it. But that's just how guy friendships work, and it's hard to change that. ",
          "author": "aj_thenoob",
          "created": 1544402817,
          "upvotes": 31,
          "replies": {
            "ebh9wdt": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh9wdt/",
              "text": "The idea is difficult, not so much actually doing it. Sure it may need a drink or two and you may need to do it well into the night, but if you get a good friend and share something, by my experience, most will reciprocate. Having said that, that's just anecdotal but it's worth a shot. I know I'm blessed with incredible people around me, but I wouldn't count out the idea that there's a different side to your friends you've never seen because you've never looked. ",
              "author": "Freestyled_It",
              "created": 1544418420,
              "upvotes": 12,
              "replies": {}
            }
          }
        }
      }
    },
    "ebgsju6": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgsju6/",
      "text": "Because it really do be like that",
      "author": "Velvet_Daze",
      "created": 1544402373,
      "upvotes": 990,
      "replies": {
        "ebgvawk": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgvawk/",
          "text": "This IS it, chief",
          "author": "goldendaysgirl",
          "created": 1544404586,
          "upvotes": 64,
          "replies": {}
        },
        "ebgt7e3": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgt7e3/",
          "text": "This.",
          "author": "peregrin5",
          "created": 1544402901,
          "upvotes": 103,
          "replies": {
            "ebh2ngp": {
              "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh2ngp/",
              "text": "It do be like that though. I have to choose between getting enough food over winter break and affording my books next semester. I have several granola bars though so I should last the month on 1 bar every 2-3 days.",
              "author": null,
              "created": 1544411303,
              "upvotes": 33,
              "replies": {
                "ebha3kv": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebha3kv/",
                  "text": "Please check out all your local resources (food banks, churches, charity clubs on campus, gov assistance, etc.) and all the great subreddits that can help you with assistance (r/povertyfinance has a pinned list of great subs). You shouldn’t have to go hungry. I would personally recommend r/assistance, r/food_bank, r/food_pantry, and r/Random_Acts_of_Pizza. ",
                  "author": "Comrox",
                  "created": 1544418646,
                  "upvotes": 17,
                  "replies": {}
                },
                "ebh6bpq": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh6bpq/",
                  "text": "Are you not able to pirate your books?",
                  "author": "Minas-Harad",
                  "created": 1544414758,
                  "upvotes": 21,
                  "replies": {
                    "ebhbhfz": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhbhfz/",
                      "text": "fucking mymathlab",
                      "author": "useful_person",
                      "created": 1544420300,
                      "upvotes": 15,
                      "replies": {}
                    },
                    "ebh84t7": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebh84t7/",
                      "text": "Honestly people who don’t do this are slacking. Smarter not harder ",
                      "author": "4TOOMANYTABS",
                      "created": 1544416529,
                      "upvotes": 21,
                      "replies": {
                        "ebhvc7n": {
                          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhvc7n/",
                          "text": "Except when they require online codes so you still have to spend at least 80 percent of the cost anyway",
                          "author": "tuckmuck203",
                          "created": 1544451192,
                          "upvotes": 11,
                          "replies": {}
                        }
                      }
                    },
                    "ebi7u2d": {
                      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebi7u2d/",
                      "text": "Depending where OP is (if in the US), they're full of shit. There's services a quick google check away ffs. \"ugh I had to survive on ramen/whatever brag\" it's like dude you spend so much fucking time on social media/internet that you can't google how to get free fucking food for students?\n\nedit: there's more helpers in the world.",
                      "author": "BumbleFuckDuck",
                      "created": 1544462112,
                      "upvotes": -2,
                      "replies": {}
                    }
                  }
                },
                "ebhubvs": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhubvs/",
                  "text": "Okay, I know I may come off as rude because I’m giving you advice you may have already received, but in case you haven’t:\n\n- food pantry. They’re in most college towns because the food insecurity rate is so high. They have food!!\n\n- resource centers (women’s RC, etc) may also have free food/snacks. They are called resource centers for a reason and they tend to keep stuff around.\n\n- events are always on campus, so it is possible to get lunch at a seminar, or something similar, nearly every day of the week. If you check Facebook there will usually be SOMETHING. Or ask around, see what others go to.\n\nAgain, sorry if this is advice already heard, but I figured it’s better to over-inform than to under-inform.",
                  "author": "singingtangerine",
                  "created": 1544450117,
                  "upvotes": 4,
                  "replies": {}
                },
                "ebmgbc6": {
                  "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebmgbc6/",
                  "text": "omg can I help",
                  "author": "Runethic",
                  "created": 1544611220,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "ebgylmn": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgylmn/",
          "text": "They don’t think it be like it is but it do",
          "author": "CreamyRook",
          "created": 1544407546,
          "upvotes": 20,
          "replies": {}
        },
        "ebhcy9b": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhcy9b/",
          "text": "We live in a society",
          "author": null,
          "created": 1544422197,
          "upvotes": 6,
          "replies": {}
        },
        "ebhqnaw": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhqnaw/",
          "text": "I just dropped out and I feel great. Talk to me again in 7 years though, who knows.",
          "author": "max225",
          "created": 1544445763,
          "upvotes": 2,
          "replies": {}
        },
        "ebhnf6f": {
          "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebhnf6f/",
          "text": "sometimes",
          "author": "nicethingscostmoney",
          "created": 1544440527,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "ebgshn4": {
      "link": "/r/college/comments/a4qau2/why_does_it_seem_like_so_many_people_are_so/ebgshn4/",
      "text": "Because we are anxious and depressed. ",
      "author": "noBoobsSchoolAcct",
      "created": 1544402327,
      "upvotes": 44,
      "replies": {}
    }
  },
  "updated": 1634056601
}