{
  "sid": "r7ax80",
  "link": "/r/college/comments/r7ax80/college_charged_me_out_of_state_when_i_am_in/",
  "title:": "College charged me out of state when I am in state resident",
  "text": "While I was attending CCU for 4 years ,My college has charged me out of state when I was an in state resident. I lived in SC for 4+ years and graduated from a highschool from SC and after summer went to CCU. My sophomore year I noticed I was being charged out- of state when I’ve been an SC resident. I thought it was a simple mistake and tried to talk to them( note: I put mailing address in Maryland because that is where my mother lived and for the summer I went there for an internship, but I did not live with my mother). I called and they only sent me 2 of 4 forms I was suppose to fill out to prove my residency for 2 years. I sent my Farthers ID as well as mine and other information to prove he was a legal resident for 11+ years. I feel I was conned because they never sent me the other 2 forms in past emails to complete and they kept saying to fill out same 2 forms they were sending me and they were correct every time. The more I was asking why I didn’t get in-state after filling out the forms, the more they beat around the bush. Does anyone by any chance know if I can possibly get my money reimbursed without going the lawyer route ? Suing is my last resort.",
  "author": "upnxt_nate",
  "created": 1638461763,
  "updated": 1638479921,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmy5v4f": {
      "link": "/r/college/comments/r7ax80/college_charged_me_out_of_state_when_i_am_in/hmy5v4f/",
      "text": "I think they looked at your mailing address. Talk to the schools financial aid department and explain this",
      "author": "GoldRequest",
      "created": 1638462898,
      "upvotes": 2,
      "replies": {
        "hmy6k9y": {
          "link": "/r/college/comments/r7ax80/college_charged_me_out_of_state_when_i_am_in/hmy6k9y/",
          "text": "I did, but they giving me the run around. Saying that well you didn’t complete the form. I will mention this again since I’m suppose to be talking to someone higher up later on today.Hopefully it works.",
          "author": "upnxt_nate",
          "created": 1638463170,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmyplnr": {
      "link": "/r/college/comments/r7ax80/college_charged_me_out_of_state_when_i_am_in/hmyplnr/",
      "text": ">My sophomore year I noticed I was being charged out- of state when I’ve been an SC resident.\n\nYou noticed that they started charging you for it this semester? Or has this been an issue in previous semesters too?\n\n>I feel I was conned because they never sent me the other 2 forms in past emails to complete and they kept saying to fill out same 2 forms they were sending me and they were correct every time. The more I was asking why I didn’t get in-state after filling out the forms, the more they beat around the bush.\n\nThey are giving you the same work around you get with airlines and insurance, even though it seems rather odd for a *university* to be doing that to a *student*.\n\nCan you print out the two forms and mail them to the school (probably to the department that is in charge of the billing) via CERTIFIED letter (snail mail)? Also include copies of your residency proof and a statement asking for the billing to be corrected. Businesses take certified letters more seriously than emails because establishing a paper trail and receipt of message is the first step a lawyer would have told you to do. There should also be a letter with a statement of facts and your demand. If you want to add pressure, you can send a copy to the US Dept. of Education or another regulatory body and let the university know you did that. I can write a template for you if you'd like.\n\nYou'll probably be jerked around for months if you play along with their bureaucratic email process. Sending certified mail and making a complaint to whoever regulates the university are your two next steps if you want a fast resolution. These things will also make it a much easier process in court if it gets to that point, but let's assume the university will be responsible and correct it.\n\nDisclaimer: I am not a lawyer, my experience comes from fighting with companies and the government as an individual.",
      "author": "darniforgotmypwd",
      "created": 1638470459,
      "upvotes": 1,
      "replies": {}
    }
  }
}