{
  "sid": "rc14ut",
  "link": "/r/college/comments/rc14ut/broke_college_student/",
  "title:": "Broke college student",
  "text": "Honestly I am stressed I really dislike not being financially stable. I literally only have a dollar in my account credit cards are maxed. I have to pay for my car note and car insurance, pay off an old apartment, phone bill, and pay for tuition that wasn’t covered by loans. My credit isn’t good enough to get a small loan. I don’t have a job right now because I thought I was supposed to start next Wednesday but that changed. I am so stressed right now and it’s not going to get any better because I’m pre med so I have a long road of being broke. Does anyone have any advice or tips how to get out of this situation.",
  "author": "gtfopx",
  "created": 1638997986,
  "updated": 1639517174,
  "over_18": false,
  "upvotes": 6,
  "upvote_ratio": 1.0,
  "comments": {
    "hnrtmht": {
      "link": "/r/college/comments/rc14ut/broke_college_student/hnrtmht/",
      "text": "Not a single tip, I’m winging it myself! I get by day by day! I DoorDash as much as I can but that isn’t steady enough nor do I give it the time it needs to be profitable due to school work or other trials in life. Give DoorDash a shot!",
      "author": "RoundBridge4",
      "created": 1639000194,
      "upvotes": 3,
      "replies": {
        "hnu20zb": {
          "link": "/r/college/comments/rc14ut/broke_college_student/hnu20zb/",
          "text": "I will give these delivery apps another try thank you!",
          "author": "gtfopx",
          "created": 1639042936,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hns7177": {
      "link": "/r/college/comments/rc14ut/broke_college_student/hns7177/",
      "text": "Try donating plasma, they usually have good new donor bonuses, can make like $1000 your first month.",
      "author": "Thelton26",
      "created": 1639005681,
      "upvotes": 1,
      "replies": {
        "hnu1ztp": {
          "link": "/r/college/comments/rc14ut/broke_college_student/hnu1ztp/",
          "text": "I’ve donated but last week I passed out and threw up and now I have a big purple bruise on my arm I won’t be doing it for awhile until I feel better",
          "author": "gtfopx",
          "created": 1639042909,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}