{
  "sid": "qy2jjs",
  "link": "/r/college/comments/qy2jjs/how_do_you_guys_attempt_to_read_academic_articles/",
  "title:": "How do you guys attempt to read academic articles? What are good academic sources to read and what are ways to find quality source?",
  "text": "I'm a freshman student at uni and i find really hard and daunting to focus on reading academic articles. What are tips to improve my reading? How to read them correctly?\n\nI'm new to uni and i feel overwhelmed and don't know how to find quality sources. My lecturer told my class that to find what you need is to type the precise keywords. But whenever i type what i need in Google scholar, it doesn't show what i need.\n\nI have to study online so i don't have much chances to meet friends or the supporters from school to ask. Please help/ guide me :<",
  "author": "quinnie1205",
  "created": 1637402513,
  "updated": 1637689540,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlddrsq": {
      "link": "/r/college/comments/qy2jjs/how_do_you_guys_attempt_to_read_academic_articles/hlddrsq/",
      "text": "Lots of times it takes long time to trawl through to find what you want. You simply will have to skim the abstract/summary and see if it is what you are looking for. If it is, keep reading. If not, move on to next one. If you haven't seen what you want in about 8 articles, vary your search parameters/keywords.\n\nYou don't need to read the whole article. Just find what you need from it.",
      "author": "wobbletelescope",
      "created": 1637403837,
      "upvotes": 5,
      "replies": {}
    },
    "hlde5e8": {
      "link": "/r/college/comments/qy2jjs/how_do_you_guys_attempt_to_read_academic_articles/hlde5e8/",
      "text": "I usually just start with reading the summary/introduction then skim through what I need. Depending on the article some I read fully through some I just skim and it’s enough. You can also do “ctrl +F” (at the same time) to search specific words in the article that has something to do with what you need to find!",
      "author": "Ambitious_Function_5",
      "created": 1637404176,
      "upvotes": 3,
      "replies": {
        "hldyuyy": {
          "link": "/r/college/comments/qy2jjs/how_do_you_guys_attempt_to_read_academic_articles/hldyuyy/",
          "text": "Oh this trick is useful",
          "author": "quinnie1205",
          "created": 1637418404,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hldi2et": {
      "link": "/r/college/comments/qy2jjs/how_do_you_guys_attempt_to_read_academic_articles/hldi2et/",
      "text": "There are way better places to look than google scholar. Your library will have access to databases that you can use, contact your library for help figuring out what they subscribe to. A couple I use a lot are web of science and EBSCO academic search complete.",
      "author": "ProfessorHomeBrew",
      "created": 1637407451,
      "upvotes": 3,
      "replies": {}
    },
    "hldke3y": {
      "link": "/r/college/comments/qy2jjs/how_do_you_guys_attempt_to_read_academic_articles/hldke3y/",
      "text": "Practice!! I would choose a subject you're interested in and then see what articles you can come up with on a database like NCBI (and maybe learning some more about search commands could help you navigate Scholar a bit easier?). Try reading those slowly, section by section, with a lot of breaks and definitely search the meanings of any terms you don't understand. You might benefit from taking short notes while you read! \n\nSometimes reading articles in a subject you're not so familiar with can feel like you're reading something in a different language, so the best thing to do is approach it like you're \"translating\" the article into everyday vocabulary!\n\nI haven't seen [this video](https://youtu.be/t8_CW6FV8Ac), but a friend of mine really loves the channel that posted it so it might have some good tips to add!!",
      "author": "doomsdaea-",
      "created": 1637409290,
      "upvotes": 2,
      "replies": {
        "hldpmd8": {
          "link": "/r/college/comments/qy2jjs/how_do_you_guys_attempt_to_read_academic_articles/hldpmd8/",
          "text": "Thank you sooo much for your detailed reply. English isn't my first language so it's even more challenging for me to comprehend them 😅. I will try to practice. Thks 💓",
          "author": "quinnie1205",
          "created": 1637413060,
          "upvotes": 2,
          "replies": {}
        }
      }
    }
  }
}