{
  "sid": "qvpnf0",
  "link": "/r/college/comments/qvpnf0/is_it_wrong_that_i_feel_that_the_day_that_i_dont/",
  "title:": "Is it Wrong that I feel that the day that I don't have to worry about my grades anymore would be the happiest day of my life?",
  "text": "All my life I've been scared of how my parents would react to how my grades are. They've always expected an A+ Student, but the workload, and my own personal problems have made it a living hell to keep up a good GPA. \n\nSo far, I've had mainly Bs and Cs in my Sophomore and 1st Semester Junior Year, and I don't want to have to confront my parents about my grades anytime soon. However, I keep going, partially because I know that it'll soon be over that I'll graduate, that they'll never have to pester me about grades ever again and get the hell away from them forever. \n\nIs this normal, or is this a reflection of my own sheltered life?",
  "author": "wiz28ultra",
  "created": 1637119021,
  "updated": 1637181344,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hkxza27": {
      "link": "/r/college/comments/qvpnf0/is_it_wrong_that_i_feel_that_the_day_that_i_dont/hkxza27/",
      "text": "I know that I sound whiny and lazy, and I'm very aware of that, it's just that I can't help but feel this way about the whole process. I'm so tired and sick of it, but I don't know what to do to get out of my rut. I don't necessarily want to be pitied, I just want to hear your stories.",
      "author": "wiz28ultra",
      "created": 1637119683,
      "upvotes": 1,
      "replies": {}
    },
    "hkxzui3": {
      "link": "/r/college/comments/qvpnf0/is_it_wrong_that_i_feel_that_the_day_that_i_dont/hkxzui3/",
      "text": "nope, not at all. grades suck, school sucks, homework BIG TIME sucks, and the way we're evaluated and taught is primarily designed to turn us into good corporate drones who are ok with working extra unpaid hours and spending the majority of our waking life doing stuff we would really rather not be doing for some arbitrary evaluator and assignor of value. my parents were a lot like yours, too. I worked my ass off to get good grades coming out of high school, only to discover that the scholarships I qualified for were menial, and the admissions average to my program (back in the early 2000s when they were whoring out liberal arts programs to literally EVERYONE to brainwash kids into taking those good good student loans) was like a C+ anyway.\n\nI don't know if my little anti capitalist rant was helpful to you in any way, but I hope so! get through it! you can do it!\n\nedit to add: unless you have a set plan of exactly what you want to do in life, and a uni degree is part of that, DON'T GO TO UNI. it's not the be all end all, and there are lots of good jobs you can get through college, vocational training, apprenticeships... even taking a year or two and working to save some money can be a great way to discover new avenues! do NOT let your parents brainwash you into going to uni for a degree you're not 100% invested in on some myth about hireability. an English lit degree will NOT help you get a job, trust me.",
      "author": "Klutzy-Classroom6756",
      "created": 1637119951,
      "upvotes": 1,
      "replies": {
        "hky0fn9": {
          "link": "/r/college/comments/qvpnf0/is_it_wrong_that_i_feel_that_the_day_that_i_dont/hky0fn9/",
          "text": "I'm a CS Major, and I haven't done any internships yet, and I'm not working a job this semester,",
          "author": "wiz28ultra",
          "created": 1637120223,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hkxzxhl": {
      "link": "/r/college/comments/qvpnf0/is_it_wrong_that_i_feel_that_the_day_that_i_dont/hkxzxhl/",
      "text": "Completely normal, then you'll be worried about work issues all the time when you should be relaxing at home lol",
      "author": "FilletOfZero",
      "created": 1637119990,
      "upvotes": 1,
      "replies": {}
    }
  }
}