{
  "sid": "r0r1df",
  "link": "/r/college/comments/r0r1df/help_me_with_college_options/",
  "title:": "Help me with college options.",
  "text": "I plan on majoring in Finance or Accounting. I will be a transfer student for Fall 2022 most likely an incoming Junior. I have NO idea which of these schools I want to go to. I will be an out of state transfer to all of them.  I have no idea what I want to be, do career-wise so, networking and internships are incredibly important to me so I can get an idea of the opportunities that are out there.   \n\n**Give me some pros/cons, advice, or anything you know about these schools. I’m really struggling!**\n\n\n#1. University of Mississippi \n\nI visited the school and really liked the traditional feel. It was a nice average sized college which I would be able to easily walk from class to class on campus. The town of Oxford was tiny and very community oriented but, it felt kind of too small for a college student IMO. I feel like I could potentially get tired of being there. Idk much about their finance program but, their accounting program is supposedly very good. I also applied for the public policy program. \n\n\n#2. University of Alabama\n\nI visited this school and my first thought was wow this campus is way too big for me. It felt super spread out and I did not get a nice community feel while I was there. That was literally the only downside, the size of the campus and the feel I got while walking around. I have heard good things about the Culverhouse Business School but not sure about their accounting and finance programs. \n\n\n#3. Auburn University\n\nUnfortunately, I have not visited yet. In fact, I wasn’t considering Auburn until I read online that overall Auburn slightly outranks UA. Their business school seems nice as well as their campus. Just looking at the pictures and watching videos online, I think I might like Auburn more than UA. Idk why but my gut instinct, or something internally is pushing me towards Auburn over UA and even over Ole Miss (I know that might sound silly) ever since I’ve been researching more about the college.\n\n\n#4. University of North Dakota\n\nI have not visited. I know, it’s the only school outside of the south, seems like the anomaly. However, UND was originally on my list because I got some junk mail from them and applied just for the hell of it, in fact, it was the first college that I applied to. I started looking into the school more, specifically their business school and must say that UND does not seem like a bad choice what so ever. Nistler College seems like it offers some great opportunities to students. Grand Forks and Fargo don’t seems like terrible cities for college graduates either.",
  "author": "nobleinquiry",
  "created": 1637712075,
  "updated": 1638207419,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hlu6a68": {
      "link": "/r/college/comments/r0r1df/help_me_with_college_options/hlu6a68/",
      "text": "Which one will be the most cost effective? How much money can you spend each year and how much money will they give you in scholarships or other aid? \n\nI’d suggest working out the cost/payment method first and then going from there.",
      "author": "usuallyConflicted",
      "created": 1637713199,
      "upvotes": 1,
      "replies": {}
    }
  }
}