{
  "sid": "lzeb46",
  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/",
  "title:": "Anyone else counting down the weeks till the semester is over?",
  "text": "Life is just too routine at the moment, especially since I'm virtually attending school. I don't care about the classes I'm in and I just have no passion in what I'm doing each day. I'm not failing, but I see no relevance in the courses I'm taking. If I woke up and it was somehow the last week of school, I'd be ecstatic and relieved.",
  "author": "spenny_jay",
  "created": 1615074411,
  "over_18": false,
  "upvotes": 1070,
  "upvote_ratio": 0.99,
  "comments": {
    "gq5cbc0": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq5cbc0/",
      "text": "Yes. Though currently, I’m just trying to make it to spring break. This semester is perhaps the worst semester I’ve experienced, which is saying a lot because I haven’t liked a semester since 4th grade.",
      "author": "Hello-I-Am-Trash",
      "created": 1615156289,
      "upvotes": 1,
      "replies": {}
    },
    "gq4gnk8": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4gnk8/",
      "text": "I just took the whole covid time to take a break off college and it's helped a ton. Gonna go back once things simmer down.",
      "author": "brikaro",
      "created": 1615143076,
      "upvotes": 1,
      "replies": {}
    },
    "gq4c7rn": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4c7rn/",
      "text": "I’m so ready for the semester to be over student teaching is so rough and is an internship you pay 6,000 dollars for...",
      "author": "night2016",
      "created": 1615141283,
      "upvotes": 1,
      "replies": {}
    },
    "gq4a3ke": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4a3ke/",
      "text": "Nope. I'm taking 4 classes in 10 weeks this summer. \n\nIt will be painful.",
      "author": null,
      "created": 1615140431,
      "upvotes": 1,
      "replies": {}
    },
    "gq49r4t": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq49r4t/",
      "text": "i have been cheating my way through all of my classes and not doing any work at all. I know this will definitely have an impact on me once classes are irl.",
      "author": "basicange",
      "created": 1615140295,
      "upvotes": 1,
      "replies": {}
    },
    "gq454vr": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq454vr/",
      "text": "Yup, I'm a senior and I feel so drained and done.",
      "author": "antonia_dreams",
      "created": 1615138233,
      "upvotes": 1,
      "replies": {}
    },
    "gq40t71": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq40t71/",
      "text": "I’m actually doing better this semester than last. It just all feels so meaningless—especially since I’m changing my major and school (leaving English for nursing)! I get up in the morning and write essays/poems/dumb meaningless projects and that’s it. Everything feels pointless online. None of it feels worthwhile anymore. We literally stare at computers for 12 hours a day, every day. Now that I realize my career in English would be just more staring at computers but in an office all day, I’m leaving it. So yup, I’m really happy that the semester will end soon and I can change my major and figure out what to do with my life. I wonder how other liberal arts majors are doing",
      "author": "ksswannn03",
      "created": 1615136067,
      "upvotes": 1,
      "replies": {}
    },
    "gq3zo0k": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3zo0k/",
      "text": "I thought last semester was the worst... apparently it could get any worse. I absolutely hate all my classes!! I am not even learning at all. I just submit schoolworks and that’s it. What a sad system",
      "author": "jukiiee",
      "created": 1615135481,
      "upvotes": 1,
      "replies": {}
    },
    "gq3z6g3": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3z6g3/",
      "text": "Yep already on week 8 out of 16 and one of those weeks is spring break. I’m happy about it can’t wait to be done",
      "author": "alion23",
      "created": 1615135230,
      "upvotes": 1,
      "replies": {}
    },
    "gq3wyul": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3wyul/",
      "text": "Yes because I'll be graduating, of course I'm counting",
      "author": "OMG_fake97",
      "created": 1615134095,
      "upvotes": 1,
      "replies": {}
    },
    "gq3w0wz": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3w0wz/",
      "text": "I honestly stopped counting and college is just something extra to pass time at this point. I'm doing well but I don't really feel like I'm learning because even the busy work like discussion's have a due date within the week. I kinda have to rush to do it with out really reading the material.\n\nIf I miss some assignments then it is what it is. I still have to work and pay bills so college is secondary.",
      "author": null,
      "created": 1615133601,
      "upvotes": 1,
      "replies": {}
    },
    "gq3vms9": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3vms9/",
      "text": "Oh definitely",
      "author": "Pandora_sus",
      "created": 1615133395,
      "upvotes": 1,
      "replies": {}
    },
    "gq3s6gd": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3s6gd/",
      "text": "This is why i love quarters but I feel the exact same way and now I’ll have to go through a whole other quarter after these next two weeks of school and finals! Then two more years ugghhhh",
      "author": "vballjunior",
      "created": 1615131593,
      "upvotes": 1,
      "replies": {}
    },
    "gq3r4ik": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3r4ik/",
      "text": "Would do if I knew when it was ending. They refuse to tell us cause we may or may not being doing small exams to replace the normal ones that have been cancelled.",
      "author": "Leafy_Green_314",
      "created": 1615131029,
      "upvotes": 1,
      "replies": {}
    },
    "gq3r1ep": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3r1ep/",
      "text": "I literally have a countdown app that I check everyday",
      "author": "Wonderful_Ruin_6438",
      "created": 1615130981,
      "upvotes": 1,
      "replies": {}
    },
    "gq3pln5": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3pln5/",
      "text": "I'm counting down the weeks till I graduate lmao",
      "author": "Apoptosed-BrainCells",
      "created": 1615130171,
      "upvotes": 1,
      "replies": {}
    },
    "gq3ola8": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3ola8/",
      "text": "I'm probably going to finish this semester with an average of a C- across my classes...with maybe one no credit/fail.  \n\nI have a 3.8 GPA right now and I just can't do this online stuff anymore. My classes designed for online school before the pandemic are just fine, but these hybrid classes are awful and require more work than they ever would've.",
      "author": "M1A1Death",
      "created": 1615129589,
      "upvotes": 4,
      "replies": {}
    },
    "gq3o21n": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3o21n/",
      "text": "Nope, I have to take this big exam that will take 2 months of studying, essentially my summer break rip",
      "author": null,
      "created": 1615129272,
      "upvotes": 1,
      "replies": {}
    },
    "gq3o0eh": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3o0eh/",
      "text": "I think 9 weeks fory CC class \nAnd 7 weeks for my 2 university classes\n\nI can't wait to be done! I'll be a senior finally and maybe starting clinicals next year's!  College is finally close to ending for me",
      "author": "elocinkrob",
      "created": 1615129246,
      "upvotes": 1,
      "replies": {}
    },
    "gq3kqpv": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3kqpv/",
      "text": "I used to count down the weeks I had left in a semester but this would make my brain feel like it's dragging on for much longer than it turkey was so for the sake of my sanity I tried to ignore how much bullshit I had left.",
      "author": "ModestEevee",
      "created": 1615127206,
      "upvotes": 2,
      "replies": {}
    },
    "gq3jh8z": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3jh8z/",
      "text": "i’m literally over it and no longer learn from this online mode of school",
      "author": "stressinglucy",
      "created": 1615126389,
      "upvotes": 2,
      "replies": {}
    },
    "gq3h3np": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3h3np/",
      "text": "Honestly me. I only have this semester and the fall semester and I’m done. It’s really sad because I’m in all my senior classes (bio major) and I can’t even enjoy them bc it’s all online. I just do the assignments and go. Can’t wait for this semester to be over.",
      "author": "JMR3898",
      "created": 1615124769,
      "upvotes": 2,
      "replies": {}
    },
    "gq3gb99": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3gb99/",
      "text": "This is me. Last semester I was mostly fine but now hard af to get motivated and do online work. However I should really take advantage of it bc technically this semester (Atleast for me) is still easier than compared to having in person classes daily",
      "author": "phillyphilly4200",
      "created": 1615124197,
      "upvotes": 2,
      "replies": {}
    },
    "gq3cyoq": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3cyoq/",
      "text": "This is my final semester. I forget I’m even a student most days. I’m working two jobs currently and I’m at a point where I’m only taking two classes but I do not feel prepared to go into my field. At this point I just want money and I want school to be over so I feel less constrained within my schedule. I don’t really have free days anymore and other than seeing my boyfriend I just kinda accepted that I’m not seeing my friends for a while. I just want the obligation of class to be over",
      "author": "PhantomThief98",
      "created": 1615121667,
      "upvotes": 2,
      "replies": {}
    },
    "gq38rgw": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq38rgw/",
      "text": "This semester feels so much worse than last semester. I feel more burnt out about studies and unmotivated because of how depressed I feel about life during covid. I’m graduating soon, so I can see the light at the end of the tunnel, but I just hope that isn’t contributing towards how apathetic I feel. I was really motivated last semester and got almost all As so I don’t know what changed so quickly, but this semester has felt miserable.",
      "author": "lunar_grl",
      "created": 1615117944,
      "upvotes": 7,
      "replies": {}
    },
    "gq33qoz": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq33qoz/",
      "text": "Yeah, I’m going to move in with some friends this summer and change schools after I get my association degree. Lots to look forward to. Not a lot keeping me going right now",
      "author": "G3RG0R",
      "created": 1615112694,
      "upvotes": 1,
      "replies": {}
    },
    "gq339z4": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq339z4/",
      "text": "Mine just started but yes\nBut I enjoy what I am doing, just things can be overwhelming at times\n\nI felt exactly how you did, last year when mine was 100 percent online. Online learning really does suck ; (",
      "author": "RealMcNuggets69",
      "created": 1615112194,
      "upvotes": 1,
      "replies": {}
    },
    "gq314u9": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq314u9/",
      "text": "I stopped being motivated after like week 2. I’ve decided to completely switch gears regarding my major after this semester so all of my classes this semester except for one are useless. I’m tired.",
      "author": "PartyBear9",
      "created": 1615110011,
      "upvotes": 1,
      "replies": {}
    },
    "gq2zctl": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2zctl/",
      "text": "I start counting down remaining days of classes from the start of the semester.",
      "author": "DjSzymek",
      "created": 1615108233,
      "upvotes": 2,
      "replies": {}
    },
    "gq2z0k0": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2z0k0/",
      "text": "This semester is killing me. I don't know what's wrong. I got sick at the beginning so I started off behind, and the lingering fatigue made it feel almost impossible to recover until I was so far behind I couldn't even know where to begin. And then Texas froze over, and our house got all messed up, right when I was pulling myself back up onto my feet. I have no idea how I am going to make it through this semester.",
      "author": "efvalentine",
      "created": 1615107898,
      "upvotes": 3,
      "replies": {}
    },
    "gq2u5q2": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2u5q2/",
      "text": "It just feels like busy work. \nAt the junior and senior level,  exams and papers seem quite pointless. Showing up for class, even virtually,  should be good enough. Sometimes I think I'm better off reading books on my own since a lot of the material I can learn on my own at a better pace; I'm in class and I see people struggle on ninth grade level stuff and it baffles me. I hate to be an asshole. I really do. But something has to change at the university level or people like me will just say fuck it. I'm a depressed asshole.",
      "author": "itsthekingsteven",
      "created": 1615103102,
      "upvotes": 13,
      "replies": {}
    },
    "gq2s7dd": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2s7dd/",
      "text": "Yes. And first day of class starts tomorrow. 😂",
      "author": "reinakun",
      "created": 1615101321,
      "upvotes": 1,
      "replies": {}
    },
    "gq2rpw6": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2rpw6/",
      "text": "We’re halfway through the semester. Here’s hoping for a better fall semester where we can meet in person again and never have to do Packback discussions ever again!",
      "author": "1warrioroflight",
      "created": 1615100896,
      "upvotes": 1,
      "replies": {}
    },
    "gq2qwmd": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2qwmd/",
      "text": "IM SO GLAD IM NOT THE ONLY ONE",
      "author": "dudekate",
      "created": 1615100207,
      "upvotes": 3,
      "replies": {}
    },
    "gq2qref": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2qref/",
      "text": "I’m not counting but I wish it was done already. I have a fraction of the motivation I had last semester and every day I just feel like giving up. I’m on my last semester and I’m struggling with computer science course that I need to graduate so it just makes me feel way worse to know I have several weeks to go... praying for may to come so I can finally be done w university.",
      "author": "sighry",
      "created": 1615100087,
      "upvotes": 5,
      "replies": {}
    },
    "gq2qmu9": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2qmu9/",
      "text": "I am. Got the email like a week ago that we are 7 weeks in. (Out of 14) and.. it feels like sooo long. I don’t have many classes and I actually love them but still. It feels like sooo long. I’m looking forward to the end because well.. it’s the end. But also my best friend and I are getting tattoos to celebrate lmao",
      "author": "sparklingsnow46",
      "created": 1615099980,
      "upvotes": 6,
      "replies": {}
    },
    "gq2qk4n": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2qk4n/",
      "text": "This semester from what I can tell so far is mentally draining on anybody. Not necessarily because classes are any harder than they were in previous years, I think people have really hit the peak of their COVID/pandemic fatigue and burnout. For me at least, Spring we thought it would be gone by summer, summer jobs and the nice weather helped keep our mind off things, the numbers weren’t that bad in many areas during the Fall, and the winter the numbers exploded and now it’s been 1 full year of the pandemic and I think everyone’s just sick of the way things are. I wish there was like a 6 month pause to where we can just chill lol. \n\nI am hopeful that the continuation of declining COVID numbers and end of winter will help us get through to May.",
      "author": "andy64392",
      "created": 1615099919,
      "upvotes": 16,
      "replies": {}
    },
    "gq2oxut": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2oxut/",
      "text": "Yea!!! I have never been more overwhelmed in my life. I have 4 exams this week starting Monday, and tomorrow I’m working open to close 😭",
      "author": "melsue1026",
      "created": 1615098631,
      "upvotes": 1,
      "replies": {}
    },
    "gq2oa8o": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2oa8o/",
      "text": "it's so weird how time has gone by so fast but the days go by so slow? my uni got rid of spring break and is now giving us a number of \"mental health days\" where things aren't supposed to be due/no classes held but profs are keeping them due on those days anyway like BRUH",
      "author": "bighonkymommymilkers",
      "created": 1615098158,
      "upvotes": 3,
      "replies": {}
    },
    "gq2nzgh": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2nzgh/",
      "text": "Absolutely, right now Im done 6/16 weeks, little less than halfway, more than a third of the way done. I daydream that, two weeks from now I would have spring break, but there is no spring break...",
      "author": "MolecularMalevolence",
      "created": 1615097950,
      "upvotes": 2,
      "replies": {}
    },
    "gq2m3qs": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2m3qs/",
      "text": "I think last semester was harder for me cause there was no vaccine and I wasn’t used to covid college yet\n\nBut this semester is way worse for motivation. I just can’t focus anymore. I’ve never been so unmotivated in my life. And we’ve been in this longer",
      "author": "earthxtone00",
      "created": 1615096523,
      "upvotes": 20,
      "replies": {}
    },
    "gq2llot": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2llot/",
      "text": "Literally everyone does that every year.",
      "author": "icroc1556",
      "created": 1615096130,
      "upvotes": -4,
      "replies": {
        "gq41ww8": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq41ww8/",
          "text": "Exactly. Cant relate to any of this shit. “Its so meaningless and empty”, k well we’re not at Hogwarts, sorry chief. Who needs to find meaning in every little thing? Unreal.",
          "author": "OsculatingPlanes",
          "created": 1615136622,
          "upvotes": -2,
          "replies": {}
        }
      }
    },
    "gq2l6xs": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2l6xs/",
      "text": "Yes, my semester just started this week and im already marking how long until i am done",
      "author": "RAWRITSMONSE",
      "created": 1615095842,
      "upvotes": 2,
      "replies": {}
    },
    "gq2l4nf": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2l4nf/",
      "text": "Dude, I felt like 3 months had passed and it turned out it was barely gonna be 1 month into the semester..... I need a vacation at a beach and my life back",
      "author": "Sweaty-Opposite6162",
      "created": 1615095799,
      "upvotes": 6,
      "replies": {}
    },
    "gq2kylk": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2kylk/",
      "text": "YES!!!!!!! I’m literally feeling burnt out!",
      "author": "95xander",
      "created": 1615095684,
      "upvotes": 3,
      "replies": {}
    },
    "gq2k8al": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2k8al/",
      "text": "Yes cause then I'll only have one year left finally",
      "author": "conker1264",
      "created": 1615095188,
      "upvotes": 4,
      "replies": {}
    },
    "gq2hbrv": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2hbrv/",
      "text": "Been doing that since day one",
      "author": "Tiedbison305407",
      "created": 1615093359,
      "upvotes": 3,
      "replies": {}
    },
    "gq2g932": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2g932/",
      "text": "I'm in the last half of the semester and I've mentally checked out already. I put way more effort and time into the first 8 weeks to stay ahead by one week that now I just don't care. I have no motivation and I'm tired of this hybrid learning or not knowing when we'll meet in person or virtual until the night before or day of. I don't understand the point in the classes I'm taking as they are very very similar to other classes. Seriously though, a group of us cannot figure out what the difference is between them. I hate it, I don't like it. Still love what I do and going for but I absolutely hate the classes. 8 more weeks and I'm done until fall semester.",
      "author": "ReGr19",
      "created": 1615092647,
      "upvotes": 16,
      "replies": {}
    },
    "gq2dz42": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2dz42/",
      "text": "I can't fucking wait for it to end, (I'm on the quarter system) so I only have one more week of classes then finals and then a week long break, and then I start my 6 month internship. God I hope classes are in-person for next fall.",
      "author": "fan4stick",
      "created": 1615091138,
      "upvotes": 6,
      "replies": {}
    },
    "gq2dpeh": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2dpeh/",
      "text": "I'm so over this semester and it started week two.",
      "author": "Bodidiva",
      "created": 1615090963,
      "upvotes": 19,
      "replies": {}
    },
    "gq2d86x": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2d86x/",
      "text": "I feel this so much! Counting the days until the semester is over!",
      "author": "Stonks_andtheCity",
      "created": 1615090666,
      "upvotes": 4,
      "replies": {}
    },
    "gq2cd4t": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2cd4t/",
      "text": "I... Stopped counting actually.\n\nI've gone through enough to realize what my true passion was and decided to go along with university and pass. \n\nBut hey, the courses I'm learning might help me in the future so it's still pretty nice to learn a thing or two and experience the life as a student.\n\nBy the time I graduated, I have a bunch of stories and experience to tell.",
      "author": "Yunchansamakun",
      "created": 1615090110,
      "upvotes": 17,
      "replies": {}
    },
    "gq2c0fo": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2c0fo/",
      "text": "Yes. Just 8 more weeks. I’m miserable.",
      "author": "peterisfrosty1",
      "created": 1615089884,
      "upvotes": 4,
      "replies": {}
    },
    "gq2asjj": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2asjj/",
      "text": "This was me last semester. This semester has been better for me, compared to last semester.",
      "author": "Anonymous_1010974523",
      "created": 1615089117,
      "upvotes": 3,
      "replies": {}
    },
    "gq25fj3": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq25fj3/",
      "text": "I just need to speed through this week and I’ll get to Spring Break. \n\nThis semester feels awful. The time is going by so quickly and I feel like I dont have enough hours in my day. I feel like everyday not spent doing schoolwork including weekends sets me back significantly.",
      "author": "18dwhyte",
      "created": 1615085808,
      "upvotes": 35,
      "replies": {
        "gq2kzw4": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2kzw4/",
          "text": "Atleast you have spring break, all we get is three wellness days scattered throughout the semester where every class just moves to a different day of the week and nothing actually changes",
          "author": "BylvieBalvez",
          "created": 1615095709,
          "upvotes": 52,
          "replies": {
            "gq355iu": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq355iu/",
              "text": "We don’t even get wellness days at my school 🙃",
              "author": "aworkinprogress98",
              "created": 1615114212,
              "upvotes": 10,
              "replies": {
                "gq3gu5z": {
                  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3gu5z/",
                  "text": "Same, no spring break, no extra days off. \n\nLast year my university requested that people don't travel during spring break. Of course that didn't happen, and we went right into distance learning when spring break ended. This year they knew kids would be irresponsible again and called the whole week off.\n\nSo thank you to the girls in one of my labs who last year said \"at least if we get quarantined on our trip to Cancun, we'll be quarantined on the beach!\" and all the other selfish and idiotic students at my uni who had the same thoughts.",
                  "author": "Eldritch_Honey",
                  "created": 1615124579,
                  "upvotes": 11,
                  "replies": {}
                }
              }
            },
            "gq3wswo": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3wswo/",
              "text": "My school tried to say “you get spring break this year!” but they just changed the name of Easter break to spring break. It’s like 3 days instead of a week so nice try.",
              "author": "uraniumstingray",
              "created": 1615134008,
              "upvotes": 3,
              "replies": {}
            }
          }
        },
        "gq3u51w": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3u51w/",
          "text": "Our spring break was the second week in February for some reason. We started classes on the last week of January",
          "author": "WWalker17",
          "created": 1615132626,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gq25cik": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq25cik/",
      "text": "I’m about to fucking lose it. It’s 10 PM on a Saturday night and I’m doing schoolwork for classes that I hate with a passion, and I’ll probably be working until 2 or 3 AM. Started at 12 today, just have to wake up and do it again tomorrow. I’m so burnt out and highly dislike my courses. And my school was supposed to have spring break this upcoming week, but nope. I get to continue this vicious cycle. My psychiatrist at the university mentioned that a lot of people are seriously struggling with the same issues I am right now. I wonder why this semester is so fucking brutal...",
      "author": "AStruggling8",
      "created": 1615085753,
      "upvotes": 203,
      "replies": {
        "gq29iaf": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq29iaf/",
          "text": "You have just described my day and my exact feelings!",
          "author": "Apprehensive_Camel34",
          "created": 1615088334,
          "upvotes": 46,
          "replies": {
            "gq2a0gm": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2a0gm/",
              "text": "Bruh like what the fuck is going on I have no idea how it ended up like this. I just wish I had my spring break, I’m so tired 😣",
              "author": "AStruggling8",
              "created": 1615088640,
              "upvotes": 25,
              "replies": {
                "gq4ljb9": {
                  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4ljb9/",
                  "text": "same. THEY TOOK AWAY OUR BREAK!! and replaced them with random days off. I rather have a week than just a day to catch up on work.",
                  "author": "shygirlsclub",
                  "created": 1615145083,
                  "upvotes": 6,
                  "replies": {}
                },
                "gq6trmp": {
                  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq6trmp/",
                  "text": "I'm scared to even get my spring break since my teachers are gonna give out giant assignments to do over the break",
                  "author": "DarthlnvaderZim",
                  "created": 1615189243,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        },
        "gq2r7rp": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2r7rp/",
          "text": "Same it's about to turn 11pm and I've been working on my homework since 5pm. I for some reason can't write a freaking proper sentence for this assignment. I have no motivation at all. I'm on question 5 of 14 and just want to turn it in. But I likely will be up till 6am working on this, due at 11am tomorrow. hrtfgjkengvesjkfvnesjgfvnkesj\n\nEdit: It's now 2am, four questions to go. Almost... there...\n\nEdit 2: It is now 5am... sleepy... must keep going!\n\nEdit 3: 7am, one question to do. Lol these edits have been motivating. I am feeling a little delirious ahahahah\n\nEdit 4: Almost 8am. Goodnight. I mean, good morning.",
          "author": "Sunnyroses",
          "created": 1615100464,
          "upvotes": 18,
          "replies": {
            "gq4ewqp": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4ewqp/",
              "text": "I went to bed at about 2:30 AM and woke up at 8 AM, have been grinding since and I’m still not gonna finish everything. Woke up feeling like I’d been run over like multiple trains, just so dead. Like please fucking make it end lmao this isn’t worth it",
              "author": "AStruggling8",
              "created": 1615142361,
              "upvotes": 5,
              "replies": {
                "gq4gkyz": {
                  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4gkyz/",
                  "text": "Oh dang dude. Good luck today! I'll pray for yah lol. I haven't slept yet because now my entire family is awake and my neighbors are running their leaf blower. C'est la vie. I guess I'd better try to sleep. I hope your day goes smoothly!",
                  "author": "Sunnyroses",
                  "created": 1615143048,
                  "upvotes": 2,
                  "replies": {}
                }
              }
            }
          }
        },
        "gq2vhej": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2vhej/",
          "text": "I feel you!!!!!!!!. It's litterally sunday morning 3:00 AM and i still have 2 midterms, a weekly class discussion, a paper due 11:59 sunday night., and on top of that still have to study for next week's kraken about to be unleashed. It's a piece of cake tho ( sarcasm). but for real, most of my assignments are done, its just time consuming due to the reading. College is mostly reading, in order to understand the written portion. all you have to do is prioritize your time into small chunks throughout the week. Don't do it all in one sitting. That's why you have all week. We both survived elementary, middle , high school.and now here we are. WE DIDN'T COME ALL THIS WAY TO GIVE UP NOW!!! WE ARE SO CLOSE TO THE END. WE WILL GET THROUGH THIS✌👍✌👍✌. it will all pay off in the end. stay prayed up, god knows what he is doing. SPRING BREAK IS NEAR. I'M PRAYING FOR YOU, KEEP UP THE GOOD WORK, STAY SAFE OUT THERE, IT'S WILD IN THE JUNGLE WE CALLED THE WORLD, ESPECIALLY NOW IN THESE TIMES",
          "author": "Active_Ninja_5043",
          "created": 1615104384,
          "upvotes": 17,
          "replies": {}
        },
        "gq2p5xh": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2p5xh/",
          "text": "I just finished 4 hours of one class. And I have 4 other classes to study for exam-one being microbiology and I am not understanding ANY OF IT. Not when it comes to the exams. The little work on Pearson I can do, even the worksheets. But the chapters as a whole, closed book-nope. I’m afraid I’m going to fail it. I’ve got until the 26th to withdraw, and I’m seriously considering it if I tank the next 2 exams. (My first exam was 78%, which doesn’t sound horrible but I’m in the nursing program so my grade can’t be under a 75 for the class) \nI currently have and have had all As until this class.\nAnd it is severely messing with my head.",
          "author": "melsue1026",
          "created": 1615098803,
          "upvotes": 21,
          "replies": {}
        },
        "gq4m7cu": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4m7cu/",
          "text": "I am a fashion design major at my university. So taking studio classes , which are 4hr classes once a week. The work we do in studio classes aren’t something you do in a night. You are making garments and patterns. Now for some reason this semester. They broke up the 4hr classes into 2 days a week and 2 hrs each session. \n\nFor some god knows reason , it is 10X more work than last semester. Each class is faster and more work. Mind you you have shorten time to get our homework in before Sunday night. Last night I was working til 4 am. That’s usually how my nights go. I work my job from 10-5pm. Right I go back to campus 5- ??? Am in the morning",
          "author": "shygirlsclub",
          "created": 1615145358,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "gq254jn": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq254jn/",
      "text": "Literally me. Just nine more weeks. Already past half way through the semester.",
      "author": "_YouSaidWhat",
      "created": 1615085613,
      "upvotes": 5,
      "replies": {}
    },
    "gq1x2hl": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1x2hl/",
      "text": "My college’s subreddit has a calendar counting off the weeks. Every Friday, a box gets crossed off.",
      "author": "CapriciousSalmon",
      "created": 1615080791,
      "upvotes": 34,
      "replies": {}
    },
    "gq1totc": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1totc/",
      "text": "8 more Mondays...",
      "author": "CommanderNat",
      "created": 1615078768,
      "upvotes": 84,
      "replies": {
        "gq2sjgi": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2sjgi/",
          "text": "reading it phrased this way for some odd reason this makes me feel a lot better. 8 Mondays sounds a lot less worse than 8 weeks",
          "author": "liftingline27",
          "created": 1615101622,
          "upvotes": 62,
          "replies": {
            "gq2vvz3": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2vvz3/",
              "text": "Time is an illusion lol. There is no spoon ( the matrix film reference)",
              "author": "Active_Ninja_5043",
              "created": 1615104775,
              "upvotes": 21,
              "replies": {}
            }
          }
        },
        "gq3wlfc": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3wlfc/",
          "text": "I have 9 not including finals week",
          "author": "uraniumstingray",
          "created": 1615133897,
          "upvotes": 4,
          "replies": {
            "gq3y3dc": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3y3dc/",
              "text": "We get the Monday after easter off",
              "author": "CommanderNat",
              "created": 1615134680,
              "upvotes": 2,
              "replies": {}
            }
          }
        },
        "gq4grmt": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4grmt/",
          "text": "About 9 or 10 for me. 😔",
          "author": "internally",
          "created": 1615143120,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "gq1ta1d": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1ta1d/",
      "text": "I'm counting the weeks until the end of april. Because by that time I will see what UC's accepted me.",
      "author": "tha_oz",
      "created": 1615078528,
      "upvotes": 17,
      "replies": {}
    },
    "gq1scwq": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1scwq/",
      "text": "Yup definitely. Honestly I feel a lot unhappier than last semester.",
      "author": "sourmilkseaaa",
      "created": 1615078002,
      "upvotes": 40,
      "replies": {}
    },
    "gq1kjq8": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1kjq8/",
      "text": "[removed]",
      "author": null,
      "created": 1615075132,
      "upvotes": 1,
      "replies": {}
    },
    "gq1j6jr": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1j6jr/",
      "text": "I can’t explain it. This semester feels nothing like the last... I hate it",
      "author": "Edwardo-18",
      "created": 1615074661,
      "upvotes": 427,
      "replies": {
        "gq1lizu": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1lizu/",
          "text": "Yes. This semester is much, much worse.",
          "author": "saywcu",
          "created": 1615075417,
          "upvotes": 230,
          "replies": {
            "gq1r1hx": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1r1hx/",
              "text": "It definitely is, I hit this super unmotivated point way earlier than I did last semester",
              "author": "julsya004",
              "created": 1615077249,
              "upvotes": 173,
              "replies": {
                "gq1s3x1": {
                  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1s3x1/",
                  "text": "For me it's not even being unmotivated, I've just been questioning my purpose as a college student a lot lately.",
                  "author": "saywcu",
                  "created": 1615077860,
                  "upvotes": 149,
                  "replies": {
                    "gq1v3qa": {
                      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1v3qa/",
                      "text": "I definitely understand that. Do you have a major you enjoy or any sense of direction for after you would graduate?",
                      "author": "julsya004",
                      "created": 1615079586,
                      "upvotes": 37,
                      "replies": {
                        "gq3t91h": {
                          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3t91h/",
                          "text": "Yes I do! Getting my B.S in Accounting and a M.S in Statistics so I can get my CPA.\n\nRemote learning just has me feeling a certain type of way 😩 fall can't come soon enough.\n\nAnyways, I hope you finish off your semester strong :)",
                          "author": "saywcu",
                          "created": 1615132160,
                          "upvotes": 12,
                          "replies": {}
                        }
                      }
                    },
                    "gq2re7o": {
                      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq2re7o/",
                      "text": "Glad to know I’m not alone in these feelings. Some classes have me so burnt out that I don’t even wanna *think* about school.",
                      "author": "cynical_root24",
                      "created": 1615100618,
                      "upvotes": 38,
                      "replies": {
                        "gq3kh0f": {
                          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3kh0f/",
                          "text": "I’m also glad to know i’m not alone. I also feel the same",
                          "author": "ResidentAcademic",
                          "created": 1615127031,
                          "upvotes": 9,
                          "replies": {}
                        },
                        "gq4kxl5": {
                          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4kxl5/",
                          "text": "oof same. Last semester I took 7 classes and passed all of them with a 3.0 gpa. I’m taking 6 now and I feel like I can’t do it. I’m dropping one , thinking about dropping two. I can’t do this. The classes I need to pass, they are giving out so much work each week. I am past burnt out, I am unmotivated",
                          "author": "shygirlsclub",
                          "created": 1615144832,
                          "upvotes": 7,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gq3wfjc": {
                  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3wfjc/",
                  "text": "I skipped an assignment on the second week. I usually last like a month or more before I miss an assignment.",
                  "author": "uraniumstingray",
                  "created": 1615133812,
                  "upvotes": 8,
                  "replies": {}
                },
                "gq46vh8": {
                  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq46vh8/",
                  "text": "I thought I was the only one who felt this way. This term has been tedious and I have lost my spark.",
                  "author": "AffectionateRegret74",
                  "created": 1615139095,
                  "upvotes": 4,
                  "replies": {}
                },
                "gq7w3dv": {
                  "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq7w3dv/",
                  "text": "same mostly bc there's no spring break so if I was on spring break I could recharge rn but now we got 8 more weeks plus finals week",
                  "author": "sapphireruby2021",
                  "created": 1615217419,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            },
            "gq450ux": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq450ux/",
              "text": "I feel like spring semester is always worse than fall. It just feels longer and sadder and more stressful. And with covid especially there seems to be a light at the end of the tunnel but we're all so jaded/depressed from the last year that having genuine hope is a struggle. Also for seniors we are coping with the fact that we've lost half of college, all of senior year and graduation, and we can never get it back...",
              "author": "antonia_dreams",
              "created": 1615138177,
              "upvotes": 8,
              "replies": {}
            },
            "gqeclux": {
              "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gqeclux/",
              "text": "There are so many of us. I am currently feeling exactly like this. Last semester I did 2 classes and was okay. Never really fell behind or anything. This semester is dragging me so hard, I t’s one class. Reading during the week and stuff. It’s not hard but I’m having the hardest time keeping with it and wanting to do it at all. This is only week 5.",
              "author": "Luckygyrl83",
              "created": 1615339972,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gq24mf7": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq24mf7/",
          "text": "My semester is technically better than the last, but it feels empty. Hardly anyone I know at my university has motivation now, even the professors seem burned out.",
          "author": "tlacct",
          "created": 1615085300,
          "upvotes": 43,
          "replies": {}
        },
        "gq3998d": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq3998d/",
          "text": "I got depressed so my panick based motivation strategy has stopped working.  Turns out I was using my ability to do three weeks of A- work in four hours was masking the fact that I have adhd, so I get to deal with that shit now.",
          "author": "Alistair_TheAlvarian",
          "created": 1615118410,
          "upvotes": 14,
          "replies": {}
        },
        "gq4kkce": {
          "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq4kkce/",
          "text": "I thought I was the only one. Last semester I took more classes too. This semester just feels so much worst than last. It’s weird",
          "author": "shygirlsclub",
          "created": 1615144680,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gq1izkj": {
      "link": "/r/college/comments/lzeb46/anyone_else_counting_down_the_weeks_till_the/gq1izkj/",
      "text": "i feel the same, i hope these two months go by fast",
      "author": "Daconviss",
      "created": 1615074593,
      "upvotes": 38,
      "replies": {}
    }
  },
  "updated": 1634051739
}