{
  "sid": "q1mnlh",
  "link": "/r/college/comments/q1mnlh/3rd_breakdown_in_1_week/",
  "title:": "3rd breakdown in 1 week",
  "text": "I had a breakdown Thursday, Friday, and again today. The first 2 was over prob stats and this one I’m currently going through is over A&P. I want to be a nurse and it’s the only thing I see myself doing other than photography which is more of a hobby. Currently I’m a ER tech and love my job and it’s made me realize that there’s nothing else I’d rather do other than be a nurse. But I can’t keep putting myself through this. These first 7 weeks of prereqs have been awful and my mental health has gone to absolute dog shit. I don’t understand how I can study 40+ hours a week and still fail every fucking test I take. I do fine on quizzes and I feel confident with most of the information but I still fucking fail tests. It’s extremely discouraging. There’s a lot more to it but I don’t feel like typing a longer essay than this already is.",
  "author": "yourbluebird638",
  "created": 1633405325,
  "updated": 1634083983,
  "over_18": false,
  "upvotes": 13,
  "upvote_ratio": 1.0,
  "comments": {
    "hffwml2": {
      "link": "/r/college/comments/q1mnlh/3rd_breakdown_in_1_week/hffwml2/",
      "text": "Have you considered getting psych tested for learning problems? My brother has accomodations that help him, like a separate quiet room for exams. His test anxiety goes through the roof otherwise, and that's what sounds like is going on with you.",
      "author": "CindsSurprise",
      "created": 1633406348,
      "upvotes": 3,
      "replies": {}
    },
    "hfh7lru": {
      "link": "/r/college/comments/q1mnlh/3rd_breakdown_in_1_week/hfh7lru/",
      "text": "Hey only 3 breakdowns ? I’m on like my 7 billionth, lost track probably more. You’ll adapt eventually or not ! Survival of the fittest >:)\n\nEdit: downvote me cuz I’m right lol, people pretend to care but it’s all about survival of the fittest.",
      "author": "AspiraRules20",
      "created": 1633441213,
      "upvotes": 0,
      "replies": {}
    }
  }
}