{
  "sid": "q1j29v",
  "link": "/r/college/comments/q1j29v/how_flexible_are_professors_colleges_with/",
  "title:": "How flexible are professors / colleges with students who have jobs?",
  "text": "I’m an incoming college student whose virtually clueless in terms of the average student’s day-to-day life. While I’m aware there are many jobs that are flexible with students, I intend on keeping my current job, only updating my schedule.\n\nI’m wondering, however, if I will be able to maintain this job (3 days — including weekends) whilst attending college. Generally speaking, how flexible are colleges / professors with students who have responsibilities outside of school (eg. People with children, jobs, etc.)? While I’m sure it’d be difficult considering I’d be missing the actual lecture, is there anyway one can receive (and presumably complete) coursework early in exchange for a weekday off?\n\nPlease let me know your experiences and/or any advice you may have! Thank you.",
  "author": "daisykeeks",
  "created": 1633393027,
  "updated": 1634084194,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hff7dm1": {
      "link": "/r/college/comments/q1j29v/how_flexible_are_professors_colleges_with/hff7dm1/",
      "text": ">is there anyway one can receive (and presumably complete) coursework early in exchange for a weekday off?\n\nNo. Youre just gonna have to plan your work schedule around school, not the other way around. If you work 3 days including weekends then thats only 1 weekday which is easy peasy to schedule. If you can only work 2-10pm on fridays for example, then dont sign up for a class that is during that time. If you *have* to sign up for a class that is only available during that time, then youll need to either work a different day or not at all. If you miss class, most professors are pretty good about uploading lecture materials but tbh its a crapshoot. In my physics class when the professor goes over problems she does it on scrap paper and doesnt upload it anywhere. So if you miss class, unless you have someone take a pic or send you notes, youre screwed. \n\nPretty much everyone in college thats not a freshmen has other obligations, whether its work, children, volunteering, clubs, being a caretaker, etc. Professors know that and are usually understanding if an emergency happens (that you can verify somehow), but theyre not going to personally catch you up every week because you consistently go to work rather than class",
      "author": "taybay462",
      "created": 1633393347,
      "upvotes": 9,
      "replies": {}
    },
    "hfff12b": {
      "link": "/r/college/comments/q1j29v/how_flexible_are_professors_colleges_with/hfff12b/",
      "text": "No you can’t just miss the lectures. Don’t sign up for classes the same day as work, or better yet don’t work when you have class. You cannot receive work early and you don’t get extensions for having a job a deadline is a deadline for school. You have to be creative and figure out how to make things work.",
      "author": "Concerned-23",
      "created": 1633397205,
      "upvotes": 7,
      "replies": {}
    },
    "hffh3mx": {
      "link": "/r/college/comments/q1j29v/how_flexible_are_professors_colleges_with/hffh3mx/",
      "text": "In general it is your responsibility to structure your work around class and not the other way around. There can be 10-100 students in class and a professor cannot accommodate all their work schedules. Maybe you can schedule turning in an assignment late every once and a while, but adjustments to lecture are too much.",
      "author": "hdorsettcase",
      "created": 1633398238,
      "upvotes": 3,
      "replies": {}
    },
    "hfg5ie8": {
      "link": "/r/college/comments/q1j29v/how_flexible_are_professors_colleges_with/hfg5ie8/",
      "text": "I did the same kind of work schedule for most of college, and usually the work is structured around the school schedule not the other way around. You can turn in stuff early but the class will go on with or without you.",
      "author": "NinjaLorian",
      "created": 1633412291,
      "upvotes": 3,
      "replies": {}
    },
    "hfgypc2": {
      "link": "/r/college/comments/q1j29v/how_flexible_are_professors_colleges_with/hfgypc2/",
      "text": "They aren't. The job is what needs to be flexible to school",
      "author": "TragicalKingdom",
      "created": 1633436625,
      "upvotes": 2,
      "replies": {}
    },
    "hff700c": {
      "link": "/r/college/comments/q1j29v/how_flexible_are_professors_colleges_with/hff700c/",
      "text": "It really depends on the professor.",
      "author": "shedobefunny",
      "created": 1633393160,
      "upvotes": 3,
      "replies": {}
    }
  }
}