{
  "sid": "q715ny",
  "link": "/r/college/comments/q715ny/what_to_write_on_my_dorm_door_whiteboard/",
  "title:": "What to write on my dorm door whiteboard?",
  "text": "Hey guys! I moved into residence a little late and i’m having trouble making friends as everyone has already made friend groups. Anyways i have a whiteboard and wrote “just moved in, feel free to come say hi!” on it and like 2 people came to say hi haha but i’m very good friends with one of them now! anyways since it’s been a while since i moved in, i’m having trouble trying to find something new to write on my white board, something that can hopefully create friendships. Any ideas? I do keep my dorm door open but no one comes in :(",
  "author": "liltrippieuziwrld",
  "created": 1634090714,
  "updated": 1634167615,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hgfnrfr": {
      "link": "/r/college/comments/q715ny/what_to_write_on_my_dorm_door_whiteboard/hgfnrfr/",
      "text": "You can write your Snapchat & insta if you’d be comfortable with it and people might be more likely to say hi online first!! Then meet in person if you vibe :)",
      "author": "lyvnicole929",
      "created": 1634091526,
      "upvotes": 3,
      "replies": {}
    },
    "hgg1pzb": {
      "link": "/r/college/comments/q715ny/what_to_write_on_my_dorm_door_whiteboard/hgg1pzb/",
      "text": "no matter what you write on your whiteboard, it'll probably be erased and replaced by penises in about a week!!!! so don't sweat it!! write whatever!!!\n\nSome people in my dorm wrote some fun questions and left a marker out for people to answer!!",
      "author": "caesarsaladisgood",
      "created": 1634098762,
      "upvotes": 1,
      "replies": {}
    },
    "hggf9mk": {
      "link": "/r/college/comments/q715ny/what_to_write_on_my_dorm_door_whiteboard/hggf9mk/",
      "text": "I would do a controversially fun opinion, like \"chips ahoy is better than oreos, change my mind\" or some dumb shit like that, im sure you or anyone else can come up with a better example than mine lol. Idk might sound stupid but to me thats what i would do. Also maybe hang up the steven crowder picture if you do do that so it goes with it and people understand the joke.\n\nMaybe if youre a good drawer and you keep doing good drawings on the board maybe someone will notice.\n\nThis is a hard question honestly, i even feel kinda stupid for the suggestions i gave lool.",
      "author": "Chaz_Delicious",
      "created": 1634108055,
      "upvotes": 1,
      "replies": {}
    }
  }
}