{
  "sid": "r7eeqj",
  "link": "/r/college/comments/r7eeqj/professorstudent_relationship/",
  "title:": "Professor-Student Relationship?!?",
  "text": "So my classmates arranged a meet up with my professor, who we’ve never met since it’s an ASYNCHRONOUS CLASS (100% online no zoom), at a bar… to drink.. \ni don’t know maybe it’s because i’ve always been conditioned to think students/professors can’t have a relationship like that \ni understand if it’s something like coffee to talk about an internship or if they’re your mentor something like that \nBUT GO OUT AND TAKE SHOTS W HIM?? WITH A BUNCH OF COLLEGE GIRLS?? HES LITERALLY LIKE IN HIS 40’s, MARRIED, WITH KIDS\ni don’t know so far im the only one who thinks it’s weird everyone else is “so excited to take a shot w him”",
  "author": "diensma109",
  "created": 1638471313,
  "updated": 1638479901,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 0.8,
  "comments": {
    "hmyxdgw": {
      "link": "/r/college/comments/r7eeqj/professorstudent_relationship/hmyxdgw/",
      "text": "Uncommon or weird doesn't warrant criticism by itself. There's nothing that indicates an unreasonable risk for a conflict of interest.\n\nI personally would rather see more stuff like this than university culture becoming painfully staid. A lot of professors won't even meet you off campus to chat about a project over coffee and I find that much worse than this. People making a huge deal about small stuff like this is why professors are so afraid to act like a normal social human around their students. Screw the judgemental people. Most of this stuff is not an actual issue and there is no expectation on you to participate.",
      "author": "darniforgotmypwd",
      "created": 1638473450,
      "upvotes": 1,
      "replies": {}
    },
    "hmysyn7": {
      "link": "/r/college/comments/r7eeqj/professorstudent_relationship/hmysyn7/",
      "text": "Some profs do this, others don’t. The best way to make sure this is ok is to always remember they’re a prof, and don’t treat them like a friend. Let them buy you a round, but don’t buy one for them. Don’t hit on them, and stop anyone else among the class from doing so.",
      "author": "AceyAceyAcey",
      "created": 1638471751,
      "upvotes": 1,
      "replies": {
        "hmyu3jv": {
          "link": "/r/college/comments/r7eeqj/professorstudent_relationship/hmyu3jv/",
          "text": "i mean i wasn’t really planning on going so i can’t really do anything. the prof is cool and all from what i know (again we literally don’t know this man we only know him from lecture videos on youtube) but not close enough to go out and drink w him yknow",
          "author": "diensma109",
          "created": 1638472188,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmz0l3n": {
      "link": "/r/college/comments/r7eeqj/professorstudent_relationship/hmz0l3n/",
      "text": "Yeah alcohol and students is a no-no. The only exception I can think of is something like a school-sponsored dinner, which this obviously isn't. I would stay away from this professor and any students going out with him, if possible.",
      "author": "hdorsettcase",
      "created": 1638474696,
      "upvotes": 1,
      "replies": {}
    },
    "hmz7nop": {
      "link": "/r/college/comments/r7eeqj/professorstudent_relationship/hmz7nop/",
      "text": "So don't take a shot with him and continue not having as good a relationship with him than the rest of your classmates who are willing to know their professor as a human being and not some monolithic, extraterrestrial entity. It won't hurt you--also won't help you. \\*shrug\\*",
      "author": "DoorHingeDeliveries",
      "created": 1638477437,
      "upvotes": 1,
      "replies": {}
    }
  }
}