{
  "sid": "qa91zm",
  "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/",
  "title:": "A Discussion About Academic Integrity…",
  "text": "I already know this will ruffle some feathers, so to start I want to be clear that I am not advocating for cheating. I do however, sometimes wonder about the standards of academic integrity and what goals they support\n\nHere’s what I mean:\n\nAn incredible amount of effort, energy, and attention is dedicated by professors and universities as a whole towards preventing cheaters, or catching them in the act. From what I’ve read/heard talking to people, it ranges anywhere from creating very “sterile” testing conditions to diligent hunting of anyone who could possibly be cheating.\n\nIn response to that I ask, what’s the actual purpose of all that effort? What’s the goal?\n\nOf course the answers fall in the ballpark of creating a fair playing field and testing a student‘s true knowledge. But I’m not satisfied with those. Why are those so critical?\n\nOnce again, I read/hear from people who look up A LOT at work, but it’s normal and expected. They aren’t a bad person or an idiot for looking up the resource/answer.\n\nWhy do schools emphasize content learning/consumption over teaching functional, usable learning skills? Of course every field has some root knowledge someone should know to get a starting job, but I don’t believe 4 years of semester focused learning necessarily helps lock that information in.\n\nInstead, it seems to me, that academic integrity standards exist primarily to support University reputations. It lets them claim the most rigorous courses of study. It lets them get clean data to compare against other schools so they can market themselves as better.\n\nI personally think that’s a poor reason to adhere to harsh AI policies. While I believe college is important, I don’t believe it should be a crazy competitive business market. Otherwise you get policies like this which are not necessarily in full interest of student benefit, justified under the guise of another name.\n\nI’d love to hear your thoughts/opinions on this. I’ve missed some points I have because my phone is lagging and I don’t want to make this a full essay.",
  "author": "Casual-Economist",
  "created": 1634509021,
  "updated": 1634654810,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.5,
  "comments": {
    "hh1h2n5": {
      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1h2n5/",
      "text": "One concern I have is about students having the necessary skills to go out in the world to do well and make the whatever they touch better. I worry about my students who buy papers at paper mills. I worry about students who pay others to attend class and do homework for them. When the cheating student goes out into their field to work, they will use the diploma to vouch that they have integrity, knowledge, and ability that they need to do no harm to themselves or others. \n\nAdditionally, I hate having to catch cheaters but we spend time doing it because it is better a student learn now in the safety of schooling than it is when they could really create harm. Finding plagiarism or other forms of academic dishonesty is the worst part of my job. I don't even look for cheating, it is often blatantly obvious. Then when I catch it, it takes hours of my time I'd like to spend elsewhere, including giving meaningful feedback to students. Cheaters have no clue the hardship cheating brings to others. They're often only thinking of themselves.",
      "author": "Stylar777",
      "created": 1634510205,
      "upvotes": 14,
      "replies": {
        "hh1jd9n": {
          "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1jd9n/",
          "text": "While your post answers OPs topic, OP did touch on another thing. Why is looking something up on the Internet frowned upon pretty much universally, when I can forget about it later on and look it up, to nobody's detriment?\n\nEdit: Obviously, this is a GENERAL rule. Exceptions may apply. For example, I would expect a surgeon performing an emergency surgery to not have to spend precious time looking up how to perform the surgery.",
          "author": "Comprehensive-Ad3963",
          "created": 1634511273,
          "upvotes": 3,
          "replies": {
            "hh1t7nv": {
              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1t7nv/",
              "text": "Because you really can’t do that unless you have some basic skills.  Identifying reputable sources, sorting the wheat from the chaff, recognizing impossible scenarios based on first principles.\n\nIf you have to choose between 2 lines and one is where the cashier had to look everything up before putting in limes by a pic and took some time to recognize limes vs lemons and one where they actually knew it, which would you pic.\n\nIf you need to quickly check a fact and know how to do it fine.\n\nBut when you copy essay answers and chegg stuff you neither know the details or the concepts.\n\nYou also lack the skills to be able to search effectively, to problem solve to write, and to read.\n\nI am using excel  right now.  I can refresh my memory if I cant remember something I dont’ do often, but if i have to google every operation, I would never finish. If I also have to google how to do PEMDAS, i would not only never finish, I wouldnt’ get it right.\n\nAs many of you lot have not really had jobs before , you grossly over estimate how much you can google.",
              "author": "PersephoneIsNotHome",
              "created": 1634516027,
              "upvotes": 10,
              "replies": {
                "hh24a52": {
                  "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh24a52/",
                  "text": "\"If you have to choose between 2 lines and one is where the cashier had to look everything up before putting in limes by a pic and took some time to recognize limes vs lemons and one where they actually knew it, which would you pic.\"\n\nBad analogy. Memorizing the code for limes is easy. Remembering what you learned in college, post-graduation, is harder. Especially information that was taught in an unrelated general education credit. \n\nMy point is - if there is information I can afford to look up, why not allow me to do it?",
                  "author": "Comprehensive-Ad3963",
                  "created": 1634521542,
                  "upvotes": 1,
                  "replies": {
                    "hh39p8f": {
                      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh39p8f/",
                      "text": "That is interesting , because I went to college quite a while ago and I still remember quite a lot from HS and college.  \n\nPersonally,  dont think random rote memorization is helpful, but neither is that really what most of college is asking you to do.\n\nAnd memorizing the code for limes and all the other produce is not that easy.\n\nWhat classes are you taking that you think you should be able to look stuff up?",
                      "author": "PersephoneIsNotHome",
                      "created": 1634550324,
                      "upvotes": 1,
                      "replies": {
                        "hh40vuy": {
                          "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh40vuy/",
                          "text": "Your profile indicates you are a professor, so I'm guessing this means you have a doctorate in some field. That means you've probably had the knowledge you gained in university reinforced plenty of times. That's how brains work - the more you use information, the more you retain it.\n\nI already have my BS degree, so I may not have much skin in the game, but I can point to a few classes:\n\n1. Pretty much all general education\n2. Data Structures & Algorithms. Basically, how to represent things in computer memory, and a few algorithms you can use to do stuff with them. I'm 99% sure I've long since forgotten some of what was taught there (although I was once asked about Big-O notation in a job interview. I am told, however, that much of what they do in a coding interview has no relation to the actual job.)",
                          "author": "Comprehensive-Ad3963",
                          "created": 1634567116,
                          "upvotes": 1,
                          "replies": {
                            "hh494pd": {
                              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh494pd/",
                              "text": "I do stuff related to my field multiple times.\n\nNot so , say , history, linguistics and the many other classes I had to take.\n\nPretty much ALL gen ed I use ALL the time.  Though again not in a specific way.  I don’t have to write a persuasive paper detailing the pros and cons of speed bumps, specifically.  But figuring out how to organize such things, how to do the research, what is a logical train of thought , how to write well , or at least better is of use everyhwere all the time.  My family are blue color and still have to produce bids for construction jobs an such like.  Knowing how to use the word processing programs and spreadsheets now is a life saver.\n\nI sometimes test applicants on a specific task that they are not going to do daily in the job becasue they dont’ know enough for me to test them on the job thing, I am not testing them  on if you know X but 1) how do you deal with this problem and what are the steps you take to resolves it and 2) this was something you said you could do on your CV.  How much can you actually do the thing you claim to do. And other such things.\n\nIf you neither remember nor use anything , it is 99% of the time because you did assignments like you just had to level up and collect mana and not to actually learn the goals of the assignment.\n\nThere is little evidence that concepts are ever truly forgotten.  Maybe I don’t remember exactly if I do exponents or square roots int he PEMDAS thing, which I could look up, but I dont’ forget that an order of operations exists.  You only “forget” concepts you never truly learned.\n\nDetails you remember more with use.\n\nI didn’t always have a doctorate.  Once I had a BS and was a bartender.  I still needed pi to make a hat and sew.",
                              "author": "PersephoneIsNotHome",
                              "created": 1634570706,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            },
            "hh1ktae": {
              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1ktae/",
              "text": "In some disciplines people's lives hang in the balance and it is critical that some content be automatic. We want surgeons not to be googling how to do our surgeries. It makes sense that you study that content until you know it in your bones so to speak. \n\nIn some cases, it's teaching philosophy. Some teachers believe the best way to hold students accountable for learning is to test them without access to resources. In other cases, teachers use active or problem posing learning because they see learning as happening other ways. Freire found that when students crammed for tests that they forgot the material soon after the test. I know that to be true for my own learning. So some teachers might let students use resources because they view the test as another learning opportunity.\n\nI can't speak for all teaching philosophies but this is my take on that question.",
              "author": "Stylar777",
              "created": 1634511966,
              "upvotes": 6,
              "replies": {
                "hh24lfr": {
                  "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh24lfr/",
                  "text": ">some disciplines\n\nCorrect. SOME. Not all.\n\nArguably, open-book/open-note exams should be more mainstream. Project out 5-10 years, see what students can afford to forget, and let them look that up on the Internet.",
                  "author": "Comprehensive-Ad3963",
                  "created": 1634521703,
                  "upvotes": 1,
                  "replies": {
                    "hh416m5": {
                      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh416m5/",
                      "text": "I actually do open book tests an have done for 20+ years.\n\nIt doesn’t matter.  And it doesnt help.\n\nIt only helps people who have really learned the material well and have actively made good notes.\n\nAnd those people do just fine on the tests without the open book or notes, although it is a bit more onerous for them to do that.",
                      "author": "PersephoneIsNotHome",
                      "created": 1634567251,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "hh2jvva": {
              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh2jvva/",
              "text": "How do you know what your looking at on the internet is correct?  So the detriment could be by life if a nurse or a doctor.",
              "author": "SlightScholar1",
              "created": 1634529769,
              "upvotes": 1,
              "replies": {
                "hh2oth5": {
                  "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh2oth5/",
                  "text": "See my edit.",
                  "author": "Comprehensive-Ad3963",
                  "created": 1634532863,
                  "upvotes": 1,
                  "replies": {
                    "hh42hcs": {
                      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh42hcs/",
                      "text": "People also say nurse or doctor or engineer, but you can see examples of people who cant google things and how that affects your life all the time. \n\nCan the vaccines really change your DNA ?  If you google it you will be innduated with as much false info as correct info.  If you said, “I  dont’ know why I have to learn the steps of cell division and protein synthesis, I am never going to need to know this and i can just look it up” then the fevered disinformation could really sound plausible and scary to you.  \n\nIf on the other hand you did really understand 7th grade bio, you would know that is a load of crap.\n\nThis works with data literacy and social studies and history- i have election literature that is “Do. You know there are criminals that have been released from prison living in our neighborhood “.  Yes, I live in a major city. If you dont’ kill all criminals and you dont give then all life sentences, then some of then live in my city.  “Do you know how much crime increases because of that”. Yes 0% because thos criminals have legs and dont just break into cars in front of their house.  Historically that has never been a thing related to crime rate.  Historically it HAS be used to whip up fear and hatred.  I can look up the exact numbers but only if I know the other things.\n\nYou should know both stuff and how to think about that stuff for your life.  Your decisions in the gym, the food you eat, who you vote for.\n\nAnd you should be able to transfer that training to a specific job.  For which you also need to know stuff in order to google it.\n\nA huge reason my students dont get effective answers when they google stuff is that they dont know enough to have a useful search",
                      "author": "PersephoneIsNotHome",
                      "created": 1634567830,
                      "upvotes": 2,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hh1u08f": {
      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1u08f/",
      "text": "IIRC it’s because colleges need to make sure their graduates are qualified, in order to protect their reputation and the reputation of degrees in general.\n\nIf college X doesn’t prevent cheaters and slackers from graduating, those students will cut corners and slack in their actual jobs. Then their employers will be skeptical of *any* degree from college X, so they’ll stop hiring students from college X. Or they might become skeptical of any CS degree in general and add leetcode/offshore interviews (which are ironically also bad indicators).\n\nIt works the other way too: if a college has a really rigorous curriculum, it will get a better reputation and graduates will get jobs easier. See MIT and Harvard.\n\n*That being said*, I agree there are things professors to do deter cheating (e.g. lockdown browser, not letting you view past questions) which are counter-productive. More importantly, professors who give hard work for the sake of hard work (busy work) are doing it wrong. Not only do obnoxious cheating-prevention and busy work hurt well-qualified students, they actually *inhibit* students from learning important material, since the students are spending all of their time cramming industry-useless knowledge and working on 100 variations of the same problem. This type of teaching produces degrees which are meaningless to employers *and* hard to achieve at the same time.",
      "author": "armchairwarrior13579",
      "created": 1634516421,
      "upvotes": 5,
      "replies": {}
    },
    "hh1g94w": {
      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1g94w/",
      "text": "I think there is a disconnect with many individuals on what higher education is, and I don't blame them because the narrative/media is usually wrong. \n\nCollege has been billed as essential to 'getting ahead' in life when that simply isn't the only way. As such many student are under the perception they go to college to gain direct job/career skills when that isn't the case and I think needs to be emphasized. College originally was meant as a way to expand your knowledge and gain some mastery on some topics, but has since expanded to providing some direct knowledge on workplace procedure.\n\nI think this is why AA has been such a big deal because it measures the value of an individual's ideas which are suppose to expand in a higher education intuition and also carries the rigor of the university (which basically says the reputation of a university.)\n\nI think it's not a college job to teach you direct skills, rather if you want that trade schools, certification programs, or targeted education is best suited for those individuals. But that does also does say why employers prefer people with BA/BS in some fields.",
      "author": "safespace999",
      "created": 1634509820,
      "upvotes": 1,
      "replies": {
        "hh1wyi9": {
          "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1wyi9/",
          "text": "It college doesnt train you to for example , specifically make change or rectify your checking account.  It does give you the basic math skills to do that.\n\nI knit and crochet and sew.  If I want to follow a pattern exactly with the exact fabric, I can do that. But if I want my size, I need to do math.  If I want to be able to ever do another pattern, I need to be able to transfer my skills.  Ditto for anything you do around the house .",
          "author": "PersephoneIsNotHome",
          "created": 1634517894,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "hh2jn30": {
      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh2jn30/",
      "text": "So if college is about learning when do you students learn about integrity?\n\nStudents who cheat have no integrity, academic or otherwise,  in my view.\n\nWhen should students learn consequences for the lack of integrity?\n\nIf I am following your reasoning then there should be no consequences.  As a member of society you are fine for business to cheat you?",
      "author": "SlightScholar1",
      "created": 1634529637,
      "upvotes": 1,
      "replies": {
        "hh2ks27": {
          "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh2ks27/",
          "text": "I’m not saying people should cheat, nor am I advocating for a free for all in the world where integrity can go die in a hole.\n\nBut myself and other students aren’t paying $60k+ for an expensive lesson on integrity. We’re paying to receive an education.\n\nFor the amount of filler classes to make us “well rounded” I’m not surprised people cut corners to get through it. My point simply boils down to the idea that I suspect the current concept of Academic Integrity largely is designed to favor the college rather than the student. I don’t think it does any favors to help students learn.\n\nThis doesn’t extend to things like plagiarism, but is focused on things like needing to remember the formulas and processes for moderately obscure concepts. Does a student benefit more from temporarily becoming an encyclopedia of information before they empty out the shelves for the next semester?\n\nI’m not trying to say students should any less responsible for their education or integrity, I’m simply asking how the current system supports *them*",
          "author": "Casual-Economist",
          "created": 1634530285,
          "upvotes": 1,
          "replies": {
            "hh2ls09": {
              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh2ls09/",
              "text": "My students can bring in handwritten notes for exams.\n\nMy students will need to advise clients and pass professional qualification exams, and will be paid well for doing so.  My students tell me they can hear my explanation of many items when starting out in their careers.\n\nI do hold my students to high academic integrity standards,  and the majority rise to the high academic rigor requirements and meet the integrity standards.\n\nAs someone else commented students who cheat take up far too much of my time with meeting them, counseling them and then writing the reports for the academic integrity office.  I do all of this because I think it is important for the the majority of students who do the right thing.\n\nI personally do not believe cheaters should prosper, perhaps I am old fashioned.   Then again,I do not think paying money means you just get a piece of paper - students need to learn and master the material.  The piece of paper means that they have done so.  Want to just pay to get a piece of paper?   Do not attend a college that is accredited - the piece of paper means the student had to do more than just pay some money.  Students who receive their degrees from an accredited college had rigor and academic integrity requirements.",
              "author": "SlightScholar1",
              "created": 1634530897,
              "upvotes": 1,
              "replies": {}
            },
            "hh4b7vs": {
              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh4b7vs/",
              "text": "Ah, so cheating when it is beneficial to you or would be expedient is ok?",
              "author": "PersephoneIsNotHome",
              "created": 1634571593,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hh4n7zu": {
      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh4n7zu/",
      "text": "Its so you’ll know wtf you’re doing when the computers go down.\n\nAlso, anyone can google something, but someone had to put it there in the first place.",
      "author": "groovychick",
      "created": 1634576551,
      "upvotes": 1,
      "replies": {}
    },
    "hh1g5y6": {
      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1g5y6/",
      "text": "[deleted]",
      "author": null,
      "created": 1634509778,
      "upvotes": -2,
      "replies": {
        "hh1hh45": {
          "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1hh45/",
          "text": "They end up on Quizlet when students post exams there. They end up on Quizlet when folks leak the test banks. They end up on Quizlet from study guides.",
          "author": "Stylar777",
          "created": 1634510392,
          "upvotes": 3,
          "replies": {
            "hh1m8is": {
              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1m8is/",
              "text": "They end up on Quizlet, because the exams (you can find on quizlet) are written by the book publishers, so pretty much everyone everywhere that’s using the same book, has the same exams.",
              "author": "Debourbc",
              "created": 1634512656,
              "upvotes": 1,
              "replies": {
                "hh1tgh6": {
                  "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1tgh6/",
                  "text": "I make my own exam and assignment questions.  If I dont proctor the tests scrupulously, they are on chegg and quizlet .before the test is even finished.\n\nWhere do you think the freaking quizlet questions come from?",
                  "author": "PersephoneIsNotHome",
                  "created": 1634516150,
                  "upvotes": 3,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hh1rf55": {
      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1rf55/",
      "text": "As a student, I never had an issue with other students cheating. The way I look at it, it’s part of the game. If you want to take the risks, go right ahead. For some of them, it’ll pay off, others will get expelled from school. It’s not a risk I choose to take but I don’t see it as being unfair. The risk of punishment makes it fair.",
      "author": "Vokid-19",
      "created": 1634515144,
      "upvotes": -1,
      "replies": {
        "hh1xalh": {
          "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1xalh/",
          "text": "So you dont mind losing a scholarships or job to someone with ostensibly a better record than you who cheated their ass off to get there?\n\nI also mind very much when I am in the ER and my nurse doses me wrong because they can’t do the math.\n\nI mind when people wont get vaccinated or wear a mask because the lack enough basic bio and data literacy to recognize immense bs when the see it.",
          "author": "PersephoneIsNotHome",
          "created": 1634518058,
          "upvotes": 9,
          "replies": {
            "hh1xm56": {
              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1xm56/",
              "text": "I don’t mind because they took the risks and it paid off. For every person who cheated and succeeded, there is a person who cheated and got thrown out of college. If cheaters are willing to assume that risk for success, I don’t mind. I think it’s a poor decision because of how grave the risks are, but if they want to do it, I’m cool with it.",
              "author": "Vokid-19",
              "created": 1634518216,
              "upvotes": -1,
              "replies": {
                "hh1ye39": {
                  "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1ye39/",
                  "text": "Wait till your real estate lawyer messes up your closing or your accountant screws up your taxes and you get audited. Or your mechanic fucks up your car.  \n\nCome to think of it, I could totally teach a class I am not really prepared to teach and if I am willing to assume the risk, it shouldn’t matter that it sucks if I do a bad job for the student in the class.  I could use the extra dosh this summer.  I might try that.  good Idea\n\nRemind me in 3 years!",
                  "author": "PersephoneIsNotHome",
                  "created": 1634518603,
                  "upvotes": 6,
                  "replies": {
                    "hh1yh1w": {
                      "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh1yh1w/",
                      "text": "You’re pressed lmao",
                      "author": "Vokid-19",
                      "created": 1634518644,
                      "upvotes": 0,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        },
        "hh4pp48": {
          "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh4pp48/",
          "text": "Until you’re working on a group project where none of your teammates know how to do anything because they’ve been cheating and you have to spend all your time explaining stuff to them, get a bad grade, or just do it all yourself.",
          "author": "groovychick",
          "created": 1634577575,
          "upvotes": 0,
          "replies": {
            "hh507rv": {
              "link": "/r/college/comments/qa91zm/a_discussion_about_academic_integrity/hh507rv/",
              "text": "This is more the problem of group projects than cheating. Group projects are stupid regardless of the students in them.",
              "author": "Vokid-19",
              "created": 1634581899,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}