{
  "sid": "rgji3e",
  "link": "/r/college/comments/rgji3e/a_question_to_all_the_people_with_38_gpas/",
  "title:": "A question to all the people with 3.8+ GPAs...",
  "text": "HOW?!?!?! \n\nI'm aware that you don't have to get perfect scores across the board, but how is there not 1 class where you, for lack of a better term, shit the bed at least a little?? I've never gotten above a 65 on an essay, yet you haven't bombed 1?? I think it's a bunch of horseshit...",
  "author": "Welcome2R3HAB",
  "created": 1639522048,
  "updated": 1639787991,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.38,
  "comments": {
    "hokosn8": {
      "link": "/r/college/comments/rgji3e/a_question_to_all_the_people_with_38_gpas/hokosn8/",
      "text": "I think it depends on the major you’re in. In what I’m pursuing now, I have a 4.0 and I will mention writing and reading are my biggest strengths. Now put me in a science class, and even if I enjoy it- I will bomb that shit instantly lol. I chose a major where I avoid science. My brain literally can’t comprehend it.",
      "author": "Hot_tamami",
      "created": 1639523786,
      "upvotes": 4,
      "replies": {}
    },
    "hokl399": {
      "link": "/r/college/comments/rgji3e/a_question_to_all_the_people_with_38_gpas/hokl399/",
      "text": "Have no life 😔.",
      "author": "dotuanhiep",
      "created": 1639522176,
      "upvotes": 0,
      "replies": {
        "hokmhi4": {
          "link": "/r/college/comments/rgji3e/a_question_to_all_the_people_with_38_gpas/hokmhi4/",
          "text": "I disagree with this tbh. I took a four year hiatus before after highschool and  in that time period I really invested in knowing more about myself and developing better studying techniques and systems that guided me to success even if I lacked the motivation. My efforts paid off and I have been able to achieve 4.0 in my first 2 years of college despite still heavily having a social life. But in all, I focused my efforts on working/studying  smarter and more efficiently and using techniques to retain information and increase my greater area of understanding. It is possible to excel in school and have a social life but it doing so requires an overhaul in ones typical/ traditional approach to school and studying. I recommend the book Atomic Habits! and looking at spaced repetition and active recall",
          "author": "ChillWatcher98",
          "created": 1639522775,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hokmh7v": {
      "link": "/r/college/comments/rgji3e/a_question_to_all_the_people_with_38_gpas/hokmh7v/",
      "text": "r/CollegeRant",
      "author": "cajunsoul",
      "created": 1639522772,
      "upvotes": 1,
      "replies": {}
    },
    "hom91cg": {
      "link": "/r/college/comments/rgji3e/a_question_to_all_the_people_with_38_gpas/hom91cg/",
      "text": "You learn how to write a good essay and spend time on it to turn in good work",
      "author": "wafflepancake5",
      "created": 1639552066,
      "upvotes": 1,
      "replies": {}
    }
  }
}