{
  "sid": "r7crlw",
  "link": "/r/college/comments/r7crlw/how_does_college_work/",
  "title:": "how does college work?",
  "text": "for context: i've been homeschooled since 4th grade so i'm totally clueless \n\ni have no idea what to do like i just find the classroom, walk right in and sit wherever i want? do we socialize or should i just be quiet? is there attendance? should i bring paper for notes or a laptop?",
  "author": "woofkoo",
  "created": 1638466855,
  "updated": 1638479897,
  "over_18": false,
  "upvotes": 4,
  "upvote_ratio": 1.0,
  "comments": {
    "hmyi9ye": {
      "link": "/r/college/comments/r7crlw/how_does_college_work/hmyi9ye/",
      "text": "- Depends on the teacher, but most if not all teachers won't have any assigned seating so you can sit wherever you want. Most people pick a seat and stay there for the entire quarter or semester though, just to make things less confusing. Also there are some shithead professors who are like \"I'm locking the door after I walk in,\" so you gotta be wary of that.\n\n- In most classes I've been in it's fine to socialize before it starts. If you get there 5 minutes before class and there's nothing to do its perfectly fine to talk to your friend nearby.\n\n- It depends again, if a teacher relies heavily on labs or lectures (in person), then yeah there probably is. If the teacher doesn't rely on that stuff and instead relies on essays or quizzes then you probably dont *need* to show up to every class, but you really should.\n\n- I bring both in case I'm an idiot and forget to charge my laptop the day prior (which is usually the case). A laptop is probably better in general as long as you can type fast enough to keep up with a lecture. Trust me, professors will try to drag out some slides with lots of words on them, but they wont slow down or stop for notes or anything like that.",
      "author": "bermuda__",
      "created": 1638467641,
      "upvotes": 4,
      "replies": {
        "hmyxbir": {
          "link": "/r/college/comments/r7crlw/how_does_college_work/hmyxbir/",
          "text": "thank you so much <3",
          "author": "woofkoo",
          "created": 1638473429,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmyn642": {
      "link": "/r/college/comments/r7crlw/how_does_college_work/hmyn642/",
      "text": "A lot of how college works depends on your major. If you are majoring in anything STEM related, then feel free to pm me and I can answer some of your questions :)",
      "author": "physics_masochist",
      "created": 1638469526,
      "upvotes": 2,
      "replies": {
        "hmyruky": {
          "link": "/r/college/comments/r7crlw/how_does_college_work/hmyruky/",
          "text": "Totally unrelated comment: Username checks out",
          "author": "leozianliu",
          "created": 1638471324,
          "upvotes": 2,
          "replies": {}
        },
        "hmyne76": {
          "link": "/r/college/comments/r7crlw/how_does_college_work/hmyne76/",
          "text": "i'm just doing gen ed right now, english comp and sociology",
          "author": "woofkoo",
          "created": 1638469612,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmz8cxn": {
      "link": "/r/college/comments/r7crlw/how_does_college_work/hmz8cxn/",
      "text": "hello ! i’m in my first year of college \ni already had a laptop but i like writing my notes so i bought a 5star notebook from walmart or target \n-Bring pencils or pens \nOn my first day I found my classes and sat down , my professors had us introduce ourselves, what year were in and our major \n-possibly could need binders or folders \nAgenda ! love them \n\nbut bring a lunch unless you would like to buy the university’s lunch , headphones , body care stuff",
      "author": "NoAwareness5126",
      "created": 1638477704,
      "upvotes": 1,
      "replies": {}
    }
  }
}