{
  "sid": "qznxxm",
  "link": "/r/college/comments/qznxxm/how_realistic_are_the_fafsa_expected_family/",
  "title:": "How realistic are the FAFSA expected family contributions?",
  "text": "Like would that amount be a poor financial decision? Asking for a friend who’s parents don’t want to pay half as much",
  "author": "Lojackr",
  "created": 1637594902,
  "updated": 1637689063,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hlnh2f2": {
      "link": "/r/college/comments/qznxxm/how_realistic_are_the_fafsa_expected_family/hlnh2f2/",
      "text": "They are just estimates of what your parents would be ABLE to pay.  Not what they actually will pay.",
      "author": "GenXtreme1976",
      "created": 1637597248,
      "upvotes": 7,
      "replies": {}
    },
    "hlnd2ry": {
      "link": "/r/college/comments/qznxxm/how_realistic_are_the_fafsa_expected_family/hlnd2ry/",
      "text": "I don't even get the point of the EFC. In my experience, they’re very inaccurate. \n\nThey’re just estimates of what your parents would be able to pay according to their income and assets. But they don’t take into account that fact parents will already have a fixed amount they are willing to contribute. Or that most won't provide any money towards college at all.",
      "author": "kizeltine",
      "created": 1637595597,
      "upvotes": 3,
      "replies": {}
    },
    "hlpfvey": {
      "link": "/r/college/comments/qznxxm/how_realistic_are_the_fafsa_expected_family/hlpfvey/",
      "text": "EFC is really just going to gain you access to or disqualify you from need based aid, that’s all the number is used for.",
      "author": "Concerned-23",
      "created": 1637626472,
      "upvotes": 1,
      "replies": {}
    },
    "hlpob0y": {
      "link": "/r/college/comments/qznxxm/how_realistic_are_the_fafsa_expected_family/hlpob0y/",
      "text": "EFC is pretty much just what FAFSA says is leftover after they decide how much Grant money you deserve. It honestly feels pretty arbitrary. \nMy husband and I made together about 40K (not sure what that was after taxes) together in 2020, also the year we got married. We're both student this 2021-22 school year and fafsa gave me (part time) $350/semester and him (full time) $0. That left our EFC at 22k/year for EACH of us. We are our family. Tell me how that makes sense. We make less than fafsa thinks we should he able to contribute. \nIt's stupid.",
      "author": "HRMqueenofeverything",
      "created": 1637630482,
      "upvotes": 1,
      "replies": {}
    },
    "hlpokng": {
      "link": "/r/college/comments/qznxxm/how_realistic_are_the_fafsa_expected_family/hlpokng/",
      "text": "The EFC is usually a high estimate, meaning if the student is clever about choosing housing, buying used textbooks, and food/transportation costs, they can likely go to school and it will cost the family less than the EFC.",
      "author": "HRMqueenofeverything",
      "created": 1637630608,
      "upvotes": 1,
      "replies": {}
    }
  }
}