{
  "sid": "qgcpq4",
  "link": "/r/college/comments/qgcpq4/am_i_the_bad_guy_here/",
  "title:": "Am i the bad guy here?",
  "text": "i just need to talk to somebody about this. So i had this project where i had to work with someone else. he was a last minute guy which resulted in him not being able to finish everything and what he did do was pretty low quality. For events in the past i did not say this to him nor to the teacher till now (when the project needed to be done). this was my big mistake, because i thought he'd already realised this about the way i talked to him (very serious). he didn't realise this till today. i was pretty harsh not gonna lie, but i apologized to him for this behaviour even if i didn't have to. he still blames this on me although he gave me a lot of stress due to the way he handled things. i think i'm in the right her, but i still feel bad for him, even after apologizing multiple times and coming with a solution to fix things i said about him to him and the teacher (no swearing or some stuff, just being very direct). am i the bad guy here?",
  "author": "jelkoe",
  "created": 1635272632,
  "updated": 1636184361,
  "over_18": false,
  "upvotes": 5,
  "upvote_ratio": 1.0,
  "comments": {
    "hi59qyu": {
      "link": "/r/college/comments/qgcpq4/am_i_the_bad_guy_here/hi59qyu/",
      "text": "That was a lot of words to say very little. If you feel like you did more than your share or that he doesn't deserve to get credit for the work, you should bring that up with a professor or TA. This description is too vague to judge anything really.",
      "author": "SmokeyBeaar",
      "created": 1635272988,
      "upvotes": 17,
      "replies": {
        "hi5dnhe": {
          "link": "/r/college/comments/qgcpq4/am_i_the_bad_guy_here/hi5dnhe/",
          "text": "Yeah it's really long to tell the full story. I adressed this to him and the teacher, but their reactions were that i should've said this earlier although i should not have to say this, cuz we're in college. You should know how to work in my opinion",
          "author": "jelkoe",
          "created": 1635274521,
          "upvotes": -2,
          "replies": {}
        }
      }
    },
    "hi5doji": {
      "link": "/r/college/comments/qgcpq4/am_i_the_bad_guy_here/hi5doji/",
      "text": "You got mad; you apologized.  If your project partner failed to hold up his end of the assignment, it's not your fault.\n\nJust let it go and stop overthinking it.",
      "author": "DeskRider",
      "created": 1635274533,
      "upvotes": 2,
      "replies": {
        "hi5dxmj": {
          "link": "/r/college/comments/qgcpq4/am_i_the_bad_guy_here/hi5dxmj/",
          "text": "Thank you for saying this. Atleast i recognized my mistakes. It's really hard to stop overthinking (for me atleast). It's gonna take some time but i atleast wanted answers from other people",
          "author": "jelkoe",
          "created": 1635274631,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "hi6kydk": {
      "link": "/r/college/comments/qgcpq4/am_i_the_bad_guy_here/hi6kydk/",
      "text": "Not the bad guy. You communicated multiple times and did your work. That's really what it boils down to and honestly the silver lining is this is a good practice run, especially someday if you work in an office environment. Everything is teamwork. You did what good teamplayers are supposed to do.",
      "author": "Fiery_Tigress",
      "created": 1635292342,
      "upvotes": 1,
      "replies": {
        "hi7nqxj": {
          "link": "/r/college/comments/qgcpq4/am_i_the_bad_guy_here/hi7nqxj/",
          "text": "Thanks, he defended himself and even attacked me a little bit about the things that i didn't do perfect, and somehow i even felt bad for him",
          "author": "jelkoe",
          "created": 1635311457,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}