{
  "sid": "r7g1wn",
  "link": "/r/college/comments/r7g1wn/classmates_cheated_got_caught_think_i_sold_them/",
  "title:": "Classmates cheated, got caught, think i sold them out but i didnt do anything. Anything i can do?",
  "text": "A few weeks ago we had an exam. Due to a few people being sick the teacher allowed us to take the exam online or on campus. The choice was on us.\n\nSome of us took the exam on campus, i was one of them, but most took the exam online. Most of the people who took the exam online cheated. 6 of them cheated by working together in a facebook groupchat with 40 people in it.\n\nWe have a class of 25 so there were people in there that didnt either quit or were in a different year...\n\nNow someone sent screenshots of the chat to the teacher. We dont know who did it. I admit that i thought about is but a friend of mine was one of the people cheating and didnt want to sell him out. Also i would gain nothing except a target on my back. \n\nThey all were investigated and some of them got pretty low punishments, others got none. \n\nWe still dont know who sent the screenshots to the teacher but some people suspected me. They started spreading this and most of the class hates me now even tho i didnt do anything.\n\nI contacted a teacher but they cant do anything to show that i didnt do it. The only thing they can do is release the identity of the person who did but they arent allowed to do that. \n\nSo essentially i still have to study at that school for one and a half years with a bunch of people that hate me for something i didnt do. \n\nAny advice? It's the first time in my life that everything was going sort of well with my classmates and now this. I don't know what to do.",
  "author": "Assassin496",
  "created": 1638475694,
  "updated": 1638479902,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "hmz3s0h": {
      "link": "/r/college/comments/r7g1wn/classmates_cheated_got_caught_think_i_sold_them/hmz3s0h/",
      "text": "tbh I don’t think there’s anything you can do, but it’s shitty that your classmates are turning on you and that the person who actually told the prof won’t step up and admit. \n\nIf you’re gonna do something do it with your chest. I have no respect for people that can’t stand behind their actions.",
      "author": "rynpickles",
      "created": 1638475969,
      "upvotes": 1,
      "replies": {}
    },
    "hmz579z": {
      "link": "/r/college/comments/r7g1wn/classmates_cheated_got_caught_think_i_sold_them/hmz579z/",
      "text": "Speaking from experience this will all blow over in a month. Just maintain that you didn’t do it when pressed and continue to be nice to everyone, don’t start anything obviously. They are lucky that the punishments weren’t worse, they should be grateful. They’ll learn to not cheat in huge group chats anymore, because that’s a dumb thing to do in general. It’ll be okay.",
      "author": "ilikecacti2",
      "created": 1638476516,
      "upvotes": 1,
      "replies": {
        "hmz5jy5": {
          "link": "/r/college/comments/r7g1wn/classmates_cheated_got_caught_think_i_sold_them/hmz5jy5/",
          "text": "I do hope it blows over but i dont know if it will. \nI didnt tho it, my friends know this but the ones spreading the rumours dont or dont want to know.",
          "author": "Assassin496",
          "created": 1638476651,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}