{
  "sid": "pwjbso",
  "link": "/r/college/comments/pwjbso/i_am_miserable_at_my_school_is_this_normal/",
  "title:": "I am miserable at my school- is this normal?",
  "text": "I am a transfer student who transferred this fall from a community college to a four year university. Two of my brothers and my boyfriend actually went to this school, and they loved it. When I would visit my boyfriend there, I absolutely loved it. (Note that he has graduated this June so I did not go to this school specifically to be with him). I fell in love with the area and the school has great academics and the weather is perfect. I was ecstatic when I got my acceptance letter. \n\nHowever, the moment I moved in I was filled with regret. The housing situation at my school is horrible to begin with. The covid restrictions are insane but I do not want that to be debated or become political. There are hardly any in person events and none that pertain to my interests. Most of the classes-about 75% I would say- are being moved to remote which was announced the day before I moved in. They will not move fully remote but are moving to going virtual again to take more money from the students. My professor literally said “yea the school knows things are getting worse so they are getting ready for more virtual classes and restrictions”- just send us home!! \n\nThe people here are friendly but not easy to be friends with. The school lacks school spirit and everyone is so study oriented that most people keep to themselves. I am very studious myself but this is another level. \n\nI looked into clubs and will begin to sorority rush this week. I also have a counseling appointment. I am giving this all I have. I don’t sit in my room or do nothing all day. I actively make efforts to get acclimated and put myself out there. My parents want me to give it a try for the first quarter and then go from there which is what I’m doing. I just feel so isolated and miserable here. It isn’t the typical first week discomfort that is expected- it’s a gut feeling. I feel so much pressure from my boyfriend because he wants me to love it just like he did…I want that too but idk…I feel hopeless and I’ve never been so depressed and I’ve never cried this much.  \nHas anyone felt this way? \n\ntldr: I am miserable at my school for too many reasons to count. :( I’m so disappointed because it isn’t what I was hoping for.  Advice or encouragement is appreciated.",
  "author": "Beachyvibes26",
  "created": 1632756023,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hehx7bw": {
      "link": "/r/college/comments/pwjbso/i_am_miserable_at_my_school_is_this_normal/hehx7bw/",
      "text": "things will get better! i know it might be hard because of covid and your boyfriend experienced the college pre-covid so your experiences might've been entirely different, but give it time, walk around and appreciate nature especially if you love the weather there. even the smallest things can bring you joy. i know it's isolating and it can feel very terrible, but you've got this and things \\*will\\* get better. try to take things one step at a time and don't pressure and force yourself to enjoy things even when they aren't. i hope you'll do well soon because good things always come unexpected! i hope my few words as a stranger on the internet help you <3 it's not much but just know that everything will get better. i promise ! i was at that point too during covid but it did get better and i found new hobbies to keep myself preoccupied and happy. :)",
      "author": "rayarayaaa9989",
      "created": 1632765715,
      "upvotes": 1,
      "replies": {}
    },
    "hehe3nn": {
      "link": "/r/college/comments/pwjbso/i_am_miserable_at_my_school_is_this_normal/hehe3nn/",
      "text": "Give it time",
      "author": "Blainers001",
      "created": 1632757135,
      "upvotes": 1,
      "replies": {}
    }
  },
  "updated": 1634056625
}