{
  "sid": "r3rk6p",
  "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/",
  "title:": "Is there any reasonable justification for college general education classes?",
  "text": "This is something I don't get about American universities. \n\nThe general education classes seem so obviously and insufferably filler that it's kind of weird to me seeing some people justify it. The classes almost always are ones you took in grade school and aren't any more challenging, and you're essentially paying for information you either already learned and/or don't even need for your major.\n\nWhen seeing discussions about general education classes, I normally see something always along the lines of 'gives you time to figure out your major'/'make you a more well-rounded intelligent person' or some other drivel along those lines. \n\nWhile anyone can improve, taking a general education course in college isn't more prone to making you better at a subject if you did poorly in it in grade school/didn't care about it. The amount of college-educated adults I've talked to who have the worst writing, grasp of history/geography, maths capabilities, etc. compared to school-aged children is insane. People who aren't passionate about the subjects are going to try and just breeze through it for credits just like they did in grade school. They suddenly don't become motivated when in college nor are more likely to. And to the whole '...makes you a well-rounded intelligent adult' argument, the odds are your same attitude towards the same subject from grade school is going to carry over into college. If you weren't a 'well-rounded and intelligent' young adult by the time you graduate secondary school, odds are you likely aren't going to become one in college. The light switch doesn't suddenly go from off to on from secondary school to college. \n\nIf you need time to figure out your major, taking the same courses you took in grade school isn't necessarily the best way. If you are unsure of what you want to do, there are many other alternatives. I'd say getting a job/internship for a year or two is much more insightful (real-world job experience) than taking the same courses you took in secondary school except paying tens of thousands of dollars in them, indebting yourself for information in a subject you already have taken and that is more than likely not even relevant to your major, let alone largely teaching anything useful to use later in your adult life. \n\nIs this not the point of secondary school? To learn what you have to take for college general education classes? Make it one or the other; you take those classes only in secondary school or only in college. I see no point in basically taking the same class twice except as a cash grab.",
  "author": "adoreroda",
  "created": 1638060486,
  "updated": 1638206867,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.42,
  "comments": {
    "hmci275": {
      "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmci275/",
      "text": "I would say that it's because high schools don't teach it well enough. Part of a college outcome (even for STEM) majors is well written papers and presentations and a single technical writing course isn't going to cut it. Likewise, understanding at least college algebra is important for humanities majors so you can understand compound interest, loans, and optimization type concepts.\n\nBut the fact that I was able to skip half of them by passing AP tests, and then still get a 3.85 GPA in college means that high school COULD teach them. Schools just don't allow teachers to be that hard on students to actually challenge them and help them get a lot better.\n\nThought that just occurred to me: all students on a college track should be required to take AP courses, or some form of higher education. I don't want to burn out teenagers, but if you're going to spending tens of thousands of dollars on college, there should be better preparation instead of that being the path of least resistance and default goal that teachers push. What do you think?",
      "author": "Thelton26",
      "created": 1638063626,
      "upvotes": 11,
      "replies": {
        "hmdmw8q": {
          "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmdmw8q/",
          "text": "The schools that I went to at worst were ok ranging to pretty good so I never really expected the lot of American grade schools to be sub-mediocre. I took some honour/AP classes and I didn't think it was that difficult (not that it was easy).\n\nEven with that bubble sort of popped, it still kind of emphasises the question of why teach the same subjects in both grade school and university. If grade school teachers aren't in a position to push students academically to achieve college-level knowledge of those subjects (or to even just have a decent understanding of them) then those subjects honestly should just be reserved for college. \n\nI agree there should be better preparation, because it's absolutely ridiculous that to many people general education courses are filler classes and have no substance to their major.",
          "author": "adoreroda",
          "created": 1638086806,
          "upvotes": 1,
          "replies": {
            "hmdnkuu": {
              "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmdnkuu/",
              "text": "If you look at a lot of foreign countries it is much more that way. Japanese students basically have to test into high school the way we do for college. And in Europe, they tout \"free college\", but my wife had foreign exchange students and they said that only select students are put on the college track, it's not just that anybody can go to college who wants to.\n\nI also don't think it's always the teachers. I think just as often it's the administration saying \"we need these students to pass, dumb down the subject until enough kids pass\". Even in my AP courses, the \"harder\" ones like Chem we're like this. Out of 50 kids, only 12 of us actually took the test, and less than half passed. But since all those other kids were just doing it to boost their weighted GPA, the class was definitely not at it's full potential, even though the teacher was phenomenal and had been able to be more thorough and in depth when my siblings had him 8 years before me.",
              "author": "Thelton26",
              "created": 1638087348,
              "upvotes": 1,
              "replies": {
                "hmfy8ji": {
                  "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmfy8ji/",
                  "text": "I have some friends from Europe who have basically said the same thing as you. Probably works differently depending on the country but basically taking the test and the university only selects students (hundreds of them) who have a specific minmum score and more for that particular major. Sounds a bit brutal but at least it's not a one time thing from my understanding and you can try again. \n\nI didn't detail what I said but I don't think it's on teachers, I simply said teachers since they're kind of the ones who are the poster childs of education in a way. I understand teachers are kind of at whim of whatever the administration tells them to do, especially if said teachers have quotas they need to meet. I also recall sometimes it's for financial reasons for the school to meet such quotas, adding more pressure from their higher-ups. \n\nFunny enough, I recall a teacher of mine who taught both basic and AP sciences saying how students in AP classes are more likely to cheat on assignments than people who take basic classes. Makes sense if you think about it since they care more about their marks, although I suppose the general public may not suspect this and expects the general student population not taking AP classes to cheat more.",
                  "author": "adoreroda",
                  "created": 1638131414,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hmd17to": {
      "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmd17to/",
      "text": "I understand your complaint and I definitely felt that surprisingly few people put in effort into general education requirements, but I think they are important.\n\nFirst, some history might be needed. The general education requirements of American universities is basically the only thing left of the ideal of a liberal arts education. As American universities have become more business-like and emphasized that degrees lead to jobs, the liberal arts model (even in self-proclaimed liberal arts colleges) has been watered down into general education requirements.\n\nOkay, on to my main points. At least in my experience, other than basic English and Math classes, there are usually much greater options available in college than high school. Anthropology, archaeology, sociology, philosophy, classics, astronomy, public policy, economics, etc., just to name a few. Even in classes you had in high school: history, anatomy, etc., there are greater options. Few high schools have a History of Africa class. My college even had a Nuclear Weapons Policy class, how many high schools had that? There is a wider world which is never available in high school and general education allows you to experience it. I hated a basic financial class I had in high school, but taking a class on Macroeconomics opened whole new ways of seeing the world.\n\nIt is these connections between the disciplines which make general education requirements so valuable. Beyond learning Math and English, something we all should know, there are benefits everywhere. We should want our scientists to know something about philosophy to understand the limits of their own knowledge. Engineers should learn how their bridges can be architectural and artistic, not just technological, marvels. Public policy makers should know how science is conducted and why it is trustworthy. And those are just for majors which often lead to jobs. English majors can be better English majors by learning alternative ways to analyzing texts through economics class. Philosophy majors can be better philosophy majors by learning how the mind works in a psychology or neuroscience class. The list could go on. In all cases, being the best in something means going beyond the strict confines of your field.",
      "author": "DrAlawyn",
      "created": 1638073127,
      "upvotes": 4,
      "replies": {
        "hmdo4v6": {
          "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmdo4v6/",
          "text": "I understand what you're saying but the theory behind the concept that general education is meant to make a well-versed individual when they go out into society really has failed and isn't the most reflective, if at all, of today's society. Not that everyone or most people are dumb, but the notion that general education transforms you so drastically isn't really the case from my observation of being in college, interacting with other students, as well as with people who have varying degrees of college experience (bachelours, masters, beyond, etc.), and the latter with very good jobs and careers but yet are just as, if not more ignorant and the opposite of being intellectually well-versed than people who didn't go to college. I know shut-ins who are a lot closer to the type of person you describe is the end-goal product type of general education than people who actually went to college. And the thing is too, in the lot of cases I'd say even, it doesn't make a difference in terms of their work quality if they're well-versed. They just need to focus on their job and its mechanics almost all the time. Especially when you make the majority of general education subjects that people already studied and passed in grade school, it encourages discouragement from being motivated to learn about anything else when the whole concept of general education subsequently becomes seen as a disruption to what you went to college for: to study your major. Also as a waste of money (which it is)\n\nFor me personally at least, my grade school had a wide array of subjects, and many of the subjects you listed there was either something very similar if not that or something that was just as \"diverse\" or niche if you understand what I mean. General education wouldn't be the worst thing in the world to me if it emphasised other subjects that would broaden one's world view or overall knowledge, but it gets overshadowed by reiterating the basic subjects of maths/science/english/history, sometimes other subjects you took in grade school like psychology, sociology, and so on. You're paying tens of thousands of dollars to take something you passed in grade school and you're not learning anything new from it.",
          "author": "adoreroda",
          "created": 1638087786,
          "upvotes": 1,
          "replies": {
            "hmeodv3": {
              "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmeodv3/",
              "text": ">And the thing is too, in the lot of cases I'd say even, it doesn't make a difference in terms of their work quality if they're well-versed.\n\nFor some fields, e.g. STEM, maybe. Yet even there, major advantages, both in life and work, can be had. Yes, due to the idea that we must become hyper-specialized, for example, engineers are not often tasked with thinking about the art of a structure, while architects are not often tasked with thinking about the practical physics of a structure. But  but the world doesn't have to be that way and for many jobs, being knowledgeable in both would be a great advantage. Even beyond that, knowing all the complex causes of inflation would allow someone to be a better informed citizen who ultimately will vote.\n\nAlso, should college be seen purely as a necessary precursor to work? That's a fairly recent development in the history of higher education. \n\n>you're not learning anything new from it.\n\nI guess this is where my experience differs from yours, I felt as if mine were far deeper and had all sorts of niches unavailable in high school. Through a class on Nuclear Weapon Policy, I know the monetary costs of nuclear weapons, why all the nuclear weapons treaties (most of which the US and Russia have renounced) are quite important, the technological difficulties of the nuclear weapon life-cycle, and what combination of scientific-political-military pressure can instigate a nuclear weapons program. My high school didn't have a history of Africa class, but since I took one in college I understand the struggles of development, international capital flows, and structural constraints on countries more than anything I could have gathered in high school. In high school we never had a philosophy class, let alone one which discussed Marx, Foucault, and Zizek.\n\nCan people learn this without going to college? Yes, but professors are suppose to be like a walking, talking peer-reviewed Wikipedia who can produce original ideas in an instant. And at least at my college, I felt like most of the professors were exactly like that. That's often something that is difficult to replicate through self-teaching. Admittedly it isn't impossible, but I think, and again as in my experience, that there is often a substantial difference in knowledge between those who went to college and those who didn't. It is sad that is the case, but it does seem to be.",
              "author": "DrAlawyn",
              "created": 1638112465,
              "upvotes": 2,
              "replies": {}
            }
          }
        }
      }
    },
    "hme4sqi": {
      "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hme4sqi/",
      "text": "You're sorta right about some gen ed classes as \"fillers\" toward your actual degree. Yes. You have the option to pause college and pursue some kind of minimum wage job, or a vocational (which also requires taking classes for a certificate), or maybe getting internship opportunities (which you also find in college).\n\nBut not everyone wants to work a minimum wage job forever do they? Nor do they want to pursue a certificate for welding. And internships are mostly acquired by being involved in your college campus. Taking on a part-time job helps with work experience, sure. But it doesn't really broaden the scope of what career path you wanna take. Nobody works part-time at in-n-out and decide that they wanna be a burger flipper, or at starbucks and decide they wanna pursue barista-ing as a full fledged career.\n\nIn 2-year community colleges in california, there's a thing called the \"Golden 4\" which are gen ed classes that are crucial before you can transfer to university. This involves taking one class in each category of; oral communication, writing composition, critical thinking, and math/quantitative reasoning. Completing these classes not only makes you a \"well-rounded person,\" nor do they fulfill your credits, but they'll greatly help you in the major you eventually decide to pursue. Let it be STEM or Humanities, or Business. Everyone needs the skills to write properly, basic algebra, and speak clearly and confidently in front of an audience or a friend. \n\nAnd no. I don't believe that being a \"well-rounded person\" is determined after you graduate secondary school. People can be 22 years old and become well-rounded after getting their bachelors. And people can be 32 and become well-rounded after getting their associates in community college. Speaking of cc, you can take 12-16 units in community college for less than $500. Free even, if you qualify for fafsa. Cc's can't be cash grabs if their offering the same courses that universities have for cheap. That's right. You can complete the first two years of your bachelors for less than $3000 or free. \n\nThe reality is, high school is very different from college. Especially university, which is a whole other level. Trust me when I tell you that high school does not fully prepare you for, nor help you decide, what career you want to spend the next 60 years of your life for. And people that take ge classes would prefer knowing that they're working towards something, rather than spend the rest of their lives working for $14 an hour.",
      "author": "ecstatic-hatter",
      "created": 1638101114,
      "upvotes": 2,
      "replies": {
        "hmfx9rg": {
          "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmfx9rg/",
          "text": "My proposal of instead of repeating the same courses of maths/science/history/english (and largely to some extent other classes that for the most part are irrelevant to your major many times), getting some sort of real-world experience if you don't have a solid idea of what you want to do is better repeating the same courses which aren't going to be really inspiring. The idea is less about what you're doing per se and just going out in the world and trying out different stuff. The idea isn't to cross off your list that you don't want to be a burger flipper or barista but to look at the details of it. If you're not the type of person who copes well working around the clock or constantly having to do overtime, that is an indication of plenty of majors that lead to careers you may want to consider avoiding if you want to live a happier life. Being something like a bartender/barista, you may not like a job where you're very social or have to be very social (i.e. make connections in order to survive in it). I'm going to figure out this sort of stuff how when I'm taking the same classes I took in grade school except becoming a debt slave paying for them?\n\nI'm aware some states have programmes of sorts to make education more affordable which is nice. I don't live in California, but my state (or at least city) also basically has the same thing, but I believe this is not the norm in the slightest nationwide. Could be just me but when I took those general education classes it didn't make me any more well-rounded than when I took them in grade school, because it was practically the same information and I did well in those classes in grade school except in a position where I'd have to pay to learn information I already am aware of or have shown that I have competent abilities in to pass. There are others in my position where they don't live in an area and they'd be forking out thousands of dollars for this, it's quite silly. And for the people who didn't fair well in grade school with those subjects then the concept of GE is fine, but it negatively impacts and wastes the time of many others who are actually competent in it. We do have to remember, the classes for GE are largely exactly the same ones you are supposed to have taken in grade school, not new subjects you are encountering. \n\nThere are differences between secondary school and university yes, but I disagree about university teaching those subjects to \"another level\". They're still teaching the same subject; it's not like you're taking algebra in secondary school and then you take calculus and onward in university. University doesn't make you more prone to figuring out the right pick for you either. Let's not pretend that people don't change their majors all the time or end up with degrees that are not correlated to the field they're in. Last I checked, according to statistics the majority of graduates have degrees not related to the fields they ended up in, so the idea that university makes students more prone to figuring out what they want to do isn't true. Except for a handful of careers, university doesn't really help you with you be ready to go for your subsequent job. Many employers basically train people on the spot and act as if their employers didn't have a background in the field they're in because of how saturated degrees are and how varying the quality of candidates/employees with the same degrees can be. They don't go into those jobs mostly knowing something and not needing much training. \n\nYou really misunderstood my take on instead of re-taking GE classes, maybe get real-world experience. It very obviously was not indicating to stay in such jobs.",
          "author": "adoreroda",
          "created": 1638131024,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmccn3m": {
      "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmccn3m/",
      "text": "“I’m more well rounded because my underwater basket weaving class, you’ll never know when it will come in handy.”",
      "author": "Spicybooiii",
      "created": 1638061062,
      "upvotes": -4,
      "replies": {}
    },
    "hmckmi4": {
      "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmckmi4/",
      "text": "American education is abysmal and different across every state. Their is a certain degree of knowledge and skills needed by each college in order to qualify as a graduate. There are also accrediting boards that must be met in order for schools to keep accreditation, meaning all GE patterns and major patterns must meet these limits. \n\nBasically it shows that a graduate can at least do the basic work required of them to pass. It's a simple litmus test for future employee that this person isn't a complete incompetent individual when it comes to being a basic employee. They have some math skills, English and writing skills and general understanding of how society works, so your HR department doesn't have to waste time teaching them.",
      "author": "safespace999",
      "created": 1638064840,
      "upvotes": 1,
      "replies": {
        "hmdn9ru": {
          "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmdn9ru/",
          "text": "The theory behind university general education is there, but I feel like it's very misplaced, especially in association with grade schools.\n\nIf grade school quality varies that much and seemingly is unreliable, why make students take the same subjects twice? And not only that pay tens of thousands of dollars to learn the same thing? It's not like it's an entirely different course, like alegbra in grade school and calculus in college; it's copy/paste of the same subject from grade school for the most part, if not pretty much entirely for the curriculum.",
          "author": "adoreroda",
          "created": 1638087103,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmcf2c0": {
      "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmcf2c0/",
      "text": "Yep. My graduation was delayed by a couple semesters because my university required passing math at a certain level, regardless of your major, and I'm terrible at math. I have a degree in English; what the hell did I need trigonometry for?!?",
      "author": "WindamereArtifactor",
      "created": 1638062216,
      "upvotes": -3,
      "replies": {
        "hmdoabs": {
          "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmdoabs/",
          "text": "Reminds me of [this meme](https://img.ifunny.co/images/58a4156d8b33c27340544f30ca70c4ce2252be247a9f3b9e8f739a5522266db8_1.jpg) which is painfully accurate.",
          "author": "adoreroda",
          "created": 1638087912,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hmdxqmo": {
      "link": "/r/college/comments/r3rk6p/is_there_any_reasonable_justification_for_college/hmdxqmo/",
      "text": "I think that it is BS. They are using it as filler to justify the cost of tuition and making more money. Personally, the Gen Ed classes that you take in college are the most basic classes you can take. These are most of the classes that you can take in High School. They want math, sciences, and humanities/social sciences which you probably have taken a bunch of classes in High School. They don’t go in depth but it doesn’t take a college class to have you interested in those disciplines.\n\n\nIt doesn’t make people well rounded or more educated. The classes go into detail about random things you will never need to know. There are so many classes. People take different classes so not everyone has the same amount of knowledge. You’re not missing out on anything when you don’t take gen Ed’s because there are so many classes that you haven’t taken. College would go a lot faster withou gen Eds. Your grades would be better without them because you focus on core classes",
      "author": "nathani3l0g",
      "created": 1638095478,
      "upvotes": -2,
      "replies": {}
    }
  }
}