{
  "sid": "qtgkfa",
  "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/",
  "title:": "Not Doing Anything \"Fun\" in college because I am afraid of government internship opportunities",
  "text": "So I am in the cybersecurity field and I was told at the beginning of the semester not to underage drink because government agencies will not hire you for internships or jobs if you underage drink. I guess I feel like I am missing out of the college experience and I don't know if not underage drinking is worth the possibility of not getting a job in a government agency. \n\n&#x200B;\n\nThank you guys for all your help!",
  "author": "stargaze_1547",
  "created": 1636858929,
  "updated": 1637181967,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.33,
  "comments": {
    "hkjfno9": {
      "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjfno9/",
      "text": "Honestly I think going out and having a good time without documenting anything on your phone & not taking pics with a drink in your hand would be just fine. At the end of the day I think there are very few people who go their entire underage experience without a drink here or there. Just making sure that you don’t post about it anywhere will keep you safe from stuff like that!",
      "author": "GraphicGallery",
      "created": 1636859234,
      "upvotes": 9,
      "replies": {
        "hkjg4dk": {
          "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjg4dk/",
          "text": "My only fear is the lie detector test. One of the seniors was telling us that the first question they were asked was “tell us about all of your underage drinking” experiences",
          "author": "stargaze_1547",
          "created": 1636859460,
          "upvotes": 0,
          "replies": {
            "hkjhl4h": {
              "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjhl4h/",
              "text": "Ahh I didn’t think about that… I guess that doesn’t surprise me that a government agency would ask that of an intern. In my opinion, I personally would not move on with a job if they were that interested in such topics that don’t have any effect on you or your job performance. It would be fine if they were just asking about it, but if you getting the job really boils down to if you were an underage drinker or not, then that is very odd to me. But if that’s the job that you have been working really hard for, I understand how that would be really scary! Although a lot of college parties that I’ve been too haven’t been all that anyways so if it helps, you aren’t missing out on a lot! Finding a close group of friends has helped me stray away from the party life.",
              "author": "GraphicGallery",
              "created": 1636860181,
              "upvotes": 4,
              "replies": {
                "hkjigik": {
                  "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjigik/",
                  "text": "Thank you so much for your thoughts! It really helps!",
                  "author": "stargaze_1547",
                  "created": 1636860603,
                  "upvotes": 2,
                  "replies": {
                    "hkjlyd5": {
                      "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjlyd5/",
                      "text": "They aren’t that concerned about underage drinking. They already know all the answers to what they are asking you about during the lie detector test. If you’re talking about the FBI they’ve also majorly reduced their requirements pertaining to drugs. \n\nPeople who are 100% honest still fail it. It’s more about able being able to stay calm and control your blood pressure during intense questioning/ high stress situations and remaining professional at all times.",
                      "author": "rynpickles",
                      "created": 1636862276,
                      "upvotes": 2,
                      "replies": {
                        "hkjmdzo": {
                          "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjmdzo/",
                          "text": "So you don’t think underage drinking would affect job opportunities?",
                          "author": "stargaze_1547",
                          "created": 1636862490,
                          "upvotes": 1,
                          "replies": {
                            "hkjn2wd": {
                              "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjn2wd/",
                              "text": "I don’t think so. Drinking can be a cultural or religious thing. There’s also some states that will serve alcohol to people 16 and up if they’re with their parents or guardian. \n\nIf you are worried about it, don’t. As long as you’re smart and don’t post it all over your social media, I don’t see why it would be an issue of employment.",
                              "author": "rynpickles",
                              "created": 1636862820,
                              "upvotes": 1,
                              "replies": {}
                            }
                          }
                        }
                      }
                    },
                    "hkjire8": {
                      "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjire8/",
                      "text": "Of course! A lot of my new friends either don’t drink or prefer to hang out at home instead of going out, so that helps a lot too! Making mocktails can be fun too if you’re interested in that. Best wishes!",
                      "author": "GraphicGallery",
                      "created": 1636860742,
                      "upvotes": 1,
                      "replies": {}
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "hkjgqr7": {
      "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjgqr7/",
      "text": "There's other things in college besides partying. You can have a college experience without partying and you can still go out without drinking.\n\nEdit: I went out occasionally Freshman year but after that I matured. I've had a pretty good college experience without drinking.",
      "author": "Nosleep_9764",
      "created": 1636859762,
      "upvotes": 4,
      "replies": {}
    },
    "hkjp9x7": {
      "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjp9x7/",
      "text": "If you’re worried about it, don’t do it. You won’t be under 21 forever, and there are plenty of ways to enjoy yourself without drinking. It’s a shame that people feel like they have to drink to have fun, because there are definitely plenty of ways around that. It can help you loosen up, for sure, but that’s not always a good thing.\n\nHonestly, you can trust yourself not to post pictures, but you can’t trust everyone else. In addition, it would be a shame if you found yourself in a wrong place at the wrong time situation. \n\nThere are a lot of dangers that can come with underage drinking, it really isn’t worth it IMO. You’re worried about missing out on opportunities with government agencies, but you could also impact your entire school career.",
      "author": "mutual-cacophany",
      "created": 1636863869,
      "upvotes": 2,
      "replies": {}
    },
    "hkjocz0": {
      "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkjocz0/",
      "text": "Jobs with security clearances are mostly concerned with whether there's something out there or in your personal life that could be used to blackmail you. They don't care so much about drinking or drug use itself, and in recent years especially have really relaxed the rules around drug use, so even illegal drug use doesn't necessarily disqualify you. I mean if you are a heroin addict that's another story, but drinking now and then is not likely to be a problem (even if it's underage). But don't get black-out drunk regularly and do things you might regret that end up on Instagram.",
      "author": "mmarkDC",
      "created": 1636863436,
      "upvotes": 1,
      "replies": {}
    },
    "hkk4l4d": {
      "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkk4l4d/",
      "text": "You could just go to parties and not drink at them. Depending on the vibe of the party they may still be enjoyable.",
      "author": "ilikecacti2",
      "created": 1636872279,
      "upvotes": 1,
      "replies": {}
    },
    "hkl7d4g": {
      "link": "/r/college/comments/qtgkfa/not_doing_anything_fun_in_college_because_i_am/hkl7d4g/",
      "text": "personally, i’ve only heard of people being rejected from a job if there was videos of them clearly drunk and intoxicated. but i’ve never heard of someone being rejected for an internship just because they drank underage. if there isn’t evidence documenting stupid actions u should be fine.",
      "author": "trackxdreams",
      "created": 1636898721,
      "upvotes": 1,
      "replies": {}
    }
  }
}