{
  "sid": "qhy0t2",
  "link": "/r/college/comments/qhy0t2/hows_everyone_semester_going/",
  "title:": "How's everyone semester going?",
  "text": "Mines like hell. lol. \n\nFirst semester since Fall 2019 that was entirely in person, it feels like they're punishing us for covid or something\n\nLike im getting fed up with classes assigning multiple shit all around the same area.\n\nupper level cs course 1: have a paper on some really obscure programming language, 8-10 pages, + a presentation to class, quiz, HW assignment, oh and develierable one to make a compiler. All of these were due without 1-3 days from each other. This is one class. ONE!\n\nSci class + lab that i'm forced to take\n\nlab: lab on tuesday, lab report due every sunday night(these are easily like 20 pages, quiz also due sunday, poster about some bullshit experiment, due sunday(not every sunday but we've had 4 since august), also have to study for an in class lab practicum 3 times a semester, oh and apparently there's a lab final exam. This is a one credit class\n\nlecture: like lab, quizzes and HW due every sunday, in class work every single time, discussion posts due every sunday.  \n\nupper level cs course 2: The work load for this one is less. We have no quizzes or HW. but we have 4 projects throughout the semester, they're really complicated.\n\nLastly\n\nsenior capstone: have to develop a system using unity VR. I have never touched that ever. Ever. So how do I learn this while doing my other shit classes, while working a part time job. HOW!?\ni'm one semester from graduating with a job offer and i feel like it's all gonna be taken away.",
  "author": "ShinigamiNeo",
  "created": 1635459416,
  "updated": 1635779897,
  "over_18": false,
  "upvotes": 2,
  "upvote_ratio": 1.0,
  "comments": {
    "higgwfl": {
      "link": "/r/college/comments/qhy0t2/hows_everyone_semester_going/higgwfl/",
      "text": "I would talk to your professors about the work overload and mention the other stuff you have to do for your other classes. On top of that, try getting a tutor or going to tutor sessions to keep you up on your homework assignments/labs. As for your senior capstone, talk to your professor for that class and see if you can change that to something more attainable. If you are stuck working on Unity VR, then I would recommend getting advise from your professor, watching YouTube videos, and subbing to unity, gamedev, and etc subreddits to gain an insight on how to approach your design.",
      "author": "angelic_angel5",
      "created": 1635470561,
      "upvotes": 2,
      "replies": {}
    }
  }
}