{
  "sid": "jnz0fb",
  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/",
  "title:": "Professor deducted points for handwriting a homework assignment",
  "text": "I was assigned a homework assignment for one of my computing logic classes. The instructions simply said questions 1-6 on this page of the textbook. There was no rubric or anything. I did the assignment by hand (my handwriting is not messy, so I know legibility is not as issue) and submitted it on time. I spent a lot of time studying for this and I didn’t miss a single question. However, I got a B because the assignment was “unprofessional” for being hand written. This was the first project of the year so there was not an expectation set beforehand in previous assignments. Would it be unreasonable to reach out to the professor and ask if the assignment can be redone (typed out of course)?\n\nEdit: for those of you asking, there is not any mention of formatting in the syllabus or assignment. His message said that it must be done in a word document. I sent him a message stating that I was not aware of this requirement and asked if I could re-do the assignment. I am still waiting on a response.",
  "author": "swisscheesepanini",
  "created": 1604504939,
  "over_18": false,
  "upvotes": 942,
  "upvote_ratio": 0.99,
  "comments": {
    "gb6tutn": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6tutn/",
      "text": "I had a professor tell me that you should always do assignments on the computer, as it's more professional, but if the professor didn't state it as a requirement I don't think he should take off point. You did what you could by asking to redo it, but if your professor is stubborn you may have to take it above him if it really affects your grade.",
      "author": "agentpjr",
      "created": 1604545297,
      "upvotes": 1,
      "replies": {}
    },
    "gb6pols": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6pols/",
      "text": "If its not in the syllabus its unacceptable that he’s now making it a requirement.",
      "author": "deprimada",
      "created": 1604543080,
      "upvotes": 1,
      "replies": {}
    },
    "gb6idi3": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6idi3/",
      "text": "My sense is that you probably should have waited until after your instructor wrote back.  What's the point of posting a half-story?",
      "author": "imjustsayin314",
      "created": 1604539234,
      "upvotes": -1,
      "replies": {}
    },
    "gb6efmd": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6efmd/",
      "text": "Ask him change the grade to a an A. Because  no where did it say in the syllabus that homework has to be done in a word document. \n\nIf he says no, go to the dean.  If he does not get back to you on within a reasonable time frame, go to the dean.  The dean will side with you.",
      "author": "gunzstri",
      "created": 1604537140,
      "upvotes": -1,
      "replies": {
        "gb752qh": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb752qh/",
          "text": "Going to the dean seems excessive... just accept it for what it is after arguing your point and if he doesn’t agree??? Now you know better for next time?",
          "author": "imthedro",
          "created": 1604551799,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gb6daed": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6daed/",
      "text": "Lol, I don't have any advice to add, other than I find this HILARIOUS considering the chemistry professor I had--only a few years ago--insisted all lab reports be turned in hand written because in the \"real world\" computers are not used in the lab. Jokes on her, I now work in a lab that is paperless!",
      "author": "Etarine",
      "created": 1604536539,
      "upvotes": 5,
      "replies": {}
    },
    "gb6af4x": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6af4x/",
      "text": "For anything about computing, a typed up assignment is expected. Sometimes they make an exception, but this is a default.\n\nAs for Discrete mathematics and logic, you may see it as a borderline, but if it's not a situation where you show calculations work, but rather computed work, it should always be typed. Sometimes for concepts like truth tables, this can be annoying. \n\nSometimes it can be a pain, but realistically, no one wants to see a photo or scan of written work unless it specifically needs to be, such as for traditional math, where mandating typed up documents would be absurd if it weren't a project. Projects need to be professional and organized, and tools like Microsoft Word have math functionalities as clunky as they may feel.\n\nBecause it wasn't specified for your situation, your professor should be generous and allow you to type it up. Note they don't want extra things to grade, so they might turn you down. If this was a large portion of your grade, you should consider going higher up if the professor doesn't reason with you.",
      "author": "AzrielK",
      "created": 1604535031,
      "upvotes": 1,
      "replies": {
        "gb6cbnu": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6cbnu/",
          "text": "I don't agree with your first statement.\n\n\nI have definitely turned in hand written homework before when having to draw diagrams and what not.",
          "author": null,
          "created": 1604536031,
          "upvotes": 1,
          "replies": {
            "gb6cjig": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6cjig/",
              "text": "Read my statement more carefully and you see that I said exceptions occur.",
              "author": "AzrielK",
              "created": 1604536143,
              "upvotes": 1,
              "replies": {
                "gb6dpjo": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6dpjo/",
                  "text": "Except that isnt an exception since I have done it at least once for every class that requires me to write stuff for homework",
                  "author": null,
                  "created": 1604536761,
                  "upvotes": 1,
                  "replies": {
                    "gb6dxxg": {
                      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6dxxg/",
                      "text": "It is an exception.\n\nThe fact that they need to specify you need to write it makes it an exception. Otherwise the default is usually typed up.",
                      "author": "AzrielK",
                      "created": 1604536882,
                      "upvotes": 1,
                      "replies": {
                        "gb6edc5": {
                          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6edc5/",
                          "text": "They never specified. They just said do X",
                          "author": null,
                          "created": 1604537106,
                          "upvotes": 0,
                          "replies": {
                            "gb6epl0": {
                              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6epl0/",
                              "text": "How about this.\n\nIf it is an obscure diagram, it could potentially be either but these are college students we are talking about. For example, in one of my classes where we had K-Maps, some students drew it out and others improvised and attempted to draw it out in tables on Word. The end result was still in a word document, and it was busy work, not a complex project.",
                              "author": "AzrielK",
                              "created": 1604537288,
                              "upvotes": 2,
                              "replies": {}
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    },
    "gb65v3u": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb65v3u/",
      "text": "check on the syllabus if it ever said or if he said no handwriting in the class at all.\n\nif he/she had said it for one assignment then its assumed the rest of the class will be that way.\n\nif you truly do not see or heard anything about no handwriting then you should take it up to the prof and ask for some slack",
      "author": "nick256",
      "created": 1604532657,
      "upvotes": 2,
      "replies": {}
    },
    "gb64v6s": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb64v6s/",
      "text": "It’s dumb. If it’s not in any pdf like the actual assignment or syllabus, then I can only assume that he may have mentioned in a lecture. Either way tho, points shouldn’t be deducted. But double check your emails, assignment description, and syllabus",
      "author": "Gaminguitarist",
      "created": 1604532151,
      "upvotes": 2,
      "replies": {}
    },
    "gb604fe": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb604fe/",
      "text": "@swisscheesepanini email your dean explain to them the situation and send them an attached syllabus for the course if your dean doesn’t die anything send them another email stating you will email the department head",
      "author": "funkobop",
      "created": 1604529735,
      "upvotes": 0,
      "replies": {}
    },
    "gb5pm01": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5pm01/",
      "text": "I don’t think it’d be unreasonable. Unless I’m writing an essay, I do any work I can by hand",
      "author": "ChriSayre01",
      "created": 1604524695,
      "upvotes": 1,
      "replies": {}
    },
    "gb5gn0l": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5gn0l/",
      "text": "If this professor won’t let you redo it, I think he’s got personal problems to work out",
      "author": "BillyRayCyrusIII",
      "created": 1604520480,
      "upvotes": 3,
      "replies": {}
    },
    "gb5gksp": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5gksp/",
      "text": "Professor here. You did the right thing by emailing them about it. Something like that should be indicated in the syllabus or instructions. If it's not in the syllabus or instructions then it's not your fault for not knowing. But, keep in mind that in general professors will expect you to type things up. If they don't specify, either ask them or err on the side of caution and type your assignments.",
      "author": "Imtheprofessordammit",
      "created": 1604520452,
      "upvotes": 18,
      "replies": {}
    },
    "gb5esps": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5esps/",
      "text": "It definitely should have said that in the syllabus. If not I would talk to the professor as others have said. I would read the professor though. It may be easier to take the loss. It's not something worth starting off with a bad impression.  For future reference though, I've never had a professor that allowed handwritten assignments, unless it was an in class activity. By rule you should always type it, as he/she is right that it is seen as unprofessional to handwrite anything. I'm surprised they honestly let you do that even in highschool. Mine at least taught me you have to type in college and I graduated HS in 2011....\n\nUse your intuition. Some professors will jump to work with you, and others give no leeway.",
      "author": "kelsybobelsy",
      "created": 1604519612,
      "upvotes": 2,
      "replies": {}
    },
    "gb5ds5p": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5ds5p/",
      "text": "The professor was the one being unprofessional. Instead of communicating with you, they brought your grade down.",
      "author": "Best_Bisexual",
      "created": 1604519146,
      "upvotes": 2,
      "replies": {
        "gb5i00v": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5i00v/",
          "text": "I think it’s silly even to call the student unprofessional. If we were professional we’d be getting paid to type these up.",
          "author": null,
          "created": 1604521118,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "gb5ch5g": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5ch5g/",
      "text": "Personally I just think you should go to whoever is in charge of them because that's not okay",
      "author": "Night99Wing",
      "created": 1604518537,
      "upvotes": 0,
      "replies": {
        "gb5g89l": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5g89l/",
          "text": "Copying my response to someone else in this thread:\n\nProfessor here. Never go to the dean without talking to the professor first. Professors can make mistakes, and some of them can be reasonable in correcting those mistakes. They'll be much less likely to want to help you if you immediately go over their head and bother the dean without talking to them first. Also, the dean will probably tell you to talk to the professor as a first step.",
          "author": "Imtheprofessordammit",
          "created": 1604520288,
          "upvotes": 6,
          "replies": {
            "gb6670v": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6670v/",
              "text": "I came here to say this, but your way is much more polite.\n\nThe default advice in this sub is to go full karen \"ask to speak to their manager.\" What they don't realize is that the associate Dean will just tell you to talk to the professor.  So not only are they back to step one, but all they managed to accomplish was looking like an entitled brat.",
              "author": "raxo06",
              "created": 1604532828,
              "upvotes": 5,
              "replies": {}
            }
          }
        }
      }
    },
    "gb59m07": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb59m07/",
      "text": "I think most university work, if not all, is expected to be submitted in a typed format like APA, MLA, or Turabian; however, your professor should have clearly stated his expectations. If I were in your shoes, I would ask for a rubric before I complete assignments. Hopefully, he will cut you some slack this time because he did not define his expectations!",
      "author": "magnolias4lyfe",
      "created": 1604517181,
      "upvotes": 9,
      "replies": {}
    },
    "gb594hs": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb594hs/",
      "text": "If there’s no rubric or anything in the syllabus that states you can’t hand write things, then I’d definitely email them. It’s not fair that they deducted points without you knowing beforehand that handwriting is something “unprofessional.”",
      "author": "QueenLatifahClone",
      "created": 1604516949,
      "upvotes": 3,
      "replies": {}
    },
    "gb58ot1": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb58ot1/",
      "text": "That’s ridiculous! If u can scan it in there shouldn’t be a problem.... I would take it to the dean.",
      "author": "Hawkbiitt",
      "created": 1604516742,
      "upvotes": -2,
      "replies": {
        "gb5g5st": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5g5st/",
          "text": "Professor here. Never go to the dean without talking to the professor first. Professors can make mistakes, and some of them can be reasonable in correcting those mistakes. They'll be much less likely to want to help you if you immediately go over their head and bother the dean without talking to them first. Also, the dean will probably tell you to talk to the professor as a first step.",
          "author": "Imtheprofessordammit",
          "created": 1604520255,
          "upvotes": 4,
          "replies": {}
        },
        "gb6cia3": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6cia3/",
          "text": "[deleted]",
          "author": null,
          "created": 1604536126,
          "upvotes": 2,
          "replies": {
            "gb6cnfa": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6cnfa/",
              "text": "It’s different because ur paying thousands. U should be heard. Some professors do not care even if u talk with them.",
              "author": "Hawkbiitt",
              "created": 1604536199,
              "upvotes": -2,
              "replies": {
                "gb6hm1h": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6hm1h/",
                  "text": "Yes, some professors don't care even if you talk to them. That's no reason to go to the dean as a first step for any problem you have. The first step should be to go to the professor. If they're actually unreasonable then you can go to the dean. But if they are the reasonable kind of professor then you're essentially getting them in trouble with their boss over nothing. Sometimes they just made a mistake.",
                  "author": "Imtheprofessordammit",
                  "created": 1604538830,
                  "upvotes": 1,
                  "replies": {}
                },
                "gbb6kee": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gbb6kee/",
                  "text": "No, it's not different at all. Your money doesn't entitle you to anything other than a fair opportunity to learn from an expert. That's  it.",
                  "author": "raxo06",
                  "created": 1604635681,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "gb54x3j": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb54x3j/",
      "text": "Definitely check the syllabus first. Read it through and make sure it doesn't have submission guidelines or something like that that prohibits handwritten assignments. If you don't see anything like that, definitely reach out to your teacher. If you do reach out, make sure you are extra professional and concise in your email (since that obviously matters a lot to this professor) and ask if you can re-submit due to the confusion. Whatever you do, don't be rude, even if you are upset.",
      "author": "althyastar",
      "created": 1604514996,
      "upvotes": 3,
      "replies": {}
    },
    "gb51o5v": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb51o5v/",
      "text": "Oh I’d definitely push back. Be your own advocate.",
      "author": null,
      "created": 1604513485,
      "upvotes": 4,
      "replies": {}
    },
    "gb5148h": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5148h/",
      "text": "Op What does your syllabus say? many times professors will place requirements for assignments in the syllabus that are the status quo for the class. However, if the syllabus is silent in that regard I would reach out to the professor and ask/nicely demand your grade to be change as no written instructions exist detailing how the assignment would be done. However, triple check all the resources the class has given out before hand as you want to be sure when confronting the professor and brushing up on the school's policy for grad disputes could come in handy.",
      "author": "Xeracross",
      "created": 1604513228,
      "upvotes": 40,
      "replies": {}
    },
    "gb4w6vx": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4w6vx/",
      "text": "That seems odd to be deducted for something like that. He should have at least said next time don’t do it that way but gave you a fair grade. I would take a look at the syllabus for that class before emailing them because for one of my classes our syllabus actually says something along the lines of not handwriting our things out and uploading a picture of it. I had never seen it in a syllabus before and just thought it was odd. But I would take a look just to see if maybe your syllabus says something similar.",
      "author": "abrumm94",
      "created": 1604510947,
      "upvotes": 124,
      "replies": {
        "gb4wmiu": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4wmiu/",
          "text": "odd if not laid out. not odd to deduct points from assignments if they are not inthe format requested.",
          "author": "zninjamonkey",
          "created": 1604511153,
          "upvotes": 43,
          "replies": {
            "gb50l9i": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb50l9i/",
              "text": "Oh ya I just basically meant like in general I thought a rule like that was odd cus I personally had never seen something like that in one of my syllabi till this semester. Lol but if it’s laid out in the syllabus or in the instructions, that’s another thing. Lol",
              "author": "abrumm94",
              "created": 1604512980,
              "upvotes": 8,
              "replies": {
                "gb53zeg": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb53zeg/",
                  "text": "in general, it's not odd. \n\nthis is similar to other professors detecting points if your citation standards is off or missing.",
                  "author": "zninjamonkey",
                  "created": 1604514560,
                  "upvotes": 0,
                  "replies": {}
                }
              }
            }
          }
        },
        "gb59m5f": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb59m5f/",
          "text": "This was my thought too ... check the syllabus; if there’s no mention of it, then approach him gently to explain your grades are important to you, ask if you can make it up.",
          "author": "inflewants",
          "created": 1604517183,
          "upvotes": 5,
          "replies": {
            "gb5r8yd": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5r8yd/",
              "text": "Ya couldn’t hurt to ask if it’s not in the syllabus if it helps your grade! Lol",
              "author": "abrumm94",
              "created": 1604525457,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "gb4m3nk": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4m3nk/",
      "text": "My discrete math professor wanted all our work done in word. It’s hard to do math in word. The assignments took twice as long just so he wouldn’t be inconvenienced by having to read our handwriting. It’s annoying as heck. \n\nI think he should have told you upfront. Id definitely ask",
      "author": null,
      "created": 1604506217,
      "upvotes": 666,
      "replies": {
        "gb4msd5": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4msd5/",
          "text": "If it has to be word that sucks but for typing math learn LaTex. Makes typing math super easy. It has a steep learning curve but once you get it it’s honestly sometimes faster than handwriting stuff. My linear prof would give us 5 extra hours on homework deadlines if we used latex as a way to encourage us to learn it. Highly recommend.",
          "author": "tintithe26",
          "created": 1604506545,
          "upvotes": 312,
          "replies": {
            "gb4nwrg": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4nwrg/",
              "text": "I’ll have to look that up, thanks",
              "author": null,
              "created": 1604507070,
              "upvotes": 50,
              "replies": {
                "gb52xb3": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb52xb3/",
                  "text": "I'd suggest not to use LaTeX locally and just use it on the web (lookup OverLeaf). It significantly lessen the learning curve.",
                  "author": null,
                  "created": 1604514073,
                  "upvotes": 75,
                  "replies": {
                    "gb54utk": {
                      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb54utk/",
                      "text": "Also, with OverLeaf you'll have all most important packages right away",
                      "author": "CombatWombat994",
                      "created": 1604514966,
                      "upvotes": 30,
                      "replies": {
                        "gb55zla": {
                          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb55zla/",
                          "text": "Yeah I used to do everything on OverLeaf. One day, I decided to use LaTeX locally to enable version control. It took me 1 whole day to get the setup right.",
                          "author": null,
                          "created": 1604515479,
                          "upvotes": 18,
                          "replies": {}
                        }
                      }
                    },
                    "gb55975": {
                      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb55975/",
                      "text": "Yup overleaf is great and there’s ton of resources for “how to put blank in overleaf”",
                      "author": "tintithe26",
                      "created": 1604515146,
                      "upvotes": 6,
                      "replies": {}
                    }
                  }
                },
                "gb65ce3": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb65ce3/",
                  "text": "Easy install is TexMaker and MikTex, which are all you need to get started.",
                  "author": "Florasce",
                  "created": 1604532394,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "gb559ip": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb559ip/",
              "text": "Eh, your mileage may vary. It’s an amazing system, but unless you’re *really* going to use it, the sunk cost isn’t going to be outweighed by the benefits. Not to mention its usefulness has been somewhat overshadowed by the ease of just typing something in say google docs, which has its own (much easier to use) equations feature now. \n\nFor the really complicated stuff though, yeah latex (or really, overleaf) is your best bet.",
              "author": "Xystem4",
              "created": 1604515150,
              "upvotes": 13,
              "replies": {
                "gb562t5": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb562t5/",
                  "text": "I find the equation editors on word/google docs to be very slow especially once get you a lot of them in one doc. Also very limited in terms of doing things like matrix and all",
                  "author": "tintithe26",
                  "created": 1604515520,
                  "upvotes": 9,
                  "replies": {
                    "gb58oxt": {
                      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb58oxt/",
                      "text": "Oh yeah absolutely if you *know* Latex, it’s faster. But if all you need to do is some summations and subscripts, it’s really not worth the learning curve is my point.\n\nAlso, even things with math I’m writing are rarely ever *just* math, and Latex makes writing normal text awful",
                      "author": "Xystem4",
                      "created": 1604516743,
                      "upvotes": 10,
                      "replies": {
                        "gb5aeez": {
                          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5aeez/",
                          "text": "Yeah it def depends on the person and the type of math. Like I would much rather hand write Calc than use latex but for things like linear algebra with a lot of matrix stuff I like latex. Also it’s much more customizable but that’s only useful if you know how to use it or are willing/able to put the time in to learn it",
                          "author": "tintithe26",
                          "created": 1604517554,
                          "upvotes": 4,
                          "replies": {}
                        }
                      }
                    }
                  }
                },
                "gb58ick": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb58ick/",
                  "text": "This is a good point. I felt kinda cool for being able to use it and get a nicely formatted result, but when the fuck would I ever use it other than math homework? Who wants to be good at doing math homework?",
                  "author": null,
                  "created": 1604516656,
                  "upvotes": 4,
                  "replies": {}
                }
              }
            },
            "gb5cjf0": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5cjf0/",
              "text": "Such a good incentive honestly perfect level of fairness",
              "author": "pokemongofanboy",
              "created": 1604518566,
              "upvotes": 1,
              "replies": {}
            },
            "gb5io3f": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5io3f/",
              "text": "> Makes typing math super easy. It has a steep learning curve \n\nYes.  These two points.  They are a non-sequitur.\n\nYou spend almost as much time trying to find the codes/formatting for the symbol you want to insert as you do actually working the math problem.",
              "author": "lupineblue2600",
              "created": 1604521424,
              "upvotes": -2,
              "replies": {
                "gb5l9u3": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5l9u3/",
                  "text": "My experience was the first 2 times I used it was pretty slow. Lots of “how to do subscript in latex” “how to put theta in latex” after that, I only needed to google new stuff (aka the first time I put a matrix) and then I had a running doc of easy to copy shortcuts. Ie a basic matrix: and then the code, all the packets I might need etc. \n\nOnce I got past those first couple assignments it was almost as fast as handwriting it and a lot neater. However; I still do my math on paper. I’ll sketch out all my answer (especially if it’s a proof to plan what theorems or propositions I need) then I type it up.\n\nAlso I like to color code math. Especially doing matrix combinations where I want to keep track of where each term came from and I find it easier to color code in latex rather than writing in colored pen, realizing I made a mistake/used the wrong color and needing to restart. \n\nAlso copy paste. For things like row reduction, copy paste is a huge time saver.",
                  "author": "tintithe26",
                  "created": 1604522645,
                  "upvotes": 6,
                  "replies": {}
                },
                "gb5qkyk": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5qkyk/",
                  "text": "I don't think it's contradictory. It's slower at first, but once you're familiar with it it's a lot more efficient. My handwriting isn't great when I'm writing quickly, so texing is actually faster for me, especially with copy and paste.\n\nFor beginners, detexify can be very helpful. It allows you to freehand a symbol with your cursor and it'll tell you how to tex it.",
                  "author": "owiseone23",
                  "created": 1604525147,
                  "upvotes": 5,
                  "replies": {}
                },
                "gb8xfu8": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb8xfu8/",
                  "text": "A lot of software is like this. Photoshop definitely has a learning curve and it's difficult to fully learn how to use all of its functions but once you have the hang of it, it's the most powerful digital art/photography/non-raster graphics tool out there.",
                  "author": null,
                  "created": 1604597378,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        },
        "gb4nx4z": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4nx4z/",
          "text": "Did he specifically want them done in Word, or just typed?  Calling for a specific OS doesn't fly anymore with Apple and Google Docs.\n\nAnd could you have done it in Excel?",
          "author": "Inactive_Account",
          "created": 1604507074,
          "upvotes": 9,
          "replies": {
            "gb4qt9t": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4qt9t/",
              "text": "There was absolutely no information as to how he wanted the assignment formatted. It simply said do numbers 1-6 from page 39 and submit it by 11:59 Nov 2. It was a combination of short answer questions and flow charts, I’m not sure that doing it in excel would have been efficient.",
              "author": "swisscheesepanini",
              "created": 1604508437,
              "upvotes": 16,
              "replies": {
                "gb4usfi": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4usfi/",
                  "text": "That question was directed to the person above me.  Sorry for the confusion, OP.\n\nFor your case, it seems like it was a learning experience.  No offense, but typing your work out should have been an assumption when you are submitting it digitally.   \n It's just a norm to submit typed work instead of hand written.  It's a B on one assignment, so I'm sure you can make it up.",
                  "author": "Inactive_Account",
                  "created": 1604510286,
                  "upvotes": -9,
                  "replies": {
                    "gb4xiv2": {
                      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4xiv2/",
                      "text": "Its not a norm, literally no professor I have has an issue with hand written assignments unless they explicitly say no.",
                      "author": "heyimbasic",
                      "created": 1604511573,
                      "upvotes": 19,
                      "replies": {}
                    },
                    "gb4zskk": {
                      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4zskk/",
                      "text": "Most of my professors let me take a picture of handwritten work and submit it online. I don’t think what you said is the norm, and they should always be completely clear with students about their expectations.",
                      "author": "nintendollparts",
                      "created": 1604512615,
                      "upvotes": 15,
                      "replies": {}
                    }
                  }
                }
              }
            },
            "gb4wyxh": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4wyxh/",
              "text": "Calling for a specific OS is not easier because Apple and Google Docs can save as .docx. The real issue is compatibility. Previously profs would get sent docs they couldn't open.",
              "author": "bl1y",
              "created": 1604511314,
              "upvotes": 2,
              "replies": {}
            },
            "gb5hqo1": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5hqo1/",
              "text": "In my case he said word, but i assume he would have been okay with other typed out programs as long as the format wasn’t affected.",
              "author": null,
              "created": 1604520998,
              "upvotes": 1,
              "replies": {}
            }
          }
        },
        "gb549zm": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb549zm/",
          "text": "Use ink-to-math in OneNote!",
          "author": "shadowcentaur",
          "created": 1604514696,
          "upvotes": 2,
          "replies": {}
        },
        "gb5fq2l": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5fq2l/",
          "text": "Professor here. Doing math in word sounds hard, but expecting you to turn in only typed assignments is reasonable. Reading handwriting is not just an inconvenience. It adds time to grading. I have over 100 students. If it takes just one minute longer to read each assignment handwritten versus typed, that's over 100 minutes added to grade each assignment. If your math professor has to grade 20 assignments per student with 100 students, that's a minimum of 33 extra hours of grading a semester.",
          "author": "Imtheprofessordammit",
          "created": 1604520046,
          "upvotes": 6,
          "replies": {
            "gb5hfwe": {
              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5hfwe/",
              "text": "Student here, that amounts to a little more than 2 hours a week, which is a conservative estimate of how long that adds to my homework assignment each week. Times that by a hundred students and that’s how many student-hours you’re creating by saving yourself 2 hours a week.",
              "author": null,
              "created": 1604520858,
              "upvotes": 6,
              "replies": {
                "gb5ipyc": {
                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5ipyc/",
                  "text": "I'm not a math professor. I teach English, and for English there's no way that typing adds two hours for students. For most, it should actually make you faster. I can't say how much time it adds for math, so I'll grant that it could add some time. I doubt that it's 2 hours though. 2 hours a week doesn't seem like much until you get a sense of just how much work a professor has to do outside of class each week. For me, I'm grading 4-5 page essays, for over 100 students, times 5 essays a semester. 1 extra minute per student was a conservative estimate. If I had to read handwritten essays it would probably add at least 5 hours of work for me a week, and that's still a conservative estimate.",
                  "author": "Imtheprofessordammit",
                  "created": 1604521449,
                  "upvotes": -6,
                  "replies": {
                    "gb5j9kx": {
                      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5j9kx/",
                      "text": "“ I can't say how much time it adds for math,”\n\nThen this isn’t really your discussion and you don’t need to tell us what you think is a reasonable format for math homework.",
                      "author": null,
                      "created": 1604521703,
                      "upvotes": 12,
                      "replies": {
                        "gb8ae51": {
                          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb8ae51/",
                          "text": "[deleted]",
                          "author": null,
                          "created": 1604586378,
                          "upvotes": 1,
                          "replies": {
                            "gb8w9j2": {
                              "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb8w9j2/",
                              "text": "I’ve yet to have an engineering prof require typed work, and my husband, who has a masters in mech engineering, has one class where it was required. None of the professors I have had that ask for written work has cried about our handwriting, they just take points off if they can’t read it.",
                              "author": null,
                              "created": 1604596855,
                              "upvotes": 1,
                              "replies": {
                                "gb92k6g": {
                                  "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb92k6g/",
                                  "text": "[deleted]",
                                  "author": null,
                                  "created": 1604599641,
                                  "upvotes": 1,
                                  "replies": {
                                    "gb9342m": {
                                      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb9342m/",
                                      "text": "Ok mate, your opinion has been noted. A lot of shit is “not that hard” for people who have been doing it for a lot longer.",
                                      "author": null,
                                      "created": 1604599892,
                                      "upvotes": 1,
                                      "replies": {}
                                    }
                                  }
                                }
                              }
                            }
                          }
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        },
        "gb4x6j5": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4x6j5/",
          "text": "In one of my programming classes we got to do our exams in word and it sucks so bad.",
          "author": "unholymanserpent",
          "created": 1604511415,
          "upvotes": 1,
          "replies": {}
        },
        "gb5j536": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb5j536/",
          "text": "Just do it on Latex. Most can't tell the difference.",
          "author": "themexpride",
          "created": 1604521645,
          "upvotes": 1,
          "replies": {}
        },
        "gb62b0c": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb62b0c/",
          "text": "Just to irk him you should do that thing that makes your handwriting a font. He can't complain then...",
          "author": "Affenballe",
          "created": 1604530816,
          "upvotes": 1,
          "replies": {}
        },
        "gb6gp21": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6gp21/",
          "text": "I turned pro at doing calculations in word, 3 years of chemical engineering and all lab reports had to be done in word with all calculations shown",
          "author": "crystalliite",
          "created": 1604538339,
          "upvotes": 1,
          "replies": {}
        },
        "gb6xn6y": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb6xn6y/",
          "text": "LaTeX is the obvious choice for math. It's the standard in academia.",
          "author": "alannair",
          "created": 1604547346,
          "upvotes": 1,
          "replies": {}
        },
        "gb4vti2": {
          "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4vti2/",
          "text": "We did LaTeX",
          "author": "zninjamonkey",
          "created": 1604510775,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "gb4josr": {
      "link": "/r/college/comments/jnz0fb/professor_deducted_points_for_handwriting_a/gb4josr/",
      "text": "It doesn’t hurt to ask!",
      "author": "whompwhooooomp",
      "created": 1604505060,
      "upvotes": 47,
      "replies": {}
    }
  },
  "updated": 1634055490
}