{
  "sid": "rb4ar8",
  "link": "/r/college/comments/rb4ar8/very_confused_right_now_about_credits/",
  "title:": "Very confused right now about credits",
  "text": "So I have to take a GEOG/GEOS credit. My degree audit says that GEOG 390 would satisfy this credit,  so I took it but I never received this credit. I then asked my advisor about it and he sent me my program sheet where it says that GEOG 390 does not apply but the degree audit (which continues to be updated) still says that GEOG 390 would fulfill the credit. Can I ask my advisor to have the credit fulfilled or is that a dumb question? Or is there someone else that I should email about this?",
  "author": "chameothecham",
  "created": 1638898919,
  "updated": 1639517370,
  "over_18": false,
  "upvotes": 1,
  "upvote_ratio": 1.0,
  "comments": {
    "hnmnw86": {
      "link": "/r/college/comments/rb4ar8/very_confused_right_now_about_credits/hnmnw86/",
      "text": "Yeah, of course it can’t be changed. Talk to your registrar and ask them to help you out. Note, they don’t have to change it - so be nice and respectful.",
      "author": "peakfreak18",
      "created": 1638905963,
      "upvotes": 1,
      "replies": {}
    },
    "hno9x08": {
      "link": "/r/college/comments/rb4ar8/very_confused_right_now_about_credits/hno9x08/",
      "text": "Prof here who also does academic advising. Definitely ask your advisor for clarification, and be specific about where you're finding the conflicting info. Attach the degree sheet or URL if possible.\n\nIf that doesn't clear things up, go to your major's department office and ask if you can talk to the associate chair or whoever deals with degree plans. This isn't going over your advisor's head or anything, it's just trying to find a clear answer. If you were my advisee, this is the next person I'd send you to. The next next step is to ask the dean's office in the college of your major.\n\nEdit: minor clarification",
      "author": "puzzlealbatross",
      "created": 1638932606,
      "upvotes": 1,
      "replies": {}
    }
  }
}