{
  "sid": "rfu1od",
  "link": "/r/college/comments/rfu1od/i_have_recently_joined_a_online_university_and/",
  "title:": "I have recently joined a online university and have been wondering about the apparently huge difference between actual class time for online and regular universities. Is it really such a gigantic difference?",
  "text": "My course has 2 subjects at a time, you study whenever you want. After around a month or two you can do tests and soon after the next 2 subjects are available. This totals 12 subjects per year. \n\nEach subject has 6 classes with a bunch of videos inside, and curious about the difference in class time i added all of them up for my first subject and got less then 10 hours of class. I talked to a friend of mine who is doing regular uni and she gets way way more time for every subject since she goes to the uni and has many classes each day, every day and that totals much more time than what i got for my online uni.\n\nIs there really such a huge disparity in class time? Will i be able to learn as well/the same amount as someone who is taking my course but in a regular university? If the disparity is there, does it matter?\n\nThanks in advance.",
  "author": "Murrayy__",
  "created": 1639440179,
  "updated": 1639516062,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hog3cfk": {
      "link": "/r/college/comments/rfu1od/i_have_recently_joined_a_online_university_and/hog3cfk/",
      "text": "The biggest disparity between an online and traditional uni is how much of the work is offloaded to you to learn on your own. Even in asynchronous classes at a traditional uni, it’s obvious that the online classes require a much higher level of motivation from the student side.\n\nBut that’s fine if you’re dedicated. The real worry you should have at an online-only university is your recruitment prospects. Online-only universities don’t really have great names, save some very few select unis. Lots of em have pretty poor job prospects as a result of little to no name brand recognition.",
      "author": "maora34",
      "created": 1639440614,
      "upvotes": 1,
      "replies": {
        "hog651g": {
          "link": "/r/college/comments/rfu1od/i_have_recently_joined_a_online_university_and/hog651g/",
          "text": "But the available class time disparity is also there no?",
          "author": "Murrayy__",
          "created": 1639442083,
          "upvotes": 1,
          "replies": {
            "hoidpbh": {
              "link": "/r/college/comments/rfu1od/i_have_recently_joined_a_online_university_and/hoidpbh/",
              "text": "You can google this . A 3 credit hour college class in North America means 3 hrs of lecture per week plus 3 x 3 = 9 hrs of reading/ learning/ homework / project work outside of lecture  .\n\nSometimes classes will round up and treat 2.5 hrs as 3 hrs \n\nSo look at the credit hours and then compare",
              "author": "Happywappyx",
              "created": 1639489742,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    },
    "hoiteoj": {
      "link": "/r/college/comments/rfu1od/i_have_recently_joined_a_online_university_and/hoiteoj/",
      "text": "It also depends on which online university you attend. The one I'm enrolled in condenses 15 week college courses into 7.5 week sessions. It's also recommended that we study an average of 18 hrs per week for 3 credit courses, and 24 hours per week for 4 credit courses. Some classes have assignments due once or twice a week, while others have assignments due everyday - there are also courses that require you to meetup on Zoom and/or do labs. On average, per subject, other than assignments, discussion boards, Zoom meetings, labs, etc., I usually have to complete 5 quizzes and 2 exams (one midterm and one final).",
      "author": "WulfieBoi",
      "created": 1639496866,
      "upvotes": 1,
      "replies": {
        "hoji4of": {
          "link": "/r/college/comments/rfu1od/i_have_recently_joined_a_online_university_and/hoji4of/",
          "text": "Wow my university kinda sucks in comparison then lol",
          "author": "Murrayy__",
          "created": 1639506516,
          "upvotes": 1,
          "replies": {}
        }
      }
    }
  }
}