{
  "sid": "qdwdiu",
  "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/",
  "title:": "Are all college English classes like this?",
  "text": "I am a freshman in college, and I absolutely HATE my English class! All of it is asynchronous. We respond to forums in canvas and then the professor just assigns essays without meeting with us or clearly explaining what he wants. After we are done writing the first draft, he meets with us for just thirty minutes and tells us what we did wrong and not how we can fix our mistakes. I don't feel like I am learning anything. I am just constantly being evaluated through the essays. Also, the essay topics suck because he picks topics only he is interested in. I thought in college you read chapter books with a storyline, but in this class, so far, we have read only one heavily informational book about music. I just want to know if this is how English classes are in all colleges or if it is just my college that has the worst English class.",
  "author": "AdventurousLook4921",
  "created": 1634957735,
  "updated": 1635184695,
  "over_18": false,
  "upvotes": 0,
  "upvote_ratio": 0.25,
  "comments": {
    "hhpdyrj": {
      "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/hhpdyrj/",
      "text": "I mean, this sounds pretty normal? It’s an English class… so you really should be only evaluated based on your writing / essays. And the prof can pick the readings they want for a comp class where you’re focused on writing, not reading. Take a lit class if you want to read literature.",
      "author": "boilerlashes",
      "created": 1634960554,
      "upvotes": 4,
      "replies": {
        "hhqt5y5": {
          "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/hhqt5y5/",
          "text": "The worst part about the class is that the professor doesn't teach or instruct properly. He doesn't help much at all. I mean why can't he just meet with us through zoom every class? I have this class twice a week, and he won't even meet at those times. \n\nI know that in an English class you are supposed to be evaluated based on your essays, but I didn't know you were just assigned essays without any explanation from the instructor.",
          "author": "AdventurousLook4921",
          "created": 1634999039,
          "upvotes": 0,
          "replies": {
            "hhqtixq": {
              "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/hhqtixq/",
              "text": "You said it yourself - it’s an asynchronous class. That means no required meeting times and sometimes no face time with the instructor. I guess don’t sign up for an asynchronous class next time if you don’t like that instruction style.",
              "author": "boilerlashes",
              "created": 1634999252,
              "upvotes": 1,
              "replies": {
                "hhriaqc": {
                  "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/hhriaqc/",
                  "text": "It's not meant to be an asynchronous class. The college did not say anything about it being an asynchronous class. He just does not meet with us because he does not want to.",
                  "author": "AdventurousLook4921",
                  "created": 1635011612,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "hhpi0au": {
      "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/hhpi0au/",
      "text": "Honestly I thought online English classes were cake. I would literally start writing the day essays were due, get wine drunk, and end up getting B+’s and A’s",
      "author": "Spicybooiii",
      "created": 1634963020,
      "upvotes": 5,
      "replies": {}
    },
    "hhqoi2z": {
      "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/hhqoi2z/",
      "text": "This was how English 101 was for me. The professor picked the topics. English 102 let us pick our own topic for a research paper and had a presentation as well. I'd say 102 was better and there was more feedback and 1 on 1 professor time. I didn't need to do anything besides these two classes since I'm not an English major. It'll get better when you're done with gen eds.",
      "author": "ComplexPurpose7",
      "created": 1634995945,
      "upvotes": 1,
      "replies": {
        "hhriyw6": {
          "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/hhriyw6/",
          "text": "I hope it gets better. For the first essay, his directions were so unclear that several people (including me) had to redo it. It was quite frustrating.",
          "author": "AdventurousLook4921",
          "created": 1635011918,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "hhtzjw6": {
      "link": "/r/college/comments/qdwdiu/are_all_college_english_classes_like_this/hhtzjw6/",
      "text": "I hate this English 101 class. I do not want to study criminal justice for an entire semester. This is so annoying",
      "author": "TragicalKingdom",
      "created": 1635055914,
      "upvotes": 1,
      "replies": {}
    }
  }
}