{
  "sid": "p536i9",
  "link": "/r/college/comments/p536i9/meeting_people_is_easy/",
  "title:": "Meeting people is easy*",
  "text": "  So, you’ve just arrived at school, live in the dorms, and are having trouble meeting people. Here are some tips!  \n  \n1) Leave your door open. Signals people are welcome to pop in and say \"hi.\"  \n1b) Say \"hi\" to people with their door open. It might be super scary, but come up with an ice breaker like, “Oh, hey, my name is X. Cool poster! I was just wondering if you knew what time food service starts in the morning?” Or… “The wifi is kind of wonky in my room, how has it been for you?”  \n2) Introduce yourself to the neighbors as soon as possible. It will be way more awkward introducing yourself half way through the semester.  \n3) Similar to 1b, compliment people! Especially people you know live near by, but haven’t talked to yet. “Cool pin!” “Where’d you get those shoes?” “I like your hair.” Keep it simple, don’t be creepy.  \n4) If you’re at food service and don’t have anyone to sit with, find another lonely soul and ask if you can sit down! They’re probably in the same boat as you! Ask where they’re from, their major, etc., etc. Ask questions!  \n  \nWho has more to add?  \n  \n*Bonus points if you get the Radiohead reference.",
  "author": "e4e5nf3",
  "created": 1629066266,
  "over_18": false,
  "upvotes": 562,
  "upvote_ratio": 0.99,
  "comments": {
    "h97eyl6": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h97eyl6/",
      "text": "i just moved in but there’s no one on my floor besides one girl and idek what room she is in because i met her last night whir washing my face. i’m so nervous and alone 😭",
      "author": "Euphoric_Clock9394",
      "created": 1629147200,
      "upvotes": 2,
      "replies": {}
    },
    "h96r6u3": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h96r6u3/",
      "text": "Ask people questions about campus even if you already know the answer",
      "author": "Andydovt",
      "created": 1629137788,
      "upvotes": 1,
      "replies": {}
    },
    "h96ogx0": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h96ogx0/",
      "text": "I live off campus, work, and am 25. RIP :(",
      "author": "VoiceofReason541",
      "created": 1629136695,
      "upvotes": 2,
      "replies": {}
    },
    "h96m0al": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h96m0al/",
      "text": "Eat with a new person. Almost nobody will say no to \"hey, can I join you?\"",
      "author": "SamSeebourne",
      "created": 1629135738,
      "upvotes": 5,
      "replies": {}
    },
    "h96kamt": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h96kamt/",
      "text": "Tips for commuters please? :)",
      "author": "kashmiri-chai",
      "created": 1629135079,
      "upvotes": 2,
      "replies": {
        "h96ohw1": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h96ohw1/",
          "text": "We need this!!",
          "author": "VoiceofReason541",
          "created": 1629136706,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h962ndd": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h962ndd/",
      "text": "Haha we weren't allowed to leave doors open because it would drain the electronic door lock batteries 🙃",
      "author": "human-potato_hybrid",
      "created": 1629128231,
      "upvotes": 2,
      "replies": {}
    },
    "h95r2kn": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95r2kn/",
      "text": "i like the idea of leaving your door open. unfortunately, that was against the rules in my dorm, lol.",
      "author": "sleepiestgf",
      "created": 1629123502,
      "upvotes": 2,
      "replies": {}
    },
    "h95n6om": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95n6om/",
      "text": "So I have an issue starting at rule 1:\n\nI do not live in a dorm.",
      "author": "Yori_R6",
      "created": 1629121782,
      "upvotes": 5,
      "replies": {
        "h95tmpw": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95tmpw/",
          "text": "I feel that. I attended community college and socializing is not as simple when people don't live together.\n\nPerhaps set up a sort of \"home base\" on-campus where people can usually find you? Ex: if you like a particular table to study at in a lounge or outside. That can give you a familiar place to claim as your own, and then you can focus on introducing yourself to or complimenting people who also frequent that spot. This should be a place for medium-focusing, or hanging out. If you're desperately trying to cram for something maybe the library or your apartment is a better choice.\n\nAt community college I would often sit outside near a fountain to study or read. The fountain drowned out excess noise, and I was comfortable and near student traffic. If people from class walked by we could exchange hello's or talk shit about homework. People would sometimes stop and ask for directions. It was a comfortable place for me, and I could invite others into it.\n\nAnother thing is to be ALERT when walking between classes. (Maybe stay off your phone while walking?) Glance at the people walking by or sitting down that you pass. If you recognize them AT ALL from class or orientation, stop/approach them and say \"Hi! You look familiar, aren't we in the same class/orientation?\" People might not respond if they are lost in thought, but usually will say hi. Then you can keep it really short, saying \"Well it's nice seeing you! I gotta get to class. See you around!\" If you both want a longer conversation, then great! But these short positive interactions are really helpful for establishing that you as a friendly, welcoming person to talk to.\n\nLastly, if there are any extracurriculars you are interested in, that can be a great way to meet new people. It was crucial for me as a commuter student. Best of luck!",
          "author": "MxWorriedFondant",
          "created": 1629124574,
          "upvotes": 4,
          "replies": {}
        }
      }
    },
    "h95kebb": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95kebb/",
      "text": "I did number 4 a lot when I was a freshman. You’d be surprised how many people would be cool with it and are freshman looking for other people",
      "author": "NoOutlandishness9892",
      "created": 1629120477,
      "upvotes": 4,
      "replies": {}
    },
    "h95evgh": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95evgh/",
      "text": "no thom, meeting people is not eazy",
      "author": "forLovelyDoubts",
      "created": 1629117716,
      "upvotes": 3,
      "replies": {}
    },
    "h95c7rx": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95c7rx/",
      "text": "[deleted]",
      "author": null,
      "created": 1629116241,
      "upvotes": 16,
      "replies": {
        "h962uo3": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h962uo3/",
          "text": "It seems like everyone in my class (sophomore) has a bunch of friends and they just hung out all summer and during our online semester :(",
          "author": "Fubb1",
          "created": 1629128315,
          "upvotes": 4,
          "replies": {
            "h97gjmm": {
              "link": "/r/college/comments/p536i9/meeting_people_is_easy/h97gjmm/",
              "text": "[deleted]",
              "author": null,
              "created": 1629147820,
              "upvotes": 1,
              "replies": {
                "h97ljdg": {
                  "link": "/r/college/comments/p536i9/meeting_people_is_easy/h97ljdg/",
                  "text": "It was more so the fact that I couldn’t financially afford living in an apartment with other friends that sort of bums me out.",
                  "author": "Fubb1",
                  "created": 1629149847,
                  "upvotes": 1,
                  "replies": {}
                }
              }
            }
          }
        }
      }
    },
    "h9530ki": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h9530ki/",
      "text": "I'm okay, how are you?\n\nThanks for asking, thanks for asking\n\nI'm okay, how are you?\n\nI hope you're okay too",
      "author": "Bino221",
      "created": 1629110196,
      "upvotes": 5,
      "replies": {}
    },
    "h94xjdc": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94xjdc/",
      "text": "Incoming freshmen here BUT I’ve used this in HS and various summer camps or whatever—have a pack of gum (a big pack) and offer  gum to someone to start a convo. \n\nDon’t know how effective this will be since Covid is a thing but I’ve never had this fail 😭😭",
      "author": "lolliepopohlollie",
      "created": 1629105758,
      "upvotes": 11,
      "replies": {}
    },
    "h94p019": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94p019/",
      "text": "*gets a restriction order*",
      "author": "numerionegidio",
      "created": 1629098571,
      "upvotes": 3,
      "replies": {
        "h97kkic": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h97kkic/",
          "text": "But but Reddit said",
          "author": "lil-dlope",
          "created": 1629149453,
          "upvotes": 1,
          "replies": {}
        }
      }
    },
    "h94kdt2": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94kdt2/",
      "text": "Yeah I don’t recommend tip 1 only cause you have no idea who might steal from/rob you/try to take your stuff. You meet a lot of good people in college but you can also meet real shitty ones by being too. Heard too many horror stories of this happening, but still be friendly to meet people just be weary.",
      "author": "Lilgibster420",
      "created": 1629095012,
      "upvotes": 14,
      "replies": {
        "h94mgdn": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94mgdn/",
          "text": "[deleted]",
          "author": null,
          "created": 1629096559,
          "upvotes": 24,
          "replies": {
            "h95x66p": {
              "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95x66p/",
              "text": "Yup, agreed. Nobody's going to be leaving their door open when leaving their room.",
              "author": "Defrost_ThenStir",
              "created": 1629126015,
              "upvotes": 4,
              "replies": {}
            }
          }
        }
      }
    },
    "h94cayh": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94cayh/",
      "text": "Also: **make friends in your classes**. It will make the classes so much more enjoyable, and it's also a really great way to meet people, especially in classes that really make you think like philosophy. Just asking \"what do you think about that\" or even \"did that make any sense to you\" can be a great way to get to know someone in class.",
      "author": "og_math_memes",
      "created": 1629089382,
      "upvotes": 46,
      "replies": {
        "h94di7p": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94di7p/",
          "text": "You make a good point. I too agree with your opinion for philosophy. I also think it's a really great way to meet people and discuss things further. I too have to answer mandatory class discussions.",
          "author": "deb_dib",
          "created": 1629090157,
          "upvotes": 14,
          "replies": {}
        }
      }
    },
    "h94a281": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94a281/",
      "text": "Join clubs! even if you end up not liking the club, you will still meet people, even if you don't end up liking the club  you can meet people there, and maybe there's other people  that tried the club on the same night and didn't like it either and then you can converse about that. Or if you do end up really liking the club you now have a friend group and people that are upperclassmen that can help show you the ropes and can help you out!",
      "author": "abby1371",
      "created": 1629088003,
      "upvotes": 26,
      "replies": {
        "h94rn32": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94rn32/",
          "text": "Upvote for clubs. President of a club here and a lot of freshmen and sophomores join and end up making friends that they room with next year or stay friends throughout school. It’s a really easy way to get to know people with a common interest and is can be really fun as well.",
          "author": "GreyStomp",
          "created": 1629100737,
          "upvotes": 11,
          "replies": {}
        }
      }
    },
    "h9420cp": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h9420cp/",
      "text": "Yeah this is good advice but I don't think it's the type of friendship people are craving. In college yeah sure there's tons of people and it's easy to Hi and have random chats.\n\nBut if you want real friends that stick with you until the end, then that's really hard. I found college friends to be very superficial or wanting something in return. Doesn't  mean it can't be done. I consider my 1st year roommate to be a true friend and that's because we were linked with hardships, experiences, and living in tight courtiers. Friendships take time and they are what you put into them.",
      "author": "Silent-Mushroom",
      "created": 1629083473,
      "upvotes": 65,
      "replies": {
        "h94q21n": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h94q21n/",
          "text": "Yeah but those random chats make the days go by, right? Fuck that’s why we have the ability to chat online. They’ll be the ones to get you through what you’re going through *right now*. They may be the reason you get a higher grade, or don’t fail a class.",
          "author": "ATTWL",
          "created": 1629099437,
          "upvotes": 21,
          "replies": {}
        },
        "h95mh0w": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95mh0w/",
          "text": "Yep - making long-term friends takes a long time! So if you’re only 1-2 years in and you feel like you don’t have super close friends, that’s okay. It’s also not going to happen within only a few weeks, so I think freshmen especially have to realise they’re not going to make amazing friends right away and it’s going to feel uncomfortable for a while.\n\nAlso a lot of people want to *have* a super best friend but they don’t want to *be* a super best friend. Friendship is give and take, so if you want to find real friends, you’ve got to give a little to see who’ll give in return. A lot of people will just be fair-weather friends and won’t give you support when you need it, but that’s a risk you have to take if you want to find the real ones. You can’t know who’s who until the test comes.\n\nPlus not everyone has to be a close friend. Acquaintances and fair-weather friends are still good for what they provide.",
          "author": "officially_anxious",
          "created": 1629121458,
          "upvotes": 10,
          "replies": {}
        },
        "h95whs7": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95whs7/",
          "text": "A lot of relationships start with these pleasantries of saying hi and chatting randomly. This post is an important first step to meeting people, but you're right it isn't a guide to finding your kindred spirits.\n\nPersonally, I need friends who can be there for me when they are able, and vice versa. I have never really been able to maintain non-romantic relationships where we deeply rely on each other for more than 6 months (think best friend). So I'm not necessarily looking for a friend to \"stick with me until the end,\" I am looking for friends who can support me now (if they're able), and who I can support now (if I'm able). If our relationship endures, that is awesome! But I know that with my mental health issues I am often not great at keeping in touch. (Ex: I'll go though a depressed/anxious period or my ADHD makes responding to things difficult).\n\nIdk. Maybe it's because it's been 4 years since I graduated highschool, and this is how I have noticed my relationships evolve. People move, change values, grow their family, and change life priorities. I work on building friendships locally, where I am at, that can exist into the future without too much upkeep. Being able to talk to someone I haven't seen in a year and for it to feel like not a day has passed is a beautiful thing for me. College is always going to be weird for friendships. Most of the friends I will make at college will probably move away. So while college is local, those friends will be my priority. When I move elsewhere, my new local friends will probably be my priority.\n\nAnd as others stated, pleasantries, chats, and hello's are really important for mental health and just feeling accepted in a space as a human being. Besties are super important for feeling that your unique self is awesome and accepted, but friendly acquaintances should not be undervalued.",
          "author": "MxWorriedFondant",
          "created": 1629125742,
          "upvotes": 8,
          "replies": {}
        },
        "h98k60s": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h98k60s/",
          "text": "How do you think people meet their “real” friends",
          "author": "Pendragon_____",
          "created": 1629165425,
          "upvotes": 4,
          "replies": {}
        },
        "h96l9wc": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h96l9wc/",
          "text": "It’s all about trial and error. You aren’t going to click with everyone, no one does. But you will have great chemistry with *some* people, and with them the hellos and the pleasantries will develop into lasting and rewarding friendships. You just won’t know who those people are until you meet them, which is why being outgoing and taking the initiative to talk to people is so important",
          "author": "RoyalSloth",
          "created": 1629135454,
          "upvotes": 3,
          "replies": {}
        }
      }
    },
    "h93rniw": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h93rniw/",
      "text": "As a social butterfly who lived at home for some of my adult life and who is about to move to university: definitely say hi if a room door is open! I always keep my bedroom door open if I want to say hi to my siblings. Personally, I plan to keep a comfy chair free from stuff in my room so that people can wander in, sit, and chat if they'd like.\n\nSocializing in a new place can be downright terrifying, whether it is \"I'm new here\" nervousness or ongoing social anxiety. One thing I am doing is mentally preparing myself for this exhaustion/anxiety, by telling myself\n--\"yeah, uni is going to be kind of scary to adjust to. I will have to learn all these new daily patterns, new life and social habits, and I am going to have unfamiliar safe spaces. But! I will be in a beautiful place, exploring a new life, and get to meet a bunch of funky people! And when I get overwhelmed, I can take a nap, walk to the bathroom/water fountain, or sit in the garden/library!\"--\nBasically familiarize yourself with expected stressors, and think of ways to calm down or reduce the stress - remember: good things can also be stressful, and it is okay to recover from exciting things the same way you would recover from unpleasant things. Acknowledging the stress of meeting people (as it presents for you) can help you not get blindsided by those emotions and inner thoughts as much.\n\nPersonally, I am mentally practicing getting OUT of conversations so that when I need to recharge, I can. I LOVE talking with people, but often chat to the point where I am burnt out. So, I am preparing myself to say things like \"I am really glad I got to talk to you! I need to run, but I'll see you around!\" or \"I hate to interrupt our conversation but I am pretty exhausted and have to get going. Good luck on XYZ!\" (1: Compliment conversation/person, 2: say you have to leave, 3: give a cheery farewell)\n\nWell that meandered a lot... Basically, while socializing can be \"simple\" it can also be stressful. Learning how to anticipate and coexist with the stressors you encounter is super helpful!",
      "author": "MxWorriedFondant",
      "created": 1629078259,
      "upvotes": 85,
      "replies": {
        "h93scng": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h93scng/",
          "text": "omg this was such an helpful read and i’ve been expecting the exhaustion and overwhelmingness of meeting and talking to all the new awesome people, but not really knowing how to handle it. thank you",
          "author": "Hot-Recipe1612",
          "created": 1629078606,
          "upvotes": 13,
          "replies": {
            "h95qmz8": {
              "link": "/r/college/comments/p536i9/meeting_people_is_easy/h95qmz8/",
              "text": "So glad I could help! A lot of that advice I got from my therapist for dealing with specific situations exacerbated by my generalized anxiety. If you have time I definitely recommend stopping by your school's counseling department if they have one! Therapy is helpful for 80% of people - regardless of diagnosis. Plus, they might have candy at the front desk...",
              "author": "MxWorriedFondant",
              "created": 1629123314,
              "upvotes": 5,
              "replies": {}
            }
          }
        },
        "h96lb07": {
          "link": "/r/college/comments/p536i9/meeting_people_is_easy/h96lb07/",
          "text": "this is really, REALLY good advice",
          "author": "time-2-sleep",
          "created": 1629135466,
          "upvotes": 2,
          "replies": {}
        }
      }
    },
    "h93ppyk": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h93ppyk/",
      "text": "Man I’ll always regret not living in dorms",
      "author": "kapbear",
      "created": 1629077302,
      "upvotes": 33,
      "replies": {}
    },
    "h93c6kx": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h93c6kx/",
      "text": "[removed]",
      "author": null,
      "created": 1629070654,
      "upvotes": 1,
      "replies": {}
    },
    "h934kvx": {
      "link": "/r/college/comments/p536i9/meeting_people_is_easy/h934kvx/",
      "text": "Great tips! Another good tip might be to go walk around with your roommate if you're nervous about approaching people. It's comforting to have someone in the same boat with you!",
      "author": "wistful_eunoia",
      "created": 1629067048,
      "upvotes": 136,
      "replies": {}
    }
  },
  "updated": 1634056722
}