{
  "sid": "quzygl",
  "link": "/r/college/comments/quzygl/should_i_double_major/",
  "title:": "Should I double major?",
  "text": "I am currently a sophomore in college majoring in Political Science. I recently took a Geography class and fell in love with the material, do you think it would be a good idea to double major in these? I think that the two could work together well and even if I were to just go into GIS or something my degree is still good just for geography if I wanted to right?",
  "author": "statenand_",
  "created": 1637038700,
  "updated": 1637181435,
  "over_18": false,
  "upvotes": 3,
  "upvote_ratio": 1.0,
  "comments": {
    "hktku9a": {
      "link": "/r/college/comments/quzygl/should_i_double_major/hktku9a/",
      "text": "I don't know if the 2 majors would work well together as in I can't really think of any job where you'd use both of those degrees. However, you found something you love. That will never not be worth pursuing. \n\nDo it! Don't pass up a passion! Even if you decide it really isn't for you later, you love it now and will have gained knowledge because of it. You should absolutely double major if it's financially reasonable for you to do so.",
      "author": "Comipa47",
      "created": 1637041723,
      "upvotes": 1,
      "replies": {
        "hkup29v": {
          "link": "/r/college/comments/quzygl/should_i_double_major/hkup29v/",
          "text": "There's a lot of government work related to both physical and human geography. It could be a great combination.",
          "author": "ResidentNo11",
          "created": 1637070465,
          "upvotes": 2,
          "replies": {
            "hkv0u5t": {
              "link": "/r/college/comments/quzygl/should_i_double_major/hkv0u5t/",
              "text": "i was thinking a lot of public policy includes like sustainability/geography due to climate change is where i was kind of heading.",
              "author": "statenand_",
              "created": 1637075829,
              "upvotes": 1,
              "replies": {}
            }
          }
        }
      }
    }
  }
}